{"songs": [{"title": "The Convo", "album": "It’s Dark and Hell is Hot", "year": "1998-05-19", "lyrics": "[Verse 1: DMX & DMX as God]\nYou tell me that there's love here, but to me it's blatant\nThat with all the blood here, I'm dealin' with Satan\nPlus with all the hatin', it's hard to keep peace (uh huh)\nThou shall not steal, but I will to eat\nI tried doin' good, but good's not too good for me\nMisunderstood, why you chose the hood for me?\nMe? I'm aight; I just had to work hard at it\nWent to grandma for the answer and she told me that God had it\nSo now here I am, confused and full of questions\nAm I born to lose or is this just a lesson?\nAnd who is gon' choose when it gets turned around?\nAnd will it be laying in my own blood and on the ground?\nMy child, I've watched you grow up and I've been there\nEven at those times you least suspected it, I was there\nAnd look at what I've given you - a talent to rhyme\nI may not come when you call, but I'm always on time\n\n[Chorus]\nSomebody's knockin'\nShould I let 'em in\nLord, we're just startin'\nBut where will it end\nSomebody's knockin'\nShould I let 'em in\nLord, we're just startin'\nBut where will it end\n\n[Verse 2: DMX & DMX as God]\nBut when the funds are low, the guns'll blow\nLookin' for that one that owe, make 'em run that dough\nNo! Put down the guns and write a new rhyme\nYou'll get it all in due time, you'll do fine, just have faith 'cause you mine\nAnd when you shine, it's gon' be a sight to behold\nSo don't fight to be old or lose sight when it's cold\nSee that light down the road? It's gon' to guide you there\nTwo sets of footprints; I was right beside you there\nBut what about them times I only saw one?\nThose were the times when I was under the gun, It was then I carried you my son\nLed you to safety, it just wasn't your time to face me (uh huh)\nAyo, a few of them times I thought you would erase me\nWhen all you did was embrace me, prepared me for the worst\nOffered me eternal life and scared me with the hearse\nAnd the curse turned to grace when the hurt turned to faith\nNo more runnin' or slidin' in the dirt, 'cause I'm safe\n\n[Chorus]\nSomebody's knockin'\nShould I let 'em in\nLord we're just startin'\nBut where will it end\nSomebody's knockin'\nShould I let 'em in\n\n[Verse 3]\nSo if I'm your man, I'm in your hands, what's your plan?\nNever had a friend 'cause you couldn't trust your man\nLearned to stand before I crawled, things were twisted\nAnd if you showed me anything at all, then I missed it\nLooked the wrong way, I've done some wrong things\nKept a bad attitude, but that's what wrong brings\nAnd now you mean to tell me that after all this time\nIt was you that kept the dog from goin' out of my mind?\nIt was you that breathed life into my lungs when I was born?\nAnd it was you that let me know what was right from what was wrong?\nAnd it was you that let me do, what I knew what could be done?\nAnd it was you that gave me a good wife and a beautiful son?\nAnd it's been you speakin' to me inside my mind?\nAnd it's been you who has forgiven time after time?\nIt was you who opened my eyes so I could see?\nAnd it was you that shined your light on me?", "image": "https://images.genius.com/8314b41ccd0d9cc7825bc168024bdec2.630x630x1.jpg"}], "artist": "DMX"}