{"songs": [{"title": "Dirty and Stinkin’", "album": "The Trials & Tribulations of Russell Jones", "year": "2002-03-19", "lyrics": "[Intro: O.D.B/Violent J/Female]\nYa'll know how I get down..Ya know what I'm sayin'\n(Dirty) Detroit (Dirty) What..Brooklyn..Zoo (Dirty) Yeah..What (Dirty)\nInsane Clown Posse and O.D.B\n(I got O.D.B and I got) platinum baby what\n(I ain't goin' nowhere until I'm Dirty and Stinkin')\n\n[Verse 1: Ol' Dirty Bastard]\nYeah, There's a quarter and it's Dirty and Stinkin'\nFunkier than Peppy Le'Pue so I was thinkin'\nAbout (What) droppin' this single on the charts (Yeah)\nLet'n you know hey the kid has heart\nI never deny myself, it's when you dope\nBut in my last jam, slept on my notes\nYou thought that I was weak, Huh let me speak\nMy rhymes come funkier than your grandfather's feet\n(Dirty) So listen hear mister don't you ever forget\nThe rhym'n Dirty, you couldn't even clean if you commit\nOr even boring, some try ajax, only mess with the best, 48 tracks (Yo)\nI get down with the ason sound\nLyrics that be flowin' from miles! around\nSo let the music shut yo' ass up\nAnd throw the upper cut that will make you fall onto yo butt\n\n[Hook: Female Singer]\nI wanna get Dirty and I (Dirty) wanna get Stinky\nAnd I (Stinky) ain't goin nowhere till I get\n(Till I) get Dirty and Stinkin'\n(It's Dirty and It's Stinkin')\nI got O.D.B. and I got I.C.P\nAnd I ain't goin' nowhere until I'm Dirty and Stinkin'\n(It's Dirty and It's Stinkin')\n\n[Verse 2: Ol' Dirty Bastard]\n(Dirty) Let me continue, verse number 2\nStyle is wild dirty stinky like doo doo\n(Get Dirty) If you hangin' around\nHen change yo' mind, It is a bad influence, Yo it's my rhyme\nI sit down and I say to myself\nSelf, Yo are you rated top joe\nI drop a single for ya to get a dose of\nAs I lay back like a pillow on the sofa\nYou get paid (Yeah right) Bully, Fly\nAskin B.G. wha wha wha wha you know me\n(Dirty) Sweet as a hunny bee, taste like a 40\nTick you like oohhwee\nWant to drink old english so I speak old english\nYa gotta be dirty and stinkin'\nAnd if it's not, well I guess I'm not\nThe ASON in my butt , It's Dirty and It's Stinkin'\n\n[Hook: Female Singer]\nI wanna get Dirty and I wanna get Stinky\nAnd I ain't goin nowhere till I\n(Nowhere, Nowhere) get Dirty and Stinkin'\n(It's Dirty and It's Stinkin')\nI got O.D.B. and I got I.C.P and I\n(What) ain't goin' nowhere until I'm (Yeah Yeah)\nDirty and Stinkin'\n\n[Violent J]\nO.Deezy. Beezy and I.C.Peezy\nTogether on this track forever\n\n[Verse 3: Shaggy 2 Dope]\nSell me, I know my funk be kickin'\nTurnin' heads like an 8 foot tropical mud chicken\nThey fear these juggalo flows\nI'm (Dirty) dirty like Osama Bin Laden's toes\nI got hatchet love, it decayed in the barn\nChicken chain saw hard\nI'm making neighbors uncomfortable\n(I wanna get Dirty and) and Take me home and it's late\nDon't worry bout the ring in ya tub\nIt's the clown paint\n\n[Verse 4: Violent J]\nI.C.P. and O.Dizzle wildin\nWorkin' like a fat chicks feet at Kings Island\nA whole Source 9 mics, I don't care\nI'm a 10 year vet 5 plaque rat millionaire (Yeah)\n\n[Hook: Female Singer]\nI wanna get Dirty and I wanna get Stinky\nAnd I ain't goin nowhere till I get\n(Till I) get Dirty and Stinkin' (It's Dirty and It's Stinkin')\nI got O.D.B. and I got I.C.P\nAnd I ain't goin' nowhere until I'm Dirty and Stinkin'\n\nOh Oh...Oh..Dirty..Oh...and Stinky....\n(I) (I) (Stinky, Stinky)...(It's Dirty and It's Stinkin')\n\nOh\nDamica (What I)\nI.C.P\nO.D.B\n\n(Dirty) (Dirty) (Dirty) (Dirty)", "image": "https://images.genius.com/8aae5961ee3d6894e7d2abaab7f8fc11.772x768x1.jpg"}], "artist": "Ol’ Dirty Bastard"}