{"songs": [{"title": "P&P", "album": "Kendrick Lamar EP", "year": "2009-12-31", "lyrics": "[Produced by King Blue]\n\n[Intro]\nOh what up, ho? Oh, what up?\nI said oh, what up, ho? Oh, what up?\nI said oh, what up, ho? Oh, what up?\nWell, alright\n\n[Chorus: Kendrick Lamar]\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice\n\n[Verse 1: Kendrick Lamar]\nWelcome to my diary, stressing got me gray hairs\nSomething to inspire me, rather than society's\nWoes, let me go, let me shine a lil' bit love\nI want diamonds too, Ronnie on Player's Club\nI used to have a 9 to 5, fresh out of school that was '05\nThat bitch was racist, got me fired, ever since then I had no job\nPushing in my mama van, stop for gas on Rosecrans\nTrust me these niggas rushed me for something my cousin probably did\nGuilty by association story of my life, nigga\nYou gone make me flip then split your shit, judge give me life, nigga\nPain since my grandma's death, uncle killed at Louis's Burgers\nHold my tears I tried my best, let it go drench my pullover\nCycles of a starving artist tryna go beyond the margin's margin\nMaintaining my modest, modest as I dream\nSo while I go through all this, all this bullshit what you call it\nLife itself I know it helps let me scroll through my Blackberry\n\n[Chorus: Kendrick Lamar]\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice\n\n[Verse 2: Kendrick Lamar]\nI said keep reading my diary, when my life's entirely\nSurrounded by the irony of living in the city\nI said they wouldn't hire me, I said I got my ass beat\nAnd the only thing can help is ass and some titties\nSo what's up, baby? I said what's up?\nI had a long day and I really wanna fuck\nSee I ain't tryna think about no phone bills\nCredit card late fees, Capital One popping up on my caller ID\nPawning my chain in the shop, watching for hollow-tip shots\nWatching my vehicle break down on another man's block\nMan that's my worst fear, ain't that your worst fear\nYou know when your transmission go out and can't switch gears\nOr run through a pothole at two in the morning\nScared to hit your emergencies cause then they'll be on it\nSee I know when the harsh reality take its toll\nOpen up your contacts then scroll\n\n[Chorus: Kendrick Lamar]\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice\n\n[Verse 3: Ab-Soul]\nWelcome to my diary, hmm.. where should I begin?\nFinna get a Swisher and fill it with at least a gram\nCrackers watch my every step, better yet they work my every nerve\nCutting me this worthless check, the concept is so absurd\nLike a church in debt, a turtle in a turtle neck\nConvertibles with turbojets, fueled by 7-Up and prometh'\nI feel like deaths around the corner like the quickest wide receiver\nSo I took another shot, Tequila hit me like a nina\nMy sky's gray, my bitches brighter\nAlways saying lights please, J. Cole's her ghost writer\nAnd I'm the God MC, join my diocese\nFree your mind, don't mind society\nAnd finally, everyone got their own problems\nEverything is subject to change like broken dollars\nI'ma drown in my drink and swim in my woman's vagina\nLike a piranha fin, it gets harder than Rihanna when\n\n[Chorus: Kendrick Lamar]\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice\nI'm going through something with life\nBut pussy and Patron will make you feel alright\nPussy and Patron make you feel alright\nPussy and Patron, that's some great advice", "image": "https://images.genius.com/de49545ec6453e829bb3ff6d34d088db.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}