{"songs": [{"title": "They Want War (Ja Rule Diss)", "album": null, "year": null, "lyrics": "[DMX]\nUh, uh, uh, uh, uh\nUUUUHHHHHHHHHH!!!!!!!\n\n[Hook: 2x]\nThey want war\nRide Out!\nThey want war\nRide out!\nThey want war (What)\nBut you really don't know what you asking for (Come on)\n\n[DMX]\nYo, you remember the first time we rocked sound stage\nWhen the world was ready to let the dog out the cage?\nCovered the whole crowd rocking from here to there\nAll you said was \"throw your hands in the air!\"\nYou'se a hype man nigga (What) I started you dude\nYou have bitches part of your crew that's harder than you\nLet me tell you what niggas in jail say across that table\nThat you are the cutest bitch on your label\nOnly records you got are the ones you signing on (la la la)\nNever been to jail, never had a block you were slanging on\nWe all rode with killers just think\nBut you, come on dog, the only thing you murdered was inc\nYou got to watch the shit you say to niggas\nSitting over there smiling, but pussy, I don't play with niggas\nI'm about to make you a fucking believer\nNext time send your man in your place cause I don't battle divas\n\n[Hook 2x]\n\nTime's up! What the fuck? That's the verdict\nCats spit some weak shit, dog done heard it\nThat's the best you can come up with? Fucking faggot\nI'ma bout to run up quick, run up cliques (click, boom)\nAll you cats do is talk trash\nAnd I got 50 that says Alicia Keys will bust your ass\nWhat you about a buck 5? Buck 6?\nI'm coming right for you nigga, can't duck this\nMe jealous for what? You don't even know\nThe way you be running around dancing in bitches videos\nYou're embarrassing me junior, I loved you like a son\nYou been on my dick since \"4, 3, 2, 1\"\nHow the fuck you supposed to be the head of your crew\nWhen everybody with you flow better than you?\nYou do it like this, since you gotta have dick to swing on\nI got a blazing R&B joint you can sing on\n\n[Hook: 2x]\n\nCome on, come on\nUh, uh\nWhat the fuck is wrong with this nigga man?\nFuck, don't he know?\nDoesn't he fucking know?\nWe gon find out today\nArf, arf, arf, arf, arf, arf", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}