{"songs": [{"title": "Really Be (Smokin N Drinkin)", "album": "My Krazy Life", "year": "2014-03-18", "lyrics": "[Verse 1: YG]\nI woke up this morning, I had a boner\nI went to sleep last night with no bitch, nigga, I was a loner\nI be goin' through shit, losin' bitches and homies\nIf I don't make it with this rap shit, nigga, I might be homeless\nMy moms don't got a job, my pop's checks ain't enough\nIf ain't bringin' home that money, my whole family is fucked\nThat's why I move like the mob, I'm watchin' movies too much\nIf niggas wanted you dead, what would you suggest?\nThey wonder why I do drugs and hang with thugs\nSince I made it, the city hated, wait, where is the love?\nI ride around with my gun, this is not for fun\nI stay protected 'cause my homie just took one to the lung\nHad him on life support, with his family support\nHe knew who shot him but he ain't even show up in court\nYeah, that's a real G, nigga, he on a kill spree, nigga\nThe homie popped him so I hope he don't kill me, nigga\n\n[Hook: YG]\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nI be goin through some things, you don't know what I be thinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nI be goin through some things, you don't know what I be thinkin'\n\n[Verse 2: YG]\nNow I'm ridin' through traffic, with 2Pac blastin'\nWith a bitch that's irritatin' from all these questions she askin'\nLike what bitches I fucked, when, how and where?\nYou ain't my main bitch so why the fuck do you care?\nThat's why bitches get fucked then turn around and get left\nSomebody need to teach them \"less talk, more sex\"\nI'm pressed when I'm stressed, my granny tell me I'm blessed\nWell, why the fuck do Jesus Christ got me goin' through this shit?\nEverybody need favors, what happen if I go broke?\nOr say I ain't got it and buy my lolo some spokes\nRight up in your face, said \"I'll fuck you up like some mace\"\nSo fuck your handout, give a young nigga some space\nGive a nigga some Ace, give me a blunt that's laced\nSprinkle some molly in it, watch me take this shit to my face\nThe snitch is the shooter, they took time away from his case\nHoly shit, oh, lord, where is the world today?!\n\n[Hook: YG]\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nI be goin through some things, you don't know what I be thinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nI be goin through some things, you don't know what I be thinkin'\n\n[Verse 3: Kendrick Lamar]\nI swear this industry shit, to me, is one big-ass lick\nI walk inside of a buildin', tell the A&R nigga \"strip\"\nTell 'em I need all of my chips, my life been on Section 8\nI've been a welfare case, AFDC pump fake\nMeanwhile, I'm grindin' 'cause drug money ain't like rap money\nFour white kilo, snow-bunny, equal one whole show, dummy\nI'm on this tour bus and I'm fucked up\nI got a bad call, they killed Braze\nThey killed Chad, my big homie Pup\nPuppy eyes on my face, bruh\nAnd I really be drinkin', why the fuck I really been smokin'?\nWhat the fuck? I'm the sober one\nMan, I'm so stressed out, I can't focus\nHide out when I ride out, ski mask with the eyes out\nSpeed past in the Cutlass, me and little Ocho\nEvery young nigga hop out\nTwo tears in a bucket, I feel like \"fuck it\"\nThe price of fame, recognize my pain, it's all I know\nAll out war but I'm out here though\nCall my troops like, \"vamonos\"\nI'm on this tour bus and I'm fucked up\nI got a bad call, and it's all bad\nOff a OG with my OG and some OE by the tall glass\n\n[Break]\n\n[Hook: YG]\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nI be goin through some things, you don't know what I be thinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nThat's why I really be smokin' and I really be drinkin'\nI be goin through some things, you don't know what I be thinkin'\n\n[Outro]\nWhat's happenin', nigga?\nSaid nigga got this joint, nigga gon' get somethin' real, real nice, like\nYou gotta stop playin' me with that bullshit\nNah, I'm serious though, like, already checked it out, feel me?\nMan, look, check this out, homie, I'm with the shits, man, you already know, what's happenin', what you tryna do?\nMan, nigga tryna get paid, like, is you serious or is you playin'?\nNigga, is you serious, nigga? What's up, nigga? You know where I live at, nigga\nNigga I'm done straight 'bout to pull up, though, nigga, for sure, I'll holler\nAight, hold on, though\nMy nigga, this shit cool? You ain't tryna, you feel me, like?\nLike, what's up, nigga?\nNah, you my nigga, cuz!", "image": "https://images.genius.com/ba2a73211e21ff3e11eba91f3f156e9d.1000x1000x1.jpg"}], "artist": "YG"}