{"songs": [{"title": "False Advertisement", "album": null, "year": "2016-08-26", "lyrics": "[Verse 1]\nPlease tell me what the fuck is wrong with these bitches\nI'ma tell you right now you ain't worth shit\nAll you do is sit at home takin' selfies\nAnd post them like it was your work shift\nYour 'gram is full of all these evil memes\nTo niggas lie you don't deserve it\nThat's why niggas ain't fuckin' with you\n'Cause we see that you don't have a purpose\nIt's clear that you don't leave the house\nWe date you and don't be aroused\nOnly pleasure that we ever do get from you\nIs when you shut up and open your mouth\nDon't you get it stupid bitch it don't matter\nIf you love a man and you holdin' him down\n'Cause once he find out that you got nothing better to\nDo except him he won't be around\nY'all like \"I want to be treated like I'm a queen\"\nBitch better act like one\nGirl I got so much to give you\nIf you ain't givin' back it's a wrap, I'm done\nYou want a real man, a real boss\nSo you can live life in a Kodak frame\nA real man carry a lot of shit on his shoulder\nWe need a real woman who can hold that weight\nLet me guess you a real woman, right?\nNope don't want to hear that\nSo go cry some tears in your tear bag\nBitch you don't have a car, a job\nA life or a fuckin' career path\nThere's no accomplishments\nI'm serious bitch stop this shit\nYou can fool niggas with pics lookin' like you a queen\nBut in real life I know you the opposite\n\n[Pre-Hook]\nBitch I can see what you tryna do\nYou got niggas outside in a line for you\nFor that pussy they'll spend it all for you\nThey got so much they can offer you\nAnd you lovin' it, you strategizing\nFalse advertising, god damn you lovin' it\nBut I ain't cho mans\nHoe, shut the fuck up!\n\n[Hook]\nNigga these hoes better quit it\nNigga these hoes better quit it (quit it, quit it)\nNigga these hoes better quit it\nDamn hoe shut the fuck up\nNigga these hoes better quit it\nNigga these hoes better quit it (quit it, quit it)\nNigga these hoes better quit it\nDamn hoe shut the fuck up\n\n[Post-Hook]\nNigga these hoes better quit\nNigga these hoes better quit (quit, quit)\nNigga these hoes better quit\nDamn hoe shut the fuck up\nNigga these hoes better quit\nNigga these hoes better quit (quit, quit)\nNigga these hoes better quit\nDamn hoe shut the fuck up\n\n[Verse 2]\nGirl why you lyin' to niggas?\nActin' as if your life isn't boring\nYes the pussy was good but that is the\nOnly highlight of your story\nYou got these celebrities in your DMs\nAnd you get invited to parties (nice)\nBetter enjoy it you bitch 'cause all of your\nLooks gonna die when you forty\nLook at your shit all the guys are absorbing\nHoe I'm talkin' don't try and ignore me\nOh that's your new BMW, right?\nI got a couple 'cause I can afford these\nYou made a hustle off of guys who are horny\nGucci purses, vacations in Fiji\nTrynna date you is easy\nThey just slide you some cash you just lay on the weewee\nWhat the fuck do you stand for?\nEveryday you actin' like a damn whore\nYou be showin' your ass on the dance floor\nNiggas throwin' money till their hands sore\nNow you handed it all to your landlord\nYou just hopin' you don't get evicted\nI coulda sworn you were livin' way better than this\nYou just got so many gimmicks (yikes)\nI don't get how it don't bother you\nWho is the father who fathered you?\nBitch need a belt to that ass\nIf I was yo daddy that's probably what I would do\nThis goes out to all these wanna be models\nWho flashin' titties just to get a like\nJust take this advice: you pathetic, go get a life\nYou want dough you ain't gettin' mine\n\n[Pre-Hook]\nBitch I can see what you tryna do\nYou got niggas outside in a line for you\nFor that pussy they'll spend it all for you\nThey got so much they can offer you\nAnd you lovin' it, you strategizing\nFalse advertising, god damn you lovin' it\nBut I ain't cho mans\nHoe, shut the fuck up!\n\n[Hook]\nNigga these hoes better quit it\nNigga these hoes better quit it (quit it, quit it)\nNigga these hoes better quit it\nDamn hoe shut the fuck up\nNigga these hoes better quit it\nNigga these hoes better quit it (quit it, quit it)\nNigga these hoes better quit it\nDamn hoe shut the fuck up\n\n[Post-Hook]\nNigga these hoes better quit\nNigga these hoes better quit (quit, quit)\nNigga these hoes better quit\nDamn hoe shut the fuck up\nNigga these hoes better quit\nNigga these hoes better quit (quit, quit)\nNigga these hoes better quit\nDamn hoe shut the fuck up\n\n[Outro]\nTrippin' Trip Trippin'\nThese hoes trippin' trippin'\nThis bitch trynna plot on a nigga uh uh\nWon't catch me slippin' (won't catch me slippin')\nTrippin' Trip Trippin'\nThese hoes trippin' trippin'\nThis bitch trynna apply to a nigga uh uh\nWon't catch me slippin' (won't catch me slippin')", "image": "https://images.genius.com/1b506f48edc0fd20d6dd54a4c923b77f.1000x1000x1.jpg"}], "artist": "Hopsin"}