{"songs": [{"title": "The Heart Pt. 2", "album": "Overly Dedicated", "year": "2010-09-14", "lyrics": "[Produced by The Roots]\n\n[Skit: Dash Snow & Daniel Joseph]\n\"I’ll tell you what I don’t believe in, can I do that? All right, I don’t believe in laws, or the system by any means, whatsoever. I try not to obey them at anytime. That's what I believe in not believing in.\"\n\"So what keeps you alive?\"\n\"Four big bottles of water a day, two packs of Marlboro Reds. And, uh, I don’t - what keeps me alive, shit. Music, I have to listen to music all day long. I'd say that keeps me going. I’m a pretty dark person, I’ve thought about ending it a million times. And I have to say that music keeps me here, by far, the main thing.\"\n\n[Verse: Kendrick Lamar]\nThank you\nSitting in the studio thinking about which mood would go\nRight now, freestyle or write down, whatever\nIt still'll come up clever\nI just need to free my thoughts, and Lord knows that I know better\nBut I ain't perfect, I ain't seen too many churches\nOr know them testament verses\nYou should either hear me now or go deaf\nOr end up dead, die trying and know death\nMight end up dead, swallow blood, swallow my breath\nFuck a funeral, just make sure you pay my music respect, nigga\nI mean that from the bottom of my heart\nYou see my art is all I have\nAnd victory tastes sweet, even when the enemy can throw salt\nStill knock them out the park like a fucking tow car\nLet bygones be bygones, but where I'm from\nWe buy guns and more guns to give to the young\nI'm living the life of a nigga trapped, nigga\nInside the system all you envision is trap niggas\nMy uncle doing life inside prison; he wasn't wrapped too tight\nHe told me \"Rap about life, not rap niggas\"\nThat's why I'm shaking my head when you rap-dissin'\nMy stomach start turning, my nerves get to twitching\nI start evaluating, then my final intuition\nIs that you wishing a come up, would just come up\nWe used to beefing over turf, fuck beefing over a verse\nNiggas dying, motherfuck a double entendre\nAnd this is Comp-ton, lions in the land of the triumph\nWrap-Saran our defiance, ban our alliance\nPut burners in the hands of the black man\nOne hood with 20 four-fours like a cloned Kobe Bryant\nYou probably heard I wanna be heard and wonder who I am\nYou probably even listen to Faith, and think I know Zion\nBut really I'm just caught in the loop, of understanding the truth\nBecause it seem like it's always clashing with science\nI got a big fear of flying\nMy future so bright I'd probably go blind before I blink twice\nI ain't lying\nI swear to God, half of y'all just don't know Kendrick\nThe school of hard knocks, we was the first ones in attendance\nYou walking down the block, he got shot, you are no eye witness\nYou just mind your business\nYou just turn your head, kneel down and then tie your tennis\nIt's kind of scary, ain't it?\nYou can't act like no bitch, that only got Tyler Perry famous\nJust let me explain this, why you pick up that stainless\n'Cause your pops wasn't anxious to see you and you hate it\nSo much you probably had your burner tucked at graduation\nSo if you see him on 'em bleachers then you kill him\nFacing 25 to life with a murder charge\nYour enemies was the prey and now you pray to God\nI pray these bars get farther than Compton\nAnd if our record never break, I still won’t break my promise\nI promise to keep it honest\nSecret society all we ask is trust\nAnd all we lack is communication like service sucks\nThe people scared of annihilation when Kingdom Come\nAnd I'm like, \"The Kendrick Lamar OD in less than a month, all right?\"\nGotta keep it pushing\nCan't let the government tell me how my future looking\nI'm on Rosecrans and Central trying to duck the central bookins'\nIf the fucking pigs get behind me then you know I'm bookin'\nNever will I surrender\nI been a warrior when I came out my mom's placenta\nIn the gutter lane like I'm Master Splinter\nHow splendid, I guess my project had did it\nGot all these niggas approaching they mixtapes different\nThey said seven tracks, I said fifteen\nCalled it an EP, they said I’m trippin'\nBut little did they know, I’m tryna' change the rules\nThat we’ve been confined to, so the corporate won’t make decisions\nUppity bitches, handling business\nKilling our dreams, stealing our vision\nOut in Haiti, adolescents barely have a home\nIn L.A everybody think they fucking on\nHop on Twitter, perpetrate we doing big shit\nWho we hanging with and bragging about the iPhone\nI swear to God most of y'all cats just don’t know Kendrick\nYou barely know yourself, so I guess most of y'all should be offended\nAin’t doing this for my health I’m tryna' purchase my momma dem' Benzes\nOccupying my time with riches, justifying my time ambitions\nJust to coincide, just to go inside, plus we idolize why we living\nLook, the mastermind took the master's mind\nJust the perfect time, just to master mine\nJust to match the grind with precision\nLook, the mastermind took - (cough)\n\n[Outro: Alori Joh]\nWe would like to call this an appreciation tape for those who recognized the Kendrick Lamar EP. For this is the Kendrick Lamar OD. Because of you we are Overly Dedicated", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg"}], "artist": "Kendrick Lamar"}