{"songs": [{"title": "Tical", "album": "Tical", "year": "1994-11-15", "lyrics": "[Intro Music: Modest Mussorgsky’s Pictures at an Exhibition]\n\n[Intro 1: Kung fu movie samples]\n*sounds of fighting*\n\"You've been lucky... I wish I got you last time\nEn garde, I'll let you try my Wu-Tang style.\"\n\"I'd like to try your Wu-Tang style, let's begin then!\"\n\n[Intro 2: Method] + (and others)\nFrom the tip top?\n(Aiyyo aiyyo, what the fuck's up with light dude?)\nYup, one two (no doubt, no doubt)\nOne two one two\nYo one two, uh, one two one two (yeah, we gon' be up in that)\nAh one two, uh, one two one two (yeah light that shit up)\nAh one two yo, check me out\n\n[Hook: Method Man]\nWhat's that shit that they be smokin'? Tical... tical, tical\nPass it over here... tical... tical, tical\nWhat's that shit that they be smokin'? Tical... tical, tical\nPass it over here... tical... tical, tical\n\n[Verse 1: Method Man]\nCheck it, I got styles, all of 'em sick\nNiggas ain't fit to walk a mile in the dead man's kicks\nI make 'em shit about a pile of bricks to show\nHe ain't nothing but another unknown John Doe\nThat wanna flow, here it is, coming up shit's creek\nI come to throw monkey wrenches in your program, sleep\nAnd I'ma grow like a rash on ya nasty ass\nIn a whip, with no brakes and I'm hitting the gas\nIt's a bird, it's a plane, take a look in the sky\nMethod Man on some shit, niggas call me The Fly\n'Cause my style dates back to hopping turnstiles\nPay ya fare, if ya cutie in the chair, you can bet I'll\nGet severe on the double, I harass it\nI don't look for trouble, I'm already trouble\nYa bastard, check the wicked flows that I crafted\nI'm another deadly venom style to be mastered\nBy a psychopathic, way beyond an average\nJoe, with a hellafied flow, there ya have it\n\n[Hook: Method Man]\nWhat's that shit that they be smokin'? Tical... tical, tical\nPass it over here... tical... tical, tical\nWhat's that shit that they be smokin'? Tical... tical, tical\nPass it over here... tical... tical, tical\n\n[Break: Method Man]\nOne two, uh, one two one two\nOne two, uh, one two one two\nOne two, uh, one two one two\nOne two, uh, check it out\n\n[Verse 2: Method Man]\nWhat goes off? What goes on? The Meth shit\nThat we got is to stay high, no question\nLethal weapon, ain't no time for half steppin''\nWhen brothers start wettin' everything in ya section\nMove that, niggas came strapped, should've knew that\nDo that, pussycat rap, boy, I'll screw that\nTo' up, from the flow up, don't even show up\nTo the battle, I heard you rattle, now hold up\nIs there a fucking snake in my garden?\nStarvin' for a rap treat, steppin' on my feet\nPardon your delf, before ya find your delf\nIn a fucked up situation, without no help\nI'm not playin' 'cause I don't play with nobody goddamn kid\nKnow what I'm sayin'? I'm peeling niggas wigs\nI be sprayin' brothers with words\n'Cause I gotta spit proooob...\n\n[Hook: Method Man]\nTical... tical, tical\nPass it over here... tical... tical, tical\nWhat's that shit that they be smokin'? Tical... tical, tical\nPass it over here... tical... tical, tical\n\n[Outro: Method Man]\nOne two uh, one two one two\nOne two uh... (stick a fat tical in your butt, yeah baby fuckin with tical)\n(Yeah, niggas better recognize... tical...)", "image": "https://images.genius.com/e8eea98eab886487258b11bd4e1cca4b.1000x1000x1.jpg"}], "artist": "Method Man"}