{"songs": [{"title": "Unnecessary", "album": "Royalty", "year": "2012-05-14", "lyrics": "[Intro: Childish Gambino]\nYuh, ahehe\nAye, it's- this is royalty, right?\nYeah, we royalty, you ain't even know that?\nYou gotta use the royal \"we\" around us\nIt's royalty\n\n[Verse 1: Childish Gambino]\nWho the fuck Gambino? (Uh)\nThis nigga on yo' TiVo? (Uh)\nMy hotel cost a kilo, we bankin' like a free throw (Woo!)\nFuck y'all, we A-Team, y'all plan B like Walgreens\nCop that shit and paint it black, niggas want they summer back?\nHa-ha, no way (Uh), hublots, Dolce\nBeans in my hand, girl in the car\nShe still with her man, but she seein' me tomorrow (Woo!)\nHomegirl on that Master P, watch us ball like referees (Ah!)\nUnnecessary roughness? We just tryna function (Ayy)\nUsed to sport them Filas 'cause my cousin pack them heaters\nWe don't wife 'em like Khalifa (Nah)\nWe just party then we leave 'em\nTell 'em that we hittin', we don't really see 'em\nMy girl look best when she only wear a fitted\nQ and 'Bino in the house and you niggas in the Senate\nGet it?\n\n[Chorus: Childish Gambino]\nFour thou' on my fit, that's unnecessary\nSkiing in Japan, that's unnecessary\nMolly on my rider, that's unnecessary\n'Bino spit the fire, that ain't even necessary\nThat's unnecessary, that's unnecessary\nThat's unnecessary, that's unnecessary\nRoll out on a plane, that's unnecessary\n'Tussin and champagne, nigga, that ain't even necessary\n\n[Verse 2: ScHoolboy Q]\nYo, they said don’t buy the belt and I got it (Yeah)\nThey said don’t get the Rollie and I bought it, uh (Yo)\nNigga, I’m ballin' (Uh)\nMy fuckin' mixtape can get you through college (Yeah)\nGettin' them dollars (Yeah)\nShowin' my pearly white teeth, I'm a nigga that’s flawless (Yeah-yeah)\nCame a long way from dumpin' out Impalas (Yeah-yeah)\nSame gun and pants, different ski mask from coppers\nAll of this copper\nKnock knock, who could it be? Niggas know I got it on lock (Uh)\nYawk, yawk (Yawk)\nBitch rappers better move ‘fore them niggas get dropped\n(Uh) Uh, uh (Uh)\nMr. Flop boy, you got your label hot (Yeah, yeah)\nI’m the hardest out, you's a table cloth (Yeah, yeah-yeah)\nUnnecessary ballin', I was carted off, uh\nBeen fucking with my side bitch so much\nMy main bitch can’t stand it (Huh, yeah, yeah)\nHunnid racks in three months, man this shit is outstanding, uh\n(Yeah, yeah-yeah)\nSeen a dollar go to stupid racks, billion, trillion\nNigga, that’s what I call building\n‘Bino what it do? Let’s go half on a million\n\n[Chorus: Childish Gambino]\nBathroom DVR, that’s unnecessary (Ayy)\nPushin' in that bulletproof, that’s unnecessary (Ayy)\nStuntin' in the mall, that’s unnecessary (Uh)\nCondo on my arm, that ain't even necessary\nThat’s unnecessary, that’s unnecessary (Woo!)\nThat’s unnecessary, that’s unnecessary (Uh!)\nIbiza for a day, that’s unnecessary (Bino!)\nShow's a hundred K (Royalty!), nigga, that ain’t even necessary\n\n[Verse 3: Ab-Soul]\nBl-bl-bla-black Lip Bastard, actual natural disaster\nI did a song about DMT, Soulja Boy did one right after-er-er-er\n3 eyes, these guys ain’t seein' me\nNo radio showed up over B.o.B\nG-O-D MC, I’m the devil with angel wings\nPilot Talk, currency (Soulo), stole the show, burglary (Soulo)\nI love that flow but I got more (Soulo)\nOpen condoms in condos (Soulo)\nOpen bottles of Moet (Soulo)\nWhite with white girls in Eugene (Soulo)\nWe used to call hoes on 3-way (Soulo)\nAnd take 'em out to the movies (Soulo)\nAnd now we just do it our way (Soulo)\nShe drivin' stick in the driveway (Soulo)\nJust popped a molly with Miley (Soulo)\nShe do shrooms every blue moon (Soulo, molly on my rider)\nHundred million trillion motherfuckin' racks, nigga (Nigga)\nPinot Grigio the lean’ll go in that, nigga (Nigga)\nNow that's unnecessary, been a legend since elementary\nAyo, Bino, tell these niggas I ain't no joke\nShe don't need speak, she ain't giving no throat\nYou are under my control, suspend the L's but I'm on a roll\nGrade A, honor roll, mayday, Soul!", "image": "https://images.genius.com/587833871590a682c8aed1b739f0cb23.906x905x1.jpg"}], "artist": "Childish Gambino"}