{"songs": [{"title": "Knockturnal", "album": "Radio Silence", "year": "2017-11-17", "lyrics": "[Intro]\nIt's all good, do or die, man\nI hear ya, before I come out and go to work and whatnot\nI hear a shoot-out and whatnot (yeah right)\nYou know, what you hear, pop-pop-pop\nListen, and I'm like, \"Yo\"\nMy moms'd be like, \"Yo, you ain't going out in that\"\nI said \"Look, yo, a brother gotta make a living\"\nYou gotta do what you gotta do\n\n[Chorus]\nThe vampires make you fear the night\nThat kind of talk give them evil spirits life\nShe on the track like she waiting for her tears to dry\nListen real close you can hear the city cry\nYou hear it right?\nIt's like every night the city die\nWe the blood, we give the city life\nLiving the city life\n\n[Verse 1]\nThe city get restless when the sun go down\nThe words get heated and the guns go (*pow*)\nI used to joke and smile now everyone's so foul\nHe grab the heat before he leave out the front door now\nCheck the weather, what's the forecast?\nTryna make it rain, lookin' for more cash\nLittle man ain't got no parents, who you gon' follow\nWhen your role models send you to the store for a cold bottle?\nAnd you come back and see 'em in cuffs will be enough\nTo hate police, and define manhood as being tough\nSneakers scuffed and them toes turnt up, this shit is aggravating\nIt's hard to put holes in denim, this ain't a fashion statement\nYelling out \"That's my car\", so fascinated\nBy material gain, it's already ours in our imagination\nThe matri-nations of supremacy is masturbation\nThe master race should make you want to mash your face\nAnd run right up in somebody gates, like \"Where the fuck the safe?\"\nSmall, quiet dude in the back, like \"I know just the place\"\nHe flash a toothy grin the jakes love to hate\nAnd then he flashed the gun he had tucked in his waist\nThe conversations, son, I'm hearing are overbearing\nAin't no preparing for how much the hood be oversharing\n(Word) The night time, always the right time\nWhen your blood is what's flowing through the school-to-prison pipeline\n\n[Chorus]\nThe vampires make you fear the night\nThat kind of talk give them evil spirits life\nShe on the track like she waiting for her tears to dry\nListen real close you can hear the city cry\nYou hear it right?\nIt's like every night the city die\nWe the blood, we give the city life\nLiving the city life\n\n[Verse 2]\nWhen you ain't got a pot to piss\nEverybody on the block is your competition\nPolice all in your pocket, you're forced to forfeit\nWhen your espionage is corporate, that means you got an office\nInstead arrested for the petty theft\nExpected to apologise for every breath\nA warrior stood in the face of many deaths\nBut since they colonized us, are there any left?\nHe in the streets like he ain't got a home\nWriting a poem to the beat of the sobs and moans\nRan into Joan, skin chocolate as a Toblerone\nClickety-clack of stilettos on wet cobblestones\nStreetlights illuminate how truly dark it is\nThe block is a college, you got a degree in marketing\nA doctorate in swallowing, this pimping paid her scholarships\nShe poppin' out her tits cause they pay her to be provocative\nBroke niggas tryna holla though (holla though)\nBut they ain't got no dollars though (dollars though)\nIt sound like, \"I'ma hit a lick anyday\nSo fuck you bitch, she don't look that good anyway\"\n(You don't even look good anyway) Since when is pettiness a virtue?\nCops circle the block, they went from stop and frisk to stop and merc you\nSmoking dark purple in a crop circle\nFast life, this entourage is saying \"Got terfs\"\n\n[Chorus]\nThe vampires make you fear the night\nThat kind of talk give them evil spirits life\nShe on the track like she waiting for her tears to dry\nListen real close you can hear the city cry\nYou hear it right?\nIt's like every night the city die\nWe the blood, we give the city life\nLiving the city life", "image": "https://images.genius.com/25f545688171433c422bdbaf45bd1392.1000x1000x1.jpg"}], "artist": "Talib Kweli"}