{"songs": [{"title": "Red Rags", "album": "Strangeulation", "year": "2014-05-06", "lyrics": "[Instrumental vocal loop: Tech N9ne]\nSome gangstas wanna head blast, 'cause I run with the red rags\n\n[Intro: Tech N9ne]\nFree Uno Ace Capone. The homie Keith Fudge, I got your back homie\nLETS GO!\n\n[Hook: Tech N9ne]\nCrew, soo-woo\nNigga that's what we do\nWho, be you\nIf you want funk me too\n\n[Verse 1: Tech N9ne]\nI'm bool as a bubumber\nLaces in my shoes makin' you wonder\nAm I gonna act a fool or bring your crew thunder\nThinkin' I pack the tool, the one I use on her\nI ain't trippin' but the old days got my mind glitchin'\nLike different signs that ain't my kind got they 9's whistlin'\nLike a nigga wanna find this and strip clips 'til my wines drippin'\nBut nobody wanna do no crime they just talkin' about rhyme spittin'\nWhen I'm at the movies, careful how you steppin' to me\n'Cause I think who's starin' at me wanna do me\n'Cause I'm flamed up and soo woo-ey\nHead crash, my head's bad\n'Cause I be thinking some gangstas wanna head blast\n'Cause I run with the red rags\n\n[Hook: Tech N9ne]\nCrew, soo-woo\nNigga that's what we do\nWho, be you\nIf you want funk me too\n\n[Verse 2: Kutt Calhoun]\nI'm a motherfucking animal, red devil, Tasmanian\nBangins' in my cranium, Deuce Clique and five claimin' it\nKansas City thang, from two clips at my range is bandanna dangerous\nYou's crip when I'm sayin' it?\nIt's Soo-Woo business, then yous through nigga\nBlood? I don't give a fuck if I knew you nigga\nThat's that 85 mentality, victim of your reality\nCatchin', pumpin' that 7-11 in your fatalities\nIt's another nigga's wake-up, smoking water and drank up\nHeavenly, blocks flames from 20's to the seventies\nIt's ballers tuckin' fed cash, to get you dead fast\nGangstas they head blast 'cause I run with the red flags!\n\n[Hook: Tech N9ne]\nCrew, soo-woo\nNigga that's what we do\nWho, be you\nIf you want funk me too\n\n[Verse 3: Jay Rock]\nUh, I'm just bicken back and bein' bool\nYou don't know this feelin', look you fuckin' with the realest\nNo, gloves no, mask look you know we 'bout to kill it\nDisrespect us here get your mami pinned to the ceilin'\nThis is still holdin' hemi's even when I'm in my jammies\nNiggas wanna catch me slippin' leave me sleepin' like I'm manny\nPlus they still sendin' threats, haters wanna pack me out\nBunch of internet hustlas always wanna run they mouth\nI ain't trippin' still thuggin' for blood and getting guap\nAnd you know I keep a oo-op let it sing just like a doo-wop\nAnd it's always tough guys, they don't never wanna co-op\n\n[Hook: Tech N9ne]\nCrew, soo-woo\nNigga that's what we do\nWho, be you\nIf you want funk me too\n\n[Verse 4: Big Scoob]\nSigned up, suited and booted, old nigga, ready for war\nLayin' back, stackin' cake, but it don't take much to activate\nSnatch it back and act innate, rainin' down the hand of god\nChopper get to sanging nigga smokin' like it’s El DeBarge\nForgive me Lord I'm tryna keep it cool\nBut I'm a old nigga with a quick fuse, quick to smell the bitch in dudes\nHard to walk in Scooby's shoes, do the shit that Scooby do\nFi' block, a general, I done paid my fuckin' dues\nNigga this the life I chose, fuck that, life I choose\nStill livin' gang rules check the laces in these shoes\nGangsta nigga through and through, tried tested been approved\nOn blood, one love, nigga what, soo-woo\n\n[Hook: Tech N9ne]\nCrew, soo-woo\nNigga that's what we do\nWho, be you\nIf you want funk me too\nCrew, soo-woo\nNigga that's what we do\nWho, be you\nIf you want funk me too", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}