{"songs": [{"title": "This My One", "album": "Get Off the Stage", "year": null, "lyrics": "[E-40]\nUHH~! Where I stay they gotta temper they locks\nGet they hair done down at Nappy or Not (BAY AREA!!!)\nNo funk abusin the cops\nDroppin off yola in the Wal*Mart parkin lot (parkin lot)\nHustle in our arteries, re-up and re-cop (cop)\nCemeteries, mortuaries, tryin to get guap' (UHHH)\nDrugs, fetti and sex\nChicken one day, fed goods the next (UHHH~!)\nI got a cold conversation\nCould talk a cop out a ticket in front of the police station\nMy niggas KNOW I'm a patient\nWhen you're funkin or beefin all it takes is a little patience\n(UHHH) Gotta be slick and sly\nI ain't gon' kill nuttin, and I ain't gon' let nuttin die\nLooted up, suited up, rap for fun\nWanna hear this black right here? Nigga say, this my one\n\n[Hook]\nDroop-E made the black, Sic'Wid'It hog\nWho that rappin on the track? 40-Wat' and $hort Dawg\n(At the bank they call us Earl and Todd)\n(We up all night, hustlin hard)\nUHHH {can't stop won't stop} this my one\n{We gotta get it how we get it} this my one\n{Like the beat hear knocks} this my one\n{Got 'em all in the clubs yellin} this my one\n\n[Too $hort]\nThings can't stay the same\nSomebody gotta break the chain\nPut some big money back in the game\nWe havin big money and we at it a-gain\nBut can you handle it mayne\nOr would rather be grimy doin scandalous thangs?\nYou wanna ball, you can't tell him he ain't\nCause if the music don't pay he gon' sell 'em the 'caine\nAll the crack babies are growin up now\nThey got ADD, throw it up and act wild\nExtra hyper, she asked me if I like her\nSlow down girl, you move faster than a Viper\nYou're too freaky, you're way too sleazy\nYou could make some money but you give it up easy\nCan't even get a coke dealer\nYou a broke bitch fuckin with a broke nigga!\n\n[Hook]\n\n[E-40]\nUHHH... I play my position\nSo much throb in the trunk got the CD player skippin\n(CD player skippin) I'm smokin and sippin\nHood life, speed bumps in the residential district\nUHHHHH~! Pimpin this the anthem\nGot the Chrysler lips, lookin like a phantom\nLike a PHANTOM!! I burn rubber on a hater\nIf it ain't about yaper I'm hit the 'ccelerator\n\n[Too $hort]\nMe and E-40, we rap for money\nOn funky-ass tracks with slappin drumbeats\nPay me up front cause I'm not a dummy\nPromoters like bitches when I'm hot they want me\n... And that's all the time\nI stay on tour, knockin all the dimes\nI can't name 'em, the list is long\nBut when they hear that bass shit they say \"This my one!\"\n\n[Hook] - 2X", "image": "https://images.genius.com/741d92564e8abb58865b06c018a84caa.767x768x1.jpg"}], "artist": "Too $hort"}