{"songs": [{"title": "I Miss You", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[Intro: DMX]\nI know that my savior lives\nAnd at the end, He will stand on this earth\nMy flesh may be destroyed\nYet from this body, I will see God\nYes, I will see Him for myself\nAnd I long for that moment\n\n[Verse 1: DMX]\nGrandma, I really miss you, and it ain't been the same\nI drop a tear when I hear your name\nMary Ella Holloway, why you gotta be so far away?\nUsed to say, \"Don't worry, it's gon' be okay\"\nBut it ain't – it's like when you left, you took the Lord with you\nWhy couldn't I come when He came to get you?\nDamn, I really miss you… I had to say it again\nI remember the time when I was like 10\nCrept up in the neighbor's yard, yeah, bein' hard headed\nYou told me I would get it – you said it!\nAnd boy did I get it, but after you spanked me, you hugged me\nKissed me on my forehead, told me that you love me\nAnd I saw that it hurt you more than it hurt me\nI thought, how bad could this hurt be?\nI know now, that's why it's only done out of love\nWhat I wouldn't give for one mo' hug, from grandma\n\n[Chorus: Faith Evans (DMX)]\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\n\n[Verse 2: DMX]\nWhat I'm about to say a couple of family members is gon' hate me\nBut I'ma let you know what's been goin' on lately\nNow you know since you left a lot of things with your kids done changed\nYeah, Jackie's still crazy, don't know what's up with James\nAin't seen Jerry in a while, you know he walk like you\nAnd Renée's back in jail, you know she talk like you\nRiculah's(?) doing real good now, she workin'\nRhonda's still runnin' around, trickin', jerkin'\nBuckeye's buggin', he done lost his mind\nAnd Jarvis? Back out of jail, doin' fine\nKylie? He done changed, it ain't all about self\nAs for my father... well, that's somethin' else\nBut that's my dog, he hold his grandmother down\nMy great grandmother, makin' a lot of trips out of town\nBut that's a good thing, and if I could only hear you sing\nOnce more, oh Lord, the comfort it would bring\n\n[Chorus: Faith Evans (DMX)]\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\n\n[Verse 3: DMX (Faith Evans)]\nYou left behind a mother, eleven kids, eleven grand-kids\nAnd since then, two of your grand-kids done had kids\nThey had a boy named Tacoma, Xavier's brother\nThat's right, Xavier's made you a great-grandmother\nI thank you for the best times of my life\nI thank you for when you first met her acceptin' and lovin' my wife\nI thank you for those Sunday dinners, they were vital\nI thank you for my life, I thank you for the Bible\nI thank you for the songs that you'd sing in the mornin'\n(Amazing Grace…) while I'm yawnin'\nI thank you for the two beatings you gave me\n'Cause I know somewhere along the line the lesson I learned from the two beatings saved me\nAnd when you died I cried like a baby, I begged the Lord to take me\n'Cause no one else could give me what you gave me\nBut life, like everything, comes to an end\nI pray I go to Heaven to see you again – Amen\n\n[Chorus: Faith Evans (DMX)]\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\nBaby, it's gon' be okay (She used to tell me that…)\nBaby, it's gon' be okay (I really miss hearin'…)\n\n[Outro: Faith Evans]\nAmazing Grace, how sweet the sound\nThat saved a wretch like me\nI once was lost, but now I'm found\nWas blind, but now I see, yeah", "image": "https://images.genius.com/165d588d09c12e6674273dcf835febf4.240x240x1.jpg"}], "artist": "DMX"}