{"songs": [{"title": "Zoo Two", "album": "The Trials & Tribulations of Russell Jones", "year": "2002-03-19", "lyrics": "[Intro]\nI just want all y'all to know, the reason why I curse\nBecause of my momma and my daddy; they grew up cursin'\nSo please respect my style, please!\n\n[Ol' Dirty Bastard]\nI'll grab the mic and now I damage you, cuts your whole stamina\nHere comes the medical examiner\nOne verse then you're out for the count\nBring the ammonia make sure he sniffs the right amount\nWake you up and then I axe you\nHow did you intend this --\nCompetition to get an ass kickin' so tremendous\nOh!, you shouldn't bother this\nLeave me alone like a son, he'll be fatherless!\nI got the asiatic flow mixed with disco\nRoll up on the scene like the Count of Monte Crisco\nAnd MC's start to vanish\nI rolled up into jet, black kid the nigga started speakin' spanish!\nYo!, he wasn't from Panama\nI axed you how you get so fuckin', dark, you said\n\"suntanama!\"\nHe'll be responded so fast, you made me laugh\nHa-ha-ha, HARARRRH scared his ass\nKick the hundred strongest rhymes\nThen I brought out the punk in him\nCaught him with a strong five deadly venom\nTold him!, enter the Wu-Tang\nWitness the Shaolin slang, that'll crush any shit you brang\nI watch your ass take a big fall, why?!\nMy Main Source, is like a friendly game of stickball\nAnd as you step up to batman, I play you the riddler\nYou try to jew me for a rhyme nigga, I'll change to Hitler\nI go out like a Nazi, wish your fuckin' ass stayed, home and played (Yahtzee!)\nOr watchin' Happy Days sweatin' Poxie\nWith Ralphie and Richie Cunningham, Joni and Chachi\nWu, who? Me gettin wreck talk to him\nHe's like a twelve and a half foot, gettin' in a seven shoe\nNow picture that with a Minolta\nI have your ass doin' some Night Fever shit like John Travolta\nI come strong I make knowledge born, I flip the script\nAnd rock on from P.M. , past the fucking Dawn\nPass the Hammer you're broke down, niggas grab my what what\nYou can't understand it, here's the panorama\nA complete view, of how I defeat you\nShoulda stepped to those god damn kids who tried to beat you\nYeah I bust that ass before\nYou ran to Texas and came back but forgot the chainsaw!\nAnd wanna perform a massacre\nBetter be coming with some motherfucking shit that's spectacular\nI bust y'all..", "image": "https://images.genius.com/8aae5961ee3d6894e7d2abaab7f8fc11.772x768x1.jpg"}], "artist": "Ol’ Dirty Bastard"}