{"songs": [{"title": "2 Bitches", "album": "You Nasty", "year": null, "lyrics": "[Hook]\nPimp niggas don't pay a dime ppppppppppppooooooooooooooooopppppppppppppp\nI'm fucking two bitches at the same time\nThen I hit the studio and I write a rhyme\nI call it \"Tramp Hoes Ain't Hard to Find\"\n\n[Verse 1]\nI took two bitches to a hotel\nI told em both \"you know I won't tell\"\nBitch, curiosity killed the cat\nYou gotta lick the clit while I hit it from the back\nDon't be stingy girl, lick my balls too\nYou was talkin big shit when I called you\nYou said you never fucked another girl before\nAnd you wanted me to help you so\nBitch, I took you down to the strip club\nI told you \"look around, who you wanna fuck?\"\nYou picked thick chocolate, big booty, big tits\nI told her she could have you, and this dick\nShe got so excited she got off work early\nJumped in the back and started lickin on my girlie\nI couldn't get home fast enough\nNow it's time to fuck\n\n[Hook]\n\n[Verse 2]\nWhen we got to my room she started actin nervous\nSat down and said \"lets order room service\"\nI said \"bitch, what are ya smokin?\nA big fat dick coming from East Oakland\"\nI stuck it in her mouth, she started moanin\nI said \"hang up, get off my telephone, bitch\"\nI put the game down immediately\nI'm a vet from the town, started freaking them freaks\nAnd once they started, they couldn't stop\nI fuck 'em for awhile then I kick back and watch\nTwo bitches at the same time\nAnd neither one of these hoes is mine\nI don't give a fuck, I'm a player\nI been doin this for years, I got bitches everywhere\nYou think I'm paying hoes? You got the game distorted\nYou a trick, mad cause you can't afford it\n\n[Hook]\n\n[Verse 3]\nThem bitches kissed twenty minutes straight non-stop\nStrip girl on the bottom, 'lil momma on top\nIt was beautiful, you know what happened next\nSpent twenty more minutes licking each other's breasts\nTwo titty sucking hoes, navels and toes\nBitch rolled her on her stomach, licked her asshole\nI was smokin on a fat one, layin in the cut\nAfter seeing this shit, I ain't wanna fuck\nI wanna see how long they can keep goin\nI don't know, I fell asleep on 'em\nWhen I woke up I was getting my dick sucked\nThese hoes horny as fuck, they can't get enough\nI was fucking them sluts 'til the sun came up\nNut in both their mouths, you ever done that stuff?\nDog baby, this shit ain't really nuthin to me\nYou better handcuff your ho or I'll be fucking your freak, nigga\n\n[Hook]\n\nSing it, pimp niggas don't pay a dime\nI'm fuckin two bitches at the same time\nFucking two bitches at the same time\nLet 'em know pimp niggas don't pay a dime, bitch\nHit the studio and write a rhyme\nThese tramps ain't hard to find nigga\nBitch\nTwo Bitches\nTwo of 'em\n2 delicious Bitches", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}