{"songs": [{"title": "Be Easy (Remix)", "album": "Fishscale", "year": "2008-12-16", "lyrics": "[Intro: Ghostface Killah]\nDon't fuck with Ghost, you'll feel sorry\n\n[Chorus: Ghostface Killah]\nTell your crew to be easy, niggas run around\nWith them fake frowns, sell 'em on eBay\nGet word to the DJ, tell 'em Staten Island's\nIn the house, put the record on replay\n\n[Verse 1: Ghostface Killah]\nColorful kicks and my closet like Baskin-Robbins\nCentral Park killings, stab niggas while they jogging\nNo shirt on, whilin' like I sniffed the eight\nAt the ball game, jumped down and stole the base\nSome muthafuckas said it was bass\nSilly me, thought it was a 12 by 12 inch Colombian snowflake\nMob Jacob slow cut 8 six, the semi have\nNiggas running like Forrest when he broke his braces, pa\nScold a nigga like a pile of hot chocolate\nBefore I eat her, I belong on a bitch cartridge\nNiggas kill me potraying that hard shit\nShove his face in the dirt like an ostrich\nOn some mob shit, no talking, like we resolve shit\nStretch a nigga out like an enlarged dick\nThat's one for you, one-two for me\nI'm hoggin' and shit, y'all muthafuckas best to be easy\n\n[Interlude: Ice Cube]\nThe pyroclastic flow, you know the side, bitch\nYou know the side, bitch, huh, ah\n\n[Verse 2: Ice Cube]\nFuck you, if you don't think I get money\nI get it all day, standing in the hallway\nOn broadway, bitches wanna call O'Shea\nOver to the car, but ho, I'm the superstar\nGet your ass out, fuck if you pass out\nWalk over to ya man, pull the cash out\nPut it in my hand, watch a nigga mash out\nWalk back to your car, with your ass out\nFuck a ghostwriter, nigga down wit Ghostface\nI'm a killa, wit that chrome in ya face\nBlow ya face back, turn you into a ghost\nHit you like Kenny hit Casper on the post\nWest coast, ya ho, ya gotta love it\nIt's Ice Cube, yea, bitch, I got it covered\nI got a movie for ya kids, a dick for your bitch\nA four-five slug for your wig\nThey wanna put me out the league like Terrell\nTil they CD smokin' double barrels\nIce Cube, will fuck off movie money\nThen serve you on the mic, and make whitey feel funny\n\n[Interlude: Ghostface Killah]\nYeah... what's happpening New York City?\nIt's ya boy Ghost in the muthafuckin' house tonight\n(\"Don't fuck with Ghost, you'll feel sorry\")\nNahwhatimean? We about to get it popping, let's go!\nYo! Yo!\n\n[Chorus: Ghostface Killah]\nTell your crew to be easy, niggas run around\nWith them fake frowns, sell 'em on eBay\nGet word to the DJ, tell 'em Staten Island's\nIn the house, put the record on replay\n\n[Verse 3: Ghostface Killah]\nGet your nose blowned off by the fifth, uh\nYou wanna be there, layin' all stiff, uh\nEverytime you go uptown, you get jipped, uh\nThat's karma, boy, running your lip, uh\nYou be fronting like you got a bunch of chicks, uh\nYou be at home, nigga, beating your dick, uh\nI'm in the club with the chipped up wrist, uh\nYou at the bar, whoadie, drinkin' my piss, uh\nThe yellow shit, and the bottle ain't Crys', son\nYou turned your muthafuckin' head, nigga, we switched 'em\nYou just mad cause I'm hittin' your sister\nYou in the other room, huh, you couldn't sleep, uh\nPop a lotta shit without that liquor, yup\nWe mind seat up, so take our picture\nI'm like the boogeyman, nigga, I'll get ya\nWhether now or later, afterlife, or switcher\n\n[Interlude: Ghostface Killah]\nYeah, oh shit, aiyo Tone hurry up and get 'em, nigga\nYou know what I mean, it's about to pop off!\nYa'll niggas clear the fucking floor\nGet the fuck out the way, come on!\n\n[Chorus: Ghostface Killah]\nTell your crew to be easy, niggas run around\nWith them fake frowns, sell 'em on eBay\nGet word to the DJ, tell 'em Staten Island's\nIn the house, put the record on replay\n\n[Bridge: Trife Diesel & Ghostface Killah]\nYo, it's Tone in the building (the teams in the building)\nNiggas wanna beef (what up, what up, what up)\nWe packed to the ceiling (we constantly chilling)\nWe can cause (we could, we shoot, we slice, we cut)\n\n[Verse 4: Ghostface Killah]\nShimmy shimmy ya, shimmy yam, shimmy yea, now\nYes, my birthday, landed in nay, now\nPeace to Dirt Dog, I'm back like deja vu\nLeave your girl around me, I will bag your boo\nAhh, you bitch niggas better listen up\nAnybody front, paramedics gonna pick 'em up\nThey try to save you, sware to God, I hit the nurse up\nLike \"Nah, doc, he look better in a herse truck\"\nI tried to ignore it, his people saw it\nI ain't the type of dude you go to war with\nMy polo gun yo, will crack the floor shit\nWhen the heat's on, you know I draw it\nI had his number down, Toney just called it\n\n[Outro: Ghostface Killah]\nYeah, that's right\nI like to thank y'all for coming out tonight\nHow y'all like that shit? You know what I mean?\nYou really run New York\nThis is that Theodore shit, muthafucker!", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}