{"songs": [{"title": "Real Nigga Blues", "album": "Balls and My Word", "year": "2003-04-08", "lyrics": "Damn, its hard being a real nigga\nClutching on steal triggers\nPouring kool-aid on hilfigers\nFor niggas I cut for\nPull a ho out my truck for\nTake a bullet to my gut for\nShoot up your cuz for\nAnd nigga you askin' me what for?\n'cuz this check I wrote until death won't bounce\n'cuz to quit is to care and excuses don't count\n\nYeah, the real nigga blues\n\nShort sticks and long brooms\nTwo feet planted whether it be the tomb or the courtroom\nBullet wounds in my flesh\nPowder burns I digest\nOn the front line I press\nUntil in peace I may rest\nFor battles I can't win\nWith stripes I must defend\nDone been to the pen, behind friends\nAnd I still can't turn my flags in\nWhen you break weak I got to stand strong\nI strive to go hard while you strive to go home\nThese checks I write are required day and night\nFor better or worse, ups and downs\nOr just plain old fist fights\nPackin' all the weight\nPuttin' in work from birth\nRunning myself in the dirt\nAnd you askin' me why my back hurt?\nEven when your gal tried to give me some fish\nI eighty-sixed that shit\nPulled your coat but you was scared to dismiss that bitch\nBut I guess you got to be one of me or walk in my shoes\nOr drink from the cup that I drink to feel my blues\n\nYeah, the real nigga blues\n\nI can't bend, brake, front, fraud, fold or get hacked\nIts like I'm married to this game and my team looses if I get sacked\nTurning down licks on niggas I know ain't got no heart\nArguing with my baby momma because shes convinces you'z a mark\nMy word is my bond, my life is my son\nMy duece is my gun, and my fear is to have none\n'cuz I refuse to run\nAnd for my honor I'd die, and for my mother I'd lie\nMy heart done got hard\nI still show regards, call out to the Lord\nBut it seems like I can't cry\nSo when bullets fly...\nYeah, its my fault\nLocked in with no way out\nFuck some clout, this is what I'm about\nEven if I am the only one to get caught\nIt ain't in me to back down\nThats like laying my gat down\nNigga I ride for the cause, and I hide from the laws\nAnd I ain't scared to get ragged on\nAnd for my crown... yeah\nCaps gonn peal\nI ain't no threat, nigga but I will kill\nAnd to all my partners up under them hills\nY'all know how it feels and thats real\n\nYeah, dig these blues\nThe real nigga blues\n\nDig this\nMy partners hit a lick for two and a half bricks\nAnd since I'm the cornerstone of the clique\nThey came to me when the shit got thick\nI took in all their evidence and made it mine\nNot realizing that while they were ballin'\nI'd be doing time\nAll they had to do was push the witness out of existence\nAnd I would've walked because the case was inconsistent\nBut insted they got caught up in the joys\nOf the fruit from the hussle\nSaid fuck me, let the witness live\nAnd I got twenty five years\nAll 'cuz I kept it real\nA mark would've squeeled\nBut insted I chilled, put it on the pill\nBut got ?chofferred in? a deal\nSee I respect the code of the streets\nThe code of the ?jeeks?\nBut when they gave it to me they said 'Fuck the police'\nWe'll never help these hoes solve a case\nNow tears in my sons face\nBecause his daddy is out of place\nWith no trace of my peers\nMissing my little nigga younger years\nAll because I kept it real\nRegrets?\nSometimes have some\nI'mma walk when me time come\nIt wasn't my prints on the gun\nIn yo' eyes, you'z a real nigga\nSo what you would've done?\nStand strong?\nI'm not surprised\nI was in the county camoflauging my cries\nSquabbling niggas twice my size\nFor mistaking tears for fears in my eyes\nBut I ain't ask to be real\nI was born like this\nSacrificing my fo' sho's for your maybes\nGot me scorned like this\nTattered and torn like this\nBut my roots won't pluck\nI'm the only reason your tooth won't buck\nBut is my authenticy worth the price I be paying?\nAll the shit I've been through\nNigga, do it look like I'm playing?\nI'mma be down 'til I get laid down\nAll the ex-real niggas would've still be real\nOnly if they would've stayed down\nBut these my blues\nI just spread the news to who I choose\nA tale of a real nigga\nCan you dig his blues?\n\nYeah, the real nigga blues\nAnd all I got are my balls and my word\nYeah, my balls and my word", "image": "https://images.genius.com/c4214083902775e5126f0ba4f0770c9a.969x969x1.png"}], "artist": "Scarface"}