{"songs": [{"title": "Get Your Freak On", "album": "Lara Croft: Tomb Raider (Music from the Motion Picture)", "year": null, "lyrics": "[MISSY:]\nREMIX! with Nelly Furtado...\nCome in and I landed [repeated in the background]\n\n[MISSY:]\nNELLY FURTADO!\nCome in and I landed [repeated in the background]\n\n[NELLY:]\nShe's a freak and I'm a chief head banger with the top down low on the flow cause your so fresh (fresh!) like b-boys with vests like runners carve chests\nHehehehe\nI run like the breeze to catch this life but sometimes get a need 'til I bleed!\nThere's truth, I go, there's a rhyme, I will tell it, a story, I'll defend it\nMissy come in and I landed! Hell where did she come from?\nThis international goddess sun so get your hands up like this hun\nUntil the party's just begun! So come over to my house and that's where this song's from a less for the laugh from west coast breeze Portuguese diva! And Missy's the woman who always be cooking, says something for Neltado who come dip her vibin' from DC to T.Dot and all around the world come giddy up giddy up back back up to my girl!\n\n[MISSY:]\nGet ur freak on [repeated]\n[Nelly:] Get [scatted] Get ur freak on!\n\n[MISSY:]\nWho's that bitch?\n\n[Nelly:]\nMeep meep! Nelly Nelly Nelly Furtado all in your stereo\nI'm pumping louder please don't tell me you don't like the flow\nYou cry to me to put this down so let me step it -- YO!\n\n[MISSY:]\nIt's a original flow, people better lay low, stick you up like velcro\nCause me and Nelly say SO!\n\n[Nelly:]\nI'm doin how we do -- some strange loose in your crew\nBecause my fire springs your head round right MISSY!\n\n[MISSY:]\nGet ur freak on! [repeated]\n[Nelly:]\nGet [scatted] get ur freak on! Get [scatted] ahhhh!\n\n[MISSY:]\nThey wan dance\nEverybody getting freak-deaky wan dance\nGrab your partners tear 'em by the ass and wan dance\nWine your body swiftly to the beat dem wan dance!\nDem wan dance, dem wan dance!\nEverybody crank in the club - dem wan dance!\nEverybody hot and on the block - dem wan dance!\nEverybody gettin freak-deaky wan dance, dem wan dance!\n\n[Nelly:]\nYeah\n\n[MISSY:]\nGet ur freak on! [repeated]\n[Nelly:]\nGet [scatted] get ur freak on! Get [scatted] ahhhh! (repeated in the background)\n\n[Missy:]\nREMIX... with Nelly Furtado… Ne-Ne-Nelly Furtado, hehehe, AII, uh uh uh uh… some new shit\n\n[Nelly:]\nDoji do doji do doji dedingdingding...", "image": "https://images.genius.com/c74c6e583fe37abf04c612c637e25269.1000x1000x1.png"}], "artist": "Missy Elliott"}