{"songs": [{"title": "Tragic Freestyle", "album": null, "year": "2018-11-22", "lyrics": "[Intro]\nSupah Mario\nYeah\nAahhh\nI just wanna be me, can I?\nOkay, listen to it\n\n[Verse 1]\nTragic, all my niggas robbin', baskin'\nAction, cameras, lights, dancin'\nActually I'm so clean I should be in someone's casket\nMy money not average\nPull up on your daughter in the Aston on Davins\nMigos right behind me and they dippin' and dabbin'\nI just pour the 8 inside of cranberry raspberry\nGuwop put me onto that, yeah, free him to be exact\nI just seen my priest, I got some B's on me like Da Brat\nToe jam massacre, shoot up out the Cadillac\nAll we know is abstract\nYellow diamonds on me, bitches screamin' \"Where the cab at?\"\nHopped up in that bitch and told them \"Take me where the Ave at\"\nCall 'em hyenas, cuz the pussy niggas laughin'\nTwelve took my gun, so i might just gon' and stab that\nMoney so tall like a muh'fucking giraffe neck\nWe party hard, where the fuck is RiFF RAFF at?\n\n[Interlude 1]\nOh my God we party motherfuckin animals, you know what I'm sayin'?\nAye somebody call RiFF RAFFF and tell him to bring me some muh'fuckin molly\nI just want to get geeked out tonight, you know what I'm sayin'\nI wanna smoke me some backwoods with that good-good\nScooter on the way to serve me a bag too, I swear to God\nNo cap\n\n[Bridge 1]\nNo cap, no Jeff (aye)\nThese niggas flexin, they don't got no cap left (aye)\nI got some marble floors they heat up on the steps (hey)\nAnd imma ball to my very last breath (hey, heyy)\nA hundred thousand on some shoes, watch your step (hey)\nI don't wear Nike's but I'm gon do it to death (oh hey)\nShe'll never say no, yeah yeah (hey hey)\n\n[Verse 2]\nMitsubishi with a lot of chickens (skrt skrt skrt)\nThat ass fat, she get all the whippings\nA nigga play with YSL they get a lot of fullies (slime)\nI spent five hundred thousand on some YSL hoodies (woo)\nAnd they only for the faculty (what)\nBitch I got it bad, I'm not average\nMix that actavis with green, nigga pretty please\nTurn the tide, nigga lean, nigga leanie lean\nAnd I know its just a dream, it's a bigger league\nBit back up and I'm so clean, John F. Kennedy\nTen thousand dollars on a mirror cause its [?] (what?)\nI just gotta him in the pen, now he's small again\nI'm never sorry that I smoked him, hope he die again\nI gave my clothes to a junkie when my trial end\nI been fresh and I will never never need a stylist\nI kick that pussy bitch out, wildin'\n\n[Interlude 2]\nUdigg what I just said?\nUdigg what I just said man?\nI don't think they digg what I said, you know?\nThey simple minded, so I know they don't digg\nI know they don't understand what I'm sayin', so\nListen\nI said I kicked a bitch out, wildin', hah!\n\n[Bridge 2]\nYeah yeah, yeah yeah yeah\nYeah yeah, yeah yeah yeah\nYeah yeah, yeah yeah yeah (Thugger Thugger)\nYeah yeah, yeah yeah yeah\nThugger, beast, nigga\n\n[Verse 3]\nBeast mode, that cheat code\n530 keep those\nHow the fuck you let me doze off and where'd the freaks go?\nShe said she kicked them bitches out, they tryna leach, woah\nI'm like \"What the fuck's the difference? Bitch you leach more\"\nCredit card, bitch I'm slime like D'bo\nI told him keep his eye on her she's a creep hoe\nShe know if I ever pour it up it's at least fo'\nI'm like monkey hoe, bitch freeze tho\nMoari gators with a linen suit\nHunnid racks inside it, imma show you what them skinners do\nRun up trynna take it imma show you what the semi do\nI just wanted to nut, baby girl I'm never feelin' you\nNo I'm never feelin' you\nWaitin' on you to get wrong, so lil Dolly can come drillin' you\nIf you got them racks, baby girl you know I'm feelin' you\nYou got some appeal in you, and you lost your ceiling too\nBig dinosaur B, baby girl I'm billin' you\n\n[Outro]\nLet that motherfucker breath, you know?\nThis is YSL\nThis is who you love\nThis is who you need", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}