{"songs": [{"title": "SAD! (remix)", "album": null, "year": null, "lyrics": "Uh-uh, yeah\nUh\nUh, this one for the legend, uh\nI feel like a king, and these other niggas peasants, uh\nWe should take another nigga loss as a lesson, uh\nHopefully I'm finna meet these niggas up in heaven, uh\nI feel like I'm lost in my mind sometimes, uh\nI feel like I'm dropped like a dime sometimes, uh\nI'm just trying to find out what's mine sometimes, uh\nI'm just trying to find out what's mine sometimes, uh, ayy\nI get lost in the sauce way too often\nUh, bought my soul back like I fuckin' sold it\nUh, aye, huh, this shit cold, this shit scolding\nYuh, ayy, I wonder what happens when my life over\nSometimes I think it's coming up\nI think they runnin' up\nSo yes, I'ma keep my .40 tucked\nI cannot go out, I cannot go out\nI will not go out, I gotta show out\nI ball too hard on these niggas, it's a blowout\nYeah, it's a blowout\nUh, yeah, ayy\nSuicide if you try to take my drugs\nSuicide if you try to take my drugs\nSuicide if you try to take my drugs\nHomicide, baby would you hold my gun?\nSuicide if you try to take my drugs\nLive a lie, look at all the shit you've done, uh\nSuicide if you try to take my drugs\nHomicide, go on and hold my gun\nSpecify, all the lies you've told\nLook at me, what am I on?\nPercy, molly, xanny, all that shit in one mix\nI'm so high that I cannot remember to forget\nMatter of fact, let's just take a sec\nRest in peace to the niggas that left\nRest in peace to the niggas that left\nAnd praise all the niggas that's left\nI feel like I'm up in my prime\nBut who am I gon' share my prime with?\nWho am I gon' share my time with?\nSometimes it's just perfect timing\nSinging like I'm CeCe Winans\nDamn, this shit's unwinding\nYuh, yeah, yeah, ayy\nSuicide if you try to take my drugs\nHomicide if you try to rob my plug, ayy\nHomicide if you try to take my gun\nI'ma hit a lick like I smack that tongue, yeah\nSuicide if you try to take my drugs\nHomicide if you try to rob my plug\nHomicide if I'm reaching for my gun\nI'm not the one, I'm not the one, ayy\nR-I-P\nI'm sad, I know, yeah\nI'm sad, I know, yeah\nI'm not the one, yeah\nI'm not the one, yeah", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}