{"songs": [{"title": "Bosses", "album": null, "year": "2018-08-10", "lyrics": "[Intro: Future]\nPluto, Slime, we're about our own shit nigga\nGot that bag on us right now, we trap out this bitch\nKing shit, yeah\n\n[Chorus: Future]\nBiggest bosses, bosses, what's the tab, what's the tab on it?\nI had to gamble for this life and put my last on it\nPaparazzi taking pics, I got a mac on me\nPaparazzi snapping pics, I got that sack on me\nToo much Fettuccine on me, you ain't never gon' make me leave\nAnd we going crazy, crazy about that bag to say the least\nEverything paid off, we dropping cash on it\nI got your stash on me, it make you mad, don't it?\n\n[Verse 1: Young Thug]\n(Yeah) I got a bag on me, couple jags on me\nValet Neiman Marcus, couple bags on it (Splash)\n100k a show, I just plan on it\nTold that hoe to go, bounce her name, skin 'em up\nI'm in a brand new 'Rari, boy, you got get your hemi up\nPour up act, got a bottle, pick that Henny up\nMake a move, set 'em up, etcetera\nXanny in the champagne, nigga, big old bubbles\nBiggest bosses of all bosses, make it triple double\nAnd about paid it all the way you can't get up on us\nThe purses, they all by Chanel, yeah\nIt's our time, nigga, put it on the shelf\n\n[Chorus: Future]\nBiggest bosses, bosses, what's the tab, what's the tab on it\nI had to gamble for this life and put my last on it\nPaparazzi taking pics, I got a mac on me\nPaparazzi snapping pics, I got that sack on me\nToo much Fettuccine on me, you ain't never gon' make me leave\nAnd we going crazy, crazy about that bag to say the least\nEverything paid off, we dropping cash on it\nI got your stash on me, it make you mad, don't it\n\n[Verse 2: Future]\nEverything paid off, we kill shit like Adolf Hitler\nI read up on new whips and I read up on hittas\nEight figure nigga, damn, I should have played for the Clippers\nKing Pluto, King Slime, between us two, we'll pimp you\nFive-star restaurants, they getting bought out\nPut them bells in the air and cop the new sky loft, yeah\nEvery day I switch Margielas, niggas ain't on my level\nAin't cutting off my rebels, ain't cutting off my fellas\nSipping these lean, yeah, got me going AWOL\nThey cleared the scene, yeah, when they heard that K talk\nBillie Jean, yeah, Patek do the moonwalk\nFuck your team, yeah, we gon' knock 'em all off\n\n[Chorus: Future]\nBiggest bosses, bosses, what's the tab, what's the tab on it?\nI had to gamble for this life and put my last on it\nPaparazzi taking pics, I got a mac on me\nPaparazzi snapping pics, I got that sack on me\nToo much Fettuccine on me, you ain't never gon' make me leave\nAnd we going crazy, crazy about that bag to say the least\nEverything paid off, we dropping cash on it\nI got your stash on me, it make you mad, don't it?\n\n[Outro: Young Thug]\nVroom, Yeah, Yeah", "image": "https://images.genius.com/383bdf7e658c81236926af98a9211465.780x780x1.png"}], "artist": "Future"}