{"songs": [{"title": "Reddit AMA", "album": null, "year": null, "lyrics": "1. J.Cole first off I loved Born Sinner! My question is why did you create the website stream for the album before it even came out?\n\nCole - so fans didn't feel so bad for listening early\n2. What did your homie who was disappointed your first Dead Presidents freestyle think of the second one?\n\nCole - he was silenced forever. wasn't my homie, knew him through somebody else. but he's on Mute now\n3. If there was one thing you could've done differently music-wise, what would it have been?\n\nCole - sell Friday night lights\n4. What is one musician you love that most people would not expect you to listen to?\n\nCole - Eric Clapton\n5. Hearing that you're a big Outkast fan i'll ask you this; ATLiens or Aquemini?\n\nCole - DAMN. That's tough. But Aquemini\n6. Can you speak on your favorite track on Born Sinner?\nCan you speak on your production process you took on Born Sinner?\n\nCole - First answer! Favorite song is too hard to decide. But I will say Runaway is definitely in the running. The verses!\nProduction process is an easier question to answer for me. I just let it FLOW. Normally I start out by finding drum sounds and patterns that make me move. for instance, Runaway started by flipping a real dirty drum loop, then adding a harder kick on top. Once i get drums that Move me and excite me, I look to add music (samples or something i'm playing) that make the marriage complete\nBorn sinner plays with a lot of Double time tempo's. Shit like power trip, that moves your head as if it's fast paced. but in reality, its technically a SLOW beat. The breakdown on LAnd of the Snakes another example. Or rich niggas\nThanks for the question\n7. What internet sites do you frequent, non-music related?\n\nCole - can i be honest? without getting killed off by Reddit community. I go to Digg a lot. I know Reddit ethered Digg a while ago, because of the amazing COMMUNITY experience of reddit. But I still rock with them\nDon't taze me bro\n8. Why wasn't the beat that was used in the first Born Sinner uStream used on the album?\n\nCole - Didn't like the verses on it! they were hard but sometimes a beat is so good it's overpowering and intimidating. that beat is like that\n9. What did you have for lunch today?\nAlso, what's your favourite music video?\nYo i got another one, what's your favourite kind of booze?\n\nCole - haven't eaten yet today. you just reminded me that i need to eat\n10. Have you received any feedback (positive/negative) about your “Faggot” bars on Villuminati?\n\nCole - yes. i'm a communications major, studied PR. I knew what I was getting into. The comment I gave to Huffington Post was genuine and the reason why I wrote those bars. The line even makes me uncomfortable, but it's worth it for the sake of the conversation\n11.  What was the most meaningful song on Born Sinner?\nTo me it felt like you poured your heart out and went all in on this album. Love the work. Keep it coming, you're for real, man. Changing the game..\n\nCole - There is a lot of MEANING on the album. so most meaningful is hard. But I really love the title track \"Born Sinner.\" Because even though there's lots of pitfalls, temptations, dangers, and tribulations on the album, it ends in a hopeful place with \"i'm a born sinner, but i'll die BETTER than that\" listen to those verses for more clarity. plus i touch on the things that are really important to me. relationship (got her life in my grip), family (she hate the way she raised me but she loved what she raised), friends (if i died today my nigga was it business, was it personal?)\nThank you\n12. Kid Cudi self-produced the whole album, Indicud, like you did on Born Sinner. What is you personal opinion on INDICUD?\n\nCole - I haven't heard INDICUD because I was working on my album. But I'm really mad at myself for not finishing a verse for that album in time. Got in the studio with Cudi and he was cool as shit. Good dude. I never did my verse and the joint was harddd\n13. One thing that I think everyone here wants to ask: Can you tell us anything new about your upcoming album with Kendrick Lamar? I really love Born Sinner by the way, can't wait to see where you go next, but I want to emphasize how good what you're doing right now is. And thanks for doing this AMA!\n\nCole - Thank you. This question will be asked a lot so I'll just answer it here. We have some really good songs in the stash, but haven't had a chance to properly work on a project. An album will come in the future, but probably not this year. I'm just happy for my niggaaa\n14. How did it feel when you heard Nas on Let Nas Down Remix?\n\nCole - Surreal. Today is my first day off in a LONG TIME (other than this. but this isn't WORK) I plan on soaking in that moment tonight and really reflecting on how amazing that is\n15. What made you want to work with James Fauntleroy? He is incredible\n\nCole - This is weird. You asked me a question. And then answered your own question\n16. did you have a fan base before you you got signed?\n\nCole - yes. i called them friends\nThat was it really. few hundred people had heard The Come Up, and School Daze was popping on my myspace page. No buzz though. Just skeelz\n17. Favorite nba team?\n\nCole - no real team loyalty. just follow players now. Looking for a home. my last favorite team was the KNICKS because Penny Hardaway's last real playing years were there (and i just happened to be in NYC for college). Before that it was the Magic, then the Suns. NEVER FAVORITE A TEAM BECAUSE OF A PLAYER, when he leaves you're gonna be lost in the world\n18. So....have you met Jay Electronica? How's he like?\nWho's your favorite celebrity that you've met/would like to meet?\n\nCole - jay electronica has the most phone numbers out of anybody i ever met. He changes his number every 16 hours\n19. How did you celebrate the release of born sinner?\nCole world\n\nCole - got twisted tuesday night with friends and fam in NYC while feeling really grateful and relieved and blessed and happy\n20. COLE I HOOKED YOU UP WITH THAT GIANT BORN SINNER PIC BY YOUR NAME, PLEASE ACKNOWLEDGE YA BOY'S EXISTENCE\n\nCole - acknowledged\n21. Congratulations on Nas's remix to your joint Cole!\nListening to your songs I often get chills. Songs such as God's Gift, Return of Simba, See it to Believe it and too many songs off of Born Sinner! Has there ever been a song you've heard whether it be from Nas or someone else that has blown your mind and influenced your style greatly?\n\nCole - Nas- Undying Love Eminem- Stan just mind blowing concepts tons more of course from more than just those rappers\n22. Why Did you try and compete with Kanye on the 18th? Wouldn't it make more sense to have your album release on a day with less competition?\n\nCole - Just followed my instincts. I was confident in the album I had. Didn't know what he had, but didn't care. Wanted to start the conversation. I've had a #1 album before. It's cool. But I wouldn't have been able to live with myself wondering \"what if I would have moved my date?\"\n23. Hi J. Cole. I have a few questions for you but first off I would like to say thank you for taking time out of your day to do an AMA here on HipHopHeads. I've been a big fan of yours ever since my friend at school introduced me to some of your songs last year. I really wanted to come to your Atlanta show a couple of days ago and support you and buy some merchandise but I found out that there was an age limit, and I am only 15\nWhat are your favorite things to do outside of rapping?\nWhat job would you like to have if you didn't rap?\nWhat has been the hardest part of your rapping career so far?\nDo you think of yourself as \"famous\" now that you have had two successful albums?\nAre you going to be releasing any winter merchandise for Born Sinner? I would really like to have a hoody with the album art on it and wear it all around my campus\nThanks again for doing this AMA, I am looking foward to future album and mixtape releases\n\nCole - If I didn't rap I have no clue what I would want to do. Would take a lot of self re-evaluating to figure that out. Too much passion for music to think of something else right now\nHardest part of my rap career so far was finding the balance. How to become a mainstream artist without losing myself. Took a lot of experimenting, trying things, sometimes failing. But I found it\nBorn Sinner CROWN Hoodies on the way\n24. What did yourself and Drake do with all those copies of the album you bought?\nWhat was your first feeling when the album leaked so far in advance?\n\nCole - I don't even know what happened to those copies. Hopefully they gave them out to the people\nMy first feeling when the album leaked 12 DAYS IN ADVANCE. was \"oh fuck\"\n25. Thank you for doing this AMA J. Cole, to see my favorite rapper come to my favorite online community is really something special\n3 days before Sideline Story dropped I was at your concert in Tampa, and you shouted me out at the end while doing Farewell, I was the white kid wearing a Dreamville shirt, here's a picture of me from that night http://imgur.com/dtNJLZ1 When you have your next concert in Tampa, or the closest other venue, I plan on wearing a shirt that says \"Produce with J. Cole or Die Trying\" I would really just like to get some advice on producing, it's become something I love to do, and you are amazing at it\nAnyways, my question for you is how does it feel to have your idol, Nas, rap over your own song, saying that he is proud of you?\nThank you once again, I've been a fan since The Warm Up, and your music has gotten me through some very hard times. Sorry for fan girling, but I've seen in interviews how you've talked about how much you liked Nas as a kid where it felt like you knew him, and that's exactly how I feel about you. Keep making amazing music, and thank you for helping bring back the real\n\nCole - thank you. i'm going to do a real tour in the fall\nI answered the Nas question. Really just wanted to say thank you for listening. And I just heard we beat Edward Snowden for #1 on Reddit. AND I AIN'T HAVE TO BETRAY THE US GOVERNMENT!!! jk jk jk jk (does anyone still use jk.. felt like a 12 year old girl typing that)\n26. What are your favorite shows on TV? (More importantly, do you watch Breaking Bad?) lol\n\nCole - Newsroom is my favorite show. House of Cards too. Breaking Bad is incredible, I only saw the first 2 episodes and planned on watching every episode of every season to catch up. But never had time. So NO, I don't watch it but wish I could\n27. Hey Cole. Born sinner is easily the best album that came out on June 18th and your production and rapping was on point. I got two questions for you\n1) Why did you decide to not have any guest features spit a verse on Born sinner?\n2) When can we expect your collab album with Kendrick?\nThanks for doing this ama Cole!\n\nCole - Thank you! By the time I was wrapping up the album, I started doing interviews and getting questions about features. I didn't have any rap features, and I felt pressure to ADD some, but quickly realized that I had already said what I wanted to say on this album. The mentality was \"who says you HAVE to have other people rapping on your album?\"\n\n2) Don't want to put a date on it\n28. If you could, would you have done Born Sinner differently?\n\nCole - nope", "image": "https://images.rapgenius.com/9ceb05d47172e4d9291ae84ee4bda853.495x205x1.png"}], "artist": "J. Cole"}