{"songs": [{"title": "Sunday Morning Jetpack", "album": "I Decided.", "year": "2017-01-21", "lyrics": "[Chorus: Big Sean]\nThanking God for all my setbacks\n'Cause he the reason I'm able to get back\nThis feels like my Sunday morning jetpack\nFeel like I sent the prayers up and got blessed back, whoa\nFeel like I sent the prayers up and got blessed back\nThis feels like my Sunday morning jetpack, yeah\n\n[Verse: Big Sean]\nThis the feeling know that I've been missing some days\nThis feel like I'm headed to paradise one way\nThis feel like the family dinners that we used to have on Sunday\nWith Grandma in the kitchen making rum cake\nOr this spread she used to do for Thanksgiving, man\nThis feels like the first time I heard Killa Cam\nPink Timb's, in the Lamb\nMixing it in with Dilla and\nHeadphones to the ceiling fan\nBucket hat like Gilligan, yeah\nLately, I've been talking to ghosts\nDidn't learn faith in school but that's what I'm testing the most\nYou know I still rep you when you're gone, though\nI got a picture of us on the front lawn\nWith me, grandma and mom, that night I went off to prom\nWishin' you could see the lights all dijon and parmesan\nFunny thing about it is you always act like you knew\nYou told me how you were feeling before it happened, before it do\nAnd you taught me I'm a product of everything I go through\nAnd you and grandma went broke so we would never get bruised\nYou the reason that I ever touched my first Franklin\nFast forward, I'm in Kanye crib with Kirk Franklin\nIt reminded me of how we always used to dress up as a family\nAnd go to Sunday service, and being in church singin'\nAin't been to church in a while\nBut it ain't just about how you just praise him in the building\nIt's about how you praisin' him while you out\nYou taught me to remember that when I get set back\nBeen through the worst times to get the best back\nWishin' for a time machine to jet back\nTo my all time low self and throw me a jetpack, woah\nAnd see you again, needless to say\nBack when I dated Alisha, Simone\nOr any other girl who looked like Lisa Bonet\nWho was jealous of me and Jhené\nWho you would always advise with me being away\nYou was right, but I had to learn for myself\nI guess a time came for me to earn for myself\nI hope that this is somewhat of a thank you for all your help\nHope the angels take care of you until I see you myself\n\n[Bridge: The-Dream]\nPraise, so many times I prayed for you\nI put up prayers for you\nPraise, for all the times that you prayed for me\nAll the nights you stayed by me\nAll the nights that you cried and all the days I coulda died\nBecause of you I survived, because of you I'm still alive\n\n[Chorus: Big Sean]\nThanking God for all my setbacks\n'Cause he the reason I'm able to get back\nThis feels like my Sunday morning jetpack\nFeel like I sent the prayers up and got blessed back, whoa\nFeel like I sent the prayers up and got blessed back\nThis feels like my Sunday morning jetpack, yeah\n\n[Outro]\nElder Sean: You gonna let it ring forever? Answer that!\nMan: Yo, she keep calling. Yo, and your dad left you a voicemail, and your girl keep calling\nSean: Ah fuck.. I got to call her back. Aye, yo pass it to me real quick. Hello? Hey ma", "image": "https://images.genius.com/15fe74f551404783e7b7cb1a8ba102e9.1000x1000x1.jpg"}], "artist": "Big Sean"}