{"songs": [{"title": "Neva Gonna Give It Up", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "[Snoop Dogg]\nD.P.G., G.C. - (X 4)\n\n[Kurupt]\nSmash, just before you talk spaz out\nHittin' the switch then hittin' the stash\nBefore the year 2000 all the computers crash\nI'm gone homeboy, this the hood where it's on homeboy\nI'mma live long homeboy\nToo deep, too strong homeboy\nWe rollin' too deep with two zones homeboy, it's on homeboy\nZones with two candy's painted bronze homeboy\nD-A-Z, I can't believe this nigga gon' trip\nHe's nothin' but a busta, bitch ass motherfucker\nWith Snoop in a coupe, Warren, Nate, and Big Tray Deee\nBig C-Style and Meech, made to be\nShine Dogg gettin' super-high, lit, lifeline high\nSoopa-doopa high with Soopa-doopa-fly\nI'll put ya in the mix\nI ain't with that Kibbles-N-Bits shit\nBitch, where's the grip?\n\n[Hook: Nate Dogg] - X 2\nI'm still a Dogg Pound nigga\nI'm never gon' give it Up (D.P.G., G.C.)\nNever gonna give it Up\nC'mon homies give it up (D.P.G., G.C.)\n\n[Warren G]\nWhat I'mma do? - I'mma bang on the beat\nWhat I'mma do? - concoct and serve heat\nYou lookin' at me, I'm scopin' on you\nBut you don't know my shit is right nigga, so fuck you\nEverybody talkin' 'bout \"Money Ain't A Thang\"\nEverybody talkin' 'bout how they gangbang\nIf you was hard as me, I'm as hard as you\nCut throats and bud smoke, I'm a Eastside loc\nSo don't let the crossover fool ya\nI've been down since '81, L.B. Top Gun beotch\n\n[Nate Dogg]\nPlatinum ass records that be payin' bills\nDogg Pound niggas, they be bangin' still\nMoney makin' niggas and they bonafide\nThem money makin' niggas still down to ride\nAll them other niggas, they be claimin' thangs\nScary ass niggas wasn't born to bang\nHang with D.P.G. and I can give ya game\nComin' from the hood, you can't be changin' gangs\n\n(D.P.G., G.C.)\n\n[Kurupt talking]\nYeah, bitch ass niggas\nDogg Pound Gangstas\nFuck y'all\n\n[Hook: Nate Dogg]\nI'm still a Dogg Pound nigga\nI'm never gon' give it Up\nNever gonna give it Up\nC'mon homies give it up\n\n[Tray Deee]\nYeah, I'm from that click that slap clips with hollow-point tips\nAnd serve bitch niggas quick with this gangsta shit\nTray Deee, ya heard of me, murder be my hobby\nBangin' and slangin' and dangerous robberies\nFuck a mask, you bustas duck when I blast\nI'll take the cash, and put a cap up in that ass\nSaggin' with my rag, 'bout to drag the street\nTriple-X sweatshirt with blue Chuck's on feet\nKilla instincts keep me ahead of my foes\nNever doze when I rose, let the chrome explode\n\n[Snoop Dogg]\nMan, I wish a bitch would try to get me for some child support\nI'll stuff my foot up her ass, like a super sport\nDown shit, Pound shit, gangsta\nForever, whenever, however, down for whatever\nRecognize game when it hits ya, nigga\nIf ya slip up Doggy Dogg's gonna get ya\nBeen doin' that thang-thang, long tryin' to slang 'caine\nJust before I was taught - how to gangbang\nAll my peers through the years know\nThat Snoop Dogg ain't nothin' but a fool though\nAnd if ya run up on that man tryin' to do-low\nThat's when he - pull out his homie\nWho? - you know\nMan I been through so much and I'm still goin' through it\nBut fuck all that, I got to stay into it\nI knew the job was dangerous when I took it\nShit, a nigga didn't even overlook it\nI was so eager, just tryin' to get involved\nBut now I gots to represent for me and my doggs\n\n[Soopafly]\nYeah, '94 - became a D-O, double-G P-O, U-N-D Gangsta\nNow you can see me smokin' dank, your neighborhood pranksta'\nPlay a trick quick, intimate then out no doubt\nPaperboy with a new route\nWhen I'm in front, they watch behind me\nMission: Crush, ready to bust, grab the tommy - gun\nKeep one, I role with the heat seeka\nStash the gauge, pass the nine to my neega\nRoll, keep slow, peep, po-po\nCreep slow, ready to smash with the fo'-fo'\nI go for broke with loc niggas who tote guns\nNever understood niggas high-up with low funds\nSmoke one, represent my seaside ocean\nEastside motion, we slide coastin' through\nMotherfuckers!, ha ha ha\n\n[Snoop Dogg talking]\nDogg Pound motherfuckin' Gangstas\n1999, back up in this BI-YA-ITCH!\nEastside up Eastsidaz\nAnd niggas thought we fell off...\n\n[Hook: Nate Dogg] - X 3\nI'm still a Dogg Pound nigga\nI'm never gon' give it Up (D.P.G., G.C.)\nNever gonna give it Up\nC'mon homies give it up (D.P.G., G.C.)", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}