{"songs": [{"title": "Outro", "album": "Lupe Fiasco’s Food & Liquor", "year": "2006-09-19", "lyrics": "[Verse: Spoken]\nUh\n1st & (1st &) 15th (15th)\nWoah, uh!\nLupe Fiasco's: Food & Liquor\nIs lovingly, hand-crafted and done\nBy the good folks, at 1st & 15th, yeah!\nMuch love to the F&F crew\nBryce, (yeah) Gemini, Shayla G\nPro, Soundtrakk, Jason Salvador\nSimon, Bishop G, Bran Dog\nG-Ball, G-Ball, yeah!\nAll the engineers, Chilly Chill, mixers\nEsco, much love goes out, to Rita Lee\nThe Buchanans, Suzis 'N Uzi\nEverybody that...helped this project from day one\nCan't forget, Bolo, Footloose\nYou know, the incomporable DJ G.I\nKim Lumpkin, Bizzy, Spores (you heard)\nMarcus, Mr. Mark Pitts, L.A. Reid\nDrew, Tyvee, Success, the whole FTK\nYou know, Mr. Mike Love, Bulumaster, what up!\nCan't forget, Veedaugh, DJ Pharus, Coops, DJ Timbuktu\nK-Scratch, The Base Man, Boogie Boy\nDJ Semtex, 279, Dr. Wax, Jason Eavre, HMV, Envy\nWhat up, Envy? Get Real, Flex, Funk Master, Flex, yeah (Violet)\nCan't forget E-Nyce, (Eric Lowe), the entire Bum Squad DJ family\nShout to Loud Prince, Crystal Bubblin', (Paul Wall)\nAll of the heavy hitters, (Trey Songz), all of the Murda Mamis\nCan't forget Kay Slay, Cipha Sounds, Amanda Diva, (Sirius Radio)\nDJ Chop, (Enough), DJ Hyphen, Greg Street, you know I'm talkin' 'bout?!\nAll the radio stations around the world that hold me down (Music Choice)\nCan't forget 'em all, E-bro, WGCI, Pie 92, Hot 97, Choice FM, BBC One Extra\nAll the pirate stations, can't forget Tim Westwood, all the music video channels\n(Gomez Warez), Tiffany Green, (MTV), Elroy Smith, (BET), Bam (and VH1)\nCan't forget my big homie, Sean Deah. (Hawaii Mike)\nWhat up, baby? There from day one!\nCan't forget K.T., Alazay, the whole Raw Dough Brackets\n(Mr. Perry), The Pack, even though we no more\nMr. Star, much love to Navi, Butcher, D-Lo, (Miss Cole)\nButcher source of Quran right now, it's all good, much love to ya!\nAll my teachers (ya heard!), Mr. K\nAll of the artists—my fellow artist in the game that hold me down and help me out\nTalib Kweli, (Mike Sanders), The Roots—shout to Black Thought—Mos Def\nCan't forget, (Consequence), just...(Rhymefest!) everybody, Three Six Mafia man\nSway! Decipher! The whole Star Track, (Rakim), Pusha T, Clipse, Push Konflict\nSlim Thugger, Swisster, (Ab-Liva), Psychodrama, Shawnna, GLC, Really Doe\nThe whole GOOD Music, Ibin Don, C. John, Monopoly\nMr. Kanye West, you know!\nCan't forget, Stack Bundlez, what up b?!\nUh, Poo Bear\nEverybody showin' me love—my whole Fort Minor family!\nStyles of Beyond, Kenna, Apathy, Candy Pop\nShout to the whole Demigods\nCan't forget Craig G, who wants me to wear the crown but I tell him I can't (*laughs*)\nThe Gorillaz—shout to the Gorillaz, ya heard, uh!\nShout out to The Desk, all the radio personalities, you know I'm sayin' where I'm from (Scars)\nChi-Town (ya heard!), Chicago! Uhuh (Man!)\nShout to Bionce Foxx, Kid Robot, shout out to Roxy, (Tre), shout to Miss Jones Too Hot 97\n(Choco Joc), everybody gave me looks, shout out to all the magazines showin' me love, holdin' me down\n(Nakid) Especially The Fader, gave my first cover, (Samsil), shout to Billboard, gave me the cover\n(Crazy Howard McGee), shout to Vibe, Source, XXL, shout to Kicks Exclusive, got a cover\nShout to GQ, (Cash Carter), you know Rolling Stone, shout to all the internet sites—OkayPlayer\nAll Hip-Hop, School of Hip-Hop.com, (MySpace), you know, showin' me love, a thank you!\nAll my fans! Shout to Hypebeast.com, shout to Kevin Mar, I love my fans\nShout to all my Streetware family all my skater dark heads out there\nShout to Slam Excite, (Tony Hole), shout to Hustlin' Body.com, Freshness Mag.com, (DGK!)\nShout to all the stores that around the world that are holdin' me down, (Steve Williams), Maharishi, DPMHI\nShout to Harley Bleckmen, Damien, and my big brother Nash Money Dollars\nAlex, shout to mag the over Slammin' Kicks, Dough Street, Ben Jury\nShout out to Lamessie and Amanda, from LMAC\nDown in Singapore, (Voss!), yeah, my lil' brother Dano, Dano West, Salaam-al-aikum\n(Street Connoiseur)\nShout to my big brother Ian, stayin' out for Kicks Hawaii Crew (Crabby, Henry), Aloha! Huh..\nAubrass, shout to Ricky Kim, shout to Chuck Anderson (Ken, The Riot), The Billions.com\nShout to Vergil, (Jackson Hennessey), shout to Benjamin, shout to the whole crew (Righteous!)\n(Kung-Fu!), shout to the JB Classics, you know, shout to my big homie Rob Hebler\nWiggly Drop.com, (Hot Dogg!), shout to my man Chris Gibbs over at Union\nBig shout out to Edison Shay and the Chopstick MC, the whole Kli family, yeah\nF&F Hong Kong, what up! You know, it's mad long, right? (*laughs*)\n(Henry Lovell), shout to Keep Up Neighbour, San Francisco\n(Nathan), shout to my homie Julian, (Cabrerra)\nOut in Paris, holdin' me and my man Jason down, much love!\nShout to Miami Girl, L.A. Barracuda, shout to Dave Ortiz, Dave's quality, (Meats!)\nYou know how the long two way fashion thing, shout to my man Rolf from Artful Dodger\nMatt Anger, of Reebok, shout to the whole Reebok staff holdin' me down\nYou know I'm sayin', Q Gaskins, Q!, Its \"Food & Liquor\" time baby!\nShout to Matt Inc., shout to Wendy, shout to Liz Cardozo, all my family up at Reebok, (Pam's Am!)\n(DC Shoes), it's all forgiven, ya heard!\n(Shout to Kevin Hana), shout to every club promoter, every show promoter, out there\nShout to my big homie Neil, much love to you homie thank you! (Christopher Adams)\nMuch obliged, much appreciated, shout to Mark Sheeder, Kevin Black, shout out to Kevin Black\nJust make sure you get yours man, I'm aware\nShout to the entire Atlantic Records staff, Greg Helman, Julia Greenwald\n(Warren Geese), Emmanuel, Keyzer, James Lopez, (Doug Horn), Sylvia, (Diane)\nThe lovely, talented Veronica Alvarici\n(Latrice), the lovely and talented Camille Hackney, Cindy Marcuson, (Brian Singjon), (Jules)\nKatherine—I can't forget you\n(All of the secretaries and), LaToya Sterling (and assistants and the interns)\nAndrew, you know I'm sayin' (Noah)\nShout to Tamara (Scott), shout to Ayesha, (Crespo), aight!\nJohn McMahon, (Nice!), shout to the building, they show me love, they be like \"Watch out Lupe comin' through!\"\n(Damon, Cookie), The Nasty Boys, shout to the whole One Music group, Leo Con, (Mel) and Mr. Kevin Lauch\n(Rick Betterman, Marcus Youst) Thank you for comin' out man (Darrell Thomas)\nYeah, it was appreciated far beyond you'll ever believe, you know what I'm talkin' about (Scott Francis)\nShout to Carlene, Marcia, the whole Def Jam staff too, it's weird cause I'm doing Def Jam shout outs\nBut I got to because they, they, they holdin' me down (G), shout to Tata, shout to Linnie S\nShout to Beehive, Samantha Hill, (Guru), it's much appreciated, believe me (Just Blaze), Sean Healey\nShout to Glasses Malone, what's up! (Sagon), Constantine, Big Chuck, yeah! Doin' his thing right now\nShout out to Karen Quark, oh man, Karen Quark, yeah, we did it baby!\nDavid Enriquez, shout to T.I., whole Grand Hustle, (Taro), you know what I'm sayin', yeah!\nHere's the whole crew everybody, from that crew that hold me down, everybody around the world!\nThat hold me down, I love you\nShout to my family, my mother, my father, my brothers, my sisters, my nieces, my nephews, my aunties, uncles\nYou know I'm sayin', I love all y'all, you know, I love all y'all\nI ain't gon say no names, but I love all y'all\nShout to all my homies on the block, Madison Street, whole Surrender Crew, shout to Cole Cheece\n(Jaguar, what up!) shout to Aida, shout to Antoine, shout to Moon, shout to Shawn, (Tikaboo), Nick Luda\nShout to everybody, shout to all y'all man, shout to Li'l Man, shout to (Miss Gartley) Dough Boy, shout to Napo\nThe Original 1500s, (Lupe), Bishop G, L-U-P-E, we still here! Keep on hustlin', I guarantee, God willin'\nRest in peace Randy, shout out to Shakapilva, see I called you as one of the last ones (whole Chicago, aye)\nBut I got ya, you know, the whole Wild Moneys\n(SOATS, Northside, Southside, Eastside, Chicago), get up outta here\n(Man! Westside!)\nThis has been, Lupe Fiasco's Food & Liquor comin' to a close, peace!\nNext album, Lupe Fiasco's (and much love to ya) The Cool\nIf I forgot, (Astaghfirullah!)\nI'll catch you on the next one\nSalaam-al-aikum!", "image": "https://images.genius.com/373c57c9cfddd95f1d232784084809ba.500x500x1.jpg"}], "artist": "Lupe Fiasco"}