{"songs": [{"title": "Apple Cobbler", "album": "The DEFinition", "year": "2004-08-31", "lyrics": "[LL Cool J]\nUhh.. uhh.. uhh.. uh-huh\nUhh.. uhh.. that joint is hot baby!\n\n[Verse One]\nLights, camera, action - hold up\nYou know my style, I been blowed up\nPaper was young, now it's growed up\nStacks so thick it's hard to fold up\nYo B, find another rubberband in the truck\nCount up the money, I'ma stand in the cut\nStroll in the party and I toast Cris' up\nTell that a muh-hucca gets this up\nShake that cookie like what like what\nToss me a drop it's like lightning struck\nLook at that apple cobbler butt\nWhatchu wanna do, whatchu think?  Want cut\nNBA Live in my truck\nParkin lot like all jammed up\nIf there's beef it's best you duck\nI'm gon' eat 'til I'm filled up\n\n[Chorus: Timbaland]\nThrow it to me - that apple cobbler\nBaby it, can I see (can I see) that apple pie?\nI said throw it to me - that apple cobbler\nBaby it, can I get (hey) can I get it deep fried?\n\n[Verse Two]\nSo much sugar it's makin my head rush\nTell me what the recipe is for that stuff\nBreak me off a piece of crust\nI'm so full I'm bout to bust\nJust one slice is not enough\nDang that thang tight like handcuffs\nWhat I gotta say to you for you to give it up?\nWhat if I was payin you so you could live it up?\nHoochie seats inside yo' truck\nTiffany rocks and trillion cuts\nYou be Starsky, I be Hutch\nRide shotgun, I pop that clutch\nJuicy sweatpants drive me nuts\nTake my 2-way, stay in touch\nI'm gon' scoop you, heat you up\nTake you, bake you, eat you up\n\n[Chorus]\n\n[Verse Three]\nTurn that hair 'round, buck them hips\nLove when your hair get stuck to your lips\nApple cobbler sweet and thick\nI'm gon' eat you 'til I'm sick\nYo' dessert is worth a grip\nI admit you make me trip\nMake me wanna run to the mall like I'm a trick\nI can't believe you're makin a baller have a fit\nTrippin, switchin past my clique\nLick that juicy, ask my clique\nStretch them jeans girl make them fit\nMake me go outside and pit\nYou know me, my cake is sick\nMe and Timbo makin hits\nApple cobbler, thick and rich\nJust how hot can one girl get?\n\n[Chorus]", "image": "https://images.genius.com/b42398fade2d37f1bf7eaa68c9bd69dc.1000x1000x1.jpg"}], "artist": "LL Cool J"}