{"songs": [{"title": "My Favorite Song", "album": "Taylor Allderdice", "year": "2012-03-13", "lyrics": "[Intro: Wiz Khalifa]\nGone, gone, gone\nI'm ballin too my nigga\n\n[Hook: Wiz Khalifa]\nWhen this song come on, I'm spending money\nPlay something I can spend some money to\nWhen this song come on, I'm spending money\nPlay something I can spend some money to\n\n[Verse 1: Wiz Khalifa]\nHighly faded, but I'm highly paid so I just live my life\nThat shit you niggas tryna do, I guarantee I did it twice\nThey say life's a gamble, hit my joint and roll the dice\nWhen you living this high, you can't be afraid of heights\nBook my flight to Vegas, Will, 20 thou- to stay the night\nAnother 10 on champagne, my money long, I pay the price\nTired of niggas saying they in my gang cause dog, we ain't alike\nI'm throwing money, when I walk up in this bitch, they know it's money\nMoney in my arms, other table full of money\nPocket full of joints I rolled, dropping ashes on my clothes\nBalling super hard, smoking 'til I overdose\nHardly ever sober, bitch we party 'til it's over\n\n[Hook: Wiz Khalifa]\nWhen this song come on, I'm spending money\nPlay something I can spend some money to\nWhen this song come on, I'm spending money\nPlay something I can spend some money to\n\n[Verse 2: Wiz Khalifa]\nNiggas always hating on me, talking 'bout I'm balling too\nGet your money up and quit your hating's what you oughta do\nI been going hard since I was young when I was in my teens\nI knew when I got older I'd be on, so now I do my thing\nSpending money, popping hella bottles, making niggas mad\nGoing places, rolling Js, I live the life you wish you had\nThrowing out dollars bills, putting shit on my tab\nGot a joint full of that OG, got a clique full of them OGs\n\n[Verse 3: Juicy J (and Wiz Khalifa)]\nTrippy nigga hit the club, you know I be fucked up\nChasing after model chicks, tryna get my fucks up\nNiggas handcuffing hoes, but them niggas know what's up\nY'all came to the club together, but that ho gon' leave with us\nBreak out the blue dream, e'rybody rolling up\nWhere the lean? Where the cups? Ho, it's time to po' it up\nTell the owner we ain't leavin', we gon' buy the whole club\n(Now my dollars to the ceiling, and my card ain't got no limit)\n\n[Hook: Wiz Khalifa]\nWhen this song come on, I'm spending money\nPlay something I can spend some money to\nWhen this song come on, I'm spending money\nPlay something I can spend some money to\n\n[Interview: Wiz Khalifa]\nWe be in the clubs with all those motherfuckers\nAnd we spend more money than all of them niggas\nThem niggas who be thinkin' they hard\nAnd they think they're motherfuckin' this and that\nYeah, 30 racks bitch. On champagne motherfucker\nKeep them sparklers coming, what you doin?\nAnd them niggas be over there and they be quiet\nThat's why Juicy's with us nigga\nCause we spend 30 racks in the club", "image": "https://images.genius.com/cb8d494673bce7114840441aba72863c.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}