{"songs": [{"title": "Match the Name With the Voice", "album": "Genesis", "year": "2001-11-27", "lyrics": "[Intro: Busta Rhymes]\nGreatness, yeah, yeah\nAy yo, turn the beat up just a little bit louder\nTruck Volume\n\n[Busta Rhymes]\nYeah, yeah, yeah, yeah\nWe bout to play a lil' game, match the name with the voice\nSo when you pick your favorite MC you makin' the right choice SO WHO ARE YOU?\n\n[Baby Sham]\nBaby Sham, I'm known for the crud\nFirst night pops off with a couple of slugs\n(AND HOW YOU DOIN'?)\nYou see what I'm workin' wit, it's beyond rap\nStick to the facts, that chapped lips get Carmexed\nPalm that, look where the arm's at, nigga need to launch that\nNow tell me what the problem be, is that I'm scorching dem\nTo flood these streets, hot not partially, cock back the toast\nPut your heart for free, so what it feels like to hear me crushin' a beat\n\n[Rah Digga]\n(SO WHO ARE YOU?)\nThe illest broad Digga, reppin' Brick City\nIf I'm lying may the Lord come strike my left tittie\n(AND HOW YOU DOIN'?)\nUndisputed metaphor rap queen, always cookin' up some shit\nLike mom's a crack fiend, so what's the word\nStrike a nerve when I'm speakin'\nAny MC whether black or white, or Puerto Rican\nI'm the big dog, you just a cat stuck in a tree\nNot one of y'all cocksuckers fuckin' wit me\n\n[Hook: Busta Rhymes]\nSO WHO ARE WE? (Flipmode)\nGot you gaspin' for air, hot shit muthafuckas\nThrow your hands in the air\nWATCH HOW WE DO IT\nHow we rep and yo we solemnly swear\nTo put it down until it's over and our time is up here\n\n[Rampage]\n(SO WHO ARE YOU?)\nRampage, new tenant, pack big still\nFuck what ya heard, I'm ready to kill\n(AND HOW YOU DOIN'?)\nDay criminal, street thug material\nFlipmode Imperial, top breakin' officer\nFuck around we warnin' ya, 21 gun salute\n6 official conrads, ain't afraid to shoot\nNiggas see us, we got them shakin' in they boots\nFlipmode, the streets, bigger than Bayroots\n\n[Spliff Starr]\n(SO WHO ARE YOU?)\nYeah, Spliff Starr, cunt-crusher, gun-busta\nHard-to-toucha, one bad muthafucka\n(AND HOW YOU DOIN'?)\nGangsta bitch, deadly like cancerous\nI bring it where your parents live, show you what your status is\nSteam-boil your cabbages, I can't take y'all nigaz faggotness\nYou about to die, show him where his casket is\nYou wanted beans, I had your hood under siege\nGuns get squeezed, and bullets hit your knees\n\n[Busta Rhymes]\nSO WHO ARE YOU?\nBus-A-Bus now, somethin' fo' sho'\nKeep 'em whilin' till somebody's left a leak on the flo'\nAND HOW YOU DOIN'?\nWe've been awaitin' the God, to make an undeniable entry\nControllin' everything in the yard\nRugged like General Custard it seems\nHow we crush grapefruit, niggas, and make a mustard out of your team\nYou know we hotter than the 4th of July\nSo sit back and watch the fireworks show light up my name the sky\n\n[Hook]", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}