{"songs": [{"title": "Shutupayouface", "album": "The Sneak Attack", "year": null, "lyrics": "Yeah, whassup?\n\nWhassamatta you? (You) Why you lookin so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAhh shutupayouface!\n\nLook at this place!\nWhy was I chosen to pick up the race?\nAnd carry the flame, the torch, the name?\nMillenium games, it's all the same\nSinners repent, many for fear\nEnd of the year, everyone cheers\nOnly a few hear my voice in they ears\nEveryone else well they really don't care\nBut what if I told you I could read the future\nAnd in the future, they the losers\nWe the winners, cause they the sinners\nWell it's all mathematics, can I eat my dinner\nAnd think (think) why was I made to link\nBetween them and the universe; battle, who the first?\nI don't really care, cause I'm really not here\nI'm showin you skill, but you still sayin \"Where?\"\n\nWhassamatta you? (You) Why you lookin so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAhh shutupayouface!\n\nEvery race, walkin around with they head up in space\nThey cannot see that we all really one\nIn any battle I already won\nThank the creator, it's already done\nKRS-One? Leavin 'em stunned\nDunn duh-duh dunn dunn done it again\nMe and Will and my brother named Ken, now let me tell you\nThe bass in your face, the highs in your eyes\nWill make you real-IZE\nIf you down with the Temple of Hip-Hop, you not no average GUY, or girl\nC'mon take a critical look in my world\nSee the metaphysical books that I twirl and twist\nForces the ventriloquist\nI'm just a dummy gettin money at this name Kris\n\nWhassamatta you? (You) Why you lookin so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAhh shutupayouface!\n\nKRS-One, Knowledge Reigns Supreme Over Nearly Everyone\nLook, I be chillin readin a book\nWhile the hip-hop nation repeats my hooks\nAll I wanna see is y'all healthy and wealthy\nYeah we already did it, really what can they tell me\nAbout the pimps and the hoes, players and the clothes\nYou gets no money if you got no flow, no skill\nC'mon y'all it's time to build\nIf you got no skill, how you gon' build?\nBuild, c'mon y'all it's time to build\nIf you got no skill, how you gon' build?\n\nWhassamatta you? (You) Why you lookin so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAhh shutupayouface!\n\nNegative ass..\nWe bring the light!\n\nNorth Carolina - they got me\nFlorida - they got me\nTexas - yeah they rock me\nIn New York City they got me\nL.A. - ha hah, they got me\nCanada - Up North they rock me\nD.C. - Atlanta, they got me\nHa hah - none of y'all can't stop me\n\nWhassamatta you? (You) Why you lookin so sad (so sad)\nKRS is back (he's back!) But you don't look so glad\nAhh shutupayouface!.\n\nGive it to 'em..", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}