{"songs": [{"title": "Mr. International", "album": "Gutter Rainbows", "year": "2010-06-25", "lyrics": "[Intro: Talib Kweli]\nHey! How ya doin?\nWe all gonna be like a bunch of little Fonzies\nWhat's Fonzie? \"He's COOOOL!\"\nYup, meet Mr. International\nOn the runway more than a fashion show, y'know?\nIt's all love like McEnroe\nBut sorry I have to go - one more time yo!\nMeet Mr. International\nOn the runway more than a fashion show, y'know?\nIt's all love like McEnroe\nBut sorry I have to go\n\n[Hook: Nigel Hall]\nI've been so many places in my life and time\nAnd I know, this fo' sho', I'm a life, that's worth living\nI've seen a lot of faces made a lot of moves\nI'm international, because of you\n\n[Repeat Hook]\n\n[Talib Kweli]\nYo\nLet me introduce you to the Blacksmith crew, we makin money\nGo to sleep with a dream and we wakin up hungry\nIts a new day stomach is rumblin - oh well\nI'm like Lloyd Banks, stumblin out of the hotel\nOverseas show I'm catchin the last flight\nReally need to go I'm hungover from last night\nOut with Gina and MeLa Machinko, we get silly\nHad a ball, 'bout to call a cab like Wet Willie's\nWhen I'm in commuter traffic I'm never worried or panicked\nFirst class travel, I'm flyin Virgin Atlantic\nI'm already checked in, I'm ready to settle in\nGoing places I've never been, I get my Rosetta in\nRackin up the sky miles and gettin them upgrades\nAnd you hate the only place that you visit is upstate\nDon't be mad cause I'm writin this rhyme on my iPad\nDon't be sad cause tomorrow I'm catchin the flight back\n\n[Hook]\n\n[Talib Kweli]\nI'm a travellin man, movin through places space and time\nThink your life hard workin at your 9 to 5\nNo matter what you do you can't imitate my grind\nTwenty-four/seven love ain't that rough\nWhen your career is you're passion no that ain't enough\nSo when you hear me rappin it's like I'm makin love\nBanging your eardrum, slingin that good uhh, takin over the planet\nYou follow my footprints now you rollin with the greatest\nI'm gettin to know the neighbors I'm tastin the local flavors\nChicks from the ghetto were richer than portobello\nMy life is like a movie a novel by Paulo Coelho\nOr the Steely Dan song about a bottle of Cuervo\nColombian Gold, take a hit for the road\nIt's given me a vision like I was lickin a toad\nConsider me so blessed like momma bakin a cake\nAnd the kids is lickin the bowl, the illest stickin to soul\n\n[Hook] - repeat 2X\n\n[Outro: Nigel Hall]\nIt's because of you\nI'm international, yeah\nOoooh-ooooooh, ahhh ahhh ahhhhh\nWe're flyin high up above in the sky\nThe WIND on our wings.. {*fades out*}", "image": "https://images.genius.com/195bc58c1487ceee38b62b9e3ae90bdb.300x300x1.jpg"}], "artist": "Talib Kweli"}