{"songs": [{"title": "Gees", "album": "Watching Movies With the Sound Off", "year": "2013-06-18", "lyrics": "[Verse 1: Mac Miller & Delusional Thomas]\nUh, ignant-ass white kid (white kid)\nBut I'm still bicycling and recycling ('cyling)\nAnd I'm still eating Gummy Bear vitamins\nAll my bitches taking Vicodin, huffing nitrogen (yuh)\nHyper than Williams, middle son\nSince I was a little one, moms had to put me on the Ritalin\nMade a swisher run, crack the 40 then I lit a blunt\nTold Chuck I had a couple raps, so we kicked the drums\nAll the best rappers are usually dead\nBut I'm the poison that left a widow Juliet\nIn the studio with candles lit and Buddha heads\nComing up with all the coldest shit, take your Sudafed\nContagious, speaking while sedated\nGod shit, make 'em want to add a couple pages to the Bible\nI ain't got nothing left in my will\n'Cept, \"Throw it all in the casket, it's mine still\"\nUh, I need some backpack cast raps\nTook a break just to kill the game half-assed\nSet some rat traps, went to take a cat nap\nWoke up, threw the dead bodies in the trash bags\nAct polite, but I'm nasty on the mic\nYour bitch don't want my dick, then she has to be a dyke\nSlap her but she like it, tell me, \"Master, feed me pipe\"\nI'm the scotch on the rocks, you the appletini type\n\n[Hook: Mac Miller]\nBitch, suck my dick before I slap you with it\nGees...\nBitch, suck my dick before I slap you with it\nGees, woah...\n\n[Verse 2: Mac Miller & Delusional Thomas]\nUgh, still fucking with these hoes, though (Hoes, though)\nBozo on these doppelgänger Jojos (Jojos)\nTake a bitch to Soho for some Froyo\nTell her she gon' blow it, Romo\nAnd now I'm out in Cali like Tone-Lōc (Tone-Lōc)\nYoung boy, but I'm chilling with some grown folk (Grown folk)\nNo joke, most dope, you just bowl smoke\nHow much coke you got to sell to make a boat float?\nHit 'em, hit 'em 'til they tell me \"No more\" (No more)\nI'm a highly difficult ropes course\nPulling up to Rome on a chrome gold horse\nSay \"What's up?\" to the Pope, pull off in a Porsche\nWho you kidding? Your flow's warshed\nI ain't from the street but I'll grill you from the porch (Bitch)\nI been had hoes, I played sports (For real)\nHer ass out the bottom of her shorts\n\n[Hook: Mac Miller]\nBitch, suck my dick before I slap you with it\nGees...\nBitch, suck my dick before I slap you with it\nGees...\n\n[Verse 3: Schoolboy Q]\nUh... Black James Bond and a white Shaft\nTurned my daughter to a queen, turned a dollar to a dream\nFlashy as high beams, smoking on good weed\nSomething from kush seeds, the only strand to smoke for us OGs\nI'm rich car service, no car keys (yeah!)\nFirst class flight, 'bout to land to a new bitch (Yeah, yeah)\nShe fuck me and swallowed every homie I came with (Aww, aww)\nMCM bag and nigga, bet some weed in it\n200 dollars worth of Backwoods, we all living (Yeah, yeah)\nBrought the gangsters back to bucket hat, how real is that? (Ouu)\nI'm getting money, rub my tummy, that's my baller sack (Ugh)\nQuarter million in a safe in case I get a case\nFaggot-ass judge hating on me cause my money straight (Yeah)\nDropped 10 racks in all 50 states\nGon' name my next tour Million-Man March (Aww, yeah)\nMake a nun throw it back while I pull her scarf (Yeah)\nShe gave me head, my nuts touched her cross, boss\nFigg Side! (Ouu-ouu! Yeah!)\n\n[Hook: Mac Miller]\nBitch, suck my dick before I slap you with it...", "image": "https://images.genius.com/c97dc009b7b1ff0982e14799c3dd3042.375x375x1.jpg"}], "artist": "Mac Miller"}