{"songs": [{"title": "Git Up", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Verse 1: Eminem]\n10, 9, 8, 7, 6, 5, 4, 3, 2, 1\nReady or not here we come, here comes trouble in the club\n11, 12, 13, pistols big as M-16's\nHow the fuck we sneak in with this many heaters in our jeans?\nNina, two ninas, a piece, they don't even see us\nSome shit pops off we squeeze each one\nThey're gonna think it's machine guns\nVandals-vo-vandals, bananas and old flannels\nHands around our Colt handles, hold them like roman candles\nSo ban us, go ban us, banana-fanna-fo-fannas\nWho come back all bananas, banana clips loaded\nManagers, bouncers, and the club owners\nThe motherfuckers don't want us to come up, bum rush in the club\nAnd run up in it with a bunch of motherfuckers from Runyan\nSteady popping them onions\nReady, set to go nut up, prepare to tear the whole club up\nFixing to get into some shit, just itching to choke someone up\nYou know we finna loc'n when we mix coke with coconut rum up\nSo, yeah, yeah, ho, what up, see my people posted up\nSee you talk that ho shit now, when you're down you won't get up\nAnd can't sit up you're so slit up, the ambulance won't sew you up\nThey just throw you up in the trunk once they tag your big toe up\nHeater-no-heater, automatic-no-matic\nMag or no mag, it don't matter if I have or don't have it\nYou never know when I'm packing so you just don't want no static\nAnd open up a whole can of whoop ass\nYou don't wanna chance to risk it, no biscuit\nMilli mac or mac milli\nWill he, won't he, don't be silly, homie you don't know me really\nYou're just gonna make yourself dizzy wondering what the dilly\nFuck it, let's just get busy D-Twizzy's back in the hizzy!\n\n[Hook: Eminem]\nGit up now! Let's get it cracking, yeah, it's on and popping\nBitch, D12 is back in this bitch, ugh! There ain't no stopping\nWe're gonna get it crackalating, what you waiting for?\nThe wait is over, say no more\nQuit tryna play the wall and quit hating\nGit up now! Y'all are still sitting? What the fuck, are you deaf?\nYou motherfuckers don't listen I said\nWe 'bout to get this motherfucker crackalating\nQuit procrastinating\nWhat the fuck you waiting for? Get off the wall and quit hating, bitch\nGit up now!\n\n[Verse 2: Swifty McVay]\nI keep a shitload of bullets, I pitbull it to pull it out\nAnd automatically explode on motherfuckers until they mouth get closed\nPermanently, you get burned to line quickly\nYou can not hit me niggas, too terrified to come get me\nTempt me if you think Swifty won't send a slug, people run\nWhen the reaper comes, the repercussion gon' equal blood\nNigga what? Stepping without a weapon, you leave, you gone\nI be still rolling with stolen toasters while on parole\nSnatch you out our home like eviction notices ho\nWhen I unload, I'm known to never leave witnesses to roam\nWhen I'm blowed, I'll write the wickedest scroll ever told\nWhen I'm sober I'm prone to roll up and disconnect your soul, nigga\n\n[Verse 3: Kuniva]\nNow it's been proven it's about to be a misunderstanding\nAnd furniture moving, bullets flying, lawyers and mothers suing\n'Cause niggas don't know the difference\nYou bitches just stick to fiction\nIt's sickening, you can't even walk in my jurisdiction, riffing it\nGripping the pump\nAnd who want to fuck with a walking psychopathic pyromaniac\nShady cats with 80 gats\nAnd maybe that's the reason that you gon' get it the worst\nAnd since you jumping in front of everybody you gon' get it first\nI disperse the crowd with something bigger and versatile\nSo run and record you verses now while you got a mouth\nAnd it's not a joke, it's some kind of riddle\nKunizzle will lift up a 12 gizzle and throw a party from my acquittal\nAnd a Glock that you will stop you from walking\nBullets'll hit your liver, I'll even shoot Native Americans\nA Indian giver, and nigga\nWe back in your life and back in your wife\nHit you in your back with a knife and get it cracking tonight\n\n[Hook: Eminem]\nGit up now! Let's get it cracking, yeah, it's on and popping\nBitch, D12 is back in this bitch, ugh! There ain't no stopping\nWe're gonna get it crackalating, what you waiting for?\nThe wait is over, say no more\nQuit tryna play the wall and quit hating\nGit up now! Y'all are still sitting? What the fuck, are you deaf?\nYou motherfuckers don't listen I said\nWe 'bout to get this motherfucker crackalating\nQuit procrastinating\nWhat the fuck you waiting for? Get off the wall and quit hating, bitch\nGit up now!\n\n[Outro: Bizarre aka Peter S. Bizarre]\nHahaha, Yeah, D12, we baaack\nHaha, (Get up now!) Hahahaha\nRunyan Ave soldiers, Amityville\nWho the fuck want it with us?\nHu-HAW!\nNobody", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}