{"songs": [{"title": "Man’s Best Friend", "album": "Death Certificate", "year": "1991-10-29", "lyrics": "\"I can dig it!\"\n\nChorus: samples (repeat 2X) *1 and *2, *3 and *4 simultaneously\n\n*1 \"Bow-wow-wow-yippie-yo-yippie-yay\"\n*2 \"Dog-catcher, dog-catcher!\"\n*3 \"Bow-wow-yippie-yo-yippie-yay\"\n*4 \"I can dig it!\"\n\n[Verse 1]\nHere's another topic I'm addressing\nSo learn a quick lesson, about your Smith and Wesson\nSit your ass back and comprehend\nAs I let you know about man's best friend\nNow remember: it used to be a dog like Lassie\nBut now in ninety-one it's a gun if you asked me\nJust like a jimmy hat's used for protection\nI use my nine when suckers start to flexing\nCause if you run up and try to play mine\nI'd rather have a AK than a fucking canine\nCause if you shot your gun, and my dog tried to fetcha\nMe and the dog's going out on a stretcher\nAnd I ain't with that, so I gotta get that\nBig black gat, aim and I hit that\nForget about a dog, fool, he'll shit in the den\nNowadays, a gat is man's best friend\n\n[Chorus]\n\n[Verse 2]\nHere is the reason why Ice Cube pack\nJust in case the little punks try to jack\nI can't put a motherfucking pit bull\nUnder a coat in the small of my back\nSo I gotta take my Beretta, and I betcha\nIt'll probably work a hundred percent better\nCause it'll keep me out of danger\nWith sixteen in the clip and one in the chamber\nSo this goes to all y'all intruders\nBeware of the owner cause the owner is a shooter\nI don't just wanna give your ass rabies\nI'd rather have your ass pushing up daisies\nAnd I can't do that with Benji\nRin Tin Tin, or Spuds McKenzie\nForget about a dog, fool, he'll shit in the den\nNowadays, a gat is man's best friend\n\n[Outro Samples]\n\"Just don't let me see you shoot no dogs!\"\n\"Hey, I got shots fired here, send me another unit\"\n\n\"The profile of a typical American gun owner is this:\nOver thirty, white, male, middle class\"\n\n\"Take that motherfuckers!\"", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg"}], "artist": "Ice Cube"}