{"songs": [{"title": "WAR", "album": null, "year": "2014-01-06", "lyrics": "[Produced by Cocaines 80´s & No I.D.]\n\n[Verse 1]\nLil Mark get shot, Lil Reese and them\nLittle niggas, it's hard to find peace in them\nChiraq, they say it's Middle Easterin'\nPut your flames in the air for the deceased to them\nYoung soldiers who never got to become older\nDogtagged in the body bag\nPolice kept the knot he had\nPlus he had weed in his system\nNever knew at 13 they could enlist them\nMomma kissed him, body was colder\nShe was shaking, I tried to hold her\nTears on my shoulder, he was supposed to\nBe going to his junior year, this is his funeral year\nPall-bearers, all looking like kids\nSome faces show anger, some show tears\nNo mustaches, no beards\nProbably had the same aspirations as his\nOn a mission, staring in the distance\nIt never stop like the Muslims and Christians\nWe under-21 gun salute them\nJust to go back and recruit them\nI'm talkin' 'bout war\n\n[Hook x2]\nTo all the killas and the hundred dolla billas\nReal hittas who ain't got no feelins\n\n[Verse 2]\nThere's a war going on inside, no man is safe from, goin on\nGoing on, there's a war going on inside, no man is safe from\nOr can escape from, take one wars from the same place that hate from\nGang wars used to be about the nations\nNow it's cliques with clips and hittas is missing\nThey hit the innocent now they families miss him\nDeath do kissed him, in his last breath he wishing\nBut no option so he assume position\nIt don't stop, hittas killing women and children\nAngels cried, that's supposed to be God's decision\nCollisions of cliques named after rap groups\nExcept wearing Jordans instead of black boots\nBlack troops trade war stories reminiscent of Glory\nWalk the walk of those before me since I was a shorty\nSeen slugs and drugs and unemployment\nTerror town y'all was my first deployment\nThe life of a soldier ain't nothing to toy with\nI'm living in this shit while the world exploit it\nWar\n\n[Hook x2]\n\n[Verse 3]\nMy basic training was aiming, hustling, banging, changing niggas up\nCause of what they did to us, nigga, I don't give a fuck\nIt's do or die in the Chi and I ain't lived enough\nHoping for some visitors of war, I'm a prisoner\nPoliticians they did enough, want to get rid of us\nHopped in the back as soon as the shots hit the truck\nLooked at my son I could see his soul\nShot and killed at three years old\n\n[Interlude]\nWar, war, war, war!\nWe are at war!\n\n[Outro]\nThe direction was we, we came up with this concept, Nobody Smiling was really a thought that came about because of all the violence that was going on in Chicago, or that is going on. I like to say \"was\" cause we gon' bring it to fruition wishing that it's gonna stop. You know and uh, all the violence that was going on - it happens in Chicago but it's happening around the world in many ways. You know, it may not be to the numbers that's happening in Chicago but it's happening in the inner cities all over America so we's talking about the conditions of what's happening when I said \"Nobody Smiling\" but it's really a call to action", "image": "https://images.genius.com/da2fdc7c193c18298bea9e26345db08a.355x355x1.jpg"}], "artist": "Common"}