{"songs": [{"title": "Ridin", "album": "I’m Up", "year": "2016-02-04", "lyrics": "[Produced by Wheezy]\n\n[Intro: Young Thug]\nHey, yeah, Thugger. I’m just gonna go all the way street with it, you know what I’m saying? Cause I got a real street nigga with me, you know what I’m saying? So answer my question\n\n[Chorus: Young Thug]\nIs you riding for the case you know?\nIs you dying by the case, you know?\nStay down with the case, you know\nBumping ashes in the face of folks\nI’m riding for the cause you know\nI’m riding with my dogs you know\nIf you don’t want to go oh oh\nJust know you a pussy ass nigga for sure\nFor sure\nPull up to the block and then wet it up\nPull up to your property, wet it up\nMy bitches said he down so he gon’ wet it up\nYour bitches need to come and get wetted up\nThese bitches seen this swag and they sweated up\nThese bitches see this ice, they get wetted up\nPussy bumbaclot, you know we not scared of you\nYou know just where we at on the regular\n\n[Verse 1: Young Thug]\nI was just chilling today\nI was just relaxing today\nI just made a bitty bitty k\nI was just chilling today\nI’m just tryna dodge the cops\nSpent my last fifty bands on a watch\nNigga playing, I’ma laugh on the spot\nHo I can make you look like an amateur tonight\nI can fuck a bitch on a bus like she Rosa Parks\nNigga’s diamonds soaking wet, yours dark\nKeep me out it baby, that between y'all\nFuck her bad like I’m tryna catch a charge\nFuck her fast like I’m tryna catch a charge\nYeah, play with me I'm Brian Nichols\nI’ma shoot a motherfucker, yeah y'all\nThat nigga need a bird, call Tyrone\nYeah, I’ma fuck your bitch while you all gone\nYeah you all gone, but the dog home\nAnd the panties that your daughter don’t have on\nShe gon’ get what she wants, temper tantrum\nEvery freezin' diamond she got ain’t no silicone\nI’m a gangster, I was hanging at a killer’s home\nAnd my girl kinda crazy so tell me\n\n[Chorus: Young Thug]\nIs you riding for the case you know?\nIs you dying by the case, you know?\nStay down with the case, you know\nBumping ashes in the face of folks\nI’m riding for the cause you know\nI’m riding with my dogs you know\nIf you don’t want to go oh-oh\nJust know you a pussy ass nigga for sure, for sure\nPull up to the block and then wet it up\nPull up to your property, wet it up\nMy bitches said he down so gon’ wet it up\nYour bitches need to come and get wetted up\nThese bitches seen that swag and they sweated up\nThese bitches see this ice, they get wetted up\nPussy bumbaclot, you know we not scared of you\nYou know just where we at on the regular\n\n[Verse 2: Lil Durk]\nI just mixed some perc with some Act (I just mixed some perc with some Act)\nNigga I’m in back of the back (Nigga I’m in back of the back)\nIn your club and you show up strapped\nPussy, I ain’t even know that you rap\nShooters gon’ pull up in that whack shit, yeah\nDrive by and star in an action, yeah\nDump the whole clip in my ex-bitch, yeah\nEat the pussy, dip on some fast shit, yeah\nPut a case on that pussy ‘cause I’ma smash it\nIf I eat it she gotta be a Kardashian\nPolice pulling us over, she gon’ stash it, get it\nAnd I know she ain’t gon’ say shit\nAny rapper in the city I don’t play with\nAny time I pull up in broad day shit\nCall my shooters from the go and they gon’ spray shit\nNow she want to fuck me now, I got a waitlist\nTold the judge suck my dick, fuck probation\nAnd I got to get this money on vacation\nVerified in the streets, fuck a placement\nPut this 40 in his face, rearrange shit\nI ain’t got time, I got NumbaNine\nMe and Thug pulling up, I’m with Slime\nThat’s a fake ass Rolex, boy you wasting time\nI don’t know about yours but I’m chasing mine\n\n[Chorus: Young Thug]\nIs you riding for the case you know?\nIs you dying by the case, you know?\nStay down with the case, you know\nBumping ashes in the face of folks\nI’m riding for the cause you know\nI’m riding with my dogs you know\nIf you don’t want to go oh-oh\nJust know you a pussy ass nigga for sure, for sure\nPull up to the block and then wet it up\nPull up to your property, wet it up\nMy bitches said he down so gon’ wet it up\nYour bitches need to come and get wetted up\nThese bitches seen that swag and they sweated up\nThese bitches see this ice, they get wetted up\nPussy bumbaclot, you know we not scared of you\nYou know just where we at on the regular", "image": "https://images.genius.com/a43ba1522d2954d0ee6a8aca28ff1881.1000x1000x1.jpg"}], "artist": "Young Thug"}