{"songs": [{"title": "The Truth Freestyle", "album": null, "year": null, "lyrics": "[Intro]\nYo, it's Kanye To The\nI did this beat in '96 and ah...\n\n[Verse]\nIs it the because my beats the nicest?\nGot me chargin' niggas Dr. Evil prices\nNiggas will sell their soul to go platinum and gold\nI'm cold cause I got the gold and kept my soul\nDrop an album full of soul, sold twelve times gold\nThat's six plat, man, that's a sick plaque\nMan, don't forget that at the top is where you feel the loneliness\nLike grabbin' fake titties, I swear, I feel the phoniest\n'Cause I'm from a city where you never know who your homies is\n'Cause everybody wants your spot, No I.D. told me this\nOh, I seen homies get sheisty on me quick\nWoooooo, just imagine if I only spit\nBut I do beats too, that's the American dream\nStack to make sure my shorties inherit some things\nA couple real estate investments, got niggas sayin'\n\"There's the Kennedys!\" But oh, yes, it's the Wests\nBrand new Roc-A-Fella, most fresh to death is\nDefinitely Kanye, peace to Sportie LA\nThat keep my shoe game early like the grave shift (Uh-huh)\nPlus keep my closet cooped up like a slave ship (Woo!)\nHow you gon' look at me and say I ain't made shit? (Look)\nJust look at my outfit, I got all the basics\nAir Force, check, Rolex, check\nCall Gee and Hop, did you get the check? (Styles)\nRoc-a-Fella piece, check, don't forget the neck\nIs it the money on deck that keeps on the honeys on the dick?\nNow that ain't really rhyme, but I ain't really tryin'\n(I don't give a fuck)\nLast 9/11, I was poor on the Ave\n'Til I pluraled my math, now it's Porsche 911\nAnd I'm floorin' the gas, got a lot of problems\nMoney's one that I not have\nDate ballplayers' wives, that divorce and got half\nShit, I figure they deserve somethin' for all them hours\nAnd that be the realest shit I never wrote\nOnly book I ever read I could have wrote\n48 Laws Of Power (WHAT!)\nMe, Gee and Hop, uh huh, the game's ours (WHAT!)\nSeems like I got more brain off my fake chain\nThan my real one, 'cause on the real, son>\nIf a girl think you broke, she just wanna fuckin' smoke\nIf you paid, then she's thinkin' bout her children, feel him?\nProlly not though, unless you got dough, you know what I mean?\nYou will think the grass greener when you finally get green\nI told Regina, you ain't been in a Medina (Quit lying)\nYeah, I seen you grabbin' on my balls like Serena (Uh-huh)\nYeah, y'all the invisible ho, you ain't never seen her\nMhm, she must stay around your grandma's crib\nRight next door to where the in-laws live\nI brought a man from the fifth floor all in y'all crib\nHaha\n\n[Outro]\nRemember niggas back at school\nThey didn't have no girl at school\nSo they be like, \"I got a girl, she just stay by my grandma's crib\" Hahaha\nYo, Dame, where the fuck you find me? Hahaha", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}