{"songs": [{"title": "You Heard Me", "album": null, "year": null, "lyrics": "[50 Cent]\nUh huh...yea\n\n[Verse 1]\nShorty the Henny got me feeling right\nYa heard me?\nMy momma gone you can spend the night\nYa heard me?\nI ain't playing I'm trying to fuck the night\nYa heard me?\nClothes off face down ass up c'mon\nShorty you roll with the winners right\nYa heard me?\nYou see now me I got my money right\nYa heard me?\nI'm tryin to teach you how to play, how the big boys play\nWhen you come around my way\nYa heard me?\nNow see the Bentley got the 20 inch chrome\nYa heard me?\nYou could get in but don't touch the phone\nYa heard me?\nMoney come money go I know\nBut everytime I flow it's mo money fa sho\nYa heard me?\nIn the street niggas sayin I'm nice\nYa heard me?\nWatch flooded no more room for ice\nYa heard me?\nNiggas be on tv stuntin' hard\nAnd in the hood the same niggas they be gettin' robbed\nYa heard me?\nYou might hear I get shot but, I don't get robbed\nCause me, I be on my jog\nYa heard me?\n\n(Chorus)\nYou like it when I back that ass up on you?\n\n(50 Cent)\nOoh, baby I like it, I like it\n\nWhen I work that ass, that ass\n\n(50 Cent)\nBaby I like it, I like it when you put it on me I got a Kool-Aid smile\n\nAnd baby I like it, I like it\n\n(50 Cent)\nEverytime we dance you make it worth my while\n\nAnd I like it, I like it\n\n[Verse 2]\nShorty if you wanna roll with some ballers you should call us\nIm tryna make sure you hear me\nYa heard me?\nWe rap now we rollin and I'm holdin'\nAnd I'm gonna make sure you hear me\nYa heard me?\nI freak off with the video chicks\nYa heard me?\nSweatin' tracks out in back of the 6\nYa heard me?\nMTV they gon' play my hits\nYa heard me?\nEven though I'm real ghetto and shit\nYa heard me?\nI got a g niggas shoot that ace\nYa heard me?\nYour ass bettin' I'm gonna cut your face\nYa heard me?\nLast thing I need is to catch a new case\nI don't know nothing about them high hats but I sell base\nYa heard me?\nThe city boys trying to kill a kid\nYa heard me?\nShot me up in front of my crib\nYa heard me?\nHe had the drop I couldn't run from him\nShot in the hand trying to take the fucking gun from him\nYa heard me?\nLittle homie saying \"50 you tough\"\nYa heard me?\n9 shots just wasn't enough\nYa heard me?\n\n(Chorus)\n\n[Verse 3]\nNigga you best be comin' up with my cash\nYa heard me?\nDon't make me go and get the Gat out the stash\nYa heard me?\nI'll come back and pop one in your ass\nYa heard me?\nDon't play wit the money, no not with the money\nNiggas get knocked when they start playing games\nYa heard me?\nStop telling the police my name\nYa heard me?\nI don't mind givin chicks them tips\nYa heard me?\nThey let me play with then tits and hips\nYa heard me?\nWhen I come through they know I'm a thug\nOut in Atlanta in the gentlemen's club\nYa heard me?\nI rap but I'm still selling them o's\nYa heard me?\nMy man Mike still pimpin' them hoes\nYa heard me?\nHe said if the ho knew better she'd come through better\nAnd make a pimp more chedder\nYa heard me?\n\n(Chorus)\n\n(50 Cent)\n50 make it crazy in the club\nI'm speaking clearly so you can hear me\nI come through niggas always show me love\nI'm speaking clearly so y'all can hear me\nNiggas want beef, y'all could see me in the street\nI'm speaking clearly so you can hear me\nBut you better come correct, cause we move around with heat\nI'm speaking clearly so y'all can hear me", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}