{"songs": [{"title": "Startercoat", "album": "Layers", "year": "2016-04-15", "lyrics": "[Intro]\n(Mr. Porter)\nRyan Daniel Montgomery\n5'9\"\nJuly 5, 1977\nDetroit, Michigan\nPorter, you a real nigga, man\n\n[Verse 1]\nIt all started with a Starter coat\nThe starter pistol got us out the momma jokes\nThe house party finally started, now it's time to go\nGet some pussy sponsored by the barber and a bar of soap\nI'm stealing cars, it wasn't logical\nBut on the bright side, they taught us how to drive 'em doe\nWe used to tilt them bitches with screw drivers\nSo I'm kinda used to being at the bottom of your columns, ho\nBut the Billboard list was kinda comical\nHow the fuck was it designed and chronicled\nI can see it now for sho'\nBunch of blasés from a buncha artists with a timeless flow\nGettin' trampled over on a 20 year old blogger flow\nIf 'Pac ain't on your list then you ain't fuckin' logical\nI'm talkin' up the shit, not no fuckin' 5 or 4\nWhat you gon' tell me when I tell you\n'Pac introduced me to the fuckin' UNLV Starter coat\nIt all started with a Starter coat\nWonderin' why Brenda threw that baby in the garbage fo'\nOn my way to cop my navy blue Starter coat\nIt all started with a Starter coat\nThe starter pistol kept niggas out here from startin' smoke\nWithout it I'd be dead or be an artichoke\nThe 9 iron armor in the heart of gold (it's that fo')\nNobody witchu nigga that's the Art of War (let's go to war)\nBut do not forget you fuckin' start it doe (that's my mama)\n(Woah, what kinda coat is that?) Starter coat\n\n[Bridge]\nI grew up with three brothers\nAs soon as I was born my lungs collapsed\nAnd I had to be hooked up to a ventilator\n\n[Verse 2]\nNow a nigga shining though\nGrowing up I gave a lotta niggas shiners though\nI gave a lot of people my respect\nDaddy taught me that one growing up\nHe threw me through a shower door\nI used to wonder why my uncle looking startled fo'\nCrawlin' around all on the ground like his heart is broke\nI found out he got a crack problem\nAnd he thought he dropped a couple particles\nWell I'm a fucking alcoholic so, who am I to judge?\nI'm just honorable, I be temporarily in love when I'm inside a ho\nI'm a pure artist, I don't need to see the charts\nTo know the art is under our control\nHighs, lows, problems, pain, drama that's what's optimal\nI guess I'm just the best at thanking God\nAnd feeling awesome though\nCause I survived the era of the Starter coat\nIt all started with the Starter coat\nI lost my virginity aboard the fucking Boblo boat\nI ain't graduate on time, I ain't go to college so\nA couple friends of mine did, other friends of mine dead\nI'm fuckin reminded, just because I made the most money\nThat don't mean I went the farthest though\nI hope my college friends reminded\nYou got degrees that don't mean you the smartest though\nMo' money, mo' problems\nI lost plenty mo' marbles on my marble floor\nThen I left in my Starter coat\nWhat they taught us that was all a joke\nYou may not got a lotta dollars at least you got a post\nI'm arguing with Satan screaming \"I don't barter souls!\"\nPlease don't take my memories of me and my Starter coat\n\n[Outro]\nWhat kind of coat is that? Starter coat\nWhat kind of coat is that? Starter coat\nWhat kind of coat is that? Starter coat\nWhat kind of coat is that? Starter coat", "image": "https://images.genius.com/533ac062d389201c4e7eb9a973709ea4.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}