{"songs": [{"title": "Josephine", "album": "More Fish", "year": "2006-12-12", "lyrics": "[Intro: Ghostface Killah]\nGod's woman... what's going on?\nI know things seem messed up sometime\nYou stressed out and you can't handle the situation\nSometime it feels like you lacking the guidance\nAnd you don't know what to do... but stay strong\nAnd keep in mind that he always loves you...\nIt's what it is... that's right sugar love\nCome on...\n\n[Hook: Willie Cottrell]\nJosephine, the times are getting tough\nSeems to me... you just won't get enough\nThe rain, won't wash away, your sins...\nYou'll be here, to do them all over again...\n\n[Ghostface Killah]\nYo, I know this chick from the hood named Courtney Cox\nAnd her brain is easy to pick like faulty locks\nShe's awfully hot, asshole burning like tobasco\nShe used to be thick, it's like where the hell her ass go\nStarted smoking weed and graduated to the pipe\nThought that she could quit but her calculations wasn't right\nInfactuated with the life of dope fiends and crack pushers\nProstituting for old pimps who mack hookers\nPutting dope in the cook, searching for her vein\nTracks all over her arms, she never felt the pain\nThe monkey on her back is now a gorilla\nFiending for a hit knowing one day it's gon' kill her\nThe clinic didn't help (nope) she just another young black woman\nDestroying her pretty image and her health\nGot me thinking to myself, damn, how could this happen?\nI seen her on the corner, nodding off, sniffin' and scratching\n\n[Hook]\n\n[Trife Da God]\nShe wakes up, with an urge to get high\nEveryday, the same routine, needing a morning fix to get by\nSo she reaches for her purse, grab the bag and the needle\nTie a sock around her arm and start shooting up the diesel\nHaving flashbacks, screwing some dude up in his hatchback\nThe night before, body still sore, holding her ass crack\nA regular John, she met him through Tom\nShe passed out with the syringe still stuck in her arm\nDying a slow death, oh, she losing her damn mind\nFrom the troubles of the world, feeling cursed by mankind\nUh, caught up in a desperate rage, was blessed with AIDS\nLost her appetite, hardly slept in days\nNow it's too late, praying to Jesus, she fucked around\nWith the wrong penis, contaminated with diseases\nTwo months pregnant, carrying around her fetus\nBut they found her on Broad, in the dumpster, behind the cleaners\n\n[Hook]\n\n[Interlude: Ghostface Killah]\nJosephine, what's wrong, baby?\nCome on...\n\n[Ghostface Killah]\nYo, what your momma gonna think of you girl?\nHer little baby's all doped up, strung out on the world\nTry'nna make some quick cash for a hit of that stash\nListen, baby, you growing up much too fast\nUh, this goes out to every project and every ghetto\nFor those getting high, using drugs on every level\nLiving your life, day and night, getting stoned\nYou better leave those drugs alone, feel me?\n\n[Willie Cottrell]\nUp all night, under the party lights\nSame old popping and party hopping\nAll of your so called friends, are leading you down the wrong road\nLeading you back to crack, it's a known fact\nIt is time, that you need me, I'll be there, to help ya\nI'll be your leaning pole when you're falling down\nI'll be there, when you falling down (sooner or later)", "image": "https://images.genius.com/c666c55fe38ac486d5bf42862246cf28.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}