{"songs": [{"title": "Right Or Wrong", "album": "Redemption of the Beast", "year": "2015-01-13", "lyrics": "Aww man (shit)\nThat bitch (DID HE?!)\nWhat the fuck is this?\nDid he? (DID HE?!)\nAre you for real?\n\nRyde or die, right or wrong (WHAT?)\nNiggas wit'cha by your side 'til the storm (WHAT?)\nThen they split, don't wanna ride to the storm (WHAT?)\n{I love you my nigga} Shoulda known that was bullshit all along! (C'MON!)\n\nI been doin this for a minute\nSo with or without you I'ma get it, cause I'm in it to win it\nI put in work, paid my dues\nStepped in dirt, changed my shoes\nGot those dirty - asked God for a new pair\nAnd He musta heard me; thought I was worthy\nTaught me to listen cause in New York\nThe rule is the more you know the less you talk\nSo if you fake niggas actin like you down for the kid\nWhen it goes back, don't be around for SHIT!\nThat's why niggas like you get found in a ditch\nYou ain't built for war, actin like a BITCH!\n\nRyde or die, right or wrong (WHAT?)\nNiggas wit'cha by your side 'til the storm (WHAT?)\nThen they split, don't wanna ride to the storm (WHAT?)\n{I love you my nigga} Shoulda known that was bullshit all along! (C'MON!)\n\nWe all in the sunshine...\n\nWe all in the sunshine, we all want the fun time\nSo niggas forget that it is gon' rain sometime\nWhatever the weather\nWe supposed to be in this together, B.F.W. forever\nI see now that y'all niggas been takin shit lightly\nOne minute you love me, next you wanna fight me\nAm I gon' lose? Not likely\nAnd even though we both know that you a cat, you still be tryin to bite me\nC'mon vato, cat-o\nThat's a real bitch move you made, you know the rest, uh-oh\nWalk like a man you gots to talk like a man\nChin up, with a limp, dick in your hand!\n\nRyde or die, right or wrong (WHAT?)\nNiggas wit'cha by your side 'til the storm (WHAT?)\nThen they split, don't wanna ride to the storm (WHAT?)\n{I love you my nigga} Shoulda known that was bullshit all along! (C'MON!)\n\nAhh man, ahh man! AHHHHHHHHHHHHH!!\n\nWhatever the fuck I do I go all out\nWait for a few days, ryde or die, fuck out bitch!\nI ain't got time for these cats that wanna pretend\nLike they gon' ride 'til the end\nCause soon as you hit a bump niggas jump ship\nBut when it's all good same niggas suck dick\nMoney is the root of all evil\nI ain't a fake nigga, and never had a reason to deceive you\nDon't nobody do for me, but me\nA nigga gon' be alright, you'll see\nWhen I need a friend, [?] sends me one\nWhen I need some ends, he saved me some\nWhatever I need I get it, so I don't want for nothin\nAnd I ain't gotta hunt for nothin\nSittin on ten whips, a few chips\nAnd that mayne with the laser from the hip catch you slip\n\nRyde or die, right or wrong (WHAT?)\nNiggas wit'cha by your side 'til the storm (WHAT?)\nThen they split, don't wanna ride to the storm (WHAT?)\n{I love you my nigga} Shoulda known that was bullshit all along! (C'MON!)\n\nWHAT? WHAT? WHAT? WHAT? WHAAAAAAAT?\nMan, cause I'm fuckin crazy!\nAnd you all fuckin crazy!\nOh my God, what have they done?\nWhat have they done? What have they done?!\nWhat have they done?!\nWhat have they done?! They don't know\nWhat have they done?! They don't know\nWhat have they done?! They don't know\nWhat have they done?! They don't know\nWhat have they done?! They don't know\nGrrrrrrr...\nRyde or die, right or wrong!", "image": "https://images.genius.com/c768a0855d18bfa64f81a797bb10d78f.355x355x1.jpg"}], "artist": "DMX"}