{"songs": [{"title": "Royce Is Like", "album": "The Bar Exam", "year": "2007-04-07", "lyrics": "[Intro: Royce Da 5'9\" & DJ Premier]\nWell, nothin left to do but rhyme circles around niggas\nHuh, Preem? (Huh?)\n\n[Verse 1: Royce da 5'9\"]\nAllow me to put it in perspective, check this\nBullets in the Tec shit, spinning and the bullet in your chest is\nBest shit, meddling, what else niggas peddling?\n'Cause you selling records around here is irrelevant (Statik!)\nAllow me to tell you to bow whenever you around me\nI'm proud 'cause God endowed me, intelligent\nLook up in the sky and crown me, the now-regal\nShe go down, her knees are now eagle\nEither my gun gon' bang or I'ma come harder\nI run water on y'all lames, I unthaw you\nY'all wanna be the kings of rap, my son's smarter\nI'd rather run some game on one of Run's daughters\nThe Mike Vick or the Kobe Bryant with this one\nI'm past the pass and homie, Ryan, I just run\nThe Last Action Hero that the public awaits\nTook it past rapping so perhaps I can govern your state\nI'm Akinyele, I act Belly, so put it in your mouth\nWhile I talk on the celly, pushing a black L-E-\nI'm Makaveli, my body's in the back of a deli\nHolding a cordless, frozen, with the volts in swordfish\nLying with a couple of corpses\nBiggie and Gandhi, my city's behind me, others enforce it\nIn the Philippines, blacking out on mics, yeah\nLike I'm living in a dream, acting out a nightmare\nWhatever I'm saying's real\nShovel the bullshit y'all throw on the game\nIs how I level the playing field (Woo!)\nY'all got to feel me, momma had to make me\nGod got to kill me, y'all would have to basically\nPut me up on a cross, split my flows up\nCall on the Bible and let 'em lift my soul up (Yeah!)\nOh my, true, amen and such\nThe liaison between the most high and you (Yes!)\nUncle Paul, the bearer of bad news\nThe era of unified armor, beware of the suicide bomber\nThe way he shoots the cannon\nHe competing with the reaper, he will take you, then vanish\nMake you understand it\nShots be popping off bilingual, papi, call me Jesús in Spanish\nI keep calm, I keep my piece on\nI'm like Ice-T, I keep a bleach blonde\nI'm like Spike Lee, I keep the floor seats so it's sweet\nY'all might not like me but no need for response\nMy recon's ghostly, we prime\nReal estate of the minds 'cause we signed and re-signed\nThey say I'm at the end of my time like Esham\nMy emergency brakes recalled like Nissan\nPeace, y'all, I'm out, niggas; I'm 'bout figures\nBut before I leave, I hope you don't doubt there's a...\n\n[Verse 2]\nDeep karma that's surrounding me\nLike I'm a drug dealer plugged into the weed farmer\nRap NATO, plus, blasting, that's fatal\nYou do the math and you'll have mashed your last 'tato (Shh!)\nThe big empire, go within fire\nThe boss is so high on top, it's a kickstand by him\nI am: Ryan, the giant; spit, inspire\nI kill the supplier; then, I'm peeling the hitman hirer\nI flow like none, you blow like guns\nYou hoes is polite as the soul of a Moabite nun\nI'm like a Glock beam, I'm usually unseen\n'Til I wanna be seen, that means one thing\nSo I know I be having fun being a showout\nI keep my guns clean with sunscreen, I'm so hot\nPetrified, ain't ya? Shook to death, ain't ya?\nBitch niggas know you; told you, I'm a stranger\nI ain't seen fear, don't even know what it feel like (Uh-huh!)\nI'm out of Vice City, the nigga hood in real life (Uh-huh!)\nCaddy-ass niggas'll get it\nI pay the cost to put you away while I'm golfing\nLook, now, I'm flossing\nI drive the ball then yell, \"War!\"\nI mean, yell, \"Fore!\" right before I unveil the pale horse\nCock on sight, orgy or the duel\nWe doing like hoes or fours, who will we ruin?\nAsking each other to answer answered questions\nThen forgets them, I'll do 'em again, I guess\nBut you ain't gotta be dumb to go it (Uh-uh)\nI'm too old to show it\nI'm too blowed, but too young to blow it\nAny time it comes to showing, I runs the show\nWhen it comes to flowing, I go and becomes the poet\nYou know I capitalize by blacking out on a rhythm\nI visualize the action and actualize the vision (Yeah, yeah)\nI don't have to rely on ambition to get my eye on them digits\nI see how I see, then get right on my business\nLet me see, I'm finna choose between losing\nAnd being the pinnacle between eaten and eating dinner food\nTo being interviewed, and squeeze into a closet\nWith a couple of tennis shoes, I call it being defeated\nMinuscule amounts of dough in a dual account\nSo your ho can go on with you on an ounce\nSold, rounds of bottles around her mouth\nThat's bound to swallow, counting all of them founding fathers\nYou choose: getting brains or sniffing for the coochie scent\n50 Gs in the chain'll glisten with the Gucci print\nBasically, how I move, New York'll seem slow\nYou hood-rich? How I'm living? You're pork-and-bean poor\n\n[Verse 3]\nI can't complain, nigga, I pimp the game\nYou went to jail, nigga, I went to change\nWipe off the smirk, nigga, we ain't the same\nYou came to do dirt, I came to clean\nYou drown from hunger, I sank from fame\nYou shot through windows, I paints the pane\nI can't explain, nigga, you ain't been trained\nThe same way that I have, so you ain't to blame\nIf you ain't ashamed, you came to swing, nigga\nI came extreme, this is my claim to fame (Yeah!)\nYou claim the fame; I cop the jewel\nRight 'fore you cop the jewel after I change the chains (Chains!)\nYou seem deranged, I got a thing for brains (Brains!)\nYou flee from rain, nigga, I reign supreme\nYou hang your keys up, I hang with Preem\nYou claiming, \"Gs up,\" I'm claiming King\nI came to slang, nigga, you came to fiend\nWhen I'm playing arenas, you came to scream\nYou came to bling, nigga, I came to shine (Shine)\nYou came to sing, nigga, I came to grind (One more time)\nYou came to bling, nigga, I came to shine (Shine)\nYou came to sing, nigga, I came to grind", "image": "https://images.genius.com/4f966eb73a81b58069fb8aff648de307.700x700x1.jpg"}], "artist": "Royce da 5'9'’"}