{"songs": [{"title": "Say Hello to Adele", "album": null, "year": "2016-03-23", "lyrics": "[Produced by Austin Fig]\n\n[Verse 1]\nNow I be lying if I, I be\nNow I be lying if I told you I ain't trying to get rich\nI need mines, I need grind, ain't no time for no bitch\nI'm surprised I'm alive, oh my god, take him up\nMake him fly, break him even\nThey been sleeping, wake them up\nThey got molly, they got bands, I got fans, I got ooh\nI got dro, I got grams, I got damn, I got blow, hoe\nI got what you need, homie don't raise your voice at me my G\nAll these eyes on me, I see, that's word to Pac and B.I.G. I be, I be\nOn stages, and ain't there nowhere I got to go\nI ain't got no fucking patience that's one thing you got to know\nAll these rappers in my way, they think they famous, I don't know\nWhen I watch them hit the pavement I'ma feel like Holly Holms\nI swear it don't get no better than this\nI told my bitch we better get rich\nThen flip these chips and get a new whip\nAnd twist my wrist in front of ya, none of ya\nWant to get pimped you son of a prick, let's flip this win and then uh\nJump in the air\nI just want to dig a hole in a cell\nI just want to say Hello to Adele\n\n[Bridge]\nYeah yeah whooh whooh\nI just want to let you know that I'm here\nI just want to sing a song and a prayer\nI just want to make a toast to El Chapo\nMy idol, I might dig a hole in a cell\nI should probably change my hoe to affair\nI could probably make your hoe disappear\nDifferent emotions you don't know what to feel\n\n[Verse 2]\nAlways feel like my jeans burning\nNo bail and I'm seen murdering\nNew gold grills and your teeth hurt\nI'm still walking and my feet hurt\nWhere's Uber when you need one?\nJust tell me where you see one\nI'm driving bars on the wall\nOkay, where's Luda when you need her?\nListen, I'm my back to the wall\nThen I'm back to the zone, I'm in a Twilight\nIf you ever get a minute tell them other little niggas I've been winning I've been doing it from hindsight\nDon't you ever get a pen in on my level never said I'm not a rebel don't you ever get on my mic\nAnd you ever been a kid and been a winner by the niggas and the pen I'ma end 'em in the limelight rhyme-light\nI'm like, I'm like\nSwish swish whooh\nI'm like eh ya hoe, there I go\nI'ma kill the game this year\nSay I won't, may I? Woo\nI don't give a fuck about no haters or what I never did\nI got angels here and that's evident\nI got halos all in my head I swear\n\n[Hook]\nY'all done lost your motherfucking mind, ooh\nY'all done... Y'all done lost... Lost your motherfucking mind, ooh\nY'all done... Ya... Y'all done lost your motherfucking mind, ooh\nY'all done... Y'all done lost... Lost your motherfucking mind, ooh\nY'all done, lost your motherfucking mind\n\n[Verse 3]\nGot what you need, this that 24-hour spot\nThis that Massachusetts, Kawasaki, and the Yamaha\nMy Mama, Auntie, told me if I ever started drama\nI can go to jail\nBut fuck the cops\nAnd tell the judge to suck my cock and go to hell\nNo filter, but I got real love\nNiggas ain't real son, tryna get meals but\nEveryone's still friends, she don't got heels on\nBut her ass still fat, bet if I hit that she gonna tear up\nWhere are my real thugs, when they gonna hear us, when they gonna feel us?\nEveryone act cray\nDon't know what make they way\nI tell your bitch: ay baby\nPoppa can't crip stand\nThey ball so hard since wristbands\nSo my broads ain't got no implants, these bras ain't got no kickstands, and I know it though\nHold up\nFuck what you feel\nI just want to sell salt to a snail\nI just want to sell a hoe to a queer\nI just want to go to Oprah and Phil\nGive them both a little coke and some pills\nI remember when I had to scrape a little change just to go to the store for some milk\nI remember when my ex bitch didn't come home, she was stroking the field\nI don't think you really know how I feel\nI don't think you niggas know how to chill, whooh\nSo, the fuck is you thinking you older than me?\nYou got some type of control over me?\nJust cause you got some shit you can hold over me, like you running this shit?\nAct like I won't put my tongue in your bitch\nBring her closer to me\nAnd then go to the beach, sit in the water\nDon't act like you not an emotional creep\nI pull over the jeep (skrrt, skrrt)\n\n[Bridge]\nI just want to let you know that I'm here\nI just want to sing a song and a prayer\nI just want to make a toast to El Chapo\nMy idol, I might dig a hole in a cell\nI just want to say Hello to Adele\nI could probably make your hoe disappear\nI don't think you niggas know how it feels\n\n[Hook]\nY'all done lost your motherfucking mind, ooh\nY'all done... Y'all done lost... Lost your motherfucking mind, ooh\nY'all done... Ya... Y'all done lost your motherfucking mind, ooh\nY'all done... Y'all done lost... Lost your motherfucking mind, ooh\nY'all done, lost your motherfucking mind", "image": "https://images.genius.com/e9657025c95325a111b2e98d2d979a88.640x640x1.jpg"}], "artist": "Joyner Lucas"}