{"songs": [{"title": "War Against Love", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Intro]\nWassup, African?\nWassup, African?\n\n[Chorus]\nYo the Haiti, Barbados, Bahamas, Grenada\nThe war is against love, we under attack\nParis, Pyar, St. Thomas, DR\nThe war is against love, who's busting back?\nFrom New York to Botswana, London to Guyana\nTo every single African that's on the map\nYo, to Mexico, to Cuba, Iceland to Bermuda\nThe war is against love, we under attack\n\n[Verse 1]\nScientists told us how the Mayans lived\nHighways are landing strips for planes to land\nBefore the Wright brothers planned aerodynamics\nNow I am chilling 20 karats like a savage\nNot embarrassed\nBuy what I'm copping while I'm shopping out in Paris\nParasites try to steal the culture (True)\nWhile chem trails and satellites hover over\nFeds is watching, real niggas ask this is so (Ask this is so)\nStill the 5th is loaded (5th is loaded)\nFor these lawyers who be ripping soldiers off in court\nThey don't get em all, they just take your money and lie\nHave you sitting up north (Foul)\nStudy the law (Word)\nGet your appeal (True)\nSoon you back on the street the shit'd get real (Facts)\nThey try to kill us off since the days of the brilliant Moors\nMay they ships pull up to the Sicilian shores\nSo I hustle more, ain't no justice for the poor\nGot me feeling like middle fingers up, fuck the law\nBust a Dutchie open, liquor pour\n\n[Chorus]\nChicago yo, you know Chicago y'all know\nThe war is against love, we under attack (Yeah)\nNew Orleans, New Orleans to Queens\nYo the war is against love, who's busting back? (Me)\nTo Detroit (Yeah), St. Louis (Yeah, yeah)\nTo every hood in all the 50 states on the map (Map)\nChocolate city, North and South Philly (Philly)\nFeel me, the war is against love, we under attack\n\n[Verse 2]\nI went from, semi-bummy nigga to money nigga (Ha)\nBike nigga to car nigga\nChrist nigga to Allah nigga (Alḥamdulillāh)\nThen I evolved, nigga (Yeah)\nNo religions, my commandments are my standards (Word)\nA stand up man, no clowning, no snitching\nGot a bid, I'm sitting down\nDo the time, call it paying taxes\nLiving with my actions (Word), corners to the grave\nYeah, I'm on that wave\nYeah, I fornicate with fly bitches, horny ways\nJust the way I was taught, though (Uh)\nCan't tell if this is reality or just another award show?\nThese women be lost, so beautiful, so smart (Word)\nBut why can't we be heavenly? Don't think, use your heart (Yo' heart)\n'Cause we could be so great, pray it's not too late\nPut pride aside, coincide, I bet we both be straight\nStraight to the top, side to side, twin Rolls Royces\nWe made choices to be devoted (Uh)\nTo go at those foes who come at us with upside down crosses\n\n[Chorus]\nThe war is against love, I ain't trusting that (Trusting that, uh, uh)\nThe war is against love, who's busting back? (Me, me, me, uh)\nTo all the 50 states, all across the map (The whole world, too)\nUSA and beyond (And beyond)\nThe war is against love, how will you react to that?\n\n[Outro]\nYeah, tell you how I'm reacting\nI'm strapped and ready, go all the way\nThe war is against peace\nThe war is against love\nYeah, know that", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}