{"songs": [{"title": "Been A Hoe", "album": "D12 Limited Edition Mixtape", "year": null, "lyrics": "Intro - Bizarre\n\nI'm talking about these nasty\nStinkin ass bitches out here\nThese skinny, fat, nasty....\nBITCHES\nI love em though! (laughs)\nI love my handycap bitch!\nFix my breakfast!\n\nChorus x2\n\nAll my life, i been a hoe\nBut it really don't matter no more\nAnd they wonder why we act this way\nD12 gon' be ok, ok??\n\nVerse 1 - Bizarre\n\nCame in the game, with H.I.V\nThe nastiest nigga in the 3.1.3\nFucked with no rubber ain't no helpin me\nFuckin bitches with no rubber, no option\nI been fuckin since i was 9, and i ain't stoppin\nBizarre too sick, who got the answer\nFuckin a titty dancer, with breast cancer\nMy son tellin me, daddy be strong\nWith this H.I.V shit, you won't live long\nAnd damn girl, you look fine\nI don't give a fuck if you 9, like R. Kelly out on the bump n grind\nR&B chicks, i'll try it, i fucked Mariah four times\nBut she gon' deny it, cos i went in her 9 times, before the sunrise\nBitch you gonna die, damn i hope i don't say it again\nDamn i hope this bitch suck my dick again\nYou can suck and suck and go head slitherin', (put ya head down)\nGo ahead, finish it\n\nChorus x2\n\nVerse 2 -\n\nSee i'm a hoe but not a hoe nigga\nAin't scared of no nigga, i tell a bitch quick\nIf ya knew better, ya do better\nI don't want you to stay up under my nose\nJust bring me the dough and another one of your hoes\nThat's all i wanna know, bitch now quit\nYou think i'm ??? , you comin out that guest outfit\nWe gon' mess around and have to pull a train on your chick\nAnd let Bizarre hit after he rape his pig\nHave that bitch comin' home with a stanky clit\nNow she's lying to you, i know this shit'll make ya sick\nYou gon' hit n pay the rent, forget about it\nCos she was satan sick, and that's the way your ass allowed it\nI seen your bitch, out in a crowded house\nWith her mouth inside of somebodies croch\nAnd she was wilin out (did you fuck her?)\nWithout a doubt, i'm not about to miss that shit\nSee i'm a hoe, and your mommas proud\n\nChrous x1", "image": "https://images.genius.com/a9a6c306e6ebd80f4136c1c7407750f9.587x600x1.jpg"}], "artist": "D12"}