{"songs": [{"title": "3 Kings", "album": "God Forgives, I Don’t", "year": "2012-07-19", "lyrics": "[Produced by Jake One]\n\n[Intro: Dr. Dre]\nYeah, classic hip hop shit\nDr. D-R-E, Rozay and Jay, let's get 'em\n\n[Verse 1: Dr. Dre]\nWe started out mopping floors\nAnd now we front row at the awards\nNumber one for the last twenty years\nIf you real, mothafucka scream cheers!\nMothafucka scream cheers!\nHeh, and it is what it is\nHe wanted to shine at the swap meet\nTill the white boys got him in that hot seat\nI only love it when her hair long\nYou should listen to this beat through my headphones\nMoney long, number one twenty years strong\nFuck a gym, I am him, I'm Andre Young\nG5s to 64s, Dre got 'em\nIf the bitch bad I got her in red bottoms\nGreat weed, nice homes, bread proper\nTec nine, one chamber, top shotta\nBentley coupe, new yacht, my helicopter\nBorn broke, real nigga straight out of Compton\nThe fuck you magazine niggas want from me?\nI rewrote the game, nigga, now talk money\nAll black on my Al Capone shit\nI built a house, nigga get your own shit\nI only love it when her hair long\nYou should listen to this beat through my headphones\n\n[Interlude: Rick Ross]\nSee y'all niggas\nHit the switches on that shit one time, ugh\nLet the top down\n\n[Verse 2: Rick Ross]\nI came a long way from the weed game\nTwenty stack seats at the Heat game\nAnd I'm still strapped with the heat man\nCan't be steppin' on a nigga feet man\n80 pair of sneakers came from the D game\nCousin was a Crip, said it was a C thing\nBrown bag money in a duffle bag\nFuck 'em all, wet 'em and we gotta double back\nThe homie whippin' chickens in his momma kitchen\nOn the mission, said he get it for his son tuition\nReal nigga's dreams comin' to fruition\nStumble, but I never fall, leanin' on my pistol\nI only love it when the ass fat\nWe should listen to this track in my Maybach\nI'm just tryin' to be a billionaire\nCome and suck a dick for a millionaire\n\n[Interlude: Jay-Z]\nUh, it's just different\nI know it feels different\n\n[Verse 3: Jay-Z]\nUh, I only love her if her eyes brown\nPlay this shit while you play around with my crown\nKing H-O, y'all should know by now\nBut if you don't know, uh\nMillions on the wall in all my rooms\nNiggas couldn't fuck with my daughter's room\nNiggas couldn't walk in my daughter's socks\nBanksy bitches, Basquiat\nI ran through that buck fifty Live Nation fronted me\nThey workin' on another deal, they talkin' two hundred fifty\nI'm holdin' out for three\nTwo seventy five and I just might agree\nEx-D-boy, used to park my Beamer\nNow look at me, I can park in my own arena\nI only love her if her weave new\nI'm still a hood nigga, what you want me to do?\nBeen hoppin' out the BM with your BM\nTaking her places that you can't go with your per diem\nScreamin' carpe diem until I'm a dead poet\nRobin Williams shit, I deserve a Golden Globe bitch!\nI take a Ace in the meanwhile\nYou ain't gotta keep this Khaled, it's just a freestyle\nFuck rap money, I've made more off grapes\nFuck show money, I spent that on drapes\nClose the curtains, fuck boy, out my face\nI whip the coke, let the lawyer beat the case\nMurder was the case that they gave me\nI killed the Hermès store, somebody save me\nStuntin' to the max like wavy, oh shit!\nOh, stuntin' to the max, I'm so wavy\nUsed to shop at TJ Maxx back in '83\nI don't even know if it was open then\nI ain't know Oprah then\nHave the XL 80 bike\nLoud motor, they be like, \"Damn!\" when I'm comin' through, rrraaanngg\nHad the grill in '88, y'all niggas is late\nYou got all that, right?\nI love this shit like my own daughter\nLet's spray these niggas, baby, just like daddy taught ya\nYoung, this is just different", "image": "https://images.genius.com/eab4da932239dc10cc5f63e1d22e77f9.1000x1000x1.jpg"}], "artist": "Rick Ross"}