{"songs": [{"title": "Wrong 4 Dat", "album": "Malpractice", "year": "2001-05-22", "lyrics": "[Redman]\nThis is WKYA, We Kickin Yo' Ass radio\nAll you motherfuckers out there that wanna get down with the pound\nPut your motherfuckin pounds up, and start bustin the motherfuckers\nAm I too loud for this motherfucker? Turn me down a little bit\nYeah yeah yeah\n\nYo, first of all I'm a grown-ass man, pay my own bills\nStated own real, haters gon' feel\nDirect Syndrome, mouth with cold tongue\nYou bounty hunters be on the chase for Joe Young\nI won't slip, keep pink slips to my car\nI'm raw like sushi bars on bougie broads\nI retrieve the money, dawg labrador\nRay Charles can see it, and Stacy Lattisaw\nYou get mashed out, cause your bird is peckin\nDon't be the next vinyl cut to _Urban Legend_\nI can feel where you at, when I pound you up\nYou out of town coke rhymes, oh you clowns is up\nMy crew stay in the truck, can't fit in the Porsche\nIf you bitches ain't happy, then get a divorce\nI'mma do what I want, cause my time is now\nGrab the whole rap game, and divide it down\n\nIf I wanna roll a Jeep with a seat out the back\nBitch feet out the back, system beat out the track\nAm I wrong for dat? (If that's what you like)\nDawg, am I wrong for dat? (Hey, I guess not)\nYo yo, if I walk into the club with my hand on my snub\nBeatin down security cause I don't give a fuck\nAm I wrong for dat? (Mmm mmm)\nDawg, am I wrong for dat? (Say WHAAAAT?!)\n\nYo Keith, yo yo Keith\n{*sound of jail door opening*}\n\n[Keith Murray]\nI copped the whole box, went half with Reginald\nHollow tips infrareds and (?) clips came free\nAnd you ain't gotta believe me, fuck bein nervous\nFar as I'm concerned they're at your funeral service\nWhat do we have here? Snitch in despair, shoot off his ear\nHave his whole body shakin in fear\nStormtrooper fires throwin lashin out flames\nA few ashes, when they analyze your remains\nI live in the streets, reside with the toolie\nI kill you like it's part of my religious duty\nStreet sweeper thug keeper sweepin thugs under the rug\nEven females who think they thugs\nTrigger the release of adrenaline\nWhen I'm gangsta-trippin like the Bloods'n'Crips'n'them\nUnleash the matter of energy, killin 'em\nWhy'd you do it? Because I wasn't feelin them!\n\n[Redman]\nIf I ride through the hood, smokin a ounce of haze (uh-huh)\nWith a shabby haircut, pants I wore for days\nAm I wrong for dat? (I don't think so)\nC'mon bitch, am I wrong for dat? (Say WHAAAAT?!)\nYo, if I want a fat chick that keep her toes done (uh-huh)\nWhen they playin my song ass spill out the thong\nAm I wrong for dat? (Got that big ass)\nAm I wrong for dat? (Tchk, nooo)\n\nI gotta, bang the boogie to that bang bang pussy\nTo that bang to the pussy the beat, beat\nAnd if yo', bitch ain't sippin that Cristal shit\nThen she might be leavin with D, D\nI got a hairy-ass chest, like Austin Powers\nThat bitch that \"Stan\" drowned, I fucked around with her\nAct like a man, stand on your own two\nDoc takin it all, fuck who it belong to", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}