{"songs": [{"title": "I’m On Everything", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro: Mike Epps]\nAll these little young kids ain't got no direction\nShit, these lil' kids is on everything\n\n[Chorus: Mike Epps]\nSyrup, painkillers, cigarette, weed\nHennessy, vodka, hah-hah-huh, hah-hah\n(I'm on everything, I'm on everything\nI'm on everything, I'm on everything)\nSyrup, painkillers, cigarette, weed\nHennessy, vodka, hah-hah-huh, hah-hah\n(I'm on everything, I'm on everything\nI'm on everything, I'm on everything)\n\n[Verse 1: Royce da 5’9”]\nI’m on syrup,painkillers, cigarette, weed\nHenny-Henny, sober don't interest me, I'm on everything\n'Bout to sniff the liquor like it's 'caine\nThat's how high I am, I'm blowed\nI take painkillers to ease the pain, though I ain't in pain\nNo, we ain’t the same – you drunk, I’m on everything\nSick when I kick it, gout, me, soberin' up? Ha! ALF\nCash rules everything, acid tab, hash, 'shrooms\nI done woke up with a fuckin' tiger in my bathroom\nI am fuckin' (high... high... high... high)\nMenace to society, I feel sorry for your mother\nMe and Vishis on 'shrooms, call us the Mario Brothers\nBack down, we never back down\nNever laid out, can't put my back down\n\n[Chorus: Mike Epps]\nI'm on; syrup, painkillers, cigarette, weed\nHennessy, vodka, hah-hah-huh, hah-hah\n(I'm on everything, I'm on everything\nI'm on everything, I'm on everything)\n\n[Verse 2: Eminem]\nPainkillers, I call 'em cane pillars, 'cause to hold me up\nWhen I take 'em, I need a cane and pillars, I'm on everything\nSick when I kick it – barf!\nMe, sobering up? (fart noise) Fart!\nI crush your brain like a pill crusher, let's crush a pill, yeah\nFuck, I think I just crushed my last Tylenol 3 up\nGrab the key up off the counter to the camper, left the crib\nMan, who'da knew that three in the morning I'd still be up?\nCould barely see up over the steering wheel, crashed the whip\nTore a tree up, on my way to the dealer’s, tryna re-up\nCall me Brett Favre, spell it F-A-V-R-E, yup\nIt’s wrong, other words, I just fucked my RV up!\nBitch, it’s on again, yeah, break that Klonopin in half\nWhile I smoke some chronic in the cab with Donovan McNabb\nAnd I dye my hair back blonde again and laugh\nI’m the real macaroni, you cheesy bitch\nI’m demonic with the Kraft\nThere’s a devil in my noodle, you – angel hair pasta\nFlow's dreaded like some fuckin' tangled hair Rasta-farian Jamaican, relax, man, I’ll send a fuckin' axe at you\nIf you insist on a fuckin' accent\nBad and Evil is back with an epidural, check ya girl\n'Cause after we prop you up, we're proppin' her up\nSo, baby, come put ya feet up in these stirrups\nYour boyfriend better find another fuckin' hornets' nest to stir up\nWe rap like we’re on\n\n[Chorus: Mike Epps]\nI'm on; syrup, painkillers, cigarette, weed\nHennessy, vodka, hah-hah-huh, hah-hah\n(I'm on everything, I'm on everything\nI'm on everything, I'm on everything)\nI'm on; syrup, painkillers, cigarette, weed\nHennessy, vodka, hah-hah-huh, hah-hah\n(I'm on everything, I'm on everything\nI'm on everything, I'm on everything)\n\n[Interlude: Royce Da 5’9”]\nI’m on syrup, painkillers, cigarette, speed\nHenny – heh, classic!\n\n[Verse 3: Royce da 5’9”]\n\"It’s Eminem and him again,\" my sentiments exactly\nI told that bitch to get at me, then the bitch attacked me\nKid you not, I’m lit up as fuck\nTablecloth tucked in my pants 'til I'm hearing dishes drop\nAs I walk away from my dinner with schmucks\n\n[Verse 4: Eminem and Royce da 5’9”]\nThen I enter the front of the K-Mart shopping center\nWith a coupon book and a hundred and ten bucks\nAnd a bunch of change, and a wife beater with a mustard stain\nI’ll crush your brain like I’m crushin' pills\nWhat the fuck’s the mothafuckin' deal?\nThis shit’s making me feel like\nI’m tryna do a mothafuckin' cartwheel up a hill\nHow many bars? How many tabs of A-C-I-D? Y-E-S\n'Cause I'm sniffin' M-Y E-X, F-U-C-K'd up, and it’s obvious\nSmoke and Henny in my chest, I’m B-A-N-A-N-A-S\nI’m a C-O-C-O-N-U-T, put this CD in, then you’ll see\nThe sequel to \"Scary Movie\"\nBad is to Evil, a roofie to Roethlisberger\nYou don't wanna wind up six feet deep under that shit's creek\nSo I hope that you bought preservers\nYou could put a turd on the plate\nSilverware and a tablecloth to serve us\nYou don’t bring shit to the table\nI'm in your grill like a Seville when the moth gets murdered\nYou're pushin' the envelope\nWhen I’m shovin’ that whole post office further\nRight off the surface of this earth\nInto the darkest and the farthest corners\n\n[Verse 5: Royce da 5’9” & Eminem]\nHow many bars? How many bars? Maui Wowie, Sour Diesel\nHow many jars to all my people I’ll be to Mars, mommy, come on\nShe can actually wrap my nutsack\n'Round the back of her neck in a bathroom stall\nOr she could just puke from sippin' this piss\nFrom my 24-inch catheter cord\nI’m the type that’ll take a bath with a whore\nDrown her, bang her head on the passenger door\nWhile I’m stashing her in the back, smacking her forehead\nOn the dash 'til it's accidentally blowin', the Benz Jeep horn\nMy friends be knowin' that when I’m on a binge, I’m stingy\nEven when I’m ten deep in a room at the MGM\nWith Lindsay Lohan and she on\n\n[Outro: Mike Epps]\nSyrup, painkillers, cigarette, weed\nHennessy, vodka", "image": "https://images.genius.com/e46d8c5b81dd5cfba852666c93111bef.1000x1000x1.jpg"}], "artist": "Bad Meets Evil"}