{"songs": [{"title": "Purple Jag", "album": "The Vatican Mixtape, Vol. 1", "year": null, "lyrics": "[Intro: Raekwon (Postaboy)]\nWhat up soldier? (What up playboy?)\nYeah, yeah this is Shaolin reporting in (OK)\nCheckin' you out, I'm hearin' about Force Reveal (yeah, yeah)\nThey said one kid, that's standin' real grown out there right now\n(I, go, by the name of Posta)\nThat's my man! So, yo, son? (What up, Rae?)\nYou know what you gotta do!\n\n[Postaboy]\nAiyo, I don't give a fuck what level you on\nWhen the metal is drawn, either your life or your bezel is gone\nI don't really wanna hurt ya'll fags but I'm sitting on paper\nI got Universal mad, Raekwon in a purple Jag\nP.B. in a cantaloupe Hummer with commercial tags\nYa'll ask the chicks who wrap the bricks\nI'm out to give Harlem, a quick flashback of Rich\nI'm blow like C4, burn up be more\nLayin' that Cheetah, next day in a G4\nThink like a veteran, choppin' and measurin'\nAlways got a way, but God got eleven in\nLittle kids follow me, women, they acknowledge me\nNew year, new rules, and a new policy\nPosta good, Posta hood, Posta real, Posta do what Posta could\nP.B. stay blowin' a stink\nWhen the girls give me a hug, they all smell the dro on the mink\nGo line for line, dart for dart, heart to heart\nWe layin' on top of charts\nSee me buggin on Melrose, low top shell toes\nSuede addition, U.S. don't sell those\nPosta hot, Posta not, did Posta flop?\nPlease get off of, of Posta cock\n\n[Interlude; Postaboy]\nOK? Ya'll little chumps roll out the red carpet\nFor the Postaboy, man, I got Uncle Rae with me\nRaekwon the Chef, is in the building\nMight wanna holla!\n\n[Raekwon]\nCatch me at a Balley convention, sweater look, worth the money\nAuctionin' and buy me a building\nMatter fact niggas, might try to bubble in it\nYou know, the X.T. Click, niggas fell in love with it\nJumpin' out of Akademic jumpers, Nike pumps, jewelry down\nG'in' like Trump, sweetie, you drunk\nPosition my thoughts, heavy loss\nRoot for the Maybach, one for your girl, you write it off\nWith the new color, only six made, we in the world, like\nWhatever we rockin', that's on the trade\nWhata's the verdict? It's murder, we preserve, niggas\nAutomatic birds, hang gun hammers, grenades, got words on you\nSwerve on you, browsin', all through your housing\nJakes stop me, try to take forty thousand\nPlayin' it kid, you won't make a thousand\nYeah, the Larry Davis version, force to build Shaolin\n\n[Outro: sample]\nBut now my time, has come\nAnd time, time, is not on you side", "image": "https://images.genius.com/6a8b7e152802d68a042f150de8d50c5d.820x820x1.jpg"}], "artist": "Raekwon"}