{"songs": [{"title": "Riot Maker/Enjoy", "album": "Everready [The Religion]", "year": "2006-11-07", "lyrics": "[Intro: Tech N9ne]\nThis song is dedicated to Brian B'zle Dennis\nAnd all of the 57th Street Rogue Dog Villians\nReal riot makers\n\n[Bridge: Tech N9ne]\nThis one right here's for the riot makers!\nThe moshers, the stompers and jaw breakers!\nWe gon' start this shit off right!\nWe got KCMO in the house tonight!\nWe gon' start this shit off right! (Off right!)\nWe got Tecca N9na in the house tonight! Come on!\n\n[Verse 1: Tech N9ne]\nThis is the moment for riders and thugs\nStrippers in body bags, zippers and violence and drugs\nPoverty, a bunch of minorities die in the club\nThey say my music's making 'em lose it, I write it in blood\nThis is my music for all my people missing my music\nKeep listening to it, and like I said, get a pistol and use it\nSatan shot my homie Maintain with a missile and blew it\nFor the industry, 'cause he was one of the truest\nI don't know why they be pumpin', it's somethin'\nMaybe in the music wanna be bumpin'\nIt's crunk and it's hella haterific\nThrow your set up in the air is all the DJ really wanna play\nWhen it's over it's looking bloody and satanistic\nKillas from everywhere listen to me when I be bustin' shit\nI'm turbulence, some get nervous when I wreck arenas\nConcert promoters in Honolulu don't wanna see me\n'Cause they say that Samoans will riot on Tecca N9na\n\n[Hook: Krizz Kaliko & Tech N9ne]\n'Cause I'm a riot maker! That's if you don't know\nI'm a riot maker! They mosh at my shows\nI'm a riot maker! And I come out bustin'\nI'm a riot maker! Riot maker!\nI don't give a damn about nothing!\nSlide Freaker, I'm a skyscraper\nRiot maker\n\n[Verse 2: Tech N9ne]\nHop in a mosh pit for sho!\nYou push, you shove, you get elbowed!\nBack on, 'cause this for Fat-Tone and Mac Dre\nAll of the soldiers who got gone on that day\nAll my people's sittin' in prison this is for you\nSo won't you listen to the shit that I'm spittin?\nFuck the law man the government they'll hem yo ass up\nThey'll do everything in their power to get a fast buck\nNo right or wrongs, just killer bees out for your honeycomb\nBut you'll find out, when you bind out, you can be free if your money long\nEver been to one of my shows? Yeah, it might be crazy\nIn Ohio, a chick got a little too hyphy, baby\nStage diving and crowd surfing, couldn't hold back\nBut they dropped her, now she's unconscious with her skull cracked\nNow when this happened it wasn't even during my set\nThey wanted me to give a signed poster to the hospital, bet\nWhen Travis told me we got papers I thought he was playin'\nThis bitch is suin' Tecca N9na for one hundred grand!\n\n[Hook: Krizz Kaliko & Tech N9ne]\n'Cause I'm a riot maker! That's if you don't know\nI'm a riot maker! They mosh at my shows\nI'm a riot maker! And I come out bustin'\nI'm a riot maker! Riot maker!\nI don't give a damn about nothing!\nSlide Freaker, I'm a skyscraper\nRiot maker\n\n[Bridge 2: Tech N9ne]\nStand back if you're frightened!\nYeah! Get back 'cause we fightin'!\nI'm a skyscraper\nThat's why everybody in my path is trynna get a little piece of my paper\nMan I swear the N9na will never love them, plug them\nWhen I'm rollin' with Skatterman and Snug Brim!\n\n[Verse 3: Skatterman]\nIt's Skatterman, cat, Strange Music's black sheep (Why?)\n'Cause I'm still countin' money off the back streets\nEvery city, every show, I got to pack heat\nThis ain't no fucking rap song, check my rap sheet\nI'm one of a kind, turn one into nine\nBlow your head of your shoulders, dog, it's nothin' but time\nAnd I never raise my voice, you a bum, why should I holler on you?\nWith a whisper I can drop a couple dollars on you\nSss, sss! Sick them rottweilers on you\nKillers bustin out the windows of Impalas on you\nA made man in the streets, I made grams\nWrote lyrics about my life, dropped an album, and made fans\nNow I'm chillin' on the tour with the red-head wonder\nDid 57 shows in a three month summer\nAny deuce bitch ass nigga fuckin with Tech\nGonna be found in Swope Park with his nuts in his neck\n\n[Verse 4: Snug Brim]\nLike you ain't know, we put it down like this\nSnug Brim, Kansas City, Missouri, uzi, groupies, doobies, and fins\nSuzy Qs ain't no excuse for the sin, so watch your tongue\nIf you woopin' we come to shootin' up at you and your bitch\nYou just assume you tried the shoes, they ain't fit\nYou never knew that I lose you off in the section with your dude in the ditch\nWhether it's reppin dog, or movin' them bricks\nI keep it gutta little homie, look my records, see I'm doin' it big\nAs you can tell I ain't no regular nigga I'm filled with star qualities\nI hang out with bitches that's naked and watch the broad swallow me\nIt's always solo, you can't fake it.. so don't try ta follow me\nYou still can't get back up on your feet\nYou right back where you ought to be\nI see you failin' 'cause Strange Music got it locked boy\nInvest your stock boy, Kansas City hot boy\nIt's really fuck a hater, some some weed, get ya paper\nYou can see me now or later, motherfuckin' riot maker\n\n[Hook: Krizz Kaliko & Tech N9ne]\n'Cause I'm a riot maker! That's if you don't know\nI'm a riot maker! They mosh at my shows\nI'm a riot maker! And I come out bustin'\nI'm a riot maker! Riot maker!\nI don't give a damn about nothing!\nSlide Freaker, I'm a skyscraper\nRiot maker\n\n[Outro: Tech N9ne]\nWe will, shut this motherfucka down!\nWe will, tear up your motherfuckin' town!\nSince 1985.. Six, six, triple eight, forty six, ninety nine, three..\nWelcome to Everready... En-enjoy", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}