{"songs": [{"title": "Pretty Young Girl  [Live ]", "album": null, "year": "2018-06-15", "lyrics": "[Intro]\nA few years ago, many years ago at this point now\nI met a very special someone who I love very much\nDear friend of mine\nA friend of mine that uh, actually helped me write this very song\nFor my, for a soundtrack for my novel that I'll be releasing\nWhooo!\nI wouldn't be here without this guy, he's an amazing man\nAnd he's one of the best fuckin' producers of all time\nI don't give a shit\nI want you guys to make some noise for my best friend 6ix\nMake some noise!\nWhooo!\nCome on, make some noise for the boy\nScream as loud as you can!\nWhooo!\nBobby!\nBobby!\nAight, let's fuckin' do it, here we go\nFuck yeah, Bobby!\n\n[Chorus]\nShe's a pretty young girl, doin' pretty young things\nShe's a pretty young lady, pullin' at my heartstrings\nPretty young girl, take my hand\nI'll be your man, I said, I'll be your man\nI don't think you know, all the things you do to me\nIt's new to me, it's all the things I've never known before\nI don't think you know, all the things you do to me\nIt's new to me, it's all the things I've never known before\nBefore, before\nAnd I, I said hi, oh\n\n[Verse 1]\nI'm fucked up\nI mean, I really am hurt\nYou're new and you're beautiful\nBut experience tells me this ain't gonna work\nYou're just like all the rest, suffering in disguise\nBehind those beautiful eyes, lies, lies, and I\nJust can't do it again, I just don't wanna pretend\nThat it'll work in the end\nOr if it don't, we'll be friends\nMy heart can't take no more, I'm sincerely sure\nBut if that shit was true, why in the hell am I singing for?\n\n[Chorus]\nA pretty young girl, doin' pretty young things\nShe's a pretty young lady, pullin' at my heartstrings\nPretty young girl, take my hand\nI'll be your man, I said, I'll be your man\nI don't think you know, all the things you do to me\nIt's new to me, it's all the things I've never known before\nI don't think you know, all the things you do to me\nIt's new to me, it's all the things--Aye!\n\n[Verse 2]\nLast shorty, I ain't have no free time\nGave her all my everything, ain't never had no me-time\nToo scared to commit, no, don't want no rewind\nI could give a fuck what the world think, we fine\nI've been feelin' shook, don't know where to look\nLast girl got me sprung, threw out my black book\nNow I ain't got no Rolodex, but I ain't lookin' back, though\nI ain't jumpin' back up in the game, show me the backdoor\nI ain't got no time for thots, that shit is a bad idea\nI don't got no time for hoes, I only want a good girl who knows\nHow to get wild with it, start out shy wit' it\nLike she from the 3-1-2 'til I hit it\nShorty, get up in it, know your limits, yeah, I'm good\nI'm good, I'm good\n\n[Chorus]\nAnd she's a pretty young girl, doin' pretty young things\nShe's a pretty young lady, pullin' at my heartstrings\nPretty young girl, take my hand\nI'll be your man, I said, I'll be your man\nI don't think you know, all the things you do to me\nIt's new to me, it's all the things I've never known before\nI don't think you know, all the things you do to me\nIt's new to me, it's all the things I've never known before\nWhoo--", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}