{"songs": [{"title": "Trippin Remix", "album": "Unleashed & Unreleased Vol. 2", "year": "2002-01-01", "lyrics": "Huh, you know what time it is\nThis is the remix (this is the remix)\n'99 to infinite\nBad girls\nKima, kiesha, pam\nTalk to me\n\nBaby, yeah (I like this right here)\nYour show is bumpin' (c'mon)\nYou show me somethin' (heh heh, something, baby)\nSee, I won't (c'mon), trade you\nIn for nothin' mmmm (I like the way it's goin' down)\nSee erything, you do to me\nYou got me trippin' (you got me trippin' baby, but I like it)\nAnd I'm satisfied (c'mon)\nAnd I'm guaranteed (let's go)\n\nI hope you (yeah)\nThat you've been checkin' me (it's the remix)\nI know what you're talkin' bout\nYou got me trippin' on my own feet, yeah, yeah\nYou got me buggin' boy (c'mon) ohhh\nYou bring me so much joy, (yeah)\nYou got me open, boy\nAnd I'ma save my - self for you, baby (that's right)\n\nKeisha talk to me\n\nBaby, yeah (huh)\nThere's something (there's somethin'), I'll mention (c'mon)\nMe and her (I like the way that sound) la la la la la la la (c'mon)\nSee, she's no (she's no), competition (heh, heh)\nSo tell her, yeah (tell her now) (you look good, can I taste you? )\nThat you're through with her (yeah)\nAnd you're lovin' me (that's right)\nAnd that's to-totally (that's totally, kima, kiesha, and pam) totally\nAnd you're dedicated (you're dedicated), to me\n\nUh, huh, ah\n\nLike to sprout when the lights is out (dmx)\nKeeping niggas on point, that's what life's about (that's right)\nYou like to shout? I'ma put that shit to a-cease (huh huh) (yeah)\nFrom here to the paper, from the bed to the grease (a'ight)\nLike police, I get away with mad credit shit\nOnly the niggas that don't catch it, doin' some mad hungry shit (huh) (uh huh)\nAll that buddy shit was left alone, back in school (ugh) (c'mon)\nEven then, the nigga was cuttin' up (yeah), actin' fools (what!)\nBroke a lot of rules (why? ) just because I could (uh, huh) (that's right)\nGot away with most of it, just because I'm good (uh huh)\nStabbin' niggas with wood, I was one of the first\nDoin' dirt, but I'm still outrunnin' the hertz\nAnd it's always worst than it looks (uh, huh) (c'mon)\nBut then you never understandin' the thirst of a crook (you arrested)\nFirst comes the hook, the assault, then come the robbery (damn)\nMy world is always (ugh!) dark and ain't no stoppin' me\nCome on!\n\n(c'mon, sing to me keisha) (mmmmmmmmmm) baby\n(take me to the bridge) (mmm-mmmmmm) there's one thing\n(can you feel it? ) (mmmmm-mmm) I'll mention\n(I like the way it feels) (mmmmmm-mmm) nah, nah, nah\n(this one's for me) (mmmmmm-mmm) see she's no\n(mmmm-mmmm) competition (c'mon, let's go)\n(bad boy) (mmmmmmmmmm) baby\n(ruff ryder) (mmm-mmmmmm) there's one thing\n(def jam) (mmmmm-mmm) I'll mention\n(dmx and we won't stop) (mmmmmm-mmm) nah, nah, nah\n('cause she won't stop) (mmmmmm-mmm) see she's no\n(back it up, back it up) (mmmm-mmmm) competition\nI hope you that you've been checkin' me (just dance for me)\nI know what you're talkin' bout (just dance for me)\nYou got me trippin' on my own feet (just dance for me)\nYou got me buggin' boy (this is the remix)\nYou bring me so much joy (this is the remix)\nAnd I'ma save myself for you (yo hooker, yellow man, pd)\nI hope you\nThat you've been checkin' me (hit me baby, ha!)\nI know what you're talkin' bout\nYou got me trippin' on my own feet\nYou got me buggin' boy\nYou bring me so much joy\nAndIi'ma save my - self for you", "image": "https://images.rapgenius.com/1434e8ee824f41e765821605650b321b.500x366x1.jpg"}], "artist": "DMX"}