{"songs": [{"title": "We Do This", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Hook]\nAin't no use in tryin to lie\nYou know we be ridin' fly\nAll that stuff you tryin to buy\nBoy you know we be twice as fly\nWe do this\nI'll show you how to do this\nI'm probably the coolest\nI'll show you how to do this\nI'll show you how to do this shit\n\n[Verse 1]\nI got a drop 430, rims so purty\nShut ya lil gallardo down closed curtain\nYa got a Murcielago I got a McLaren for it\nBalla of the year I oughta win a award\nI got money offshore that I made off tour\nCash stashed in a paper bag from a whore\nSome from the dro, some all blow\nNever go broke but I still want more\nYa ain't gettin' nothing pimpin if ya ain't gettin' dough\nYa got a bitch n ya wonder why she ain't gettin' low\nBut she freakin wit fo'\nShit if you was tryin to be fly I suggest try a little more nigga\n\n[Hook]\n\n[Verse 2]\nWho ya ever seen under thirty this fly\nPlaya house south beach top floor its a tie\nAnd this'll never stop I'll do this shit til I die\nThen after that consider me a ribbon in the sky\nI'm G4 flyin' big boat buyin\nLand in miami then I sail to a island\nMy Cali crew high in the hills I ain't lyin'\nMan them bitches get high in anything they tryin'\nI got cars I don't know about money I don't know about\n3 or 4 movies get a 100K a show about\n10 mil in real estate make them niggas really hate\nWhat I care about it I ain't like them niggas anyway\n\n[Hook]\n\n[Verse 3]\nI'm a fool with the bitches I talk they listen\nFunny thing all I gotta say is lets get it\nAnd my mouth piece sweet but my dick game vicious\nPlus I'm paid but they already rich they ain't trippin'\nShe can tell I'm fly first time she ride wit me\nS65 who ride the 550\nKing worldwide God to my city\nYea them other niggas say that they hard but not really\nCoupe super clean shut all the cars down\nI got 50 g's on me i'll tear the mall down\nUse to be in the ?? in the summer home now\nOne in Cabo one in miami think i'll go to rome now\n\n[Hook 2X]", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}