{"songs": [{"title": "X", "album": "Restless", "year": "2000-11-28", "lyrics": "[Intro: Xzibit]\nYeah! Ladies and gentleman\nBroadcastin' live to you and yours\nIt's Mr. X to the Z, Xzibit\nYeah, bouncin', c'mon\n\n[Verse 1: Xzibit]\nThe first day of the rest of my life\nX stand behind the mic like Walter Cronkite\nY'all keep the spotlight, I'm keepin' my rhymes tight\nLose sight of what you believe and call it a night\nThis ain't the light-weight, cake mix shit that you're used to\nTeflon territory you just can't shoot through\nYou gon' shoot who? (Who?) Not even on your best day\nRollin' the Wild West way, givin' it up\nLeavin' the whole world stuck not givin' a fuck\nLaid in the cut, now we break through in the rut\nHennesey and orange juice baby fill up a cup\nQuick to grab Mary Jane by the butt and squeeze\nLoosen up, let your hair down and join the festivities\nOvercrowd the house like lockdown facilities\nBitches be quick to give me brains while the pistol range\nGoin' up and down my dick like the stock exchange\n\n[Chorus: Xzibit & (Dr. Dre)]\n(X) Rearrange the whole game with my rugged sound\n(X) Won't even say your own name when I come around\n(X) Stay on top but remain from the underground\n(X) to the Z and we all in the family\n(X) Rearrange the whole game with my rugged sound\n(X) Won't even say your own name when I come around\n(X) Stay on top but remain from the underground\n(X) to the Z and we all in the family\n\n[Verse 2: Xzibit]\nEver since Xzibit could spit, been on some pimp shit\nApproach every woman like a potential mistress\nShine bright, make sure that X stay tight\nCause tonight I might meet my next ex-wife\nMr. Big Chief Reefer, Xzibit use his dick like a Visa\nI run it through and money come out\nRunnin' your mouth, I'll have somebody run in your house\nBorrow your spouse and have a little fun on the couch\nNow you know that it was bound to happen\nI came to give you what you lackin'\nWhenever you hear them other niggas rappin'\nRockin' chains, stadiums, paladiums, cracked craniums\nMy whole skeleton is dipped in titanium\nDrop-top tinted on twenties\nUsin' rappers like crash test dummies, stackin' real estate and money\nIt's funny how things change overnight when you thinkin' right\nI beat the odds like Ike beat on his first wife\n\n[Chorus: Xzibit & (Dr. Dre)]\n(X) Rearrange the whole game with my rugged sound\n(X) Won't even say your own name when I come around\n(X) Stay on top but remain from the underground\n(X) to the Z and we all in the family\n(X) Rearrange the whole game with my rugged sound\n(X) Won't even say your own name when I come around\n(X) Stay on top but remain from the underground\n(X) to the Z and we all in the family\n\n[Verse 3: Xzibit]\nWhat an event, we hardcore a hundred percent\nMakin' it stick, Los Angeles proudly presents\nThe real deal, how does it feel? No special effects\nYank the chain off of your neck, demand the respect\nNow all your conversations sound strange to me\nSeem like everybody around me done changed but me\nI stand alone on my own two feet\nStab a track, strangle the beat - Restless, no time for sleep\nNiggas be weak, I'm concrete like Benjamin Grimm\nIt's a very thin line between a foe and a friend\nStraight to the chin (Not these niggas again)\nCall Doc, bounce to the spot and slide right in\nI ain't tryin' to see nothing but progress, regardless\nHome of the heartless, move right, remain cautious\nRepresent nothing but the hustle and struggle\nHennessy, rock plenty of ice, making a double, and scream\n\n[Chorus: Xzibit & (Dr. Dre)]\n(X) Rearrange the whole game with my rugged sound\n(X) Won't even say your own name when I come around\n(X) Stay on top but remain from the underground\n(X) to the Z and we all in the family\n(X) Rearrange the whole game with my rugged sound\n(X) Won't even say your own name when I come around\n(X) Stay on top but remain from the underground\n(X) to the Z and we all in the family\n\n[Outro: Snoop Dogg]\nSo there you have it - A-B-C, D-P-G-C\nX to the motherfuckin' Z\nMr. Xuberant, Xtravagant, Xtrordinary, Xciting, X-a-lotta\nXO with a little bit of Xtacy\nX-ing your bitch-ass out if you tryin' to test the G\nAnd what's the recipe? Xcalibur weaponry\nAnd we shoot Xceptionally\nThat there is hot - X marks the spot?\nFuck naw, X spots the marks\nXclamation point, niggas!", "image": "https://images.genius.com/d5c671ebfc7fb71675e8eee4dc36ad03.200x200x1.jpg"}], "artist": "Xzibit"}