{"songs": [{"title": "O Day", "album": "Digi Snacks", "year": "2008-06-24", "lyrics": "[Intro: RZA]\nHip hop is all about having fun, yo, yo\n\n[RZA]\nSword still swing like Kenobi, ya'll cowards know me\nWit the strength of Samson, you still couldn't hold me\nI got the rock stone from David's slingshot\nWho could master the wisdom to which Rakeem got?\n\nWatch for the cops, third eye like the Cyclops\nRed from the chronic, don't need no eye drops\nSlinging white tops on the block til 4 o'clock, then hit IHOP's\nFiends in line like I, Robot\n\nTake a hit, and transform like the GoBots\nTell my uncle that I know what he know not\nBank like Agent Cody, on the hunt like rabid coyotes\nWild like forty Mexicans sippin' on peyote\n\nIn an all black Toyota\nW's on the grill, steering wheel and the motor\nOut to get deniro, til I'm paid like Bob DeNiro\nWith seven prime numbers that's followed by God zero's\n\nMC epitome\nBut these ducka sucka muthafuckas trying to get rid of me\nBut if you decipher my lyrics, truthfully and not critically\nYou'll see I influence the world mentally as well as physically\n\nEmotionally, promotionaly, devotionally, socially\nSpeak the truth, and tell you how it's supposed to be\nZig Zag Zilla cane, wisdom could heal a man?\nRewind that shit\n\nSword still swing like Kenobi, ya'll cowards know me\nWit the strength of Samson, you still couldn't hold me\nI got the rock stone from David's slingshot\nWho could master the wisdom to which Rakeem got?\n\nWatch for the cops, my third eye like the Cyclops\nRed from the chronic, I don't need no eye drops\nSlinging white tops on the block til 4 o'clock, then hit IHOP's\nFiends in line like I, Robots\n\nTake a hit, and transform like the GoBots\nTell my uncle that I know what he know not\nBank like Agent Cody, on the hunt like rabid coyotes\nWild like forty Mexicans sippin' on peyote\n\nIn an all black Toyota\nW's on the grill, wheel and motor\nHeaded to North Dakota\nWith the cocaine, plus the baking soda\n\nMC epitome\nBut these savages trying to get rid of me\nIf you decipher my words, truthfully not critically\nYou'll see I influence the world mentally as well as physically\n\nEmotionally, promotionaly, devotionally, socially\nNigga, I tell you how it's supposed to be\nZig Zag Zilla cane\nWisdom could heal a man\n\nYa'll cowards know me\n\n[Hook: RZA]\nD for Digital\nI - Irresistible\nG be Graphical\nI - Immeasurable\nT come Technical\nA - Analytical\nL be that Lyrical\n\nWho? Bobby Digital\n\nD for Digital\nI - Irresistible\nG be Graphical\nI - Incredible\nT for Technical\nA - Analytical\nL for Lyrical\n\nWho? Bobby Digital\n\n[Outro: RZA (Prodigal Sunn)]\n(Yeah, we gon' take it back RZA)\nWho the fuck stepped on the wire?\nYou stupid mutha - BRRR\nHahahahaha, so you thought you was going to escape, didn't you?\nYou thought you could escape?\nAiyo, let the wolves in, aiyo, son\nAiyo, G, yo, let the wolves in\nAll the niggas in the back\nAll the wolves in the back, come up front\nWe gon' get savage real quick\nFuck that, aiyo, hold on, hold on, hold on, nigga\nMan, get the fuck off my feet, man\nFuck off nigga, I'm trying to do my shit\nOh, ho, ho, ho, ho, Happy New Year, nigga\nMerry Christmas, it's July, hahahahah\nSo the mad scientist continued to drink the Digital Elixir\nFighting with the good and evil inside himself\nTrying to be Bobby, trying to be RZA\nTrying to be one, trying to be real\nTrying to be unreal, trying to be super real, nigga\nRest in peace to the ODB, greatest MC of all time, greatest performer\nOne of the greatest performers of all times\nAiyo, O, yo, O, happy birthday, nigga, hahahahaha", "image": "https://images.genius.com/6aad59336cc99fabe2197eafab36fc0e.500x511x1.jpg"}], "artist": "RZA"}