{"songs": [{"title": "All Eyez on Me", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro: 2Pac]\nBig Syke, Newt, Hank, Beugard, Big Sir\nY'all know how this shit go\nAll eyes on me\nMotherfuckin' OG\nRoll up in the club and shit, is that right?\nAll eyes on me\nAll eyes on me\nBut you know what?\n\n[Verse 1: 2Pac]\nI bet you got it twisted, you don't know who to trust\nSo many player-hatin' niggas tryna sound like us\nSay they ready for the funk, but I don't think they knowin'\nStraight to the depths of Hell is where them cowards goin'\nWell, are you still down? Nigga, holla when you see me\nAnd let these devils be sorry for the day they finally freed me\nI got a caravan of niggas every time we ride\nHittin' motherfuckers up when we pass by\nUntil I die, live the life of a boss player, 'cause even when I'm high\nFuck with me and get crossed later, the futures in my eyes\n'cause all I want is cash and thangs\nA five-double-0 Benz, flauntin' flashy rings\nUhh, bitches pursue me like a dream\nBeen known to disappear before your eyes just like a dope fiend\nIt seems, my main thing was to be major paid\nThe game sharper than a motherfuckin' razor blade\nSay money bring bitches, bitches bring lies\nOne nigga's gettin' jealous and motherfuckers die\nDepend on me like the first and fifteenth\nThey might hold me for a second, but these punks won't get me\nWe got four niggas in low riders and ski masks\nScreamin', \"Thug Life\" every time they pass, all eyes on me\n\n[Chorus: 2Pac]\nLive the life of a thug nigga until the day I die\nLive the life of a boss player (All eyes on me) 'cause even gettin' high\nAll eyes on me\nLive the life of a thug nigga until the day I die\nLive the life of a boss player 'cause even gettin' high\n\n[Bridge: Big Syke]\nHey, to my nigga 'Pac\n\n[Verse 2: Big Syke]\nSo much trouble in the world, nigga\nCan't nobody feel your pain\nThe world's changin' everyday, time's movin' fast\nMy girl said I need a raise, how long will she last?\nI'm caught between my woman and my pistol and my chips\nTriple beam, got some smokers on, whistle as I dip\nI'm lost in the land with no plan, livin' life flawless\nCrime boss, contraband, let me toss this\nNeedy hookers got a lot of nerve\nLet my bucket swerve, I'm takin' off from the curb\nThe nervousness neglect make me pack a TEC\nDevoted to servin' this Moët and pay checks\nLike Akai satellite, nigga, I'm forever ballin'\nIt ain't right: parasites, triggers, and fleas crawlin'\nSucker, duck and get busted, no emotion\nMy devotion is handlin' my business, nigga, keep on coastin'\nWhere you goin', I been there, came back as lonely, homie\nSteady flowin' against the grain, niggas still don't know me\nIt's about the money in this rap shit, this crap shit\nIt ain't funny, niggas don't even know how to act, shit\nWhat can I do? What can I say? Is there another way?\nBlunts and gin all day, 24 parlay\nMy little homie G, can't you see I'm buster-free?\nNiggas can't stand me; all eyes on me\n\n[Chorus: 2Pac]\nLive the life of a thug nigga until the day I die\nLive the life of a boss player 'cause even gettin' high\nAll eyes on me\nAll eyes on me\nLive the life of a thug nigga until the day I die\nLive the life of a boss player 'cause even gettin' high\nAll eyes on me\n\n[Verse 3: 2Pac]\nThe feds is watchin', niggas plottin' to get me\nWill I survive? Will I die? Come on, let's picture the possibility\nGivin' me charges, lawyers makin' a grip\nI told the judge I was raised wrong and that's why I blaze shit\nWas hyper as a kid, cold as a teenager\nOn my mobile, callin' big shots on the scene major\nPackin' hundreds in my drawers, fuck the law\nBitches, I fuck with a passion, I'm livin' rough and raw\nCatchin' cases at a fast rate, ballin' in the fast lane\nHustle 'til the mornin', never stopped until the cash came\nLive my life as a thug nigga until the day I die\nLive my life as a boss player, 'cause even gettin' high\nThese niggas got me tossin' shit\nI put the top down, now it's time to floss my shit\nKeep your head up, nigga, make these motherfuckers suffer\nUp in the Benz, burnin' rubber\nThe money is mandatory, the hoes is for the stress\nThis criminal lifestyle, equipped with a bulletproof vest\nMake sure your eyes is on the meal ticket, get your money\nMotherfucker, let's get rich and we'll kick it; all eyes on me\n\n[Chorus: 2Pac]\nLive the life of a thug nigga until the day I die\nLive the life of a boss player 'cause even gettin' high\nAll eyes on me\nAll eyes on me\nLive the life of a thug nigga until the day I die\nLive the life of a boss player 'cause even gettin' high\nAll eyes on me\n\n[Outro: 2Pac]\nPay attention, my niggas! See how that shit go?\nNigga walk up in this motherfucker and it be like, \"Bing!\"\nCops, bitches, every-motherfuckin'-body\n(Live my life as a thug nigga until the day I die)\n(Live my life as a boss playa, 'cause even gettin' high)\nI got bustas, hoes, and police watchin' a nigga, you know?\n(I live my life as a thug nigga until the day I die)\n(Livin' life as a boss playa, 'cause even gettin' high)\nHe he he, it's like what they think\nI'm walkin' around with some ki's in my pocket or somethin'\nThey think I'm goin' back to jail, they really on that dope\n(Live my life as a thug nigga until the day I die)\n(Live my life as a boss playa)\nI know y'all watchin', I know y'all got me in the scopes\n(Live my life as a thug nigga until the day I die)\n(Live my life as a boss playa, 'cause even gettin' high)\nI know y'all know this is Thug Life, baby!\nY'all got me under surveillance, huh?\nAll eyes on me, but I'm knowin'", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}