{"songs": [{"title": "Incarcerated Scarfaces (Freestyle)", "album": null, "year": "2018-06-28", "lyrics": "Uh uh uh uh uh uh uh uh uh uh uh uh\nWestwood shit\nYeah warmed up and shit\nJet lag shit\nRepresent Chicago (yeah uh)\nSometimes I feel like I'm the worst\nThis talent is a gift and a fuckin' curse\nThis choppa to take you out the fuckin' Earth\nSpecially if you walkin' on my fuckin' turf\nI feel like Ferg how a nigga put in work\nR. Kelly with the nina Ima make it flirt\nChoppa like a candy make the shit starburst\nLook up in the sky, do the stars work?\nI'm thinkin that I need Percs\nMy mom said thats a damn shame and I need work\nShe say \"fuck that shit I need church\"\nI said \"fuck that shit the church need work\"\nAnd thats real\nI'm happy so its time to take some mad pills\nI'm happy so its time to take some sad pills\nFuck a bitch and put her voice up on the adlibs\nIma probably do that\n.40 on my hip yeah Ima prolly' shoot that\nBad bitch in my DMs Ima prolly' do that\nHit the gang up and let them run through that\nThis is off the top like waves in the do-rag\nI'll leave your eye blue black\nThat's just how we do that\nThat's just how we\nSpazin' on they ass do that shit all day\nRock Gucci and Louis but I dont fuck with Balmains\nOut the park like a mu'fuckin' baseball game\nI'm Barak Obama with it I need all change\nShoot him in his face a couple times like a gun range\nCall of Duty with the uzi, this is not a gun game\nI run this shit like bolt nigga, no Usain\nI do thangs nigga, yeah I do thangs\nOff the dome when I spit shit\nThis is not a writtin'\nAnd these other niggas they be forgettin\nThat I'm the best to ever fuckin do this\nThese other niggas lookin' stupid\nBetrayin they brothers like who the fuck is you? Judas?\nWho the fuck put you to it?\nChoppa on my hip, I load it and put it through you\nCatch me listenin' to Green Day havin' a blue day\nWith a bad bitch sippin' on D'USSÉ\nShe'll go both ways, anything for foreplay\nThat's what I say\nThats what I say, Im so high of the Percs\nThey lookin' at me sideways\nIm goin' 190, the wrong way on the highway\nTryna get my life straight\nCatch me drunk drivin in the suburban\nWith a nigga, the bomb strapped on his chest and a turban\nI deserve it, Im ballin hard like I'm Julius Erman\nI meant Julius Erving\nI keep sippin' the bourbon mix it with the syrup turn to a serpent\nOne things for sure, two things for certain they blow like Kurtis\nMy flow close curtains\nYour flow ain't workin'\nSo nigga keep on searchin'\nIm sure one day you'll find that person\nEverybody talking Lucid Dreams\nBut most these niggas don't even know Lucid mean\nMost of these bitches be really fuckin' losin' me\nEeny meeny miny moe, these hoes get to choosin me\nI remember when I ain't have shit\nThey was treatin' me like i ain't have shit\nThey was treatin me like I was lower class\nThey was treatin me like I was a savage\nNow they in my DMs tryna say\n\"Juice you can have it, come over grab it\"\nI dont wanna have it\nI let my bro cut it like he fuckin' stabbed it\nTaboe with the Glizzy how I'm jabbin'\nHow I'm jabbin'\nMan spendin' money is a bad habit\nBut I ball out with this shit, I'm a Maverick\nMake em disappear like magic\nCall a plane then I execute like Madden\nOff a flat in a bad bitch house\nTryna' get it crackin' from the back end (yeah hm)\nYeah\nUh uh uh uh yeah\nUh uh uh uh yeah\nFresh off the jet\nFreestyle and shit\nEminem beats, 8mile and shit\nWhere I came from the great wild and shit\nWhere you would get shot if you crack smiles and shit\nAll my niggas goin' too hard and shit\nI'll pull your bitch like a card and shit\nHeard she for sale I'm bargainin'\nAt the door, I'm barging in\nYellow boned like Marge again\nI spread her out like margarine\nI just marchin' in\nFeelin' like a spartan kid", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}