{"songs": [{"title": "Santa Claus Goes Straight to the Ghetto", "album": "Christmas On Death Row", "year": "1996-12-05", "lyrics": "[Produced by Snoop Dogg]\n\n( ) = Santa voice\n[ ] = Squeaky kid voice\n\n[Intro: Bad A$$]\nIs that the black Santa Claus? (Ho ho ho! Merry Christmas!)\nI want a Super Nintendo ... yeah, Sega Genesis, yeah\nStreet Fighter 2, all these games...\n[Mommy! Is that the black Santa Claus?\nThat is the black Santa Claus! Mommee! Mommee! Mommee!]\n\n[Verse 1: Dat Nigga Daz]\nIt's 12.30 AM, Christmas Eve\nI'm out with the gangstas and thieves\nCelebratin', postin' up with eggnog [head up up] in my cup\n[Put Rudolph and Moses] lil' bang-bangin' and coastin'\nDown the block but be careful for the heart, because it's posted'\nSome stay to this day that Christmas ain't nothing but another day\nBut, out of respect, I gotta give the Lord his day\nTell me, tell me, where do the homies and bums got to sleep? {Nowhere}\nWhere do hungry and the needy-greedy's got to eat? {But who cares?}\nLife is so crucial and cold, [it's worse] for the children\nIn this world they hopes and dreams can't afford\nThe young and old churches and spiritual dreams, seasonal things\nHeard throughout the ghetto reaches gangstas and dope-fiends, huh\nCause those who ain't able get it now can finally get it\nCause the ghetto Santa Claus has sprinkled the hood and now we ballin'\nLivin' to a new year of better thangs\nCelebrate it with some Champagne, ha ha, check it ...\n\n[Hook: Nate Dogg]\nSanta Claus ... is coming straight to the ghetto ...\n\n[Bridge: Snoop Doggy Dogg]\nNow on the first day of Christmas, my homeboy gave to me\nA sack of the krazy glue and told me to smoke it up slowly\nNow on the second day of Christmas, my homeboy gave to me\nA fifth of Hendog and told me to take my mind off that weed\nNow by the third day of Christmas, my big homeboy gave to me\nA whole lot of everything, and it wasn't nuthin' but game to me\n\n[Verse 2: Bad A$$]\nBack then, you woke up to the sound of \"I Saw Mama Kissing Santa\"\nMade you remenisce on the old fashion Christmas days\nGifts, miss a fat man jolly with joy\nDown ya chimney with toys for lil' girls and boys\nPumped up, I jumped up before the sun peeped in\nAnd hoped to catch a Santa Claus creepin' down my hall\nRan to the window, put my eyes to the sky\nTo see if I could see the sleigh that parlayed and pushed a fat guy\nI sigh, ain't no sign, but everything under this tree in my house is mine\nMy bike, that, and this plastic nine'll do fine till next year come\nI try to see the same thing, they got us brain washed dumb\nAnd when you find, it ain't no Santa, Christmas still mean a lot\nCause it's the time to get together and give all you got\nYou got food, good moods, and what's better than together with your people\nWhen wishers give a toast by the tree, it's Merry Christmas\n\n[Hook]\nSanta Claus ... is coming straight to the ghetto ...\n\n[Verse 3: Snoop Doggy Dogg (starts during Hook)]\n(Don't get too close because you might get shot ...\nWelcome to the ghetto ...)\nSanta Claus on the ceiling, Jack Frost chillin'\nPinch the Grinch for being a holiday villain\nSeason's greetings, all the proceedings\nAre brought to you by the church house where we'll be eatin'\nChestnuts roastin' on an open fire\nSingin' my jingle, where is Kris Kringle\nI didn't pop, I ain't even shouted\nI even stayed in the house, where the homies tried to sneak me out\nAnd all I want for Christmas is my 6-4 Chevrolet\nAnd a granddaughter for her grandmother Beverly\nAin't that somethin'? Nah, ain't that nothin'\nHow it's Christmas time and my rhyme's steady bumpin'\nEverybody happy, hair still nappy\nGonna steal a gift for my old grandpappy\nCatch me giving out turkeys at the church-house\nDon't try to work me, just stand in the line and everything gon' be fine\nHolla at ya folks, boy, it's goin' down\nAin't no help from no elves, just Tha Dogg Pound\nAnd we passin' out gifts, blazin' up spliffs\nChristmas on the Row, can you dig it? {can you dig it}\n\n[Hook]\nSanta Claus ... is coming straight to the ghetto ...\n\n[Verse 4: Tray Deee]\nChristmas Eve, by the leaves, every 6 with the year\nGirls and boys full off joy with the season cheer\nSmell the sky, hella pies and cakes gettin' baked\nTo be ate after everything gone off your plate\nBut wait, not tonight it's straight beans and rice\nOn the table, are we able to proceed tonight?\nI wonder what the morn's bringin' so it's hard to doze off\nThree 'o clock in my socks I crack the dope song\nHopin' when I open the door I'll see Santa\nNow who the hell is this in this blue bandana\nMessin' with the boxes that's up under the three\nLook like Santa Claus been crossed to a woman to me\nNow I'm comin' to see, the whole picture gettin' clearer\nHow we have messed; I says best get nearer\nMirror, mirror, please, it's seemed I've be deceived\nAnd thank the same trick for the gifts I receive\nSo I creep back, and act like I ain't even peeped it\nThis'll be me and Mom's private secret\n\nSanta Claus ... is coming straight to the ghetto ...\nSanta Claus ... is coming straight to the ghetto ...\nSanta Claus ... is coming straight to the ghetto ...", "image": "https://images.genius.com/cfc7f679c6b2913ffcb7df51fffc508f.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}