{"songs": [{"title": "Act a Fool", "album": "Port of Miami 2", "year": "2019-06-21", "lyrics": "[Intro: Rick Ross]\nIt's a beautiful day to get some money\nAnd every day is another opportunity to touch some paper\nSo I pray you wanna see a young nigga shine\nIf not, nigga, put ya head in a hole or I'ma put a hole in ya head\nYa heard me? (Huh)\nTell me right now, nigga, whatchu wanna do?\n20 billboards in the city, who the fuck is you?\nI look a lil' familiar, don't I? Hahahaha\nLook at y'all, look at it, look at it, nigga (Maybach Music)\nYo (Uhh)\n\n[Chorus: Rick Ross]\nTell me right now, nigga, whatchu wanna do? (Huh)\n20 billboards in the city, who the fuck is you? (Woo)\nI DM all of your bitches when I'm in the mood (Hah)\nQuick to blow a hunnid keys, yeah, that boy a fool\nYeah, that boy a fool\nYeah, that boy a fool\nYeah, that boy a fool\nOh God, yeah, that boy a fool\n\n[Verse 1: Rick Ross]\nAss on all my bitches so I squeeze 'em in the coupe (Huh)\nFascinated with the fortune and it came true (Woo)\nI may pass you in the Porsche with the brains blew (Nyoom)\nGot your bitch so wet, I'm steppin' out in rainboots (Huh)\nThought it was Obama, way I came through\nI'm talkin' different commas from them lame dudes (Nigga)\nI'm printin' paper, boy, I even wrote a book (Biggie)\nI got 10 million cash, what, you wanna look? (Biggie)\nI got a half a kilo in my Monte Carlo (Huh)\nAnd if I pull that Nina, boy you got a problem (Woo)\nRichest nigga down in Florida, like I hit the lotto (Huh)\nIt's amazin' what could happen with a couple dollars (Dollars)\nThey wasn't fuckin' with me when I went to school\nGod damn, what that nigga do?\nHe got a Rolex and you know it's new\nEvander Holyfield and Lennox Lewis\n\n[Chorus: Rick Ross]\nTell me right now, nigga, whatchu wanna do? (Huh)\n20 billboards in the city, who the fuck is you? (Huh)\nI DM all of your bitches when I'm in the mood (Hahaha)\nQuick to blow a hunnid keys, yeah, that boy a fool (Boss)\nYeah, that boy a fool (Boss)\nYeah, that boy a fool\nYeah, that boy a fool\nOh God, yeah, that boy a fool\n\n[Verse 2: Rick Ross]\n10 stacks on the stage, cause a whirlwind (Whirlwind)\nTake a couple stacks and give that to your girlfriend (Woo)\nLove to see pretty bitches kissin' on pretty bitches\nNumber one in my book is all the realest bitches (Hahaha)\nReal niggas gettin' money and she keep it square (Square)\nIf she were a hunnid then I'ma keep it there (There)\nI got a Lamborghini now I need the shoes\nTook 'em on the high speed so I made the news\nBig bank boys, time to act a fool (Woo)\nBig bank, you gotta help me count it, too (Bang)\nHalf a ticket, boy, I spent it in the Lex\nSeven figures, nigga got it on his neck\nI get exclusive Nikes with the light-up checks\nStill scared to get indicted for the white investments (I swear)\nRich nigga, bitch, I got it tatted on me (Tatted on me)\nI'm married to this shit, I get my alimony (Woo)\n\n[Chorus: Rick Ross & Wale]\nTell me right now, nigga, whatchu wanna do? (Huh)\n20 billboards in the city, who the fuck is you? (Huh)\nI DM all of your bitches when I'm in the mood (Tell 'em dawg)\nQuick to blow a hunnid keys, yeah, that boy a fool\nYeah, that boy a fool\nYeah, that boy a fool\nYeah, that boy a fool (Folarin in this bitch, yeah)\nOh God, yeah, that boy a fool\n\n[Verse 3: Wale, Rick Ross & Both]\nFolarin in this bitch, your bitch is glad to see it (Huh)\nI like my women built like they could win a hundred meters (Woo)\nI'm not that nigga that you niggas finna suck your teeth at (Nigga)\nYou see this watch, you raise your eyes, it's Rocky Maivia (Hahaha)\nHow did I get here? (Here) Who the fuck is you? (Nigga)\nNiggas on their high horse, cool, I'm investin' in glue\nWe can rumble or settle it cool\nRoss told me homie is chess then he made checkers the move\nYeah, hunnid SBs\nThat's 20 something on me (Huh)\nTrust they not stuntin' on me (Huh)\nSome of y'all just finally catchin' up (Huh)\nGuess my old seminar free (Huh)\n'Cause all my old shit from like '06\nIs on everybody feet (Woo)\nAnd now they walk it like I talk it\nY'all just go pay homage (Wallace)\nLeast before like March\nI had them Cactus Plant Flea Markets (Folarin)\nAnd I just called up Travis, for the cactuses you coppin'\nPink laces on my Jordans or pink boxes on my condoms\nAnd my closet, boy\n\n[Chorus: Rick Ross]\nTell me right now, nigga, whatchu wanna do? (Huh)\n20 billboards in the city, who the fuck is you?\nI DM all of your bitches when I'm in the mood (Truce)\nQuick to blow a hunnid keys, yeah, that boy a fool\nYeah, that boy a fool\nYeah, that boy a fool\nYeah, that boy a fool\nOh God, yeah, that boy a fool\n\n[Outro: Rick Ross]\nM-M\nLord have mercy\nM-M-M\nFor these pussy niggas on the Sabbath\nM-M-M-M-M-M\nHuh", "image": "https://images.genius.com/ffe917241ebc01292054e8f9fb85a8e5.1000x1000x1.jpg"}], "artist": "Rick Ross"}