{"songs": [{"title": "Skin", "album": "The Divine Feminine", "year": "2016-09-16", "lyrics": "[Intro]\nHa-ha-ha-ha-ha-ha\nHa-ha-ha-ha-ha-ha\nHa-ha-ha-ha-ha-ha\nHa-ha-ha-ha-ha-ha\nHa-ha-ha-ha-ha-ha\n\n[Verse 1]\nYou hide your skin like you're shy or there's something wrong\nYou stylish when you got nothin' on, yeah\nAnd all I do is make these fuckin' songs\nSo finally I made a fuckin' song\nAnd now she comin' closer\nHope she crawls, she wanna jump my bones\nYou want it don't ya?\nI was a soldier, now I'm comin' home, the war is over\nKick down the door, I hold your bends, you never break\nYou need to smell your sweet aroma\nSee I knows you smell like cinnamon, kissin' your lips\nI lick my fingertips and get your clitoris in the mix\nMy dick on business trips\nMy tongue twistin' is ticklin' just a little bit\nI'm swimmin' inside of your skin like a river\nIn the Caribbean\n\n[Bridge]\nIt's okay that you like it babe (I like it baby)\nAnd it's alright that you misbehave\nIt's okay to be this way (this way)\nTo live this way baby baby (ooh baby)\nChillin' with the AC\n\n[Chorus]\nThat's just the way that we are\nYou and me, super freaks here we are\nI'm takin' care of each and every part\nI opened up your legs and go straight for your heart\n\n[Verse 2]\nSaid I'm too divine, I'm too divine, yeah; too divine\nWho am I? Well; I'm Mr. Superfly\nI'm Mr. Ooh-He-Blew-Your-Mind, hot as June, July\nI wanna make you waterfall\nGirl you my painting, you my art installation\nGonna fuck you, put you on the wall\nAll I wanna do is show you off, I want to put you on\nWhy would I ever blow you off?\nRight now, let's go get lost\nJust I've been way too hot for way too long\nI'm so exhausted\nWhether that's your mind or line we still get crossed\nFirst your name is gone\nNever understand until you have to stand alone\nCan I have a hand to hold?\nA Band-Aid for my damaged soul, I paint the planet gold\nI swear I'm Michelangelo, I don't understand these hoes\nThey didn't want a man when it was; man I'm broke\nBut now they know me and what I don't need\nYou gon' see it's gon' be what it's gon' be\n\n[Chorus]\nThat's just the way that we are\nYou and me, super freaks here we are\nI'm takin' care of each and every part\nI opened up your legs and go straight for your heart\n\n[Outro]\nThese hoes\nThese hoes\nTaste this, taste, taste this\nThese hoes\nTaste this, taste, taste this\nThese hoes", "image": "https://images.genius.com/b039f6866294506ae42378217870e464.375x375x1.jpg"}], "artist": "Mac Miller"}