{"songs": [{"title": "Make the World Go Round", "album": "Untitled", "year": "2008-07-15", "lyrics": "[Verse 1: Nas]\nYeah, laced at Macy's, don't have it, a hatred addict\nI need faces mad with frowns when I'm around, or I'm wasting fabric\nI don't feel greater 'til my plush pieces, cause you to suck your teeth\nSo mean-mugging on my clean-thugging mean nothing\nWomen dream I'm your husband\nI'm Alex Pushkin, the black poetry-writing Russian, ice disgusting\nI started bling, how could you question my direction\nOr my Tom Ford collection? Gangstas two-stepping\nYou hate me, should thank me, but lately\nI burned so much trees, I keep environmentalists angry\nI'm a rare dude, I'm a wonder, your best success is my worst blunder\nY'all livin' trendy on pennies, I cop plenty Fendi\nVivienne Westwood, I'm good\nGet the whole Trump Tower top floor for the hood\nDre & Cool, we riding heavy, NY to Miami cause\n\n[Chorus: Chris Brown & Nas]\nWe make the world go round\nNow let's toast to the hustlers\nWe make the world go round\nTell the hustlers to toast to the gangstas\nWe make the world go round\nTell the gangstas to toast to the ballers\nWe make the world go round\nAnd tell the ballers pour a glass for all us\nWe make the world go round\n\n[Verse 2: The Game & Chris Brown]\nI see the haters on the floor jocking my swag\nI'm popping Ralph Lauren tags and pouring champagne inside a Polo glass\nModel bitches rolling grass, Escobar unfolding cash\nToasting with my entourage, went from robbing armored cars\nTo all my stars, red carpet to the L'Ermitage\nWe throwing red dice at the Mirage\nI pull that red Lamborghini on twenties out my garage\nSet up shop in South Beach like Khaled and Terror Squad\n(We The Best!) Big pimping, top down chrome spinning\n\"Top Gun\", Tom Cruise tucked inside my Gucci linen\nNo [censored], just Romo\nYou tryna shine, I put the nine on your jersey for promo\nJessica Simpson, that's so-so\nNick want his (baby back), but that's Loso\nTell Hawaii Five-O to catch me at the Pro Bowl\nOn the field, diamonds choking the jockey on my Polo\nCB, let 'em know though\n\n[Chorus: Chris Brown & Nas]\nWe make the world go round\nTell the hustlers to toast to the gangstas\nWe make the world go round\nTell the gangstas to toast to the ballers\nWe make the world go round\nAnd tell the ballers pour a glass for all us\nWe make the world go round\n\n[Bridge: Chris Brown]\nWe make the world go round\nFrom my town to your town\nWe on top, no stopping us now\nWe got Patron, the ballers two stepping\nLadies on the floor and all 'em two stepping\nFrom L.A. to Harlem, two stepping\n(From L.A. to Harlem, two stepping)\nSo iced out, it's easy to point them haters out\n\n[Verse 3: Nas]\nWe start with Bellini's and end with Patrón shots\nH. Lorenzo belt buckle from Chrome Heart\nAlife tag popper, it'd be sad not to walk out the store with bags\nWorth a hundred cash shopping\nViolence only when have to, have to to swell you up\nPrefer peach Schnaps, Perrier-Jouët, a vanilla dutch\nMets cap, that's Queens, I'm a vet, bet that\n300 carats the average up on the neck, black\nPaid the cost, be the boss, Black Caesar floss\nWeekends at the Venetian, pull up in that black Porsche\nTop down, new fashion\nSeeing me's like seeing through the lens of Helmut Newton's camera light flashing\nAnd I'm laughing, my plaques' from album sales\nY'all is ringtone platinum but ninety-nine cents adds up\nI don't hate 'em, I congratulate 'em\nThe new young Prince with young Mike Jackson on the same track\nWhat!\n\n[Chorus: Nas & Chris Brown]\nNow let's toast to the hustlers\nWe make the world go round\nTell the hustlers to toast to the gangstas\nWe make the world go round\nTell the gangstas to toast to the ballers\nWe make the world go round\nAnd tell the ballers pour a glass for all us\nWe make the world go round", "image": "https://images.genius.com/b494ca4151f14803123849b4f34be37f.700x700x1.jpg"}], "artist": "Nas"}