{"songs": [{"title": "Together", "album": "It Ain’t Safe No More...", "year": "2002-11-26", "lyrics": "[Busta Rhymes]\nHey yo Swizz..\nThis shit sound like some shit\nThe streets wanna do the merengue to (yeah)\nOr dance around a sombrero too, WHOO!!!\nYeah, another special from Flipmode Records\nYeah, yeah, yeah, yeah, yeah here we go!\nStreets! Flipmode baby, yeah check it Busta Bus baby\nYeah, Rah Digga now, c'mon\nCheck it, huh\n\n[Verse: Busta Rhymes]\nIf you ain't noticed yet I have come wit a throne\nSee I was gone for a minute but now I'm home\nThe way I touch it you can feel it in your bones\nFuck wit the kid cause I'm taking you into another zone\nSee it don't matter what you think or what you say\nI always love for the street every single day\nYou better get down on your knees, you better pray\nCause goin' against the grain of this Squad\nI promise you will pay! (WHOO!)\nYou see Flipmode is the team that I rep forever\nRespecting the Code of Honor staying together\nIt's getting hot I think you should take off the sweater\nRattle and knock all of your troops who goin to get this cheddar\nSee when we come I'm wondering how they gon' manage\nShow em mysteriously watch how they vanish\nSee when we finish just analyze all the damage\nNo matter who you are, we accept any and EVERY challenge (yeah)\nYeah yeah, I think we got 'em again this time\nFlipmode c'mon!\n\n[Hook - 1: Mynx] {*Busta Rhymes ad-libs*}\nI think I - I think wanna say something like this (like this)\nPeople denying that they feeling our shit\nSo we hit 'em with the really crazy flow (crazy flow)\nTo let 'em know that we be hitting it fa' sho\nTime goes by, in your life\nAnd we're still here together\n\n[Verse: Busta Rhymes]\nI hope you know that this is really not a game\nThe way I put it down you will remember the name\nThe way we change it up shit is never the same\nAnd when I'm finished I promise I'll have you niggas feel ashamed\nFor giving the people shit they ain't really loving\nIt's funny to me but y'all niggas be buggin'\nBut it's aight because I will continue flooding the streets\nWith heat for the ladies and niggas who be thugging\nAnd if you want it then bring shit wit open arms (spread love baby)\nWhile I continuously give you niggas bombs\nAssalam alaykom wa'alaykom salam\nI'm in the abscence of confusion holding the world in my palms\nI'm tired of telling you there ain't nothing greater\nSwinging the torch and repping for Violator\nSo tell the DJ to go and turn up the fader\nPutting it down for the streets regardless what you saying playa!\nHow many times am I gunna have to tell y'all?\nFlipmode run these streets, c'mon!\n\n[Hook - 2: Mynx] {*Busta Rhymes ad-libs*}\nI wish I - I wish I had just a little more time (more time)\nInstead I give you this and leave more on your mind (on your mind)\nMe and Busta Bus be making crazy doe (crazy doe)\nSo you know that we be killing it fa' sho\nTime goes by, in your life\nAnd we're still here together\nI will be here just to hold you down\nWe'll still be around\nCause we will rock forever\n\n[Verse: Rah Digga]\nDirty reppin' the Squad, don't even get me started\nGetting worldwide love keeping the street regardless\nEver since kindergarten, always been the sharpest\nDoin' this for my fam cause home is where the heart is\nOther crews could chill, all of y'all days are numbered\nBus got the Yellow Digga coming in the Navy Hummer\nStart quality, guess I should thank my mother\n\"Bionic Woman\" on the mic like I was Jamie Sommers\nNow, I know that you don't wanna really take it there\nDigga and Bus you know we make the perfect pair\nWe keep it gully wit a little latin flare, it's unfair\nOh well, how I still be spitting and keep everybody all up in the mix\nIt's only right that I shout my brother Swizz\nFlipmode and we only making hits\nIt's like this, c'mon\n\n[Bridge]\n[Mynx:] Baby I say, what people say\nWe gon' keep it on lock from day to day\nLet 'em know that we both are here to stay\nSo keep it hot baby, don't stop baby\n\n[Busta:]The Flipmode is in the spot we run the place\nBusta Bus and Rah Digga all in your face\nWhen we step up in the spot we controlling the space\nWe keep it hot baby, we won't stop baby\n\n[Busta Rhymes]\nHey yo Swizz, once again see how we do it to 'em? c'mon!\n\n[Hook - 1]\n\n[Busta Rhymes]\nFlipmode Records, J Records\nRah Digga, Flipmode baby\nYeah, Swizz Beats baby\nYeah c'mon, full surface baby\nCheck it yeah, big up to Mynx, what\nC'mon yeah", "image": "https://images.genius.com/cc9251ac994bbe401044c52cb51d1e49.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}