{"songs": [{"title": "100 Rounds", "album": "Immobilarity", "year": "1999-11-16", "lyrics": "[Skit: Unknown man]\nYo, what up D? Huh?\nYou bought that from Tower Records?\nWhat's that, let me see that bag\nGet the fuck off, get the fuck off it\nCome here man, what the fuck I...(banging)\nLike that nigga, give me that man\nYou dead on this purple tape nigga you dead on that\nFuck outta here (gun cock)\n\n[Intro: Raekwon]\nNiggas think I can't sell five million? Y'all niggas is mad\nY'all must not know the work I put in on this\nFor real, that's for real for real (ha ha)\nRepresent, flick it up all day nigga, Immobilarity\nY'all know my work, this category is raw\n\n[Verse 1: Raekwon]\nAiyo slash your position, verbal mic physician\nBlow lines like chimes in the kitchen\nGod Cer-Vega, straight up stomp that fake out\nWhat, he biting everything, biting his nuts\nWe slang like champions, caught me in the outlet in Hamptons\nStyle it out, throwin four thousand out\nSwimsuit mammal get high, float flammable\nDrop off in a Benz boat lampable\nRear like hittin a deer\nPlayin Cuban Linx movin in the chair, he got a ear\nNo question all brolic guerillas stand up\nWhoever large throw a hand up, throw a grand up\nLet's like multiply connect both sides, big shit low rides glide\nEverybody bump once\nYo Chef gonna throw ya'll niggas free lunch\nHit the L twice, need it once\nTrack be yelling like a whore, like a swelling on a sore\nOr this rap Magellion on your jaw\nI'm a night freak, boating on the weekends, ten a week\nFlows spray it like Clinique, rich unique\nBitch you weak, contact Reek\nWe callin up Leek, yo he famous like Ali feet\nYo mystical,  rap Larry Davis with a pistol\nAnd this you, you a student, fucking with a principal\n\n[Hook x2: Raekwon]\nRollin like ten at a time, begin\nLove revolves around a thin line, go against this, send mine\nLace you chase you down, let a hundred rounds race you\nNow you went from brolic to a facial\n\n[Verse 2]\nYo, ayo glass tree house\nYo, fiendin like a fuck in a green house\nRush and cut, chain cream out\nBlow steam out\nRare like guccis in ears\nGoose bears\nSkied up, loving all my deustch years\nCoat for broadway\nHundred and 39th all day\nGot my chick rollin call her Parle'\n20th century max like jail penitentiary\nNikki Barnes gon' lynch me\nWhat, fruit flavored nikes\nBenz 2000 the hype piece\nSend half my love out to white peeps\nWu-Tang emblem, success, make a nigga tremble\nNine of us stand, nine resemble\nFilling out tax reports\nLook live up in Guess shorts\nBitches got love and support\nYo, leather jacket, yellow\nLeather hat, mack it real mellow\nNew York state of mind, crime Othello\nWild zoo of bitches, burrow that's Staten\nYo we actin, Wud up we do that crack thing captain\nStill camaflouge jackets\nMad rackets\nOut yo we cap shit, picture that nigga mashin\n\n[Hook]\n\n[Verse 3]\nYo,aiyo blowin more reason\nFor a season, wud up shortie jaw season\nBaltimore hall bleeding\nTake money, remember that ?dun gottori? son\nDripped out in Bahamas all bummy\nGain you out patriot\nPortrait of my love mad shit\nNow we with things, the long gray shit\nLuke bitches in Barook\nCute big, fat bitches with Luke\nLex you need boots that switches\nFlights over Iraq\nIroning my hat out, and 'lax\nConnecting with diplomat cats\nHarlem hustle connect, Iceberg varsity check\nRimmin well ice drool off my dick\nAbe Lincoln president suites, lay eventually\nPinch me, I bought head from Monica Lewinsky\nArrest that hoodlum\nStrong arm that the white gooden\nFaggot nigga frontin, knew he wouldn't\nFlexible impact rhymin professional\nWe staked out eatin all side vegetables\nProsperity rhymes, lines\nCasians and Asians\nLet's blaze niggas with the shine\n\n[Hook]\n\n[Outro: Raekwon]\nYeah word up, that's right ha ha\nYa'll be loving my shit, yea all the real niggas\nStand up, hey yo let me speak, let me speak\nYo this a new year right here\nIt's the 2 with the 3 zeros, hear me?\nIt's gonna get technical for real\nLet's play the game right\nIt's jus a friendly game of baseball\nHa feel me? Hey yo Santanna, yo\nBring that suitcase in here kid\nLet's count that, where it came from?\nWhere it came from? Rollin' like ten at a time...", "image": "https://images.genius.com/d8508796401925d32124cc47a45641d8.500x500x1.jpg"}], "artist": "Raekwon"}