{"songs": [{"title": "Jerry’s Record Store", "album": null, "year": "2011-12-22", "lyrics": "In your old man voice\nYeah, a one two, a one two\nFour one two, four one two\nFour one two, four one two\nFour one two, four one two\nUh uh nothin' but rhymes its quite simple\n\nHey its what I create to eliminate the hate\nIlluminate the night in the lightning\nUfo sightings leave em unidentified\nSteady I be getting high\nYou ain't got no herbal Im'a lend you mine\nIts Doctor Octogon call him young phenomenon\nI leave these rappers starving like its Ramadan\nYou are the wackest my style holographic\nHad to put my city on the map shit\nIf you a fat kid go get active\nIf you a bad bitch then be a actress\nRap ease carnage, my family ain't the partridge\nWhore tricks flawless like trapeze artists\nTake my life and put it in a photo album\nHow much money do I got? I don't know who's countin'\nFake mouthafucka's round me I could do without them\nYou keepin' it a hundred I could use a thousand\nIm comin' now, call a truce\nI got a lot, but not to lose\nI'm the shit makin hits call me Doctor Luke\nAnd prescribing you a vibe for that awful mood\nWhy you sad all the time?\nJump off a roof\nWhile I'm kicking it with Q-tip and Posdnous\nTryna put me down well that's futile woo shell\nSupernatural message got you spooked out\nBelieve in God but don't believe religion\nSaying its the truth but never really listened\nThats another conversation though\nWalking on the pavement home, find a way to go\nMaybe one not taken, word to Robert Frost\nBlowin' out steam but its all exhaust\nWe comin' for your dollars better call the cops\nYou want a war? We got a nuclear holocaust\nYo E how many bars is that?\nIs it enough to give these haters all heart attacks?\nI been writin on the paper\nGave me carpal tunnel\nCouple billion people are they all gon' love you?\nHell no, hell no\nI be grindin' though rain sleet hail snow\nSticking to my word like its Velcro\nOn some shell toes\nWhat else yo\nDope shit, go crazy\nKinda like the Internet over Hov's baby\nMy girl tell me \"Mac you a weirdo\"\nI guarantee that baby be a super hero\nThis ain't nothin but some rhymes from my mind\nThat been stuck inside since the\nBeginning of time\nChemical romance, slow dance with no pants\nIf I got my eyes on her, player, you got no chance\nThis some simple shit I'm sure they feel\nI'm just trying to explore whats real\nChild of the blues, never liked school\nBeen miseducated so word to Lauryn Hill\nMusic is my outlet walking through the Polo store\nIn the studio wondering what I go home for\nIn my own world when I close the door\nTo the booth, young and searching for the truth\nLike that, like that, like that...\n\nAnd a little bit of this and a little bit of that\nI just spit a rhyme tell me that I kick a rap\nDamn, if you got some time, you can sit down\nListen to me now, pass the flow around\nHey, this some cypher shit\nI know you like that shit\nFreestylin' in the air, go and write that shit\nI don't write that bitch, I got ill flows\nYeah, I'm ill, yo\nAnd this is real, yo\nMac Miller gon' kill those\nFlows\nBouncing up and down, yo-yos\nHead to your toes\nIn the... in the paint throwing balls\nYeah, throwing balls in the paint\nThat's what basketball players do\nI don't think anyone was gonna listen this for\nBut we should keep it in\nBee-yatch!", "image": "https://images.genius.com/13049a8f8bcdeb79473abbceee730e50.375x375x1.jpg"}], "artist": "Mac Miller"}