{"songs": [{"title": "Murdergram (live at Rapmania)", "album": null, "year": null, "lyrics": "Aiyyo don't go near the speakers\n\n[LL Cool J]\nThe big showdown the display is skill\nI'm the type of Picasso witcha girl on the pill\nTake a family snap shot kiss ya wife\nCause I'm like a knife, the concrete is right\nAnd I'll take ya life and take ya like python\nI'ma do you wrong\nAny emcee who you wanna name?\nI want pain that I can be tamed\nTalkin about guns punk it don't alarm me\nGot enough cash to make a whole damn army\nI can't hold back the way that I feel\nCause when I bust a rhyme it's like ya slippin off banana peels\nYa like fruit cake ya fruit cocktails\nFirst your title now I'm takin your female\nAll of a sudden you're so proud of a black\nA baseball hat but you ain't sayin jack\nThe ripper is back and you can't escape\nCause one of my records will sell more than your whole tape\nI want beef so bring on the rookies\nI got more than just Cool J cookies\nRip Rock, crush, stop, cop, I'm poison come and take a drop\nI bet ya teeth will end up around the corner kid\nDon't ask me why I did it\nI'm civilized damage to a nobody\nAnd I'm carrying a gun if I'm rhyming at the party\nNew York, Chicago, Detroit, LA\nI'll slay wherever ya play\nD.C. or Philly, or Baltimore\nI'm worrying the rich, invading the poor\nPerpetrating in your video, here's the real smoothing\nCountry accents, who do you think you're foolin?\nI play \"crushable\", \"late night craps\"\nYou only knew cause ya onto your raps\nAnd rap city and V.E.T\nThe channel 31 and but now here I come\nTo save the day and the now you're getting done\nLike a hooker, don't try to soul, crumb\nThe first sign of the battle you little fake\nIt's (???) comin out ya kitchen sink\nYour Mic's a baby bottle son\nSome say they ain't but I am the one\nThe slice is that the fire boy it'll break ya\nServin or heard em a word occurred to him\nThen he could move a would get moved on\nLike a shotgun blast big mouth emcees I'll bet ya none last\nCause they ain't sable or able\nAnd I bruise the party like jumper cables\nSo plug me in and put me on\nI'm serial hard so I can battle amore\nFrom coast to coast fly, cripple, and crazy\nUse a dictionary but you still don't phase me\nListen ansd we can sound cheap\nReach out for my blackness but your records ain't wack this\nYour bitin on the castle door but when you fall in the moat\nI won't see ya no more\nLet's get together and diss LL\nUse his name and ya records might sell\nI can't believe you found a dead maggots\nCrawlin all over my name I won't have that\nYou better look in the mirror and re-think your plan\nWhy walk in quicksand?\nWhen you can stand on your own two feet\nI'm rippin emcees a funky drum with a big beat\nName the date and a or Rainer\nYa three year old ballerina\nI can't believe the suckers try to throw-down\nWhether you're new or older than old town\nJust kick back I don't like a ?stagger wagger? psycho rap\nYou can't handle the format\nWhether you're swab or swoon\nRuff or rugged all I need is a broom\nIf I slay the way they slay, punk play the pay\nMr. Morris has entered the buffet\nSome of y'all are sittin in rows\nPlates of hot butter rolls, beat ya with balamey\nSlap ya with salami cause when I get hot I get hot like pastrami\nThen I make ya wonder why you don't hear bass\nBut you feel the thunder\nYou get cooked I'll knock out your tooth\nWe'll be fighting from lobby to the roof\nYou are on me like I wrote your dinnertime\nYo Marley (Whassup?) spill the time\n(Nah man, just kick a little warmth)\nPass the brass knuckles then we break his jaw\nWhen I'm on the microphone I want silence\nLet KRS-One stop the violence\nAin't no rivals ain't no competition\nPunk, I'm beatin ya into submission\nI'm gettin busier than ever before\nNever more will I'll slack I'ma keep it real raw\nEat ya up like a pack-jam\nVideo is poppin over a Batman\nRippin you to shreds, tappin you on the head\nThen leave the battle lookin as happy as a newly wed\nGive me a tech-nine to spray\nSave the peep and put it on law-away\nI'll make a mailman spin and send a jam the fans will understand\nFeel ya weep about the murdergram", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}