{"songs": [{"title": "God Bless Amerika", "album": "I Am Not a Human Being II", "year": "2013-03-22", "lyrics": "[Verse 1]\nUh, my mind’s filled with mine fields\nThe ashes fall, the wine spills\nThe world stops, drops and rolls\nIt’s Judgment Day or a fire drill\nYea, I pour out my heart, have a drink\nThey say the drunk never lie, they ain’t never lyin' yea\nMy country 'tis of thee\nSweet land of kill em all and let em die\n\n[Hook]\nGod bless Amerika\nThis ole' godless Amerika\nI heard tomorrow ain’t promised today\nThe end of time is like a hour away\n\n[Verse 2]\nDamn, military minded, lost and can’t find it\nThe stars on the flag are never shining\nUh, I saw a butterfly in hell today\nWill I die or go to jail today?\nCause I live by the sword and die by the sword\nHeard police was lookin' for me, I’mma hide by a broad\nShootin' stars in my pocket; bitch, sit on my rocket\nI’m wired out the socket, but still shocking\nEverybody wanna tell me what I need\nYou can play a role in my life but not the lead\nIf there’s food for thought then I’m guilty of greed\nMama said take what you want – I took heed yea\nNow let it breathe, yea\n\n[Verse 3]\nBack to life, back to reality\nBeen eating my girl and she’s so sweet, got cavities\nGranted we do it for vanity not humanity\nBut what’s appealing to me is under banana trees, love\nI go so hard, I tried to pay homage but I was overcharged\nAin’t that a bitch? I’m just a nut tryna bust a nut, in a nut shell\nUsed to say fuck the police, now I say fuck jail\nSame shit, different air freshener\nI don’t play, boy, I ain’t Hugh Hefner\nTryna be a step ahead, but a few feet behind\nTwo fingers to my head, pop! Peace of mind\nI be in the cloud, cloud number 9\nAnd I just fucked the clock and let it come to time\nIt’s a cold world, I put on a mink\nThere’s a chain of command, I’m the missing link\n\n[Hook]\nGod bless Amerika\nThis ole' godless Amerika\nI heard tomorrow ain’t promised today\nAnd I’m smoking on them flowers, catch the bouquet\n\n[Outro]\nHere we live by the sword and die by the sword\nHeard police was lookin' for me, I’mma hide by a broad\nShootin' stars in my pocket; bitch, sit on my rocket\nI’m wired out the socket, but still shockin'\nEverybody wanna tell me what I need\nYou can play a role in my life but not the lead\nI saw a butterfly in hell today\nWill I die or go to jail today?", "image": "https://images.genius.com/025852747d34bfec09080ad4c10b07b6.1000x1000x1.jpg"}], "artist": "Lil Wayne"}