{"songs": [{"title": "Westside, Right on Time", "album": null, "year": "2012-08-17", "lyrics": "[Intro: The Sylvers & Kendrick Lamar]\nPillars of joy can be found\nThrough the thought of you\nI'll be troubled and bustled and scorned for your love\nCanei Finch on the beat\nTurn the headphones up, Ali\nHere we go\n\n[Verse 1: Kendrick Lamar]\nI woke up this morning with my dick on hard\nDidn't know why 'til I said fuck all y'all\nOr fuck this world, or I'mma fuck that girl\nGood kid, m.A.A.d city, watch my day unfurl\nI put my life in these sentences\nFucking right, it's either that or life sentences\nI'm relatives with Benjamin\nI used to give a fuck about my luck when I was innocent\nNow what the fuck is up? I'm at your neck like a Pendleton\nNigga, I need that, bitch, I need that\nTwenty-four acres and a mule, best believe that\nThey say he got smoke, like where the weed at?\nAnd everything you hope, bitch nigga, we that\nPockets on Kelly Price back when it was '95\nBuy a strap and then we cock it back when it's uncircumcised\nWrite a rap on how we just react when shotty hit the spine\nGive you dap and then we slide through your hood three dozen times\nSo what's good? I'm looking for a pedicure\nPink pussy that pop, preferably the kind that don't stink\nBomb-ass head 'til she can't blink\nAnd her eyes get watery, you gotta pardon me\n\n[Hook 1: Kendrick Lamar]\nI'm so damn turnt\nWheeling in a two-door with two hoes that follow me\nAnd you know, Westside, right on time, tell 'em hoes kudos\nEastside, right on time, they don't fuck with you though\nWhen my hood getting to the money, the pedal never broke\nCame a long way from the ghetto, dog, but\nWestside, right on time, only thing fosho\nEastside, right on time, gunning through your door\n\n[Verse 2: Young Jeezy]\nI woke up this morning like fuck the world\nBeen hustling since I was twelve, man, I've been through hell\nNow these motherfuckers is trying to tell me I don't care\nTrying to tell y'all motherfuckers, look, y'all wasn't there\nTurnt, posted up on the block, waiting for mail\nFrom my niggas posted up in the county, praying for bail\nCould've cost your boy everything, man, it wasn't cheap\nComing for a nigga, just don't sleep, shit for the weak\nGot on my Malcolm X frames, now I count the check, mane\n'Cause every time I speak, you hear my Malcolm X pain\nNow them doors go up on that Lamb, they like judo\nYoung, you like your bitches with ass? I like you, hoe!\nFirst, them bitches see me, I'm gone, I'm like Pluto\nPlus, I keep them choppers that sing, they Mars Bruno\nBrown bag full of cash, baby, MCM\nWhen they ask me my name, I tell 'em MC him, straight up\n\n[Hook 2: Kendrick Lamar]\nI'm so turnt\nWheeling in a two-door with two hoes that follow me\nAnd you know, Westside, right on time, tell 'em hoes kudos\nEastside, right on time, they don't fuck with you though\nWhen my hood getting to the money, the pedal never broke\nCame a long way from the ghetto, dog, but\nWestside, right on time, only thing fosho\nEastside, right on time, gunning through your door\n\n[Bridge: Kendrick Lamar]\nAll praise go to the most high\nAll fades turn into a drive-by\nPart ways from the streets, after fucking with police guaranteed\nLast nigga did that died, don't you, don't you, don't you\nWanna live where the AK go for only 8K\nMinus six racks, minus one on top of that?\nMelee, stomp him out then drug him out like a date rape\nDaytonas bending every corner while they say\n\n[Hook 2: Kendrick Lamar]\nI'm so turnt\nWheeling in a two-door with two hoes that follow me\nAnd you know, Westside, right on time, tell 'em hoes kudos\nEastside, right on time, they don't fuck with you though\nWhen my hood getting to the money, the pedal never broke\nCame a long way from the ghetto, dog, but\nWestside, right on time, only thing fosho\nEastside, right on time, gunning through your door\n\n[Verse 3: Kendrick Lamar]\nAll I ever wanted was a dollar bill and hundreds\nAnd my teacher as my woman, when she smiled, I stick my tongue in\nPlus some cartoons and some cereal, Snoop Doggy on my stereo\nSome British Knights or LA Gears with glowing lights or Perry Ellis jacket\nI would love a swapmeet full of Chevrolets in candy paint\nThat's wet with Tammy on the bumper, can I hump her? Poppa tell me yes\nA DPGC concert and a DJ Quik song on cassette\nTwenty years later: hi hater, I'm the fucking best\n\n[Hook 2: Kendrick Lamar]\nI'm so turnt\nWheeling in a two-door with two hoes that follow me\nAnd you know, Westside, right on time, tell 'em hoes kudos\nEastside, right on time, they don't fuck with you though\nWhen my hood getting to the money, the pedal never broke\nCame a long way from the ghetto, dog, but\nWestside, right on time, only thing fosho\nEastside, right on time, gunning through your door", "image": "https://images.genius.com/0950807520a893a01c4af37485cfd9b3.500x500x1.jpg"}], "artist": "Kendrick Lamar"}