{"songs": [{"title": "What You Smokin On", "album": "1.21 Gigawatts: Back To the First Time", "year": null, "lyrics": "What you smokin on nigga, what you smokin on?\nWhat you smokin on bitch, what you smokin on?\nI get so.......high\nAnd fall off in the sky?\n\n[Ludacris]\nI've fallen and I can't get up\nSomebody wake me up!\nSo high that my eyelids low, feeling like\nI'm in a coma - better shake me up\nWhat you wanna do Luda? Shit, roll up\nMight as well. AK-47 to the head\nAnd we ain't dead, we just high as hell\nYou may know about this weed, grass, marijuana\nCannabis, sativa. You may call it cheeba\nMaybe reefer, Wiz Khalifa\nSmoking on White Moonshine or that Anthrax or that Blue Dream\nSpray a little cologne and my clothes smelling like\nVersace Blue Jeans\nY'all smoking that huff weed, that dirt shit\nThat ragamuff, I'm smoking on that home grown\nI pass out cause I done had enough!\nOr that Sour Diesel, that Northern Lights and that killer Cali\nYou see me out up in Oahu, Honolulu, smoking that Maui Wowie\n\n[Hook]\n\nDon't fret, y'all niggas need a better connect\nYou need to get your status up\nY'all smoke that stress, we smoke that shit\nThat won the Cannabis Cup\nNow I'm higher than a satellite\nEating everything like a parasite\nNow we in the streets looking for the baddest dyke\nTo run a midnight train train like Gladys Knight\nI'm higher than the prices of petrol\nHigher than the balloon after you let go\nCause I'm smoking that loud in a middle of a crowd\nAnd the loud is really louder than techno\nI got my weed card on the way to the store to get medicinal marijuana\nLuda! Study more Buddha than the Dalai Lama\nGrand Daddy Purp, Bubble Gum or the OG kush\nWhite Widow or the G-13, that Irene got your homies shook\nBut that Jack Herer and the Headband got my homies wild\nAnd the Blueberry Yum Yum's that Fire!!\n\n[Hook]\n\n[Wiz Khalifa]\nSmokin' on something grown at home\nSunken, blowin O's\nNigga I'm from PGH but all my weed from Californ'\nCan't find the remote control: that's how you know I'm stoned\nAll you do is call me, I got all the weed, the papers, bongs\nBrownies, trippy sticks and vaporizers, we could smoke a bowl\nAll these niggas smoking weed around me: it's a smoke-a-thon\nCrowded and my whip is partly cloudy cause we smokin' strong\nYou say you can smoke them joints; Probably cause you rolled it wrong\nMy dollar's up, I'm getting em and I'm folding it\nI'm lighting em, I'm hitting em, I'm not holding it\nI'm passing em straight to Ludacris and he's smoking it\nSecurity and a nigga that own the bitch askin'", "image": "https://images.genius.com/5482bdd9a892ee8a85e236881855cbce.320x320x1.jpg"}], "artist": "Ludacris"}