{"songs": [{"title": "Clap Those Thangs", "album": "G-Unit Radio Part 4 - No Peace Talks! ", "year": null, "lyrics": "[Havoc talking]\nYeah we stop fuckin with theses niggas\nIt's real... it's real... yo\n\n[Verse 1: Havoc]\nThis money done got a nigga like me in trouble\nI made it niggas hated leave me dead they beloved to\nMommy before I walked up out that door I should've hugged you\nWho's my real friends seems I'm livin in a bubble\nFor cryin like a bitch nigga get your fuckin firearm\nGot me blowin hollow tips right at your Teflon\nNigga stick and move if you ain't gettin stepped on\nNo heat? That's like a cop without his vest on\nWe buggin constantly thuggin we ain't showin no lovin\nIce griller than sluggin face the repercussion\nNiggas stomach is touchin it's real not for nothin\nKeep fakin and frontin you know it's gonna be somethin\nThey say you live and you learn niggas never will learn\nBurn heavily burn when streets and music merge\nNiggas comin at me sideways\nNigga get your hammer and let's do this the right way for real\n\n[Hook: Mobb Deep] + (Havoc)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\n\n[Verse 2: 50 Cent]\nIf you scared nigga get a gun, don't go get a dog\nGot a .44 long to put your ass in a morg\nYou peace talk with your pistol I send niggas to get you\nTen grand to hit you the shells are sure to split you\nPorsche Box Drop...DROP, gun in the stash... BOX\nGet your bitch ass... SHOT, standin around here\nThe flow so... HOT, they say I got it... LOCKED\nHold on a second homey let's get this clear\nThe wrist stay... ROCKED, the ruger stay... COCKED\nI hope you smoke a lot cuz I supply a weed... SPOT\nNow I got a question and I need the answer on the spot\nThat bitch you with she like you or she like what you got\nIt's 50 Cent and M-O-B-B breath easy\nWe ain't finna kill nothin we just chillin nigga\nBut look dog don't go actin loco\nYou in Queens you a long way from Kansas?\n\n[Hook: Mobb Deep] + (Havoc)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(yo, you scared get it dog, you gully get a gun)\nYou know we pop those things\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\n\n[Verse 3: Prodigy]\nAy yo\nWhy dudes walk around with those on the hip\nThe pocket or the box nigga wherever they fit\nYou know we done been through the worst of the shit\nAll we know is how to survive y'all niggas eat a dick\nEat it quick eat your food through the I.V fuckin with P\nNeed a plastic bag attachment to shit?\nY'all make us so real ice grill faces before them guns popped out\nNow you look like you seen death\nYou ain't ready for murder don't play with these kids\nUpgrade to a set of wings fuckin with my clique\nBasically be a cold case fav real quick\nPeople that enjoy life they don't come to our set place your bets\nYour favorite rap is sex I swell up niggas heads\nFrail niggas is dead better get your weight up yeah\nYou heard what we said bird niggas ain't deaf\nFuck y'all wanna do about it huh? Straight up\n\n[Hook: Mobb Deep] + (Havoc)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)\nYou know we pop those thangs\n(Yo, you scared get it dog, you gully get a gun)", "image": "https://images.genius.com/041db5821ceda2a49e6c2974e2273923.500x500x1.jpg"}], "artist": "Mobb Deep"}