{"songs": [{"title": "X-Bitches", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17", "lyrics": "[Intro]\nDamn, what you doing over here?\nWassup?\nYeah I was thinking about you the other day\nAnd I was thinking I should have never fucked wit' your ass\nI should have left you right where I found you\nMy bad (echo)\n\n[Verse 1]\nWhen I was wit you all you ever do was bitch\nTalk shit, but you could suck dick\nSo I didn't sweat all the fussin' and cussin'\nOn New Year's Eve, the night I was bussin'(wow)\nI would stress and strain to mantain\nAnd didn't need to hear your motherfuckin ass complain\nAbout niggas in the house (mm), feet on the couch\nTalkin' all loud (yeah), blunt in my mouth (yeah)\nBitch I got fifty cents on this genesis\nTalkin' 'bout niggas got to vacate the premises\n(She ??) Homie history\nAn' outa nowhere your ass got heart\nPoured out the pub, then you got drugged\nWe at it again, I tried to count to ten\nThere's no end to your naggin'\nYou can't treat me like I'm faggin', ho\nYou see I'm saggin' (no)\nWhy I gotta act like a motherfucking asshole (why)\nTo be king of my motherfucking castle\nYou'll never be the missus (never)\nBreakin' all my dishes\nAnd fuck all my X-bitches\n\n[Chorus]\nFuck you, fuck you and fuck you\nThe world ain't yours, the world ain't yours\nFuck you, fuck you and fuck you\nThe world ain't yours, the world ain't yours\n\n[Verse 2]\nOn an' off, off an' on, bitch I'm grown\nSo stop playing on my phone (stop)\nIt was a time we used to bump and grind\nAnd find heaven (ahh)\nWithout a motherfucking reverend\nManage troiges and bomb-ass massages\nAnd dreams of three-car garages\nYou say I'm cheating when I'm up at the studio\nCome to find out you the ho, oh\nAnd you was way out\nTalkin' 'bout rap, was gonna play ya\nAnd I was wasting my time writing rhyme (hahaha)\nYou made yourself loud and clear\nYou wanted me to choose between you and my career (bitch)\nStarted fucking with this baller named Chris\nCouldn't resist the Rolex on his wrist\nI kept on writing my raps with profanity\nNow I'm on tour fucking bitches like vanity\nYou tried to diss this, now you miss this\nAnd the first and fifteenth is like Christmas\nSend me naked pictures but give it a rest\nWith Mrs Ice Cube tatood on your breast\nNow you at the back door of my show\nDressed like a ho, aksin' could you blow (no)\nHell no but it's still delicious\nWent from rags to riches\nAnd fuck all my X-bitches\n\n[Chorus]\nFuck you, fuck you, especially you\nThe world ain't yours, the world ain't yours\nFuck you, fuck you, especially you\nThe world ain't yours, the world ain't yours\n\n[Verse 3]\nNow I hear you sayin' \"Yeah I used to fuck 'im\"\nNot lettin' 'em know I was a young buck then\nNiggas aksin' me \"Man, did you love her?\"\nLoved her stupid ass enough to fuck her with a rubber (bitch)\nNow I hear, I'm your big brother (who?)\nSecond cousin, friend\nBitch since when?\nIncest ain't the way I swing (nah)\nNever bought your ass a goddamn thing\nThat I had to pay for\nI was hateful\nUngrateful (uh) and never faithful\nFuckin' everything that I could get my paws on\nWalkin' through hell with gasoline draws on\nNow I'm on the mic, music is my life\nKids and a wife, heard you was a dyke (damn)\nIt's your thing if you like the switches\nBut it's my world and fuck all my X-bitches\n\n[Chorus]\nFuck you, fuck you and fuck you\nThe world ain't yours, the world ain't yours\nFuck you, fuck you, especially you\nThe world ain't yours, the world ain't yours\n\n[Outro]\nNever go down the same road twice\nAdvice from the big homie Ice Cube\nHmm, girl you better get away from here\nI don't want that shit no more\nNa,na ahem, and don't be callin' at my mama' house neither\nI'm through wit' you. I'm through wit' you\nI done got smarter. I done got smarter\nI ain't fuckin' wit' your daughter", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg"}], "artist": "Ice Cube"}