{"songs": [{"title": "Heavy Artillery", "album": "The R.E.D. Album", "year": "2011-08-19", "lyrics": "[Intro: Rick Ross & Sample]\nYou know we got 'em\n45s, machine guns, and heavy artillery\nWe got those grenades on your ass, nigga\nHa ha, Boss... Black Wall Street\nI'm in that bulletproof Maybach nigga\nTeflon Don, SK's\n\n[Verse 1: Rick Ross]\nNigga talking like a G, but walking like a broad\nI pull up at the light, pineapple in your car\nNigga I shatter lives, my music camouflage\nMy court killers at the center of my synagogue\nTorture and extortion 'til I'm Fortune 500\nFrom the porches to the Porsches with the wides on it\n'fore you snitches bitch, you better put your lives on it\nGet your twisted body found with them wires on it\nI get my money, smoke extensive like it's Friday\nI'm sitting sideways like I'm in my driveway\nMy shit pancakes, my shit 3 wheels\nYou niggas six feet, we getting 3 meals\n\n[Hook]\nThey got jumped\n45s, machine guns, and heavy artillery\nThey got jumped\n45s, machine guns, and heavy artillery\n\n[Interlude: Game]\nYeah I got 2 gun charges, 2 felonies, just got off probation\n\n[Verse 2: Game]\nToday motherfucker, won't budge for no judge\nReal nigga, I hold no grudge with no thugs\nCome through spraying, bullets out the McLaren\nThey ain't meant for you, move bitch, you hard of hearing?\nI speed off doing 90 with Tha Carter blaring\nBust shots in the Cavalier like I ball with Baron\nYeah I Blake Griff niggas, make stiff niggas\nEminem wasn't Dr. Dre's only sick nigga\nInsane in the membrane like Soul Assassins\n12 gauge stop a nigga heart like a bowl of Aspirin\nI hold automatics, let your man hold the casket\nMurder game cold as Aspen, body found in the trash bin\nFirst 48, they don't find me, case closed\nLike a rehabilitation spot in Bobby Brown nose\nTake 'em back to Boyz in da Hood when I pull the pump out\nSomething like C-Murder on Worldstar when I dump out, what!\n\n[Hook]\nThey got jumped\n45s, machine guns, and heavy artillery\nThey got jumped\n45s, machine guns, and heavy artillery\n\n[Verse 3: Beanie Sigel]\nUh, ain't nothing changed but them bullets in my clip\nI still'll pull it, still'll bully niggas on the strip (still)\nBeef, I cook it fully with the fifth\nAnd I ain't got no pets, I put a bullet in your bitch (ill)\nNigga with a gun in his hand, and won't bust it\nIs like a, bitch with a dick in her hand, and won't suck it\nThis is the art of war, you niggas just drawing\nAnything I target on is dearly departed, gone (gone)\nDrive by or walk up on -- (walk up on)\nI just stop, breathe, aim, cock, squeeze (squeeze)\nSilencer on the Glock, infrared beam\nPut your block up on machines while the pussies run and scream\n\n[Hook]\nThey got jumped\n45s, machine guns, and heavy artillery\nThey got jumped\n45s, machine guns, and heavy artillery\n\n[Outro: Beanie Sigel]\nYeah nigga, the real one in the building\nBroad Street Bully, certified G for real\nLil' rap niggas fucks me up\nY'all niggas ain't tough claiming y'all gangsta, nigga\nGame recognize game for real, what up Blood?\nThese niggas fucks me up niggas\nMy gangsta ain't never on trial\nNiggas talk that shit, nigga what's your PP number nigga?\nYou niggas rat in the back of the cop car before you get to the station\nYou pussies ain't gangsta\nYou niggas wouldn't kill nothing, let nothing die\nShoutout to all the real niggas\nBoss, what up Boss? Ricky Ross in the building", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg"}], "artist": "The Game"}