{"songs": [{"title": "Gettin’ Money Freestyle", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "Intro:\nPlease be clear. This is a fuckin' invasion. Royce Da 5'9\"\n\nVerse One:\nI'm gettin' money like a motherfucka\nI do the dollar like the Yao stretch\nCasino chips that Denale bet\nAin't spazzin' at the house party\nMink draggin'/dragon like Bilal breath\nDead prez ran a train on the green lady\nThat green lady turned around and had a dream baby\nThat dream baby was I\nThat green lady was ma\nFollow me honey, it sound funny\nI'm money\nGet it?\nNiggas is idiots so probably not\nI Murder Inc., let Ashanti & Irv Gotti watch\nA walkin' mollie wop\nTell your whole fellat to cock off\nDrop the jeans\nAnd pull out a foot like when you take a sock off\nI ain't attached to no tooley\nI'm quite screwy\nI just take the Lock off\nPop it and Drop It like Huey\nWeed avenue, bread rollin' on Phillie Street\nTriggers get used more than Wayne +A Milli+ beat\nSo don't make me laugh\nYou think with your class\nI think with my math\nNot with my dick, I speak on his behalf\nAnyone of you motherfuckin' NASCAR tunnel crews\nI call you that, cause you fixin' to crash\nThe word in the hood is I got the bag in the streets\nPull the rig up\nTake a load off, like I'm havin' a seat\nThis black coup is V-12 as far as year\nI'm been rappin', reppin' the D-12, ask Proof\nAs far as tears\nMy face ain't big enough to relate\nHow many bodies gone in the form of a tattoo\nAlcoholic, my kidney color is black blue\nForever fuck with that Remy, love it like Papoose\nWearin' that XXL mag or in The Source\nBeing the King of the magazines and in a Porsche\nMy release date is more important to the country than\nTunin' into your news stations November 4th (Obama!)\nI turn niggas into veggies and get my lettuce straight\nIt's like you niggas addicted to bitch shit, you fetish fake\nDahlmer\nPop you, then eat you on the anniversary of your death\nLike the top of a wedding cake\nTwo timer\nYeah, I keep a bitch on the side\nI'm Mr. Warn-a-guy\nYou Mr. Wanna Die\nThe Bar Exam 2 comma\nMore polished than\nRay Robinson in his prime\nThe shoe shiner\nHe kill 'em with his persistence\nSendin' niggas to hit 'em is a silly mission\nLike he's one of Diddy's assistants\nLook in my trunk and find a pair of legs inside of some gym shoes\nHangin' out a trash bag and in fumes\nI spit whole winters and then June\nShow up to your video while you performin'\nAnd shoot you like Ben Boom\nYou might have dealt with the tools\nBut you ain't swam with them sharks\nNickel Mike Phelps in the pool\nYou might pull triggers but you don't pull them like me\nBullets runnin' through shit like the bullets got feet\nI'm gonna keep goin' and goin' like a Energizer\nInside a flyin' bullet until the day a bullet stops me\nFuck a bitch, I'm it nigga, I'm a don\nI'm a reaper, I'm Cancer, like I'm a sign\nImmaculately conceived\nProduct of dollar signs\nThe only father of mines\nIs Father Time\n\nChorus:\nI'm gettin' money like a motherfucker\nYou ain't got nothin' on me\nI'm gettin' money like a motherfucker\nFuck this auto tune shit\nThat shit sound weak as a bitch\nUnless it's me usin' it\nCause I'm the shit fool", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}