{"songs": [{"title": "Foreword", "album": "Flower Boy", "year": "2017-07-21", "lyrics": "[Intro]\nBitch, fuck! (Uh, uh, fuck)\nYou have a question?\n\n[Verse 1: Tyler, The Creator]\nHow many cars can I buy 'til I run out of drive?\nHow much drive can I have until I run out of road?\nHow much road can they pave until I run out of land?\nHow much land can there be until I run in the ocean?\nNiggas go with the motions and all the plans\nSee, I was never into the beaches and all the sands\nSee, I was in the woods with flowers, rainbows and posies\nFalling outta my pocket, but ya'll want to know if I swam to cool down\nHow much cooler can I get until I run out of fans?\nHow many fans can I have until they turn on the AC?\nIf the AC blows, well then I'm TNT, I'm gone\n\n[Bridge: Rex Orange County]\nI'm gone and I'm finished\nAnd I ain't seen my friends in a minute\nGuessing nothing lasts forever\nYeah, nothing lasts forever\nNothing sticks together\nSick of sitting in doubt\nPlease let me figure this out\n\n[Verse 2: Tyler, The Creator]\nShout out to the girls that I lead on\nFor occasional head and always keepin' my bed warm\nAnd trying their hardest to keep my head on straight\nAnd keepin' me up enough 'til I had thought I was airborne\nHow many raps can I write 'til I get me a chain?\nHow many chains can I wear 'til I'm considered a slave?\nHow many slaves can it be 'til Nat Turner arise?\nHow many riots can it be until them Black lives matter?\nNiggas click clack splatter, (Pew) pew that nigga\nLife a game of basketball, you better shoot that nigga\n'Cause if that cop got trigger, he better pull\n'Cause when I get pulled over, I usually play it cool\n'Cause I know what I'm drivin' is usually paid in full\nAnd my ego and possessions, will not let me be one (Nah)\nBecause I got a mansion, my mansion got some rooms\nThem rooms got some windows and my windows got some views\nThem views get some stares and my backyard does too\nAnd if you walk to the bottom you'll prolly see a pool\nYou better not drown, keep them ten toes up\n'Cause if them ten toes down, that mean that you fucked up\nAnd that's what I swim in\n\n[Outro: Rex Orange County]\nAnd if I drown and don't come back\nWho's gonna know? (Maybe then I'll know)\nAnd if I crash and don't come back\nWho's gonna know? (Maybe then I'll know)\nAnd if I fall and don't come back\nWho's gonna know? (Maybe then I'll know)\nI'm wondering if I don't come back\nMaybe then I'll know", "image": "https://images.genius.com/7d663e082dec87ff1a6a096bb6e6ab65.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}