{"songs": [{"title": "Questions (Rough Draft)", "album": "The Calm Before the Storm: Part 1", "year": "1997-10-07", "lyrics": "[Intro: Don Juan & Tech N9ne]\nThe name of this motherfucker is called \"Questions (Rough Draft)\" (Ha ha, tell 'em)\nQD3 did the beat (All day, all night)\nWhat's up to everybody out there in L.A\nWhat's really goin on?\nWhy do I do the things I do?\nWhy so many questions?\nWhat am I doing?\nI talk to myself... when there's no-one to talk to\n\n[Verse 1: Tech N9ne]\nI wanna ask me a question:\nWhen am I gonna make it up out of a hellish and devilish way?\nWhen are you gonna make a mill-ions worth of dividends?\nWhen are you gonna make ends, generate bread?\nWho in the hell left the gate open to you in the cell?\nIs everybody on wavelength like us?\nWhy do I rip it in half? Do we kick ass with backwards\nAttacks ish like hap ut eallavik?\nCan you wait a minute?\nCan you slow it up a little bit N9na so I can get up in it?\nBut did you really wanna dabble in fanatical supernatural\nLyrically radical milli minutes? I'm about to begin it\nCan I get some? Can I spit some? Which one?\nWhen am I gonna get off this trip?\nCan I take another peel? why do I feel\nLike I'm a sick individual in the room, poppin' off at the lip?\nDo you feel me? Do you do voodoo really?\nDid you get it? Did you want a real epidemic?\nWill you let me run up in it?\nWhat's the word? Is it absurd? What is that ish you heard?\nWas it real? Is it real? Was it really real?\nTech N9ne in it to win it besides QD third occurred\nWho's the worst? Who's rastafari?\nYou never livin', never sure it's Selassie, the first\nBrother on the planet Earth, who?\nDo you wanna flow? What you wanna do?\nHow can I be in the zone like this? Gone like this?\nHow can I break the obsession?\nIn the middle of it all, when I snap back, step back\nAnd ask myself; what, why do you ask so many questions?\n\n[Chorus: Tech N9ne]\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\n\n[Verse 2: Tech N9ne]\nDo you understand? What you gonna do when N9na hit you\nWith the critical homicidal lyrical killer flippin'\nLeavin' you with boo-boo underpants?\nHow does it feel?\nDo you wanna come up and chill with an assassin?\nCan you feel it inside, what?\nThe feeling of a commotion of two titans clashing\nWhy me? Who are you? What I am supposed to do?\nWhat a nigga here fo'? Who do you fear mo'?\nIs it the N9ne with a brand new joint?\nLike to hear it, here go\nWhat are you lookin' at?\nWhen am I gonna get a dose of Thorazine?\nCan you give me a little something to ease the pain?\nEase the mayn, who's the mayn?\nTecca N9na with the Rogue Dogs and the Midwest side crew's to blame\nCan I get a little backwards attack ish?\nWhat do you accomplish, ever can't you diss, diss\nPitless bottom of a, in you toss thou nigga ass, Bade Mitch\nHater-playa percent hundred that is Side-West-Mid\nDown ever who off but aggin\nDid you know Tech N9ne hot like a dragon?\nDid you feel it baby? Can you give me a double dose\nOf whatever the feeling I'm gettin' is really pain\nKobain, for anybody want a piece of this, sickness\nIs it a cinch to get with hot?\nWho? When? Where? What? Why?\nI'm at the pinnacle with a killer eye, do I wanna die?\nNo, I just wanna dose of the most inner syringe\nUp in my thigh, bonzai!\n\n[Chorus: Tech N9ne]\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\n\n[Verse 3: Tech N9ne]\nNow do you know what the real is?\nDoes everybody think I'm twisted? Non-realistic\nOr do you think that I'm gifted? I'ma live freer\nCan you help me? Am I lookin' at you?\nCan I be peepin' you from afar? Please, remain calm\nCould you be the reason I'm a bomb\nStraight out of Vietnam, ready to explode on Satan?\nTell me what the problem is, I'm alright where the bottom is\nDo you know what a empty column is?\nAm I your worst nightmare? I feel sick right there\nShould I blow it out? Can I do without? Do I need help?\nAm I living within a pen of demons?\nI'm stressing, can I get a blessing? (from who?)\nThe one who cursed me with all these questions\n\n[Interlude (only on Gang Related soundtrack)]\nSome say I'm psychotic\nBut if I have to label it, it would be \"confusion\"\nIt's like I gotta write shit like this\nTo keep my head from exploding, y'knahmsayin'?\nSo many questions\n\n[Chorus: Tech N9ne]\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace\nWhy?\nDo I wanna stick 'em with another hit up out of abyss?\nWhy?\nAm I the pinnacle when I rip it, I'm a killer menace", "image": "https://images.genius.com/1d4a12a154c6cf30e77857bb018ab602.1000x1000x1.jpg"}], "artist": "Tech N9ne"}