{"songs": [{"title": "Ezell (40 Glocc Killa)", "album": "Gangsta & Soul", "year": "2009-05-14", "lyrics": "[Intro]\nEzell\nShut your mouth\nBum ass nigga still talking\nKeep your mouth shut Ezell\nI hear you now\nPussy ass nigga\n\n[Verse 1: ScHoolBoy Q]\nWord on the street that this nigga still talking\nWhole year later and this nigga start barking\nHowling at the moon, guess he waiting for the get back\nKnows that when I see him, guaranteed I push your shit back\nSay you want beef? Well I'm a give your ass beef\nWhen I see you in the streets, nigga bon appetit\nI don't eat? You know where I be 51st Street\nRight on Figg with the little homie, Hoover Spank 3\nWith my nigga Flossy and my nigga Ricky\nI ain't stopping with this rapping till my niggas scrap free\nThey gave him 42 for shootin niggas out in broad day\nReally with this crippin think I care bout what this fraud say\nOut burnin dina with my nigga El Camino\nJust look to see your lil homie flexin\nHit the freeway cuz your hood a 100 miles away\nExit 51st nigga welcome to the turf\n\n[Hook]\nTone it down my nigga\nCuz I'll be ridin through ya town my nigga\nI be around my nigga\nHoover St yeah you know my stompin grounds my nigga\nYoutubin' ass nigga\nFalse-banging pussy old faggot ass nigga\nSpray ya block with ya own name\nNigga I am no game\nThis nigga must think I'm playin'\n\n[Verse 2: ScHoolBoy Q]\nSee I ain't wanna have to call this nigga out\nMale version Supahead every rapper in his mouth\nYou never gettin bread shoulda chose the next route\nCuz I'm pickin niggas off best believe you receive\nEvery thing I'm sayin at you like an email\nLook into my eyes you can see hell\nWent to jail made bail never gave a detail\nInform ass nigga, you the new rapper Ezell\nMe I be a Figel, Castro, groovy lookin ?\nYou can ask Ace I'm in the hood gettin cash flow\nPotato on the mag, niggas gettin mashed yo\nMessin over all y'all, fuck y'all all broad\nPussy ass nigga, g-strings on with large bras\nNeed to check yo lil homie cuz his ass paused\nIf I whup ya ass it'd probably be a hate crime\nThis the last diss, already killed ya ass the first time\n\n[Hook]\nTone it down, my nigga\n'Cause I'll be ridin through ya town my nigga\nI be around my nigga\nHoover St yeah you know my stompin grounds my nigga\nYoutubin' ass nigga\nFalse-banging pussy old faggot ass nigga\nSpray ya block with ya own name\nNigga I am no game\nThis nigga must think I'm playin'\n\n[Outro: ScHoolBoy Q]\nLook, first and foremost, nigga, you's a bitch, nigga\nHiding out in the IE, nigga\nHolla at me when you in LA, nigga\nNigga holding guns to the camera like the camera gonna shoot back\nNiggas don't put guns on YouTube, nigga\nWhat the fuck's your problem, nigga?\nYou's a faggot, nigga\nYou and that naked-ass nigga oiled up\nTalking 'bout, \"Real niggas knuckle up\"\nNigga, you ain't even scrapped enough, bitch\nYou know where I be at: 51st and Fig\nYou need that, nigga? Get at me one time, nigga\nTop Dawg ENT, getting every dollar I see\nI'm the head nigga of that GED shit, nigga\nYou want Tyga, nigga? You gotta come to me, nigga\nThat's my little brother, nigga\nTalking you wanna fight Wayne, nigga?\nNigga, Wayne all the way in New Orleans\nNigga, the fuck you wanna do with Wayne, nigga?\nLeave Wayne alone, nigga\nCome down to LA with all that bullshit, nigga\nYou ain't killed nothing, you ain't did nothing, nigga\nWhat's your rap sheet, nigga?\nAll you got is a rap sheet, nigga, 'cause you's a bitch, nigga\nSnitch-ass nigga, got your whole hood in a junction now\nNiggas can't even kick it in they hood because of you, nigga\n'Cause you want to spread your motherfucking words on this YouTube shit\nHolding big-ass guns on YouTube like niggas is scared of YouTube or somethin'\nAnd oh yeah, all you faggot-ass niggas that 'bout to comment on this nigga\nGo 'head, drop your comment in the comment box\nFuck you too, nigga, and fuck your momma too\nHatin'-ass nigga\nFuck 40 Glocc, nigga, and his whole squad, nigga\nTop Dawg ENT, ScHoolboy Q said it, nigga\nMeet me in the Fig and the First, nigga", "image": "https://images.genius.com/5be8aea8d73e30772a3a8919cc421f1f.500x500x1.jpg"}], "artist": "ScHoolboy Q"}