{"songs": [{"title": "Free Mumia", "album": "KRS-One", "year": "1995-11-07", "lyrics": "Knowledge, where the people at?\nFree Mumia!\nChannel Live! (KRS-One, come and represent)\n(The wisdom)\nHah hah hah hah hah hahaha!\nFree Mumia!\n\nEverywhere I look there's another house negro\nTalkin about they people and how they should be equal\nThey talkin but the conversation ain't goin nowhere\nYou can't diss hip-hop, so don't you even go there\nC. Delores Tucker, you wanna quote the scripture\nEverytime you hear nigga, listen up sista\n\nVerse One: Hakim, KRS, Tuffy\n\nI met up with this girl named Delores, a prankster\nI said I MC, she said, \"You're a gangster\"\nBut she was caught up, she hit the floor like a breakdance\nWrapped her up like the arms in a b-boy stance\nRecognize moms I'm one of your sons I'm hip-hop\nIn the form of Channel Live and KRS-One\nRepresentin MC's across America\nShe said, \"You're the one who be causin all that mass hysteria\"\n\nWisdom shall come out of the mouths of babes and sucklings\nBut you blinded by cultural ignorance and steady judging\nBut judge not, lest ye may be judged\nFor the judgment ye judge ye shall surely be judged, you gets no love\n\nShe said, \"I like it, that's why I jock it\"\nThen I said, \"You only on my back because I fill brother's pockets\"\nGot em drivin Benzes Jeeps and Rolls Royces\nAttackin me will leave youth with no voices\nThe choice is yours not mine hang with me\nI'll have you freestyle and bombin graffiti\nWe can cut it up like like wax\nClaimin I cause violence but America was violent before rap, FACT\n\nChorus: KRS-One\n\nWarner, Elektra, Atlantic equals WEA\nInstead of fighting them why don't you go free Mumia\n(repeat 2X)\n\nVerse Two: Tuffy, KRS, Hakim\n\nWild recital, I kicks the vital, like The Final Call\nAs I watch, Babylon fall\nI had to Rush Limbaugh, hit that pig with an axe\nTuffy dips to the side, buckin cannons that's phat\nBecause he censors the usage of the metaphor\nYou can get the tip of my dick Gore\nBecause it's you that brings the, real horrorcore\nExpenditures be gettin, cut from the poor\n\nWhy sure! Back before we were born they sold us out\nYeah J. Jackson we know what you about\nYouse a Slave Mason, not a Free Mason\nBefore long the Goddess Tiamat through hip-hop you'll be facin\nDon't start me, cause I be the, lyricist\nAt the nineteen ninety-nine millenium party held at Giza\nSayin he's a, fraud, oh my Goddess\nNever in your life should you disrespect an artist\nInstead, focus your attention on astronomy\nAnd the up and coming, shift in the economy\nIf you can't do that, then heed the final call\nTo free Mumia, Abu-Jamal\n\nHate to be so rough, it could be the White Owls\nHouse niggas are full of crap, like my Colin Powell\nKickin vowels, is how we relieve the tension\nUntil we start to bounce white people like suspension (revolution)\nYou paint the pictures, the black man on the corner\nBut tell me, who blew up Oklahoma?\nThe City, ain't no pity, for the beast\nIt's Hakim that voice from the East\n\nChorus\n\nVerse Three: KRS, Hakim, Tuffy\n\nBuck buck! Buck buck buck!\nIt sound like gunshots but it could be the cluck\nOf a chicken, definition, is what you're missin and\nListen to your children instead of dissin em\nSenator Dole doesn't understand the younger\nLike they be sayin want to, but we be sayin wanna\nThey gettin dumber every summer as they walk the raod\nMaybe because they cannot understand the code\n\nWord, in actuality, this Norman Bates mentality\nAlways seems to represent, minus three-sixty percent\nOr degrees full circle, dead from the purple\nRays of the sun I gots melanin so check it\nBag your nuts quick or get sick from being naked\nSuspect it, was it a means for the end\nFor just a few to drive the Benz while you eat the pigskins\nTurned you into mannequins, cause the trick of technology\nA revelation, revalations\nSensation gives me inspiration of revolution\nThat's my solution, there will be no sequels\nI'm audi hundred forty four thousand with my people\n\nFrom Caligula to Hitler, now it's Schwarzenegger\nA lust for the violence is the science of their behavior\nWho enslaved ya (it's the Devil) but the God of virtuosity\nAnd of the world created, could it be mental sodomy\nGot my mind twisted like the blades of fonta leaf\nI sit in disbelief as he crawls underneath\nThe rock cock back the Glock, cause I don't trust\nThe Devil I rebel until Babylon is dust\n\nChorus", "image": "https://images.genius.com/b481877c320dcb5ceee6bb85a10f3064.300x300x1.jpg"}], "artist": "KRS-One"}