{"songs": [{"title": "MILF", "album": "Hall of Fame (Deluxe)", "year": "2013-08-27", "lyrics": "[Produced by Da Internz]\n\n[Intro: MILF]\nOh! Oh!\nYou are just what the doctor ordered\nOoh, look at there!\nI heard you was a pleaser, and baby - oh shit!\n\n[Hook: Children]\nMan, not my mama; man, not my mama\nMan, not my mama; quit messin with my mama\n\n[Verse 1: Big Sean & MILF]\nI love me some of yo mama, (oh!) true that (true that)\nDon't call me daddy, only she can do that\nOk, me and yo mama be fuckin (yup)\nBoy you don't know nothin' about that\nYou seen her lookin all mad (mad) ain't it time for ya nap?\nYou wake up, I'm back (back) eating up all your snacks (hah)\nDon't ask for help with your math (stupid)\nAin't my fault, you can't add\nDon't be out here fake crying, lying (boi)\nUp in the keyhole straight spying\nOnly knock the door if you're dying\nI wish I could stay in here forever (I love it)\nYou the only reason me and your mama ain't together (lil bitch)\nShe's so much better than my old bitch\nMan, I love that old bitch, I do\nOh! This feels so nice, oh shit!\n\n[Pre-Hook: Big Sean]\nNo stress, no drama\nHer kids hatin, they know I fucked their mama\n\n[Hook: Children & (Big Sean)]\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama, yup)\nQuit messin with my mama\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama)\nQuit messin with my mama\n\n[Verse 2: Big Sean & MILF]\nThe way she bounce both cheekies, boy she freaky (freaky)\nShoulda known she was kinky\nWhen I walked inside the room and I seen her slinky (what the fuck)\nEven made me use my pinky, the way she teach me\nIt's just so dreamy, oh God, damn, man\nI cheat on tests, cheat on hoes, I cheat when I can (I do)\nI'm even cheating on my whip, I got a side Benz (I do)\nBut she made me wanna cut off all my side friends (I love you, baby)\nA nigga be tryna chase her, take her, date rape her\nStand out the daycare sit there and wait there\nFuck, I can't even trust the neighbors, damn\n(What you lookin at?) You niggas stick to your young hoes\nI got a freak that wash, dry, and fold clothes (that's right)\nLil motherfuckers (Yeah, that's right)\nOoh this great, big, enormous motherfucker!\nOh! Just let me, oh! Let me jockey this dick!\n\n[Pre-Hook: Big Sean]\nNo stress, no drama\nHer kids hatin, they know I fucked their mama\n\n[Hook: Children & (Big Sean)]\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama, yup)\nQuit messin with my mama\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama)\nMan not my mama (I love ya mama)\nQuit messin with my mama\n\n[Verse 3: Nicki Minaj]\nI got my welfare check, smokin on that crack\nHell yeah I'm unemployed, baby daddy down my back\nNow what you got for me Sean? I heard it's big and it's long\nI take my teeth out, suck it good, this where your dick belong\nY-Y-Yeeeaah, do it like dat daddy\nPump pump bump bump it in my ass-matic\nYou ain't tell me you was big-boned\n(Mom, I'm hungry) Shut your mouth, you little bastards go on\n(All this ass is for you Seany.. can I call you Seany?)\nSl-Sl-Sl-Sl-Slap me in my face with it, get a crack valve with that bass in it\nIf I got weed then I'm lacing it, eat all this ass, quit tasting it nigga\n\n[Hook: Children]\nMan not my mama, man not my mama\nMan not my mama, quit messin with my mama\nMan not my mama, man not my mama\nMan not my mama; quit messin with my mama\n\n[Verse 4: Juicy J]\nHigh as a motherfucker (trippy)\nFuckin' e'rybody mama...\nI got yo mama all in my line (line), bullets all in my 9 (9)\nRollie tell the time, she ain't yours, she ain't mine\nThrow a hundred every time, I think my coupe just lost its mind (mind)\nPut yo mama on that trippy shit, sippin lean, snorting lines (she high)\nOverseas like \"bonjour\", last ten years I've been on tour\nAnd I still got that old money, I touch more green than a lawnmower\nWith a ratchet bitch (bitch), you laid up (stupid ass)\nI'm on my tour bus fucking mamas getting paid up\nI take that bitch to my mansion (mansion) and a nigga can't pay her to leave (leave)\nYo mama a great head doctor (groupie), with no PhD (groupie)\nMy pockets stuffed with dough, I made it all in the streets\nI might just go to the club, and throw it all on a freak\nYo mama, ratchet ass bitch\n\n[Outro: MILF]\nBaby, oooooh, can you feel what I feel? OH shit!\nI hope you brought your boots and shoes, cuz motherfucker\nI'm gonna be here a while", "image": "https://images.genius.com/27fece6af1c9ca0717550d393fff7409.1000x1000x1.jpg"}], "artist": "Big Sean"}