{"songs": [{"title": "Legacy", "album": "YSIV", "year": "2018-09-28", "lyrics": "[Intro: Logic]\nYou\nYou, you, you, you, you\nYou, you, you\nHow do you want to be remembered?\nJust being rich?\nYeah, yeah\n\n[Verse 1]\nUh\nVisions of seeing myself as someone different\nReality got me feeling indifferent\nI'm lifting this weight off my shoulder\nBut hold up, older I get\nI reload the clip and sip on something\nI feel good for nothing\nAll my glory days behind me or beyond me\nI’m folding like origami\nMy tables turning like interior decorators\nLevels like elevators\nThese haters got me questioning my judgement\nTried by a jury of my peers, but where the judge went?\nWhat will my legacy be?\nWho will my enemy be?\nIn due time as I write this rhyme\nI don't know\nFlash before my eyes\nYeah, uh\n\n[Verse 2]\nAnd on my deathbed what will I say as I pray?\nAnd reminisce of another day, uh\nI came from nothing, a child born in poverty\nWent to college to gain knowledge\nSo they would acknowledge me\nHonestly, I got a good job\nI found a woman, made her my wife\nBut spent more time at work\nSo we could have a stable life\nAnd when my son was born\nI had to work even harder\nBefore I knew it, now my wife was giving birth to my daughter\nWent from 40 hours a week to 80\nAin't nobody gon’ pay me but myself\nSacrifice my time and my health, for wealth\nI missed a birthday, miss an anniversary\nThere's lots of people in this world that's worse than me\nI wasn't there for my son's first words\nBut he ain't grow up in the hood like me, we in the burbs\nSacrifice a couple years, he could have all the money when I'm gone\nWhat a fool I was\nI missed his graduation, I missed her wedding day\nI didn't even get to give my little girl away\nBut I paid for the honeymoon, yeah, I paid for the honeymoon\nI’m not there right now but I will be later\nI’m working on something that's greater\nThat’s my legacy\nUh, I'm gon' be remembered by generations to come\nDamn, you dumb\nYou won't be remembered by your son\nUh, yeah\n\n[Verse 3]\nTo be remembered by generations to come\nYou a fool\nYou won’t be remembered by your son\n\"Nonsense, nonsense!\"\nI said to the man with no money, nonsense, uh, uh\nStep back who running from me I don't know my own identity\nI look in the mi-look in the mi-the mirror, I ain't clearer\nI'm just trying to be free— who is that? It surely ain't me\nAs I lay on my deathbed, I realized I was wrong\nI have been the richest man in the world all along\nA beautiful family that all I did was ignore\nFor financial stability and fear of being poor\n'Cause when I was a child, knew I always wanted more\nWhen I was a child, knew I always wanted more, more, more\nAnd now I got it, uh\nAnd now I'm laying in this bed; cancer spreading through my lungs\nLooking at my family like \"Damn, y'all were the ones\"\nI sacrificed my life for 100's, 50's, 20's, 10's, 5's, and 1's\nSo dumb, I'd give it all if I could\nDo it for my heart again, not my wallet\nI hate to recall it but it's gone now—legacy is gone now\nSacrifice my health for wealth, no, it wasn't worth it\nBut as I take my last breath, I know that I deserved it\n\n[Verse 4]\nDaddy, Daddy, Daddy, Daddy\nThe legacy you gon' leave behind you forever is the blood in your veins\nWake up, Daddy, now is the time for change\nAnd as your child I'm telling you I don't give a damn if we living on change, Daddy\nJust as long as we livin'\nJust as long as we livin', Daddy\nI just want to be happy, I don't give a damn if we live in a shoebox\nNow my mama gon' tell you what you got\n\n[Verse 5]\nI love you, I love you, I love you, I want you, I need you, I crave you\nWhy you throw away this pussy that I gave you?\nWhy you fucking 'round behind my back\nWhile I'm home raising my children?\nFeel like a single mother even though a ring up on it\nSupposed to be husband and wife, you more like my opponent\nFinger fucking myself 'cause fuck infidelity\nI'd rather look in the mirror be happy who I see\nSometimes I want to take my babies and go to my mama crib\nCan I live?\nCan I have a life away from my life?\nBe the woman that I would have been if I wasn't your wife?\nYou know I love 'em—but if that test wasn't positive\nI woulda had a lot to give\nSometimes I want to divorce your ass and take half\nMotherfucker\nBut I stay 'cause I love these children\nAnd I love you deep down, that's why I stick around, but\nYou never there\n'Cause you just want to be the best\nYou just want to make this money, uh\nCome get this pussy, motherfucker\nCome get this pussy and love your children\nFuck your legacy\nFuck it\n\n[Outro]\nFloat in the abyss of nothingness\nMy consciousness remembers a life before it hits black\nI wish that I could get back and then I realize that all this shit is just a daydream\nAnd there's only like four of us on the tour bus\nAnd I'm in the back, how 'bout that?\nThinkin' 'bout my legacy\nAnd how we as human beings sacrifice health for money\nAin't it funny?\n'Cause in the end, we spend all our money on repairing our body and mind\nWhen we really should have just spent time\nFuck a legacy\nI'ma go live my life\nPeace", "image": "https://images.genius.com/2bdac395ac5e383d08777fa471ffb275.600x600x1.jpg"}], "artist": "Logic"}