{"songs": [{"title": "Letter to the System", "album": "Us or Else: Letter to the System", "year": "2016-12-15", "lyrics": "[Intro : T.I.]\nWhats on the mind......of a Black Man right now?\nI wonder....\n\n[Verse 1: T.I.]\nAin't it hard enough..to raise your sons and your daughters up?\nWithout dealing with the racist stuff\nMan, I just got out of prison trying hard as fuck\nAnd it seem like its a green light on anyone with my skin type\nGet pulled over for a tail-light and get shot\nKnow what dat feel like? Man, it real life\nWe ain't have to be brought here man, real life\nBut the fact is that we all here\nIf you don't like, you should've left us where we were\nBruh, its all your fault, see L.O.L. J.K. J.K. yeah\nEverybody sing \"Kum-ba-ya\"\nReparation that'll never happen, but we ain't just gon be Abused by it y'all, wait a minute\nI'm confused, I thought every man was treated equal, read it in the Constitution, yeah only when they feel like sticking to it\nBut U.S.A. the greatest nation in the world, dat my story and I'm sticking to it\nKeep sticking to it\n\n[Hook: London Jae (T.I.){Translee}]\nLetter to the System, (yeah)\nFor my brothers in them prisons (yeah)\nAnd the soldiers that fell victim to that bullshit (say bitches , us or else)\nMan, this shit designed to beat us\nYou the find the one to lead us?\nSick of the way you treat us, this some bullshit (say bitches, us or else)\n{Yeah, you on my shit list, yeah}\nLetter to the system {You dig?}\nI hope you bitches listen {You dig?}\nStay the fuck out of my business (Bitches, us or else) {Minding Minding my business, yeah}\nFucking reparation  {You dig?}\nAll of my 40 acres {You Dig?}\nYou leave us (Bitch, us or else)\n\n[Verse 2: Translee]\nMan, these fools vote on Instagram, they don't give a damn\nGrandma on the phone screaming \"Oh Boy Oh Boy\"\nDamn and she ain't never heard of Killa Cam\nClocks feeling like a ceiling fan\nShe remember back when Martin Luther, he would march and Marchin' at the Million Man and that shit begin again\nMan, they got the problem solver for y'all, .38s and revolvers\nThey should've never involved us\nProbably knew that white women would stalk us\nNeiman to Marcus, ?, Neiman to Narcos? , Narcotic Targets, walkin' and jogging walk out of Target\nStop and risk police going in my pocket\nDrug search over illegal parking?\nDrug dog, when they me they barking\nBlack skin at the target, black for sale at the black market\nAnd its all for free, we don't ask for nothing\nI got me, I ain't backwards hustling\nWe got us, we ain't taxing us\nGet yo ass back back back back back back to the back of the bus\n\n[Hook: London Jae (T.I.){Translee}]\nLetter to the System, (yeah)\nFor my brothers in them prisons (yeah)\nAll them soldiers that fell victim to that bullshit (say bitches , us or else)\nMan, this shit designed to beat us\nYou da find the one who lead us?\nSick of the way you treat us, this some bullshit (say bitches, us or else)\n{Yeah, you on my shit list, yeah}\nLetter to the system {You dig?}\nI hope you bitches listen {You dig?}\nStay the fuck out of my business (Bitches, us or else) {Minding Minding my business, yeah}\nFucking reparations {You dig?}\nAll of my 40 acres {You Dig?}\nYou leave us (Bitch, us or else)", "image": "https://images.genius.com/4a3af1ad50f638f4b221d88c280afff5.680x680x1.jpg"}], "artist": "T.I."}