{"songs": [{"title": "Hard on a Bitch", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "\"Something like this\"\n\"Pimpin ain't.. pimpin ain't dead..\" - repeat 2X\n{*background scratch: \"Hard on a bitch\"*}\n\n[Too $hort]\nI'm so hard on a bitch nigga\nI mean it's nothin though, you know I'm from the town\nEverythang on a bitch\nThat's how we do it\n{\"I'm hard on a bitch, go ask my first ho\"}\n\nI'm not nice to these hoes, most of the time\nI say what the fuck, is on my mind\nI grab my pen, and write a rhyme\nAnd say somethin 'bout a bitch on every line\nShe just gave me 800, a G last night\nShe could pay me for years and couldn't be my wife\nEverybody talkin 'bout, how these pimps be funny\nA bitch couldn't lock me down with Whitney's money\nSome niggas get paid but they're not the boss\nCain't even show off, stop and floss\n... without askin permission\nWhy you bitch-ass niggas always askin yo' bitch\nIf you can do thangs, what'chu wanna do mayne?\nYou wanna help your girl step up her shoe game?\nTake her shoppin, just to get it poppin\nYou weak for the pussy and you know you need to stop it\n\n[Chorus: Too $hort]\nHard on a bitch, I'm hard on a bitch\nI'm hard on a bitch so hard on a bitch\nHard on a bitch, I'm hard on a bitch\nI'm hard on a bitch I'm so hard on a beee-itch!\n\n[Too $hort]\nBut you ain't though, and you cain't flow\nShe's a pro, but you ain't know\nYou so soft, you ain't pimpin these hoes\nYou take 'em to the mall and buy expensive clothes\nAnd let her drive your car, so you can say you're fuckin\nShe disrespects you and don't pay you nothin\nBut that's you - cause if it was me\nShe'll be comin to the table with a meal to eat\nAnd I stay hungry, I like hoes that make money\nYou got a pussy, and they want it\nSo give it to 'em and collect the fee\nBuy some mo' shoes and give the rest to me\nCinderella and her glass slipper\nThey say, a lot of fuckin makes yo' ass bigger\nI say, keep fuckin make my ass richer\nWhile yo' booty and my pockets get thicker\n\n[Chorus]", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}