{"songs": [{"title": "Spider Man", "album": "Sweat", "year": null, "lyrics": "Nelly]\nThat motherfucker was horrific\nYes it was, yes it was\nOkay, I was\n\n[Chorus:]\nSittttttttttin, on the hillllllllll\nCountin my, dough\nMilllion-two, million-three, million-four\nFive million, six million, seven million more\nThen I heard a knock knock, who's there?\nIt's yo' friendly neighborhood Cad leanin and M. O. Beamin Spida Man\nSo bewurr\nCome take a look up in the sky, you can't lie\nI know you feel it when it\nSittttttttttin, on the hillllllllll\nCountin my, dough\nMilllion-two, million-three, million-four\nFive million, six million, seven million more\nThen I heard a knock knock, who's there?\nIt's yo' friendly neighborhood Cad leanin and M. O. Beamin Spida Man\nSo bewurr (bewurr)\nCome take a look up in the sky, you can't lie\nI know you feel it when it (Knock knock)\n[[Nelly]\nI used to live in cellars, I used to coke a sellah\nTwo hundred million fella, call me a fo'tune tella\nTryin to get over Eazy, like they was Jerry Heller\nI never want to jail-ah, cause I'm too slick a fella\nSeen me on wheels befo', man you should see me now\nIt might be hard though, because I sit too high\nI sit up on the hill, but I'm still down to earth\nI'm like the Rams man I'm at the best when on my turf\nYou watch your girl flirt, you watch your girl tease\nYou think your girl want cheese? Then check your girl knees\nYou need to check her needs, befo' I check 'em for ya\nCause once I check her needs, she won't be checkin for ya\nYou hear a knock knock, who is it that's, payin a visit\nShe's, goin ballistic while he's, sippin on her Mystic\nWhoa, it's the exquisite one named Mo, or short for Moses\nI think I'll go back to countin my money now\n\n[Chorus:]\n[Nelly]\nSay I don't come to the hood, what do the fuck they know?\nWho else drivin that Bentley, out there in front of Wo's\nSittin out in front of Tandy, I got my phone handy\nGive me the numbers I'ma call 'em, you been missin for 'em\nI'm buyin bikes for tykes, there'll be some uniforms\nWhile they just rap about we fo' sho' fo' kids and show 'em\nAt elementary schools, the day of show and tell\nWe didn't come to show, mo' like we came to tell\nTell 'em how to keep it strong, on how to keep it tight\nTo tell they right from wrong, to turn your wrong right\nWatch all they words and actions, thoughts companies and habits\nLeave them tricks for rabbits, that greed for the savage\nAnd you can make it happen, if you just don't give up\nI guarantee that you can be that anything you want\nGive 'em that real talk, show 'em that real walk\nAnd maybe one day you can be like me, somewhurr\n\n[Chorus:]\nKnock knock]", "image": "https://images.genius.com/d228092985a51eeb2d4700f76161a5bc.600x600x1.jpg"}], "artist": "Nelly"}