{"songs": [{"title": "Spit Flames", "album": "Chef Cocaine Cooked ", "year": "2004-03-01", "lyrics": "[Intro: Raekwon]\nDrink to this nigga\nYo, what's your record company lord? (Gladiators)\nKeep it straight.. straight up\nGame time\n\n[movie samples]\nI don't know what you doin' out there on the street\nI'm gonna kick your ass!\n\n[Verse 1: Raekwon]\nWallabee encounters, yo we from New York\nWe never bounce son\nWe carry cage ways, straight up and don't get down son\nSupposed to have blow out and pound son\nTen rastas had masses, fly Nikes, splashes and Porsche glasses\nSingles leather opponent, straight from the street baby\nPolo jacket, baseball hat matchin' lookin' froze, dumb, unusual\nI'm lyin', face the music boo, pendulum loops and swoops\nShells ain't nuttin' to conceal ya fool\nI'm young but mostly swift from blunted\nThink like chess, drink, note languages blessed\nI'm from and era where niggas'll get caught for leathers\nShots are hollerin', hung knees up supportin' the weather\nWho the fuck gots mines? Bringin' like Duran with Ross\nBet all y'all niggas are dyin' in cars\nFuckin' with me? It's like luxury\nFlow like water in and out of doors, dare a nigga fuck wit' me\n\n[Chorus:: Polite] (x2)\nEh, nah test this boy, spit fire\nHe got a sound like lightnin' and thunder\nEh, nah test this boy, spit fire\nHoney bad sound boy test he get murdered\n\n[Verse 2: Raekwon]\nYo, beat Gods sneakers look decent and he hard\nFeel my giants, sway down, big pieces on yo\nThe bringers I flooded with more dough\nFeel my effect, Lex get busy, wheel his own check now blow\nMountains get bagged, I'd rather count and just grag\nSlap on crabs, Jags in the snow\nFeelin' leather Khuzis and Uzis\nMovies that bein' produced like rubees\nOne of the illest gaters salute me yo\nDrive borrowed connects\nBought out Manhatten wit' cheques\nMan I miss you, bank's next\nFinger paintin' low like one of the Saints\nJim down, all white minks lookin' like 10 thou'\nStaten Island Gotti, gats, we ain't leavin' without it\nTake this here, you need cops, you ain't 'bout to stay in there\nGet popped and the violence in rare\nI can take care of yours, you take care of there's\n\n[Hook: Polite]\nWord is out, other rappers usin' their clout\nYour hands ain't dipped no more, you just pissin' me off\nFrom a jurisdiction where niggas come up missin'\nRides, get housed right\nNiggas even battle for bitches\nAnd their game is to get yours, ride through the zors\nYou sure? Suggest you're wise to see what time it is Lord\nThe plane ain't the same, the game kinda weakened your name\nWhat you better do is spit flames\n\n[Chorus:: Polite] (x2)\nEh, nah test this boy, spit fire\nHe got a sound like lightnin' and thunder\nEh, nah test this boy, spit fire\nHoney bad sound boy test he get murdered\n\n[Verse 3: Polite]\nWe spit fire, yeah it's on and nah testin' up the wrist\nMe nah have to touch in my wrist, son me have to push to waste\nAnd all the boy spit fire, me lick a shot to retire\nSo them can not move no further\nI spit fire, then me call Ghostface Killah\nTell him that me just start to murder\nMe spit fire, then me call Raekwon the Chef\nTell the boy run for the lawyer\nDon't test this fire\n\n[Hook: Polite]\nWord is out, other rappers usin' their clout\nYour hands ain't dipped no more, you just pissin' me off\nFrom a jurisdiction where niggas come up missin'\nRides, get housed right\nNiggas even battle for bitches\nAnd their game is to get yours, ride through the zors\nYou sure? Suggest you're wise to see what time it is Lord\nThe plane ain't the same, the game kinda weakened your name\nWhat you better do is spit flames\n\n[Outro: Raekwon]\nThe first thing what we gotta do man\nIs know what we gonna do with this +CREAM+ when we get it\nI'm not tryna just be.. sitting on motherfuckin' 200 thou'\nAnd actin' like I'm just gonna be a.. a drug dealer all my life son\nI got bigger and better plans yo -> Raekwon from Striving for Perfection\nTake that to the bank nigga", "image": "https://images.genius.com/e76bb998c70212fa27d3d24cb293933f.425x425x1.jpg"}], "artist": "Raekwon"}