{"songs": [{"title": "Coupe", "album": "Adult Swim Singles Program 2014", "year": "2014-06-20", "lyrics": "[Produced by Drumma Boy]\n\n[Hook]\nThis my environment\nYou can see this whip that I’m driving, this my environment\nI’m going crazy, so crazy, need a psychiatrist\nThese bitches come out in groups\nChuck out the deuce, I know you ready to get loose\nWe in the coupe, coupe, coupe, what you in?\nCoupe, coupe, coupe\nCoupe, coupe, coupe\nCoupe, coupe, coupe\n\n[Verse 1]\nI’m in that four door, I got that Glock in the roof\nI’m living proof, I rock that turbo that turbo I hit my boost\nPick up your four, you got hoes looking like mermaids\nYou in another one that was not that was not the one from yesterday\nYou went colossal your posture is very awesome\nGotta get arrogant nigga when I’m here flossin’\nYou can’t be showing no love to big booty freaks\nShe love the way that my doors open for my Lamborghini\nKidnap then jack him fuck rapping nigga ‘cause we done seen it\nWhen you survive and you make it you gotta know the meaning\nThis is your lifestyle for life, nigga you no longer dreaming\nI forgot about my ceiling\n\n[Hook]\nThis my environment\nYou can see this whip that I’m driving, this my environment\nI’m going crazy, so crazy, need a psychiatrist\nThese bitches come out in groups\nChuck out the deuce, I know you ready to get loose\nWe in the coupe, coupe, coupe, what you in?\nCoupe, coupe, coupe\nCoupe, coupe, coupe\nCoupe, coupe, coupe\n\n[Verse 2]\nI’m getting some facial I turn the corner so fast, I almost crashed\nI’m in that V-12 Engine, I hit the gas\nWe on that ‘93 smoking that good supreme\nI got some kingpins waiting, run through my genes\nWe in the race car whips, that’s my genetics\nI made my money through flipping, and I don’t sweat it\nI’m ‘bout to spend me some chips, I won’t regret it\nI put in weight from the deck, I’m driving reckless\nYou can’t be hacking the player, you get a penalty (that’s a no)\nI get to dozing off in the coupe off promethazine\nYou put a turbo next to a turbo, that’s royalty\nRepresent loyalty\n\n[Hook]\nThis my environment\nYou can see this whip that I’m driving, this my environment\nI’m going crazy, so crazy, need a psychiatrist\nThese bitches come out in groups\nChuck out the deuce, I know you ready to get loose\nWe in the coupe, coupe, coupe, what you in?\nCoupe, coupe, coupe\nCoupe, coupe, coupe\nCoupe, coupe, coupe", "image": "https://images.genius.com/1a83548b11df6166841e48b12b04c468.500x500x1.jpg"}], "artist": "Future"}