{"songs": [{"title": "You Know How We Do It (Remix)", "album": "Bootlegs & B-Sides", "year": "1994-11-22", "lyrics": "[Ice Cube]\nSlippin, slidin, glidin LOW-ridin\nAin't no hidin from this hit\nFool -- you know how we do it\n\nWest Side\nI'm comin from the West Side\nWessyde, it's hittin on the West Side..\nYeah, fool..\n\nAin't nuttin goin on but the bomb-ass rap song\nHittin all night long\nJust like me on the black and white ivory\nGettin six on the tee-ta-lee, you don't want to see a G\nBreak yo' ass like dishes\nBuster-ass tricks, sleep with the fishes\nRunnin from Lennox, up at Venice\nThey wanna have me in stripes, like Dennis the Menace\nBut that ain't poppin, ain't no stoppin\nFo'-hoppin, ass droppin, Coupe DeVille\nMy truth can kill - fool I got skills\nSo, back on up 'fore I check that chin\nDown as fuck and I'm full off Henn'\nYou gets no love and I thought you knew it\nFool, you know how we do it\n\nWessyde, it's bumpin on the East Side\nIt's slammin on the South Side\nMakin noise on the North Side\n\n[Ice Cube]\nChillin with the homies, smellin the bud\nDouble parked, and I'm talkin to Dub\nAbout who got a plan, who got a plot\nWhom got got, and who got shot\nCause everybody knows that he got the infoCrazy Toones hangin out the window\n\"Fool I got them bomb-ass tapes\"Da Lench Mob, _Planet of the Apes_\nI'm down with Eiht, and _Watts Up_\nKam and Solo, they got nuts\nWhen Ice Cube write a sentence\nI want \"The Bomb,\" just like George Clinton\nS-K-D is down to catch a body\nPut on _Knee Deep_, we'll turn out your party\nYou gets no love and I thought you knew it\nFool, you know how we do it\n\nFool, you know how we do it\nI'm hittin on the West Side\nIt's bumpin on the East Side\nSlammin on the South Side\nMakin noise on the North Side\n\n[Ice Cube]\nNow Jack B. Nimble, and Jack B. Quick\nIf you wanna jack me on a lick, cause\nI'm that fool from South Central\nYou think you stuck yourself, with a number 2 pencil\nThat's how I poke hot lead in yo' ass\nWith \"Mo' Bounce to the Ounce\" in the dash\nMash up Van Ness, headed for the West\nEverything is great, slow down for the dip\nOn 108th and keep mashin'\nDon't drink and drive to keep the fo' from crashin\nStashin a Glock and I thought you knew it\nFool, you know how we do it -- and\nYou can't fade the R-E-M-I-X\nGoin to the bank cashin big fat checks\nWhat's next on the menu?\nGot a big fat booty to attend to, ooh\nWith the rhythm it takes to dance to but\nWe got to live, too\nMobbin and robbin and squabbin and stealin\nK-Dee and me, I got the feelin\nAnd won't be happy til I'm platinum loc'\nThe mic smoke (and all the hoes are broke)\nThe freshest MC in the world, who is?\n(You is) You know how we do it\n\nFool, you know how we do it\nI'm hittin on the West Side\nIt's bumpin on the East Side\nSlammin on the South Side\nMakin noise on the North Side\n\n\"Ain't nuttin goin on but the bomb-ass rap song\" (3X)\n\"Ain't nuttin goin on but the bomb-ass rap song\" -] scratched", "image": "https://images.genius.com/bd986178756b67188db2d06a77696b78.1000x1000x1.jpg"}], "artist": "Ice Cube"}