{"songs": [{"title": "HollyWeezy", "album": "Sorry 4 The Wait 2", "year": "2015-01-20", "lyrics": "[Intro]\nToo Hollygrove to go Hollywood\nUhh\n\n[Hook]\nHollygrove, Hollywood, Hollygrove, Hollywood\nToo Hollygrove to go Hollywood\n\n[Verse 1]\nFind out where your parents stay\nTell my goons to go straight to your momma room\nWhat's in your pockets? What's in your pocketbook?\nWe think the Bible's a comic book\nBitch this Hollygrove, too far from Hollywood\nToo Hollygrove to go Hollywood\nI got cocaine that's so good, need a name? Call it \"Milk\"\nBecause milk does the body good\nI got this heat on my waist\nSo somebody better monitor the thermometer\nI just eat pussy and pussy-ass niggas all day\nAnd I ain't even kinda full\n\n[Hook]\nHollygrove, Hollywood, Hollygrove, Hollywood\nToo Hollygrove to go Hollywood\n\n[Verse 2]\nWoo! I went from Bourbon to Beverly Hills\nShow me your tits\nI'll show you my weapon and grill and heaven is real\nI get an actress into my bedroom\nShe lay down and say \"Let's make a film\"\nI be like \"Action,\" I hold her head down by her neck\nThis how breathtaking feel\nFamily first, you'll get your family killed, that's if you squeal\nPop-pop, close range, hold that gun\nLike the photographer hold the camera still\nBad bitch riding my dick\nShe swerve 'cause another bitch grabbing the wheel\nI ask 'em to chill, they both look at me, say \"Shut up\"\nI say \"My lips are sealed...\"\nOooh! I come from Hollygrove, I done went Hollywood\nI was a match made in Heaven\nWhen Hell was a pile of wood\nI run through Hell with gasoline drawers on\nStop, tell the Devil that God is good\nEntrepreneur in a Bentley droptop Azure\nVagina connoisseur out the hood\nI come from Hollygrove, every day Halloween\nWe shoot your block up and just say we shot a scene\nThis is a robbery, I let the chopper squeeze\nTurn you to cottage cheese\nBeen on my beast since I was wearing Wallabees\nWhere paparazzi? I need my privacy\nFuck your photography, I react violently\nMake sure your camera get my good side of me, Lord!\nI come from Hollygrove\nHollywood should make a movie 'bout Hollygrove\nWoo! Whoever play me\nShould get a Oscar and a Golden Globe\nThis ain’t no movie, this is real shit\nI don’t need a script 'cause I know my role\nMy Hollywood bitch just overdosed\nAll she could snort, more coke than Pinocchio\nI come from the streets\nBut got \"superstar\" written all over my face\nThat’s why these hoes in my face\nI come from Hollygrove\nI moved to Hollywood just to Californicate\nBop-bop-bop-bop-bop-bop-bop\nI ain't finished shooting, tell 'em don’t check the gate\n\n[Hook]\nHollygrove, Hollywood, Hollygrove, Hollywood\nToo Hollygrove to go Hollywood\nHollygrove, Hollywood, Hollygrove, Hollywood\nToo Hollygrove to go Hollywood\nFall asleep to the gunshots\nWake up and smell the embalming fluid\nI come from Hollygrove, my bitch from Hollywood\nWhen I fuck her she say “Hallelujah!”\nHollygrove too far from Hollywood\nOhh, but I done went Hollywood\n\n[Verse 3]\nHollygrove, Hollywood, Hollygrove, Hollywood\nHollygrove ain't far from H-Town\nWe used to drive back and forth with the work praying\n\"Lord please don’t let this car break down\"\nHahahaha\nH-Town! Lord, I done went from Hollygrove to H-Town\nHollygrove to Houston\nGot a bad 5th Ward bitch that be boostin'\nSometimes she doze off, that’s the lean, I excuse it\nShe said “If it ain’t ch-chopped and screwed, it ain’t music\"\nShe say I never take her out, we went to eat at Houston's\nSometimes I doze off, that’s the lean, I'm just snoozin'\nI still got Actavis, nigga, that's exclusive\nKill you for a pint, that’s a PT Cruiser\nI see way too many hoes in my future\nI'm gon' nail all them hoes, I'm Freddy Krueger\nGrew up on Bun B, Pimp C was my tutor\nPimp Squad for life, had to do this for Houston\nHollygrove ain’t far from H-town\nWe used to drive back and forth with the work\nPraying the car don’t break down\nOhhh, Hollygrove ain’t far from H-town\nWe used to drive back and forth\nWith, codeine, cocaine, the pills, and pounds\nYeah, and we got back home safe and sound\nIf you got pulled over you don’t give police no names\nOr get killed and never found\nWord, but I kept some money to bail out\nMomma used to say if I ever get caught\nThey gon' put me under the jailhouse\nDamn, I'm too Hollygrove to go Hollywood\nOne to the chest with this chopper\nLeave you with just arms and a head like a octopus\nI got this chopper protecting my livelihood\nI'm so good, I'm so straight, I’m secure\n\n[Hook]\nHollygrove, Hollywood, Hollygrove\nToo Hollygrove to go Hollywood\n\n[Outro]\nCut", "image": "https://images.genius.com/c84ee812d9e99028d560054b386d4d9d.500x500x1.jpg"}], "artist": "Lil Wayne"}