{"songs": [{"title": "We Pop (Remix)", "album": null, "year": null, "lyrics": "[Intro: RZA (King Tech)]\nYo, yo, P. Diddy might run this city\nBut I walk down the block, flash my -- (Yo RZA, hold up, hold up)\nYo what's up son? (Yo, we gotta remix this joint)\nYo, come on then (Yo, 40, it's on you)\n\n[E-40]\nI gotta tell you, we ain't next to nice, made you nice\nDon't get your head cracked, don't get your tomato diced\nI'm the coldest M.C. in the game\nAnd I shouldn't have to say it, you squares know my name\nPimped with all the slang in the game, that they recite\nEvery time I open mouth, these suckas bite\nI bust like a Dutch Master, blast you if a have to\nSomebody call the pastor\n\n[Crooked I]\nWe got realest long beats\nFlows stop, make the beat go ---\nI'm in the Coup with the seats low\nEven on the East Coast, I gotta keep my heat close\nWe leaving holes in your cheap clothes\nMy only job is to stop imposters, watch the mobster\nCop the Boxster, drop the top and squat\nSwitchin' through lanes, this is the group thing\nCause this is Wu-Tang and Horseshoe Gang, what up?\n\n[Chorus 2X: Ol' Dirty Bastard (Lady Platinum) {E-40}]\nWe pop, we brawl, get money till the day we fall {please believe it}\n(We pop, we brawl, gettin' money til the day we fall) {please believe it}\n\n[Method Man]\nYo, I Bonecrush' ya, like I ain't 'never scared' brother\nThat baby mother's like baby powder and there another\nM.C. does this cutter, when I cut, I split jugglers\nWhen my teeth get yellow, I spit butter\nBy now you know my name, man, who hold the belt, now\nPlus who hold his self down, all with the same hand\nNow what's the game plan, let money change hand\nI'm still champ, and white boys still can't hang\n\n[RZA]\nYo, P. Diddy, might run this city\nBut I walk down the block, flash my Glock on the jiggies\nAn ounce of chronic, crushed up in the ziplock\nOutside the club, is packed up to the gridlock\nDime piece wizes, high heels and the flip flops\nReal players pop with those cringy wrist watch\nBig bouncers the size of Sasquath\nTuck riff with the rim that'll make your eyes pop\n\n[Chorus 2X]\n\n[Jayo Felony]\nDo I have to assassinate them?\nMan, I leave 'em with no altimatum\nI ain't hate 'em, I ain't make 'em make mistakes\nBut I'mma break 'em, the cops, could I shake 'em\nOr will they catch me and charge me\nOn the streets I put something in ya, that'll send you to God\nMeet my man, we don't have to roll, candy when we ride\nShe love it, when I give her, pull her panties to the side\nBullet loco, you might catch me breaking and entering\nMama, I had to jump bail right before the sentencing\n\n[W.C.]\nGet it up in 'em, cool, that strip and claimin' the set\nAnd quick to Sway the Tech, ya'll straight bang and connect\nIt's the dog, ya'll get it off, on your backpack and blue marker\nChronic smoke cougher, I don't shoot walker\nDub Sizzle on the remix, the last to speak\nNow it's all coming together like sweaty gas leaks\nFo' sure, a nigga will say, 'yo, it's Dub C'\n40, Crooked I, RZA, Method Man and Jayo\n\n[Chorus 2X]", "image": "https://images.genius.com/0050e4b1c52ecca6d63818331b489e2a.683x683x1.jpg"}], "artist": "RZA"}