{"songs": [{"title": "FYM", "album": "508-507-2209", "year": "2017-06-16", "lyrics": "[Verse 1: Joyner Lucas]\nPicture me putting my city all over the map\n(Whoa, whoa, whoa, yeah)\nThey wasn't believers, I had to get even at math\n(What, what, what, what)\nBe coming, I'm pulling and jumping all over your grass\n(Yeah, yeah, whoa, whoa, uh)\nSo tell all my bitches I got a new girl\nTell the police that I'm robbing the bank and I want all of my 50's in cash\nBitch, I'm tired of living, check to check\nI need twenty models and some extra sex\nSmiling in my grave, bitch I'm fresh to death\nI've been drinking Wu-Tang with Inspectah Deck getting drunk\nYeah, I got some shit that I gotta just get off my chest\n(Whoa, uh, uh, uh, yeah, damn)\nI can admit I got lots on my list and you next (uh, uh)\nTake it how you want it, I ain't famous like I want it\nBut I think I might just skrrt off, blow the speakers and turn up\nPop a bottle of Smirnoff, go to church with my shirt off\nTell the Lord that I'm here now, I've been waiting for so long\nI've been patient for so long, breaking rules like there's no laws\nAnd I did it for a long time\nIf you don't like me, take a ticket, there's a long line\nNice to meet me, hoe, I think the pleasure's all mine\nShit, they've been clocking me so long, I think they lost time\n\n[Chorus: Joyner Lucas]\nOoh you lost your mind, nigga\nFuck you mean? Whoo! Hol' on\nGoddamn it, nigga\nFuck you mean? Whoo!\nAnd I don't trust a mothafucking soul\nWhat the fuck you mean? Whoo!\nHol' up, whoa whoa whoa whoa\nWhat the fuck you mean? Whoo! (Hol up now)\nLook\n\n[Verse 2: Joyner Lucas]\nDon't know what you thinkin', compare me to niggas is nothing\n(Uh, uh, uh, what, what)\nAdrenaline pumping and blood'll be leaking and running\n(Word, word, yeah, yeah, uh)\nShit, I do what I do, I don't care if you like it or love it\n(Nah, nah, uh, uh, Joyner)\nTell all of my bitches I got a new girl, wait\nAnd tell the police that I'm robbing the bank and I want all my money in 100s\nBitch, I'm tired of living on the edge\nI wanna sell drugs but they gon' call the feds\nI just bought a brick and that shit cost an arm and leg\nMy momma told me, \"Take it back and get a job instead\"\n(Where's your common sense, nigga?)\nMe and the devil got too much in common, I swear\n(Damn, uh, uh, damn, uh)\nBorn in the ghetto, I never had nothing to fear (nah, nah)\nTake it how you want it, I ain't famous like I want it\nSo, I might just throw a hissy fit\nCall up Cassie, ask her if she broke up with Diddy yet\nI said shawty, if she's talking I ain't hitting it\nCause she gon' call her friends up and brag about the shit we did\nWhoa, I ain't into pillow talking, go chop off your lips\nIf I ain't in your top ten, go dive off a bridge\nMy block boys got Glock fours that'll knock off your lid\nI doubt you gon' pop off, so hop off my dick\nWhoo!\n\n[Chorus: Joyner Lucas]\nNigga, fuck you mean? Whoo!\nGoddamn it, I said fuck you mean?!\nListen, I don't trust a muthafucking soul\nNigga, no, nigga, fuck you mean?!\nWhoa, whoa, whoa, whoa\nWhat the fuck you mean?!\n\n[Verse 3: Mystikal]\nYou thought I was finished, you thought it was over?\nYou thought I retired, you thought I went fishing with Kobe?\nNigga, I'm still as the illest, considered as one of the coldest\nStill-a pull apart in a rapper head like Moses, mm-hm\nI'm throwback like I'm Motorola\nBut hoe, I'm cooler than a cup of yogurt\nBlack flag, Crip boy, truck soldier\nI'm cool with drug lords and Ayatollah's\nRap god, cyclops and ogre\nBitch I'm King Kong, ain't nobody told ya?\nFuck you think bro still smoking?\nAww fuck it, I'm Bobby Brown, 'bout to go get loaded\nRetarded Paul McCartney, bitch I'm rich\nI'm Muhammad Ali, I talk shit\nI'm James Brown, bout to tear down this bitch\nI'm Michael Jackson, bitch I'm bad as bad gon' get (oww!)\nFuck you mean?\n\n[Voicemail]\nYo wassup, this is Joyner\nI'm unable to take your call right now\nLeave me a brief message and I'll get back to you, peace\n\n[Brief Message]\nYo, this is the third time this week\nThat you failed to pick up your son, and I'm just so confused\nLike I find it funny that you stay in the studio laying something down\nSlanging mixtapes but you have yet to bring home diapers\nAnd lay your kid down and go to sleep\nOn Snapchat talking 'bout, \"Where's the plug?\"\nLike I’m sure he’s at National Grid tryna cut my lights back on\nLike \"a dollar and a dream\" ass career\nAnd you can't even come home and give us a dollar for some fucking milk\nI'm not doing this with you, keep it 100, my nigga", "image": "https://images.genius.com/15c4c3c9fa26958e4841c4e8276492ed.1000x1000x1.jpg"}], "artist": "Joyner Lucas"}