{"songs": [{"title": "Top Down (Part II)", "album": null, "year": null, "lyrics": "We call 'em rags, you call 'em drops\nWhatever you call it just drop the top\nWe call 'em rags, you call 'em drops\nWhatever you call it just drop the top\n\nGood times, these are the good times\nLeave your cares behind\n\nHow freaky can you get to a Morning Strip?\nHella freaky like I said to a song that hit\nI'm the dirty rapper Too Short, the Rated X\nI Got The Girls, Cause You're Hated Than Sex\nWhich is worse, my bark or my bite?\nYou heard about me and now I'm Jocking you\nAll Day & Night\nYou must of thought I got nicer, talking about Heiser\nI'm an old dogg and old dogg's get wiser\nCaught up in the game, got ya thinking while your doing this\nYou never did this, Hangin' With The Big Pimp\nYou Know What? You better check the size, and recognize\nWhen I'm between your thighs\nRide, I get hard from the sound of a kick drum\nLaughing And Smiling They Be Watching A Sitcom\nShiny bald head catching sun rays\nGoing backwards down runways\nFour eighteens with the zues and the Zapco\nSounding like I'm riding out a concert at a rap show\nHit a back street and put the top up\nStopped at the light see some Girls watch 'em jock us\nI'm so roll with my electric top\nHit a button, ain't gotta get out, Touch with nuthin\nI'm Let the top And just lay down\nSlamming hard passing by the schools and the playgrounds\nEverybody knows when Short's in town\nCause I keep the beats thumping hella hard with my top down\n\nDrop the top\nJust drop the top\n\nGood times, these are the good times\nLeave your cares behind, these are the good times\n\nWe call 'em rags, you call 'em drops\nWhatever you call it just drop the top\nWe call 'em rags, you call 'em drops\nWhatever you call it just drop the top\n\nNine albums out, ain't changed my talk\nA thousands girls walked on I'm still a dogg\nAin't changed nuthing but That Ain't No Love\nStill riding through the hood all the homies say \"What's up?\"\nGive me my props cause I always rock\nAnd I still gets top But They Just Won't Stop\nStill smoking Indo getting burned out\nStill got the orange juice bottle full of gin 'bout to turn out\nA show, a smashed back to the O\nPut them Freaks on my beeper then pull some mo'\nCause we y'all straight bump than acne\nWhat can you learn that you just can't mack me?\nI'm off of Gin and Juice, don't even introduce\nIf you ain't with it back up cause I'm finna choose\nI want some freaks that could make me write a Freaky Tale\nDrawls back, Moving Pack, up in a hotel\nJust to say you got some Too Short\nYou wanna show some evidence, don't swallow don't spit\nCause I bust more nuts than a squirrel\nAnd my tape’s been in decks all around the world\nIf you had a copy of it and you asked the fan\n\"What's that?\" I bet you say, \"Too Short, Man\"\nI still taunt the fine girl and get shot down\nI say \"[edited],\" slam the beat, smash off with my top down\n\nJust riding with my top down\n\nGood times, these are the good times\nLeave your cares behind, these are the good times\n\nWe call 'em rags, you call 'em drops\nWhatever you call it just drop the top\nWe call 'em rags, you call 'em drops\nWhatever you call it just drop the top\n\nWe call 'em rags, you call 'em drops\nWhatever you call it just drop the top\nWe call 'em rags, you call 'em drops\nDrop The Drops!!\n\nWe rode the AC transit bus\nSelling joints for a dollar, smoking angel dust\nOn the way to a house party, a maybe delux\nSelling Too Short tapes, making some bucks\nLooking out the window at the Mustang and Falcon crew\nAsking myself \"How can you?\"\nRoll like the Giants down the foothill strip\nWith beats thumping top down Lovin' It\nSee I had to have drop, didn't care if I had a Volkswagon\nPick up the beat, had a Whole flaging\nSiding with the top down, lit like a lamp\nBlowing out the amp, trying to bump a tramp\nMost Players couldn't afford to have a drop top\nSo they got they get cut at the chop shop\nCouldn't tell fools nuthin way back then\nA lot of homies died or they went to the pen\nCouldn't even see the homie Short Bubble\nBank get fat and my whole account double\nWhen I walk in a club Girls say \"Ooh God\nIs that you Todd?\"\nMe and my homies just hoo-ride\nAnd take advantage of a life we never had\nStop eating cheese sandwiches, broke, living bad\nI'ma do it for my homies that's there in lock down\nRide with my beats slamming top down", "image": "https://images.genius.com/f7947ca6d18485b4713ba9c89b2980c7.800x800x1.jpg"}], "artist": "Too $hort"}