{"songs": [{"title": "Tough Guy", "album": "Weapons of Mass Destruction", "year": "2004-12-14", "lyrics": "[Intro: Busta Rhymes]\nAyo, it's the immaculate conception, Busta-Bus himself\nAnd nothin' other than the godfather, spectacular X-to-the-Zizzle\nThat's what the fuck it is, 'nough said\nYeah, yeah, yeah\nI wanna see you motherfuckers put your hands up\nStretch, bitch, like you doin' aerobics, motherfucker\nYeah\n\n[Chorus: Busta Rhymes]\nThought you was a tough guy?\nThen I put one right in ya head\nNow tell me what you think you is now\n(A top dollar biller, a Rottweiler, a killer\nSlap the shit out a nigga tryna copy my style)\n\n[Verse 1: Busta Rhymes]\nI got cars, many switches, many hoes and many bitches\nMany bodies that's buried in holes of many ditches\nMany, many homes, plenty chrome up on my whip\nPlenty stop for you\nMake me run up on your block and cock the semi\nReady, any nigga front, I hold it steady\nI cock back, pop the ratchet and spill your spaghetti\nProperties or blocks, we control 'em\nMany, many Glocks, know how I kill all your soldiers, Freddy\nMy machete will cut niggas like I ain't really like 'em\nThen carve a nigga meat deep like I'm killin' a bison\nTyson, animal instinct the way I will beat you\nGot many shots and plenty spots for them bullets to eat you\nSee-through, them holes them bullets'll leave in between you\nIt seems you got left to die slow all up inside the venue\n\n[Chorus: Busta Rhymes]\nThought you was a tough guy?\nThen I put one right in ya head\nNow tell me what you think you is now\n(A top dollar biller, a Rottweiler, a killer\nSlap the shit out a nigga tryna copy my style)\n\n[Verse 2: Xzibit]\nOrangutangin', slangin', I'm hangin' over the edge\nI rock two 40 Glocks, I call 'em Barney and Fred\nI stay hungry like I'm only fed water and bread\nThe king of the castle get at you, screamin' off with ya head\nBrutal Bust and Mr. X-to-the-Z, we chart climbin'\nYou see my name next to that diamond, it's all timin'\nHit you in the stomach with somethin'\nYour face and feet'll be touchin'\nI'll have your bones start crackin' and bustin'\nTo my women who be workin' them jeans with fat asses\nRich Itala heels, Roberto Cavali glasses\nCome to my hideout, let me pimp your ride out\nHit your backside, tear your spine out and slide out\nYeah, 'cause my grind don't quit\nI'm a walkin' franchise with them extra clips\nI keep the bankroll thick, do lines so sick\nThat you can cut 'em with a razor blade, sniff the shit, come on\n\n[Chorus: Busta Rhymes]\nThought you was a tough guy?\nThen I put one right in ya head\nNow tell me what you think you is now\n(A top dollar biller, a Rottweiler, a killer\nSlap the shit out a nigga tryna copy my style)\n\n[Verse 3: Busta Rhymes]\nI tell you, no lie\nBitch nigga, you gon' die\nKill or be killed or get bodied just because you walked by\nNigga be still 'fore the trigger go off and a shot fly\nAnd the shit'll be ill, if the shot turn your stomach to a pot pie\nNigga, we spill a lil liquor for the homie, muhfucka\nWe still'll make a nigga leak blood, 'til he need a refill\nYou tryna be a tough guy, and complicate what I build\nSomebody don't beat the shit out this muthafucka, we will\n\n[Verse 4: Xzibit]\nAsthmatic, dramatic, fold you like a Kraftmatic\nHeavy metal press hittin' your chest like a train wreck\nCommand respect, throw it one time for your set on deck\nNiggas you never forget\nI set up precedents, homie, you never snitch, hide the evidence\nDummies dig ditches, they dyin' for dead presidents\nThe big screen make 'em seem large like an elephant\nBut in real life, they so soft and so delicate\n\n[Chorus: Busta Rhymes]\nThought you was a tough guy?\nThen I put one right in ya head\nNow tell me what you think you is now\n(A top dollar biller, a Rottweiler, a killer\nSlap the shit out a nigga tryna copy my style)", "image": "https://images.genius.com/cebafeb87cd3844c18012605b852ac2b.500x500x1.jpg"}], "artist": "Xzibit"}