{"songs": [{"title": "What Can I Say", "album": "DIME TRAP", "year": "2018-10-05", "lyrics": "[Intro: Dave Chapelle]\nThis is OG season\nI'm your man, Dave Chapelle just shouting at everybody who went through it\nWho stayed the course, who held firm\nI don't know what to say, nigga, I don't know what to say\n\n[Chorus: T.I.]\nMan, what can I say?\nI was just another nigga from the town\nTryin' to find a way to get paid\nMan, what can I say? (What?)\nBig body, 100 thousand dollar car\nI pull up in new one, every day\nMan, what can I say?\nI'm getting too much cake for a safe\nMade way more money than mistakes\nMan, what can I say?\nWent from a young nigga to a whole great\nAll in a day's work\nMan, what can I say?\n\n[Verse 1: T.I.]\nMaybe, I should start with my first point\nStarted out selling weed in the shake joint\nI went from nothing to playing on a world tour\nWhat else could a Bankhead nigga ask for?\nI will respect a hustle if you earn from it\nA mistakes worth makin' if you can learn from it\nI knew the sun was for sure coming\nWhen a nigga called himself a killer but they nosey as an old woman\nWe had a problem, we just stole on him\nAnd nowadays niggas found a way but no one told on 'em\nHe got a dub, hope they give him some parole on it\nEverything glitter ain't got gold on it\nOkay, now, everybody know that we don't play around\nThat boy be pillow-talking, beware, what you say around him\nAnd Vera Wang and McQueen, I got nice things\nStarted serving these suckers 'round nineteen\nI don't give a damn 'bout what you think you might seen\nLook, you better clean your eyes, get some Visine\nWhat can I say that you have not seen\nBeen on a cannonball run at the bag going high speed\nStop at nothing if you're out for somethin'\nAnd my momma couch stuffed with stacks of hundreds\nSafe deposit box, it's for my childrens' colleges\nIf you ever start a business, you won't go to college\n\n[Chorus: T.I.]\nMan, what can I say?\nI was just another nigga from the town\nTryin' to find a way to get paid\nMan, what can I say? (What?)\nBig body, 100 thousand dollar car\nI pull up in new one, every day\nMan, what can I say?\nI'm getting too much cake for a safe\nMade way more money than mistakes\nMan, what can I say?\nWent from a young nigga to a whole great\nAll in a day's work\nMan, what can I say?\n\n[Post-Chorus: T.I.]\nYou can't talk to me, homie, I suggest you send your boss to me, homie\nMan, what can I say?\nIn the Dawn with the top down on it, ducking suckers tryna block my moment\nMan, what can I say?\nAnd you gon' be mad when I get her\nSad when you found out I hit her\nMan, what can I say?\nI promise, it don't get no realer\nForever, been a stand up nigga\nMan, what can I say?\n\n[Verse 2: T.I.]\nWalk it how you talk it, play it how it go\nLearn to peep a fuck nigga with your eyes closed\nLearn to turn your neighborhood from a eye sore\nThe real-estate people wanna come and buy more\nIn the trap, with a trap door\nIf the task force come, I'll be gone before you open that door\nGold bar buy 'em off shore\nWell, you can save yourself some money on the taxes but it cost more (What?)\nLawyer doing deals on the golf course\nYou catch a charge, they can get it tossed for you\nThrow it out, nevermind what the outcome is\nYou're missing game, how you listen with your mouth running\nI done forever had the South running\nWent to New York and hollered Bankhead, they respect where I'm comin'\nFrom, I don't give a damn, give me my money\nThe country niggas over there, shawty, I'm a southern\nDon't let nobody give you nothin' you ain't earn from 'em\n'Less you finessing for some bags and you swerve on 'em\nForever kickin' shit, you'd think a turd on me\nHow you come out your fuckin' face? You got some nerve, homie\nI'm only living for the rare moment\nLike the time you deliver for your kid, with your word on it\nWhen you the king and your reputation stay clean even when they try to throw dirt on it\n\n[Chorus: T.I.]\nMan, what can I say?\nI was just another nigga from the town\nTryin' to find a way to get paid\nMan, what can I say? (What?)\nBig body, 100 thousand dollar car\nI pull up in new one, every day\nMan, what can I say?\nI'm getting too much cake for safe\nMade way more money than a mistake\nMan, what can I say?\nWent from a young nigga to a whole great\nAll in a day's work\nMan, what can I say?\n\n[Post-Chorus: T.I.]\nYou can't talk to me, homie, I suggest you send your boss to me, homie\nMan, what can I say?\nIn the Dawn with the top down on it, ducking suckers tryna block my moment\nMan, what can I say?\nAnd you gon' be mad when I get her\nSad when you found out I hit her\nMan, what can I say?\nI promise, it don't get no realer\nForever, been a stand up nigga\nMan, what can I say?", "image": "https://images.genius.com/762209f629de50995145f116f95b5ea9.750x750x1.jpg"}], "artist": "T.I."}