{"songs": [{"title": "Marshall Mathers (Snippet)", "album": "The Marshall Mathers LP (Snippet Tape) ", "year": "2000-04-25", "lyrics": "[Intro]\nYou know I just don't get it\nLast year I was nobody, this year I'm selling records\nNow everybody wants to come around like I owe em something\nThe fuck you want from me, ten million dollars? Get the fuck outta here\n\n[Hook]\nYou see I'm just Marshall Mathers\nI'm just a regular guy, I don't know why all the fuss about me\nNobody ever gave a fuck before, all they did was doubt me\nNow everybody wanna run their mouth and try to take shots at me\n\n[Verse 1]\nYou might see me jogging, you might see me walking\nYou might see me walking a dead rottweiler dog\nWith its head chopped off in the park with a spiked collar\nHollering at him 'cause the son of a bitch won't quit barking\nOr leaning out a window with a cocked shotgun\nDriving up the block in the car that they shot Pac in\nLooking for Big's killers, dressing ridiculous\nBlue-and-red, like I don't see what the big deal is\nDouble barrel 12-gauge bigger than Chris Wallace\nPissed off cause Biggie and Pac just missed all this\nWatching all these cheap imitations get rich off 'em\nAnd get dollars that should've been theirs like they switched wallets\nAnd amidst all this Crist' popping and wrist watches\nI just sit back and just watch and just get nauseous\nAnd walk around with an empty bottle of Remy Martin\nStarting shit like some 26-year-old skinny Cartman (Goddamn it)\nAn anti-Backstreet and Ricky Martin\nWith instinct's to kill N'Sync, don't get me started\nThese fucking brats can't sing and Britney's garbage\nWhat is this bitch, retarded? Give me back my sixteen dollars\nAll I see is sissies in magazines smilin'\nWhatever happened to wiling out and being violent?\nWhatever happened to catching a good old-fashioned\nPassionate ass-whooping and getting your shoes, coat and your hat tooken\n\n[Bridge]\nNew Kids on the Block sucked a lot of dick\nBoy/girl groups make me sick\nAnd I can't wait 'til I catch all you faggots\nIn public, I'mma love it\n\n[Verse 2]\nVanilla Ice don't like me, said some shit in Vibe to spite me\nThen went and dyed his hair just like me\nA bunch of little kids wanna swear just...", "image": "https://images.genius.com/7592b9ffb6253a995347b497d73ac378.590x373x1.png"}], "artist": "Eminem"}