{"songs": [{"title": "I’m Pimpin’", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "{*sample in background: \"Sir Too $hort\"*}\n\n[Too $hort]\nAy... bitch! ...\n\nMy ho got the money for me\nI told her meet me at the spot, cause I wanted to see\nHow much she got from the tricks today\nIt's a normal thing for me to get paid\nAnd my hookers don't stand at the intersection\nThem tricks go surfin on the internet\nAnd then I count it that night, or maybe in the mornin\nI'm just another pimp from California\nOakland, up in the bay\nWe break new hoes in every day\nHow many hoes you got, don't ask tonight\nCause these hoes get turned out faster than lights\nI've been countin G's for days\nWho cares if she leaves or stays\nI get somethin for nothin, cause you wanna touch her\nHug her and love her, I get paid and say fuck her\n\n[Chorus]\nCause if I cain't get mine\nYou ain't gettin shit you better wait in line\nIf I cain't get mine\nYou ain't gettin shit you better wait in line\nCause I'm pimpin, pimpin, pimpin, pimpin\nI'm pimpin, pimpin, pimpin, I'm pimpin baby!\n\n[Too $hort]\nI got 16 prostitutes\nWhen it's time, I do what I gots to do\nI'm on the grind, for every nickel and dime\nI let a bitch get mine, and then I spit these rhymes\nNo it's not a freestyle, it's me\nI just wanna be wild and see\nHow the hoes start choosin when the pimps walk in\nShut your mouth up when a pimp's talk-in\nBeeatch, I know you heard\nI got the whole world sayin my favorite word\nI got your ex-girl layin in my bed, she's work\nSeen her at the club and she had to flirt\nI smoke the pert, I light it up\nYeah I'm a pimp but I like to fuck\nSexy lil' long-haired women\nBut I still let 'em know that I'm pimpin\n\n[Chorus]\n\n\"I'ma see if I can go catch me, a nice pretty young bitch\"\n{*phone rings*} \"Hold on, let me see what bitch that is\"\n\"Okay this the bitch here right now, y'knahmsayin?\"\n\"Hey bitch, what's happenin?  I already know what you fin' to say bitch\"\n\"Yeah bitch, yeah bitch, only thang you do bitch, is just go to work\nHandle my business, get my money, don't give me no problems, everythang gon' be alright\"", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}