{"songs": [{"title": "You Nasty", "album": "You Nasty", "year": null, "lyrics": "Beeyotch!!\nYou nasty, you nasty bitch\nThats what I said bitch (you nasty)\nI said you nasty (you nasty)\nFuck that shit, fuck you hoes (you nasty)\nFuck all y'all, man\n\nVerse 1:\nI used to get straight A's, read my books in Catholic school\nNow I find myself in the men's bathroom\nWith a top-notch, goin wild in the stall\nShe ain't even trippin cuz shes havin a ball\nI used to play with my toys in the back yard\nBut now I just walk around and act hard\nAlot of women like to be called a bitch\nI'll break it down so you understand all of it\nI always thought I was an educator\nI might not love her, but I never hate her\nShes the kind of girl to make your toes pop\nKeep ya wide open, never need nose drops\nNow yall wanna get mad at me\nFor talkin about another young, nasty freak\nIts life, its not a major catastrophe\nYou ain't a ho cuz you givin up the ass for free, you nasty\n\nI know why yall mad at me, I ain't break your heart girl (you nasty)\nMan, these bitches trippin (you nasty)\n\nVerse 2:\nToo many tight lil dresses with no panties on\nToo many females tryin to take a man home\nWhere your mommy and your daddy at?\nJust because a player got a cadillac\nYou wanna lay in the back, with your face in his lap\nAll you gotta do is taste that\nYou get to ride, get used all the time\nI ain't made the situation I just made the rhyme\nAdapt to my surroundings, look around\nNothin but pimps, tricks, and hookers found\nIn the Town, if you ain't one you the other\nI ain't fooled, what you gonna do to a brother\nLookin at me, like you wanna eat me\nDidn't even have to use words to meet me\nNow we havin sex and I forgot your name\nYou just a hot thang, nothin can't stop your game, cuz you nasty\n\nI already fucked you (you nasty)\nI dont know why you trippin (you nasty)\nI told yall I was gonna call you (you nasty)\nAfter awhile\n\nVerse 3:\nI understand where your anger comes from\nCuz Ive been talkin bad on the mic since day one\nNever took the time to explain myself\nBut keepin it real is somethin I can't help\nI know some real women, I know some real hoes\nAnd male-bashing songs, I dont feel those\nBut I'm glad you bi-sexual women came out\nDont tell em what we did and keep my name out your mouth\nIf it wasn't for the groupies or for the oral sex they gave me\nI'd treat you all like ladies\nIm just a victim of society\nLook me in my eyes and dont lie to me\nYou ever had a one-night stand and go to church the next day?\nA full night of play, wake up and pray\nWishin you could stay, but you caint'\nOh you a good girl today? You ain't no saint, you nasty\n\nOh yeah I know I fucked you too (you nasty)\nYou know what Im talkin bout?\nYou need to take this muthafuckin opportunity\nAnd have some big fun (you nasty)\nI got some drinkin in the kitchen baby (you nasty)\nMy niggas comin through (you nasty)\nOh, its cool girl (you nasty)\nWe gon' work this shit out, beeyotch!\nI ain't mad at yall\nI ain't mad at you\nShit, I ain't mad\nCuz you nasty", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}