{"songs": [{"title": "You Be Killin’ ’Em (Remix)", "album": null, "year": null, "lyrics": "(Verse 1)\n\nI said shawty mind clear with the jewels drippin' off em\nShe say I be killin' em\nI say get a coffin\nStuntin I be often\nThey like \"What it cost him?\"\nWhole team fulla green you would think we Boston\nSwollen, Ballin\nFlow be on the faucet\nMiddle man shut yo damn mouth call a boss in\nBig money on the table nigga why you talkin\nBlack and yellow 'maro, murder scene, caution\nTape, scrape, all I get is hate\nChillin' in the mansion, all you see is gate\nShe say that I'm handsome she thinking 'bout a date\nBut I'm just tryna take her home I'm thinking bout a \"safe\"\nI was just booked they had me bidding in the pen house\nCouple months later now I'm sittin in the penthouse\nBitches fuckin' everywhere you thinking it's a pimphouse\nEngineer lookin' when that boy gon' pull his pen out\nNo pen no pad\nThis shit so sad\nDippin in the Aston\nThis bitch so fast\nThis bitch so bad\nI treat her so nice\nI came so fast\nI had to go twice\nRob me, no dice\nBetter get your dope slice\nPuffin on the diesel gettin higher than the coke price\nNigga, you a rat, you a talkin to them folks type\nI'm more like the bull that could get 'em by the bow type\nThis be- homicide\nAll black whipped you would think it's on my side\nI'mma get money laid back kinda guy\nIf you dead broke, nigga why you mindin mine?\nYah, you gettin paid for this shit?\nI dont needa see the work I'm gettin paid by the bricks\nCiroc and lemonade in the shade with your bitch\nShe sent you straight to the voicemail\nShame on your bitch\n\n(Chorus)\nYou wussup girl\nI gotta ask you\nIf you suckin would you eat the nut?\nCashews\nI'm countin money so you know I'm good at math boo\nShe frontin' on you tryna cover up yo' tattoos\nGirl why you killin him?\nShe tryna go at me\nI'm tellin' her to deal with him\nAnd if you notice me\nThen you will see some will in him\nRocks in the bezzle\nBigger then some M&m's, HA!\n\n(Verse 2)\n\nHigh school I was ballin, Reese Rice\n....................................\nI hustle all day I don't even eat right\nCause Im just tryna get a ticket no police light\nThat's a milli bitch\nI'm on that Philly shit\nAnd I'm just tryna make a movie like I'm Willy Smith\nCome to my hood, show you how real it gets\nNiggas thats padlocked tell you that they feelin this\n\n(Outro)\n\nIt's Meek Milli bitch!\nPhilly!\nI swear to god\nAin't no competion and I dont even own a composition\nYou wassup girl, I gotta ask you, if you suckin\nWould you eat the nut?\nCashews! Haha!\nReal talk though, no pen no pad flow\nShit is so sad tho\nIt's your boy Meek Milli signin' the fuck out\nWe make movies- bitch!", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}