{"songs": [{"title": "Stuntin", "album": null, "year": null, "lyrics": "Gucci on 8s, 4s, deuces and sixes\n30s, deuces, 34s ya trippin\nBlowing horse ashantis\nFugates, bugattis, for ones, lambs\n\n[Verse 1: Gucci]\nMan I'm always stuntin, my money makin money\nIf I throw the dueces at ya then I showed yo ass a hundred\nMy soldiers are blunted, yo soldiers ain't nuthin\nWe'll put ya forehead in yo ass or put your hairline in yo stomach\nI'm ridin on gary coleman I'm rich like mr. truman\nWhatchu doin willis? I say tryna make some money\nI'm traveling around the country, I'm touring foreign countries\nI'm drivin foreign cars and I'm knockin foreign honeys\nA birthday bash in Belgium and a Sunday show in London\nI chill like Lauren London in my johnson is a luncheon\nShe say she got the munchies I'm a try to have a contest\nSee who has the fattest ass we'll see who go the hardest\nU better wear a hard hat cause these bitches out here stuntin\nSay they aspiration was to be a baby mama\nMaybe get a baby hummer not on me lil mama\nI ball out through the winter and I stunt all through the summer\nGucci Gucci!\n\n[Hook]\nI'mma stunt this summer, I'mma roll me a cup then stunt in front ya\nRoll me a blunt cut the trunk up homie, then I stunt on homie\n\n[Verse 2: Tracy T]\nGucci Gucci all summer, Louis all summer\nI'm a I'm a stunt cause I just made me bout a 100\nSee the white charm? And see the necklace?\nWith no muscle, dat dude be flexin\nI'm a got to Lenox, I'm a go to Saks\nCause I turned that 10 piece into like a 20 pack\nMy gun enormous, my suit like the hornet\nNone not gon mind to drive it was just parked em\nI'm a stunt I'm a stunt cause I got money\nCrack rock I can turn a thug into a junkie\nBitches I can get em with no problem and it's nothing\nTold her I'm a stunt, I can get you out that Honda\n9 millie, 40 cal, 4 5 dumper\nFor them niggas hating when a young nigga be stuntin\nStunt in front of em, stunt on homie\nNigga I'm a stunt stunt stunt...\n\n[Hook]\nI'mma stunt this summer, I'mma roll me a cup then stunt in front ya\nRoll me a blunt cut the trunk up homie, then I stunt on homie]\n\n[Verse 3: Gucci]\nGucci got it, Gucci got it\nBut you know nothing about it\nU still stuck in the projects with no money in yo pocket\nI seen you at the party, u still ain't got no car yet?\nU passenger seat of yo homeboy car, boy that's his main bitch\nMan that's some deep shit, some will say weak shit\nYo bitch pussy so deep, it make a nigga seasick\nLarty's on fugates, lowy's on the mazze\nVette on Ashantis, bitches in the party\nBitches in the lobby, we kickin just like sake\nBenihana sake sake monotoly backe\nGucci Gucci Gucci mane or call me Gucci race\nDa million dollar man, call me Gucci deveoci\n72 cutlass 350 rocket, so much money wish I had 50 pockets\n72 cutlass 350 rocket, so many pockets, so many gualas gualas", "image": "https://images.genius.com/6f0a4980c8ef838036229e1d4dcd036c.408x408x1.jpg"}], "artist": "Gucci Mane"}