{"songs": [{"title": "We Ain’t Them", "album": "Royalty", "year": "2012-05-16", "lyrics": "[Verse]\nPickin' out my fro with my fist comb\nI got a tab at the Stone baby, this long\nMy little brother was havin' a little trouble\nI hope that he doesn't care that it's in this song\nKoreatown lunchin', talkin' 'bout how to run things\nHe said Atlanta wanted somethin'\nWaka, Jeezy, and Future got the streets locked down\nCopycats making sure T.I.P. keep that crown\nI'm fucking 'round with the truth, went to see The Roots\nQuest brought me back on stage in a suit\nI went hard 'cause niggas say that I'm soft\nEven Black Thought thought I maimed it a little hard, I gotta be honest\nFeelin' like the other stuff is kinda behind us\nMakin' jokes here and there done got us some dollars\nI'm tryna show the whole world what it is and it ain't a game\nHe said \"Homie, stay the course, ain't shit changed\nWeird night and everybody was tipsy\nHangin' out with Questlove reminiscin' 'bout Whitney\nHe like, \"Man, we can't even make it to 50?!\"\nThat reminds me, I sent a long text message to my mom and pop\nI got the same speech when I left 30 Rock\nMy mom like, \"Why you wanna leave a good job?\"\nMy dad like, \"Do your thing, boy, don't stop\"\nShout out to my nigga Lud, shout out to my nigga Swank\nFor hangin' at the crib and telling me what you think\nSpeak from your heart and never compromise what you feel is real\nAnd never let these white people tell you how to feel\nNever let anybody tell you how to feel\nI wanted what they had back in the fourth grade\nFamily vacays, you know I did it all\nJust to see my little sis by a waterfall\nMy great granddad bought his own freedom\nWalk barefoot to Virginia to start his own peanut farm\nSo don't be alarmed, man, I'm royalty\nJam of the week, V103\nNo cosign, no bovine\nMore swag, pull back on the punchlines\nStarvin', every track means lunch time\nHuh, I'm a star, how could I not shine?\nFuck boys chase hype and scrat chicks\nAnd niggas who stopped textin' after 1.6\nDG Lover ain't nothin' to fuck wit'\nD-Money ain't nothin' to fuck wit'\nAnd what's a leader if he isn't reluctant?\nToo bad for y'all, I'm blastin' off\nI'm not Asher Roth, I don't sleep on my bread\nDick riders stay close, I might flash a ball\nSometimes, all this shit make a nigga feel guilty\nI used to sleep with them roaches\nBack of my mind though, I hope the show gets canceled\nMaybe then I can focus\nHawaii touch down, go ahead baby, put your shades on\nEast Side! East Side to the gravestone!\nBrown liquor, but my girl in Bed-Stuy\nNigga, you got Drive like a sale at Best Buy, uh\nHold up, hold up, we can do better\nPut my voice on the track, man, that shit is much wetter\nAt the studio at 8 AM\nHit the booth then eat, nigga, we ain't them, nigga, we ain't them!\nDrop a line, it's your Facebook status\nSaid that shit about a week ago, you still mad at us\nIf there's something on your chest, nigga, let it out\n'Cause I'm the best, da-da-da", "image": "https://images.genius.com/587833871590a682c8aed1b739f0cb23.906x905x1.jpg"}], "artist": "Childish Gambino"}