{"songs": [{"title": "I’m Serious (Remix)", "album": "I’m Serious", "year": "2001-10-09", "lyrics": "[Talking]\nThis some of that Ghet-O-Vision shit man\nFUCK these niggas, WHAT! WHAT! WHAT!\n\n(C'mon, c'mon, c'mon) yeah\n(C'mon, c'mon, c'mon) yeah, uhh\nSerious mayne... (yeah)\nThis shit gets serious mayne... (I'm tellin ya shawty)\nSerious mayne... (ah ah, ya ya yea)\nThis shit gets serious mayne... (ah ah, ya ya yea)\nSerious mayne (ah c'mon, ah ya ya yea)\nThis shit gets serious mayne (aight, let's do it shawty tell 'em)\n\n[Hook] - 2X\nATTENTION!!! - Let's get serious mayne!\nATTENTION!!! - Let's get serious mayne!\nATTENTION!!! - Let's get serious mayne!\nATTENTION!!! - Ah wha-wha ah what WHAAAT!\n\n[T.I.]\nI'm goin in with funny niggas in the A\nThe killas with the case, and now the niggas with the yay\nAll my niggas, where ya stay?\nWestside to Decatur, ah hey-ya, fuck ya wooden eight\nI lay you down if I got a thirty-shot in my Impala\nI'm a 3rd bred Bankhead, Roll Park scholar\nHouse with no father, school - why bother?\nThat's why I call myself the King of the South\nWell nigga, ah you don't want what I'm break out the house\nAh so I, strongly suggest you keep my name out ya mouth\nBefore I, be in ya house tapin ya spouse to the couch\nAnd put a, hole in her blouse, I don't play young nigga\nRemember me from back in the day young nigga\nOne more thing, fuck what you done heard 'bout Atlanta\nWe finna break the standards, rubber bands instead of platinum\nI'm a hustler, not a rapper\nWe gangstas, y'all some actors\nWe finna turn this chapter, your spot is what I'm after\nI'm serious!!\n\n[Hook] - 2X\n\n[J-Bo]\nSee I got the answers to all ya quest-ions (come on)\nFrom A-B to C, best learn your less-ons (-ons...)\nCuz I'm so damn serious, it'll leave yo' ass stunned\nIn the back and we packin on all who flex-un\nLike Redrum, it's bloody and ugly, who want some?\nNow put your middle fingers up until it's all done (it's all done)\nCuz we ain't takin much of nothin but bash-un\nOn all who attempt, intentions we blast-un\n\n[Sean Paul]\nI gut 'em, I roll 'em, I smoke 'em, and I pass 'em\nI serve 'em, deliver, walk up on 'em and blast 'em\nI'm strong but my niggas, I'm takin they cash home\nThen hit the track and get rid of the whole bomb\nCuz I'm serious nigga, you gon' feel this nigga\nGot a, trunk full of work, how you gon' kill this nigga?\nMy niggas givin out bricks, we can build this nigga\nIf all fail we can 1-0-5 grill this nigga\nI'm dead serious\n\n[Hook] - 2X\n\n[Pastor Troy]\nS-E-R-I-O (uh-huh) U-S (uh-huh) I'm fresh (c'mon)\nOne of the best (uh-huh) there are a couple (c'mon)\nWe did this song last night, I gave 'em trouble (uh-huh)\nJumped in my shuttle (uh-huh) and hauled ass (c'mon)\nUp 85 (yea) with Daytons (c'mon)\nYou wanna blast (c'mon) come get yo' cannon (c'mon)\nI bet I'll leave yo' punk-ass, where ya standin (uh-huh)\nWhile you were plannin (c'mon) see I had plottin (uh-huh)\nYou saw the smoke ho, hell yeah I shot it (damn right)\nI'm bustin rockets screamin, \"Die nigga, die!\" (die nigga)\nDont' fuck with D.S.G.B. or T.I. (c'mon)\nDo you know why, I don't fuck with nobody? (yeah)\nThe same shit, that fucked up John Gotti (yeah)\nThese niggas watch me, but they don't wanna fuck with us (yeah)\nWe makin 'em hush, we dead-ass serious!\n\n[Hook] - 4X\n\n[Lil Jon Talking]\nYEEAH!!\nIt's motherfuckin serious in this motherfucker, knahmtalkinbout\nI'mma tell y'all niggas like this here (whassup whassup)\nIf it's too hot for yo' ass (uh-huh)\nGet the fuck out the motherfuckin kitchen\nKnamtalkinbout (getcha ass out)\nThe boy Lil' Jon, doin this shit with my nigga T.I.!\nGhet-O-Vision, Youngbloodz (Ghet-O-Vison ho!)\nThat boy Pastor Troy (old Troy)\nIt's serious mayne (serious)\nThis shit motherfuckin serious.. (it serious bitch)\nIn the south niggas, they get motherfuckin serious (real serious)\nWe out this bitch... holla...", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg"}], "artist": "T.I."}