{"songs": [{"title": "Diesel", "album": null, "year": null, "lyrics": "[Raekwon the Chef]\n\nSo yo yo all I want to do is just tell them cats\n\nOn the real, keep your game high man, keep it up\n\nWord up, never stop your goals man, yaknowhatI'msayin?\n\n(For real baby)\n\nAnd, yo son, on the real I'ma get a sneaker just like y'all\n\n[Ol Dirty Bastard]\n\nI need help Because the black man is God\n\nThe government is after me And the worst is, black man is the Devil\n\nI need help So this is to bring everything in the\n\nSomeone help me please universe within the light\n\nSomeone help me! Understanding\n\nThey already did 2Pac My children, all six billion humans\n\nBiggie Smalls on the planet Earth\n\nSomeone help me! Regardless of who or what, I love you\n\nSomeone help me please! Word is bond, I love you\n\nAhh! I'ma groupie for life, about nine wife\n\nAll the babies are mine, save a child life\n\nNo more doctors deliverin my babies\n\nStick in pins killing me slowly\n\nTo the President you say I'm a welfare fraud\n\nYou motherfucking right! Let's burn this dark house white!\n\nInsecure about my ding-dong, married to Babylon\n\nMy queen lookin at me like a pawn!\n\n[Raekwon the Chef]\n\nSplash the worst rehearse a verse Flashdance on the universe\n\nTelevise the work Network Shop til your neck hurt\n\nWhattup Dirt, nine diagram phoenix on your sweatshirt\n\nThirty-thousand went bezerk, it's like clockwork\n\nRockport Mr. Raw God, hold the fort\n\nCollect thoughts, elect sports, sideswipe, by the white horse\n\nFrench cut, gleamin in the Benz truck, whattup\n\nTellin my mens what? Ten times platinum and we ends up\n\nDraped out, jumpin out a cake, now throw your tape out\n\nFurniture style, holdin the mic we got it laid out\n\nMind iodine Einstein remind mine\n\nPeople swam nine didn't know they own kind wrong time\n\nDenim rap, competition quick, handle that\n\nSuckin the jim hat, pervertin on my raps'll get you slidapped\n\nMix drink Cuban Link lizink, flip a to zinc\n\nPlus, expensive like a roman mink, now think\n\n[Ol Dirty Bastard]\n\nAn ugly thirty-six chamber degree, what, you want to rhyme?\n\nDeep bring 600 ABC through the love white hate line\n\nI'm telling you tornado, 42 billion thought travel\n\nThe year 90's parallel, controls to the wakes\n\nI dig woman's stomach swell, my borough is dark\n\nMany lights UFO kites, Benjamin Franklin got it right\n\nAbraham I stuck your cherry tree\n\nYour white head came out my black pussy\n\nI ran Rip Van Winkle on all fours\n\nMountains twinkle twinkle star, Tarzan in a jar\n\nAnd then came out Jane Flintstone in my gravel pit\n\n[Method Man]\n\nKill the chatterin, niggas bust shots, keep em scatterin\n\nBlood splatterin, on point like a javelin\n\nFuck battlin, you cats is only good for babblin\n\nImaginin yourself, as the God space travellin\n\nRound the seven rings of Saturn\n\nGot my sword plus the Abbot in the chamber, nine in the clip\n\nAt the gatherin, we left you staggerin, yo it had to been\n\nHot Nickel, who broke bread, at the Vatican\n\nStick a pin, in a citizen, mental food, got us diggin in\n\nMy compliments to the chef\n\nM-E-TH like amphatimens, yes stick it to the veteran\n\nBlaow blaow! Blown to death, take your medicines\n\nI put the sick in your mu-sick with Osirus\n\nBound to blow like a bad sinus\n\n[Ol Dirty Bastard]\n\nStay up at night don't sleep on your morn\n\nRest in the day because it's sunlight\n\nReverse thought psychology\n\n[Prince Rakeem]\n\nChild wild adventures walk trillions of square inches\n\nTen percentage try to drain me of my mental strengthage\n\nHeavy wattage knowledge cleans blood clottage, and retardage\n\nI refine the garbage logic exterminate your cottage\n\n[U-God]\n\nThirty-six anger, dirty language is the stranger\n\nThe mangler, the honor roll singer righteous finger\n\nWhen we shine-a, we always find a never minor major\n\nHard to spot we dangerous with our behavior\n\n[Prince Rakeem]\n\nAustralian Venezuelaen illegal aliens\n\nChameleons all catch the feelings we revealing\n\nKiller bee keep your mind at ease, lay back like Adam fuckin Eve\n\nFour thousand years in the garden, puffin trees\n\n[U-God]\n\nI aim slang I maintain, through the main vein\n\nThe answer came clever, when we do greatness through trial and error\n\nMile of terror motormouth, let the odor out\n\nFumin greater, the temper in my spine huminator\n\nThe super grass childish blast sleepy eye stash\n\nThe hashish masterpiece, Osirus is the virus\n\nThis split second splash, severe drop is near pop\n\nThere's fallin teardrops, now is it worth your career?", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}