{"songs": [{"title": "Love Game", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Produced by Rick Rubin]\n\n[Verse 1: Eminem]\nSomething's burnin', I can't figure out what (out what)\nIt's either lust or a cloud of dust\nJudgement is clouded; must\nJust be the powder from the power of (love)\nBut I'm in something I don't know how to get out of\nLeft my girl in the house alone\nIs that my soon-to-be-spouse’s moan?\nAnd the further I walk, the louder\nPause for a minute to make certain that's what I heard\n‘Cause after all, this is her place\nSo I give her the benefit of the doubt, I\nThink I might be about to bust her, bust her\nThe thought's scary, yo, though and it hurts—brace!\nHope it ain't, \"Here we go, yo!\"\n‘Cause my head already goes to worst-case\nScenario, though in the first place\nBut you confirmed my low-end theory though\nShould've known when I made it all the way to third base\nAnd that was only the first date\nCould've made it to home plate\nBut you slid straight for the dome and dove face first\n\"No, (*slurp*) you don't (*slurp*) under— (*slurp*) —stand, (*slurp*)\nI (*slurp*) don't (*slurp*) do this for (*hic*) anyone, (*hic*) ever (*slurp*).\"\nYeah, that ain't what they all say?\nI'll say, you can suck a softball through a straw\nUsed to be my fiancé\n'Til you sucked on Wayne, André, and Kanye\nLeBron, Akon, Jay, Lil Jon, Raekwon, Ma$e\nPolow da Don, Dre, Dante Ross, James Conway, Kwamé\nGuess I'm gettin' my g-goddang Jigga on, eh?\n‘Cause your name, I'm beyond sayin'\nBut fuck it, I'm movin' on, you women are all cray\nBut I'll probably always keep on playin' the—\n\n[Bridge: Wayne Fontana]\nGame of love, love, love, love\nLa-la-la-la-la love\n\n[Chorus: Kendrick Lamar]\nShe doesn't love me, no, she don't love me no more\nShe hates my company, guess she don't love me no more\nI tried to get her up out of my head, left my bags at the door\nShe screamed she loved me like she never did before\nAnd I told her, \"Go where you wanna!\nGo do whatcha wanna do, I don't care!\"\nAnd I told her, \"Go where you wanna!\nGo do whatcha wanna do, I don't care!\"\n\n[Verse 2: Kendrick Lamar]\nI told that bitch, \"I'm a sucker for love, you a sucker for dick.\"\nSuckin' dick in your mama tub, then your granny walked in\nTold the stupid nigga to duck under the water\nHe drowned, like an abortion\nThey booked you for manslaughter\nYou beat the case and I called ya\n\"Sherane is not available now, leave a message at the tone\nAnd Kendrick, don't forget to buy two pair of those\nExpensive heels, you little fuckin' Ferris wheel\nFuckin' spinnin' on me—fuck you think, we gon' get married still?\nFuckin' Mary had a little lamb, this ain't no fairy tale\nFairy godmama better tell you how I fuckin' feel\nLike you should fuckin' beat it\nOr fuckin' eat it while I'm on my period\nNow have a blessed day.\" (*Phone hangs up*) Bitch, you serious?\nI'm in the mirror with this look on my face, curious\nWhy you ain't fuckin' with me, you cut me deep as Caesarean\nYou know I want you bad as a Benjamin, I'm delirious\nI want you bad as the head shattered on George Zimmerman\nAfter the Dillinger hit him diligently and killin' him\nHis mouthpiece for a Cadillac emblem\nThat's analogy and metaphor for you\nI should win a medal for all the ways I adore you\nThis is me talkin' cordial, yeah, I got some home training\nThat ain't what you like, ain't it?\nWhat about if I was as famous as Marshall?\nWould you give fellatio in the carpool?\nCops pull us over, they just wanna know if you gargle\nSingin', \"I hope she's good enough\nMeanwhile you're chasin' her\"\nChlamydia couldn't even get rid of her\nPity the fool and pity the fool in me, I'ma live with the—\n\n[Bridge: Wayne Fontana]\nGame of love, love, love, love\nLa-la-la-la-la love\n\n[Chorus: Kendrick Lamar (with Eminem)]\n(She doesn't love me, no, she don't love me no more)\n(She hates my company, guess she don't love me no more)\nI tried to get her up out of my head, left my bags at the door\nShe screamed she loved me like she never did before\nAnd I told her, \"Go where you wanna!\nGo do whatcha wanna do, I don't care!\"\nAnd I told her, \"Go where you wanna!\nGo do whatcha wanna do, I don't care!\"\n\n[Verse 3: Eminem]\nSo needless to say I'm feelin' betrayed\nSnatch my house key off her key chain\nShe jumps off Wee-Bey from The Wire's dick\nNow she's chasin' me with a cheese grater\nHere goes that broken record cliché\nIt's all my fault anyway, she's turnin' the tables, I'm a beat-break\nShe treats my face like Serato, she cuts and scratches like a DJ\nEach day is an Instant Replay\nThey say what we display is symptomatic of addict behavior\nBack together, but forgot today was her B-day\nShe cut me off on the freeway\nSimple misunderstanding, but just as I went to slam on the brakes\nThat's when I realized that she may be crazy as me, wait\nBitch cut my fuckin' brakeline\nStepped on them fuckers eight times\nStill goin' 73, thank God there's an exit comin' up\nWhat the mother-F-U-C-K's wrong with her?\nHit the off ramp 'til I coasted to a goshdamn halt\nHit a fuckin' tree, now here she comes at full speed\nShe's racin' at me, okay, you wanna fuck with me, eh?\nSnatch that bitch out her car through the window\nShe screamin', I body slam her on the cement\nUntil the concrete gave and created a sinkhole\nBuried the stink ho in it, then paid to have the street repaved\n(The fuck?) Woke up in a dream state\nIn a cold sweat like I got hit with a freeze ray during a heat wave\nGuess I eventually caved though, ‘cause she's layin' next to me in bed—directly aimin' a gat at my head!\nWoke up again and jumped up\nLike, \"Fuck it! I've had it, I'm checkin' into rehab.\"\nI confess I'm a static addict, I guess that's why I'm so clingy\nEvery girl I've ever had either says I got too much baggage\nOr I'm too fuckin' dramatic\nMan, what the fuck is the matter? I'm just a fuckin' romantic\nI fuckin' love you, you fuckin' bitch!\nCombative, possessive, in fact last time I was mad at an ex\nI actually set off a chain reaction of tragic events\nI said, \"Hit the road\", then after she left\nI sent that bitch a text that said, \"Be careful driving\nDon't read this and have an accident\"\nShe glanced to look at it and wrecked (*Car crashes*)\nToo bad, thought we had a connect\nNo sense dwelling makes, never been a more compelling case\nThan the model covered in L'Oréal and mace\nWho fell from grace 11 stories for storytellin'\nWhile the whore was yellin', \"Rape!\"\n'Til her vocal cords were swellin'\nAnd her voice were more hoarser than Tori Spellings' face\nStill they swarm the gates of my fancy estates\nTo greet Norman Bates with a warm embrace\n'Less you're Andrea Yates, don't ask me for a date though\nYou're late, well, the sentiment's great\nBut wait, think there's been a mistake\nYou wanted an intimate date, I wanna intimidate\nI have infinite hate in my blood\nIt's mainly 'cause of the game of— (*Message sound*)\nWait, \"dinner at eight\"? I have infinite hate in my blood\nIt's mainly 'cause of the—\n\n[Outro: Wayne Fontana]\nGame of love, love, love, love\nLa-la-la-la-la love", "image": "https://images.genius.com/2c354260f9edc6b2e9bf6b06c935a0b8.1000x1000x1.png"}], "artist": "Eminem"}