{"songs": [{"title": "Gangsta Gangsta", "album": "Straight Outta Compton: N.W.A 10th Anniversary Tribute ", "year": null, "lyrics": "[Intro: Eddie Talking]\nThis is a service public announcement\nIt's goin' out to all the paper haters\nNow sure sure sure your broke, sure sure sure your havin' problems\nFood stamps didn't come on time and the lights have been cut off\nBut look here\n\n[Snoop Doggy Dogg]\nHere's a little somethin' about a nigga like me \"What's that?\"\nI never should have been let out the penitentiary\nSnoop Dogg, would like to say\nThat I'mma crazy mothafucker when I'm playin' with my A.K\nSince I was a youth, I smoked weed out\nNow I'm that mothafucker y'all read about\nSmokin' you and your crew, takin' a life or two\nYou don't like how I'm livin, well fuck you\nThis is my gang, nigga, No Limit\nMy nigga C will fuck you up in a minute\nWith the pow pow, bang bang (*gun shots*) and you're dead\nAnd then we stamp that Tank on your forehead\nEvery where we go they say \"DAMN\"\nThem gangsters, they be fuckin' up the program\nAnd then you realize we don't care\nWe don't just say no, we to busy sayin' yeaaaahhhhhh\nAbout drinkin' straight out the seven bottle\nDo I look like a mothafuckin' role model?\nTo a kid lookin' up to me\nShit, life ain't nothin' but weed and money\nShit, I'm that type of nigga that's quick to blast\nFuck with me or C and I'll put my foot in your ass\nI don't give a fuck cause I keep sellin'\nYo, what the fuck are the yellin?\n\n[Hook: Snoop Doggy Dogg]\n\"Gangsta Gangsta\" that's what they're yellin'\nNiggas livin' rowdy and stay bout it, bout it\n\"Gangsta Gangsta\" that's what they're sellin'\nThe bitches want to buy it, cause they love that straight G shit\n\n\"Gangsta Gangsta\" that's what they're yellin'\nNiggas livin' rowdy and stay bout it, bout it\n\"Gangsta Gangsta\" that's what they're sellin'\nThe bitches straight buyin' it, cause they love that straight G shit\n\n[Snoop Doggy Dogg]\nHomies all standin' around just hangin'\nSome dope dealin, some gang bangin' \"what up nigga?\"\nWe decide to roll a week deep\nSeen a nigga on Dayton so we creep\nReal slow, and before you know\nI had my double pointin' at his window\nHe got scared and hit the gas \"Damn\"\nRight then, I knew I had to smoke his ass\nHe kept rollin, I jumped in the bucket\nWe couldn't catch him, so I said fuck it\nThen we headed right back to Snukes\nSweatin' all the bitches in the Daisy Dukes\nWe couldn't no play, from the ladies\nWith seven niggas in a Navs, bitch you crazy?\nShe was scared and it was showin'\nSo we all said \"FucK YOU Bitch\" and kept rollin'\nTo the hood, now we was fin to\nFind somethin' else to get into\nLike some pussy, or in fact\nGettin' rowdy, shit but we call it rat pack\nOn a nigga follow nothin' at all\nSnoop Dogg gets ignorant when I'm fuckin' with my Tank dogs\nI might stumble and still won't lose\nNow I'm draped in my gangsta blues\nCause I'm the type of nigga that's quick to blast\nFuck with me or C and I'll blast your ass\nSee, I don't give a fuck cause I keep bailin'\nYo, what the fuck are they yellin?\n\n[Hook: Snoop Doggy Dogg]\n\"Gangsta Gangsta\" that's what they're yellin'\nNiggas livin' rowdy and stay bout it, bout it\n\"Gangsta Gangsta\" that's what they're sellin'\nThe bitches want to buy it, cause they love that straight G shit\n\n[Break: Snoop Doggy Dogg]\nHold.. hold on Craig, B cut that shit man\nMothafuck that man, we need some gangsta in this motherfucker\nSome of that South shit, you know what I'm sayin?\nSome of that shit from the thiz-ird source, you heard me?\n\nHere's another gangsta down to ride\nA T-shirt and Levi's is his only disguise\nHe represents the Tank, yet hard to hit\nSnoop Dogg and C-Murder with this gangsta shit\n\n[C-Murder]\nWell, I'm C-Murder the one he talkin' about\nNigga tried to play me close and got punched in the mouth\nFed's tried to get me, you know they some haters\nI said \"See you later\" jumped in the Navigator\nWith the $50's in the back, with the Navy blue top\nTrue niggas on the scene with the triple beam\nCause I'm the C fool, I slang and Snoop bang\nAnd I'll smoke a mothafucker like it ain't no thing\nTo all my bitches, I know your jockin' my crew\n\"We want to fuck you C\"\nI want to fuck you too\nYou see, No Limit niggas don't take no shit\nSo let me tell you motherfuckers who you fuckin' with\nCause I'm the kind of nigga that's quick to blast\nIf you fuck with me, I'mma smoke your ass\nI don't give a fuck cause No Limit stay sellin'\nNow tell me, what the fuck are they yellin?\n\n[Hook: Snoop Doggy Dogg]\n\"Gangsta Gangsta\" that's what they're yellin'\nNiggas livin' rowdy and stay bout it, bout it\n\"Gangsta Gangsta\" that's what they're sellin'\nThe bitches want to buy it, cause they love that straight G shit\n\n[Outro: Eddie Talking]\nIf you would just stayed down and been the motherfuckers real partner\nYou wouldn't have had that problem\nBut seein, as you want to jump ship and you thought the ship would sink\nA motherfucker without turnin' into a submarine\nWent under water came back up with a periscope lookin' at your bitch ass\nNow, you have no paper, and now you're on a paper caper\nNow, you comin' up to my face and you're sayin: Hey can I hang out?\nI say: No cause you ain't got no clout, bitch get out\nNow, I'm tired of all these silly ass mothafuckin' paper chasin' whores\nUhh, this has been a public service announcement from No Limit Records\nAnd the Doggy Dogg world", "image": "https://images.genius.com/929cacd7483396413e8968b427318292.968x968x1.jpg"}], "artist": "Snoop Dogg"}