{"songs": [{"title": "Soldier’s Story", "album": "Rock City (Version 2.0)", "year": "1999-12-14", "lyrics": "[Verse 1]\nUgh ugh, what up Reef?\nYo, I'm horse-backin' the drum from the kick to the snare\nGet them shits in the air, the shit is fixin' to flare\nSpit on a beat, wrap it and ship it\nPut it out, shit on the streets, that's me\nBust you in your shit and tell you don't you ever, that's me\nI need respect, don't you better, that's me\nChrome beretta, in the waist line of my own get up\nI'm goin' and still goin', that's me\nYou hear a pop, see a drop, I'm comin', that's me\nWhen everybody on your block is runnin', that's me\nWith the rocks that can block the sun in\nThe Glock that I got a box it come in\nI'm like the fear that Biggie and Pac is comin'\nThe reason why them baller boys cop them onions, that's me\nFive to the Nine, dew-rag be tied to the side\nYou can either ride wit' it or die\n\n[Chorus]\nThere, now you know a soldier's comin'\nHe came right in to ya hood and he sold you somethin'\nHe spit with a frozen flow and he told you somethin'\nI think I hear a soldier comin', that's me\nThere, now you know a soldier's comin'\nYou better run for it, run for it, run!\nThere now you know the soldier is comin'\nYou better run for it, run for it, run!\nWe soldiers, we bats, chains, gats, game, raps, names\nWe soldiers, in the streets we keep heat\nNiggas is deep and niggas'll creep\n\n[Verse 2]\nFar from what you would call soft\nCompete and watch you fall off\nI'm beef you call off, that's me\nThe one you supposedly beef with, that's me\nWe fought, but you kept it a secret\nTalking about what you gonna do when find me and keep seeing me\nLiein' like you diein' to catch me and put three in me\nTold him cut the jokes, but I guess that he wasn't hearin' me\nConvince himself that he wasn't fearin' me\nMy niggas all killers from the bottom straight to the top\nRide with me whether they know the destination or not, that's me\nThe baddest rap you heard in a while\nRide with the gat in the lap, convertible style, that's me\nThe killer that lerk in the dark, tear up every god damn hood\nFrom the church to the park\nDRRROOOM! Motherfucker, you hear that noise?\nYou better run for it, run for it, run!\n\n[Chorus]\nThere, now you know a soldier's comin'\nHe came right in to ya hood and he sold you somethin'\nHe spit with a frozen flow and he told you somethin'\nI think I hear a soldier comin', that's me\nThere, now you know a soldier's comin'\nYou better run for it, run for it, run!\nThere now you know the soldier is comin'\nYou better run for it, run for it, run!\nWe soldiers, we bats, chains, gats, game, raps, names\nWe soldiers, in the streets we keep heat\nNiggas is deep and niggas'll creep\n\n[Verse 3]\nNothin' but underground shit comin' out of my pump\nDecaid funk from a punk comin' out of my truck\nEverybody wanna thug with them triggers they pullin'\nBe shooting pip-pip guns that ain't as big as my bullets\nLive from Detroit coming to a block near you\nReal soon so somebody might get popped near you\nAll you wanna do is rap, I be listenin' right\nHave to flip a big difference between a clip and a mic\nI'm a soldier, cool as I want to be, gun totin'\nTalking to hoes, rude as I want to be, who wants some of me?\nThis is no problem that I can't fix, I got a crew that I brung with me\nHardcore niggas you're nothin'\nBen Franklin run this motherfucker and in God I trust 'em\nIf you ever see my guns out, they probably bustin'\nWhile you niggas is ridin' or diein', I'll be truckin'\n\n[Chorus]\nThere, now you know a soldier's comin'\nHe came right in to ya hood and he sold you somethin'\nHe spit with a frozen flow and he told you somethin'\nI think I hear a soldier comin', that's me\nThere, now you know a soldier's comin'\nYou better run for it, run for it, run!\nThere now you know the soldier is comin'\nYou better run for it, run for it, run!\nWe soldiers, we bats, chains, gats, game, raps, names\nWe soldiers, in the streets we keep heat\nNiggas is deep and niggas'll creep\n\n[Outro]\nRoyce, Nickel Nine, 2000\nBig Reef", "image": "https://images.genius.com/57fa2e5e3b7c7b5f587ec5abab735ea4.600x600x1.jpg"}], "artist": "Royce da 5'9'’"}