{"songs": [{"title": "Eric B. Is President", "album": "Paid in Full", "year": "1986-01-01", "lyrics": "[Verse 1]\nI came in the door, I said it before\nI never let the mic magnetize me no more\nBut it's biting me, fighting me, inviting me to rhyme\nI can't hold it back, I'm looking for the line\nTaking off my coat, clearing my throat\nThe rhyme will be kicking until I hit my last note\nMy mind remains refined, all kind of ideas\nSelf-esteem makes it seem like a thought took years to build\nBut still say a rhyme after the next one\nPrepared, never scared, I'll just bless one\nAnd you know that I'm the soloist\nSo Eric B. make 'em clap to this\n\n[Verse 2]\nI don't bug out or chill or be acting ill\nNo tricks in '86, it's time to build\nEric be easy on the cut, no mistakes allowed\n'Cause to me, MC means move the crowd\nI made it easy to dance to this\nBut can you detect what's coming next from the flex of the wrist?\nSay indeed and I'll proceed 'cause my man made a mix\nIf he bleed he won't need no band-aid to fix\nHis fingertips sew a rhyme until there's no rhymes left\nI hurry up because the cut will make 'em bleed to death\nBut he's kicking it 'cause it ain't no half stepping\nThe party is live, the rhyme can't be kept in-\nSide, it needs erupting just like a volcano\nIt ain't the everyday style or the same old rhyme\n'Cause I'm better than the rest of them\nEric B is on the cut and my name is Rakim\n\n[Verse 3]\nGo get a girl and get soft and warm\nDon't get excited, you've been invited to a quiet storm\nBut now it's out of hand 'cause you told me you hate me\nAnd then you ask what have I done lately\nFirst you said all you want is love and affection\nLet me be your angel and I'll be your protection\nTake you out, buy you all kinds of things\nI must have got you too hot and burned off your wings\nYou caught an attitude, you need food to eat up\nI'm scheming like I'm dreaming on a couch with my feet up\nYou scream I'm lazy, you must be crazy\nThought I was a donut, you tried to glaze me", "image": "https://images.genius.com/2f0597f5025e55ba8a0b742c14e073ea.280x291x1.jpg"}], "artist": "Eric B. & Rakim"}