{"songs": [{"title": "Touch It (Remix Part One)", "album": null, "year": null, "lyrics": "\"Buy it - use it - break it - fix it -\nCrush it - change it - melt - upgrade it\n{Continues in slower pitch}\n\n[Intro: Busta Rhymes]\nAiyyo, what you think the building is gon' feel like\nOnce the dog and Busta Rhymes come through this\nMotherfucker?\nOh man, not again\n\n[Hook]\n\"Touch it - bring it - pay it - watch it -\nTurn it - leave it - stop - format it\"\n-] repeat 4x\n\n[DMX]    WHAT, remix\n[Busta]  We 'bout to do it again\n[DMX]    WHAT, remix\n[Busta]  We 'bout to do it again\n[DMX]    WHAT, remix\n[Busta]  We bout to do it again\n[DMX]    WHAT\n\n[Busta]\nAiyyo dog, lets take it to another level\nGet low Bus\n\n[Busta Rhymes]\nYou see I'm back with the smash\nI told you niggas I'm comin and bustin yo ass\nAlot of niggas is hype, but you know they all be trash\nSee I don't read through them niggas, bout to step on the gas (TURN IT UP)\nEVERYBODY WANNA KNOCK IT, SEE THIS SHIT OFF THE HOOK\nGOT THE DOG WIT ME LIKE WE BOUT TO DO IT TO JOOKS\nEAT A NIGGA FOOD, CALL ME BLACK CEASAR THE CROOK\nAND WHILE I'M BACK BRINGIN THE PRESSURE\nYOU NIGGAZ IS SHOOK\nGet low Bus, aye nigga, gimme a second\nSee you ain't in my lane homie, just for the record\nEverytime you see me, you need to, you better respect it\nCause when I bring it, you I'm only comin to bust it (TURN IT UP)\nBUSTA BUS, SWIZZ AND X, YOU CAN'T HANDLE US NOW\nSEE I'M THE THRONE HOLDER BITCH, THE SHIT'S UNANIMOUS NOW\nWHO THE FUCK WANNA TRY TO COME BANG WIT US NOW\nNONE OF YALL, THAT'S WHY OUR BITCH WANNA HANG WIT US NOW\nI LET 'EM\n\n[Hook]\n\n[DMX]\nGrrrrrrrrr\n\n[Busta Rhymes]\nGet low X\n\n[DMX] + {Busta Rhymes}\nAnything it's took, it's gon be a breakdown\nCome through like \"hmmm, what I'm gon take now?\"\nWhatever the fuck I want, trust me dog\nIt gets ugly even when it comes to the hunt {TURN IT UP}\nNIGGAZ LIKE TO STUNT, YOU WANNA TO FRONT\nI'MA HIT YOU AND YOUR MAN\nAND IMA HIT YOU WHERE YOU STAND (WHAT)\nNIGGAZ AIN'T BUILT FOR NOTHIN BUT FRONTIN\nCOME THROUGH, FAGGOTS HIT THE SECURITY FRONTIN {Keep goin X}\nGet that too, What that do? How that do?\nFuck you faggot, I shot at you\nAnd what? You and you mans butt, you in your man's truck\nBut your chance is up, not get up {TURN IT UP}\nYOU KNOW HOW THAT SHIT GOES, LET THAT SHIT GO\nAIN'T NOTHIN CHANGE, BEEN THE SAME FROM THE GETGO (WHAT)\nGET UP OUT THAT WHIP YO, I AIN'T GON' TELL YOU AGAIN\nFUCK IT, SAY HELLO TO MY LITTLE FRIEND\n\n[Hook]\n\n[Busta Rhymes]\nGet low X\n\n[DMX] + {Busta Rhymes}\nSwizz is the monster, X is the beast\nFuckin with Bus, everyday is a feastStay off the streets\nI'm tired of talkin to y'all niggas\nI'm a stick a fork in y'all niggas {TURN IT UP!!}\nWHEN I HIT 'EM MAN THAT TRUCK COME GET 'EM MAN!!!\nFUCKED UP HOW I DID 'EM MAN (WHAT!!!)\nAIN'T NO REMORSE FOR THE CORPSE, TRUTH IS\nCAN'T I.D. THE BODY, NIGGA TOOTHLESS\n\n[Busta Rhymes]\nGet low Bus, just like peas and rice\nThe way I cook, niggas gotta have a Jesus Christ\nWhat the fuck you niggas wanna do? Please, I'm nice\nI'm only gonna say it once, I'm ain't sayin it twice (TURN IT UP)\nYO I SWEAR TO GOD, YOU DON'T WANT\nNO PROBLEM WHEN I PACK OUT THE FULL CLIP\nBUS RHYMES, BACK ON THE BULLSHIT\nFUCK YOU WANNA COME AROUND, YOU AND YOUR CREW SPIT\nI'M HEAR TO FIX THE GAME AND I'M BACK WIT THE TOOLKIT, YOU CAN\n\n[Hook]\n\n[Drum plays in the beat]\n\n[Hook 'til fade]", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}