{"songs": [{"title": "You Played Yourself [Remix]", "album": null, "year": null, "lyrics": "[Intro]\nBust this  ----] DJ Pooh\n\n[King Tee]\nAww yeah, what's up Aladdin man?\n\n[DJ Aladdin]\nWhat's up King Tee?\n\n[King Tee]\nAww, we're chillin' man\n\n[DJ Aladdin]\nAww, yeah?!\n\n[King Tee]\nMy man Ice asked me to come to do this remix, man\nDo you wanna join me man?\n\n[DJ Aladdin]\nAww, you know that, you know that\n\n[King Tee]\nYo man, you know man, you're gonna combine with my man African Islam with some hypes\n\n[DJ Aladdin]\nAww, yeah\n\n[King Tee]\nYou know what I'm sayin?\n\n[DJ Aladdin]\nThat's right, that's right\n\n[King Tee]\nYou know, You know my man Ice\nHe man, he's a..\n\n[Hook: DJ Evil-E scratching quote below]\n\nPanther ----] Paris\nPanther ----] Paris\nPanther ----] Paris\nPanther ----] Paris\n\n[Verse 1: Ice-T]\nThis is it, dope from the fly kid\nThe Ice mic is back with the high bid\nSuckers you've lost, cause players you're not\nGangsters you ain't, you're faintin, punk, if you ever heard a gunshot\nYo, the pusher, the player, the pimp gangster, the hustler\nHigh Roller, Dead Pres' folder\nIs cold lampin' like a black king on a throne\nEvil E... turn up the microphone\nSo I can ill and break on the rollin' tape\nAnother album to make? - Great\nIslam turn the bass kick up a bit\nHype the snare, now I got a place to sit\nAnd ride the track like a black mack in his 'llac\nHit the corner slow where the girls are at\nAnd kick game the way it should be done\nHow you gonna drop science? You're dumb\nStupid ignorant, don't even talk to me\nAt school you dropped Math, Science and History\nAnd then you get on the mic and try to act smart\nWell let me tell you one thing, you got heart\nTo perpetrate, you're bait, so just wait\nTil the press shove a mic in your face\nOr you meet Boogie Down or Chuck D\nStetsasonic or the Big Daddy\nAnd they ask you about the game you claim you got\nDrop science now, why not?\nYou start to sweat and fret, it gets hot\nHow'd you get into this spot?\nYou played yourself\n\n[Chorus: DJ Evil-E scratching quotes below]\nJust steppin'\nYo, yo, you played yourself ---] Ice-T\nJust steppin'\n\n[Verse 2: Ice-T]\nI'm no authority but I know the D-E-A-L\nWhen it comes to dealin' with the females\nWhat you got they want, cash is what they need\nSlip sucker and they'll break you with speed\nBut you meet a freak, you try to turn her out\nSpendin' money's what I'm talkin' about\nBut you fool out, your pockets got blew out\nAnd after the date, no boots, you got threw out\nMad and shook cause your duckets got took\nCall her up, phone's off the hook\nBut who told you to front and flaunt your grip?\nYou can't buy no relationship\nYou played yourself...\n\n[Chorus: DJ Evil-E scratching quotes below]\nYo, homeboy, you played yourself...\n\n[Verse 3: Ice-T]\nI'm in the MC game, a lot of MC's front\nAnd for the money they're sell out stunts\nBut they claim that they're rich and that they keep cash\nYo, let me straighten this out fast\nTwo hundred thousand records sold\nAnd these brothers start yellin' about gold?\nYou better double that, then double that again\nAnd still don't get sooped, my friend\nYou think you've made it, you're just a lucky man\nGuess who controls your destiny, fans\nBut you diss them cause you think you're a star\nThat attitude is rude, you won't get far\nCause they'll turn on you quick, you'll drop like a brick\nUnemployment's where you'll sit\nNo friends cause you dissed them too\nNo money, no crew, you're through\nYou played yourself\n\n[Chorus: Ice-T w/ minor variations]\nThat's right, you played yourself\nYou played yourself\nYo, yo, you played yourself\n\n[Verse 4: Ice-T]\nYou got problems, you claim you need a break\nBut every dollar you get you take\nStraight to the Dopeman, try to get a beam up\nYour idle time is spent tryin' to scheme up\nAnother way to get money for a jumbo\nWhen you go to sleep, you count Five-O's\nLyin' and cheatin, everybody you're beatin'\nDirty clothes and you're skinny cause you haven't been eatin'\nYou ripped off all your family and your friends\nNowhere does your Larceny end\nAnd then you get an idea for a big move\nAn armed robbery... - smooth\nBut everything went wrong, somebody got shot\nYou couldn't get away, the cops roll, you're popped\nAnd now you're locked, yo, lampin' on Death Row\nSociety's fault? No\nNobody put the crack into the pipe\nNobody made you smoke off your life\nYou thought that you could do dope and still stay cool?\nFool, you played yourself\n\n[Chorus: Ice-T w/ minor variations]\nYou played yourself\nAin't nobody else's fault\nYou played yourself\n\n[King Tee]\nYo, yo, yo, yo, what's up Aladdin?\nYou think Ice-T's gonna like this mix?\n\n[DJ Aladdin]\nI think he'll like it, I think he'll like it\n\n[Outro: King Tee]\nYo, yo, this is some hypes up\nYou know what I'm sayin?\nCheck this out\nIf you don't call this mix, then you want out mixed\nYou know what I'm sayin?\nIf all y'all rid out, you know what I'm sayin?\nYou played yourself\nSee y'all!", "image": "https://images.genius.com/86b9e63b9a38d5cc3e34cf27569b4d81.300x300x1.jpg"}], "artist": "Ice-T"}