{"songs": [{"title": "Heavy Breather", "album": "Cloud 9", "year": null, "lyrics": "Oh wassup\nOh wassup\nThat nigga B.o.B\nThat nigga Willie Joe\n\n[Hook]\nHey, she's a heavy breather\nHey, she's a heavy breather\nHey, she's a heavy breather\nEverytime I run up in her\nHey, she's a heavy breather\nHey, she's a heavy breather\nHey, she's a heavy breather\nEverytime I run up and I breathe\nIn the club sweat, got her-got her drippin' wet\nHomie I'm a vet, wrist match the icy neck\nBaby you the best, I don't mean no disrespect\nBut she's a heavy breather, she's a heavy breather\n\n[Verse 1: B.o.B]\nThere's plenty pussies in here, but I'm looking at that butt\nShe be dropping like she hopped up out the bath tub\nNow don't get arrogant because we looking at you\nWe ain't really watching you, we just watching what your ass does\nBaby, you look like you could really use it\nAnd don't make no excuses, cause we was made to do this\nNow don't be acting baby, I'll give you asthma baby\nI'm looking at your body and you're pretty fascinating\nYou got more body then a Chevy with the double doors\nMake me wanna cut a flip and do a somersault\nNow don't get mad at me baby because it's your mama fault\nYou bout to pop up out your Wonder Bra\n\n[Hook]\n\n[Verse 2: Willie Joe]\nWhat's poppin'?\nWhat goes on?\nTree and that patron got me in the zone\nTell your man you came with the plans postponed\nCause Willie Joe bout to take your pretty ass home\nI'm a heavy breather, I got to get the gash\nI took her to the pad, and then that nigga stabbed\nI hit her with a jab, and then an upper-cut\nShe had a mean-strut, cute-face thunder-butt\nDJ play the cut, now she ready Freddy\nShe put her ass on me, she breathin' extra heavy\nMami when you ready, we can do the move\nFrom the B to the A, lets do it cruise\n\n[Hook]\n\n[Verse 3: Hagon]\nShe the exception defyin' all of nature's laws\nSaid she want it right now up against the wall\nAre you a big girl? mama could you take it all?\nI like that outfit but mama could you take it off?\nI tell her somethin' good, haters try to undo it\nDon't think I ain't made for it, cause I'm cuttin' to it\nSee women want a nigga who ain't gonna go behind her\nBut at the same time beat it up from behind\nI got that pussy so wet, a river run through it\nAfter me she renamed shit, a nigga run through it\nBecause I beat it up and left her ass out of breath\nIn the bed touching herself, breathing heavy like...\n\n[Hook]", "image": "https://images.genius.com/96f49a6c2a496c980bf06e29a9bc9f54.400x400x1.jpg"}], "artist": "B.o.B"}