{"songs": [{"title": "AssMilk", "album": "Bastard", "year": "2009-12-25", "lyrics": "[Verse 1: Tyler, The Creator, Earl Sweatshirt]\nUh, addicts arise when I arrive\nIn this cracked crack fag back slab in disguise\nFat sack of knives in the passenger side\nBitch, reach for the door, get your access denied\nI'm not an asshole, I just don't give a fuck a lot\nThe only time I do is when a bitch is screaming \"Tyler, stop!\"\nThe big bad wolf; to me, you're just a minor fox\nRed Riding is getting some of this wolfly odder cock\nWe the niggas you scared of like bad dentists\nFlow is anthemic, dirty like it's plants in it\nSick, spit a pandemic, crack and cancer mixed with cannabis\nTo have a bitch ready to stab a clit with some glass and shit\nYour whole gang'll be diminished, bunch got the Brady's in it\nSpit sick shit like my saliva got the rabies in it\nFuck rap, I'll be a landlord so I can rape the tenant's daughter\nLeave my house with a new stomach, and a baby in it\nFace it, me and Ace is sick like malaria carri—\n\n[Interlude: Tyler, The Creator, Earl Sweatshirt]\n\"Augh! Ow, ow, ow, ow, ow, ow, ow, stop!\"\n\"Why did you do that?\"\n\"Say sorry, say sorry!\"\n\"Sorry! I'm sorry as fuck!\n\"Say sorry!\"\n\"I'm sorry as fuck, ow, ow!\"\n\"Say sorry!\"\n\"I'm sorry! Don't look at this!\"\n\"Say sorry\"\n\"Don't look at this, ow stop!\"\n\"Say sorry!\"\n\"Ow! Stop 'fore you fuck something up!\"\n\"Say, \"Sorry!\"\n\"Say, \"Sor-\"\n\"Sorry, sorry—Uncle!\"\n\"I fucked this nigga eye up man haha\"\n\n[Verse 2: Tyler, The Creator, Earl Sweatshirt]\nFace it, me and Ace is sick like malaria carriers\nJim Carrey her to the cemetery to bury her\nListen busters, scarier when I finger fuck her\nAfter I dig her up and then eat her out with a bit of mustard\nTook karate, mommy told me \"Tyler toughen up\"\nRihanna haircut, somebody tell Chris Brown to fuck me up\nHad to teach the bitch manners, now I gotta learn her\nI'll beat the fuck out your bitch anonymous, Ike Turner\nOver, sloppy seconds is my preference\nExcept for when I'm feeding on the flesh of a pedestrian\nNessy loch monster stop Will he though? Probably not\nSilly hoes lick my balls like FIFA lollipops\nGet the certain tingle, eating Häagen-Dazs\nWith some soccer moms where they like to fucking sit and mingle\nWatch an Animal Planet document on the Eagles\nIn the flyest '06 Supreme beanie, Sigel\nYour grind's feeble, I'm regal, really, I'm Willy Smith\nI am Legend, a snicker dick in a vanilly chick\nCome take a stab at it faggot, I pre-ordered your casket\nThis is known as a classic, yeah that chapped lips crack shit\nHat is always forest so the bitches call me Gump\nBut compliment her tits and then its off to hump her\nFuck her in a Hummer while I rape her then I put her in a slumber\nIt's not a figure of speech when I tell you that I dumped her\nKnown narcissists, sipping on arsenic\nCarved carcasses in the garage, don't park in it\nHard as finding retarded kids at Harvard\nIt's Wolf Gang barking keep you up like car alarms and shit\nOver the edge, yeah I hide in a potato sack\nCause I'm cold as ice like Anasia when she fucking Traq\nI'm the type to put you down to bring myself up\nSo when I rape a bitch I hold her down and get my best nut\nThe reincarnation of '98 Eminem\n60 Crip and Grizzly and some RMK Denim\nPay attention I'm stabbing your women friends, like a gentlemen\nThen dipping with the fucking pen to go sin again\nWhite girl, you can ask her what the dick be like\nAt monster madness doing drive by's on a fucking fixie bike\nFuck it moron, snorting oxycontin, wearing cotton\nOxymoron like buff faggots playing sissy dykes\nThis the shit that get cripple bitches to hop\nDirty crack pipes lit, bullshit to stop, halt\nBoss broke, spouse choke, blouse open\nSly's little shop of horrors, now showing\nI hate gays, gangbangers and fucking jerkers\nUnless it's gay gangbangers, that's fucking jerkers\nWhoa yo, yo.. no homo, I'm not gay, faggot\nOdd Future Wolf Gang, Wu-Tang banging in your system\nProbably banging in your sister\nWith my children swimming in her system\nLet me say this shit in slow-mo, homo\nYou don't fucking skate, take off that box logo", "image": "https://images.genius.com/cb0b25f99dd81109efa8db270a933a38.500x500x1.jpg"}], "artist": "Tyler, The Creator"}