{"songs": [{"title": "We Up", "album": "Amerikaz Nightmare", "year": "2004-08-10", "lyrics": "[Intro]\nYeah, 'bout to get my head right on this one\n04-04-04, 04-04-04, yeah\n\n[Verse 1: Havoc]\nHav' come through, slump low with the seat back\nWith somethin in the stash to push a elephant bean back\nShit, my shit is touchin, hungry hurry up need that\nTryin to live right, only a juk for the relapse (yeah)\nPerhaps I'll fold, maybe I won't\nGo back to it like an old bitch I boned\nNigga Havoc he a problem 'specially when he zoned\nLet a nigga get foul like the wool he smoked, so\nSmell me people, these clowns ain't equal to I\nBitches feel me cause they love my vibe\nKnow what a chick want, know what a chick need\nRecognize the difference from a male, and chicken feed\nI'm blessed that's why my neck is glistening\nYou in a slump cause you not listening\nWe hold our own and earn our keep\nAnd never ever get more than the one eye sleep\n\n[Hook]\nWe up! (Word, man)\nWe up! (I be having nightmares, son)\nWe up! And I love it, and I love it\nWe up! (I don't even wanna go to sleep no more)\nWe up! (I be having the illest dreams, son)\nWe up! (Tell you about this shit, son)\nWe up! Everybody wake up!\n\n[Verse 2: Prodigy]\nI'm having dreams of squeezing a gun that don't work\nAnd some nigga with a tec come and wet my shirt\nI catch bullets in my stomach, and them shits burn\nI wake up sweating, holding my stomach cause it hurt\nYo, the shit seem too real, I'm dying of thirst\nI gotta drink mad water just to calm me down first\n'fore I get back to sleep, and get some rest\nThen I can't get back to sleep, I'm too stressed\nI got the shotty real close, right under my bed\nI know that work, cause I been practicing\nWith my gauge at the range, nigga I'm nice with it\nNigga mothafuck them dreams, I'm real life with it\nYou'll be coughin up your spleen, guts and all kinda shit\nYou invade my space, I'm beating the case\nNigga come fucking with me, yeah that's my kinda shit\nPlease, or all of my guns'll be a waste\n\n[Hook]\nWe up! (Yeah, I feel you my nigga)\nWe up! (No doubt)\nWe up! (That's why I'm glad we up, man)\nWe up! And I love it, and I love it\nWe up! (We got niggas to do that shit for us you know?)\nWe up! (Word up, man)\nWe up! (That's right my nigga, we up)\nWe up! Everybody wake up!", "image": "https://images.genius.com/b2028bc5336e13af3d91919e570f79e6.1000x1000x1.jpg"}], "artist": "Mobb Deep"}