{"songs": [{"title": "I Made It", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Intro: Trick Trick]\n(This shit ain't funny)\nYeah, Ok!\nY'all didn't know what it is, nigga?\nThe game has officially changed\nThat's right\nI don't know what you thought you wanted, but you really don't want it, nigga\nGoon Sqwad, D12\nMcVay, crack they heads nigga!\n\n[Verse 1: Swifty McVay]\nThis is the tales of the dark side\nI park right in front of your spot\nPut a hole in your car right\nI never been playing like they told\nThat I lean over that passenger side\nIt ain't rovin' while it's golden, I give you hoes a makeover\nPole pose a shit and his arms a break your both of them\nAnd I'm a dash faster than locomotive\nI can trespassing a ram shaking\nMurder your families and it ain't no closure\nI cast snatcher, I stop all type of transactions\nWhen I get back on the block these niggers mashing\nI got the world in my palm and I'm a smash it\nSprinkle the ashes in the atmosphere\nI'm just an animal, pass it enough to grab the back of your neck\nAnd stuff your face in a half of cake\nForce you to take a breath, I could care less about who you be\nOr what you do for the community\nWe taking it over I'm on a shootin' spree\n\n[Hook]\nTime and time again I get it, speak your hustling I get it\nI get it, what? I get it, what? I get it, yes I get it\nWhenever I drop the line they faded\nSingle top of the world I made it\nI made it, what? I made it, what?\nTaking over this bitch and Y'all Hate it\n\n[Verse 2: Trick Trick]\nIt's the return of the aggravated assault-slash-robbery\nPossession with intent to deliver federal property\nAnother assault with intent to great bodily\nAnd I ain't pleading guilty to shit, and won't cop a plea\n3 strikes in and motherfuck the 4th\nContinue to take the 5th and I ain't going to court\nThen life an outlaw on the run, with g-shit to do\nI ever get caught I'm a fourth degree habitual\nJust for me splittin' and everyday ritual, 74 stitches\nJust from me trippin' you, your blood bleeds your ass, I'm a a show what Trick Trick'll do\nNigga you don't want it with me and I ain't shitting with you\nUp top d cap one and black tees no holster, 30 round clip the black squeeze\nVerses smell Proof, looking like black cheese\nI'm backing these rap niggers up with a rap sheet\n\n[Verse 3: Bizarre]\nPacquiao punches, Mayweather swag\nMike Tyson attitude, Ali Jabs (uhh..)\nBack at the lab, cookin' up shit\nFuck your yellow pages, you ain't looking up shit\nConvict lunatic, no gang banger\nThrow the towel in like Apollo Creed's trainer (stop the fight!)\nSuck everybody's dick you ain't got no choice\nI ain't T-Pain but I do something to your voice\nAk47 I shoot up your crib, get your ass in the house like Michael Jackson's kid\nTrick trick and D12, click click and see shells\n5 o'clock news catch the details\nAnd fuck weed, nigga I'm on angel dust\nI got some talk that makes Rosa Parks get off the bus (Get off the bus!)\nAnd god forbid if I ever get shot\nGive me 6 Vicodin and Michael Jackson's doc\nBizarre, Bitch!\n\n[Hook]\nTime and time again I get it, speak your hustling I get it\nI get it, what? I get it, what? I get it, yes I get it\nWhenever I drop the line they faded\nSingle top of the world I made it\nI made it, what? I made it, what?\nTaking over this bitch and Y'all Hate it\n\n[Verse 4: Kuniva]\nIt's best to shut your mouth up\nBullets flying through your window\nHit your pit-bull, split your sister and your spouse up\nGotta keep the hustle going, A Shady fuckin' omen\nHollows rip your shirt like Hulk Hogan with his muscles showin'\nWe on the paper route, if he ain't talking right, take him out\nI don't need cameras when I fade em out\nGet your patron mob, Trick Trick boom squad\nD-12 loonie chop, shooting from the roof top\nGotta keep the green up, you can tell I'm seeing stuff\nMaking mess with you the corner player cleaned up\nDo it for the gusto, what up doh\nYou a bitch you nigga, you can take it how you want like a slut ho\nIf it ain't about that bread then I ain't listening\nIf she ain't talking about head then ain't kicking it\nWay worst than EST about my dividends\nTo finish you off in the hospital while I’m visiting\n\n[Hook]\nTime and time again I get it, speak your hustling I get it\nI get it, what? I get it, what? I get it, yes I get it\nWhenever I drop the line they faded\nSingle top of the world I made it\nI made it, what? I made it, what?\nTaking over this bitch and Y'all Hate it", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}