{"songs": [{"title": "Listen to the ScHoolboy", "album": "ScHoolboy Turned Hustla", "year": "2008-07-29", "lyrics": "[Intro: DJ Ill Will]\nOnce again this your boy DJ Ill Will\nTop Dawg E-N-T\nGetting every dolla I-N-C\nCan't knock my man ScHoolboy Q\nYo you're gettin' it\nJump on the bandwagon while you can\nDJ Ill Will\n\n[Verse 1]\nYou're now listening to the greatest, the illest, the realest\nUp in this town, going down, for the block I hold it down\n50 is where I be at, H, Crowns, and Tee Hats\nNotorious, Hoover Street, where you scared to be at\nNiggas don't impress me, shit, I let the tec speak\nLet's see actually, no rapper match me\nUnderstand, I'm the man, California i'm the land\nGrinding everyday on my own, fuck a helping hand\nSitting in the trap spot, chopping up the crack rock\nKeep a quarter piece up in my mouth in case the cops watch\nGot to keep the Glock cocked, in case I gotta pop shot\nThrow a fiend a rock up on the ground like it's hopscotch\nNeck got stupid tats, I done been through hell and back\nGraduated from Meth C, Uni of selling crack\nPay attention to the facts, realest in the game\nAll these rappers sound the same, what's my motherfucking name?\nQ!\n\n[Hook]\nYou're now rocking witH tHe ScHoolboy\nYou're now listening to tHe ScHoolboy\nYou're now rocking witH tHe West, G-E-D\nWe tHe best, motHerfucker, fuck tHe rest\nYou're now rocking witH tHe ScHoolboy\nYou're now listening to tHe ScHoolboy\nYou're now rocking witH tHe West, Top Dawg E-N-T\nMotHerfucker, fuck tHe rest\n\n[Verse 2]\nShouts out to Jay Rock, K.Dot, Ab Soul\nB.O., Moose, DJ Dave and Soundwave\nM Doc, B. Dog, Punch, Ali\nTop Dawg E-N-T, Top Dawg be the chief\nNow I move on to my GED Family\nStarting off meet my nigga Tyga, Gator\nAnd my nigga S.B., Jay, T. Rail\n[?], and my little brother Chris\nYall niggas now the stick, matter of fact fuck a bitch\nTop Dawg E-N-T, G-E-D, we the streets!\n\n[Outro]\nIll Will exclusive\n(gunshots)", "image": "https://images.genius.com/72de999ec4144de78b4aca2000e5694f.500x500x1.jpg"}], "artist": "ScHoolboy Q"}