{"songs": [{"title": "Thug N U Thug N Me (O.G. Version)", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nHey uh I like that beat that MC Lyte got\nJohnny J flip that shit, let's do that shit over\nLet's do that shit like you know Death Row style, you feel me?\n(Put me in that motherfucka)\nYeah that type of shit\nYou know what time it is\nMaybe it's the thug in me\n\n[Verse 1: 2Pac]\nBy age thirteen I was buckwild, good at my knuckle game\nMade it through a tough childhood never be the same\nWalked in my daddy's shoes\nNo time to be a peaceful man had to shatter fools\nThat's 'til I put my eyes on you\nGod damn, sweetheart you got some thighs on you\nNow I can't wait to get you home, get you all alone\nIn my bedroom, baby can we bone, and get it on\nTell me lady how you like me\nAnd if you want it harder baby, come and bite me\nBut do it lightly\nCause that excites me to lay the pipe\nAnd if you lick me right, I'll do it all night\nOnly got fucked by a drug dealer\nNever felt the real passion of a thug nigga\nThough I like the way you scream when you lovin' me\nI'm goin' deep, it's the thug in me\nSo whatchu sayin' girl?\n\n[Hook: 2Pac & Jewell]\nI like what I'm doing to you\n(Maybe it's the thug in me)\nIt's just the thug in me\n(Maybe it's the thug in you)\nI like what you're doing to me\n(Maybe it's the thug in me)\nI like the thug in you\n(Maybe it's the thug in you)\n\n[Verse 2: 2Pac]\nMoan baby when we bone it's on\nIt's so strong niggas in the next room'll cum\nI got ya head swingin'\nTongue kissin', as I hit it from the back with the bed ringin'\nGive me space, as I lick ya face, stick the place\nSynchronize so I grind when they kick the bass\nLove fuckin' in tha mo'nin'\nI get ya wet and bust a sweat, then I'm gone\nLeft you on yo' own girl\nTell me what you feel like\nBlindfolded, I'm cold do it real nice, that's if it feel right\nMaybe it's the thug in me\nI pull ya hair while we fuckin' in the chair, when ya lovin' me\nUp against the wall, you can have it all; just try\nBet my kiss, to get you high, don't pass by\nGrab me by my nuts when I'm lovin' you\nNow open up and let me put the thug in you\n\n[Hook: Jewell & 2Pac]\nYou like me rough, you like me tough\nMaking love real freaky baby\n(Maybe it's the thug in me)\nYou like the thug in me\n(Maybe it's the thug in you)\nI like it rough, I like it tough\nReal hard and smooth\n(Maybe it's the thug in me)\nI like the thug in you\n(Maybe it's the thug in you)\n\n[Verse 3: 2Pac]\nSay baby what's your phone number?\nBe warned, I'm like a storm with my own thunder\nI make the room rumble, in and out long stroke\nHold ya breath now, close your eyes deep throat\nDid you like it?.. Oooh I'm excited!\nCause it's a party in my bedroom, you're invited\nC'mon now, let me see ya shake your rump\nTell me, how long will it take to cum\nHavin' fun, do it one on one and we can all get involved\nFirst y'all do me, then I'll fuck y'all\nWhen you call me the next day\nTo get sexed by a nigga in the best way\nYeah baby it's a price to pay\nOnly play in the fast lane\nWhen you a hustler, motherfuckin' cash came\nI gotcha goin' wild, 'cause I'm lovin' you\nDrugged out with this motherfuckin' thug in you\n\n[Hook: Jewell & 2Pac]\n(Maybe it's the thug in me)\nI like what I'm doing to you\n(Maybe it's the thug in you)\n(Maybe it's the thug in me)\nIt's just the thug in me\nI like what you're doing to me\n(Maybe it's the thug in me)\nI like the thug in you\n(Maybe it's the thug in you)\nI like what I'm doing to you\nIt's just the thug in me\n(Maybe it's the thug in me)\nI like what you're doing to me\n(Maybe it's the thug in me)\nIt's just the thug in you\n\n[Outro: 2Pac & Jewell]\nI don't wanna talk, I don't want no explanations\n(How could something so wrong feel so right)\nI don't got no motherfuckin' explanations, ya know what I'm sayin?\n(How could something this good last all night)\nIt's the thug in me\nDon't be askin' why I'm pullin' your hair\n(Extra tight)\nAnd why I fuck so motherfuckin' thuggish\n(Baby)\nThat thug passion, ya know what I mean?\n(You like the thug in me)\nBitch, no mercy\nWhat you scared of?\n(I like what I'm doing to you)\nDidn't you come over here to get fucked?\nYou ain't come over here for me to be\n(You like the thug in me)\nStrokin', and all that bullshit\n(I like what you're doing to me)\nYou came over here to get fucked\nShit, if I ain't fuck you thug style\n(I like the thug in you)\nBitch you'd leave my house talkin' bout, \"2Pac can't serve me\"\nWon't have me crossed up in that bullshit, hahaha\n(I like what I'm doing to you)\nTurn over!\n(What I'm doing to you baby, what I'm doing to you baby)\nMaybe it's the thug in me\n(I like what you're doing to me, what you do to me baby, what you do to me baby)\nCouple of you hoes heard\n(I like it)\nCouple of you bitches heard What's Ya Phone # and thought y'all could fuck with me in the bedroom\n(I like it, I like it, I like it, do you like it )\nThis is just to tell you it ain't happening, it ain't going down\n(Do you like my thug passion)\nAs long as they make ginseng and condoms bitch you out of luck, you're gonna get fucked\n(Cause I like your thug passion, baby)\nMy motherfucking explanation\n(Oh yeah)\nMy motherfucking motto\n(I like what you're doing to me)\nMaybe it's the thug in me\n(Thug passion)\nI'm out this bitch\n(I like it)\nHey Johnny J on the strength for real on my momma I think we rocked this one harder than MC Lyte\n(Do you like it, do you like it, do you like it)\nI think we rocked that one harder than Michael Jackson, man fuck that\nWe up out this bitch\nYou know how we do it on Death Row\nBIATCH!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}