{"songs": [{"title": "Tater Tot", "album": "Gutter Rainbows", "year": null, "lyrics": "[Intro]\nI'm just wondering what the heck is in our water supply\nWhat the heck is in our oxygen supply\nThat creates a rainbow effect in sprinklers?\nWhat is oozing out of our ground\nThat allows this type of effect to happen?\nIt's not just around our sun and our moon any more\nEverywhere we look, the visible spectrum, is rainbows\nThis cannot be natural\nWe as a nation have got to ask ourselves\nWhat the hell is going on?\nWhat is oozing out of our ground?\n\n[Talib Kweli]\nThe day that I enlisted\nWas the result of a prior visit with Jesus Christ felt like I was lifted\nThen I got injured and the hospital was like a prison\nFell out of touch with my faith I was nihilistic\nThey call me Cyclops, cause I was blind in one eye\nI'm out the army now I'm tryin' to decide\nHow to properly fit in with civilians I'm used to killin'\nGot me feelin' all confused, who the hero and who the villain?\nHopped in my red Camaro, shot down the street like lead in a barrel\nDecked out in my veteran apparel\nI drove aimlessly for miles until I saw this\nCountry that'd want me to kill; I took a bullet for this muh'fucker\nThousand miles later finally made a stop\nSmall town restaurant, God damn the waitress hot\nOrdered tater tots, got her number, later that night\nWe was at the bar, takin' shots 'til we fell in love\nI said let's go Las Vegas and do this\nKnew this was the mate for my soul\nDrove all night and was awakened to cold\nShe wanna play the slots, nicknamed her Tater Tot\nCause of how we met, \"cool I need a shower, bet\"\nFound a motel on the strip, I'm checkin' in\nWhen out the blue some Mexicans came in the lobby like they 'bout to shoot\nSome Asians that was runnin' down the hall with they guns brazen\nNow e'rybody pullin out they shit like it's an invasion!\nThe Mexicans let them Asians have it; Asians had to fire back\n'til they was outta bullets and the blood splattered everywhere\nDeal gone bad or somebody robbin'\nEither way somebody's rotten all I hear is bodies droppin'\nI jump behind the front desk in the nick of time\nThe crook is on the floor, his blood made me slip and slide\nBut I'm the last man standin'\nA reflex made me grab a cannon out a dyin' man's hand\nThen I noticed that a car was runnin'\nSack of guns on the floor plus unmarked bills by the hundreds\nDriver comin' at me gunnin'\nSirens blarin' in the distance cause the cops are comin'\nI spun around and I hit the deck\nHeard the bullets whiz by my ear I let off, hit him in the chest\nQuicker than the bullets left the chamber\nI grabbed the sack off the floor hit the door with the bangers\nLookin' for my lady at the casino, she was in the zone\nI said \"We gotta go\" she like \"Why?\" and I'm like \"C'MON!\"\nNo need to gamble baby, here the lick\nPut the chips down we gotta go right now, this little shit\nNow we speedin' down the I-15\nFirst time I noticed that her eyes were green\nGave her a gun and a magazine\nI made her count the loot {*count the loot baby*}\nBut when she saw the score she pointed the gun at me\nNow she about to shoot {*blam, blam blam*}", "image": "https://images.genius.com/195bc58c1487ceee38b62b9e3ae90bdb.300x300x1.jpg"}], "artist": "Talib Kweli"}