{"songs": [{"title": "When I Get to Heaven", "album": "Lethal Injection", "year": "1993-12-07", "lyrics": "[Verse 1]\n\nListen to the preacher man\nBut are you talkin' to me?\nI can't here ya with a mouth full of pigs feet\nThy shouldn't eat the swine flesh\nYa body is a mess, but ya blessed\nWith the Father, Son, Spirit, and the Holy Ghost\nBut my whole neighborhood is comatose\nLookin' for survival\nThe devil made you a slave\nAnd he gave you a bible\nFour hundered years of gettin' our ass kicked\nBy so-called Christians and Catholics\nBut I'mma watch 'em burn in the fire\nSee I'mma G that's why I ain't in ya choir\nCause I see, cause I know\nThe church ain't nothin' but a fashion show\nGet the devil do a one-eighty-seven\n\n[Hook]\nAnd they won't call me a nigga\nWhen I Get To Heaven\n\n[Verse 2]\n\nYour waitin' for the devil to come from the ground\nClown, take a look around\nJust look at the cross that the priest is holdin'\nA beast, in sheeps clothin'\nBut I'm rollin'\nWith that knowledge of self\nCause Heaven ain't just wealth\nSo mister preacher\nIf I couldn't pay my tithe\nDo I hafta wait outside?\nWhite man, please take another look\nCause we couldn't be readin' out the same book\nCause you's a crook, and I'm a brotha\nKing James had sex with his motha\nIs that your edition? Is that your religion?\nBlack men you gotta make a decision\nCause God is comin' on day number seven\n\n[Hook]\n\n[Verse 3]\n\nThe same white man that threw me in the slamma\nHe bombed a church in Alabama\nSo if I cocked the hammer God won't mind\nIf I have to kill the human swine\nCause God is a killa from the start\nWhy you think, Noah had to build his arc\nAnd God is a man from his feet to his hair\nThat's why you say \"amen\" after each and every prayer\nI just stare at the church man\nSpendin' more money on the church-van\nBut Elijah's got a plan\nGot the white man screamin', \"Damn, that Farrakhan\"\nCause one day these babies'll up rise\nMuch more than bow ties and bean pies\nKickin' knowledge at the Seven-Eleven\n\n[Hook]\n\n...But when it come to standin' up\nWe find a convenient excuse, to lay down\nBack away from struggle", "image": "https://images.genius.com/7130347bb47a4a618915a6de2818699a.1000x1000x1.jpg"}], "artist": "Ice Cube"}