{"songs": [{"title": "Kill Dem (Remix)", "album": null, "year": null, "lyrics": "[Intro]\nMek we get mad to bloodclaat!!!\nAll a di people who waan hear one big bumboclaat tune now go so! GO SO! GO SO!\nListen dat tune yah!\n\n[Busta Rhymes]\nHeh! A KILL DEM!!!! Remix, Busta Bus!  KILL DEM!!!! Remix, Mavado!\nKILL DEM!!!! Remix, Bounty Killer!\n\n[Verse One: Busta Rhymes]\nWah gwaan! Big Bus Rhymes inna di place, big gun still inna mi waist (Yeah!)\nWe don't like when man stand up and a crowd up mi space, cutlass dig inna yuh face (CHO!)\nSee di way mi come a bring anodda classic, come through gunman a rinse every ratchet\nBloodclaat mad, as I return wid di remix wid di Warlord and di Gully God (YEAH!)\nMek sure yuh have mi money inna di brown bag (GWAAN) Fuck wid mi money if yuh tink seh oonu bad\nMi have somethin fi yuh and yuh know seh yuh nuh used to\nSend gal ova and stand up and shoot yuh (HEH HEH HEH!!)\nWell, look how di whole a we a run when mi deh bout inna di place oonu fi know dance DUN\nGlad fi see di way di people dem a have fun but mi nah go nowhere and leff mi racthet dem a come\n\n[Hook: Busta Rhymes] (*Pharrell) (Tosh)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\n(*Look at that muffin!) (What di bloodclaat dem a talk bout!) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (*Look at that muffin!)\n(Dem a know seh we run this bloodclaat round here!)\n(*Look at that muffin!) (Weh dem a really a deal wid?) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (Yuh nuh know seh a we run this bumbohole!)\n(*Look at that muffin!) (YAH HEAR MI!!!!!!!!!)\n\n[Verse Two: Mavado]\nIt's just mi!!!! My girl and my fuckin gun!\nYeah! Dem a be on di fuckin run!\nI don't really give a fuck, unda di moon or di sun\nPussyhole betta tek wey dem bloodclaat self when di hear God a step pon di ground\nShots fly through head, more than flesh see, dat raw like cup widout dressin\nPussyhole should a know seh mi up until, mi get a bloodclaat blessin\nEven when dem dead, mi keep pressin, mi pressin dem stressin blood leff him\nHow di fuck, dem fi rise dem forgot when di dogs dem don't waan nuh vet in\nGunshot dem fi get, dat dem gettin, it's easy, I ain't sweatin\nBwoy, even a tabernacle pon di hill, Killer gun dem go check in\n\n[Hook: Busta Rhymes] (**Bount Killer)  (*Pharrell) (Tosh)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\n(*Look at that muffin!) (What di bloodclaat dem a talk bout!) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (*Look at that muffin!)\n(Dem a know seh we run this bloodclaat round here!)\n(*Look at that muffin!) (Weh dem a really a deal wid?) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (Yuh nuh know seh a we run this bumbohole!)\n(**RELAX!!!! BOOM!!!!)\n\n[Verse Three: Bounty Killer}\nAlliance di meanest, war extremest, ain't neva dreamed this, or even seened this\nChalk round body and it a murder scene this kill bwoy di cleanest bwoy weh move leanish\nChat and dem a bitch like seh dem a tek penis, Flipmode, Gully, Alliance a di team this\nPeople dead and this time mi mean it, run up inna mi gun and di whole clip mi gi him it\nBut Killer head hot, hotta than a oven, hotta and bun up like a pot on a stove, and\nSome a map, dem a map, and a hop dem a hop, But I are di one who's chosen\nWell!!! Killer war dem a use to, shoot up di car wid di rum and di boots too\nBwoy yuh a nyam gal cherry and a bum like berry and a suck pussyhole man a go shoot yuh\n\n[Hook: Busta Rhymes] (*Pharrell) (Tosh)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\n(*Look at that muffin!) (What di bloodclaat dem a talk bout!) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (*Look at that muffin!)\n(Dem a know seh we run this bloodclaat round here!)\n(*Look at that muffin!) (Weh dem a really a deal wid?) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (Yuh nuh know seh a we run this bumbohole!)\n(*Look at that muffin!) (YAH HEAR MI!!!!!!!!!)", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}