{"songs": [{"title": "Skill Still Appeal", "album": null, "year": "2009-11-10", "lyrics": "[Verse 1: Kendrick Lamar]\n\nUghh\nYeah\nKendrick Lamar\nHa ha haha HA\n\nThis feels like, right in front of the freeway\nAnd when I'm done this should be in front of a DJ\nI watch whack rappers put their soul on Ebay\nThen expect excellence knowing their effortless\nI don't have a preference, I dislike all\nSay you run the globe? Well more like a disco ball\nI spread love as well\nLittle nigga, big dreams, can bear-hug a whale into a lobster's tail\nUgh\nEvacuate premises, rap's sinister suspicious\nThe pastor stand back, the bible is open, the words have been spoken\nThe moon and the stars align with the bars\nThe broads are snapping their bras in broad day\nCops meeting their quota running for arcades\nThe three initial's on the pistols printed all K's\nThe end is almost near, inferior of nothing\nSuperior is an option and my synopsis is that I'm Frank Sinatra\nOn the roster, top running\nRunning races with my own shadow\nLook in the mirror then I start to battle\nNow a pyru is a crip, nor a pyru's just a value that is sure to be heard\nLike a fuckin sheep's cattle, niggas got some nerve\nTalkin bout they move birds\nOnly thing I move now is a noun and a verb\nI am now on the verge of telling the real story\nOf a Compton native in the city \"that kill for me\"\nCus you fabricated the realness\nThe county building and the county children on food stamps\nGlorifying street cred, talkin' about \"whoop whamp\"\nBut that's never the case\nJust a good lawyer who can sever the case\nRecording live from the city where the skinny niggas die and the semi bullets fly\nDrinking Remy out bottle till the pain run dry\nLike a desert\nOnce the Desert Eagle ride by, what you reppin?\nWhat you reppin my nigga, you got a weapon?\nWell I got a profession my nigga\nIt's called hip-hop since Pac was on gridlock\nMe against the world every hour, every second my nigga\nYou want something, get something\nI could start a career AND I can end one, I'm H1N1\nUGH\nStraight-A student who flow stupid\nReal raps get permanent income, UGH\n\n[Outro]\nBeats and bars\nKendrick Lamar\nMaestro whattup?\n\nHa ha haha", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}