{"songs": [{"title": "Use Ur Love", "album": "Hi! My Name Is B.o.B", "year": null, "lyrics": "[Intro: B.o.B]\nI met a little shawty on a Wednesday night\nAnd she was chillin’ in the VIP\nI said hey girl wha-what’s you name?\nShe just smiled and it was over\n\n[Hook One: B.o.B]\nCause I just wanna use your love tonight (yeah yeah yeah)\nAnd I just wanna work you girl all night\n\n[Verse One: B.o.B]\nMy girl was on vacation so out in microwavin’\nSo I went out late chasin’ and met a girl mixed with Asian\nI don’t wanna seem impatient so I told her its late forget a date\nAnd B.o.B wanna lay it and that’s the truth just face it\nAnd don’t get mad and angry you know you ready ain't ya?\nYou lightin’ cigarettes up ‘cause you are very anxious\nAnd ‘cause I was a stranger now your legs in the ai-r\nSome may call me a player ‘cause the way I treat females ‘cause\n\n[Hook Two: Outfield sample] + (B.o.B)\nI-I just wanna use you love tonight\n(So baby please don’t leave me waitin’)\nI-I don’t wanna lose your love tonight\n(So baby please don't leave me hangin’)\n\n[Bridge: B.o.B]\nOh no no no please don’t tell me that you about to go go go\nThey know you like my swagger how I roll roll roll\nSo don’t you get there action’ like your so so cold\n‘cause I ain’t here to chase you down (yeah yeah yeah)\n\n[Hook One]\n\n[Verse Two: B.o.B]\nYeah you know I’m so bud\nUh I’m so, I’m no love\nMy homies don’t trust\nPlus the four months\nAnd don’t the she bed\nA rope that’s from head\nAnd so she like bud\nI’m wrapped in more\nLookin’ at a body like yours\nAnd I’m tryna get some oral\nThink young lady named Dora\nBut ain't really talkin’ on a girlfriend scale\nYou already know what world this is\nSorry if your feelings get hurt my dear\nI send you a text when your birthdays here\nJust stay there here’s a little donation, and I'll see you on the next occasion\nJust don’t be everywhere I relocate ‘cause I don’t need probation\n\n[Hook Two]", "image": "https://images.genius.com/d8cefe97bbbe251a84c87f853a533f10.500x500x1.jpg"}], "artist": "B.o.B"}