{"songs": [{"title": "No Rest for the Wicked", "album": "Cypress Hill III: Temples of Boom", "year": "1995-10-31", "lyrics": "Bitch-ass motherfucka! Peter Pie ass nigga! Stand on your own two feet, bitch! How the fuck you gon' bite somebody else's dick, nigga? Yours ain't long enough to put in your mouth! What's up with that shit?\"\n(Background): \"'Turn that shit up louder!'\"\n\"Muggs, make it rough.\"\n\n[Verse 1: B-Real]\nSo many fools swingin' from my sack\nLet's talk about the one who had my back!\nDown in the west coast, so lemme kick it\nTo the motherfucker who calls himself \"wicked\"\nNo rest, no peace, no sleep\nDoughboy rolling down the hill 'cause it's so steep\nJackson... lemme figure out the name\nJack cause you be stealing other niggas' game! (Lying-ass motherfucker!)\nBut I'm the wrong nigga you wanna fuck with\nOn my dick so hard, now ya wanna suck it!\nGo on the head, gobble up the nuts\nGet your lips ready & tear this motherfucker up!\nTalk about Eazy, correct yourself\nCube, better step back and check yourself!\n\nYeah, nigga! My homie thought he had a homie in you. He let you listen to our motherfuckin' cut, and you turned around and put some old \"Friday\" shit out. What kind of shit is that?\n\n[Verse 2: B-Real]\nHmmm... let's talk about this\nFirst solo album on the east coast dick\nThe east coast niggas all showed ya love\nEspecially the one known as King Sun\nHe tried to warn us niggas about ya\nBut nobody would listen\nEven began dissin'\nTwo albums later, you callin' my crew\nAll because ya wannabe Cypress Cube (No way, motherfucker!)\nShoulda known you couldn't hang in the alley\nGood boy went to school out in the valley\nFuck it, lemme make this understood\nSpeakin' on mama's little Boy N the Hood\nNo Vaseline\nJust a rope and a chair and gasoline (burning your ass up!)\nLench Mob is a friend of mine\nBut you talk about them niggas from behind\n\"You know what a chazzer is, O'Shea?\nA motherfucking pig that don't fly straight\"\nWhere ya gonna run to? Where ya gonna hide?\nTaadow! Look at who's waiting outside! (Cypress, motherfucker!)\n\nI got a can of kick-ass wit' your motherfuckin' name on it, Cube. You wanna come collect it, or should I bring it to you?\n'Cause all that bullshit you doin', ain't shit fly about that shit... motherfuckin' thing, and I ain't bullshittin'\nYou need to back the fuck off, and that's real. Kick rocks buster!\n\n[Verse 3: B-Real]\nNatural Born Bullshitta\nLemme hit ya with a dose of reality when I get wit' ya\nYour homie came knockin', he had to chain my suit\nYou put a pipe on your cover, even though you don't smoke Buddha\nLet me take you down under on a plane\nWhere everybody was going insane\nTook a look at the Real one: afro gone\nThe next morning, you didn't have yours on\nHow many ways will you bite my shit?\nWould ya wet me or start throwing up a set?\nCaution, when you enter the zone\nNever used to bang 'til you heard the microphone (Studio gangsta!)\nI got Cube melting in a Tray\nPulling up his card and fucking up his \"good day\"\nUnoriginal rap veteran...\nThe nigga who say he don't steal from his friends (\"I don't steal from my friends!\")\nDon't trust that nigga named O'Shea\nFuck him, and send him on his way!\n\nCypress muthafuckin' Hill, the hardest mothafuckin' posse there is out here, nigga. So how d'you figure you was gonna step to this? Yeah nigga, the big damn-wham-bam Cypress Hill\nTibby-tibby-toe fool, all for your mothafuckin' dope\nNigga, you can't hang with the hill\nWhat the fuck you was thinkin' about? You know you step to this, you gotta step correct, 'cause Cypress ain't havin' that shit\nYeah nigga, we crack and fuck you next, who gives a fuck, a mad fuck? So bring it on, if you wanna test it", "image": "https://images.genius.com/05081a10b4aaa2a1d10f8ab1c10a10c8.1000x1000x1.jpg"}], "artist": "Cypress Hill"}