{"songs": [{"title": "No Omega (extended remix)", "album": null, "year": null, "lyrics": "No Omega\n\nI'm the Alpha, with no Omega\nBeginning without the, end so play the\nEye inside, no extended version\nNext episode be smooth as a Persian\nRhyme everlastin, there'll be no part two\nKnowledge is infinite, once I start to draw\nA better picture for your third eye, if you're blind\nYou know with a mic, I'm a black Michaelangelo\nI'm the brother who ID ideas are colorful\nGivin em insight, but givin em trouble to\nComprehend cause they thoughts won't blend in\nThey're pretendin, while I'm extendin\nYou bite like a parasite, said that it you attacks\nBut you won't strike, cause you ain't no match\nYou need more light cause yours got dim\nThen you get sparked by the Lord Rakim\nWhat's the matter G, check your battery\nGo get charged up, then come battle me\nYou try hard and Die Hard, you ain't Eveready\nWhen they check the pulse, you'll be Dead as Freddie\nSHOP AT SEARS for new ideas\nCheck your engine and ask your engineers\nTo equalize, try to disguise it\nIf that don't work yo, then MIDASIZE it\nYou need more power, better bring Battlecat\nBut this ain't Grayskull, and you ain't rippin jack\nDon't drop the mic and jet for your tooley\n(\"Bring it to me!\")\nWe can go rhyme for rhyme til the mic stop the\nWorkin\nThen I'ma leave you behind the Iron Curtain\nAnd you'll remain backstage\nYour book is over, I ripped your last page\nChanged the endin, at least you went out rappin\nNow I'ma tell em what happened\nI filled the mic with explosives, and lit it up\nIt was too heavy to hold, he couldn't pick it up\nPass the mic, let him try to get paid\nHe hit the stage, it went off like a hand grenade\nNow scrape him off the floor and off my list\nI ain't a soloist, I'm an arsonist\nSprayed up, he said he was gonna do what?\nPlayed up, MC Grand but Pooh-Butt\nStole his lady, and drove her crazy\nYou asked me why - cause her man tried to play me\nI sent her back a nervous wreck\nAnd tried to put her back in check\nMy speciality is masterin the female species\nI specialize in her, until she sees\nWhere I come from, and why I came\nI tame the train til she manifest my name\nFill her with life until she burst with energy\nThen leave her restless, cause a lot of women be\nTryin to drain us, and leave us stripped dry\nPut holes in our pocket, but you ain't that fly\nI clipped your wings and bring you down to Earth\nAnd tell you what life is worth\nIt ain't rings and things that's materialistic\nYou wanna pip on, imperialist with\nFood for thought, cause I'm the shelter\nI'll be your clothes, keep you warm and help ya\nNot to be hot to trot by a haunt\nAnd why do y'all got to flaunt?\n(\"You gotta use what you got\nTo get what you want\")\nCool, I heat you up like a black mink coat\nHug your neck like a fat gold rope\nWords I speak and my DJ's cuts will warm ya ears\nLike mink earmuffs\nSo Eric show em how fast your hand'sll go\nSo the people in the stands'll know\nThat you don't scratch your cuts in the grave\nMoves in waves to my rhyme displays\nFloat, evoke, my tempo jets\nExpressions express when you kick steps\nKeep em, energetic, so let it\nPound in your head til what I said is embedded\nDon't forget it's copastetic, set it\nAnywhere you want your poetry's pathetic\nYou gets.. no.. credit.. til you get it straight\nLet's motivate\nNo intermissions cause it ain't commercial\nIf you wanna break then I'll reimburse you\nI won't let go so my mic won't drop, cause\n(\"I can't.. stop!\")\nVocabs is endless, vocals exist\nRhyme goes on, so no one can stop this\nEspecially when I start to say the\nRhymes with no omega\n\nNo omega\nNo omega\n\n(\"I can't.. stop!\")\n(\"I can't.. stop!\")\n(\"I can't.. stop!\") *scratched*\n\n(\"I can't.. stop!\")\n(\"I can't.. stop!\")\n(\"I can't.. stop!\")\n(\"I can't.. stop!\") *scratched*\n\n(\"I can't.. stop!\")\n(\"I can't.. stop!\")\n\n(\"I can't.. stop!\")\n\n(\"I can't.. stop!\")\n(\"I can't.. stop!\") *fades*", "image": "https://images.genius.com/a39c418c52aac094b7b6ccdec45b8c2a.400x400x1.jpg"}], "artist": "Eric B. & Rakim"}