{"songs": [{"title": "Beef", "album": null, "year": null, "lyrics": "Beef, what a relief\nWhen will this poisonous product cease?\nThis is another Public Service Announcement\nYou can believe it or you can doubt it\nLet us begin now with the cow\nThe way it gets to your plate and how\nThe cow doesn't grow fast enough for man\nSo through his greed he makes a faster plan\nHe has drugs to make the cow grow quicker\nThrough the stress the cow gets sicker\nTwenty one different drugs are pumped\nInto the cow in one big lump\nSo just before it dies, it cries\nIn the slaughterhouse full of germs and flies\nOff with the head, they pack it, drain it, and cart it\nAnd there it is, in your local supermarket\nRed and bloody, a corpse, neatly packed\nAnd you wonder about heart attacks?\nCome on now man let's be for real\nYou are what you eat is the way I feel\nBut, the Food and Drug Administration\nWill tell you meat is the perfect combination\nSee cows live under fear and stress\nTrying to think what's gonna happen next\nFear and stress can become a part of you\nIn your cells and blood, this is true\nSo when the cow is killed, believe it\nYou preserve those cells, you freeze it\nThaw it out with the blood and season it\nThen you sit down and begin eatin it\nIn your body, it's structure becomes your structure\nAll the fear and stress of another\nAny drug is addictive by any name\nEven drugs in meat, they are the same\nThe FDA has America strung out\nOn drugs in beef no doubt\nSo if you think that what I say is a bunch of crock\nTell yourself you're gonna try and stop\nEatin meat and you'll see you can't compete\nIt's the number one drug on the street\nNot crack, cause that was made for just blacks\nBut brown beef, for all American teeth\nLife brings life and death brings death\nKeep on eatin the dead and what's left\nAbsolute disease and negative\nRead the book 'How to Eat to Live'\nBy Elijah Muhammad, it's a brown paperback\nFor anybody, either white or black\nSee how many cows must be pumped up fatter\nHow many rats gotta fall in the batter\nHow many chickens that eat shit you eat\nHow much high blood pressure you get from pig feet\nSee you'll consume, the FDA could care less [sic]\nThey'll sell you donkey meat and say it's\nFRESH! For nineteen-ninety, you SUCKERS", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}