{"songs": [{"title": "Poe Man’s Dreams (His Vice)", "album": "Section.80", "year": "2011-07-02", "lyrics": "[Hook: Kendrick Lamar]\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\n\n[Verse 1: Kendrick Lamar]\nI used to want to see the penitentiary, way after elementary\nThought it was cool to look the judge in the face when he sentenced me\nSince my uncles was institutionalized\nMy intuition had said I was suited for family ties\nMy momma is stressin', my daddy tired\nI need me a weapon, these niggas ride\nEvery minute, hour, and second, ministers tried to save me\nHow I'm gon' listen when I don't even hear God?\nHeaven or Hell, base it all on my instincts\nMy hands dirty, you worried 'bout mud in your sink\nYou like to mistake a street nigga for real nigga\nThe same nigga that kill with ya will squeal with ya\nI deal with ya like my son, stare at the sun\nAnd you'll be looking in my eyes, homie\nStand for something or fall for anything\nAnd you working with two left feet at the skating rink\nBut anyway, this for my niggas\nUncles, 23 hours sending me pictures\nI want you to know that I'm so determined to blow\nThat you hear the music I wrote\nHope it get you off Death Row\nYou came home to a pocket full of stones\nA Metro PC phone, then you went back in\nSo when I touch the pen, the pen is in my view\nI'ma get it right, just so you...\n\n[Hook: Kendrick Lamar]\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\n\n[Refrain: GLC]\nAnd I do this for the city\nGot some Hennessy and my real niggas with me\nFuck the police, they gon' have to come and get me\nIf it feel good to you, holler if you hear me\n\n[Verse 2: Kendrick Lamar]\nYou like to mistake a street nigga for real nigga\nThe same nigga that kill with ya will squeal with ya\nI like to start it out from the bottom and build with ya\nBe on my last dollar and split the bill with ya\nI'm 23 with morals and plans of living cordial\nNot rich, but wealthy, there's nothing you can tell me\nMy killings are not remorseful\nThe city got my back and for that I give them my torso\nYou think about it; and don't call me lyrical\n'Cause really I'm just a nigga that's evil and spiritual\nI know some rappers using big words to make their similes curve\nMy simplest shit be more pivotal\nI penetrate the hearts of good kids and criminals\nWorrisome individuals that live life critical\nSo won't you bear witness while I bare feet\nSo you can walk in my shoes and get to know me\nBut anyway, this for my pops\nOn his lunch break eating in that parking lot\nOn \"Wanna Be Heard\" probably thought he worked my nerves\nBut really he was stressing me getting what I deserved\nSomebody said my name on the radio\nHe ain't know I was ready for the world that minute\nSo the next time he roll up and drop grams in it\nHe'll probably be out of work, laid back, while he...\n\n[Hook: Kendrick Lamar]\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\nSmoke good, eat good, live good\n\n[Refrain: GLC]\nAnd I do this for the city\nGot some Hennessy and my real niggas with me\nFuck the police, they gon' have to come and get me\nIf it feel good to you, holler if you hear me\n\n[Outro: GLC]\nChurch is definitely on the move\nAnd now we done took it up to the cathedral\n'Cause the ism is enormous, you know what I'm talking 'bout?\nWe out here rotating under the five P's\nProper preparation prevents poor performance\nYou know what I'm talking 'bout? Doing my thing\n'Cause I'm rotating with my speakers thumping\nFrom the Windy City streets all the way out here\nTo the streets of Compton, know what I'm talking 'bout?\nChurch is definitely on the move\nAnd we gonna continue to hustle and grow and develop by far\nAs I rotate with my true player partner\nBy the name of Kendrick Lamar, you know what I'm talking 'bout?\nThis is the ism, this is the vision, you know what I'm talking 'bout?\nYou gotta get up off your ass and get it, man\nThat's the only way your pockets gonna expand\nI tell you everyday, you know what I'm talking 'bout?\nApply yourself to supply your wealth\nOnly limitations you'll ever have are those that you place upon yo'self\nChurch is definitely on the move, you know what I'm talking 'bout?\nExercise your ism, and don't depend on no one else\nCathedral, church, \"ism\"", "image": "https://images.genius.com/1f3cde1d04f886d4d4eb88a2c26a4e4d.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}