{"songs": [{"title": "Party Over", "album": "The Infamous", "year": "1995-04-25", "lyrics": "[Intro: Prodigy & Big Noyd]\nWhatever? Party's over tell the rest of the crew\nYo P, it's on you, what you wanna do?\nWhatever? Party's over tell the rest of the crew\nYo P, it's on you, what you wanna do?\nWhatever? Party's over tell the rest of the crew\nYo P, it's on you, what you wanna do?\n\n[Verse 1: Prodigy]\nEvery day of my life since 11-2-74\nOn the street makin' non-stop CREAM galore\nPackin heat, stickin' up weed stores and more\nCollectin' interest off of extortions to settle my score\nIt gets deeper when things get real\nI'm down to stick a NatWest Bank for my meal\nAnd I'm from Hempstead, it's close to the shacks of Park Side\nWhile I'll be outside slingin', you always hide\nAnd don't come around to the crossroads of life\nWe're to the death, you and me, this beef for eternity\nI'm goin' out to the fullest extent\nSo far into my troubles it's hard for me to get back\nTo my everyday self and composure\nCatch you when you open then I bring you to a closure\nPut ice on a razor and freeze you in ya shoulder\nI went for ya grill but you dent from my boulder\nI know this kid who says he knows ya, because of that\nNow I know where you lay your head at and that's that\nSay no more, I put it on you while you was yawnin'\nMurder without warnin' the very next mornin'\n\n[Verse 2: Havoc]\nOnce we step through the door, party over, that's the endin'\nYou and your crew'll leave out, a bunch of dead men\nBump me and I'll bump you back\nYou ain't tough black, niggas like you just get their life jacked\nBut I'm a cool nigga til you push me to the limit\nBut try to play me and ya ass I get up all in it\nDon't try to cop pleas now son, it's dead and done\n(I gave you fair warning) So run and get your guns\nIt's on, time to show 'em how I perform\nMy attitude will transform, leave you dead plus wrong\nGettin' the flow within, representin' for Queens\nShit is real, why you hopin' that it's all a dream\nBut you can't wake up, one in the chest, you blessed\nChokin' off your own blood, don't blame me you brought your own death\n\n[Chorus: Prodigy & Big Noyd]\nAyo Noyd, it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\nYo Big Noyd it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\nYo Big Noyd it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\nYo Big Noyd it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\n\n[Verse 3: Big Noyd & (Ty Nitty)]\nMy beeper kept beepin', the other numbers started leakin'\n'Who is this on my mind?' I was thinkin'\nThen I realised it was my dun playin 9-1-1\nOnce I seen the numbers I ran for the fuckin' guns\nMy dun in trouble, I be there on the double\nI jumped up in the bubble, yo kid where are you?\n(1-14 between Manhattan and Morningside Avenue)\nThis happened just right out the blue\nAyo dun, fuck that bitch, tell her get off your dick\n(But she's cryin' and she says she has feelings and shit)\nYo it's a set-up, them niggas got me fed up\nTy stay in the buildin', if they move fuckin' buck em\nGet up off the scene, you know what I mean?\nAnd hold yourself down with the mother fuckin' sixteen\nGlock, and get off they block\nThen I hung up the cellular, ready to rock\nAnd it's on\n\n[Verse 4: Prodigy]\nYou get deaded in the streets, kid set it\nYou gots no credit, fool you get wetted\nUp with the semi-auto Mac double numbered\n'Did he shoot eleven or twelve?' is what he wondered\nNigga I got one more shot, you must be drinkin'\nPut the heater to his head, watch him start blinkin'\n'Am I goin to heaven or hell?' is what he's thinkin'\nSwitch to a bitch as his life start sinkin'\nDown to a level of no return\nCall it the heat 'cause when the slugs hit it definitely burns\nNow chill and think about your life for real\nEvery member of my crew is livin' life for real\nGot your self fucked into somethin' that you couldn't finish\nUp against the fulliest squad and get diminished\nI'm from Q-U-E another E-N-S\nSo why you small tough talk? I'm not impressed\nIf I seen you in the Bridge, I'd make you undress\nGive up the money, the Polo, especially the Guess\n\n[Outro: Prodigy]\nBig Noyd (Party's over, tell the rest of the crew)\nHavoc (Party's over, tell the rest of the crew)\nBlack Ice (Party's over, tell the rest of the crew)\nQueensbridge (Party's over, tell the rest of the crew)\nThe Big Twins (Party's over, tell the rest of the crew)\nTy (Party's over, tell the rest of the crew)\nYo, black (It's over, tell the rest of the crew)\nMy man Killa (Party's over, tell the rest of the crew)\nGerm (It's over, tell the rest of the crew)\nKarate Joe (It's over, tell the rest of the crew)\nRon Gotti (It's over, tell the rest of the crew)\nKi-Capone (Party's over, tell the rest of the crew)\nRasheim (Party's over, tell the rest of the crew)\nStobo (Party's over, tell the rest of the crew)\nTena (Party's over, tell the rest of the crew)\nSkins (It's over, tell the rest of the crew)\nAnd the whole fuckin projects! (It's over, tell the rest of the crew)\n(It's over, tell the rest of the crew\nIt's over, tell the rest of the crew\nParty's over, tell the rest of the crew\nParty's over, tell the rest of the crew)\nThe motherfuckin' party's over, tell the rest of the crew\nGet that nappy up\nYo get that nappy up\nSon get that nappy up\nQueens get that nappy up\nYo get that nappy up", "image": "https://images.genius.com/b07e53ad94c52f45245db1c1d49e6b00.1000x1000x1.png"}], "artist": "Mobb Deep"}