{"songs": [{"title": "One on One", "album": "Street Fighter (All New Songs From the Motion Picture)", "year": "1994-12-06", "lyrics": "[Verse 1]\nIn the Rotten Apple, take a bite, taste the worm\nEmbrace the world of reality we're faced to learn\nCoke connection drug bust, graveyards where thugs rest\nI keep my mug blessed,the evil is illegal substance sold\nRoll mob deep, guns in the black Jeep\nMAC-11's in Legends, cracks in the streets\nPatroller, gold money-folder, gun happy soldiers\nNever sober, takin' over, my blood is colder\nNiggas respect violence so I become it\nI'm from it, I even done it blunted, so run it\n\n[Interlude]\nYeah, son, you know what this is\nTake it off, [come on, dunn\nDon't even come at me like that]\n[Dunn, come on, dunn]\n\n[Chorus]\nYeah, imagine this: no guns, no knife\nIt's a one on one so now we gots to fight, son\nImagine this: no gun, no knife\nIt's a one on one, now we got to fight, yeah\nYeah, imagine that, no gun, no knife\nIt's a one on one, now we got to fight, yeah\nYeah, imagine this: no gun, no knife\nIt's a one on one, son…\n\n[Verse 2]\nYo, I'm a cream fiend with a mean dream\nBrain full of schemes, my crew's rollin' fresh out the greens\nGive you what you never seen, the infs on the MAC-10\nIt's 2:10 in the A.M. in the streets of Queens\nTry hard and die hard\nChances of survivin' the game is like tryin' to feed Allah lard\nI walk at piece with a deadly shadow\nThey want to blow me with the double barrel, foul, no sorrow\nI brawl with Blanka, caught Bison in the thinker, dome\nMake hell your new home, with the blue chrome\nMid-State wants me, suave fellow but raunchy\nThe soul of a cold body haunts me, I flee the country\nBut only to shed tears for years\nToo wild for my own self, hopin' help is near\nStreet fightin' was cool, but in school I brought a new tool\nDuelin' with the devil, a rebel, a fool\n\n[Chorus]\nImagine this: no guns, no knife\nJust a one on one so now we gots to fight, son\nImagine this: no gun, no knife\nJust a one on one, now we got to fight, yeah\nImagine that, no gun, no knife\nIt's a one on one, now we got to fight, yeah\nImagine this: no gun, no knife\nIt's a one on one, son…\nYeah, take it to the bridge – Queensbridge\n\n[Interlude]\nYo, whassup money? [Yo yo, do you remember this face?]\n[Yeah yeah yeah, run these, run these]\n*sounds of brawl* [Break you down! Get broke!]\n[No hands, run that, run that, run that, no hands]\n\n[Verse 3]\nI hear Jake walkie-talkies in my sleep\nMarked money I keep, play the benches all week\nI visualize Coups, alligators in suits\nElevators in my mansion that rises to the roof\nSippin' 80 proof, watchin' Juice, but hold up\nI see some brothers tryin' to roll up, wishin' I could fold up\nIt's hard to see their faces in they hoodies, I better boogie\nToo late, I tried to swing when they jigged me – I'm out\n\n[Outro]\nYeah yeah, kid, don't front\n360 degrees, knowhatI'msayin?\nThat's how it comes back at you\nQueensbridge, that's how we live\nSouth side, all that\nNew York, light it up, light it up\nYo yo, you saw how I snuffed that kid?\nYeah, I saw that, I saw that\nAin't no half  steppin' out here\nThat's how we do out here in the street fight!", "image": "https://images.genius.com/897b0696175067ca609ac877bcc03cab.320x320x1.jpg"}], "artist": "Nas"}