{"songs": [{"title": "Left Field", "album": "Hi! My Name Is B.o.B", "year": "2008-01-01", "lyrics": "[Intro]\nHey Bob! Get in here, man! Your sets ready, man!\nYou're going live in 5, 4, 3, 2-!\n[Announcer:] \"Ladies and gentleman, you are at [?] Cafe, and who you have coming to the stage is none other than B.o.B!\"\n[Audience:] (\"B-o who?\" \"What?\" \"Who's that?\" \"Who the fuck is that?\" \"I don't know who that it is..\" \"What's B.o.B\"\")\n[B.o.B:] \"Aha, I mean.. Ha.. See, I ain't really got shit to say, but look.. How y'all doing to night?\"\n[Audience:] (\"Nobody care what you got to say, nigga!\" \"Nigga say something!\" \"Boo!\" \"Boo nigga..\" \"Don't nobody fuck with that nigga music, don't nobody fuck with that nigga lyrics!\" \"Boo!\" \"Get off the stage..\" \"Fuck you nigga, get of the stage!\" \"Don't nobody give a damn! Ah.. shit\" \"Nobody give a damn!\" \"Lame-ass nigga! Hoe-ass nigga, dawg! Fuck that nigga!\")\n[B.o.B:] \"I got a little song, wrote it on the way over here, but check it out..\"\n\n[Hook]\nI know I'm left field to you, field to you, field to you\nBut don't it sound so real to you, real to you, real to you\nTell me how it feel to you, feel to you, feel to you\nNow don't it feel lovely? (Aha, aha) (Don't it feel lovely?)\nNow don't it sound lovely? (Now don't it sound lovely?)\n\n[Verse 1]\nI agree\nI'm playing at the left\nWas raised up in Decatur, so I'm straight up out the deck\nAnd G.A. is all I rep, so they say that I'm obsessed\nI grew up in the struggle so maybe I'm depressed\nBut being in the struggle is what gave me my success\nThis ain't your imagination, I ain't fakin it unless\nI don't mean what I say, but what I say is what I stress\nAnd I ain't really Catholic but, daily, I confess\nI ain't a Christian rapper or a civil activist\nBut everybody feel me cause I say the realist shit\nI see why haters get all mad, I don't brag\nSo here's what I got to offer:\nWords of wisdom so that you can get your money taller\n\n[Hook]\n\n[Verse 2]\nI'm lovely like the left field\nI know I ain't around, shorty, but I rep still\nDon't get to thinking that I'm different, because a record deal\nTurning Hollywood, come on - is that real?\nAnd still, I got alot of agony and stress on my chest\nCause the world ain't right, so I gotta come left\nI'm a keep it one hunnid till the day that I rest\nSo take a deep breath, I guess\n\n[Hook]", "image": "https://images.genius.com/adcf6114ce030b4f70858bc64c941f6f.496x496x1.jpg"}], "artist": "B.o.B"}