{"songs": [{"title": "Ain’t Hard 2 Find", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro/Chorus: C-Bo, D-Shot, Richie Rich, 2Pac & E-40]\nThey say\nInfluenced by crime, addicted to grindin'\nPreoccupied with my chips\nAnd niggas call me a timer\nI been ballin' since my adolescent years steady climbin'\nMan, you motherfuckers don't know nuttin' about no timin'\nThat's right, that's right boy, start that shit off\n\n[Verse 1: 2Pac]\nI heard a rumor I died, murdered in cold blood dramatized\nPictures of me in my final stage, you know mama cried\nBut that was fiction, some coward got the story twisted\nLike I no longer existed, mysteriously missin'\nAlthough I'm worldwide, baby I ain't hard to find\nWhere I spend most of my time, my California grind\nWatchin' for thievin', I'm cautious, it's like I'm barely breathin'\nPuttin' a bullet in motherfuckers, give me da reason\nSee me and hope I'm intoxicated or slightly faded\nYou tried to play me, now homicide's my only payment\nI'm addicted to currency in this life I lead\nWhy the fuck you cowards be runnin', too scared to fight a G?\nFor the life of me, I cannot see\nHow motherfuckers picture livin' life after a night of fuckin' around with me\nAnd if you don't like this rhyme\nThen bring your big bad ass to California, 'cause we ain't hard to find\n\n[Chorus: C-Bo, D-Shot, Richie Rich, 2Pac & E-40]\nInfluenced by crime, addicted to grindin'\nPreoccupied with my chips\nAnd niggas call me a timer\nI been ballin' since my adolescent years steady climbin'\nMotherfuckers don't know nuttin' about no timin'\n\n[Verse 2: C-Bo]\nI got my locs on, hard hat, goin' to war\nBreakin' them off on sight, stoppin' lives like red lights\nWatch 'em pause as I pull my strap out my draws\nAnd get to dumpin' on they ass like the last outlaw\nRich, 2Pac and The Click, smokin' blunts, loadin' clips\nWith enough shit to raise your block in one dip\nWe bring on horror like Tales From the Crypt\nAnd we ain't hard to find is the tales that we kick\n\n[Verse 3: B-Legit]\nI'm fully automatic, full of static and shit\nMovin' Dodge van, fifty rounds in the clip\nI'm ridin' shotgun with the tint in the back\nI'm plan to have a motherfuckin' mint in this rap\nI'm from the V-A-L-L-E-J-O\nWhere sellin' narcotics is all I know\nI got blow, speed, and weed, whatever yo' kind\nAnd if you need a motherfucker, I ain't hard to find\n\n[Verse 4: D-Shot]\nSome may call me bootsy, but I call it timin'\nThat's while I keeps on grindin' (that's right)\nTo the point where a nigga can't stop\nToo much feelin' this shit, that's why I'm quick to peel a bitch\nWhether it's a nigga or a ho, a ho\nGet in my way, then that ass gots to go\n'Cause a nigga steady plottin'\nI serves hit for hit, and motherfuckers keep droppin'\n\n[Chorus: C-Bo, D-Shot, Richie Rich, 2Pac & E-40]\nInfluenced by crime, addicted to grindin'\nPreoccupied with my chips\nAnd niggas call me a timer\nI been ballin' since my adolescent years steady climbin'\nMan, you motherfuckers don't know nuttin' about no timin'\n\n[2Pac & E-40]\nC-Bo, D-Shot, E-40, Richie Rich\nDa Bay, beitch!\n\n[Verse 5: E-40]\nDown the steps\nAbandoned broken down apartment complex\nHeavy metal weapons they carry, can't be scary\nPlayboy, what the fuck is a proof without the trauma plate?\nNigga, what the fuck you got a gun for if you gon' hesitate?\nBest shake and bake all them I-was-finst-to-ass niggas\nMotherfuckers-didn't-think-I was-gon'-do-somethin'-ass niggas\nThreaten your life, ain't like you love him\nBury your thoughts, take his head fuck him, have at him\n\n[Verse 6: Richie Rich]\n(Check this out)\nI grew up with that nigga\nThrew up with that nigga\nI hear he tryin' to ride\nDouble agent for the other side\nBut now, my Glock be so judgmental\nBack seat of a rental\nKeep my name out your dental, nigga\nIf your gum bleedin' and you needin'\nMore than twenty stitches, you behave like them bitches\nSideways to the next\nHeavy in the game\nCheck the resident, it's all the same\nNigga, and we ain't hard to find\n\n[Outro/Ad-libs: 2Pac, C-BO & E-40]\n[2Pac]: Hell nah we ain't hard to find\n[C-Bo]: The whole Clickalation fool\n[E-40]: Motherfuckers hard to find, right here bitch\n[2Pac]: Why them niggas actin' like they can't find us? Like they can't see us and like we don't be at the same spots they be at?\n[D-Shot]: It's the same congregation. Young Pac is back\n[2Pac]: You know what I mean?\n[C-Bo]: Nigga be lookin' all the way when he see you and shit\n[D-Shot]: It's a celebration\n[E-40]: Motherfuckers better understand this shit\n[D-Shot]: Young 'Pac is back\n[2Pac]: Ay D-Shot, nigga, can we get paid man?\n[D-Shot]: Oh my goodness, we got C-Bo in this muthafucka...\n[2Pac]Can we just go there and sock this shit up, please?\n[D-Shot]: Hey, we smokin', and we ain't hard to find\n[2Pac]: Drinkin' and shit, fuckin' with some Hurricane and some Thug passion\n[E-40]: A motherfucker's gonna get his marbles regardless, playboy\n[2Pac]: A check this out...You supposed to\n[E-40]: Believe in that shit\n[RIch]: Sideways to the next light, and to the next coast, poppin' the muthafuckin' most, you understand what I'm sayin'\n[2Pac]: Money over bitches, nigga, M.O.B., M.O.B", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}