{"songs": [{"title": "More Freaky Tales", "album": "Can’t Stay Away", "year": null, "lyrics": "[Intro]\nBEYOTCH!\nShort Dog's in the house, once again with this pimp shit\n\n[Chorus]\nThese are the tales, the freaky tales\nThese are the tales that I tell so well\nFor fifteen years I've been a real player\nSo if you wanna have sex say hell yeah\n\n[Verse 1: Too $hort]\nI met this girl in Atlanta\nShe let a nigga fuck but I still can't stand her\nThe pussy wasn't good I said \"What's up bitch?\nI'm tired of fuckin' can you suck dick?\"\nShe said \"No\", but she had another friend\nSo I switched like a real pimp\nLaying on my back with my dick in her mouth\nI said \"Beyotch!  What you talkin' 'bout?\"\nShe mumbled something, I don't know what she said\nSmoking on a joint gettin' some bomb-ass head\nBitch said her name was Theresa\nAll on my dick like cheese on pizza\nIn the A-T-L where the grass is greener\nI fucked Nina, Melina, Sabrina and Tina\nWhen I first moved out there, I met Holly\nFive-foot one with a bad ass body\nFreaky little bitch she was a Gemini\nShe used to stand up and say \"Shoot it in my eye!\"\nI met another girl went to Spellman College\nEvery day after school I acquired the knowledge\nI took her to my house so I could get some\nI fucked her real good and made the bitch cum\nShe was hella limber, said her name was Amber\nShe wouldn't stop screaming, that's all I remember\nI had another freak, her name was Wendy\nWhen I first met the bitch she said \"Please don't pimp me!\"\nI did it anyway\nI'm coming straight from Oakland, C-A\nAin't no other way, like my girl Shante\nShe lives in Atlanta, but she comes from the Bay\nLet me hit that hometown pussy on the strimp\nLook out for a nigga, treat me like a pimp\nYou know I can't forget about the strippers\nCinderella with the glass slipper\nTop down in the Benz ain't spendin' no ends\nFat bag of Indo, bring all your friends\nIt's like Lotto, you get a quick pick\nBitches said they heard I had a big dick\nSo I showed it to 'em, only took one second\nDick rock hard, bitches gettin' nekked\n\n[Chorus]\nThese are the tales, the freaky tales\nThese are the tales that I tell so well\nFor fifteen years I've been a real player\nSo if you wanna have sex say hell yeah\n\n[Verse 2: Too $hort]\nI know another bitch, her name is Terri\nI lied to the bitch \"It's about time I get married\"\nI couldn't see me pimpin' her\nSo I fucked her next door neighbor, Jennifer\nShe had two roommates, Cindy and Amy\nTerri caught me creepin' and said \"Nigga don't play me!\"\nBut them hoes liked to freak\nI used to send 'em new niggas every other week\nI never would tell you all the hoes I fucked\nThese are the tales, some of this shit I made up\nI change the name so I can rhyme and shit\nSo if it's you, you know the time bitch!\nI spent the night with Monique in between the sheets\nIt was her, her girlfriend April and me\nI do it on the regular, two at a time\nCall it what you want I be a fool wit' mine\nLike them Texas niggas, I never would change\nLike my niggas up in Cleveland spit the good game\nThese hoes recognize when I come in the door\nI ain't trickin' bitch, so what you want me for?\nLike Natalie, swearin' up and down I had to be the one\nBitch lets have some fun\nI fucked her, you thought I didn't\nShort Dog's in the house and I keep on pimpin'\nSo then I fucked the twins, Sharon and Karen\nWent straight for the panties, but they wasn't wearin' 'em\nDon't ask me who I fucked first, it ain't my fault\nIn the end, I still got the same results\n\n[Chorus]\nThese are the tales, the freaky tales\nThese are the tales that I tell so well\nFor fifteen years I've been a real player\nSo if you wanna have sex say hell yeah\n\n[Verse 3: Too $hort]\nHell yeah, I never would forget Charlene\nWe was layin real close like two sardines\nTalkin', laughin', kissin' and shit\nNext thing I know she started kissin' my dick\nYou know the rest, before she left I paged Mia\nI told her \"I got a new freak over here\"\nShe rushed over, I left and when I came back\nThem hoes was lickin' cats\nThey call me \"Short\" when I'm pimpin', \"Dog\" when I'm mackin'\nGotta get the money, that's all that's happenin'\nShe wants to be my love slave, I need some bug spray\nTo keep these hoes away\nI never would tell you all the hoes I fucked\nThese are the tales, some of this shit I made up\nI change the name so I can rhyme and shit\nSo if it's you, you know the time bitch!\n\nThese are the tales, the freaky tales\nThese are the tales that I tell so well\nFor fifteen years I've been a real player\nSo if you wanna get fucked say hell yeah (hell yeah)\nBeyotch!\nAnd it don't stop\nOld school Short Dog\nStill spittin' it\nStill gettin' it\nGettin' that money\nEastside baby, Oakland\nYou ain't knowin?\nBeyotch!", "image": "https://images.genius.com/31a42aa43e1b297422c8b89c0ea0a2c0.500x493x1.jpg"}], "artist": "Too $hort"}