{"songs": [{"title": "A Bitch Is a Bitch", "album": null, "year": null, "lyrics": "[Method Man]\n\nOoh yea I'm on my way to get some hay\nI'd Rather not say right now, but anyway\nI'm F**kin wit this gangsta bitch around\nThe way. Who was ?? and the games\nPeople play. A Hoe is a M-O could keep\nShit down low. I'm wit dat ya know my\nStyle so what da flow? Its been 3 weeks\nNow my girl still don't know but what\nShe don't know can't hurt her or make\nA murder. The next peace..? She don't\nWant to have peace, she just wants\nTo have fun so I hook her and I treat her\nLike one. Bust it! Look in tha local\nProject, when I buzz her; on the 5th\nRather brother make a dozen? Floor she\nHad a child but because I'm half poor kids\nBuy dread the next door. He don't know\nThe meaning of child care, 'cause she's on\nWelfare looking at..? So raps the same\nYearSo I took advantage of dat before it\nWas..? and pull'd a stack, and now what\nI'm stickin it up without a doubt, and then\nShould I go upstrairs? F**k dat rap too\nMany hoes up in dat place. I just can't\nWait to find out til (??) All around town\nThe Meth is gettin down. With ? and..?\nBITCH! don't rock the buck? I'm not a\nBuck smakin bitch's teeth down their\nThroats. So I avoid all of dat, and call\nHer back I was drinking all night, Kid\nI need it bad, wassup ho? how you?\nLoungin Through..I ain't got nuthin to\nDo so wassup wit you? Treat her like\nA rough situation, You know whats on\nMy mind you wit it? Now she's all(?)\nAnd need some water, Before she had\nTo ask her 'cause to watch her daughter\nYea, come down down strairs were\nGoin where? Straight to da vid..(??)\nSum-it up check my dough for body (??)\nShe comes back out of her house we in\nDa cab. Not much longer to want,(??)\nStep right in and got a (??) Then I seen\nHer wit a man down the curl, [Pause]\nOoh Shit! Dats my girl! Whats goin on\nKid? Hear all my words motherf**ka..\nF**k dat Bitch! I'm gonna f**k her!\n\n[Meth talking] (Da f**k you doin with dat nigga?)\n\n[Method Man]\n\nA Bitch is a Bitch..and is always\nA bitch. Cracked and shit like a witch\n\n[Closing] Out from the slums..there she comes", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}