{"songs": [{"title": "The Mask", "album": null, "year": null, "lyrics": "Head on straight, mask on crooked\nExit stage left with the cash, gone took it\nOff like a koufi, the fit was a bit doofy\nHe tried to get screwy, with that \"two for you\nOne, two for me, G,\" cut the cranky attitude\nWet him like a handkerchief on a stanky fatter dude\nWhether you's a rapper or dang sanger\nOnce you in the zone only one way out, like a gang banger\nWith a new crew keychain and street name\nWhat set do he claim for fame, peep game\nJust to keep feta and stay dip\nYou need it like a letter or better a getaway whip\nThis old things rusted, encrusted as the gold rings the old kings busted\nPlan to end global starvation and fat her\nNow what in tarnation did I go and do that fer?\nStuff happens, like gettin' snuffed for tough tit rappin'\nSee, I told 'em enough, quit yer yappin'\nThe same applied to any and all chumps\nThe only question he had for y'all is how many lumps?\nThree or four? either or? mon cheri amour\nSee, why you need your heater for?\nThe super villain slid in your party for free\nWarn a emcee, get outta here kid, you bother me!\n\nThe day I took my mask off my face was missin' for two days\nFor the record, G, came back a year later, whole new identity\nTony Starks pedigree, my money green like my nickname was celery\nWho is Ghost who flashes toast, never wore sheets but bulletproof coats\nOh no! the fans cry for the mask back on\nTold 'em \"Ghost is dead, he'll return at the crack of dawn\"\nFew years from now, him and his pals before the Jetson-era arrived\nHe'll be back summertime, 2000 and 5, with a half a face iron\nThe other half water look like alien science\nIn the summertime, you can see the face boil\nBut the other side I keep blue with the Penzoil\nMad loyal, when the wintertime come, (what?)\nI get stuck 'cause my brain all numb\nLike I ate a thousand icee's and frozen Pepsi's\nAquaman's pops can't water-check me, disrespect me, indirectly\nI seen his feet and they both lefty, he's steppin' half correctly\nAs I stroll the globe and terrorize the planet\nWith a Bill Clinton mask and them Playskool hammers\nMe and DOOM, always be the best on the landin'\nSuperhero's for life, until our souls vanish", "image": "https://images.genius.com/227de22e535416c2ec2a6f012f37c9ef.620x400x1.jpg"}], "artist": "Ghostface Killah"}