{"songs": [{"title": "Heaven Somewhere", "album": "Electric Circus", "year": "2002-12-10", "lyrics": "[Intro: Common]\nPhone rang\nScreen said caller ID blocked\nBut for some reason, I decided to answer it\nOn the other end, was a French accent\nHe told me we needed to rap quick\nCause he had did some bad shit\nAnd would be gone for years\nBut spending these last two days with his momma and his kid\nWhen he spoke, I wasn't trying to hear it\nCause I knew he was a real good person\nAnd this didn't seem like it was in his spirit\nHe couldn't believe as much as I couldn't, what he had done\nHe said now it's time for him to turn himself in\nFor no longer could he run, from life, from God\nI started thinkin, \"Why is doin' right is so hard?\"\nI thought back to when we was in London\nDiscussin' the New Testament, and how our lives related to it\nAnd how we could make the best of it\nMy voice became desperate, so I asked him, \"Why you gotta go?\"\nHe said, \"You know, turn to Matthew 24\"\nHe said, \"No one knows the hour, nor do they know the day\nBut the kingdom is near; don't let anything lead you astray\nAs long as God is with me, everything will be okay\"\nSo right about then, we decided to pray\n\n[Refrain: Omar Lye-Fook]\nJust lying back, making the smoke disperse away\nDeep into clouds (deep into clouds)\nIt's making things appear to me so clearly\nDeep in the clouds (deep in the clouds)\nJust lying back, making the smoke disperse away\nDeep in the clouds (deep in the clouds)\nIt's making things appear to me so clearly\nDeep into clouds (yeah)\n\n[Verse 1: Cee-Lo Green]\nYour time, is a terrible thing to waste!\nFor there's, not one of these possessions\nThat you can bring to space (yeah, it don't matter)\nIt's a challenge\nBut the chance of seeing it, is quite a dream to chase (yes it is)\nI hope, I remind God of him\nWhen he sees my face (yeah he will)\nHe gon' see it!\n\n[Verse 2: Bilal]\nHigher (keeps on)\nThis feeling just keeps on, hehe, lifting me higher (ever)\nAnd it's ever flowing, it's ever flowing (keeps on)\nWhen everything, puts a smile on my face\n(Ever flowing, ever flowing)\nAnd I recognize this strong goal\nBut I keeps on going\nI keep on going (he keeps on going)\nI keep on going on, ohh\n(He keeps on going, he keeps on)\n(He keeps on going)\n(He keeps on going, he keeps on going)\n\n[Verse 3: Jill Scott]\nAll mighty love, watching over me\nA smile, brilliant\nAll over, constantly\nWarm, comforting (comforting)\nPerfect, like, no-thing\nNo haze, no confusion, no strain\nSimply, peace\nSimply, simply, simply, simply\n\n[Verse 4: Mary J. Blige]\nNo fear! Heaven is to me\nNo fear of destruction, oh oh oh oh\nUnderstanding who he is\nHis name is Christ, yeah (oh oh oh oh)\nHeaven, Heaven is to me\nWisdom, understanding, knowledge\nOh (understanding)\n\n[Verse 5: Erykah Badu]\nStreets of gold and pearly gates\nHalos wings all dressed in white\nHah (hah) hah (hah)\nAngels sing and cymbols glare\nNo one's rich, no one's poor\nHah (hah) hah (hah)\nPeople dreaming they live free\nMaking love while they in love\nHah (hah) hah (hah)\nWonderful dream\nWake me when you're home\nHah (hah) hah (hah)\n\n[Outro: Lonnie 'Pops' Lynn]\nHeaven? Heaven is being Pops\nHeaven is spending a day with the grandchildren\nListening to they voices, and laughter and play\nAnd then at the end of the day\nWe hug, we kiss, and slowly they walk away\nAnd then suddenly, they turn and rush back to me\nAnd hug me around the knees\nYeah, that's Heaven to me", "image": "https://images.genius.com/4f09b702f3b5aead8b4d73c0bfdb708e.936x936x1.jpg"}], "artist": "Common"}