{"songs": [{"title": "Voltage", "album": "B.o.B Vs Bobby Ray", "year": "2010-02-02", "lyrics": "[Intro/Chorus: B.o.B]\nWell she strike like a lightning bolt\nShe highly electric, a thousand volts yeah\nShe'll shock you up out your clothes\nOne strike then there she go\nI'm talkin 'bout her\nOh yeah!\nI'm talkin 'bout her\nOh yeah! I'm talkin 'bout..\n\n[repeat 2X over end of Chorus]\n(Talkin 'bout her man) (Oh yeah)\n\n[Playboy Tre]\nNow baby girl's highly electric, cute but deceptive\nStraight high voltage, fool with the poses\nWill I smoke it? Ye ain't gotta ask me\nI make her strip like Puff did Cassie\nFrank White, Lil' Kim, lick her on her chest\nAin't nothin like a tit with a lil' Henn'\nGot her new, tryin to get it in\nSayin shit like \"Girl just once let me put it in\"\nI'm talkin 'bout her\nTalkin 'bout girl, you fine as fuck\nSo talk about me, up in that P\nLeg to the West, one leg to the East (spread 'em)\nAnd let me go deep, like Roddy White\nStood up in it and the girl got hype\nBut man I don't know, somethin ain't right\nShawty got different niggas callin all night\nI'm talkin 'bout her\n\n[Chorus]\n\n[Mickey Factz]\nJack in, jack in\nGivin me a feeling like a Blackwood, Blackwood\nMomma's so appealing and I got this, option\nThat we can get it poppin\nAnd right after I plug her\nI can take her to an outlet for shopping, shopping\nBut I don't know if I trust her\nSo I gotta go, peace out, he's out\nLike all up in my head tweaked out\nKeep out, I don't know what to think, she's out\nOn the town gettin frisky\nRaising the hairs on my arm when she with me\nShorty got charm\nLucky just to be with her, breathe with her\nBut T-R-E's with her, and he did her\nDeliver her to me, currently, it worries me\nWhat her and he did vertically\nIf I see her with him I pass out\nNo bolts, no volts or pulse I black out\nOw!\n\n[Chorus]\n\n[over end of Chorus]\n(I'm talkin 'bout her bro) (You mean her?)\n(Yeah her bro) (Hehehehe)\n\n[B.o.B]\nI'm talkin 'bout she's so psychadelic\nShe's so cool you can tell she gellin (hehe!)\nAnd Led Zeppelin sell it\nIf she were a statue, she'd be a relic\nStrikin like venom, in all white denim\nSugar in the brain cells on my neurons\nI'm on her like the Hamburgler on buns\nRunnin like the marathon you run\nSomeone gave her a medallion\nKickin like kung-fu from Shaolin\nWhich means how she looks is arousing\nAnd so I'm thinkin how lucky her blouse is, yeah\nBuilt like brick houses\nAppraised at about eight hundred thousand, heh\nAnd so the whole place shoutin\nSo for her I gotta scream this ballad, like\n\n[Chorus]", "image": "https://images.genius.com/43ec171838184bac0a8baa89f9e6d0a9.600x600x1.jpg"}], "artist": "B.o.B"}