{"songs": [{"title": "Hustler", "album": "My Homies", "year": "1998-03-03", "lyrics": "[ VERSE 1: Lo-Lo ]\nUno is for the money, deuce is for the show\nTrey is for the video, what the fuck is fo'?\nFo' is for the hoes, and 5 to stay alive\nThat shoulda been number 1, cause I don't wanna die\nAdd 6 when I begin to flip the big Benz\nWith the candy-coated paint, plus the 20\" rims\nAnd what they hittin fo', I roll 7 out the do'\nTook his bankroll, plus his diamond and his gold\n8: 'Don't be late' is for my niggas paper-chasin\nGot Nines for trick niggas in the game player-hatin\n10's is for my niggas locked down in the pen\nAnd my niggas dead and gone, until we meet again\n11 is for my poppy up in heaven\nTell God send me a blessing, cause I'm down here stressin\n12 is for the records we sell, we're goin platinum\nThere's no turnin back now, so let's make it happen\n\n[ Hook: ]\nAll I ever wanted to do in my life was be a hustler\nSome don't get it, but feel me when I spit it\nIt's all about the dollar\n\n[ VERSE 2: O.C. The Sinister ]\nIt goes one for the money, two for the show\nEverybody in the game know how it go\nIt's a whole lotta hoes, a whole lotta dough\nKeeps me watchin on toes out my back window\nCreep slow by the ghetto, we never go without the .44\nFor urban travel, watch the scandal\nYou petty rivals can't handle\nHit your block, increase props as we dismantle\nChannel my vengeance through this sentence, I'm relentless\nYou bitches wanna spend this, then get pimped\nWe're never said to beat any listener senseless\nHeavyweighters livin major, pumpin this here, no circumference\nWho is this? O.C. The Sinister\nNavigatin, now we're raidin all over your area\nI'm darin ya to static with this Rap-A-Lot shit\nThe Camorra make hits, tag licks, like movin bricks\nThe lyricist full of canabis, livin extravagant\nWith elegant bitches, plottin riches\nOn quick-to-get-rich niggas full of liquor\nC'll shine one time livin bigger\n\n[ Hook ]\n\n[ VERSE 3: Lo-Lo & O.C. ]\nNow everybody in the game know how it goes\nPlayers like us do shows and pimp hoes\nOh-oh, it's the Sinister and Lo-Lo comin through\nThem niggas playa-hatin, what the fuck they wanna do?\nI want peace, but if them niggas want beef\nWe gon' have to take the heat to the streets\nKnawmean? They tryin to stop dreams and block creams\nIt seems like what? They hate to see us havin lavish things\nPictures in magazines, nice cars and diamond rings\nAh-ah, ah-ah, we can't have no fake niggas on our team\nNow you watch my back, nigga, and I watch yours\nOne's for the dough, two's for the shows, hoes, and tours\n\n[ Hook ]", "image": "https://images.genius.com/8f2e242e8c32bb311fdcab8c0ef63ab3.500x500x1.jpg"}], "artist": "Scarface"}