{"songs": [{"title": "Long Road", "album": null, "year": null, "lyrics": "[Verse 1: Proof]\n\nSo many judge our trials of life\nGot a thousand knives\nWatch my housin' lights\nSays my pal is wack\nOne of the best that done it\nThe jealous tell us rubbish\nTryna' test our stomachs like\n\"Where would you be if you never met Slim\nHe never met Kim\nWould you still be in the ghetto with him?\"\nFuck Detroit, I procreated the truth\nAny beef we ever had in our past\nWas orchestrated by Proof\nTo me was undeniable talent\nYou dyin' to challenge, my nigga\nShit, I am the balance\nFrom the Mo to the Boondocks\nI still rob a balloon spot\nFuckas fuck with the Goon Squad\nI'm too hard for Pac-Wan, I don't belong\nGet your block torn by city grifts with Glocks drawn\nNot wrong in this shit\nMake the rights decision\nHow you gonna judge the motherfuckin' life I'm livin'?\n\n[Hook x2]\n\nIt's a long road\nLemme tell you something\nHow you gonna pass judgment when I came from nothin'?\nIt's a long road\nTook what he had and he got 'im some ice\nYo it's hard lookin' up from the bottom of life\n\n[Verse 2]\n\nAin't mad that Eminem got more loot got more fame\nCause in reality he only got more pains\nFrom the Jews and fools, lesbian views\nThem gays that booze the news\nWatching every way that he moves\nHe's always in my eyesight\nEven though we don't kick it as much\nBack his life with my life\nOn my life, my wife and my kids\nNone of your biz\nDon't make me blow this fo-fo\nThrough one of your ribs\nIt's the son of a bitch that love\nRap with dance, they got the\nKillers that clap skip, they clap they hands\nFrom the Sconies to BK's, FA's and PKs\nI bring terror to state 103 days\nI run the freeways\nWith burners ass blocks\nThe ride on the bug-ass niggas to blast pop\nThe fast talk get your ass whooped gonna add your\nWhen you last walked they touch the asphalt\nI'm a \"Bad Boy\" without a contract from Puffy\nWant war? Don't make me contact this thuggy\nFuck a judge giving me stripes\nNow tell me what you know about me living my life\n\n[Hook x2]\n\n[Verse 3]\n\nMy heart moved when them buildings dropped\nSo many chills I got from them pills I pop\nMy childers not to be left like me\nProof the truth to the motherfuckin' death I'll be\nThe next Ali in the fight of life\nFinalize my plight with Christ\nAnalyze all these gods that ain't actin' right\nStrike a mic in the name of rap or lose\nI slang the crack, I choose to gain the plaques\nGot crews, dame and dash\nTho views the same and fast\nFuck rules the game is trash\nAll I wanted was a chain and Benzi\nNot for the cash I'm 100 like Lindsay\n10-Speed of raw, I breathe and crawl\nLike a Panther for the answer how to feed my dawgs\nNo my niggas, my brakes is died\nLived a lifetime denied so I'm taking mine!\n\n[Hook x 2]", "image": "https://images.genius.com/d38fa240d684e57a565427318ace6fee.706x706x1.jpg"}], "artist": "D12"}