{"songs": [{"title": "Where You At?", "album": "House of Wax: The Vatican Mixtape, Vol. 3", "year": "2007-09-29", "lyrics": "[Intro: Raekwon]\nLet's go, kid\n\n[Raekwon]\nSomething's in the attic, drugs on me, thugs gettin'\nBubbly, let's pop, surround the block, looking lovely\nExtra nine glindin' on me, women who barely know me\nSwarm me, faggots try to front, blow me\nAiyo, I'm from the soul bluntly, we in them H2's coolin'\nWant me, try to kill a kid, bring your country\nSon's nice with rifles, white fools, white dudes\nJumpin' out, fed jackets, dare you to bump me\nA glow like Willie Bostic, I do the knifework job, yeah\nRappers sprint, clap 'em, this is our 'jects\nWho taught ya'll niggas, it was the kid with the tarantula\nTinted up, extortin' ya'll monthly\nCrabs in a bucket, rap, fuck it, yo, go get your handgun\nI'd rather shoot yo' ass in public, you ain't a Air Force boss\nYou a hoster, frontin' like me on your poster\nNow ya'll niggas fuckin' with my ones\nWe need to battle for cattle, acts, boats, art and crafts\nScalpals, thumb rings, dick, be careful\nFuckin' with Staten Island's heartless\nSon of all flames, God guard frames, catch me with the Starks kid\nThe authentic Ghost, we on the golf course, with rentin' boats\nEagles on, feastin' with bigger GOATs\nCome take it in blood, dare any thug to re-up\nWhat, we gon' keep it on the hush\n\n[Chorus 4X: ?]\nIn the clubs, where you at?\nIn the clubs, where you at?\nOpen paperchasing, on the low getting trapped\n\n[Raekwon]\nAiyo, drove into the water like bait, the ocean was dark\nThe moon lit, swimmin' to the bottom to get to the sink\nWe on niggas, and we comin' boy, talk with ya gun\nMe, I'm ready, and I'm ready with cake, yea\nFlawless, more powerful horses, the kid flow naucious\nEverybody gettin' weeded, we all for this\nArmored tank style, moving in ranks\nHundred that'll rock for me, still kill you, over your men bitch\nSkiing in Alaska, half the man, half Casper\nRunnin' with wolves, the bulls look nastier\nSilencer, each is thee least, will kill on Easter\nYa'll gon' get it, wait til we get creased up\nNothin' but, rapid fire, livewire, brand new trees\nBurn 'em up, they respectin' your street, cousin\nWe gon' bring it to every label, pay attention, ya'll\nCuban is back, now put that on a glass table\n\n[Chorus 4X]", "image": "https://images.genius.com/258ddd2b01af2188dd6ee5363048d09d.820x820x1.jpg"}], "artist": "Raekwon"}