{"songs": [{"title": "Bump Heads (Ja Rule Diss)", "album": "Straight from the Lab", "year": "2003-07-07", "lyrics": "[Intro: 50 Cent, Eminem, Green Lantern]\nYeah\nShady (Ha-ha)\n50 Cent\nG-G-G-G-G-Unit (Ha-ha)\nHere we go again\nYeah\nThe evil genius, Green Lantern\n\n[Bridge: 50 Cent]\nDoes it make you mad when I switch my flow?\nYou can't understand how I get my dough\n50 Cent, I'm on fire 'cause Shady said so\nI'm on fire\n\n[Verse 1: Eminem]\nEverybody's in a rush to try to get the throne\nI just get on the track and try to set the tone\nI ain't tryin' to use nobody as a steppin' stone\nBut don't compare me, I'm better off just left alone\nAnd I ain't even tryin' to go there with record sales\nI'm just tryin' to keep it humble and respect myself\nSay, \"What up?\", keep steppin', and just rep D12\nKeep my nose clean, stay away from weapons, jail\nAnd livin' reckless, but if you go check my belt\nYou may see something else I use to protect myself\nA vest, to stop a Rueger and deflect the shells\nAnd send 'em back at you faster than they left the barrel\nAnd I don't even carry guns no more, I don't got to\nGot undercover cops that'll legally pop you\nAnd I done seen a lot of people cross the line\nBut this motherfucker Ja must have lost his mind\nThat X, got him thinkin' he was DMX\nThen he switched to Pac, now he's tryna be him next\nSo which one are you? X, Luther, Pac or Michael?\nJust keep singin' the same song, recycled\nWe'd all much rather get along than fight you\nMe and Hailie dance to your songs, we like you\nAnd you don't really wanna step inside no mic booth\nCome on now, you know the white boy'll bite you\nI'll hurt your pride, dawg, and you know I don't like to\nBut I will if I have to, with syllable after\nSyllable I just slap you, killin' you faster\nThan you poppin' pill after little pill of them tabs\nOf that shit you on, but if you want it, you got it\nYou'd bump this shit too, if we ain't diss you on it\nBut if we lock horns we can charge harder than Busta (Green Lantern!)\nWe bump heads with any motherfucker that wants to\nSo what's the deal, where was all the tough talk?\nWhen I walked up to you like, \"Ja, what up, dawg?\"\nHow come you didn't say you had a problem then?\nWhen you was standin' there with all your men, we coulda solved this then\nI'm a grown man, dawg, come holla\nAll you did was slap hands, smile and swallow\nAnother one of them little X pills in front of me\nAnd tell me 50 Cent was everything you wanna be\nCome on!\n\n[Chorus: 50 Cent and Eminem]\nI know you don't want it with me\nYou know you don't want it with me (You know you don't want it with me)\nYou talk and soon you gon' see\nYou don't wanna bump heads with me\nI know you don't want it with me\nYou know you don't want it with me (You know you don't want it with me)\nYou talk and soon you gon' see\nYou don't wanna bump heads with me\nTony!\n\n\n[Verse 2: Tony Yayo]\nYou couldn't son me if my father helped you\nMy punchlines is hot, my bars will melt you\nJa, you Stuart Little, shells'll lift you\nEvery other week I'm buyin' a new pistol\nI clap at your ass with this chrome .38\nAnd put six thru your hats, a seven and 3/8's\nIrv, you ain't Suge Knight, you shook night\nI'll put my knife in your wind pipe and breeze through the turnpike\nYou know and I know who took your chain\nYou got robbed two times so your ass is lame\nI'm down to die for this shit, all I need is bail\nYou better stick to the movies with Steven Segal, bitch\n\n[Chorus: 50 Cent and Eminem]\nI know you don't want it with me\nYou know you don't want it with me\nYou talk and soon you gon' see\nYou don't wanna bump heads with me\nI know you don't want it with me\nYou know you don't want it with me\nYou talk and soon you gon' see\nYou don't wanna bump heads with me\nLloyd Banks!\n\n[Verse 3: Lloyd Banks]\nFuck that, I'm miles away\nAnd these industry niggas startin' to get outta hand\nLike I won't find your whereabouts by stompin' 'em out your man\nWe killin' New York, even in Compton they understand\nI'm on the block where you was raised doin' chocolate up out your van and (Break it, break it, break it down!)\nThey see me pop a boy icy 'cause I could\nYou been gone so long you probably forgot your way around the hood (Hood)\n'Cause when you paranoid it's hard to make a song\nHow you want it with us if half of your artists got make-up on?\nEasy now, and you on your knees takin' prayer pictures\nAnd you ain't even got shot yet, you scared bitches\nYou don't know nothin' 'bout what pain is, sucka\nI'll put your ass underground like a train conductor, muh'fucker\n\n[Chorus: 50 Cent and Eminem]\nI know you don't want it with me (You know you don't want it with me)\nYou know you don't want it with me\nYou talk and soon you gon' see\nYou don't wanna bump heads with me (Wanna bump heads with me)\nI know you don't want it with me\nYou know you don't want it with me\nYou talk and soon you gon' see\nYou don't wanna bump heads with me (Wanna bump heads with me)\n\n[Outro: Tony Yayo]\nYeah, nigga\nYeah, Shady Aftermath\nG-Unit\nFuck you think they call us G-Unit for?\n'Cause we move units, huh-uh\nDon't think we ain't billin' you for this motherfuckin' studio time\nMatter of fact, keep it on 50, we'll call it even, ha", "image": "https://images.genius.com/8dd03ebbf724e2b4d4bafbddf8c3c2f1.1000x1000x1.png"}], "artist": "Eminem"}