{"songs": [{"title": "She’s Mine, Pt. 2", "album": "4 Your Eyez Only", "year": "2016-12-09", "lyrics": "[Intro]\nCatch me, don't you\nCatch me, don't you\nCatch me, I've fallen in love for the first time\n\n[Bridge]\nFor you I drop the tough guy shit, on this bus I sit\nThinking 'bout you, thinking 'bout you\nThinking 'bout you, thinking 'bout you\nThinking 'bout you, thinking 'bout you\nThinking 'bout you, thinking 'bout you\nDamn it feel good to have you\nDamn it feel good to have you\nDamn it feel good to have you\nDamn it feel good to have you\n\n[Verse 1]\nNeedin' me, wantin' me, givin' me a chance to feel special\nTo somebody in a world where they not lovin' me\nHandcuffs keep huggin' the, wrists of my niggas\nAnd I wish stuff was different here\nBut if I had a magic wand to make the evil disappear\nThat means that there would be no Santa Claus no more\nTo bring you Christmas cheer\n'Cause what he represents is really greed\nAnd the need to purchase shit from corporations\nThat make a killin' because they feed\nOn the wallets of the poor who be knockin' on they door\nEvery Black Friday just to get some shit they can't afford\nEven with the discount, write a check, that shit bounce\nBut as long as we got credit, it don't matter, the amount\nWe just swipin' shit here, we don't love, we just likin' shit here\nWhat's that smell? Where's your diaper shit here?\nLay on your back, don't pee right now\nOr else I'll have to get you back\nOne day when you gon' want to get your way\nYeah I'll have fun with that\nReminisce when you came out the womb\nTears of joy I think filled up the room\nYou are now the reason that I fight\nI ain't never did nothing this right in my whole life\nGot me thinking...\n\n[Bridge]\nAm I worthy of this gift?\nAm I strong enough to lift? (Am I strong enough to lift?)\nInto a place that I can see (Into a place that I can see)\nSomeone more important than me? (Someone more important than me?)\nAm I worthy of this gift? (Am I worthy of this gift?)\nAm I strong enough to lift (Am I strong enough to lift)\nInto a place that I can see (Into a place that I can see)\nSomeone more important than me? (Someone more important than me?)\n\n[Verse 2]\nIb gon' ask me how I did this shit\nI'm gon' do a humble stunt act like I meant this shit\nThats the ego taking credit for what God made\nFuck this album shit, hey mama look what God made\n(She's mine) Catch me, don't you\n(She's mine) Catch me, don't you\n(She's mine) Catch me\nI've fallen in love for the first time\nI wanna cry, and I ain't even tryna fight it\nDon't wanna die, 'cause now you're here\nAnd I just wanna be right by your side\nOn any night that you be cryin', baby\nI dry your eyes, I dry your eyes\n\n[Outro]\nThere is a God, it is a God\nYeah, it is a God\nI never felt so alive\nI never felt so alive\nI never felt so alive\n(I never felt so alive)\nI never felt so alive\n(I never felt so alive)\nCatch me, don't you—\nCatch me, don't you—\nCatch me, I've fallen in love for the first time", "image": "https://images.genius.com/e8867c7f0c8a290e03aaa2fbc804fdbf.600x600x1.jpg"}], "artist": "J. Cole"}