{"songs": [{"title": "Spur of the Moment", "album": "The Red Light District", "year": "2004-12-07", "lyrics": "[Quik] Gotta keep it a secret (woo!)\n[Luda] Ay man let me ask you somethin man\n[Luda] You ever have one of them days where you felt like\n[Luda] you mighta got rid of all the bad seeds in your life?\n[Luda] Y'knahmean like you just got your paycheck\n[Luda] Paid off a car note or somethin\n[Luda] Just jumped out the shower feelin fresh than a muh'fucka\n[Luda] Witcha good shoes on, y'knahmtalkinbout?\n[Quik] You mean like, paid off a Cadillac car note?\n[Luda] Like a Cadillac, like you ready to throw a party\n[Luda] Like call e'rybody you know, don't even plan it, just do it\n[Quik] In Compton we call that \"spur of the moment\"\n[Luda] Well let's do it, spur of the moment, whattup?\n\n[Ludacris]\nWell you can bring the drinks a little mo' my way\nMore I say, on another hot sunny Cali-for-nye day\nJust touched down, called up my 8-1-8\nFo' a date with some other bust downs\nAnd I cruised up the block, car losed up the top\nI take the breeze, quick break the trees\nFeel good as we flippin through the Robb Repo't\nMy baby momma ain't trippin on child suppo't\n\n[DJ Quik]\nBecause she can't support that garbage, she should come pay homage\nWhen we pair 'em, we gon' share 'em, when I'm finished we all switch\nI ain't really got the time, yo I'm chillin with Luda-\n-cris stop and twist the buddha got me feelin like this is it\nIf we gon' party, we gon' sip, we got a bar\nWe all in shape, we gon' go far, you can't stop the car\nWe on the freeway, if you get out you burnt\nYou woulda thought you woulda learned me when my hair was all permed\nI think y'all bullshittin with it dawg\n\n[Hook]\nIt's on tonight, get licked, get gone tonight\n[KJ] And for once, in my life, everything's gonna be, alright\nG'd up, my mind is freed up\n[KJ] From the day, through the night, everything's gonna be, alright\n\n[DJ Quik]\nArabian Spruce, Seagram's bumpy and juice\nWe used to bag and then truce, we used to sag and get loose\nNot the kind of cats that would jump in your bag for your jewels\nBut to put some money in it for your drink and your shoes\nWe get the News like MTV, every ten to the hour\nWe play Mario Brothers, we eat the 'shroom and get power\nNow eat your sour powers, and use your dental floss\nWhat does bein mental cost? If you ain't knowin you already lost\n\n[Ludacris]\nSo stay with me, and let's get tipsy\nRememberin the days on the block sippin whiskey\nRunnin 'round grinnin, runnin 'round sinnin\nGettin lit, then I wonder why my head kept spinnin\nBut I'm all grown up now, less throwin up now\nRecord blowed up, so my hood throwed up\nNow let's break loose cause your boy's arrived\nAnd tonight we gon' celebrate bein alive riiiiight\n\n[Hook]\n\n[Ludacris]\nIt's just one of those days, without a care in the world\nYou ain't gotta look mean, I know you care for your girl\nBut she's lookin this way and I'm gonna come get her\nFresh haircut, so I'm feelin quite kipper\nCan't nothin go wrong cause my strap's on my back\nAnd if fools wanna scrap then my tool will attack\nBut forget the click-clack, ain't no need for the steel\nJust a straight house party and some meat on the grill\n\n[DJ Quik]\nIf it's Los Angeles, watch a boss handle biz\nI'mma put this on my kids, stupid it's an outfit\nIf you ain't been around the world keep yo' mouth zipped\nCause I do wind-age and elevation\nYou see I'm not normal and I'm not a homo\nI'm mo' apt to shoot a porno with you in cornrows\nAnd call it \"More Hoes: Volume 5, Volume 6\"\nAnd show it in the back of my truck, at the picnic\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/57e6650f3864beef0e227e02f76d83b0.1000x1000x1.jpg"}], "artist": "Ludacris"}