{"songs": [{"title": "Remember Me", "album": "A Year and a Day", "year": "2009-07-07", "lyrics": "[Mary J. Blige - Intro]\nDon't forget, to remember me\n(Let's get 'em, Mary)\n\n[Hook: Mary J. Blige] (T.I.)\nDon't forget, to remember me (Ay, don't forget shawty)\nI'll be back, so remember me (Remember this..)\nPlease keep me in your heart, if we ever have to part\n(Ay, don't forget shawty)\nDon't forget, -get, to remember me\n\n[Verse 1]\n(It's the King, homie)\nAy, the King, modern-day Martin Luther, Malcolm X, I'm\nOfficially the freshest, don't dare forget, I'm\nGone, momentarily, don't bury me yet\nLike Ali got, I got the title back, prepare me to that\nWhen the world needed Tip, ask where he was at\nBut when he need somethin back, nigga fade to black\nTalk shit behind his back, you a hater for that\nI don't expect nothin less, in the game of chess\nYou think five moves ahead and not behind\nNiggas jumped up, cheered when I got my time\nLike, \"Yeah! One whole year I got the grind\"\nBut get me losin off your mind shawty, may I remind you that\nThere ain't another nigga who done been through what I been through\nTime after time again, you better get some in you\nWhen you, said it was over for him and you thought\nHe couldn't continue to floss, here's to your memory loss, suckas!\n\n[Hook: Mary J. Blige] (T.I.)\nDon't forget, to remember me\n(Ay, don't forget shawty, ay, don't forget shawty )\nI'll be back, so remember me (Yeah, yeah, remember this, shawty)\nPlease keep me in your heart, if we ever have to part\n(Yeeea! It won't be long, shawty)\nDon't forget, -get, to remeeeeeember me (Ay, don't forget shawty)\n\n[Verse 2]\nThey say, outta sight's out of mind\nAnd nine times, out of ten, men out of pocket out of line\nYou do it big, errybody that you out-shined\nThen your ol' lady fate talk 'bout how she got fine\nShe say she was tryin to get away, he say, \"About time\"\nRight now we all thinkin \"Damn, hopin not mine\"\nBut when it's lights out for ya and you locked down\nAin't no tellin whether or not your lady went and got down\nWit the nigga cross town, cause he hot now\nRippin up your love letters, liftin up her night gown\nRight now, somebody baby momma gettin piped down\nKids in the next room listenin, \"Momma pipe down!\"\nThe thought hurt, don't it? But maybe she's strong enough\nOr, ain't get that lonely, cause you wasn't gone long enough\nBut trust, it's just a temporarily setback\nIt's on when I get back, please don't forget dat!\n\n[Hook: Mary J. Blige] (T.I.)\nDon't forget, to remember me (So remember this, shawty)\nI'll be back, so remember me (It's the King, bitch!)\nPlease keep me in your heart, if we ever have to part\n(Ay, don't forget shawty)\nDon't forget, -get, to remember me (Take it out, Mary)\n\n[Bridge: Mary J. Blige]\nI don't mean to feel like this\nDon't mean to think like this\nMy heart just has to be sure\nThat the love that I give to you\nThat's the love that I get from you\nI need to be safe and secure, oooh-oooh\n(Just let me know you thinking 'bout me)\n\n[Hook: Mary J. Blige] (T.I.)\nDon't forget, to remember me\n(Ay don't forget, shawty, ay, don't forget shawty)\nI'll be back, so remember me (Keep me on your mind, shawty)\nPlease keep me in your heart, if we ever have to part\n(Ay, don't forget shawty)\nDon't forget to remember me\nNo, no, no- no, no, nooooooo\n\n[Outro]\nJust a friendly message for everybody, man\nWho thought I was gone forever\nPartna, it's a year and a day and countin, ya understand that?\nBy the time you hear this, I'll prolly be halfway home\nNow remember dat, suckas!", "image": "https://images.genius.com/5d06ca8bdb8ba683cbc4e3b6ba995512.600x600x1.jpg"}], "artist": "T.I."}