{"songs": [{"title": "Love Yourz (Live)", "album": "Forest Hills Drive: Live from Fayetteville, NC", "year": "2016-01-28", "lyrics": "[Speech]\nIon think y'all really understand... how much this shit means to means to me, man y’all just-\nI'm back home and y'all just sat through my whole fuckin’ entire album and shit that's fuckin' crazy, thank y'all for doing that shit man\nI been planning this night for a long time so this shit is- crazy to see like- turning to reality and shit\nAnd I appreciate y'all for sitting through this shit I want to tell y'all some shit\nAbout this album so when you leave here tonight-\nI know people been- people been telling me niggas playing the album like crazy and I appreciate it but\nBut we leave here tonight, I want y'all to know what this album meant to me\nSo when you driving home\nAnd you playing it this week, next week, next year, whenever\nYou gon' always remember what this shit is about\nWhat I had to go out into the world and learn- on my own\nI’m coming here to tell y’all tonight this is what this album is about\nAnd I'm taking this message across the fuckin’ world ion' care\nHere it go:\nWhen we young\nAnd even when we old\nThe world is constantly, constantly pumping us with images, and messages, about what life is about right, and what- what we need to make us happy\nIn the United States, we call it the American Dream right\nBut what does it always include?\nA lot of fucking money\nA big ass house\nA brand new car\nA wife that's not even genetically fuckin' possible to have and shit\nAnd bitches\nAnd bitches too\nThey tell us we need all that to be happy right\nSo what ends up happening?\nThe world is setup so that 99% of us can’t live like that, but what do we do?\nWe idolize the people that do live like that right?\nWe call them celebrities\nWe follow they lives\nWe go \"oh man it looks so perfect, I want to be living like them\"\nAnd I'm coming here tonight to tell y'all I'm the same dude\nThat was on the other side of the fence, right here in this city, right down the fuckin' street working at the fucking skating rink daydreaming\nOh y'all niggas love the skating rink\nDaydreaming about shit like \"Man I want to live like that, I want that\" right?\nAnd then I went and got that shit\nBut I'm telling y'all this\nI'm not saying that to stunt, I'm saying that to say this\nWhen I got over there, on that side of the fence, and I started to look closer I'm telling y'all\nAs not fuck J. Cole I'm telling y'all as Jermaine\nAs I really started to take a closer look at all that shit we want, and all the shit we need that makes us happy\nI started to see for my, with my own eyes like wait a minute\nThat shit don't feel right, that shit feel weird\nAnd I started to notice that, all of that shit that they tried to tell us is all bullshit and it's all wrong and it's not what we need to make us happy\nI had to go figure that shit out on my own\nAnd how do I know that?\nHow do I know that?\nThis is how I know that\nIt's a man right now in the world, he got millions of fucking dollars, he got a billion fuckin' dollars right\nHe got everything that we think we need to be happy, he got it\nHe got the money, he got the cars, he got the big ass crib, 3 or 4 of them bitches, he got the genetically impossible wife, and he got bitches. But yet, this dude is fucking miserable right, he's empty inside, he's miserable\nBut you got a family, that comes from where we come from, from this city right here, worse conditions than what we come from\nThey couldn't afford to a ticket to this show tonight if they fucking wanted one right?\nBut yet somehow, they got more happiness and joy in their life right now than this man will ever have in his life\nHow is that possible?\nHow's that even possible?\nHe got everything they told us we need to be happy and he's miserable\nAnd they ain't got shit\nBut they happy\nWhat do they got that he don't got?\n(Love)\nWhat's that?\n(Love!)\nThat's that fuckin' Cumberland County public education system there coming into play Goddammit\nI need everyone to put your cell phones in the sky one time tonight Fayetteville we gonna light this shit up one time\nAy yo\nA nigga been dreaming about this shit\n\n[Intro]\nLove yours\nLove yours\nNo such thing\n\n[Chorus]\nNo such thing as a life that's better than yours\nNo such thing as a life that's better than yours\nNo such thing as a life that's better than yours\nNo such thing, no such thing\n\n[Bridge]\nHeart beatin' fast, let a nigga know that he alive\nFake niggas, mad snakes\nSnakes in the grass let a nigga know that he arrived\nDon't be sleepin' on your level\n'Cause it's beauty in the struggle, nigga (Beauty, beauty)\nGoes for all y'all\nIt's beauty in the struggle, nigga (Beauty, beauty)\nLet me explain\n\n[Verse 1]\nIt's beauty in the struggle, ugliness in the success\nHear my words or listen to my signal of distress\nI grew up in the city and though sometimes we had less\nCompared to some of my niggas\nDown the block, man, we were blessed\nAnd life can't be no fairytale, no once upon a time\nBut I be goddamned if a nigga don't be tryin'\nSo tell me, Momma please, why you be drinkin' all the time?\nDoes all the pain he brought you still linger in your mind?\nShit\n'Cause pain still lingers on mine\nOn the road to riches, listen, this is what you'll find\nThe good news is, nigga, you came a long way\nThe bad news is, nigga, you went the wrong way\nThink being broke was better\n\n[Chorus]\nNo such thing as a life that's better than yours\nNo such thing as a life that's better than yours\n(think being broke was better)\nNo such thing as a life that's better than yours\nNo such thing, no such thing\n\n[Verse 2]\nCause what's money without happiness?\nOr hard times without the people you love?\nThough I'm not sure what's 'bout to happen next\nI asked for strength from the Lord up above\n'Cause I've been strong so far\nBut I can feel my grip loosenin'\nQuick, do somethin' before you lose it for good\nGet it back and use it for good\nAnd touch the people how you did like before\nI'm tired of livin' with demons 'cause they always invitin' more\nThink being broke was better\nNow I don't mean that phrase with no disrespect\nTo all my niggas out there livin' in debt\nCashin' minimal checks, turn on the TV see a nigga Rolex\nAnd fantasize about a life with no stress\nI mean this shit sincerely\nAnd as a nigga who was once in your shoes\nLivin' with nothin' to lose, I hope one day you hear me\nAlways gon' be a bigger house somewhere, but nigga feel me\nLong as the people in that motherfucker love you dearly\nAlways gon' be a whip that's better than the one you got\nAlways gon' be some clothes that's fresher than the ones you rock\nAlways gon' be a bitch that's badder out there on the tours\nBut you ain't never gon' be happy 'til you love yours\nNigga\nLove yours\nLove yours\n\n[Chorus]\nNo such thing as a life that's better than yours\nNo such thing as a life that's better than yours\nNo such thing as a life that's better than yours\nNo such thing, no such thing\n\n[Bridge]\nHeart beatin' fast, let a nigga know that he alive\nFake niggas, mad snakes\nSnakes in the grass let a nigga know that he arrived\n2,6, Fayetteville, Fayettenam, I fuckin' love ya'll\nMy name is J. Cole, Cole World\nThis been some legendary shit man until the next time God dammit\nPeace and love", "image": "https://images.genius.com/6affcd514d0bc308d7761e9589cd9abc.1000x1000x1.jpg"}], "artist": "J. Cole"}