{"songs": [{"title": "Green & Purple", "album": null, "year": "2017-05-15", "lyrics": "[Intro: Playboi Carti]\nWhat? What? What? What? What? What? What? What? What?\nHuh?\n\n[Verse 1: Travis Scott & Playboi Carti]\nLil' mama, she loyal (Yeah), lil' mama a star\nLil' mama, she give no fucks (It's lit)\nBite it (Woah), this a steak (Woah)\nShe a psychic (Yeah, what?), she exciting (Alright)\nHotpocket (What?), appetite it (Yeah, yeah)\nHelp her tie this (What?), help her ride this (It's lit)\nHelp her leave (Yeah), help her psychic (What? What?)\nHelp her drown it (What?), help her ride it (What? What?, straight up)\nHelp her leak (What?), help her deep (Yeah, yeah)\nCouple G's (What?), couple keys (Yeah, yeah)\n100 G's (What? What?), I got her on smash (What?)\nShe let it go fast (Yeah)\nDon't know what to do with all this cash, yeah (Alright)\n\n[Chorus: Travis Scott & Playboi Carti]\nYeah, Green & Purple, got me going in circles (It's lit)\nYeah, it's after curfew, she done snuck the work through (Straight up)\nYeah, it's controversial, how we make the world move (Yeah, yeah)\nYeah, you said I heard you, don't think I overheard you\n(What? What? What? What? What? What? Huh? Huh? Yeah, what? What? What? What?)\nDon't think I overheard (What? What? Huh?)\nDon't think I overheard\n\n[Verse 2: Travis Scott]\nYeah, yeah\nBad line me, yeah, remain lowkey (Yeah)\nYeah, fuck on me, yeah, silently (It's lit)\nYeah, Jacques don't eat, no, Jacques don't speak (Alright)\nYeah, ride lonely, yeah, driving with no keys\nI can go do 'bout a hundred of these (Straight up)\nAll my fruits bloody like Applebees (Yeah)\nCannot be tamed, yeah, I had to go\nCall me up Semi right up the road\nI been up leanin' for nine days\nI ain't been sleep in like five days\nNight in the shuttle, we're cold as hell\nYou want us to win, I can never tell\nIn the inside, I dropped this\nLook at the sky for ideas (Alright)\nAstroworld time, it's timeless\nIn the back of my mind, it's reminds us (Yeah)\nThey don't want time, I'm beastin'\nHit him with time for like me (Straight up)\nOverly hooked up to IV\nYeah, open up the doors, ho, let 'em swang (Let 'em swang)\nYeah, link up like the rose gold on the chain (On the chain)\nYeah, Hpnotiq and tonic off of everything\nYeah, circles 'round your bitch, circles 'round your gang\nYeah, kick it like Cobain\n\n[Chorus: Travis Scott & Playboi Carti ]\nYeah, Green & Purple (Yeah), got me going in circles (Yeah, yeah)\nYeah, it's after curfew, she just left the work, hmm (It's lit)\nYeah, it's controversial, how we make the world move (Straight  up)\nYeah, you said I heard you, don't think I overheard you\n(What? What? What? What? What? What? What? What? What? What?)\nDon't think I overheard (What? What?)\nDon't think I overheard\nYuh, yuh\n\n[Verse 3: Playboi Carti]\nHow you pull up on that bitch (What?)\nWe get the guap and we kick it (What?)\nShawty gon' suck like a tick (What?)\nDiamonds they look like a disc\nI pour the lean in the Mist\nI cannot handle no shit\nShawty just handle this shit\nI pop the perc and I kick\nWe get the guap and we kick it\nI get the guap and I split (Split)\nSplit the whole thing with my clique\nVVS diamond on my wrist\nMy diamond not Tiffany, bitch\nUnder no light and it hit\nAll of these bitches we hit\nFuckin' that bitch\nShawty bitch look like a bitch\nHittin' that shit\nForty clip came wit' the stick\nYeah, rockin' the shows\nGot 'em like \"woah\"\nFuckin' these hoes\nDodgin' them hoes\nKeepin' the pole\nGot her on go\nYou know how it go\nGot her on road\nIn love with my roll\nCount up bankroll\nAin't lovin' them hoes\nThat's when I roll\n\n[Chorus: Travis Scott & Playboi Carti]\nYeah, Green & Purple, got me going in circles\nYeah, it's after curfew, she just left the work, hmm\nYeah, it's controversial, how we make the world move\nYeah, you said I heard you, don't think I overheard you\n(What? What? What? What? What? What? What? What? What? What?)\nDon't think I overheard (What? What?)\nDon't think I overheard\nYuh, yuh", "image": "https://images.genius.com/f429bfe9cc0965235592fcbcbf60cae2.355x355x1.jpg"}], "artist": "Travis Scott"}