{"songs": [{"title": "Breathe In, Breathe Out", "album": "Rise To Power", "year": "2007-09-18", "lyrics": "[Intro: Jiggolo]\nYou know man\nSuave House\nDukey asked me like\nWhy is you name Jiggolo?\nWhere did it come from?\nI tell her, why you think?\n\n[Hook] (x2)\nShe sexy, she freaky\nI like it, she love it\nWe do it, no cuffin'\nForeplay and then we fuckin'\nThen we\nBreathe in, breathe out\nBreathe in, breathe out\n\n[Verse 1]\nWe get, freak deaky, fuckin' up TV screens\nCounter tops and coffee tables, butt cheeks on magazines\nShe feel my vibe, my dick is XXL\nSo of course I'm a source of flings, call me the king\nFirst I lick her and fondle her nipples\nWhile I tickle her kitty kitty for fifty\nMight even blow at it, shitty shitty\nAnd yeah we bang bang\nNext week we'll do the same thang\nMan up that's the game game\nDick is what I slang slang\nSee I don't slang caine\nBut I slang wang\nGot lucrative businesses and up is what I've done came came\nIf you're dick hung down like your buckel, you would do the same thing\nKnock out a main frame\nI'm too hard to tame man\n\n[Hook] (x2)\n\n[Verse 2]\nSee it's not only their head boy\nIt's fuckin' up their respiratorys\n3 at a time, that's another day another story\nSee I'm the kind to lay ya down and have ya pussy pourin'\nLeakin' feenin' for the d, skeetin' fuckin' up your sheets\nBeat it how it's supposed to be\nBeat it in the [?]\nThis is what you supposed to eat\nSwallow it, get a load of me\nAnd yeah it's good for ya, protein is sibilance\nGot different hoes in different area dividends\nAnd you can ask about me, even your ho tell ya\nCause she familiar with how I pump up paraphernalia\nSay you be short dawg, they say you a fuckin' failure\nShe asked me not to but fuck it, shit I'm gon' tell ya\n\n[Hook] (x2)\n\n[Break] (x2)\nSatisfaction guaranteed baby\nI promise I'mma give you what you need baby\n(Tonight's the night)\nThis is the night\nI'mma blow you mind\nLet's get it now\n(Breathe in, breathe out)\n\n[Hook] (x2)", "image": "https://images.genius.com/29b46b5e6777c0cfddcc1b604d7a2597.600x600x1.jpg"}], "artist": "Rick Ross"}