{"songs": [{"title": "Robbery", "album": "The Lex Diamond Story", "year": "2003-12-16", "lyrics": "[Intro: Polite (P.C.)]\n{*whispering*}\nEh yo.. eh yo\n{*speaking normally*}\nIce Water (yeah yeah)\nDon't get it twisted\nWe'll shoot yo' ass, nigga\nHaha (P.C., nigga, P.C.)\nY'all mothafuckas got about fifteen seconds to live\n\n[Verse 1: Stumic]\nYo it's a new year, bitch, and I'm takin' over\nMy whole crew here, bitch, and the game is over\nNiggas, talkin' faces, soldier\nIf rap don't work, get back to that bakin' soda\nOn the strip tryin' to catch more cake than Oprah\nI got clips that'll leave you with ya face on a poster\nI talk slick and I'm sprayin' the toaster\nSparkin' shoot outs and start poppin' off shit the way I'm supposed to\nYou the type to go up North straight scrappin' a sore butt\nAnd ain't nuttin' worse than gettin' shot as soon as you woke up\nYou got work? I'll be rapin' ya dolja\nI'm takin' his pack and breakin' his back and makin' him throw up\nCuz the draft's like a bomb and I'm waitin' to blow up\nI'll take cash on ya mom's and turn her frame into donuts\n\n[Verse 2: P.C.]\nYo.. yo.. yo\nEh yo I'm blazin' hot, never haze or flop\nWanna battle? Name ya price, I'mma raise the pot\nPut ya car on the line, I'mma take ya drop\nPut ya jewels up, I'mma take ya chain and watch\nIt's like I hard ball and you, play soft\nJust call me the Hitler when I spit about eight off (Adolf)\nShots'll rip ya face off, nigga ya heard me?\nBeat you black and blue like a Hitman jersey\nP.C. never been known to play games\nI spray things that'll re-arrange ya brain\nI cock and aim, miss you then pop ya dame\nOnly reason that I came through's to lock the game\n\n[Chorus: Polite]\nYo it's time to die, who you gon' run to?\nWho you gon' call when them dogs come confront you? {*barking*}\nYou stand firm or be the bitch that you is?\nWould you grab the guns or run to the pigs, you mothafucka, huh?\nYo it's time to die, who you gon' run to?\nWho you gon' call when them dogs come confront you? {*barking*}\nYou stand firm or be the bitch that you is?\nWould you grab the guns or run get yo' wiz, you mothafucka, huh?\n\n[Verse 3: Cigars]\nY'all niggas see me eatin' all of ya plate\nDon't give a fuck about ya background shit about the songs you make\nAnd I know you see the draw on the waist\nLookin' stupid with a vest on, these bullets might draw on ya face\nThey call me Alexander Sean the Great\nCuz ya bitch said she love the way the dick talk all in the cake\nI need this bank money, throw me the safe\nAll these killas involved, the cops'll fuck around and chalk the place\nYo they wonder why we hang with crooks\nShit is take free, not used to money off the books\nBroke faggot nigga caught in a juks\nI'm a pirate in this rap shit, I leave you niggas off the hook\n\n[Verse 4: Polite]\nWhat the fuck you gon' do when we run in ya crib?\nEither we leavin' with the bricks or we gon' leave with yo' kids\nAnd they only got hours to live\nSo give up the ransom or find they ass up under the bridge\n'Lite never been afraid, so keep lookin' niggas\nCuz I'll rob yo' ass faster than some Brooklyn niggas\nYo this rap game twisted, everybody beefin\nEverybody killas now and ain't nobody leakin\nSmoke a lot of weed so I don't like to fight\nBut I might go upside ya fuckin' head with a pipe\nGot a bulldog, not only do he bark he bite\nGive a fuck about a hood, it ain't safe at night\nYou fucker!\n\n[Chorus]\n\n[Outro: Polite (Stumic)]\nI'm tellin' you, man\nYoung motherfuckers, man\nY'all niggas is really fuckin' pissin' me off\nWho you gon' run to?\nWho you gon' fuckin' call when I put this motherfuckin\nFo'-fo' long in yo' motherfuckin' mouth, boy?\nHaha (Shot in yo' face)\nWho the fuck you gon' call?\n(Call the cops) Uh-uh, uh-uh", "image": "https://images.genius.com/8703b73c19201fea3baccb6c300ec07e.1000x1000x1.jpg"}], "artist": "Raekwon"}