{"songs": [{"title": "One Time 4 Your Mind", "album": "Illmatic", "year": "1994-04-19", "lyrics": "[Produced by Large Professor]\n\n[Chorus 1: Grand Wizard + Nas]\nOne time for your mind, one time\nYeah, whatever\nOne time for your mind, one time\nYo, whatever\nOne time for your mind, one time\nHey yo, Nas? Kick that fuckin' rhyme!\n\n[Verse 1: Nas]\nCheck it out, when I'm chilling, I grab the buddha\nGet my crew to buy beers\nAnd watch a flick, illin' and root for the villain, huh\nPlus every morning, I go out and love it sort of chilly\nThen I send a shorty from my block to the store for Phillies\nAfter being blessed by the herb's essence\nI'm back to my rest, ten minutes, some odd seconds\nThat's where I got the honey at, spends the night for sexin'\nKeep lubrication, Lifestyle protection\nPicking up my stereo's remote control quickly\nRon G's in the cassette deck, rocking the shit, G\nI try to stay mellow, rock, well a cappella rhymes'll\nMake me richer than a slipper made Cinderella, fella\nGo get your crew, Hobbes, I'm prepared to bomb troops\nY'all niggas was born, I shot my way out my mom dukes\nWhen I was ten I was a hip-hoppin' shorty wop\nKnown for rocking microphones and twisting off a 40 top\n\n[Chorus 2: Grand Wizard + Nas]\nOne time for your mind, one time\nYeah, whatever\nOne time for your mind, one time\nIt sounds clever\nHey yo, Nas? Fuck that, man, that shit was phat\nBut kick that for them gangstas, man fuck all that!\nRight, right\n\n[Verse 2: Nas]\nWhat up, niggas, how y'all? It's Nasty, the villain\nI'm still writing rhymes, but besides that I'm chillin'\nI'm tryin' to get this money, God\nYou know the hard times, kid\nShit, cold, be starving make you wanna do crimes kid\nBut I'ma lamp, ‘cause a crime couldn't beat a rhyme\nNiggas catching 3 to 9's, Muslims yelling \"Free the mind\"\nAnd I'm from Queensbridge, been to many places\nAs a kid when I would say that out of town, niggas chased us\nBut now I know the time, got a older mind\nPlus control a 9, fine, see now I represent mine\nI'm new on the rap scene, brothers never heard of me\nYet I'm a menace, yo, police wanna murder me\nHeini Dark drinker, represent the thinker\nMy pen rides the paper, it even has blinkers\nThink I'll dim the lights, then inhale, it stimulates\nFloating like I'm on the North 95 Interstate\nNever plan to stop, when I write my hand is hot\nAnd expand a lot from the Wiz to Camelot\nThe parlayer, I'll make your heads bop, pa\nI shine a light on perpetrators, like a cop's car\nFrom day to night, I play the mic and you'll thank God\nI wreck shit so much, the microphone'll need a paint job\nMy brain is incarcerated\nLive at any jam, I couldn't count all the parks I've raided\nI hold a MAC-11, and attack a reverend\nI contact eleven L's and max in heaven\n\n[Chorus 3: Grand Wizard + Nas]\nOne time for your mind, one time\nIt sounds clever\nOne time for your mind, one time\nYeah, whatever\nOne time for your mind, one time\nYo, from '92 to '99\n\n[Outro]\nYeah, that shit was crazy fat, pa\nKnow what I’m sayin'?\nBut check it, you got another verse for me\nI want you to kick it, you know what I'm sayin'?\nKick that shit for the projects", "image": "https://images.genius.com/8753de258796b1f91adfedde591e85be.750x750x1.jpg"}], "artist": "Nas"}