{"songs": [{"title": "Yaphet Kotto", "album": null, "year": "2013-10-08", "lyrics": "[Produced by Stefan Ponce]\n\n[Intro]\nI know it's your first\nI will try to be gentle\nMy love....\n\n[Verse 1]\nWorst rapper to ever spit on an open mic\nWorst rapper to ever get on so many likes\nWorst rapper to ever blow up and over night\nAnd when my D swell my D-12 friends, but Obie Trice\nYoung, black and gifted but he still in America\nHeard the flow was gettin' better, is he sleeping with Erykah?\nThey passing me they demos, these rappers, I think it's funny\nCause they tryna get my demo, young white kids with money\nI promise, worst rapper, iTunes most played\nIt's just me and both Macs, self made, self paid\nHeadlines saying he leaving to be a rapper\nWith niggas saying:\n\"This dummy; he's eating off of his acting, I mean\nWho the fuck wanna be a rapper, it's stupid, I mean\nWho knew that every rapper with a new crew\nWanna do shit on Hulu,\"—that's the blueprint\nYou drive until the lease up\nI drive until it's dirty, please somebody call the Brinks truck\nYeah they know me, happy face emoji\nThat OG, I might OD so Avengers keep it lowkey (Ahh)\nWell I'm sitting on top of the world\nThere's only one second secure\nBut I can't get it back\nMy life is a sham no time to react; breathe\nFind solace in the fact my ball bigger\nPause, like dog fingers\nGive a fuck 'bout y'all niggas\nGet the point like ball kickers\nI do shit, eat good, need a toothpick\nYour girl play my music\nSo that's thumbs down to your new shit\n\n[Verse 2]\nBuddha stance in a forest on the ayahuasca\nI'm as high as copters, binoculars\nLooking down on my confidence\nTruly honest man, I wish there was more of us freaking out\nI wet the bed the first night on my tour bus\nGod damn, what're you doing man?\nI can't name a lot of rappers that you better than\nHe hates women and himself, I won't give him the chance\nTear myself down first to make 'em pay in advance\nHeard a lot of y'all talking behind his back\nWhen he walking out\nMe and Fam in the corner, what are they talking 'bout?\nThe same dudes who laughing after you go\nBe the same dudes emailing asking you 'bout your show\nIt's on FX? Tight nigga\nMe and my homies making flicks\nMe and my homies making beats\nMe and my homies making hits\nMe and my homies hit the spot, roll with us, gold diggers\nI don't really like those niggas, Childish like goldfishes\nWe saw this kid get shot up by the cops in Atlanta\nThey shot through his Phantom\nAnd tandem cannons were blamming him\nHe was standing there like 20 seconds before\nNow he gasping for air, bullet holes inside of his dome\nWhat's the point? I don't know\nWhy am I here? Why am I alive? Why do you care?\nLiving real everyday, what was your undoing?\nKhalifa's first name now there's urine on him (Eww)\nDamn 'Bino why you gotta do it to em?\nI'm Terio, I'm Terio, my cousin \"Ooooh-ahh-Ooh-ing\"\nNew shit, new shit alert, never fake (Ugh)\nThere's levels to the shit like a wedding cake\n\n[Outro]\nMy new girls so pretty that the world shine\nMy new girls getting kissed by the coast line\nMy new girl so pretty we can bovine\nWorst rapper ever, how I'm giving out a cosign?\nChance The Rapper, yeah that nigga crazy\nBig brother, little brother lifestyle wavy\nCool, uhhh...\n(Always thinking)", "image": "https://images.genius.com/3622f73a614174ec979d9d7c6aa34e6f.260x260x1.jpg"}], "artist": "Childish Gambino"}