{"songs": [{"title": "​infinity (888)", "album": "? (Question Mark)", "year": "2018-03-16", "lyrics": "[Intro: Joey Bada$$ & XXXTENTACION]\n—ggas will be like \"Yo, these niggas is wildin' right now\nLike, these niggas is really wildin'\", you know what I'm sayin'?\nLike, we ain't playin' with y'all niggas, man, ya heard?\nSometimes you just gotta catch chlamydia on these niggas, G-shit\nYou know what I'm sayin'? Gonorrhea, all that shit\nAll of that shit\nI catch all diseases in the world\nSo the world don't have no more diseases, you feel me?\nG-shit\nYeah, yeah\n\n[Producer Tag]\nP. Soul on the track\n\n[Verse 1: Joey Bada$$]\nI'm as real as they come, they feel it, get numb\nYou think you got a little buzz, so now you can't get stung?\nI keep a razor blade tucked on me, under my tongue\nDon't let me have to tell these niggas about the city I'm from\nIt's Brooklyn, be the home of the hardest ever (yeah)\nWhere them niggas don't aim, they just palm Berettas (bang)\nAnd bomb whatever, say we don't move calmly, never (no)\nThis for my niggas trapped in cells like salmonella\nLook, I could do this shit with no effort\nNo pressure, no gimmick shit, no radio records\nJust textbook rhyme style with the raw texture\nPunchlines, right hooks, now that's a trifecta\nNo more free lectures, I'm taxin' these niggas extra\nThis the Pro of all Eras, he's back in your sector\nSo, might be best to protect your neck\nOr profess your debt to the god, he might bless ya\n\n[Verse 2: XXXTENTACION]\nMurder these flows like I murder these hoe ass niggas\nWhere the fuck is your energy, bro?\nMake your nigga deepthroat a Desert Eagle\nIf he try me like a hoe, pussy boy, that's on my soul\nMake my flow shapeshift, cold expression like a facelift\nAt the publix with like eight grips if you talkin' all that ape shit\nI'm not talkin' YMBAPE shit, but I'm bangin' on my chest, bitch\nAyy, ayy, ayy, ayy\nTravelin' through the infinity, uh\nYou not that nigga, pretend to be, uh\nAll that bullshit do not get to me, uh\nI am a spirit, an entity, uh\nYou just wan suck up my energy, uh\nI am the realest since Kennedy, uh\nYou pussy ass niggas fuckin' suck, you sound the same\nI spit the pain, that's why these young niggas feel the same\nThey know I bang, I'll pull a fuckin' pistol out the Range and act insane\n\n[Chorus: XXXTENTACION & Joey Bada$$]\nI spent years at the crib, so I don't feel the pain no more\nI don't feel the pain no more\nI gotta get it how I live, I don't feel the pain no more\nI don't feel the pain no more\nI spent years at the crib, so I don't feel the pain no more\nI don't feel the pain no more\nI gotta get it how I live, so I don't feel the pain no more\nI don't feel the pain no\nI spent years at the crib, so I don't feel the pain no more\nSo I don't feel the pain no more\nI gotta get it how I live, I don't feel the pain no more\nI don't feel the pain no more\nI spent years at the crib, so I don't feel the pain no more\nI don't feel the pain no more\nI gotta get it how I live, so I don't feel the pain no more (yeah)\nI don't feel the pain (ay) no more (ay)", "image": "https://images.genius.com/cefcf70065cf258281a354367542be42.1000x1000x1.jpg"}], "artist": "XXXTENTACION"}