{"songs": [{"title": "Flip", "album": "FUTURE", "year": "2017-02-17", "lyrics": "[Intro]\nIf you gang, gang, gang, that's what's up with me\nFreebandz\nFire Marshall\n\n[Chorus]\nDrove it too long, time to swap it out\nWe got papers, flip my stones, it ain't no clouds\nSnatch a brand new Range Rover with the captain seats\nAnd I keep a MAC on me like I'm Master P\nCaptain seats in my Maybach, in my Range Rover\nThen I flip, flip, flip, flip, game over (Game over)\nCaptain seats in the Maybach, in the Range Rover\nThen I flip, flip, flip, flip, game over (Game over)\n\n[Verse 1]\n2017 with the captains (Flip)\nThe price too high, you must be cappin' (Flip)\nAll these Franklins got me trappin' (Flip, flip)\nSippin' on Screw, I'm very active (Flip, flip)\nA half a milli', got matted\nYour main bitch got batted\nGot a clear view, no static\nGot some VVS on my fabrics\nChanel drapes one of one\nI pay the rates to the Lord\nBitch nigga, I'm a boss\nHad the mayor with me, I'm a star\n\n[Chorus]\nDrove it too long, time to swap it out\nWe got papers, flip my stones, it ain't no clouds\nSnatch a brand new Range Rover with the captain seats\nAnd I keep a MAC on me like I'm Master P\nCaptain seats in my Maybach, in my Range Rover\nThen I flip, flip, flip, flip, game over (Game over)\nCaptain seats in the Maybach, in the Range Rover\nThen I flip, flip, flip, flip, game over (Game over)\n\n[Verse 2]\nI'm gone past the moon, what you tellin' me?\nThat nigga's a goon, what you tellin' me?\nThe bitch in the room, what you tellin' me?\nI'm hotter than the sun, what you tellin' me?\nThese niggas my sons, what you tellin' me?\nThey eat up my crumbs, what you tellin' me?\nYour brother a bum, what you tellin' me?\nStraight out the slums, what you tellin' me?\nI came out the mud, I'm stashin' the drugs\nGotta bring out the tub of Ace\nI was never in love with the Wraith\nGot a new Panorama on the way\nWent to Pluto, beyond with my cape\nCan't run when the drum in your face\nI'm the mothafuckin' don, why you hatin'?\n\n[Chorus]\nDrove it too long, time to swap it out\nWe got papers, flip my stones, it ain't no clouds\nSnatch a brand new Range Rover with the captain seats\nAnd I keep a MAC on me like I'm Master P\nCaptain seats in my Maybach, in my Range Rover\nThen I flip, flip, flip, flip, game over (Game over)\nCaptain seats in the Maybach, in the Range Rover\nThen I flip, flip, flip, flip, game over (Game over)\n\n[Outro]\nFlip, flip, flip, flip\nFlip, flip, flip, flip\nFlip, flip, flip, flip\nFlip, flip, flip, flip\n\n[Skit]\nHost: Hahahaha, we back, baby! Yeah, listen, once again this is Got It All Cap City Podcast, internet broadcast. Our credibility and validity is in... listen, man! If you ain't fuckin' with us, man, you ain't fuckin' with the industry, man. Okay we got the next caller from Vienna. Uh oh, hello?\nWoman: Hello!?\nHost: Oh she from Campbellton. Okay we got our next caller from Campbellton. You are the winner! Yes!\nWoman: You can hear me on the radio?\nHost: Yes!\nWoman: I'm finna get you a new daddy, fuckin' we gonna get me a baller, fuckin'....\nHost: Yes, you have won the one and only Cap City baller rapper kit\nWoman: And I've been workin' too, man, I've been drinkin' this, some flat tummy, see, so I can get me a baller\nHost: Okay the flat, but listen, baby, you have somethin' more important than a flat tummy, you are gonna win a lifetime supply of the Asian Kung Pao saran wrap condoms\nWoman: Ooh I need them\nHost: Yes they're guaranteed to pop. And look we're also gonna throw in, listen, this is special. We got the two millimeter geo globe tracking device system so you can...\nWoman: So I'ma know how to pull up on him to tell him this his baby too\nHost: Yes, yes, yes, baby! That is free game from Cap City Records, baby, we appreciate you callin', we gon' put you on hold\nWoman: Hold on, hold on you did not tell them to follow me on Instagram, I'm tryna get my followers up\nHost: Uh huh okay tell 'em where to follow you at\nWoman: Y'all, please, ballers only, dudes who got the bag, who got the check, I need all y'all to follow me on T Hot Pocket underscore—y'all got that?\nHost: Yeah okay we got it\nWoman: I said it real slow so make sure y'all got that\nHost: We got that, baby, we got that, baby\nWoman: Follow me! What's up!?\nHost: Okay Cap City Records\nWoman: Ballers only, no broke niggas\nHost: Okay but Cap City, we gon' to break, go to break!", "image": "https://images.genius.com/017aebcbc814b4a237d11e0bf31c7395.1000x1000x1.jpg"}], "artist": "Future"}