{"songs": [{"title": "2 Minute Warning", "album": "Malice N Wonderland", "year": "2009-12-08", "lyrics": "[Snoop Dogg]\nSometimes I feel lost like a runaway, read over the dire\nReap while I stay gettin Richard like Pryor\nNeed to put the gun away cause I got priors\nIt's hard to stay rollin when the world full of riders\nBullet tip on fire, flyin down sunset\nMotivated to win, like I ain't won yet\nThink shit over? Hell naw I ain't done yet\nI L-B-see y'all prayin that a G fall\nTonight it's goin down like free fall\nChevy bouncin up and down like a fuckin see-saw\nTrippin off hate, no Hee-Haw\nAll blacks locs on the loc actin like I don't see y'all\nDoing that shit to demean Dogg\nBut when I bring it to you, you be like \"What you mean Dogg?\"\nThen we go back and forth, like it's ping-pong\nKnowin I should just ring ya bell, ding dong!\nBut that's one thing about this shit partner\nEvery move is so watched by these rich boxers\nSo why should I lose all my rich sponsors?\nI'm gone then you suddenly hip-hoppin?\nSheeit, sip the gin then I'm in the wind\nPop a beam like a M&M\nSo strong yet a nigga thin\nRappers stay sayin Slim so Shady but ain't talkin Eminem\nSo fuck you, him, and him\nI was gangbangin befo' a nigga entered in\nNo facade, I went from the yard\nTo a three-car garage to, instant menage it's\nVintage, relentless, I mean this, I promise\nNo Suge, No Dre, I'da did this regardless\nAnd thats what I'm supposed to think\nFlinch at me like I'm supposed to blink\nMotherfucker this Crip still, hard to swallow like a big pill\nPushin 40's still a big deal\nPonytail still swangin, hair still braided\nLaker to a Clipper I won't be faded\nNigga! So buzz on that shit\nBackflip back to plaque shit\nBlue red white to black shit, but for the green\nI send a whole motherfuckin team to clap shit\nReact to mack shit, problem, terrorist\nFuck this rap shit!\n\n[Outro]\nShots fired\nSuspect down\nRequest EMT immediately", "image": "https://images.genius.com/a9730b160b9e646d986f0b4659d2dc40.800x800x1.jpg"}], "artist": "Snoop Dogg"}