{"songs": [{"title": "Stand Up", "album": null, "year": null, "lyrics": "Be friends wit'cha gram!\n\nI want everyone to stand up and be counted tonight\n\nHey you, blow your whistle\nNow clap ya hands and say yeah! (yeah)\n\nTune my voice out, tune my mic out\nTune my voice out, tune my mic out\nYo, this is how we rock\nThis is how we rock\nThis is how we rock, rock\n\nHey you, blow your whistle\n\nYeah, we in the joint yo\nWe in the joint\nHey yo, hey, yeah, scream\n\nHey now, I want all you brothers and sisters to stand up\n(Ah shit!)\nI want everyone to stand up and be counted tonight\n(Stand up, yeah)\nBrothers and sisters, if you know you've got your thing together\n(Put your motherfuckin' hand in the air)\nI want you to stand on up!\nNow I got something to tell ya\n(Swing it from left to right)\nI'll tell you, now that I think about it\n(Yeah)\nAnd now I wanna tell ya how to get your thing together\n(Play with this, you can't play with this)\nCome on now, get a groove going\n(Uh)\n\nYeah\n\nHey you, blow your whistle\n\nYo, yo, yo\nYo tony, what up?\nHeard your dick was good\n\nYou should know, yo I fucked you on the side of my hood\n\nNever that dog\nFrom where you can never hit it\nThrow a razor in my mouth on the low\nAnd suck ya dick wit' it\n\nThe world famous, priceless, still stainless dick\nPray over this, scoped ya love, nameless\nHeavyweight dick in ya jaw\nGood lickin' fom ya lips, now baby girl throw the song\n\nYo, yo, yo\nAye yo Tony, you phoney\nWe both signed to Sony\nBut for half ya pub, ride that dick like a Pony, what\n\nYeah, what, put your money on my dick\nGirls, all eyes on my dick\n\nYo, yo, yo\nCats fatigued out, thinkin' they armies\nMy crew arms me with beats, how we swarm bee?\nWho bang?, be'More and Wu Tang, new thang\nMad at how we do thangs, RZA cop me two fangs\nOfficial, now I bite through gristle\nGold teeth style in from Philly to Stanton Island\nWhile in the meantime, spit mean lines\nFuck clean rhymes, like mine's grimmy\nLike my niggas be\nPicture me, coming off soft\nY'all just cough up shit, I swallow rhymes\nMakin' bitches swallow 9's, re-define\nThis rap shit, make my shit a classic\nLike Bethoven, stay posin'\nFor the camera, stamina\nLike a crackhead, and crackheads are amateurs\nYou try me, no in-between like why to Z\nPick brains like labotomies\nStill thoughts to charts of Billboard's\nThrow pour ill spores, leave niggsa stiff like still-born's\n\nI want all you brothers and sisters to stand up\n(What, what, what)\nI want everybody to stand up and be counted tonight\n(Stand up baby, stand up baby)\nBrothers and sisters, if you know you've got your thing together\nI want you to stand on up!\n(Stand up yo)\nNow I got something to tell ya\nI'll tell you, now that I think about it\n(Yeah, what, what, what)\nAnd now I wanna tell ya how to get your thing together\n\nI'm like Spider-Man's fifth brother up in the Clan\nDrop like crap's that's scattered all up in ya van\nSkelly-man crook, character star\nIn Donna Boines book\nMG--M, Heaven and Hell, sat with the cook\nWith the big spice bone, red hair's is killin' me\nKnotted up, twisted and green\nSeen them crystal's in that rap yo\nAnd get Barear\nBear hug and five hundred ounce of that Staision\nWild man, Sarah\nRush after hours, Alpha in the beds\nCaked hands like Dai Smith, rap haggler with a fade\nMagillia, Charli Baltimore with Hazel driftin' withdrawels\nWind Face start with the Killah\nStood still, a whole river chill\nLooked up and got dogged, that's when RZA started to build\n\nHey yeah!\nI want all you brothers and sisters to stand up\nHey yeah!\nI want all you brothers and sisters to stand up\n\nHey you, blow your whistle\n\nWhat, what, what, what!\n\nAye yo, you craze me, turtleneck nigga rockin' Pasley\nShots crazily, steady blazin' where the spaids be\nTeams like Starsky and Hutch, you put deluxe truck\nYa bankrupt, 52's Knox, I heard you Ku Klux, damn\nTear it out the van, sweat it with a tan\nWith get like Remo spray can, suga the ram\nFuck a cocktail, get my balls licked in Hell\nRead his Igloo Tales, hell all the dogs with broken tails\nSalt range, short order tab\nIronman, bubble bath, nuclear, split the atom in half\nMeet dime O's, fifth brother bug inside 8 pole\nChange though, crush the birds inside the strip pose\n\nRap Conspiracy, hold songs for ransom\nLancin' in Ghostmode, coke mixed with Branson\nSheisty, tree's soaked in half-ki's\nSabotage N.Y. with snipe's and 79's\nChannel 9's scene street team made news with who's\nCharli, every 16 bars be\nSickening, peep the scription\nRhyme vixen\nKeep the clips in tact, watch ya back\nAin't done yet, 8-Spunett\nPoison webbers\nSpider-Woman, two legged, how we did it\nWhat!\n\nCome on and get a groove goin'!\n\nHey you, blow your whistle\nHey you, blow your whistle\n\nNow clap your hands and say yeah\n\nYeah\n\nNow let me count it off\n1 2 3\n\nHey\nHey, hey, hey yeah!\nI want all you brothers and sisters to stand up", "image": "https://images.genius.com/227de22e535416c2ec2a6f012f37c9ef.620x400x1.jpg"}], "artist": "Ghostface Killah"}