{"songs": [{"title": "Ya Heard", "album": "LAX", "year": "2008-08-26", "lyrics": "[Intro: The Game & Sample]\nYeah (don't you hear?)\nCalifornia, New York\nChi-Town while I get down (don't you hear the sound?)\nM.I.A, ATL what's up? (sound)\nHouston, Frisco (said don't you hear the sound?)\nDetroit get money just like N.O. (don't you hear?)\n(Don't you hear the sound, sound?)\n\n[Verse 1: The Game]\nYou see that cherry red Phantom on them big ass wheels\nYou see I be playing with them cars, I'm like a big ass kid\nCrazy with that cap gun, so if we play cops and robbers\nI'll show you how to pop revolvers\nFitted cap too big, so it cover my eyes\nThat Lambo? That ain't shit, just a public disguise\nAnd that top model chick, she for the diamond lane\nAnd I be driving all crazy cause my diamond chain is (bright)\nAs them Las Vegas lights\nIt be the same in California when I'm riding at night\nIn New York, I be in Midtown, up and down Broadway\nHaving meetings all day, baby my future is (bright)\nAs Lebron's, take off on anybody\nTyra Banks on my arm and we'll crash any party\nYeah, making it rain, ain't got shit on me\nThe way I ball, the fuckin owner should come sit on me\nYeah, I'm fresh out of jail, you shoulda knew I was back\nTurn on the radio, it's a rap\n\n[Chorus: Sample & Ludacris]\nDon't you hear?\nDon't you hear the sound, sound?\nSaid don't you hear the sound?\nJust touched down at L.A.X, Luda!\nDon't you hear?\nThat's right, what up Game?\nDon't you hear the sound, sound?\nHeheheh, fresh out huh?\n\n[Verse 2: Ludacris]\nDon't you hear it? That nigga named Luda\nSlicker than Rick the Ruler, whoop ass like Lex Luger\nMy money long, your shit is shorter than Oompa Loompas\nAnd I'll Superman (youuu) that ass like Lex Luther\nShoot you then say \"me gusta\", I'll take you to meet ya maker\nMy dick's the Staples Center, I'll take you to see the Lakers\nSwish! On that Cali kush, smoking like a muffler\nSo many red flags I coulda swore I was in Russia\nGame! I got the fame and the fortune, Compton is scorchin\nGet rid of bullets, my gun keeps havin abortions\nI ain't havin it, see em in the dead zone\nFake dope boys is more bass up in my head phones\nAdjust your treble, I'm heavier than metal\nMy verses are hot as shit like I recorded with the Devil\nI'm on another level, they stuck on the elevator\nAnd I'm about to blow this bitch, Game press the detonator like\nFresh out of Georgia, ya heard I was back\nTurn on the radio, it's a rap\n\n[Chorus: Sample]\nDon't you hear?\nDon't you hear the sound, sound?\nSaid don't you hear the sound?\nDon't you hear?\nDon't you hear the sound, sound?\n\n[Verse 3: The Game]\nSee I'm come from the bottom and they call me The Game\nBut I'm just happy that Beyonce know my name\nI took that Dr. Dre money and I bought me chain\nThen I bought me a house, then I bought me a Range\nThen I bought me some pussy, then I bought me some brains\nBut I ain't buyin' that the best rappers is Kanye and Wayne\nSee both of them niggas spit, but y'all act like you don't hear me spit\nLike sellin' seven million records ain't the shit\nI don't win no Grammys, nigga I'm too gangsta\nAnd poppin Cristal with Irv, don't make me a wanksta\nSee I'm California certified, my niggas make the murder rise\nRead my fan mail in jail, Buck told Curtis bye\nSo I'ma break it down, for them niggas in the South\nSlow it down, put this Rolls Phantom grill in my mouth\nThrow the Prada slippers on, when I walk in my house\nP. Diddy and Tommy Lee know what I'm talking about\nSee I'm fresh out of jail, I know you heard I was back\nTurn up the radio, it's a rap\n\n[Outro: Sample]\nDon't you hear?\nDon't you hear the sound, sound?\nSaid don't you hear the sound?\nDon't you hear?\nSaid don't you hear the sound?", "image": "https://images.genius.com/bba1920bee43a618432ce43748293ec6.1000x1000x1.jpg"}], "artist": "The Game"}