{"songs": [{"title": "Feelin It", "album": "You Know What It Is Vol 4 - Murda Game Chronicles", "year": "2007-04-08", "lyrics": "[Intro: Game & Young Rob]\nYoung Rob what's good my nigga?\nChuck what' up with you\nShit, in here holdin' it down man. When you gonna come see a nigga, put somethin' on my books man\nYeah, I just shopped you something the other day, it should be getting to you. Like the next day or two\nYeah yeah, I'm fuckin' with you nigga. Bitch came to my fuckin' bail, came to my cell nigga said 'I had like 2.2 on my books. What I wanna buy?' Told that bitch give me a motherfuckin' million dollars worth of playboy books\nYou know I had to keep a nigga' books right?\nYeah yeah, you keep a nigga flodded man just wait 'till I touch down, I'm gonna be on some shit\nYou been writin' in there?\nLittle bit, know what I'm sayin' -- on the walls and shit\nCouple bars here couple bars there, been fightin' and shit\nYou got something I could listen to real quick?\nShit, g-yeah. Check it\n\n[Verse 1: Game]\nMost of these rap niggas be fakin', I'm talkin' the throne chases\nI diss 'em on any basis, throw Patrón shots to my face and\nStay blunted like jamaicans, the Marleys puffin'  the finest cheefa\nFuckin' the finest divas, if I have it  I'd like to meet 'cha\nShow you how I light the streets up, kill niggas that never speak up\nYou my fans, sit in the stands and watch me rip these beats up\nLike a legend, feel my presence like the dead ones\nIf I die, my only wish is my face on some Air-1s (Okay, okay, okay)\nMy soul's curled, my baby mommas they drive 6s\nAs for my bitches there's other rappers out there that's trickin'\nMy only mission was to sell a couple records\nBuy a Bentley and drive reckless, a big medallion on my necklace\nI 'seen Kane and Rakim do it, so much respect here\nHip Hop is dead because you new niggas dont get the message\nI used to call names out, you niggas dont deserve it\nSo lame out, die from these bullets 'outta Game's mouth (ooh)\n\n[Interlude: Game & Young Rob]\nYeah I've been here flexin' my shit nigga I told you\nYeah I see your shit's on fire, nigga I know you got some more shit I can listen to\nShit, hell yeah check it\n\n[Verse 2: Game]\nMy flow polished, I studied the legends\nHip-Hop scholar kick knowledge get dollaz'\nYou got some work then holla\nI'm on the block pitchin', most of us got riches\nNot trippin' work hydraulics and fuck the hot bitches\nYoungins dont stop wishin', if you got a block then flip it\nJust because I'm a blood don't mean my niggas should stop crippin'\nWe from the ghetto, we came up without a pot to piss in\nWe gettin' money stayin' blunted cause' the clock is tickin'\nYou got a rock then pitch it, you got a Glock then lift it\nThem G-Unot t-shirts make them niggas stop snitchin'\nForever ballin' I'm Jim Jones with rims\nOn that blue Aston Martin interior like my skin tone\nMost of these rappers want me dead, shit I been gone\nToo classic, move rapid, my jewels the blackest\nThe first 8 letters and everything that I stand for\nColder than a New York block, shut the damn door\n\n[Interlude: Game & Young Rob]\nChanged up your style up this shit, ooh-ee\nHad to give the East coast niggas somethin' man\nYou know I be on my motherfuckin' gangsta shit\nSometimes I just gotta' spaz out\nMan, damn I can't wait 'till you're home, boy\nYou know man, it's like, it's just another year and half\nI'll be good man. Need some pussy though, that's the main shit\nPussy and Patron\n\n[Outro: Game & Young Rob]\nNiggas calling me back for an Encore like I'm Eminem\nI disappear niggas like spinnin' rims who the fuck wanna war\nMeet us at in the corner store, call it the hot spot\nWhere gangbangers throw hot rocks the boys coming So what\nThey pop cops, push them hot drops Hop out with them shirts on\nAnd say we got rocks High-school drop outs\nThey're there to air the block out, stack paper like the OGs told us\n(Ey come on my nigga I gotta go, gotta go)\nWe only chirp on Nextels don't talk on them Motorolas\nGotta' feel that (I gotta go pick up Brandy man, Chuck)\nSo kick back and listen to what I'm saying, picture me parleying (Chuck) I'm flippin' bricks when you eating pussy you chicken shit\nI fuck bitches on their time, I 'chall when they dime\nGettin' head under the table everybody stay calm\n(Aww fuck this shit)\nI'm great", "image": "https://images.genius.com/fd823b680b687dac4f58ed6122bbab9b.500x500x1.jpg"}], "artist": "The Game"}