{"songs": [{"title": "I’m Talkin", "album": "Supa Dupa Fly ", "year": "1997-07-15", "lyrics": "[Verse 1]\nNigga, what's up? You think you tough\nI'm fly shit, high as a bitch, dope as fuck\nSho' nuff I'm guaranteed, no diggities\nFight you like the fucking enemies\nYou would think there's fucking ten of me\nWhen I'm sending these blows, blows\nHoes wanna roll like hydro\nWanna suck Timbaland's bone like you Fido\nI go, scoop Lil' Kim, me, she, her, them and him\nGets high in The Tunnel\nThey see my Lexus comin', they hear the bass rumblin'\nThey come quick, they come quick like a dick\nI make myself sick, I'm so motherfuckin' bad to the bone\nLike my titties on full blown\n\n[Chorus]\nMy style of rappin (My style)\nI'm su-su-such a good rapper (I'm su-su-such a good rapper)\nI give you good and plenty (Yeah, yeah)\nMy style's the bomb diggy (My style)\nMy style of rappin' (Yeah)\nSu-su-such a good rapper (I'm such a good rapper)\nI give you good and plenty (Uhm, mmm)\nMy style's the bomb diggy (Brrr)\n\n[Verse 2]\nI'm calling your cards like Sprint\nCan't be me, can't see me, I'm low like Timb\nLadies and gents, dogs, cats and babies\nWhoever bit my style I hope you croak from the rabies\nSwayze, maybe I call your name, ain't that a fucking shame\nI'm too high for that, I'm great like the dane\nMane on main if you decide to put your hands\nOn my fucking light, like the cigarettes I light\nYou must burn, you better learn from the pro\nWho rock shows after shows, when it rains, it pours\nI hurt like the cold souls, my style polishes like nails and toes\nYou know\n\n[Chorus]\nMy style of rappin (It's such a good...)\nI'm su-su-such a good rapper (I'm such a good rapper)\nI give you good and plenty (I give)\nMy style's the bomb diggy (You know my style)\nMy style of rappin (I'm such...)\nI'm su-su-such a good rapper (I'm such a good rapper)\nI give you good and plenty (Yeah, yeah)\nMy style's the bomb diggy (Uhmm)\n\n[Verse 3]\nYou beg to be put on like pants\nNigga know who I am\nNow you want to sing and dance\nYou want to shake your stanky ass\nWell I'm sorry Sam, God damn\nYou ain't family, you hounding me\nPounding me with the same old story, ahh, you bore me\nLordy have mercy on all these groupies\nSorry cutie, why you go and shake your bootie?\n'Cause there's only one Lil' Kim\nThe triple beam, the misdemean, nigga queen\nWhoomp, we Tag Team\nSo hot we melt like ice cream\nWithout the dick riding\nDreams of smoking a California blunt\nI got the lyrics to make you feel it\nWhat you want nigga?\n\n[Bridge]\nI'm talking about my style\n(I am the flyest then RZA now)\nI'm talking about my style\n(Let me tell you about Missy's style)\n\n[Chorus]\nMy style of rappin' (Oh my)\nI'm su-su-such a good rapper (Su-su-such a good rapper)\nI give you good and plenty (Yeah, yeah)\nMy style's the bomb diggy (You know my style)\nMy style of rappin' (I'm such a good rapper)\nI'm su-su-such a good rapper (I'm such a good...)\nI give you good and plenty (Good, good)\nMy style's the bomb diggy\n\n[Outro]\nHey Timbaland be talkin' more shit\nAnd Lil' Kim be talkin' more more shit shit\nDa Brat be talkin' more more more shit shit\nBusta Rhymes be talkin' more shit, talkin' more shit\n702 talk shit shit\nAnd Aaliyah talk shit shit shit\nGinuwine-wine talkin' more more more shit shit\nAnd I be talkin' more shit\nAnd Total be talkin' more shit\nMaganoo an-and St.-St. Nick, we be talkin' shit\nWe be talkin' shit, I, I, I, I, uh huh\nJimmy talkin' shit too I, I, we out", "image": "https://images.genius.com/2f8d14420255722b5068b9dac8cfd6ef.1000x1000x1.jpg"}], "artist": "Missy Elliott"}