{"songs": [{"title": "Wowzers", "album": "I Am Not a Human Being II", "year": "2013-03-22", "lyrics": "[Intro: Lil Wayne]\nSoulja Boy on the beat\n\n[Hook: Lil Wayne]\nMy tongue is a uzi, my dick is a AK\nMy tongue is a uzi, my dick is a AK\nMy tongue go brrrr, my dick go bahh\nMy tongue go brrrr, my dick go bahh, bitch!\n\n[Verse 1: Lil Wayne]\nLay on the bed, open that twat\nI French kiss that pussy, like muah\nSit on my face, M-U-A-H\nBefore I eat that pussy, I say my grace\nGirl I'm nastier than him, I don't know why you still with him\nBeat that pussy, go to sleep, she got that Tylenol P.M\nFuck that bitch until she tired, 'til she tired like a rim\nGive her head like a brim, it tastes good, M-M-M\nPussy monster in her closet, full of surprises\nI give full body massages, I hope that pussy smell like a violet\nI hope that pussy warmer than luke and sweet as Godiva\nSuck this dick and swallow that nut and call it Penis colada\nLift up that mini-skirt, that's my dinner desert\nShe fell in love with the Martian, I said you too down to Earth\nMan, these hoes love Wayne, got a bunch of dimes, that's chump change\nThis shit is target practice and your bitch is my gun range\n\n[Hook: Lil Wayne]\nMy tongue is a uzi, my dick is a AK\nMy tongue is a uzi, my dick is a AK\nMy tongue go brrrr, my dick go bahh\nMy tongue go brrrr, my dick go bahh, bitch!\n\n[Verse 2: Lil Wayne]\nMy tongue is a uzi, my dick is a AK\nDown here waiting for her to come like payday\nHoping this juice is sweeter than baked cake\nShe say it's for Tunechi, she lie with a straight face\nBut I'm trying to eat healthier, so I ate a veggie\nSucked on that pussy, I feel better already\nShe say \"Tunechi go slower\" and Tunechi went faster\nMy tongue is a motor, my dick is a NASCAR\nWhipped cream on that pussy, dickhead like a bullet\nIf her hair real I'mma pull it, hope that ass feel like a cushion\nI give her wood when he wouldn't? I hope that pussy tastes like pudding\nAnd I get that ho the boot, hold up, let me put my foot in (Tunechi)\nGot a sweet tooth, candy yam pussy\nI'mma leave that ass smoking like a Amsterdam tourist man\nThese hoes love Wayne, got a bunch of dimes, that's chump change\nThis shit is target practice and your bitch is my gun range\n\n[Hook:]\nMy tongue is a uzi, my dick is a AK\nMy tongue is a uzi, my dick is a AK\nMy tongue go brrrr, my dick go bahh\nMy tongue go brrrr, my dick go bahh, bitch!\n\n[Verse 3: Trina]\nLay on that bed, open your mouth\nThis pussy so clean like soap in your mouth\nI do my lil' dance, he scoping me out\nIf that dick like a tree watch me build a treehouse\nOk, the baddest bitch in this bitch, got the fattest clique in this bitch\nYou might drown, you better start doggy paddling in this bitch\nI'm Trin, B nigga? Queen nigga, sleep in this pussy, dream nigga\nI stay on that dick like a fucking balance beam nigga\nHair pull, neck grab, don't fuck with hoes that backstab\nDon't fuck with niggas that ain't got shit, if I fucked a nigga then that's my dick\nMy mouth a jacuzzi, my pussy a safe place\nFuck me 'til daybreak, then you can go skate, Trina", "image": "https://images.genius.com/025852747d34bfec09080ad4c10b07b6.1000x1000x1.jpg"}], "artist": "Lil Wayne"}