{"songs": [{"title": "Da Ill Out", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "[Intro: Erick Sermon]\nYo Reggie, uh\nD-E-F Squad\nMuddy Waters\nDon't get it twisted... nigga\n\n[Verse 1: Redman]\nAyo, everybody in this motherfucker will get touched\nFuck such and such, I roll tight like handcuffs\nRock that ass to sleep with discrete techniques\nI beez that, Freak of the Week like I made Knee Deep\nHold up! Rotate around the solar, Madder than Cobra\nComposure never sleeps, my stream pumps Folgers\nI'm sautéein' MC's with fried rice up in the wok\nWithout the MSG and chopped celery\nSee, I made it, my flavor situated\nFrom the nickel plated mic that's hot, to leave your brain inflated\nPlus, I'm thick like Quakers on papers\nBodacious MC's get turned to lower cases\nLettering, and the medicine, that I'm swallowin\nGet you hollerin', like Marvin Gaye\nWhen his father shot him in the chest\nI roll with two stacks of TECs\nAnd mad niggas in sets that'll roll up in your rest, UHH!\nMister Fantastic's crafted off that 50 sack of ass kick\nWhen I'm blasted, my mathematics get drastic\nThat you can't see with bifocals\nWatchin MC's go up and down like stock brokers\nI leave your brains on tilt, with ill skills that's milk\nThat's rougher than jeans that Gloria Vanderbilt\nI'm poppin mad shit, plus I can back it\nYour man'll be like \"Yo, get that dust off yo' jacket\"\n\n[Verse 2: Keith Murray]\nIt ain't a test or quiz that my Squad can win\nThose who know the biz, know we rap kids, get biz\nYou'll digest, multiple stab wounds to the chest\nThen I copycat, kill the rest\nWith no method to my madness\nBless the apparatus with the baddest\nDetermined to be the last man, standing on the planet\nYou'll get attached, like a blood sucking leech\nWhen you fall into my rhythm of speech\nYour ears get embraced with a touch of the bass\nHead get wrapped up, neck get thrown in a neck brace\nRough rhyme mechanical, lyrical at it who?\nWill ironically chronically murder you and your crew\nMy objective, the way I live, is kinda primitive\nSee I get to the bottom of the problem, and make shit give\nStep in the jam, hooded and high, plastered the master\nCast to the masses, grabs the mic\nTen dollar rappers is what L.O.D. goes after (Tweek, Tweek)\nTo my Squad, there's no matches, we mashes\nDo photo flashes in all flavor S-classes\nBomb attack on wax, lyrical mini Mac to your back\nTie you up, throw you in the Ac'\nA public figure, who walks around with a jaded jigger\n'Cause I gives a fuck about another nigga, word up\n\n[Verse 3: Jamal + (Erick Sermon)]\nMuddy Waters, yo this is the way that my intro should go\nDrunk slow funk flow for Reggie Noble\nFuck with me doe, Mally G doe it's not logic\nPlaying that big shit get broke down microscopic\nBring it back keep the track ringing, with the bassline\nIt's major when you savor my flavor, can you taste mine\nFace the nine I lace your spine with short fat pace\nAround and round, avoiding the time to put it down\nNow's the time here, yeah\n(Clown where, pick a spot\nNeutral grounds or not, we give a fuck, lick a shot)\nGangsta, so called killin', cap peelin', playalistic\nI mean, is all that shit realistic?\nPlay your cards, God, black keep your hand held tight\nNightfall might call your life, shit is trife\nOn these evil streets after dark\nNiggas gettin sparked left and outlined in chalk\nNew day, seriously, this whole shit's twisted...(As a man)\nIt's me bombin' on these niggas shitlisted, Mally G\nOpen your eyes to see, recognize who be a G\nHopin' to rise in thee, industry with E\nThe villain's at it 'cause I had it (Word up, yeah)\nKillin' my psychosomatic pattern rhythmatic (Yeah)\n\n[Outro: Erick Sermon]\nY'all know, uhh, yeah\nMuddy Waters, we out for nine-seven, word up, peace", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}