{"songs": [{"title": "Missing", "album": "New Black", "year": null, "lyrics": "[Verse 1]\nUh\nSeems like since we got a black president\nBlack people stop questioning the government\nAnd that ain't no diss to Barack either\nSo Mutherfucker you can miss me with that other shit\nI'm good for life, I don't really need another hit\nYou wanna bury me you better get the shovel and\nYou better make it deep enough where no one will recover me\nI'm Bobby Fucking Ray, I'm a modern day anomaly\nLast year I did a show on a continent\nIn a country with a struggling economy\nWho the hell you think paid for it all?\nIt sure ain't rocket science And it sure ain't trigonometry\nDrug money, drug money, drug money\nBlood money, blood money, blood money\nFor god sakes there's an all-seeing eye on the back of the dollar, we can't even trust money\nYou need to understand who you dealing.. With\nThese are like modern day villains\nThese are type of people that would kill a whole village\nBuild a fucking building.. And say it's just business\nWho you think gave you religion?\nLand of the free.. Who you think built it?\nAnd don't ever let them tell you nothing different, cuz we know who did it if I ever come up missing\n\n[Hook]\nI'm missing, I'm missing, I'm missing\nTen strands of my DNA is missing\nCuban Linx on my neck as they glisten\nListen up Mutherfucker pay attention\nIt's a New World Order that we live in\nLies on the lips of every politician\nMan at night I pray to God for forgiveness\nI just wonder if the big homie's still listening\nStill listening, I wonder if the big homie's still listening\nStill listening, I wonder if the big homie's still listening\n\n[Verse 2]\nI don't need a hook but for hooks sake\nIf I had a hook, I'd make the hook say\n\"Be a good slave, be a good slave\"\n(Be a good slave, be a good slave)\nEverybody in my hood brave\nEverybody in my hood slang\nEvery street got a freak\nAnd they give her all the wood that she could take\nI'm fresher than a faema coffee\nGet it? I'm fresher than a FEMA coffin\nI'm willing to die for mine\nBut you the type of nigga\nYou'll call the police department\nIf you can't look in someone's eyes and be yourself\nAnd speak the thoughts that's on your mind\nYou ain't got no reason to live\nYou on the sideline\nYou just a motherfucking slave\nThey got your mind tied up and it's missing\n\n[Hook]\n\n[Verse 3]\nUh, I know I appear to be quite severe\nAn unopen mind will consider me weird\nThats just how the Matrix has been engineered\nNow lend me your ear\nLend me your ear\nNot to strike fear\nMore like Paul Revere\nNot talking down on nobody at all\nI just got some shit I think you should hear\nUh, Look\nI ain't acting like I got all these facts and shit\nBut if you calling me a liar, look up in the sky\nLook up in the sky you can see it happening\nUh, I'm not a activist\nJust a young, black nigga with a half a sense\nCause there's ancient knowledge that they hiding from us\nAnd I think it's time that we take it back again\nBecause it's missing\n\n[Outro]\n[First seven lines of Hook repeated]\nLast night I prayed to God for forgiveness\nI know they listening, I know they listening\nI know they got my phone tapped and they listening\nLouis V's on my bag and the feds wanna know what's in the suitcase, Pulp Fiction\nAm I the realest? Am I the realest?\nCause I don't only talk about it and I live it\nBut they don't want anyone to find out the truth\nAnd if I'm right I'ma wind up—", "image": "https://images.genius.com/54ff9f204f4b8fc3528da5fc7e538aa9.500x500x1.jpg"}], "artist": "B.o.B"}