{"songs": [{"title": "Why You Hate the Game", "album": "Doctor’s Advocate", "year": "2006-11-14", "lyrics": "[Chorus: Marsha Ambrosius]\nTo everybody who knows my story\nTo all of those who came before me\nMy time is now, I'm gon' do it all over again\nAin't nothin' new ain't nothing change\nI'm still gonna do it my way\nYeah I still remain\nSo tell me why you hate the game\nSo tell me why you hate the game\nThis time I do it better just because\n\n[Interlude: Nas]\nY'all know what it is\nThe streets named me Illmatic but yet I'm still at\nCan't hate us\n\n[Verse 1: Nas]\nFelon, Vice behind me on the intersection\nSex and drugs my anthology on perfection\nDress superb, admired by conspirists\nWho wanna try me but ain't high enough to 4-5 me up\nChild of the 80s, y'all niggas is lazy\nComplainin' 'bout labor pains nigga show me the baby\nAnd my nigga Game light another L, pass the bottle\nPro-black I don't pick cotton out a aspirin bottle\nYeah I learned my lessons and heard y'all snitchin'\nWitnessin' you rockin wit' narcs confirmed my suspicion\nGreen fatigues on, my niggas I'll bleed for 'em\nI can show 'em the water but can't make 'em drink it\nAnd I can show them my fortunes but can't force 'em think rich\nAnd still I don't abort 'em when and if they sink quick\nIgnore the ignorance I rep the brilliance of Queensbridge\nAnd pray the feds let Murder Inc. live\n\n[Chorus: Marsha Ambrosius]\nTo everybody who knows my story\nTo all of those who came before me\nMy time is now, I'm gon' do it all over again\nAin't nothin' new ain't nothing change\nI'm still gonna do it my way\nYeah I still remain\nSo tell me why you hate the game\nSo tell me why you hate the game\nThis time I do it better just because\n\n[Interlude: Game]\nI don't talk about my guns nigga I Just Blaze\n\n[Verse 2: Game]\n'Pac is watchin' B.I.G. is listenin'\nWhile Pun talkin' to us Jam Jay still spinnin'\nTo every nigga listenin', I was supposed to be amongst kings\nMy mom shouted out at my christenin'\nAnd while you still listenin', Shyne locked in a manhole\nAnd Cam got shot inside his Lambo, it's ample\nLife is a gamble, 15 years old, red rag around my head\nMy sisters used to laugh and call me Rambo\nSeen Eazy's legacy melt away like a candle\nI rekindled the flame, Dre created The Game\nNigga Wit a Attitude, from the cloth I came\nYoung homie ate his way up from the bottom of the food chain\nKeep the crown, clown. I rock a L.A. Dodger fitted\nShowed my ass at Summer Jam but New York was down wit' it\nNow the ball's in my court never dribble out of bounds wit' it\nBehind the back to Nas he alley oop to Jigga, nigga\n\n[Chorus: Marsha Ambrosius]\nTo everybody who knows my story\nTo all of those who came before me\nMy time is now, I'm gon' do it all over again\nAin't nothin' new ain't nothing change\nI'm still gonna do it my way\nYeah I still remain\nSo tell me why you hate the game\nSo tell me why you hate the game\nThis time I do it better just because\n\n[Verse 3: Game]\nCheck it, me and nasty puffin', it's a classic trust me\nI even pass the dutchie to them niggas that don't love me\nI'm talkin' niggas that never wanted to see me on top\nSame niggas that never wanted to see The Doctor's Advocate drop\nFlop, I think not, I fuck you rap niggas like virgins\nDre took my trainin' wheels off it's curtains\nI don't need no encore no claps no cheers\nThe Game ain't over this the beginning of my career\nThe endin' of yours the endin' of his\nLike Flavor Flav's clock, I'm back to handle my biz\nNigga it's Game time that was Dre's favorite line\nBack when Proof was in the booth and I recited his lines\nAnd I still think about my nigga from time to time\nMake me wanna call 50 and let him know what's on my mind\nBut I just hold back cause we ain't beefin' like that\nHe ain't B.I.G. and I ain't 'Pac we just eatin' off rap\nOne love\n\n[Chorus: Marsha Ambrosius]\nTo everybody who knows my story\nTo all of those who came before me\nMy time is now, I'm gon' do it all over again\nAin't nothin' new ain't nothing change\nI'm still gonna do it my way\nYeah I still remain\nSo tell me why you hate the game\nSo tell me why you hate the game\nThis time I do it better just because\n\n[Outro: Just Blaze]\nIt ain't over, Ladies and gentleman\nI go by the name of the one and only, Just Blaze\nI got a couple people in the house with me\nUsually we do this at the beginning\nBut we gon' do it at the end this time\nI wanna take you to church real quick\nSo I'mma need some help\nI need 1500 or Nothin' wit' me\nThe wonderful talents of Marsha Ambrosius from Floetry\nAh yeah there we go\nThe sun is shinin' down on us right now\nWe feelin' real good, we know y'all do too\nSo if you feelin' good, sing along\nClap along, stomp along, catch a lil' Holy Ghost\nAnd if you ain't feelin' good God willin'\nBy the end of this record, we gon' change all that\nAyo Lorenz you ready? There it is, pass me them drumsticks\nAlright everybody please join in, ya life ain't good\nYou can get it right, take this opportunity to do so\nAnd ummm, I'mma let it do what it do\nRest in peace George Eliot here we go!\n\n[1500 Choir & Marsha Ambrosious in the background]\nAnd the sun shines with you\n\n[Outro: Game]\nI wanna thank everybody for comin' out. God bless\nOne love\nGood night. Or good day if you on the other side of the globe\nYo Just, we on the move with this shit\nDoctor's Advocate. See you on the third album\nHate it or love it", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg"}], "artist": "The Game"}