{"songs": [{"title": "Made It from Nothing", "album": "Wins & Losses", "year": "2017-07-21", "lyrics": "[Chorus: Teyana Taylor]\nI know you thought I wouldn't shine like this\nThey know I took my time with the shit\nDiamonds on my neck, I blind them with the wrist\nHey, it feels good when you make it from nothing\nI grind like this\nSo I can shine like this\nThem diamonds on my wrist\nIt feels good when you make it from nothing\n\n[Verse 1: Meek Mill]\nUh, North Philly in my bloodstream, nigga\nSouth Philly from my dad genes, nigga\nI could wear my dad jeans\nBought my mom and sister a new crib when that cash came\nNigga, put some respect up on my last name\nNo better feelin' than seeing my cousin serve his last fiend\nNo better feelin' seein' lil Papi talkin French to me\nAll this money, these pussies will never get to me\nWhy you think you never hear 'bout what they did to me?\nHunnid bands, quarter milli, talking big money\nI'm want you dead and nobody stopping shit, homie\nCause honestly we give a fuck about your big homie\nFuck it, posted in the jungle with a ladder\nHow can they compare me to a rapper?\nDid it for attention 'cause he had to\nNiggas broke, their opinions never mattered\nFuck 'em!\n\n[Pre-Chorus: Teyana Taylor]\nDamn, it feels good from way up here\nDamn, it feels good, baby\nYeah, from way up here\n\n[Chorusk: Teyana Taylor]\nI know you thought I wouldn't shine like this\nThey know I took my time with the shit\nDiamonds on my neck, I blind them with the wrist\nHey, it feels good when you make it from nothin'\nI grind like this\nSo I can shine like this\nThem diamonds on my wrist\nIt feels good when you make it from nothin'\n\n[Verse 2: Rick Ross]\nDreamchasers, accomplishments are remarkable\nBig fish, little fish\nI always need a prayer before we do the toast\nMy circle competitive, let's see who move the most\nI gave my niggas game before they knew the ropes\nNow let's talk about numbers, I really do 'em both\nI still got two real uncles who still be doing dope\nOne of them used to run with a fluky stokes\nSo many new faces sometimes I do get ghosts\nStill one call away from ones who really knew me most\nStaying in my lane out of the uzi smoke\nYou only beating cases based on who you know\nPublic defender gave him a funeral\nJuvenile sent to Rikers, he never knew the rules\nAssesin' religions, he don’t know who to choose\nLet's bow our head over these Ramen noodles\nGod is the greatest and I pray for peace\nStill rolling up that leaf, Mr. Drew Ali, I salute you\n\n[Pre-Chorus: Teyana Taylor]\nDamn, it feels good from way up here\nDamn, it feels good, baby\nYeah, from way up here\n\n[Outro: Teyana Taylor]\nI just want the money, baby, yeah yeah yeah, hey\nWhat they want from me, baby? Yeah yeah yeah, whoa\nAnd we still want it, baby\nMoney is coming, we still run dough\nNiggas run up but we never lay low\nNiggas kept it real so we never lay low, never lay low\nRun through the money, going way up\nMoney on the wheels go way up\nThe doors on the coupe go way up\nIt's so easy to hate us\nNiggas in the club spilling Aces of Spades\nPopping on the bub' and they love a check\nNiggas going somewhere, I'ma make it\nIf you ain't got my money, I'ma take that\nThey probably thought a nigga wouldn't shine like this\nGot deals so I signed like this\nDiamonds on my neck, I blind them with the wrist\nHey, yeah\nI'ma change my mind on you\nYou know how we do\nI'm eating lobster on a plate now", "image": "https://images.genius.com/ec7675975ca453c70be417aff74e4a4b.1000x1000x1.jpg"}], "artist": "Meek Mill"}