{"songs": [{"title": "Puffin’ on Blunts and Drankin’ Tanqueray", "album": "15 Years on Death Row ", "year": null, "lyrics": "[Intro: Dr. Dre]\nYeah, yeah, yeah\nYo yo, let's do this shit\n\"I thought I thaw a puddy tat\"\nYou's a punk-ass nigga\nYo, yeah\nYo, Death Row's in the motherfucking house\nWrecking shit you know what I'm saying\nThis is Dr. Dre in the motherfucking house\nYo, I got my homeboys in the house\nTha Dogg Pound's definitely in here, yeah\nI got my nigga Kurupt ready to wreck some shit\nYo, you know what else I got in the house?\nYo, so diggi-Daz step up on that ass\nYeah, guess what's in here?\nMy homegirl Rage, I said my homegirl Rage\nYeah, the lyrical motherfucking murderer's in here\nYo my nigga Glove behind the boards\nYo dropping that funky-ass bassline, yeah\nYou know, you know there's a lot of punk-ass niggas out there\nA lot of punk-ass bitches out there\nYo you wanna write names?\nYo that nigga Eazy-E, he's a punk-ass bitch, really though\nYo that nigga Tim M-U-T, he's a punk-ass biatch, biatch\nYou know what I'm saying\nOh, oh, oh Luke, I didn't forget about you, biatch\nReally though\nYo, Death Row's in the motherfucking house\nRunning the 9-3, you know, yeah\nBut right about now\nThere's a little freestyle session going on, in the studio\nWe just kicking back getting fucked up and all\nYou know, puffing on a few blunts\nDrinking on a little bit of that Tanqueray, Tanqueray\nYeah Tanqueray's definitely in the house\nYou know what I'm saying\nCause I'm feeling it baby\nI'm feeling it, really though\nSo-a, right about now, aiyyo Rage\nYo Rage, yo run that shit G\n\n[Verse 1: Lady of Rage]\nAlways and forever, forever and always\nThe rhythm will flow from now and through all days\nAs long as the sun shines\nAs long as Eisenhower's on the dime\nYo, I'll be kicking the rhyme\nOne time for your mind, your soul, your body\nThe OG's on the side of me\nSmooth as E & J, hard as Bacardi\nSmacking those yaddy-yacks ducks that keep quacking\nHens that are cackling, end up crackling\nUnder the heat, the pressure from the one that's deffer\nEgyptian ruler, call me Cleo or Nefertiti, yes indeedy\nGot the eyes that are beady, body from Tahiti\nVoice of the wind lyrics, blow\nChills up your spine I send, so\nAll thoughts in your mind drop 'em yo\nYou came in the front but you'll be kicked through the back door\nIf you try to step, try to come incorrect\nTry to play the left, try to start a mess\nTry to cause a fuss, try to raise a ruckus\nHuh, you'll end up ashes to ashes, dust to dust\nA busta, you musta been buggin on drugs\nAnd alcohol back off, all a y'all, up against the wall\nSpread em, Doggs - go get em\nHand-cuff em and stuff em, cold shut em, don't let em\nUtter a word, not to mother or Herb\nIf you try you die, visions blurred, speech slurred\nServed with a cherry on top\nRage in effect I just begun to rock\nYeah rock on witcha bad self (Rage)\nRock on witcha bad self (Rage)\nRock on witcha bad self (Rage)\nRock on witcha bad self\n\n[Verse 2: Dat Nigga Daz]\nYo, I'm Dat Nigga Daz who packs a tre-8 slug\nA true nigga from the hood and the Pound gives love\nYou see niggas wanna be down but never came around\nSo back up off my nuts and stop sweating the Pound\nYou see, niggas get broke off like 1, 2, 3\nCause I'm the D-A to the, D-A- to the Z\nNow G'z pay attention to this young ass mack daddy\nIn a Caddy, had he\nNot known about the city where the niggas hang around\nSo I roll em up, and hit em up with the motherfucking Dogg Pound\n\n[Verse 3: Kurupt]\nI'm rough and rugged, and up to do dirt\nI'm from the Dogg Pound nigga so I'm putting in work\nI'm no joke, who the fuck you trying to provoke\n(1-8-7) It's cold how his ass got smoked\nI don't drink no fucking V-S-O-P\nI drink a motherfucking O.G. Olde E\nI'm from the clique that be kicking the gangsta shit bitch\nReal niggas real G'z with real big dicks\nI hit em up with the Pound, so what you wanna throw up\nClaiming you're cocaine or cavi when you blow up\nKnow what, the Pound's in the motherfucking house\nBack again we try to get high as we can\nDr. Dre, be kicking fat rhymes and produce, and kick shit\nI gets more wicked than Beetlejuice\nMotherfuckers get battered, so scatter before I keep you\nHostage, a nigga hostile like the grim reaper\nSo, I'm coming from my hood, what hood\nYou really like to know, wouldn't you, I thought you knew\nMotherfucker don't you know I'm stranded on the Row\nI take a look into the crowd kick a style a flow\nI'm mashing, motherfuckers get murdered for asking\nRelax kid, you're rollin' with a fucking assassin\nI last did dirt the other day\nPortray, the role of a G, from the D-O double G\nP-O-U-N-D, Pound so bow bow motherfuckin' marks\nThe execution starts, when the Chronic is sparked\nI'm like Barkley, rough and rugged, but raw like Rawhead\nRex, I flex murderous rhymes to leave you all dead\nWhat's said is what's said, it's already spoke\nThe dead is the dead I ain't no fuckin' Joke\nI murder motherfuckers as a hobby\nOne of my idols Ain't No Joke, so why in the fuck should I be\nFly me, to the Bahamas, ruff rhymer, drama's\nWhat you're kicking, wicked is how I'm-a\nApproach you, the locster, who's quick to up and smoke you\nYou're looking like a smoker, grinning like the joker\nI yoke you from da back like a bitch talking shit\nCause a bitch ain't shit but a ho and trick, on my dick\nFlip, lets take a trip to the Dogg Pound\nFools tried to punk me when I was young, but I'm a hog now\nAnd I gets respect and I step with a Tec 9\nReady to put somethin' up in that ass so you respect mine\nFool, Death Row ain't Lynchin and the Pound ain't Mobbin\nWe all don't give a fuck, run in your crib and start robbing\nThrobbing, I'll break a nigga down in the 90's\nMaxing at the Pound wit my doggs is where you'll find me, beeotch\n\n[Outro: Dr. Dre]\nHeell yeaah\nYou niggas can't fade this shit, you know what I'm saying\nDeath Row's in the motherfuckin' house\nThe Dogg Pound's definitely in here, you knowhatI'msayin\nAnd ay yo yo yo yo yo, you niggas can't fUCK with this\nSo don't even try it\nStay in the studio all you want, stay in the studio all you want\nCause you can't fuck with this, see ya", "image": "https://images.genius.com/e67bb9a0f79870fa52758f302c7c15f9.640x571x1.jpg"}], "artist": "Dr. Dre"}