{"songs": [{"title": "What the Blood Clot (LP version)", "album": null, "year": null, "lyrics": "[Intro: RZA, (Method Man), {Y-Kim}]\nShit is bangin! You see what I'm sayin? Our shit is bangin!\n(Our shit is stainin, son) Yo, Shaolin runnin this shit, son!\nRunnin this shit! (Stainin) What's up, Y-Kim? 'Sup, nigga?\n{What's up, man? What's up?} What's up? Representin Brownsville\nKnow I'm sayin? Base, peace to all my Brownsville niggas!\n{The alcoholics son} What's goin on, son?\nPeace to all my Putnam Avenue motherfuckers! Bedford-stuy!\n(Yeah, peace to the valley goat..)\nPeace to my Wild Wild West Brighton niggas!\n\n(Big up The Bridge!)\n[Method Man]\nAll I hear is gun shots\nCan I touch somethin? What the Blood Clot!?!\nNigga want Tical, make it happen\nYou know my fuckin style, fuck the rappin!\nWe can take it back to eighty-five\nIf you wanna start actin like you live\nIt's all good, I'm rollin' with my click\nOwls, Backwoods and Phillies\nSmokin cess blunts, mixed with illy\nGot me flusted, now the whole world looks dusted\nI'm in the area with the skill that never rusted (What?)\nFor real, nigga, touch it and you burn\nWhen will motherfuckers learn?\nWhat be spreadin like a germ? Haha, it's Meth, word\nI be that early bird that got the worm and if you check it\nI'm on point, like a fax machine you get the message\nIt's be no question it's them, bust the second guessin's\nKeep your thoughts on your lessons\nWhat the Blood Clot!?!\nTo tell the truth, you don't amaze me\nKilla Hill Project, a Star Trek phaser couldn't phase me\nWhat? Check the Raider Ruckus, fuck this\nSmoke a Dutchmaster, have 'em screamin for the dutchess\nYeah, I gotta have it, so I strive to stack my papes\nIf I don't do it for mydelf, I'ma do it for Case\nCuz that's my peoples, we givin you injections that be Lethal\nWeapons, when niggas start the half steppin\nThen I get evil\nBut don't let that negative vibe right there mislead you\nI'm humble, a fuckin Killa Bee, far from bumble\nI sting you *BZZZT* and I bring you\nThirty-six Chambers of head banger, bitch\nWhy I deal with? I think the mic's on the fritz\nFaggot soundmen, they be sabotagin shit!\nLook up in the sky, it's a bird, it's a plane...\nMeth-Tical, let the whole world know my fuckin name\nWhat the Blood Clot!?!\n\n[Outro: Method Man, (RZA)]\nYeah, yeah, you know what I'm sayin? (Yeah, what? What!?!)\nFirst of all I'd like to give a big peace and shout out\nTo my brothers in the belly of the beast\nRaider Ruckus, y'all got my back and one love\n(Y'all niggas better start stackin)\nJune Lover, Shitty Brown (Y'all niggas better get real)\nPussin, Pil, P.L.O., Stack DAT, Dusty, Storm\n(All my real ass niggas get down, to all my niggas locked down)\nSUUU! We still in here, nigga\n(Y'all gotta party, locked down in the street, nigga)\nJamel, one love, nigga, Nice, Uncle Eric AKA Shane\n(You get your ass beat in the streets)\nI ain't forget you, nigga, Shakim, nuttin\nBig Sha, K. Fisk, Big Free from Cipher Heat\nFor all the fugitives on the run\nEverybody from Riker's Island to San Quintan\nAnd a big major shout out to my old dad who just got home\nOn work release, keep your heads up niggas\n\nOh my God (You what I'm sayin? Peace to the Gods)\nHere we go, here we go, here we go\n(You see that, nigga, fuckin Dirty Bastard?\nThat nigga is fuckin crazy!)", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}