{"songs": [{"title": "Higher", "album": "Kamikaze", "year": "2004-01-27", "lyrics": "[Intro: Twista] + (Ludacris)\nYeah, you know it's about to go down right?\n(Yeeah!) Got to let them know who is this? (Ludacris!)\nAnd who else nigga? (Twista, wooo, ahhh!)\nUh, uh (check it out)\n\n[Verse 1: Ludacris]\nSometimes I think that I got to see a little bit of brighter days\nCause I could find myself to a city near you in a solid cage\nAnd you could look to the left or the right but I'm trapped on center stage\nAnd I could rap to the beat, but I don't know how to change my ways\nI still hear a fool and I track them, distract them, and whack them\nJack a nigga for the day to days and I yak them, attack them, and sack them\nGet a weapon and I crack his brain cause I'm a hustler, baller, pro\nAnd it wouldn't be right for me to be around busters, and crawlers, and hoes\nBut I'm a pimp at night, so talk shit and I'm a lift them up off of they toes\nWith a street sweeper regulating quarters, and ki's, and o's\nIn a two-seater, Ludacris and Twista with bags of dro\nSmoking, choking, get them open, croaking\nIt's so potent - I'm hoping to keep on floating\nSoaking wet and you can bet, people I'm high\nI'm seeing lions, and tigers and bears - oh my!\nAnd I can't hide it or keep it hidden, good riddance I'm felling good\nI'm weapon-concealing, stealing my neighborhood\nWould, could, and should break a nigga off\nThey'll see you later, go to the doctor, hold my balls and (cough)\nYou caught the vapors and I caught the throne, brain blown, honey I'm home\nGive me the microphone, and fools is like, \"leave me alone!\"\n\n[Hook: Twista]\nThrow it up if you get high, get blow, get drunk\nIf you want what I'm on, come on and kick it\nLet's ride, smoke dro, beat the trunk\nAll the bad ass bitches that want to party\nJust shake it, great players get pumped\nMe and my thugs, and hustlers in the party\nGet money fuck hoes, get crunk\n\n[Verse 2: Twista]\n(Look out!) I put a little bit of hash on some motherfucking purple haze\nI feel it all in my body, adrenaline with the Bacaradi\nGot me all filthy, ripping shit in a rage\nIn navy blue platinum, he by the Belly, Gucci\nTimberland stepping on the petal up in the Cadillac truck\nWant to get me for the wood\nBetter get the whole motherfucking hood to come and give you some back up\nWe can get into it and if you want to do it\nI'm leaking the fluids out of the bodies that want to come at this\nEmpty out buckets of blood for fucking with thugs that'll bury\nMy adversaries better not want none of Twis'\nRepresent for my city, anybody that different with me\nGot to get him for thinking it's a game\nAnd whether you from my city or not, talk shit\nI'mma kill him especially if he say my name\nI've been up on him - I handle my business\nAnd I'm a stick him up for the scrilla, from K-Tilla, smoking on a fat piller\nMurder haters that don't feel a\nNiggas claiming they want to bring it, but really don't be killers\nBalling out so hard the size of my rims grow to a hellafied sight-scene\nWhen the dough become no bigger, I'ma flip or drop that 2000 on yo-- 19\n\n[Hook: Twista]\n\n[Verse 3: Twista]\nWhen balling out of control, I floss on, flame on, pimp on\nA speed deamon, pedal to the metal when I'm in the zone\nHang on cause here I'm gone\nIn the motherfucking wind when I'm sippin on Henn'\nI got cake, while you owe something\nAnd I done came a long way from letting me hold something, to roll something\nFind a victim and fill him wit venom\nAnd put some adrenaline in him, kill him, and send him to the cemetery\nWith a flow full of horror like a poltergeist\nHe called to Christ, when he saw how many men I buried\nShit, and when it come to chiefing good\nNigga who that? do that, I got the sack open\nAnd the herb got the flow so strong\nThat I might crack the track, go back to back smoking\nNever coming up when the Mob's in need\nNigga you ain't untouchable when I spark the heat\nComing at you like sharks to meat\n'Til blood start to leak, I can tell when a mark's heart is weak\nCome fully loaded cause I'm hard to beat\nAlways screaming where the drink and the dro at?\nYou know we love that cut up\nIn the back of the club with purple in the bag, chronic\nTwis' and Ludacris get fucked up\n\n[Hook: Twista]\n\n[Outro: Twista] + (Wildstyle)\nPass me the..\nLet me smoke my..\n(Yeeah, this a Wildstyle production\nTwista and Ludacris collabo, get it, get it\nGet it, uh, yeeah)", "image": "https://images.genius.com/43a8d8ea9e82ab31d5a8dc1392088c6a.1000x1000x1.jpg"}], "artist": "Twista"}