{"songs": [{"title": "Children’s Story", "album": "The Great Adventures of Slick Rick", "year": "1989-04-04", "lyrics": "[Produced by Slick Rick]\n\n(Now here's a little something that needs to be heard)\n\n[Intro]\nUncle Ricky, could you read us a bedtime story?\nPlease, huh, please?\nAll right, you kids get to bed, I'll get the storybook\nY'all tucked in? Yeah\nHere we go\n\n[Verse]\nOnce upon a time not long ago\nWhen people wore pajamas and lived life slow\nWhen laws were stern and justice stood\nAnd people were behavin' like they ought to: good\nThere lived a little boy who was misled\nBy another little boy and this is what he said:\n\"Me and you, tonight we're gonna make some cash\nRobbin' old folks and makin' the dash\"\nThey did the job, money came with ease\nBut one couldn't stop, it's like he had a disease\nHe robbed another and another and a sister and her brother\nTried to rob a man who was a D.T. undercover\nThe cop grabbed his arm, he started acting erratic\nHe said \"Keep still, boy, no need for static\"\nPunched him in his belly and he gave him a slap\nBut little did he know the little boy was strapped\nThe kid pulled out a gun, he said \"Why'd you hit me?\"\nThe barrel was set straight for the cop's kidney\nThe cop got scared, the kid, he starts to figure\n\"I'll do years if I pull this trigger\"\nSo he cold dashed and ran around the block\nCop radios in to another lady cop\nHe ran by a tree, there he saw this sister\nShot for the head, he shot back but he missed her\nLooked 'round good and from expectations\nSo he decided he'd head for the subway stations\nBut she was coming and he made a left\nHe was runnin' top speed 'til he was outta breath\nKnocked an old man down and swore he killed him\nThen he made his move to an abandoned building\nRan up the stairs up to the top floor\nOpened up the door there, guess who he saw? (who?)\nDave, the dope fiend shootin' dope\nWho don't know the meaning of water nor soap\nHe said \"I need bullets, hurry up, run!\"\nThe dope fiend brought back a spanking shotgun\nHe went outside but there was cops all over\nThen he dipped into a car ‒ a stolen Nova\nRaced up the block doing 83\nCrashed into a tree near university\nEscaped alive though the car was battered\nRat-a-tat-tatted and all the cops scattered\nRan out of bullets and he still had static\nGrabbed a pregnant lady and pulled out the automatic\nPointed at her head and he said the gun was full o' lead\nHe told the cops \"Back off or honey here's dead\"\nDeep in his heart he knew he was wrong\nSo he let the lady go and he starts to run on\nSirens sounded, he seemed astounded\nAnd before long the little boy got surrounded\nHe dropped his gun, so went the glory\nAnd this is the way I have to end this story\nHe was only seventeen, in a madman's dream\nThe cops shot the kid, I still hear him scream\nThis ain't funny so don't ya dare laugh\nJust another case about the wrong path\nStraight and narrow or yo' soul gets cast\nGood night\n\n[Outro]\n(Knock him out the box, Rick\nKnock him out, Rick)\n- Oh boy, that Uncle Ricky is really weird\n- I know right what does he mean\n“Straight and narrow or yo’ soul gets cast\"?\n- I don’t know, I think he be crackin' it up or something\n- Well, good night\n- Good night\n\nAnother (that's right!) Rick the Ruler presentation\nCrumbs!", "image": "https://images.genius.com/40c76d5a1e9b02ccc10cdfdf51bdbd95.300x300x1.jpg"}], "artist": "Slick Rick"}