{"songs": [{"title": "Y.O.U.", "album": null, "year": null, "lyrics": "[Meth]\nTraces of lipstick on my collar\nBaby you got to do some more to get this last dollar\nHotter than lava when you come believe that I'ma follow\nLady Medana liketo drink, but she don't like to swallow\nRockin' that Prada, Honey stay up in the beauty parlor\nGirl it would be my honour, make you my babymomma\nHoller she hella proper, fuck with tha dumbin' cousin\nSucka for lovin'-buggin', shockin' them duckin' buckin'\nSuckin' then finga-fuckin', then let me show you somethin'\nI'll knock the stuffin' off that English Muffin\nCan't tell me nuthin', uhn uhn\nPushin' yo' panty botton when I'm stuckin'\nAll of a sudden, baby gun-duckin', BBC! Oh girl you nasty\n[Redman]\nYo' I get it on poppin'\nDoc, unlockin' yo' doors, clockin' my drawers\nSuckin' your mouth with a torn stockin'\nRapped around and knockin' , I'm creepin' when you parkin'\nShoot out the lights, darken the area, then hop in\nPick up my bigga nigga who helped me figured the plottin'\nDroppin' the tops, splittin' the dough\nShoppin' in rotten--New York, first flockin'\nBecause I'm heavy like Bo stockin' coat\nWatch ya coat from Fo sparkin', they leave the parking\nNiggas unforgetable can be forgotten\nDoc and Meth entering the top ten!\nChoppin' it raw, lockin' 'n blockin'\nOnly raw choppin', it's metaphores, so cops can stop watchin'\nI put 'em in and cock 'em, ready to rock 'em stock 'em\nRenovate your appartment, when these two things barkin'\nMy Mackamichi knockin', bougie hoes be spottin' on they tampons\nI get 'em drippin' like Licky Falls\n\n[Chorus]: Redman, [Meth]\nNow who a bitch nigga?!\n[Now who a snitch nigga?!]\nNow who the shit nigga?!\n[Now who the sick nigga?!]\nNow who you with nigga?!\n[With who you with nigga?!]\nWho rock shit nigga?!\n[Who pop shit nigga?!]\n[Come on!] Come on! [Come on!] Come on!\n[Come on!] Come on! [Come on!] Come on!\n[Come on!] Come on! [Come on!] Come on!\n[Come on!] Come on! [Come on!] Come on!\n[Redman]\nI figured it out: ya'll niggas ain't as big as yo' mouth\nMy street-value well it ain't won't even fit in yo' couch\nWhen I bust titties come out\nNo matter what city hardcore committee's dumb to fuck out\nSon's ya duck out! Nuthin' to lose, poppin' a two up in ya goose\nBuckle yo shoes, cuffle my boots, fuckin' with you\nBlow my Anaconda like Nirvana\nMarijuana got bitches on they knees in they Gabbanas\nGettin' 'em dirty dirty with the hersey and the bombin'\nHolla the drama, fire two in ya armor\nYa pigeon betta call ma, the ice is a honor\nTwin help me lift her arm up, lebaba(?) with ya momma\nEven dirty her donna, my dick is heronomic\nPull out a young Geroni-mo, BBC! Oh girl you nasty\n[Meth]\nItchin' to start the mission, flippin' so keep yo' distance\nAin't go no pot to piss in? Ain't got no competition\nListen, I slip the clippin', trippin' you get me lippin'\nCome mis and catch a whippin', now kids is actin' different\nDitchin' them double-dippin', chickens that keep forgettin'\nI ain't the one for trickin', on anybody kickin'\nRippin' these compositions, scrippin' them paper-written\nHold 'em and hit 'n stickin', ballin' like Scottie Pippen\nIt's hot in Hell's Kitchen, but still I'm force spittin'\nShittin' like 'No he didn't', wipin' my ass and splittin'\nChattin' like Joe gettin'\nAll in the zone settin' it off like Big Daddy\nAnd ain't no half-steppin'...I keep reppin'\nStaten you keep sweatin', frontin' and ass-bettin'\nDuckin' my Smith & Wessum , trashin' the Meth and catchin'\nHell, we leave you restin' in PEACE, BBC! Oh girl you nasty\n\n[Chorus]", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}