{"songs": [{"title": "Loose Cannons", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "Intro: repeat 4X\n\n[Dr. Dre]\n\"Yo man, I don't think they heard you\nWon't ya tell em what your name is?\" -] Dr. Dre\n\"Daz, Kurupt..\"\n\n[Xzibit]\nAight everybody get on the ground RIGHT NOW\nYeah, this is not your money this is insured by the Federal Government\nSo this is not your money, don't move\nDon't be a hero, and you won't get BLOWN THE FUCK UP RIGHT NOW\nYeah, aight y'all we got three minutes\nStartin now let's keep it rollin\n\n[Dogg Pound]\nHit the bank from the back\nDouble the trouble, forcin my entry\nThe first nigga that I saw, shot him in the jaw\nXzibit started stompin him and so did we (GET DOWN BITCH)\nAww shit, about time we started dumpin on security\nHigh society -- takin what's mine\nSnatchin each purse after purse -- for every nickel and dime\nPremeditated created by the scorn and the hate\nBut I made ma, the big time, lights and the shine\nIt's a full scale war -- everybody bear arms\nWear body armor, national arms\nDip away to get away -- sirens alarms screamin\nYellin out, \"Hell demons of war\"\nHell hounds that surround the Wells Fargo browns\nNo tomorrow, hollow, harness rounds\n\nTake a sip of your Perrier\nTo pay, I'mma dump like a dumptruck, scramble to make my escape\nDat Nigga Daz, shootin so nothin else come in\nI'm shootin in the opposite direction, we closed in\nShells spread nigga -- because we can do the work\nFirst things first -- like Snoop, I'mma shoot the clerk\nAnd I did -- now it's time to split -- get nigga get\n(let's go) Dumpin and shoot the hostages\nSoopafly outside in the ride\nBout to start shootin everything that he see outside\n\n[Xzibit]\nLoose cannons, face covered with bandanas\nChrome pieces - motherFUCK the police\nIt's everybody killers on mine\nIf I ever get caught for crime, won't be doin federal time\nLoose cannons, face covered with bandanas\nChrome pieces - motherFUCK the police\nIt's everybody killers on mine\nIf I ever get caught for crime, won't be doin federal time", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}