{"songs": [{"title": "52 Bars", "album": "M.I.C. (Make it Count)", "year": "2004-10-26", "lyrics": "[Royce Da 5'9\"]\nYeah, yeah (5-9) yeah\nThis is Hip-Hop 101 niggas (yeah, the M.I.C. nigga)\nI'm bout to teach y'all MC's how to count bars\nCheck it out (real MC's)\nLet's get to it niggas\n\n[Hook]\n52 bars come out, now you feel it out\n52 bars come out, now you feel it again\n52 bars come out, now you feel it out\n52 bars\n\n[Royce da 5'9\"]\nYeah, yeah, yeah; I'm a beast (1)\nI'ma be leavin y'all sleep all in them trauma sheets (2)\nThe pall bearer the one, the two carrying you (3)\nTo who burying you on the count of three (4)\nI'm the llama to squeeze (5)\nI can promise my knowledge degrees has started a lot of beefing (6)\nThe gall of you to call to who all of you to pause (7)\nThe fall of your momma's cheeks (8)\nYeah, then drama cease, I'ma try to teach (9)\nYou could be deep and, wind up kinda deep, yeah (10)\nNo amount of sleep can, mold you into what you tryna be (11)\nCan only make a soldier outta me (12)\nI'm the eightball - sitting out of the way (13)\nOf you finishing the product is able to face all (14)\nI'ma just stay raw - instead of doin' songs for women (15)\nI'll let y'all do 'em and all come and take y'alls (16)\nThis is before the rhyme, it's the truth (17)\nAfter I put the \"out of order\" sign on the booth (18)\nYou can't stop me, I'm sticking Koch - you wishing (19)\nSony would just drop me like 50, yeah (20)\nYou sloppy, I will reign (21)\nI will change and, transform into 'Pac like Lil Zane (22)\nThis is lyrical nation this is Rap City (23)\nWhile you fiends get out-rapped by Tigga in Da Basement (24)\nThis tool I use on all of your peeps (25)\nI call it my heat, cause I use it when I lose my cool (26)\nIt's too risky (27)\nTook a line when who's sitting on the side of the new whip with a huge pistol (28)\nThe huge clip hanging outta the bottle (29)\nThe size of a bottomless pit (30)\nEvery goon, you gotta be hit, reduce the size of your clique (31)\nLike POOF, like I am a magician (32)\nI am a giant to you, trick (33)\nI'm sicker than you, I feel like a pool stick in a room full of toothpicks (34)\nDon't compare none of these rap wannabe (35)\nCats to me, the best fear me, the rest is scared money (36)\nNow that I'm back on the scene (37)\nIt's back to your baby mamas chasing me, I'm back on TV (38)\nYeah buddy - come get me cause we ain't scared (39)\nCatch a buck-fifty the size of Freeway's beard, yeah (40 nigga)\nAin't nobody vest preventing the 'K (41)\nFrom ripping through bricks and hitting the rest of your henchmen (42)\nNever been in the penitentiary, never get tense (43)\nWhen there's war, never worry about catching a sentence (44)\nI don't care if you strong especially since (45)\nMy weapon is long enough to bury you with whatever you benching (46)\nI ain't friendly - I don't talk (47)\nFor nobody who ain't cutting a check unless you a dentist (48)\nYou can never attempt to, diss me (49)\nIf you do, I will censor the lead of that pencil (50)\nYou punks better be distant (51)\nOne punch'll leave you lumped and, dumber than Jessica Simpson (52)\n\nWhooo, hahaha, yeah (yeah)\nIt's not often you hear an MC like this nigga (the M.I.C.!)\nTake a picture of it, write it down\nDo whatever you want I don't give a FUCK!\nYeah (haha) this what happens when\n\n[Hook]\n52 bars come out, now you feel 'em out\n52 bars come out, now you feel 'em again\n52 bars come out, now you feel 'em out\n52 bars nigga, yeah, yeah\n52 bars come out, now you feel 'em out\n52 bars come out, now you feel 'em again\n52 bars come out, now you feel 'em out\n52 bars..\n\n[Outro]\nHahaha, \"Death is Certain\" niggas (ho!)\n(Ho!) Asar, I told you\nVicious! I told you\nYeah, aight you sissy ass MC's\nTake notes {*laughing*}", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}