{"songs": [{"title": "Get Off the Stage", "album": "Get Off the Stage", "year": null, "lyrics": "[Too $hort]\nI'm tryin' to do a show, I don't even know\nMost of these niggas, I came with some hoes\nHell nah they don't know me, askin' is he with us\nBack in the day groupies was always bitches\nJust throw 'em all 'cause you can't warn 'em\nWhy you wanna be on stage with me? You ain't performin'\nI don't come to your job, tryin' to flip your burgers\nI can handle this crowd, I don't need your service\nYou wanna be my dancer, you must be trippin'\nIf you ain't got big titties, why you up here strippin'?\nYou better take that shit back where you came from\nThrow it up nigga... go 'head, bang on me\nJust get off the stage\n\n[Chorus]\nGet off the stage bitch...\nGet off the stage bitch...\nGet off the stage bitch...\nGet off the stage\n\n[Too $hort]\nYou wanna hug me, and take pictures\nTalkin' bout you love me, I like bitches\nYou jumpin' round like we rehearsed this\nWhen I called the girls to the stage you was the first bitch\nAll in my ear, askin' bout a after party\nI'm tryin' to do a show man, back up off me\nSecurity shouldn't even get paid\nI watched 'em push the ladies back and let these niggas on the stage\nThey'll tell you tomorrow, exactly how it happened\nThey was all on stage with me, while I was rappin'\nGave me women and weed, then we dipped to the pad\nBut all that really happened was they made me look bad\nGet off the stage bitch\n\n[Chorus]\nGet off the stage bitch...\nGet off the stage bitch...\nGet off the stage bitch...\nGet off the stage\n\n[Too $hort]\nWhen all the rappers come to town you wanna stand next to 'em\nWhat you swingin' on his nuts for man, what you doin'?\nGo back in the crowd, and stand with your homies\nI got niggas out there and damn you don't even know me\nAt first, you was just chillin' on the side\nNow you next to me, you must be feelin' alright\nI don't lip sing, everything I do is live\nYour name is Too $hort? Then motherfucker who am I?\nWhy you celebratin'? Raisin' both your arms\nYou gon' help later? You ain't makin' no songs\nYou ain't the manager, on the turntables\nYou don't dance for the group and you don't work for the label\nGet off the fuckin' stage bitch\n\n[Chorus]\nGet off the stage bitch...\nGet off the stage bitch...\nGet off the stage bitch...\nGet off the stage", "image": "https://images.genius.com/bf235bef3026a6f3ce0ab508ff5f91d3.500x500x1.jpg"}], "artist": "Too $hort"}