{"songs": [{"title": "Faithful (Live at the North Sea Jazz Festival, 2005)", "album": "Live at the Jazz Room", "year": "2005-07-10", "lyrics": "[Chorus]\n(Faithful to the end) Yeah, we got to be\n(Faithful to the end) Clap your hands y'all, I wanna be\n(Faithful to the end)\n(I'd like to be her very best friend)\nClap your hands, uh, yeah\n\n[Interlude]\nI wrote this song called \"Faithful\"\nAnd what it's about, it's about being faithful to the most high God\nCreator of all things\nSee, a lot of people ask me about who God is\nYou know, all I know is God created the Heavens and the earth\nAnd there's only one God\nSo, I wrote this song thinking about, 'What if God was a woman?\nHow would it be? How would we react? How would I react?'\nAnd this is my commitment and my letter to God\nAnd I want y'all to check it out and just listen\nUh, and just clap your hands and listen, check it\n\n[Verse 1]\nI was rollin' around, in my mind it occurred\nWhat if God was a her?\nWould I treat her the same? Would I still be runnin' game on her?\nIn what type of ways would I want her?\nWould I want her for her mind or her heavenly body?\nCouldn't be out gettin' bogus with someone so godly\nIf I was wit' her would I still be wantin' my ex?\nThe lies, the greed, the weed, the sex\nWouldn't be ashamed to give her part of my check\nWearin' her cross, I mean the heart on my neck\nHer, I would reflect on the streets of the Chi'\nRide wit' her, 'cause I know for me she'd die\nThrough good and bad call on her like I'm chirpin' her\nCouldn't be jealous, other brothers worship her\nWalk this earth for her, glory, I'm grateful\nTo be in her presence, yo, I gotta stay...\n\n[Chorus]\n(Faithful to the end) Clap your hands y'all, huh\n(Faithful to the end) Yeah, yo, we got to be\n(Faithful to the end) We stay faithful y'all, yes\n(I'd like to be her very best friend) God bless\n\nYo, let me tell y'all this story\n\n[Verse 2]\nHe worked with her, she was his lady's best friend\nEven if they don't try, ladies test men\nThis was a test that was bigger than him\nSome believe it's the nature that is given to men\nHad a good gig, a wife, a kid, a decent home\nOne reason or another couldn't find peace at home\nShe asked, \"Why do men always have to stray?\"\nHe said, \"I'm bad, not as bad as Eric Benet\"\n\"I used to take 'em out to eat, they weren't really eatin'\nMighta got a little head but I wasn't really cheatin'\"\nIt's hard when your lady don't believe what you say\nWhat you did in the past you live with today\nShe asked if they could spend the night together\nHe thought, and said, \"I'm tryin' to get my life together\"\nWent home to his lady, these were his confessions\n\"Baby, you a blessin' and my best friend\"\nWe gotta stay...\n\n[Chorus]\n(Faithful to the end) Go and clap your hands y'all, we got to be\n(Faithful to the end) Ah, I wanna stay\n(Faithful to the end) Yes, God bless\n(I'd like to be her very best friend) Yeah", "image": "https://images.genius.com/045767268a13a813bd7645f24fad7896.499x499x1.jpg"}], "artist": "Common"}