{"songs": [{"title": "Runaway", "album": "Born Sinner (Deluxe Version)", "year": "2013-06-18", "lyrics": "[Intro: Mike Epps (Sampled)]\nMarried men act totally different when they're by themselves, don't they? You see 'em with their wife, \"What's up Tony?\" \"Hey man, how's everything going brother? Oh, just taking it easy, hanging out with the old lady. Alright, God bless you, take it easy now, alright.\" You be like that nigga ain't like that\nYou see him by himself, \"What's up Tony?\" \"Hey, where's the bitches at, nigga?! Where's the bitches?!\"\n\n[Verse 1]\nYeah\nGimme my space, Lord, ain't enough time to chase\nAll these dreams, nah mean? I got no time to wait\nLove my girl, but I told her straight up, \"Don't wait up\"\nStumble home late, I'm drunk, we fucked and made up\nUsed to living free as a bird, but now I'm laid up\nFeelin' like a nigga got handcuffs on\nHow the fuck did my life become a damn love song?\nShe ride for a nigga and she stand up for him\nBut a nigga wan' be a nigga, be a nigga\nRide through the streets with freaks and real niggas\nShe'll never understand what it's like to be a man\nKnowin' when you look inside yourself you see a nigga\nAnd you don't wan' let her down\nBut you too young for the settle down\nAnd maybe you can thug it out, learn what is love about\nWhen you can't live with her and you can't live without\nAw shit, goddamn, I think the devil got his hands on me\nStripper saying, \"Baby, won't you throw them bands on me?\"\nAnd I came to spend\nShe pop a molly, let the motherfuckin' games begin\nI'm running away\n\n[Chorus]\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nDesperately\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\n\n[Verse 2]\nWhen it's all said and done everybody dies\nIn this life ain't no happy endings\nOnly pure beginnings followed by years of sinning and fake repentance\nThe preacher say we were made in image of Lord\nTo which I replied: \"Are you sure?\nEven a murderer? Even a whore?\nEven a nigga running through bitches on tour\nWith a good girl at home folding clothes and shit?\"\nShe losin' faith in him and he knows the shit, like, \"What the fuck is a break?\nDon't know how much I can take no more\nI give you all I got 'til it ain't no more\nNo more tears, it's been ten long years\nDamn near, I don't know if I can wait no more\"\nAnd who can blame her, you complain about\nEvery time you out, you come back she poutin'\nSleeping back to back, this is whack, we 'bout\nTo go platinum and I'm in the crib acting out\nMy childhood fantasies of wife and home\nBut it's a whole lot of actresses I'd like to bone\nAnd despite the rumors you hold out\nOn account of your guilt and she has got to spend her nights alone\nAnd she ride or die like Eve and 'em\nMake home-cooked meals every evenin'\nAnd even in your lowest days\nWhen you're no longer Superman, at least you know you got Lois Lane\nBut you\n\n[Chorus]\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nDesperately\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\n\n[Verse 3]\nYeah\nUnbelievable, seen evil that not even Knievel know\nAt age three I knew this world was three below\nListen, even though my ego low, achieved the unachievable\nImagine if my confidence was halfway decent yo\nThis just in, fucked more bitches than Bieber though\nStill I keep it low, got my niggas on the need to know\nBasis, my manager back in the days was racist\nI was a young boy, passing skates and tucking laces\nOld perverted white man who told me, \"Jermaine\nIt's all pink on the inside, fuck what color they face is\"\nWise words from an indecent man\nMade me reflect on the times when we was three-fifths of them\nIn chains and powerless, brave souls reduced to cowardice\nSlaving in the baking sun for hours just\nTo see the master creep into the shack where your lady at\nNine months later got a baby, that's\nNot quite what you expected, but you\nRefuse to neglect it, 'cause you\nKnow your wifey loves you, thus you refuse to accept it\nThat’s the type of shit that turned my granny light-skinned\nRich white men rule the nation still\nOnly difference is we all slaves now, the chains concealed\nIn our thoughts, if I follow my heart to save myself\nCould I run away from fifty-mill like Dave Chappelle?\nYou know\n\n[Chorus]\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on\nDesperately\nRunaway, runaway\nRunaway, runaway\nI'm holdin' on", "image": "https://images.genius.com/fbfa7c8b3518f456c489c0bc1cf3ffd5.1000x1000x1.jpg"}], "artist": "J. Cole"}