{"songs": [{"title": "No Coming Back From That", "album": null, "year": null, "lyrics": "Nigga I will rap a circle 'round, a circle 'round you\nI navigate with wizardry throughout the Earth around you. (Earth around you)\nShout-out to Drake, No bitch could be the \"Best I Ever Had\" (Ever had)\nMy candy cane dick and mint balls, but she ain't suckin' if her breath is bad!\nSufferin' Succotash right now I'm bubbling fuck a past\nGoogle me hoochie groupie, watch what I come up as (come up as)\nI'm the man in this bitch, so bide the man in this bitch\nNow bitches want my attention like the Canibus diss\nYou ain't got no mechanical mandible quit handling dick\nWe liked you before the army now we ain't a fan of your shit\nYou know my MAC pop, Detroit is my backdrop\nNow shut your ass up and go have some sex with your laptop\nHa, You too nerdy I'm too scurvy\nOne gun pointed at your head, my silhouette lookin' like two-thirty\nThe only thing in this life I can't fight is violence\nBar Exam 3 dropping same night the fight is\nYou sleeping I'll take a knife and aim right for your eyelids, (SLAUGHTERHOUSE!)\nRight, I got an insane cypher\nAnd if you step in my lane claiming you way nicer\nI'ma be wiping your brains off of my Range wipers\nI will handle you, the .357 got handled dude\nThe barrel stick out longer than the handle do\nI'll shoot you, your crew\nAnd the cops riding with you\nI got issues They call me shot five nickel\nEquivalent to the psychical lock by a pitbull\nTo whip me is impossible, rock a pinnacle drinking\nThe opposite of subliminal thinking, Compared to y'all I'm a don, a criminal kingpin\nI see why these niggas wanna run\nWhen I invite them to the loneliest place in the world one on one\nAnd tell your mama I'm a baller\nMatter fact tell your mama I'ma call her\nHurricane flowing like water, I'm grounded like Katrina\nI sound like I fell in on New Orleans allow me to go\nDionne Warwick (Warwick!)\nAnd make a prediction for the future drama, I'm for it\nYou dissed melodic artists; I bring all of my private parts to your\nPrivate party and stick 'em inside your daughter\nPsychotic aura, the hat on my head is not a fedora\nThe reason why your wifey's bottom is sorer (sorer)\nBenzino the hardest nigga? You know don't know him for hammers\nYou know him for talking shit with N.O.R.E. behind the cameras\nI blam at ya', I damage ya, Wait, Did I just say blam at ya and damage ya?\nFuck it! These niggas amateurs (amateurs)\nI handle toasters, I'm feeling like my Grammy closer\nAnd your bitch can feel a pin like Emani Poster\nWalkin' around with handheld ovens\nThat ring! And change your color like Sammy Sosa\nI'm sick of man who grosser\nI spit it from the stomach with a ulcer and if you want it, you can come in closer\nAnd experience the taste of a knuckle sandwich\nWaste your father, waste you mother, fuck your parents\nPlay with me you know you playing on All-Madden\nYou all that until your potato get au gratin\nYou all phoney Tony Montana 'til I stick you\nIn the dirt and call you Earth tone like fall fashion\nHaha! Pardon, I had to laugh at that one\nUsually I laugh at rappers\nWrap both of my hands around they adam's apples and squeeze\nUntil they see the light inside the tabernacle, No coming back from that one!\n\n[Outro:Woman]\nYou know Royce gon' kill all of y'all niggas, right?\nThat nigga's crazy!", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}