{"songs": [{"title": "Let the Rhythm Hit ’Em", "album": "Let the Rhythm Hit ’Em", "year": "1990-05-22", "lyrics": "[Verse 1]\nI'm the arsenal, I got artillery, lyrics are ammo\nRounds of rhythm, then I'ma give 'em piano\nBring a bullet-proof vest, nothin' to ricochet\nReady, aim at the brain, now what the trigger say\nTempos trifle, felt like a rifle\nMassage and melodies might go right through\nSimultaneously like an Uzi, nothin' can bruise me\nLyrics let up, when lady say don't lose me\nSo reload quickly, and you better hit me\nWhile I'm lettin' this fifi get with me\nYou steppin' with double oh seven, better make it snappy\nNo time to do your hair baby, brothers are bustin' at me\nBeats and bullets pass me, none on target\nThey want the R hit, but watch the God get\nQuicker, the tongue is the trigger, 'cause I'm real fast\nLet off some rhythm at 'em, let 'em feel the blast\nPenetrate at a crazy rate, this ain't no .38\nHit 'em at point blank range, and watch 'em radiate\nRunnin' out of ammunition, I'm done with 'em\nYou ask me how I did 'em? I let the rhythm hit 'em\n\n[Hook]\nLet it hit 'em\n\n[Verse 2]\nI push a power that's punishin' , prepare to be a prisoner\nThe hit man is the, brother with charisma\nShowing you that I have, powerful paragraphs\nFollowers become leaders, but without a path\nYa mentally paralyzed, crippled ya third eye\nRhymes are blurred, then it occurred that you heard I\nReduced the friction, with crucifixion\nLet loose the mix then, boost the piston\nEric, hit 'em with some of that cut like a lumberjack\nAnd me gettin' hit back, it won't be none of that\nI'm untouchable, you see me in 3D\nWhen I let the rhythm hit another emcee\nLyrics made of lead, enters your head\nThen eruption of a mass production will spread\nWhen music is louder, full of gunpowder\nMicrophone machinery, when I see a crowd of\nParty people, pumpin' their fist like this\nYa hide in the back, thinkin' that I might miss\nBut the R is accurate, plus I'm packed up with\nEducated punch lines that I have to hit\nWhatever I aim at, I line 'em up\nYa body is weak, feel with pain, that time is up\nYou been hit with somethin' different, isn't it?\nRakim is gonna radiate, nothing's equivalent\nNothin' can harm me, why tryin' bar me?\nYou couldn't fuck around the Ra with an army\nYou'll get wrecked by the architect, so respect him\nI disconnect 'em, soon as I inject 'em, with radiation\nPut 'em by the basement, bust his chest open\nBash his face in, let it split him\nSince he brought his main man with him\nHe ask me how I did 'em? I let the rhythm hit 'em\n\n[Hook]\nLet it hit 'em\n\n[Verse 3]\nDance floor's dangerous, packed in like a briefcase\nRhythm with real rough rhyme, beats with deep bass\nGirls with tight pants, maybe they might dance\nTonight if the R's on the mic, there's a slight chance\nThe crowd is crucial, MC's grounds are neutral\nNow that you're here, let me introduce you\nGet ready, I'm hard to read like graffiti\nBut steady, science I drop is real heavy\nRadiant energy, that'll be the penalty\nTouch the third rail, on the pain of remedy\nThe prescription's one every hour, now it's a habit\nYa need another hit from the freestyle fanatic\nAttention: follow directions, real close\nKeep out of reach of children, beware of overdose\nToo many milligram, no one made an iller jam\nMy rhyme is the rhythm of thoughts that kill a man\nIdeas for the ear to fear, might split him\nHe'll never forget 'em, he'll rest in peace with 'em\nAt least when he left, he'll know what hit him\nThe last breath of the words of death, was the rhythm\n\n[Hook x4]\nLet it hit 'em\n\n[Verse 4]\nNow throw you hands in the air and yo, go\nRakim will do the rest of this slow\nIf I speed they know, they;ll blow the hell up\nIf I slow up they'll catch up, hell no\nWicked as I kicked it, don't need to remix it\n'Cause I prefixed it, reversed and switched it\nTo perform to perfection, section for section\nRhymes keep connectin', ya guessin' what's next and\nBlood pressure rises, ya damn near lost it\nYa hit the ground burnin', and woke up frostbit\n'Cause when I explained, ya can't complain for pain\nTravel through the brain, hit a vein, then remain\nLet it radiate, vibes will vibrate, why did you violate?\nNow I'ma have to let the style break\nMoans now, the tone is ingrown\nAfter this gets thrown, gimme another microphone\nBefore I get that, fifi I met\nWhisper \"I wanna reach her intellect\"\nKiss her, 'cause I wanna give her the most respect\nSo I shine and let my light reflect\nHold her, mold her, make her feel older\nLay her on my shoulder, everything I told her\nMakes her feel secure, whenever I'm with her\nAnd you know how I did her, me and the rhythm hit her", "image": "https://images.genius.com/69bd74c592f3a0186cfafbe10f2c44da.599x592x1.jpg"}], "artist": "Eric B. & Rakim"}