{"songs": [{"title": "Nation Riders Anthem", "album": "You Nasty", "year": null, "lyrics": "I touch down in Atlanta with the dangerous crew\nGrab the microphone, spit this game at you\nIt never ends, I just keep goin'\nPimps keep pimpin', Hoez keep ho-in'\nAnd niggas like me, never stop hustlin'\nPut yo' mind to it, makin' money ain't nothin'\nI flip the script, came with this nation-wide shit\nAll I get is love, so thats all you gonna get\nOut here, niggas come from everywhere\nTrynna relocate, trynna become playaz\nTryin' to survive the game you know it ain't easy\nThat's why they roll with the homeboy sheezy\nI got about a quarter-million hardcore troops\nWe got niggas in yo' town too\nSo if it ain't you I hope you gots no problem\nCause we might have ta solve 'em\n\nFrom city to city, we got your back\nAin't nothin but pimps and G'z, we ride like that\nKeepin' the top drop, maintainin' that bump in yo' trunk\nAffiliated with us so you know it's gon' bump\nWe nation riders, we lead the resident\nVerbal assasinators, and dog is the president\nFirst round draft picks from all over the world\nGet ready to lock and load, and let the drama unfold\n\nNiggas always tryin' ta slip me demos\nBackstage chillin, gettin' in the limo\nBut i dun' click up with these nation wide niggas\nYou ain't already bumpin' and you can't ride wid us\nNatural born killaz, boys in the hood can ya fil' us?\nWe make the noise sound good, This ain't a game\nWe ain't trippin' dummy, we nation wide man, we just gettin' money\nBasin' A-T-L, we got tapes for sale\nAnd if you real G'z, we got CD's\nHouse hip hop, booty shake, west coast\nWe the kinda niggas make ya loose your best ho\nWhere she at? They got her on the tour bus, way in the back\nFuck ya to a (???), We nation riders, stand beside us\nWe big niggas and you don't wanna fight us\n\nWe nation riders, to the galaxy and beyond\nWe makin music fo' yo' ass, from dusk to dawn\nCall up me the for realist so umm if you were real niggas\nThen we gon' beelwitchyas, smoke out and make a meal whitchyas\nWe nation riders, we lead the resident\nVerbal assasinators, and dog is the president\nFirst round draft picks from all over the world\nGet ready to lock and load, and let the drama unfold\n\nRecord all your raps and beats at the studio\nCause if you ain't really got a cool flow\nTry ta get on stage and can't do a show\nI'mma be laughin at ya talkin' bout 'there you go'\nBut if ya rap tight you still might not be right\nIf we get into some shit and you scared to fight\nSome sucker talkin' bout what you wanna do?\nFrom the head, from the hips, ain't no punks in my crew\nWe used to free-style, at M-C Breeze' house\nSame niggas on the mic that make ya bleed now\nWhat? Motherfucker can you hear this shit?\nHe only got one fear, don't be near his bitch\nHe never be rich, you ain't ready for the show biz\nYou need to marry that girl and have four kids\nTheres no way you can hang with us\nCause niggas like us are too dangerous\n\nWe nation riders, we've been blessed with this game\nWe practice what we preach when it comes to breakin' hoez, man\nWe do whatever we want to, you talk about what you wish\nYou ain't a fuckin' (???), You be hated for that bitch\nWe nation riders, we lead the resident\nVerbal assasinators, and dog is the president\nFirst round draft picks from all over the world\nGet ready to lock and load, and let the drama unfold", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}