{"songs": [{"title": "God Bless The Dead", "album": "Greatest Hits", "year": "1998-11-24", "lyrics": "[Intro: 2Pac]\nRest in peace to my motherfucker Biggy Smallz\nThat's right, bwoy, it's goin' on, right here\nThug Life, God bless the dead\n\n[Verse 1: 2Pac]\nGod bless the dead and buried, nigga, don't worry\nIf you see God first, tell him shit got worse\nI ain't mad, I know you representin' the crew\nAnd I can picture you in heaven with a blunt and a brew\nFuck the world, pain was a part of the game\nIf you a baller, money went as quick as it came\nMy role models gone or they locked in the pen\nStraight hustlers caught up in the whirlwind\nThe other day I thought I seen my homeboy Biggy\nSayin' shit don't stop, nigga, no pity\nWe all hoods and all we ever had was dreams\nMoney makin' motherfuckers plot scandalous schemes\nIn the gutter you learn to have a criminal mind\nI was addicted to tryin', never meant to do time\nMy epitaph will read \"was the last of G's\"\nKicked the shit to make the white man bleed\nGod bless the dead\n\n[Hook: 2Pac]\nGod bless the dead\nGod bless the dead\nGod bless the dead\nGod bless the dead\n\n[Verse 2: 2Pac]\nMan, ain't nobody promised me a thang\nI been caught up in this game\nEver since I was a little motherfucker wantin' to hang\nI can see 'em in my head – pow!\nMemories of my nigga but he dead now\nLookin' back in my yearbook\nAll the years took half my peers, they're stretched for years\nAnd if I die, will they all shed tears?\nTwo to the dome, leave me alone, let me get my head clear\nParanoia got me lookin' in the mirror\nBehind me, life without my 9, I'd rather do the time\nSee, I'm old enough to know that ain't no justice\n[Fuck the police] and all the courts same way they fucked us\nAnd why the hell am I locked in jail?\nThey let them white boys free, we be shocked as hell\nIn my mind I can see it comin'\nAnd all the time it's a plot to keep a nigga runnin'\nI keep a gun and never run unless I'm comin' at ya\nCry later but for now let's enjoy the laughter\nGod bless the dead\n\n[Hook: 2Pac]\nGod bless the dead\nGod bless the dead\nGod bless the dead\nGod bless the dead\n\n[Interlude: 2Pac + Stretch]\nRest in peace to all the motherfuckers that passed too early\nAll the young motherfuckers that was took in they prime\nReal motherfuckin' G's, this one is for you\nYo Stretch, Biggy\nYo Big, this is to you, my nigga\nSpringfield Hollis Crew, Thug Life, YG'z\nSendin' they respect, ya know what I mean?\nYou my nigga for life, forever\nYou're always gonna be with a nigga\nNo matter what, don't forget that!\n\n[Verse 3: Stretch]\nI pray before I go to sleep, \"Dear God!\"\nSay my grace before I start to eat, 'cause times is hard\nSo I'm droppin' to my knees, \"Oh why!\"\nWhy you had to take my nigga with the rock-a-bye?\nYou had to take a good one, a ghetto hood son, Uzi weighin' a ton\nNiggas terrified of drama from the young gun\nHearin' that they did it outta fear don't amaze me\nBut it's mind-blowin' so I'm flowin' goin' crazy\nSlipped, forgot the gun, but he didn't run like a punk\nHe shoulda had the gauge in the trunk\nBut spunk is what he had, kid, I'd rather attack Big\nNow you 'bout to smell the aftermath of what the mag did\nWannabe suckas wanna test, I'm tellin' you, yes\nThe teflon's 'bout to rip through your fuckin' vest\nGuess who? I'll make a mess of your crew quick\nThe spirit Biggy Smallz and the thuggin' clique, yeah\n\n[Hook: Stretch]\nGod bless the dead\nGod bless the dead\nGod bless the dead\nGod bless the dead", "image": "https://images.genius.com/cc1dafe23e698c15ff046d768f3fc331.1000x1000x1.jpg"}], "artist": "2Pac"}