{"songs": [{"title": "Roman’s Revenge (Busta Rhymes Remix)", "album": null, "year": null, "lyrics": "[Intro: Sample courtesy of \"Scenario\" by A Tribe Called Quest & Leaders Of The New School]\nAs I combine all the juice from the mind\nHeel up, wheel up, bring it back, come rewind\nRRRRRROAW RRRRRRROAW like a dungeon dragon\nLike a dungeon dragon, like a dungeon dragon\n\n[Busta Rhymes]\nThe streets been telling me to get on the remix right?!\nHeh heh ha ha ha ha ha ha! Let's get it!\n\n[Verse One: Nicki Minaj]\nI am not Jasmine, I am Aladdin\nSo far ahead, these bums is lagging\nSee me in that new thing, bums is gagging\nI'm starting to feel like a dungeon dragon\nRah, rah, like a dungeon dragon\nI'm starting to feel like a dungeon dragon\nLook at my show footage how these girls be spazzing\nSo fuck I look like getting back to a has-been?\nYeah I said it, has-been\nHang it up, flat screen\nHa ha... plasma\n\"Hey Nicki, hey Nicki!\" Asthma\nI got the pumps, it ain't got medicine\nI got bars - sentencing\nI'm a bad bitch, I'm a cunt\nAnd I'll kick that ho - punt!\nForced trauma - blunt\nYou play the back, bitch I'm in the front\nYou need a job, this ain't cutting it\nNicki Minaj, is who you ain't fucking with\nYou lil' fraggle rock, beat you with a pad lock\nI am a movie, camera block\nYou out of work, I know it's tough\n... But enough is enough\n\n[Hook: Nicki Minaj]\nRahhh rahhh, like a dungeon dragon\nRa-rahhh rahhh, like a dungeon dragon\nRa-rahhh rahhh, like a dungeon dragon\nLike a dungeon dragon, like a dungeon dragon\nRa-rahhh rahhh, like a dungeon dragon\nRa-rahhh rahhh, like a dungeon dragon\nRa-rahhh rahhh, like a dungeon dragon\nLike a dungeon dragon, like a dungeon dragon\n\n[Busta Rhymes - over Hook]\nAiyyo somebody go get a theromostat and check my temperature\nI feel like a got a fever in this muh'fucker!!!!\nHa ha ha ha ha ha ha ha!!!\n\n[Verse Two: Busta Rhymes]\nNicki!!! How you gon' take my hot line and make it a hot song\nLike I ain't 'posed to come and step on this shit like King Kong!!!\nSee as a child I was born with a old soul\nSee I would breathe heavy flame would shoot out of my nose hole\nHAAAAAAAA RRRAAHHHHHH!!! Too much shitty diapers\nLove to play with matches and drink all the fluid out of lighters\nFrom when I was a child I know that most of y'all was triddash\nI dig in my nose and wipe the biggest BOOGER on your bitch asssssss!!!!\nUsing your head like fuck what the Lord said\nSlightly demented with a permanent wrinkle in my forehead\nBoar's Head beef bitch if you want it then peep lane\nMurder niggas with the fire then bounce to a Heat game\nTie you up like bikes to a rail in with a little cheap chain\nAnd I'll comfortably hang you from the side of the building\nSo niggas see your bitch ass is LAAAAAAAAAMMMMMMMMMMEEEE!!!!\n\"Aiyyo what you cut it off for? Don't you see what I'm doin to this?!\"\n'Posed to know how I'm directing these flicks\nThe question everywhere is \"you getting on the remix?\" (DAMN RIGHT!!!)\nCause this is something that I fathered and mastered\nAnd plastered 'til they started calling me sick bastard\nI'm drastic when it comes to reminding niggas who's responsible for the classics\nAnd I burn a hole in the street like a nigga was acid\nEverytime I jump on the beat see the shit will get drastic\nWhile you getting yo' ass kicked\nLike a kick and a punch slap and two chops\nKinda like pong ping baduf baf beat him until he diggity 2Pac\nMi broke mi ting leave a few match\nRope him and then drag him a few blocks (HORRIBLE)\nUh! Uh! Uh! The muscle of the street (MOVE BITCH)\nPardon me UH! Shuffling the beat nigga!!!\nUH! Take a elbow, I'm scuffling to eat\nLike a nigga that was grinding and was hustling for weeks\nSo I rushed and rushed, then I blacked\nThen I came through and I gave the streets crack\nControlling the functions throughout the steer\nEVERYBODY PUT YOUR MOTHERFUCKING HANDS IN THE AIR!!! (That's how I do 'em)\nI do the type of shit that niggas can't imagine (Uh Huh!)\nYou know I'm one of the nicest and I ain't bragging (Uh Huh!)\nI make 'em all surrender 'til they see white flags\nAnd they recognize I'm the original dungeon dragon (OK!)\nRRRRRROAW RRRRRRROAW like a dungeon dragon\nChange your shitty drawers cause your pants are sagging\nTry to step to this and I'll twist you to a turban\nAnd have you smelling rank like some old stale urine\nGONE!!!!\n\n[Hook]", "image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg"}], "artist": "Nicki Minaj"}