{"songs": [{"title": "Buried Alive (Commentary Version)", "album": "Under Pressure (Commentary Version)", "year": null, "lyrics": "\"Buried Alive.\" Um, \"Buried Alive\" to me is, once again, the story of the duality of man. You know, um, the conflict and internal struggle that we face. You know, that first thing you hear, \"Tell me how you feel,\" uh, I take that as the instrumentation, almost as a therapist. Telli- saying, \"Tell me. How- how do you feel?\" You know, the one thing I can talk to for hours and hours, days on days. Um, and know that it'll never stop listening to me, um, and if anything, it- it constantly wants more. Uh, you can- you can definitely hear my- uh, OutKast inspiration- uh, in this song, as well as the- the rest of the album, but it all really started on here. Um, you know, my fun- the \"You, you’s,\" and the \"Yeah, yeah, aw yeah.\" All that stuff kinda in the hooks that give it that Logic sound, um...\n\nUh, but yeah, the AT-aliens, I call it the \"three stack\" where it kinda sounds like an alien, you know what I mean? Like uh, the angel on one shoulder, and the devil on the other and just... going back and forth and, that- that little voice in your mind telling you that you can't. When you believe and you have all the courage, uh, and truly feel like you can do it, you can make it and whatever you want. Whether it's school, you know, your profession, your career, your hobby, your this, your that, you can do it. But there’s always that voice sayin', \"No, no you can't.\" And that's who I'm fighting with\n\nUm, at the time, you know, I was very- I was like, \"Aw man, you know, how come- how come this rapper has a cosign from him?\" or \"How come this-that?\" or \"They get this\" or \"They get that.\" Like, \"But I can tour the world!\" You know, I think it came from, not the typical mad rapper, but just a place of anger. Like, \"I have fans all over the world, I can tour all over the world, I don't understand.\" And realizing like, \"Hey, the grass isn't always greener. I'm sure there’s a lot of those rappers with the big cosigns or the names here, this or that, but they can’t do the numbers.\" They can- their like, \"Why can't I tour like, you know, like a Logic.\" Or \"Why can’t I?\" this, \"How come my fanbase isn't-\" You know, so the grass truly isn't always green on the other side, however I feel as though, you know, the more famous, and more Logic is known, less and less and less people know Bobby. Know me for who I am, and it's almost as though the more famous I guess you can say that I get, it’s as though Logic is burying Bobby alive. So how could the grass not be greener if I'm six feet under the dirt? And that's, that's what \"Buried Alive\" is about", "image": "https://images.genius.com/5ba79e87d2e7e865cbf9187de5396056.1000x1000x1.jpg"}], "artist": "Logic"}