{"songs": [{"title": "I Got Mine", "album": null, "year": "2018-11-26", "lyrics": "[Intro]\nAye\nI've been gettin' it in from the first date\nI've been gettin' it in from the first date\nI be gettin' it in from the first date\nWhat ya girl say?\nI've been gettin' it in from the first date (yeah yeah)\nAnd I've been goin' in from the first date (eskeddit)\nWheezy Beatz\nI do it for my people, yeah for crying sake\nFour bombs baby!\n\n[Verse 1]\nTwist your fingers up, throw your set, aye\nNew double R, make her break her neck, aye (skrt skrt)\n6 star, G star, V-neck, aye (aye)\nForeign car, door ajar, we the best, aye\nJust was broke, I'm riding with the stars on the next day (aye)\nYeah, Imma do my best on the test, aye\nFuck Donald Trump, I'm riding with the esé (fuck 'em)\nCan't take a rich nigga, so she messy (fool)\nYeah, Imma pop a bar with the best, aye (raahhh)\nGot a bitch a car on the next day (aye)\nAnd she need insurance like she lost it (aye)\nPenny loafers light brown like a pancake (aye)\nAye watch it baby, watch it, what my mans say (yeah, yeah)\nShe triflin', she triflin', my mans say (way, aye)\nAin't hard to deal with, gotta accept your apology (yeah yeah)\nTake a look inside my safe, it's a lot of lakes (yeah)\nYou can't judge a cover, no, what you heard of? (nah)\nI can't love these hoes, they fighting bout a burger (bitch!)\nYou can't cover nothing that you ever heard of (aye)\nMixing purple with the green like a turtle (lean! lean!)\n\n[Bridge]\nBitch I'm doing it for my babies (babies)\nBitch I'm doing it for my lady (lady)\nBitch I'm doing it for my mama 'nem (mama)\nBitch I'm doing it for my father 'nem (hey!)\nBitch I'm doing it for my whole fam (whole fam)\nBitch I'm doing it for my fuckin' fans (fuckin' fans)\nBitch I'm doing it bout these fuckin' bands (big ol' racks)\nI said bitch I'm doing it for these fuckin' bands (big racks!)\nAye (yeah)\n\n[Interlude]\nYeah\nAye man, I'm literally in the booth rappin' with...\nWith money in my muhfuckin' hand\nI love the feeling you know what I'm sayin'? (uhh)\nIt give me chills, ya digg?\nAye\n\n[Verse 2]\nI heard love don't last forever\nBut Imma change that like Aquafina change weather\nAnd Imma bang that, I'm bangin' with that damn Beretta\nAnd I'mma bang that, I'm doing anything about that cheddar, yeah (bang bang)\nOn the real, I allow whatever\nSaid Imma bang that, I'm bangin' bout that mozzarella\nImma bang it, I'm bangin' it to show you better (bang bang)\nImma bang it, I'm bangin' like I'm not a rapper, aye (bang bang)\n\n[Chorus]\nFor real, I got mines (I got mines)\nAye, I could care what you do with yours as long as I got mine\n(As I got mine, yeah)\nYeah, I'm ready to kill and die and cry and lie about mines\n(Lie about mines)\nYeah, I mean I said wrong is right, and right is right, I got mines\n(Always right, I got mines)\nAye (Uhh!)", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}