{"songs": [{"title": "Stepped On My J’z", "album": "Brass Knuckles", "year": "2008-07-01", "lyrics": "[Intro: Jermaine Dupri]\nUhh... (ooooooh)\nUhh, ha ha (uh, uh, listen)\nY'all know what this is! (let's go)\n\n[Verse 1: Nelly (Jermaine Dupri)]\nWe used to ditch school and head straight up to the mall (mall)\nJust so we could be the first ones with 'em on (c'mon)\nReturned to school by lunchtime like, \"Nigga, what now?\"\nAnd today we in the club like, \"Nigga, what now?\"\nYou better look down 'cause uhh, I know you see 'em (say what?)\nI know you see 'em (say what?) I know you see 'em\nI paid a thousand for the jeans, I paid 200 for the shoes\nAnd uhh, fuck a shirt, I'mma rock these tattoos (and uh)\nYou see my fitted man, I represent the crib\n'Cause even at the crib, I represent the crib\nI, might pop my grill in - and I, might let my chain hang\nAnd I, might wrap my wrist dang (go on, derrty, do the damn thang)\nI get 'em free (say what) but I pay\nAnd if I want I rock a different year of J's every day (uhh)\nA different style, different color is a must\nBut uhh, it's all good until I get my first scuff and I'm like\n\n[Hook: Nelly (Jermaine Dupri)]\nHell naw, ain't no way (what's wrong?)\nMan, he done stepped on my J's (what?)\nStepped on my J's, he done stepped on my J's\nThese just came out! He done stepped on my J's (uhh)\nHell naw, ain't no way (what's wrong?)\nMan, he done stepped on my J's (what?)\nStepped on my J's, he done stepped on my J's\nI can't believe this shit! He done stepped on my J's\n\n[Verse 2: Jermaine Dupri]\nUhh, I-I-I got 'em all (got 'em all) but they don't get no run\nLike them 13's, 7's, number fo' and the 1's\nI like, how they look with Dickies, how do Levi lay on 'em?\nIf you ain't got 'em when you see me you definitely gon' want 'em\nIf they knew I gotta get 'em first, old as a copper box\nHook 'em with a shirt, and the matchin' color socks\nI think the coldest was the black on black 11's with the red bottom\nOr the number 9's, you shoulda seen me when I got 'em\nI was in my house (in my house) dancin' in the mirror\nStraight thinkin' 'bout gettin out and how I'm 'bout to kill 'em\nWhen you know you got a pair that ain't nobody got (body got)\nYou can't hold 'em back, homie, you gotta rock (you gotta rock)\nI'm a addict, a Jordan fanatic, little Mars Blackmon\nI know when they comin'; number, color, everything that's happenin'\nYou know, a different style, a different color is a must\nBut uhh, it's all good until I get my first scuff and I'm like\n\n[Hook: Nelly (Jermaine Dupri)]\nHell naw, ain't no way (what's wrong?)\nMan, he done stepped on my J's (what?)\nStepped on my J's, he done stepped on my J's\nThese just came out! He done stepped on my J's (uhh)\nHell naw, ain't no way (what's wrong?)\nMan, he done stepped on my J's (what?)\nStepped on my J's, he done stepped on my J's\nI can't believe this shit! He done stepped on my J's\n\n[Verse 3: Ciara]\nI-I-I, I see you lil' daddy you look sexy with them J's on\nI pull up in the drop, and step out, with them things on\nI got me the black and pink - patent leather with the grey\nMatchin' with the skinny jeans - off with the shades\nI know you see me (I know you see me) my jeans be never slippin' (slippin')\nThe paparazzi, I might stop and take a picture in 'em\nYeahhhhh, we be fresh every day\nAnd if you lookin' for me lil' daddy you can find me in the A! A! A! A!\n\n[Verse 4: Nelly (Jermaine Dupri)]\nI got the Retro 1's, uhh\n(Then I bought the) 2's (and the) 3's (and the) 4's (uhh)\nI had to order these, you can't find them in the store (nope)\nCalled up my stylist like, \"Shorty, send more\"\nAnd if you would please send 'em to me out on tour\n(Uh-uh, uh-uh) They be here in a minute, man\nSee, I got that connect where I can damn near get like anythang\nPlus all my hoes on 'em, then I'mma stroll on 'em\nI call my hook-up at the store like \"Put a hold on 'em\"\nThem Carolina number 9's matchin' patent leather wristbands\nPatent leather number 11's, we call 'em Space Jams\nYou in my space man, I'mma make you jump man\nI'll make you jump, the jump, the jump, jump man\nSee on my weekends, my J's play a part\nI'm rockin' these to the club and these to the park\nI'm puttin' these on now and these here tomorrow\nA spare off in my car, just in case I catch a scar\n\n[Hook: Nelly (Jermaine Dupri)]\nHell naw, ain't no way (what's wrong?)\nMan, he done stepped on my J's (what?)\nStepped on my J's, he done stepped on my J's\nThese just came out! He done stepped on my J's (uhh)\nHell naw, ain't no way (what's wrong?)\nMan, he done stepped on my J's (what?)\nStepped on my J's, he done stepped on my J's\nI can't believe this shit! He done stepped on my J's", "image": "https://images.rapgenius.com/bbc3fc505690b29d7cdd8f673b04767b.220x218x1.jpg"}], "artist": "Nelly"}