{"songs": [{"title": "War Is Necessary", "album": "Grand Theft Auto IV Soundtrack", "year": "2008-04-29", "lyrics": "[Hook]\nWar is necessary, war brings pain\nBut war is necessary, war brings peace\n‘Cause war is necessary, get your warriors up\n‘Cause my niggas are war ready\nWar brings hate (Esco,  let's go let's go let's go!)\nWar is necessary, war brings pain (Esco, let's go!)\nGet your warriors up\n‘Cause my niggas are war ready\nMy niggas war ready\n\n[Verse 1]\nStaring at the face of my watch, its like a crystal ball\nWith the ability to make the issue stall\nI told my man duck, ‘cause I know where the missile fall\n‘Cause the ice is a fortune teller for the rich or small\nWent to my man's crib who dead and saw his picture fall\nI picked it up, his voice whispered, \"Nigga, ball!\"\nSo I smoke the finest, (85 for the ocean liners?)\nI do it for the have-not's, I'm at spot\nThat resembles screen savers on your lap tops\nAnd niggas can't believe it like seeing that nigga Zab drop\nI be in Cameroon, bandanas on silk Dior\nSip cream liqueur, green and blue FILA velour's suits\nBoss smooth, the only thing I endorse duke\nStash houses, gamble, I don't sweat a lawsuit\nAll true in living God, we was here first\nParisian linen garb and cashmere shirts\n\n[Repeat Hook]\n\n[Verse 2]\nWhose crew was realist? Shot up the movie theaters?\nTimes Square '88, whose crew was in it?\n(Photographed was?) sittin' on wood wicker chairs\n40oz in the lap, givin' off wicked stares\nPunch out kings, bustin' pistols in the air\nHangin' out a Cutlass Supreme window like \"Bitch, come here\"\nGirls cussing back at us with the fattest asses\nLike, \"Who you calling bitch?! Little black bastards!\"\nWe had to wave the flag, here come they baby dad\nDrug dealers in the crazy Jag looking crazy mad\nThey all thought they was sparkle, fucking killer men\nBut we was all Black seeds as Fred Williamson\nIt was so simple, now I'm reflecting in this gold Enzo\nFace it, my favorite trinket was that Teddy Riley guy bracelet\nSo now it's fly shit I'm draped in, customized shit I'm makin'\n\n[Repeat Hook]", "image": "https://images.genius.com/f5d18a63c2183358f999befe39d7497b.478x478x1.jpg"}], "artist": "Nas"}