{"songs": [{"title": "Don’t Trust Her", "album": "Can’t Stay Away", "year": null, "lyrics": "[Badwayz]\nYeah, don't trust her\nDon't trust yo' nigga\nYeah, uhh\n\nNow do you love your bitch or do you trust your bitch?\nNow do you love your nigga or do you trust your nigga? Yeah\n\nNow do you love your bitch or do you trust your bitch?\nCause niggas gotta tendencies to follow they dick\nYou down with Too $hort girl? He a ho\nCause I'll snatch a bitch up e'ry show, and hit the mo-mo\nBut certain niggas fall in love with them hookers\nNigga the pussy ain't yours cause another nigga took her\nSeen a little mo' game, she took a rang and some bigger and better thangs\nStarin at the chain and the karats in the rang\nNow who she wanna leave with, she know we got the sticky\nThe niggas wearin dickies or the niggas givin hickies\nShe know what she want, she want that California funk\nThem hundred spoke thangs with that juice up in the trunk\nShe wanna ride down the sho' with the top back\nBut she know I gotta hit before we start that\nMan don't trust her\n\n(Aiyyo) Man, see that's what the fuck I'm talkin about\n(What?) You can't trust a bitch!\n(The fuck you mean?) What'chu mean? Where the fuck you been?\n(Me and my girl Robin went to the car wash)\nI don't wanna hear that shit\nRobin called me lookin for yo' motherfuckin ass\nWhat the fuck you think? (whatever, whatever)\nThat's what the fuck I'm talkin 'bout, I'm talkin 'bout\n(You trippin) I can't trust yo' motherfuckin ass\nYou need to get yo' ass the fuck up outta here\n(Nigga let's just fuck, okay?)\nNo I ain't even fuckin, ain't worth that motherfucker\n\nNow do you love your bitch or do you trust your bitch?\nNow do you love your nigga or do you trust your nigga?\nNigga what what, what what wha-what?\n\nNow you thinkin you be trustin yo' man, but I'ma tell you right now\nThe peter man make the plans\nIt's like when I step up in the club I gotta catch my breath\n9 times out of 10 I cain't help myself\nI don't really mean to cheat, I ain't lyin I'm a freak\nPager goin beep and I'm steady tryin to creep\nI admit, I'm a - sinner\nI did what I had to do just to get in her\nI simply whispered in her ear\nTell her I'm the man, tell her what she wanna hear\nNow I'm knowin I can hit it\nCause the shit was soundin good cause she bought it and she bit it\nI'm down with $hort Dawg, I'm the next thang comin\nYou heard Badwayz? Yeah I'm the first one\nMy name Stud baby girl, you ain't heard of us?\n\"$hort Records: In Platinum We Tru$t?\"\nI hadda died if I wasn't high - you ain't heard that?\nBut matter of fact, I got some weed in the 'llac\nWe can finish these drinks and go smoke that shit\nAnd from there, ain't no tellin where we gon' get\nBut don't trust her\n\nThat's the type of shit I'm talkin about (what?)\nThat fuckin around shit man that shit is not cool\n(Fuckin around nigga, you been fuckin around too with some-a your hoes)\n(Now how you gon' come off on me like that?)\nMan you ain't got no clue, you don't know what the fuck's goin on f'real\n(Anyway) I'm bout to handle business (I know)\nOh yeah baby what's up? (I know what you doin out there okay?)\nBitch, what the fuck you think I'm doin?\n(Well as long as you bringin that lucci home to me baby)\n\nNow do you love your bitch or do you trust your bitch?\nNow do you love your nigga or do you trust your nigga?\nNigga what what, what what wha-what?\n\nYou see it's way after 12 and I'm out wit'cho bitch\nTossin up, while you workin on the midnight shift\nGot you fucked up mad, bout to start a rage\nShe won't answer the phone, won't return your page\nGettin took for what you got yet you treat her real dapper\nShe takin all yo' change and she spend it on us rappers\nFuckin all in yo' house, bustin all on yo' sheets\nWhen I come to yo' town, I be doggin yo' freak\nThen you come back home lickin all on that ho\nWould have a fit ever knowin she was suckin Joe\nShe love money and excitement, that's why y'all always fightin\nAnd youse a workin-haulic, she want you to be ballin\nWhen it all falls down, you cain't trust that bitch\nIf she make you too mad you might bust that bitch\nBe locked down in county for assaultin shit\nBut for love and the pussy you done bought that bitch\nDon't trust her\n\nDon't trust her, don't trust that bitch\nNow do you love your bitch or do you trust your bitch?\nDon't trust her\nNow do you love your nigga or do you trust your nigga?\nNigga what what, what what wha-what?", "image": "https://images.genius.com/31a42aa43e1b297422c8b89c0ea0a2c0.500x493x1.jpg"}], "artist": "Too $hort"}