{"songs": [{"title": "Any Man (Fucking Crazy)", "album": "Soundbombing II", "year": null, "lyrics": "[Produced by Mr. Walt of Da Beatminerz]\n\n[Verse 1]\nHi! Original Bad Boy on the case, cover your face\nCame in the place, blowed, and sprayed Puffy with mace\nI laced the weed with insect repellant, better check the smelly\nEminem starts with E, better check the spellin'\nWith a capital, somebody grab me a Snapple\nI got an aspirin capsule trapped in my Adam's apple\nSomebody dropped me on my head, and I'm for sure\nThat my mother did it, but the bitch won't admit it was her\nI slit her stomach open with a scalpel when she was six months\nAnd said \"I'm ready now, bitch! Ain't you feelin' these kicks, cunt?\"\nThe world ain't ready for me yet, I can tell\nI'll probably have a cell next to the furnace in Hell\nI'm sicker than sperm cells with syphilis germs\nAnd I'm hotter than my dick is when I piss and it burns\nI kick you in the tummy until you sick to your stomach\nAnd vomit so much blood that your clothes stick to you from it\nHit you in the head with a brick 'til you plummet\nIf y'all don't like me, you can suck my dick 'til you numb it\nAnd all that gibberish you was spittin', you need to kill it\n‘Cause your style is like dying in my sleep; I don't feel it\n\n[Hook]\n‘Cause any man who would jump in front of a minivan\nFor twenty grand, a bottle of pain pills, and a minithin\nIs fuckin' crazy – you hear me? Huh?\nIs fuckin' crazy – hello, hi!\n‘Cause any man who would jump in front of a minivan\nFor twenty grand, a bottle of pain pills and a minithin\nIs fuckin' crazy – do you hear me? Is fuckin' crazy\n\n[Verse 2]\nI'm ice-grillin' you, starin' you down with a gremlin grin\nI'm Eminem, you're a fag in a women's gym\nI'm Slim, the Shady is really a fake alias\nTo save me with in case I get chased by space aliens\nA brainiac, with a cranium packed\nFull of more uranium than a maniac Saudi Arabian\nA highly combustible head\nSpasmatic, strapped to a Craftmatic adjustable bed\nLaid up in the hospital in critical condition\nI flatlined, jumped up, and ran from the mortician\nHigh speed, IV full of Thai weed\nLookin' Chinese with my knees stuck together like Siamese\nTwins, joined at the groin like lesbians\nUhh, pins and needles, hypodermic needles and pins\nI hope God forgives me for my sins\nIt probably all depends on if I keep on killin' my girlfriends\n\n[Hook]\n‘Cause any man who would jump in front of a minivan\nFor twenty grand, a bottle of pain pills, and a minithin\nIs fuckin' crazy – you hear me? Ha?\nIs fuckin' crazy – listen\n‘Cause any man who would jump in front of a minivan\nFor twenty grand, a bottle of pain pills and a minithin\nIs fuckin' crazy – do you hear me? Is fuckin' crazy\n\n[Verse 3]\nLast night I O.D.'d on rush, mushrooms and dust\nAnd got rushed to the hospital to get my system flushed\n(Shucks!) I'm an alcoholic, and that's all I can say\nI call in at work, ‘cause all I do is frolic and play\nI swallow grenades, and take about a bottle a day\nOf Tylenol 3, and talk about how violent I'll be (RRARRRRH)\nGive me eleven Excedrin, my head'll spin\nMedicine'll get me revvin' like a 747 jet engine\nScratched my balls 'til I shred the skin\n\"Doctor, check this rash! Look how red it's been!\"\n\"It's probably AIDS!\" \"Forget it then.\"\nI strike a still pose and hit you with some ill flows\nThat don't even make sense, like dykes using dildos\nSo reach in your billfolds for ten ducats\nAnd pick up this Slim Shady shit that's on Rawkus\n\"Somethin', somethin', somethin', somethin', I get weeded.\"\nMy daughter scribbled over that rhyme, I couldn't read it\n\n[Hook]\n‘Cause any man who would jump in front of a minivan\nFor twenty grand, a bottle of pain pills, and a minithin\nIs fuckin' crazy – you hear me? Ha?\nIs fuckin' crazy – hello?!\n‘Cause any man who would jump in front of a minivan\nFor twenty grand, a bottle of pain pills and a minithin\nIs fuckin' crazy – do you hear me? Is fuckin' crazy\n\n[Outro]\nHi, something's not right\nI'm sorry, I'm mentally retarded\nSlim Shady, I think that's my name\nRawkus Records, fuckin' crazy\nDo you hear us? We're fuckin' crazy!\nAll of us! Hi… bye… goodnight, somethin'", "image": "https://images.genius.com/1b2973861d4ebfd4d3c6cd339de361e2.640x640x1.png"}], "artist": "Eminem"}