{"songs": [{"title": "Candler Road", "album": "STN MTN / Kauai", "year": "2014-10-03", "lyrics": "First Half\n[Produced by Tim Suby]\n\n[Verse 1]\nI ain't lovin' these fake hoes, room smellin' like 8 Swishers\nRoom service like 2K, NBA, I'm ballin', nigga\nAll them niggas, fallin' like Autumn, nigga\nTalkin' shit, I saw them niggas, now their daughter want a picture\nRough ain't it? Fuck famous\nNiggas too real, got the most haters\nWrote a story so Stephen Curry: how it feel to be golden?\nWhy was I chosen?\nHanalei Bay with my bae, what can I say?\nI did it, my timin' was perfect, I'm comin', they know it\nBecomin' the last great American poet\nThe flow Lindsay Lohan\nTired nigga, retire nigga\nMy word is art like a hieroglyphic\nWhat island is this?\nCabernet, I can smell her talk\nShe wanna swim but can barely walk\nShe 'fraid of sharks, she'd hate my lawyer\nAtlanta, Georgia, got somethin' for yah\nI'm doin' somethin', stay wit' it\nI sport the Oakland A fitted\nCause it's moneyball and I'm throwin' funny\nBut all the kids'll go get it\nGod dammit I'm ill\nI got one question for the haters, is your girl on the pill?\nI'm playin' though, but like really, really?\n\nSecond Half\n[Produced by Childish Gambino]\n\n[Interlude]\nOh man\nOh man, oh man, oh man\nI got a hook for this, it's like\nBa-b-ba-b-ba-ba\nB-ba-b-ba-b-ba-ba\nNa-na-di-ma-ma-ma\nI love you all the time\nSomethin' like that\n\n[Verse 2]\nI'm the man forever\nThey can't let a nigga live cause the life is better\n85 everyday, why'd I bring this sweater?\nI fell asleep on the beach, tiny pink umbrella\nFell out of my drink, she yellin', \"What we doin' tonight?\"\n50k their first week, you ain't doin' it right\nYoung Bino best friends with the show promoters\nGood year, my career is floatin', it's all me\nCause I stay real, the worst pain, niggas don't feel\nCause they ain't feel a nigga, tried to kill a nigga\nBut he still went stupid\nSilver stones on her and the game so clueless\nThese niggas ain't us\nHopin' that I diss you back so I can make you famous\nI'm just tired of haters\nThe AK goin' off, sound like cicadas\nWe the clique all day, man I'm so Decatur\nMe and Fam backstage, yeah I know you hate us\nBut you gotta pay us\nLet 'em speak at my peak in the game for a minute\nBut I don't know how\nAll these light skinned niggas came back in style\nYe lied to us, pretty girls at my concerts\nFlow so cold so you know it was my verse\nStank attitude but I like the way she diddy bop\nPuffin' white O's, body bang somethin' Nitty Scott\nThey want the old Bino so they try to rewind\nThe new Bino too ahead of his time\nIn a couple of years, they'll have to say I birthed a couple careers\nChances are I get your boy a couple of ears, you know it\n\n[Outro]\nBa-b-ba-b-ba-ba\nDuh-d-duh-duh-d-duh\nDuh-duh-duh-duh-duh, duh-duh-duh\nTo love you all the time\nI don't have words for this part\nBut I know it should sound like this\nDuh-d-duh-duh-duh-duh\nTo love you all the time", "image": "https://images.genius.com/77a2349de407b4d4690746b19b39f6dc.500x500x1.jpg"}], "artist": "Childish Gambino"}