{"songs": [{"title": "Hot", "album": "The Sneak Attack", "year": null, "lyrics": "Yeah\nWho will be standing when the smoke clears?\n\n[(KRS-One) --] Redman](1831239)\n\nWord up!\nWhat's up with this?\nWe're coming through\nBoogie Down style, kid\nWhat's up\nThis is KRS-One\nThe light at the end of the tunnel\n\nYo, they not HOT, all they do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not cause you're friends with the cops\nThat's not HOT, a real MC you're not\n\nI'm HOT, been hot, repeatedly heated\nDon't call the teacher, hah, you best be seated\nYou got these kids gased up like you own the inventory\nFake muthafuckas ain't tellin the whole story\nTell em how you borrow from everyone you knew\nAnd now that you're on top, they can't borrow from you\nThat's not hot, tell em how you love bein pop\nCause you was so broke before, sleepin cold on a cot\nYou don't rock, you grab money\nYour crocks rock the spot and you grab them honeys\nIt's about to get ugly\nI don't even go to these bullshit kiddie-ass clubs\nYou wanna be a thug? Let's thug\nFirst of all, soldiers speak to soldiers\nCaptains speak to captains\nLieutenant/lieutenant, cool?\nBut your first mistake is: he's steppin to me, rookie\nLike you a O.G. and you just a run-up, fool\nWho really got these streets on lock?\nWhose name really holds high respect on the block?\nWho opened up these clubs and taught you how to mix?\nWho opened up these thugs from Compton to the Bricks?\nI don't even sound like the rest of you kiddies\nI study the ways of God, you studyin titties\nAnd ass, I pity your class\nCause you come out with a blast\nBut you're trash, so you really don't last\n\nThey not HOT, all they do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not cause you're friends with the cops\nThat's not HOT, a real MC you're not\nThey not HOT, all they do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not cause you're friends with the cops\nThat's not HOT, a real MC you're not\nThis is hotter than heat, too deep, I'm on top of the streets\nYou weak, you ain't really rockin these beats\nYou ?????, you dress straight, eat straight\nBut you're a slave, and yo, you can't come up in a heat tank\nG-o-d we thank, we watch what we sell\nYou better hope these Christians are wrong cause you goin to hell\nThink about that when you're spittin your raps\nAnd you call out KRS, I'll put you flat on your back\nYou're not HOT, all you do is talk a lot\nThat's not HOT, where's your respect on the block?\nThat's HOT, not cause you're friends with the cops\nThat's not HOT, a real MC you're not\nWhat's HOT?\n(KRS-One)\nThat's HOT!\nWhat's HOT?\n(KRS-One)\nThat's HOT!\nWho's HOT?\n(KRS-One)\nThat's HOT!\nWhere's your respect on the block?\n[ *scratching of* ]\n(KRS-One need to be runnin for office\nSo Butta-Pican Rican, tell em to get off it) --] Redman", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}