{"songs": [{"title": "1999 Tim Westwood Freestyle", "album": null, "year": "1999-05-27", "lyrics": "[Verse 1: Eminem]\nTim Westwood, Marley Marl and Slim Shady and MC Proof\nProof on my side, my sidekick\nY'all can suck my wide -ick\nSaid the \"ick\" without the D in front of it\nNone of you rappers want none of it\nI’ll put you on punishment like Big Pun\nWanna suck my \"ick-ick\"? Here's a big one\nI'll do it with the fluid that I’m spillin'\nI'm illin', plus I'm chillin', I'm not a villain\nForget the controversy surroundin' me\nAnd all these fake-ass press people surroundin’ me, houndin’ me\nBut I don't give a damn ’cause I smoked a pound of weed\nY'all don't want none of me\nSo get from in front of me like Chuck D\nAll the these bitches wanna walk up and fuck me\nWhoops! Did I say that or did I think it?\nI don't know but my brain starts shrinkin’\nMy spine starts shrivelin', givin' 'em adrenaline\nWhen I'm killin' 'em and no DNR for Benylin\nAnd this is right off the top\nTake a bottle of pop and bit off the top\nTim, I said that last time when I was on your show\nBut it really doesn't matter 'cause I kick this slowest flow\nWith a flow that's slow, really doesn't matter\nSaid it backwards, but all you fake-ass rappers are actors\nAnd I'ma bring it to ya\nYou got a life and you got a song\nBut don't know how to sing it, do ya?\nNo you don't, so I'ma kill it\nI'ma cook a cracked egg in a skillet and eat it\nAnd smoke it and whatever, take my dick and poke it\nBlastin' off right now!\n\n[Interlude: Marley Marl]\nAight! Ha-ha-ha\nNo doubt\nNo doubt, baby\n\n[Verse 2: Proof & Eminem]\nProof!\nMC Proof, here on the mic raise the roof\nKill 'em like 180-Proof\nD12, D12, D12 (D12)\nToo many white and black people I been gnarly\nRockin' with Tim Westwood and Mr. Marley\nIt's time for us to do y'all, who y'all?\nWe break balls like cue balls, while y'all switch up like RuPaul\nIt's true y'all don't wanna mess around with us\nA lotta people I been with is dangerous\nWhy's this beat so fast?\nI know\n\n[Verse 3: Eminem]\nWow, this beats are a little bit too fast for my headache\nBut I don't give a damn, someone call a paramedic\n'Cause I'm pathetic, I need a little bit of Excedrin to make my damn head spin\nI'll do a head spin, a windmill and then chill, and then kill (Westwood!)\nWhatever, I'm clever with these beat that I kick over these techniques\nLike technique 12 inches, I get blunted\nAnd any rapper that wants it, don't want it\nThey kick in front it, right to their face\nI give, I'ma smackin' it and I don't give a damn\n'Cause I got Proof backin' it\nY'all don't wanna step to me\nYou put your life in jeopardy\nY'all better choose your mother— weaponry\nAyo Proof, get on the mic\nShow these mother— what it's like\n\n[Verse 4: Eminem & Proof]\nAll you motherf— goin' get f— up now\nAw man\nNo cussin', no potions, slow motion, jack off with no lotion\nI'm slower than the flow in the ocean\nI can cause an explosion, to knock water out of an ocean\nWhen I'm coastin', jumpin' the rowboat and start flowin' in it\nI brought the microphone, my -ick I'm totin' it\nLike a Glock that cock\nI rock the microphone and rock the spot\nAnd rappers jock a lot, Proof come in whether you're wack or not (These voices)\nOr dope or not (These voices)\n(I hear them, I hear them voices)\n(These voices I hear them)\n(And when they talk I'll follow)\n(I'll follow, I'll follow, I'll follow all these voices)\n(These voices I hear them)\n(And when they talk I'll follow)\n(I'll follow, I'll follow, I'll follow)\n\n[Interlude: Marley Marl & Eminem]\nYo, yo, yo, I'ma give you this hot beat\nMarley Marl style\nGo ahead, Proof\nSlim Shady, Marley Marl joint exclusive freestyle\n\n[Verse 5: Proof & Emimen]\nYo, exclusive\nFor all our supporters\nRoll your tape recorders\nThis is goin' overseas to many different borders (Westwood!)\nHere it is, Paul Bunyan, he speaks Yiddish\nNiggas and Slim Shady run for the English to the British\nTime for them to get down, stood up, listen to us\nWe can rock the microphone and never got to cuss\nUs, trust, nuts, of course we dangerous\n[?] derange the bus is danger\nWell I flip it and I kick and I rip it and I flip\nI figgity back the microphone and figgity-figgity-wheepsy\nYo, check it out, yo, my hair ain't nappy\nBut, yo, can this beat please get a little more happy?\nI diggity what for biggity what\nI biggity bust a savage\nI biggity down, flip them down, flip them like a [?]\n\n[Verse 6: Eminem]\nYo, yo, yo, yo, yo, yo, yo, hold on, hold on, hold on (Holdin' on)\nThis beat a little bit too happy for my stinkin' self\nNah, this is nice, this is nice\nThis is some explicit shit that y'all can't get with\nGet my wrists slit, I ain't a nit wit\nBut I'll smoke weed and pass out like a sampling snippet\nY'all don't wanna hear me rip it\nY'all don't wanna hear me flip it\nI biggity-biggity-biggity-whoopsie\nLike Das EFX, you get a broken neck\nMy textbook, take a next look\nY'all don't wanna understand the way that I just come off at the top\nAnd I can always drop everything that I stop\nOr everything that I keep goin' and keep flowin'\nLike the Energizer bunny, that's why it's funny\nWhen rappers try to step to me and try to step to me\nAnd battle me for money, 'cause you're a dummy\n'Cause anything that you could say I could use against you (Westwood!)\nAnd I can slice your ass like a chem suit\nLet me continue, put the shit on the menu\nRappers don't wanna step to me\nBecause [?]\nThen I continue to bust, never ever trust\nAny MC 'cause I turn 'em all to friggin' dust\n\n[Verse 7: Proof]\nYeah, we turn 'em to dust\nAyo, Dirty Dozen gon' battle with anything\nYou better off hop in a plane with JFK\nDisplay lyrical styles, we get it dirty\nIt's Dirty Dozen, D12 [?]\nNo need to write this, 'cause when we write this\nY'all hear Shady, Proof, Bizarre and [?]\nIt's time to hype this, get it with this\nIt's Tim Westwood, get on your best foot\nYour chest could take a slug from us\nDo drug with us, you bug with us? Nah\nDon't even try that, you hear this stuff?\nWell, next time, the LP buy that\nNo time to hide that\nAyo, the hi-hat, go buy that\nYou die flat for talkin' that\nYou get bust up, who's that?\nPaul Rosenberg, yo, frozen turds\nGet stepped over, it's time to get it\n\n[Outro: Eminem, Marley Marl (& Proof)]\nPaul Rosenberg\nI'd like to thank y'all for comin' by, man\nY'all just ripped that\nDid you rip my damn microphone?\nPaul Rosenberg is a small frozen turd\nWhy y'all just ripped my damn microphone?\n(Nah, we ain't did nothin' yet, yo)\nAye, peace London\nMa-Ma-Ma-Marley\nPeace\nMarley, Tim, I love y'all, peace\nThank you very much for havin' us", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}