{"songs": [{"title": "Jodeci Freestyle", "album": "Care Package", "year": "2013-06-22", "lyrics": "[Verse 1: Drake]\n26 on my third GQ cover\nYour new shit sound like you do covers\nOf all of my old shit, oh shit\nI'm devoted to making sure that shit goes unnoticed\nSwear you niggas is hopeless\nI should run a clinic for niggas that think that they winning\nOn some coach shit, 50 Ms for a three-month road trip\nI see straight through them like fish tanks with no fish in them\nDrizzy still got some '06 in him\nIRS all in my books getting they Matlock on\nAll this capital it's like I left the caps lock on\nIt's like every time I plot a return I seem to shift the game\nSee I can still talk keys without pitchin' cane\nPay yourself and owe yourself\nBefore you come to my city just know yourself\nKnow where you at\nI'm good in every town, I'ma be there doing shows where you at\nThe lights hit women screaming like Jodeci's back, nigga\n\n[Interlude: Dennis Graham]\nBut that’s… that’s where all this... that’s where the feeling is\nThat’s where all that shit comes from… man I mean like\nThe music that you and I used to listen to ahh.. was just..\nAbsolutely phenomenal, because we went through it all\nWe went through errythang...\nI remember you loved Jodeci\nI mean like studied, you even made me a CD…\n\n[Verse 2: Drake]\nYour money is just a little Barney’s Co-Op for you to be tryna show out\nI'm in your girl's ear planting seeds like a grow-op\nWe move the operation to Cali soon as the snow drop\nOh stop, please stop arguin' 'bout who's the best MC\nI think everyone would agree, they know that you're not\nI know I'm a sure shot, middle finger poking you in your sore spot\nBars sound like I'm under oath nigga\nI Comedy Central roast niggas and turn 'em to ghost niggas\nEither I'm gettin' bigger or you're just gettin' smaller or it's both, nigga\nI'm just as unforgivin' as most niggas\nYou bit the hand, now starve, it's not a joke nigga\nI'll hang you with it after I teach you the ropes nigga\nOh well, bitches paint OVO on their toenails\nAnd show up at the show, the afterparty, and the hotel\nThat five star in your city, they know where we at\nI hit the lobby, women's screaming like Jodeci's back, nigga\n\n[Bridge: J. Cole]\nJodeci's back\nYou bitches screamin' like Jodeci's back\nI call the front desk for condoms, she's sayin' they ain't got none\nThe way that I'm respondin', she know that we black, nigga\n(Fuck you mean you ain’t got no condoms)\nJodeci's back\nFuckin' hoes like Jodeci's back\nI paint pictures and flip words\nNigga woulda thought Def Poetry back (Cole)\n\n[Verse 3: J. Cole]\nRoof top, hoes turnt up\nLookin' for your bitch, bet she won't turn up\nWonder where she is, fuck could she be?\nShe's a ho, she's a slut, she's a freak\nHeard a couple niggas hatin' but them fuck niggas weak\nCount a hundred thousand dollars like it sucks to be me\nAin't that what you wanted? Stuntin' on you niggas\nCame in this game never frontin' on you niggas\nGave you heart and soul, stories of my pain\nFelt naked 'cause I laid out all my glory and my shame\nCaught fire just to have niggas ignore me and my flame\n'Bout to burn down the house, they tryna put me in the rain, no\nFuck your list you lame niggas and doubters\nI'm undoubtedly the hottest and that's just me bein' modest\nGo check the numbers dummy, that's just me gettin' started\nI'm artistic, you ****** ** ******** ********\nHold your applause\nWho gives a poker face when you jokers showed me your cards?\nDavid and Goliath, takin' on the giants\nNo need for pause when I tell you my balls bigger than yours, Cole\nNo false gods, young Mike playin' against the Monstars\nTappin' into '94 Nas\nOr that '96 Jay, or that Chronic shit, Dre\nWhich is really just Slim Shady, I'm silly, my pen crazy\nToday I'm out in Philly, my fans waitin' for 12 hours\nJust to get their dollar signed\nThoughts stream like I'm Spotifyin'\nTrenchcoat flow, bottom line\nTo these too cool for school niggas I'm Columbine\nFlow dumber than your projections\nThis makes twice now, I doubled what you expected, yet\nYour covers keep perplexin' me\nMaybe it's too complex for me\nBut is this 'bout skills or is this 'bout sales?\n'Cause either fuckin' way, man all them niggas is less than me\nYou legends know that we rap\nBitches screamin' like Jodeci's back", "image": "https://images.rapgenius.com/4f4f2c9bdcf2f60bb067a5a1da5c0832.500x500x1.jpg"}], "artist": "Drake"}