{"songs": [{"title": "Swagga Surfin’", "album": "Flamers 3: The Wait Is Over", "year": "2010-03-12", "lyrics": "The Man up top got me, let's get it\nPhilly in this bitch\n[Verse 1: Meek Mill]\nOkay! Maybe it's my swagger\nEvery time I come around these haters getting madder\nGangstas in the kitchen wit it, whippin' up the batter\nWhen them hoes see me they like Meek Mill you getting fatter\nI'm eating bitch I'm eating bitch\nLiver than your weekend get\nDella Reese I'm beasting shit\nNow shut up ho and eat this dick\nCall your friends and we can get\nA Ménage just like Nicki is\nBaby by me be a millionaire like 50 is\nTen thousand all on my wrist\nLouis V's all on my feet\nLouis V all on my belt\nCheckerboard all on my teeth\nCheck that boy I'm MOB I'm all about a Benjamin\nShawty say her pussy wet guess I'm gon' go swim in it\nSplash! I laugh\nGet money got cash\nYou hating you mad\nI made it too bad\nChicks say I'm too fast\nI tell them I'm a freak\nAnd if you ask about around Philly they gon tell you I'm the streets\nI'm the mayor around where I be\nThey say who that, we that\nCause I drop that China white and make her say I be back\nShawty off that crack pipe bet I make her relapse\nPut it in her mouth and make her suck that shit believe that\nRest in peace to shotty\nThis 40 on my body\nIn the middle of the jungle this shit realer than Jumanji\nAnd I'm strapped shoot first\n[?] get murked\n[?] this verse\nThey gon ask where the work\n\n[Verse 2: K. Smith]\nThese niggas hating on me cause I buy the shit they wanted\nAnd their bitches want to fuck me cause they say I look like money\nI be swagging on them hop in my bag on them\nI switch that Lexus to a Beamer now I'm backing on them\nThey call me big bank shawty Mr. GetHerGoing\nRicky Bobby on your ho and stanky leg up in her tummy\nI be flyer than a [?] and I be leer jet stunting\nIf it ain't about money then it ain't about nothing\nMeek Milly in this bag so I'm pulling out the louie\nJust to fill it up with cash and my Gucci's full of truies\nAnd my life is like a movie got these bitches all chewy\nPool party at my crib and I got your girl in my Jacuzzi\nSee I got so many cars that I don't even got to drive\nHelicopter in the back all I got to do is fly\nCall me Maybach shawty when I hit than one-on-one\nDoing 100 in the lanes like a nigga on the run", "image": "https://images.genius.com/d76ee1acc13d517c9a1ca16cf95a42ba.500x500x1.jpg"}], "artist": "Meek Mill"}