{"songs": [{"title": "Guilty Conscience", "album": "The Slim Shady LP", "year": "1999-02-23", "lyrics": "[Intro: Mark Avery & Eddie]\nMeet Eddie, 23 years old\nFed up with life and the way things are going\n(Damn, I'm going fucking insane)\nHe decides to rob a liquor store\n(I gotta take this shit, I can't take it no more, holmes)\nBut on his way in, he has a sudden change of heart\n(Shit is mine)\nAnd suddenly (I gotta do this)\nHis conscience comes into play (I gotta do this)\n\n[Verse 1: Dr. Dre, Eminem, & (Eddie)]\nAlright, stop (Huh?)\nNow before you walk in the door of this liquor store\nAnd try to get money out the drawer\nYou better think of the consequence (Who are you?)\nI'm your motherfuckin' conscience\nThat's nonsense\nGo in, gaffle the money, and run to one of your aunt's cribs\nAnd borrow a damn dress and one of her blond wigs\n(Can I borrow this?)\nTell her you need a place to stay, you'll be safe for days\nIf you shave your legs with Renee's razor blades\nYeah, but if it all goes through like it's supposed to\nThe whole neighborhood knows you and they'll expose you\nThink about it before you walk in the door first\nLook at the store clerk, she's older than George Burns\nFuck that, do that shit, shoot that bitch\nCan you afford to blow this shit? Are you that rich?\nWhy you give a fuck if she dies? Are you that bitch?\nDo you really think she gives a fuck if you have kids?\nMan, don't do it, it's not worth it to risk it (You're right)\nNot over this shit (Stop)\nDrop the biscuit (I will)\nDon't even listen to Slim, yo, he's bad for you\nYou know what, Dre? I don't like your attitude\n\n[Skit: Stan, Girl]\nCome on, just come in here for a minute\nI don't know\nLook, look, look\nDamn\nLook, it's gonna be alright, alright?\nO-okay\nLook, give me a kiss, pull your pants off, come on\n\n[Interlude: Mark Avery]\nMeet Stan, 21 years old\nAfter meeting a young girl at a rave party\nThings start getting hot and heavy in an upstairs bedroom\nOnce again, his conscience comes into play\n\n[Verse 2: Eminem & Dr. Dre]\nNow, listen to me, while you're kissin' her cheek\nAnd smearin' her lipstick, slip this in her drink\nNow all you gotta do is nibble on this little bitch's earlobe\nYo, this girl's only fifteen years old\nYou shouldn't take advantage of her, it's not fair\nYo, look at her bush, does it got hair? (Uh-huh)\nFuck this bitch right here on the spot, bare\n'Til she passes out and she forgot how she got there\nMan, ain't you ever seen that one movie Kids?\nNo, but I seen the porno with Sun Doobiest\nShit, you wanna get hauled off to jail?\nMan, fuck that, hit that shit raw dog, then bail\n\n[Interlude: The Isley Brothers, Mark Avery, (Grady), & Grady's Wife]\nHere I lay\n(Man, it feels good to be home)\nMeet Grady, a 29-year-old construction worker\nAfter coming home from a hard day's work\nHe walks in the door of his trailer park home\nTo find his wife in bed with another man\n(What the fuck?) Grady\n\n[Verse 3: Dr. Dre & Eminem]\nAlright, calm down, relax, start breathin'\nFuck that shit, you just caught this bitch cheatin'\nWhile you at work, she's with some dude tryna get off\nFuck slittin' her throat, cut this bitch's head off\nWait, what if there's an explanation for this shit?\nWhat, she tripped, fell, landed on his dick?\nTsh, alright, Shady, maybe he's right, Grady\nBut think about the baby before you get all crazy\nOkay, thought about it? Still wanna stab her?\nGrab her by the throat, get your daughter and kidnap her?\nThat's what I did, be smart, don't be a retard\nYou gonna take advice from somebody who slapped Dee Barnes?\nWhat you say?\nWhat's wrong? Didn't think I'd remember?\nI'ma kill you, motherfucker\nUh-uh, temper, temper\nMr. Dre, Mr. N.W.A, Mr. AK\nComin' straight outta Compton, y'all better make way\nHow in the fuck you gonna tell this man not to be violent?\n'Cause he don't need to go the same route that I went\nBeen there, done that\nAw, fuck it, what am I sayin'?\nShoot 'em both, Grady, where's your gun at?", "image": "https://images.genius.com/80aef755b537caed93fcc8dac2ca4442.600x600x1.jpg"}], "artist": "Eminem"}