{"songs": [{"title": "Planet of the Apes", "album": "The Lex Diamond Story", "year": "2003-12-16", "lyrics": "[Intro: Capone]\nI just had to say that right there Rae\nI just have to say you my nigga, understand?\nIt don't get no realer than this, man\nLet's slow the fuck down\nYou gettin' like a hundred worth for real, man\n\n[Hook 2X: Polite]\nEh yo thug niggas know the code, lock and load\nHit 'em in the head, watch a nigga brain explode\nYo from Y.O. to Q.B. they bang this shit\nShaolin boys they bang them fifths\n\n[Intro continues overlapped by Hook]\nFuckin' cops ain't paid up nothin'\nYo you know we shoot you down, man\nIce Water Inc., yeah! Territory, nigga\nMillitainment, Y.O\nYeah, yeah\nYeah yeah eh yo\n\n[Capone]\nEh yo late night, candle light, fiend with a crackpipe\nIt's only right, feelin' higher than an airplane, right?\nI'm tryin' to get this money, right? So I move cautiously\nYou more frauds, you see? I'mma live bossy\nWay out on Fantasy Island with Mr. Roth, B\nI gotta play the ghetto, everyday the hood endorse me (Q.B.)\nI'm destined for triple, left hand crook and the right hand fury\nWill block the shots, that's simple, I dented a tomb for style\nA toast to the death of my foes, respect violence, the criminal codes\nHammer smack a nigga out his five senses\nLeave him dumb, deaf and blind, I ride on rinses\nInterest so tight, strobe lights follow my grace\nBang bullets by the gates, might hollow ya face\nMe and Chef smark massive murder, kill 'em!\nI scramble anywhere in Shaolin, right in Castalano buildin'\n\n[Hook 2X: Polite w/o \"Eh yo\" second time]\nEh yo real niggas get up, live niggas, what up?\nWe don't give a fiduck, you faggots'll get hit up\nQ.B., what up? Y.O., what up?\nShaolin get up or get yo' ass hit up!\n\n[Sheek Louch]\nEh yo I'm a motherfuckin' Nigga Wit an Attitude\nHeavy gun play, cock back, niggas is screwed\nStomach wounds make it hard for you to swallow ya food\nThrowin' Purple Tape off for me to get in the mood\nSheek Louch, who fuckin' wit' that kid?\nI'm sick in the head, they need to make a throwback straight jacket\nWhite tee on, a light G. on\nThese bitches you wife and the God try pee on\nI don't care if it's a gram or brick\nI'mma make it sell, get off my dick\nPump or the Desert E., take your pick\nMoney too long, the case won't stick\nD-Block niggas fuck with Rae\nNigga act hard and get hit up in the middle of day\nTough guys and all that but I know that you pay\nAnd I don't give a fuck, niggas better watch what they say\n\n[Hook 2X]\n\n[Raekwon]\nBody specialist, full cam F50 with vans\nA pull up, do it to ya mans, yo scrams\nIf you take niggas ears, niggas ain't really queers\nListen, it's grown men in the town, niggas is their's\nFluck niggas, I cut niggas, stuck niggas\nCome up, pluck niggas, pop niggas in chucks, it's business\nYou in this? We non-shoulder style, son, relentless\nThey four lettered me Chef, nigga get down\nDrop you, piss on you, get this, it's official on you\nYo twist the clips hits, this was on you\nI'm just a business head ridin' with visual\nDon't force me to put out ya head\nOne for the money, two for the crime round up\nPeep it, all major niggas holdin' they ground, get up\nLet's form an army millenia, Ice Water!\nFrom Q.B. to Y.O. with Shaolin, I'm feelin' you\n\n[Hook 2X]\n\n[Break 4X: Raekwon singing]\nWe gon' ride for our team\nMy niggas'll kill you\n\n[Outro: Polite *over break*]\nFor the team, nigga\nMy niggas kill you, nigga\nY'all niggas want war? Nigga pop up!\nYeah ride for ya motherfuckin' team, nigga\nDeath before dishonor, you heard me?\nThe motherfuckin' Lex Diamond Story\nY'all niggas better wake the fuck up!\nYeah, Ice Water Inc., you heard me?\nD-Block, what up?\nPain, time and glory, word, you heard?\nYeah, yeah.. my niggas'll kill you, nigga!\nBitch-ass niggas!", "image": "https://images.genius.com/8703b73c19201fea3baccb6c300ec07e.1000x1000x1.jpg"}], "artist": "Raekwon"}