{"songs": [{"title": "Dangerous MC’s", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Notorious B.I.G.]\nYeah, ninety-six, for my Nostrand Ave niggas\nMy Fulton Street niggas (hardcore for ninety-six)\nDangerous MC's\n\nUhh (Check it out) uhh\nDiamonds on my neck, chrome drop-top\nChillin' on the scene, smokin' pounds of green\nOooh-wee, you see, the ugliest\nMoney-hungriest, Brooklyn Loch Ness\nNine millimeter cock test, wan fi' test?\nAnd the winner is...\n\n[Busta Rhymes]\nY'all niggas know the rules\nI blast on niggas so --\n\n[Verse 1: Notorious B.I.G.]\n-- my fist never bruise\nLand-still-cruise, Frank White paid his dues\nAsk who's the raw, bet they say Poppa very\nLook forward to me like commissary\nAll of a sudden, now every-body Big Willie\nDone did it, come widdit, get yo' head splitted\nOr get your neck slitted, admit it, you overdid it\nYour shit it, just ain't got that LOUD\nGold tooth shine like TaaDow!\nBiggie Smalls the illest and how, phrase raise your eyebrow\nBy now you figure, he talkin' bout that nigga\nBut your weak-ass assumptions, lead led to dumpin'\nIV to pump-in, you're feeling something\nCatch my drift, or catch my four-fifth lift\nAt least six inches, above project fences\nTurn meat to minces, jumps turn to flinches\nWhen I rain I drenches, cleared your park benches (HAH)\nMissed you by pinches (HOO) your talk is senseless (RRUFF)\nActor needs chiropractor (HAH, HOO) for cracked jaw\nYes, I rocked your chatterbox (Hah)\nDangerous you're not I gets down (HOO)\nTwist your body {*singing*} round and round, upside down\n\n[Hook: Busta Rhymes]\nC'mon, yo, throw your hands, c'mon\nBitch grab your tits, c'mon\nLet me know you in the spot\nBump your fists, c'mon\nThugs tote yo' shit\nWe bout to get mo' rich, c'mon\nLet's blow the club, c'mon\nFuck the place up, c'mon\nShake yo' nasty ass\nAnd make it swing all around, c'mon\nYo, make this money\nThrow yo' loot on the ground, c'mon\nBounce in your whips, c'mon\nBitch lick yo' lips, c'mon\nDangerous MC's\nMy nigga this be the shit, c'mon\nDangerous MC's\nMy nigga this be the shit, c'mon\n\n[Verse 2: Mark Curry]\nUh-huh, make money hand over fist\nThe bo-vines roam where chickenhearts don't exist\nSettin' up shop, it's hands on in the hustle\nFakes don't kill nuttin' but time and don't tussle\nThe process of elimination, fresh rotation\nCome and go and they death be starvation\nIn the heat of battle it's no rest for the weary\nSnooze and you lose is the theory\nThe theory of a patient man, is wild beyond belief\nBe afraid, you don't want beef with us chief\nYour talk is cheap and the supply meets demand\nEverything you can imagine is real man\nAnd revenge be the dish I serve to cats cold\nStay up on about ten folds, you know how it goes\nYou know the streets and it's real as shit, c'mon\nNiggas grab your dicks, c'mon\nBitches rub your tits, c'mon\n\n[Hook: Busta Rhymes]\nC'mon, yo, throw your hands, c'mon\nBitch grab your tits, c'mon\nLet me know you in the spot\nBump your fists, c'mon\nThugs tote yo' shit\nWe bout to get mo' rich, c'mon\nLet's blow the club, c'mon\nFuck the place up, c'mon\nShake yo' nasty ass\nAnd make it swing all around, c'mon\nYo, make this money\nThrow yo' loot on the ground, c'mon\nBounce in your whips, c'mon\nBitch lick yo' lips, c'mon\nDangerous MC's\nMy nigga this be the shit, c'mon\n\n[Verse 3: Snoop Dogg]\nAwww nah, big Snoop Dogg\nSlap you with my paw, all across your jaw\nBreak fool on these bitches while I'm breakin' the law\nYou come up in my room look bitch you takin' it off\nFollow me, I slip em slide em rip em ride em provide em\nWith that West coast G shit, L.B.C. shit\nWe dips to this, make chips to this\nAnd buy brand new whips and shit, uh-huh (Beyotch)\nI bet you didn't know that yo' bitch was suckin' dick (say what?)\nWho you think she fuckin' with? (What?) Look here\nMy, Eastside lifestyle is way foul, move the crowd\nPoint a pistol at you bitch niggas, BLA-DOW\n...How you like me now? (What, what, what?)\nYou got stuck and fucked, Doggystyle\n100 spokes Day-tonas, bendin' the corner\nAll up in Crooklyn, bad bitches are lookin'\n\n[Hook: Busta Rhymes]\nC'mon, yo, throw your hands, c'mon\nBitch grab your tits, c'mon\nLet me know you in the spot\nBump your fists, c'mon\nThugs tote yo' shit\nWe bout to get mo' rich, c'mon\nLet's blow the club, c'mon\nFuck the place up, c'mon\nShake yo' nasty ass\nAnd make it swing all around, c'mon\nYo, make this money\nThrow yo' loot on the ground, c'mon\nBounce in your whips, c'mon\nBitch lick yo' lips, c'mon\nDangerous MC's\nMy nigga this be the shit, c'mon\n\n[Verse 4: Busta Rhymes]\nSo you lovin' us so much this shit is bleedin' through you\nIf I worked in a restaurant, I'd shit in the food and feed it to you\nMost of my niggas cuckoo, easy to gas to shoot you\nEven all of them Haitian niggas won't believe this voodoo\nCan yo' pussy be chaka, don't let me speak in pat-ois\nAnd kick you in your face like we playin' a game of soc-cer\nI love to cock the Glock-a, stack up on loot and vod-ka\nAnd fuck your crew because all of y'all niggas full of ca-ca\nThe way we doin' damage tell me how the fuck you manage\nWith my niggas who marinate on foul thoughts and think savage\nThem niggas'll throw you in a manhole\nAnd push they hand in yo' ass\nAnd pull yo' head right out yo' asshole!\nParkay nigga we rugged all day nigga\nYou ready to fuck bitch? Fuck the foreplay nigga\nThis me for all consumers, my nigga FUCK the rumors\nThree in the worst way of pure coke for all you DRUG ABUSERS\n\n[Hook: Busta Rhymes]\nC'mon, yo, throw your hands, c'mon\nBitch grab your tits, c'mon\nLet me know you in the spot\nBump your fists, c'mon\nThugs tote yo' shit\nWe bout to get mo' rich, c'mon\nLet's blow the club, c'mon\nFuck the place up, c'mon\nShake yo' nasty ass\nAnd make it swing all around, c'mon\nYo, make this money\nThrow yo' loot on the ground, c'mon\nBounce in your whips, c'mon\nBitch lick yo' lips, c'mon\nDangerous MC's\nMy nigga this be the shit, c'mon", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}