{"songs": [{"title": "FLY", "album": "Pound Syndrome", "year": "2015-07-08", "lyrics": "[Intro]\nI was taught that education is the only way to make it\nThen how'd I get so much money inside my savings?\nMy teachers never saw the heights that I was fuckin' aimin'\nDid the man who invented college go to college? Hm, okay then\nAm I the only one that noticed humans on the same shit?\nY'all thoughts are sailin' on the same ship\nAnd if that's the case, then that's the reason that you ain't shit\nLet me enlighten you, my niggas, just let your brain drift\n\n[Verse 1]\nFirst of all, the best type of marketin'\nIs marketin' that doesn't feel like marketin'\nIt makes the people feel like they a part of it\nAnd when it's done right, corporations think it's marvelous\nThey feed us these ideas and then we place 'em in our hearts to sit\nIt's why players are good at gettin' chicks\nIt's why Nike is good at sellin' kicks\nIt's why Disney is loved by all the kids\nWhy McDonald's owners are super rich\nWe're too blinded to ever see 'em pitch\nSee, when this happens we take our health\nWealth, lives, and just hand them off\nThinkin' that we did this from organic thoughts\nI know you seen parents trick kids\nWith candy, toys and Santa Claus\nThe same method is used to trap adults\nBut instead of candy it's with money, religion, drugs and alcohol\nMention that shit and it's gon' arouse us all\nI done seen niggas get into fights\nOver cigarettes like a pack of dogs\nThey get you hooked and then they laugh at y'all\n\n[Hook]\nI really hate to break it to you\nBut your life's being played with\nYou have not witnessed the world\n'Cause you're stuck in the Matrix\nEverything we have been taught was all a lie\nOpen your eyes, open your mind, and fly!\n\n[Verse 2]\nMan, can't you see we're robots\nWho know not what we do and we got no shot\nIn the real world until we climb out of this ice-cold box\nYour whole life has been part of a whole plot\nTo keep you at the bottom while they on top\nStay quiet, then they won't stop\nThey always tryna show us what we don't got\nThey do it to all of us 'til we finally break and go cop a gold watch\nKnowin' we need the cash for rent, my ass is sick\nJust thinkin' about how rich and powerful all these bastards get\nThey package ideas like it's oxygen\nThey make us feel like if we ain't got it we're fucked and we cannot fit in\nThis fuckin' system is not your friend\nAnd understand they controllin' your thoughts 'cause they got a lot to win\nNiggas get turned away when I mention this\nIgnorance is bliss, but I don't give a fuck, I won't censor shit\nThe Matrix is real and you done entered it\nIt's way too intricate for you to ever realize it you fuckin' simpleton\n\n[Hook]\nI really hate to break it to you\nBut your life's being played with\nYou have not witnessed the world\n'Cause you're stuck in the Matrix\nEverything we have been taught was all a lie\nOpen your eyes, open your mind, and fly!\n\n[Verse 3]\nYo, fuck Hollywood! Fuck all these reality shows!\nMakin' us feel lame unless we blowin' stacks on new clothes\nMakin' us feel like we ain't cool unless we have a few hoes\nMakin' us feel like we ugly unless we have a new nose\nI see naturally beautiful women get Botox, fake tits\nFake lips, they so brainwashed and it doesn't make sense\nFocus on your life and the path you're pursuin'\n'Cause y'all too busy worried about what Kim Kardashian's doin'\nCheck it, most of this shit that you sheep are watchin' on television\nIs fake as fuck and is not real, I rebel against it\nIt's the Devil's business, they just reel y'all in\nIf they say it we do it, yo I'm tryna tell y'all, man\nThe system created the stereotype for the Black image\nThat's why my people are scared to be different\nWhy don't you get it? I'm done practicin' these ridiculous rituals\nIt's time I become a real individual and just do me\n\n[Hook]\nI really hate to break it to you\nBut your life's being played with\nYou have not witnessed the world\n'Cause you're stuck in the Matrix\nEverything we have been taught was all a lie\nOpen your eyes, open your mind, and fly!\n\n[Outro]\nUse your mind, be yourself\nDon't blame nobody else but you\nYou and the meaning of life\nHas no rules, no rules, no rules\nFly away! Fly away! Away, away, away!\nLife's too short not to live it\nThe world is all yours, come get it\nJust go and get it, it's beautiful", "image": "https://images.rapgenius.com/4f3a110830b39218fb65f427773bae28.960x960x1.jpg"}], "artist": "Hopsin"}