{"songs": [{"title": "The Birth", "album": "Birth of a Prince", "year": "2003-10-07", "lyrics": "[Intro: RZA, Daddy-O]\nYeah, you know what I mean?\nCause yo, this right here this is called Knowledge of Self\nWhen you apply that to yourself, you know yourself\nYou know what I'm saying?\nYo; it's gonna get your third eye open\nYou can see things for what they are\nAnd not what they appear to be\nWhen the God gave me the knowledge\nAnd pass this information to me, it's just-\nWhatever, the God right there\nYo Peace, Born Knowledge, Peace God\nPeace what up Bobby?\nYo, yo, don't even call me Bobby no more, man\nWhat I call you?\nMy name is Prince Rakeem, you know what I'm saying?\nWhat's Today's Mathematics?\nI see Today's Mathematics is being wisdom\nLet me explain like this to you God, how I see it\n\n[Hook: female singer sample]\nEver since my Birth (don't worry!)\nI've had no one to care (worried all I know... yeah!)\n\n[Verse 1: RZA]\nThey say wisdom, is the wise words spoken\nBy a brother attemptin' to open\nThe graves, of these mentally dead slaves\nWho've been lost on a cross, for decades\nAnd centuries, lookin' for the liberty\nBut receive nothin', but misery\nAnd hard times, and things of that nature\nBy the devil in a genocide caper\nLittle Boy Peep, has lost his sheep\nBut I found 'em, in a deep long sleep\nNine thousand miles away from home\nLivin' the life of a modern-day Flintstone\nWe the people, supposed to be equal\nBut the men who wrote that, they was evil\nSlave owners, who did not include us\nThey just used us, and abused us\nFirst they trick you, then mentally kill you\nAnd use technologies, to rebuild you\nThis whole plan was a perfect scam\nSee that's why they called it, the Six Million Dollar Man\nSix is the limitation of the Devil\nIn the Million square miles of land that he settles\nPut you in a three piece suit, give you loot\nChemicals in your head to make you look cute\nThey use you as a fool to deceive your own people\nAnd fillin' my children head with pins and needles\nBut I'll take out the pins you inserted\nAnd I'll avenge all my mothers that you murdered\nAnd brutalized, by this modern form of slavery\nTo speak the truth it takes bravery\nAnd no man could stop my flow\nBecause I know what I speak and I speak what I know\n\n[Hook: RZA]\nWhat, becomes of a broken family?\nDreams are crushed and there's no more family\n\n[Hook 2X with RZA]\n\n[Verse 2: RZA]\nYo, as a life can be slowed down 20 frames per second\nSeen through Panavision\nThe inner light inside my mind's shines expands the prism\nA man of wisdom, victorious and the glorious\nSight beyond sight we stand up as Divine Warriors\nWho smite with the mighty right hand of God\nYield the holy sword, swings the holy rod\nThen bathe in the pond of Nirvana, escape the realm of Karma\nAllow the true grace of God to shine through my persona\nAnd build the reconstructional terms that's constructive\nAs we destroy the negative germs that's destructive\nProductively, sincerely, we uphold the righteous banner\nWith the gold touch of Midas, mold the righteous hammer\nAnd anvil, to the sound of Man-drill\nIgnite to the speed of light cause time to stand still\nRewrite the script of Egypt, who made the Holy Bible\nOr Koran, how long ago, who made the Holy Title?\nOf I Self Lord And Master, who control the vital\nParts of your heart, who wrote the wise recitals?\nRuler Zig-Zag-Zig Allah, Arm-Leg-Leg-Arm-Head\nStill puzzled like the jigsaw\n\n[Hook to fade]", "image": "https://images.genius.com/3ea7f9dba1bfae454b7dbda9dd07a73d.360x354x1.jpg"}], "artist": "RZA"}