{"songs": [{"title": "Ready or Not", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Intro: DJ Drama & Meek Mill]\nMaybach Music!\nThey say your brain's most creative in your sleep\nSee, they say, in the sleep state\nThe brain thinks much more visually and intuitively\nHa, what is this? (Maybach Music)\nI like this Maybach Music! Swate!\nAs dreamchasers, we accomplish that wide awake\nTurn everything up a lil bit in the headphones!\nYou ready? (All-Star!)\n\n[Verse 1: Meek Mill]\nReady or not, here I come\nYou can't hide, nigga I'm too damn fly\nSippin' all of this purple, it got me too damn high\nThey say they're down for the team but playin' two damn sides\nI'm like niggas ain't loyal (no!), niggas ain't loyal (no!)\nAnd these voices in my head saying niggas ain't for you (nah!)\nAnd when you gettin money these niggas will aim for you (fire!)\nAnd when its looking sunny these niggas will rain on you\nIt's a dark cloud over me, money took control of me\nI'm barely getting time to see my son and that shit hurting me\nBaby momma trippin out, I tell her to work with me\nI'm on probation still strapped, 'cause niggas want to murder me\nAnd lately I've been getting faded (faded)\nCut a couple homies off cause them niggas hating (they hating)\nAnd all these bitches wanna fuck me\n'Cause a nigga made it (I made it!)\nI'm getting paper heart cold as the refrigerator\n\n[Chorus: Meek Mill]\nYoung nigga getting money\nYoung nigga getting money\nYoung nigga go and get it yeah\nAnd ain't a damn thing change but the bezel on my Rollie\nAnd the diamonds in my chain, yeah\n\n[Interlude: DJ Drama]\nAs dreamchasers, we consider ourselves a creative upper class\nWhen it comes to ideas, we're just in a different tax bracket\nGangsta Grillz, you bastards! (Gangsta!)\n\n[Verse 2: Meek Mill]\nYoung rich nigga quarter millie worth of jewels (jewels)\nBad bitch with me trying blow me like a fuse (fuse)\nJust to get a bag or maybe a pair of shoes (shoes)\nAin’t it crazy what your lady would do for a pair of Loubs, huh?\nBig dreams turn to big things (things)\nI’ve been waiting on this day since I was 16 (16)\nBig chains, Aston Martin as I switch lanes (skrrt!)\nBefore I ever made a hit, I had a wrist game\nIn the kitchen with them thangs, trying make a killing (killing)\nWe in the building, every other month I make a million (yeah!)\nAny nigga talking reckless cause they think I’m chilling\n'Til I put some money on their head, yeah, make 'em feel it\nHave they own homies do him like they never knew him (fire!)\nI'll have Omelly walk up on him when we run into him (fire!)\nClose range shorty have him put something through him\nSo I hope your ready cause we heavy and we're coming for you\n\n[Chorus: Meek Mill]\nYoung nigga getting money\nYoung nigga getting money\nYoung nigga go and get it yeah\nAnd ain't a damn thing change but the bezel on my Rollie\nAnd the diamonds in my chain, yeah\n\n[Interlude: DJ Drama]\nDreamchasers 2\nWe decided to share the wealth again\nCare to join us?\n\n[Verse 3: Meek Mill]\nThe meek shall inherit the earth\nSo I’ma own this bitch until I’m buried in dirt\nI only roll with niggas that'll carry me to my hearse\nBlesses for my grandma, she carried me to that church\nAnd I don’t know why, I just feel like I’m the one (one)\nThey label me a victim but now look what I become ('come)\nOr should I say became, I don’t do it for the fame\nI’m from where they never make it but I went against the grain\nCharges riding against my name, assasination to my character\nLife’s a bitch, she cheated on me but I married her\nNiggas getting murdered, this shit is getting scarier\nDodging all the potholes, jumping all the barriers\nAnd if she a bitch, I feel like I just got in that pussy (yeah)\nShorty wanna be a star, that’s why she popping that pussy\nShe trying to win, so she hang amongst winners\nThat’s why I take the time just to pray at mom’s dinner (I pray)\nCause I remember, cold nights not the winter (not the winter)\nNot the weather, I’m talk about within us (within us)\nCause for that money, sins they get committed\nAnd friends, they get to splittin', divided just like division\nSo every day that I wake up, my undivided attention\nIt goes to getting my cake up and staying out of them prisons\nYeah! The system made me stronger\nAnd being broke just gave me my hunger, I'm gone!\n\n[Outro: Meek Mill]\nNigga like me?\nI walk around, fear no man (no man!)\nI don't owe you niggas shit! (shit!)\nE'ry nigga you see around me\nThat's the niggas that's with me (my niggas)\nUnless they in jail or dead or something\nNigga livin' life like, \"Fuck all you niggas\"\nYou feel me?", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}