{"songs": [{"title": "Uncomfortable", "album": "WATER (We Are The Enemy Really)", "year": "2015-12-04", "lyrics": "[Hook]\nMy creator\nMy creator, my creator, my... creator\nYah!\nMy creator, my creator\nMy creator, my creator, my...creator\nYah!\n\n[Verse 1]\nMy creator said I'mma forever love ya\nThrough the good and the bad and the ugly\nMy creator dun't never hold grudges\nMy creator only one could ever judge me\nMy creator of conscious was here first\nIf I'm not conscious the universe was birth\nMy favorite plant in the dirt\nBut how that make something illegal that grow up out the earth?\n\n[Hook]\nMy creator, my creator\nDid you ever get the prayers?\nA few of us just had a couple questions for ya\nA few of us just wanna ask you for a favor\n\n[Verse 2]\nMy creator you gon' sit around and watch?\nMy creator you can make all of this stop\nYou ever notice for a second we in trouble?\nYou probably think that we all just a bunch of fuck ups\nIf you was human, what would be your skin color?\nWhy you let them take MJ from us?\nWhy you ain't tell MLK take cover?\nMy creator I'm really starting to wonder\nMy creator\n\n[Hook]\nMy creator, my creator, my creator, my... creator\nMy creator, my, my creator\nMy creator, my creator, my... creator\nYah!\n\n[Verse 3]\nOh shit, this like the part in The Matrix when he take the red pill and he wake up and go ape shit\nThey told us we evolved on some ape shit\nBut I guarantee ya Charles Darwin was a Mason, damn\nThey like you humans so peculiar\nYou just appeared after a big bang of gas and started fumin' together to make life\nDon't need to think twice\nThere's nothin' bout you special. You basically sand mites\nOn this tiny fuckin' speck of dirt called Earth\nThe only sign of life in the entire Universe\nOh and every star's a billion, trillion miles away\nSo how the fuck we got a picture of the Milky Way?\nBam\n\n[Outro]\nMy fellow Americans, we have just discovered a new planet\nUhh.. Although we spent dozens and dozens of years researching and billions and billions of tax payers money researching space and exploring space science, we just saw this planet. We overlooked it. It was hiding behind a blackhole or something, I don't know. But.. but, uhh..  here, he- here are the images\nWhere are the images? You got the images?\n\nSo, here, here are the images clearly as you can see\nIt's about 8 light years away. Uh.. how do we have pictures?\nUh.. We have, we have super fast, we have million mile internet. Faster than anything Earth has seen, but we just use it for to explore space\nUh.. but I tell ya, yanno you can look at these pictures yourself\nWe got all the planets. Uh.. but theres nothing out there\nI mean, HA! I tell ya, there's nothing out there\nYanno we're gonna keep spending money and keep looking\nWe're gonna keep sending cameras into space\nWe're gonna keep sending fucking astronauts into space\nWe're going to keep going out there and keep sending back CGI\nPictures - I mean, cough cough...\nWe're gonna keep sending back pictures\nJust to let you guys know you're alone\nYou're alone\nAnd you're insignificant creatures\nSigning off", "image": "https://images.genius.com/0fb63f56a90a658f950a838126f7ce63.800x800x1.jpg"}], "artist": "B.o.B"}