{"songs": [{"title": "Stop Snitchin", "album": "Laugh Now, Cry Later", "year": "2006-06-06", "lyrics": "[Ice Cube]\nIce Cube (yeah!) Callin from a California state penitentiary\n(Let me out this motherfucker)\nWe got over two million motherfuckers locked up\n(Let me out this motherfucker) Stop snitchin\n\nNow how many MC's must get booed\nBefore somebody say don't fuck with Cube (you know!)\nI'll strip you nude (butt-ass) in your living room\nFace down, paralyzed from the waist down\nI'm a buckin clown, but don't fuck around\nDoin movies now, but I'll lay you down\nSouth Central style, pull them thangs out\nDon't make a millionare have to send you there\nYou know the story of the tortoise nigga and the hare\nNigga run nigga run never get there\nI'mma walk, fuck a bitch when I get there\nNigga this a marathon, ask Farrakhan\nFuck the cemetery that I'm buried on (fuck 'em)\nThe blood of Ice Cube got to carry on (forever)\nForever what the fuck are they yellin?\n\"Gangsta Gangsta,\" nigga stop tellin - stop snitchin\n\n[Hook]\nYou can have whatever you want\nIn the hood, it's do's and don'ts\nSo when it get hot in this kitchen\nStop snitchin, nigga stop snitchin\n\n[Ice Cube]\nMicrophone master, super rhyme maker\nGun blaster, who's the life taker (who?)\nWho the fuck is a lifetime Laker?\nI slap the Maybeline off Tammy Faye Bakker\nWho the fuck got more than an acre?\nIn Los Angeles I got to have paper\nI'm a nigga, don't talk to my neighbors\nStraight asshole, always up in Vegas (yay yay)\nLay it out for these niggas to follow\nGet the point, but these points is hollow\nNow this here, is hard to swallow\nBut if you do it's like hittin the lotto\nLittle nigga with big bravado\nHit the throttle niggas hit the bottle\nCan give a fuck if they life is hollow\nWhere the fuck was you, when I rocked the Apollo, bitch?\n\nAy, who put this thing together? Me, that's who\nWho I trust? Who I trust? ME, THAT'S WHO!\n\nNigga nigga nigga, can't you see\nSomehow your words incarcerate me\nFloat like a butterfly, sting like a bee\nLock me up in my prime, Muhammad Ali\nGet out whup yo' ass like Muhammad Ali\nRumble in the Jungle, nigga don't play Dumbo\nIn the hood nigga known as Columbo\nGet the people on the phone, tell the jumble\nSpit fluid and swear he didn't do it\nGot my bottom bitch locked up with Martha Stewart\nShe say she had the ho cookin deep dish\nShe say Martha fuckin cook fish and eat fish\nWestside y'all niggas got to peep this\nThat's your weakness, can't keep a secret\nDon't say shit, boy that's basic\nThey want to send a nigga back to the slave ship\nStop snitchin\n\n[Hook]\n\n[New Hook]\nYou can have whatever you choose\nBut out here, it's don'ts and do's\nSo after we finish this mission\nStop snitchin, nigga stop snitchin\n\n[SB] Okay, okay\n\n[Swizz Beatz: repeat 4X]\nOne two, in the place to be\nYou rockin with Ice Cube, and the homey Swizz Beatz\n\n{Keep your fuckin mouth shut man}", "image": "https://images.genius.com/c4141aa982e145b56c3c52c3fbd1c258.1000x1000x1.jpg"}], "artist": "Ice Cube"}