{"songs": [{"title": "Slide N Slide Out", "album": "Against the Grain", "year": null, "lyrics": "[Intro/Hook One: repeat 2X]\nSlide in, slide out, that's how a real gangsta move\nYou can tell by the way I'm smooth (I'm smooth)\nBut at the same time actin a fool (actin a fool)\n\n[Verse One]\nI'm a West coast rider, California rider\nI'll put that on my riders, I'ma keep it rider\nAnd keep it low key, to smash on these motherfuckers\n'fore they smash me, I'm a California rider\n\n[Verse Two]\nI'm a West coast rider, California rider\nAn Eastside, L.A., South Central rider\nInglewood rider, spit it how I live it\nI'm a rider and if I ain't got it I gotta get it\nDon't make me act a fool (fool)\nKick back lil' homey \"B\" cool, or \"C\" cool\nYeah, it's however you wanna take it\nI'ma rider my nigga you must got me mistaken\nWith them other niggas over there, Daz you a rider?\nNigga you scared, a bitch in disguise\nWith a fade and a beard, Kustapo Pentagon riders\nPlus we authentic over here\nWe don't gotta blast, to kill each other off\nWe can go hands nigga I'll show you who the boss\nI'm a West coast rider, California rider\nAn Eastside, L.A., South Central rider\nInglewood rider, spit it how I live it\nI'm a rider and if I ain't got it I gotta get it\n\n[Hook Two]\nSlide in, slide out, that's how a real gangsta move\nTanktop, corduroy, house shoes (house shoes)\nI'm a gangster that just can't lose, yeah\nSlide in, slide out, that's how a real gangsta move\nTanktop, corduroy, house shoes (house shoes)\nI'm a gangster in my gangster shoes, nigga\nSlide in, slide out, that's how a real gangsta move..\n\n[Verse Three]\nI cain't get enough of the block\nI cain't get enough cause I'm stuck on the block\nI'ma Y.A. ride 'til I'm dead on the block\nEntourage 'til I'm gone watchin me until I drop\nGot a pocket full of stones, walkin up and down the block\nSee the cops at the corner, real niggas never stop\nI see death around the corner so I'm hangin on the block\nWhen I'm gone to the coroner they'll leave me on the block\nI was wrong, got a problem, you can see me on the block\nThat's home, Thunderdome, you can meet me at the spot\nProbably catch you at the club sippin Henny on the rocks\nCatch you walkin out the club knock your ass out the box\nI'm a gangster nigga\n\n[Hook One]\n\n[Verse Four]\nI'ma gang-sta ride (that's right)\nAnd gang-sta glide (and glide)\nI'm gang-sta-fied, I live a gang-sta life\nG to T, that's all I know\nAnd blowin on dicks, is all she know\nShe a ho, and baby give me head on the spot\nShe a sucka for a nigga hardhead from the block\nDear God, don't let a young nigga die broke\nI hold my pistol with pride with every 9 I toke\nIt's a tear I done shed\nAnother black male on the stairs laid dead\nWhat more could I do?\nMove up, nigga ain't no rules in the hood\nToo many drugs used in the hood\nWe all young black and abused in the hood\n15 years old, they got him doin life\nNo sense to keep cruisin I'ma keep cryin\nThe judge got a grudge, the D.A. lyin\nYou gotta give him mercy, Lord let him breathe\nGood or bad seed he a seed in the soil\nHold your head soldier I'm right here for you\nAnd that go for all my homeboys - yuh!\n\n[Hook Three/Outro]\nSlide, slide, roll 'n ride\nFront 'n back, side to side\nPimpin baby side to side\nSo many come to where riders ride\nSlide, slide, roll 'n ride\nFront 'n back, side to side\nPimpin baby side to side\nKeep it hood, riders ride\nSlide, slide, roll 'n ride\nFront 'n back, side to side\nPimpin baby side to side\nDeath Row how them riders ride\n\n[Verse Five - fading out]\nYeah, they don't wanna see the Y.A. ride\nThey don't wanna see cellmates rise\nThey don't wanna see the Pentagon rise\nThey don't wanna see the entourage ride\nThey don't wanna see Death Row ride\nThey don't wanna see..", "image": "https://images.genius.com/901ee868384c5cb1f3a23f4bff250845.500x500x1.jpg"}], "artist": "Kurupt"}