{"songs": [{"title": "Drove U Crazy", "album": "The Return of East Atlanta Santa", "year": "2016-11-25", "lyrics": "[Intro]\nHuh, yeah, it's Gucci\nTiller! Brr! Brr brr!\n\n[Verse 1: Gucci Mane]\nPull up in a Lam', it'll drive you crazy\nHad to cut her off cause the bitch too lazy\nShe wanna ride the wave, but my waves too wavy\nAnd your car too slow, you need to drive Miss Daisy\nJumped out the feds like \"fuck you, pay me\"\nGot her foaming mouth like the bitch got rabies\nGot me running out the spot like the spot got raided\n'Cause I'm so much different then the nigga you dated\nSmiling in the camera like, \"Bitch, I made it\"\nBig Guwop got the whole club faded\nGot a bitch so bad that my ex bitch hate it\nTell me how you feel when you see me skatin'\nNah, you don't call me baby\nWe ain't finna go to the mall,Ms. Lady\nWhen you leave me feelin'-n-n-n-n standing tall, Ms. Lady\nLike can you take it, take it, take it all, Ms. Lady?\nNever get a love like this\nNever ever, ever meet a thug like this\nNever met a plug like this\nNever seen a nigga in the club like this\nNever hug like this\nNever pour Ace of Spades in the tub like this\nNever got drunk like this\nOr beat from the back on the rug like this\n\n[Hook: Bryson Tiller]\nWhat? Tell 'em how crazy I drove you\nTalk about how crazy you drove me\nTalk about them favors you owe me\nTalk about them\nTalk about them lies you told me\nTalk about true colors you showed me\nTalk about them, what?\nTell 'em how crazy I drove you\nTalk about how crazy you drove me\nTalk about them favors you owe me\nTalk about them\nTalk about them lies you told me\nTalk about true colors you showed me\nTalk about them\n\n[Verse 2: Bryson Tiller]\nAye, lil' mama say she fuck with me tough, yeah\nLil' mama say she fuck with me tough, yeah\nHer ex-boyfriend's words cut deep\nAye, Young Tiller in the cut, yeah\nAye, Young Tiller goin' up, yeah\nAt your head with that uppercut, yeah\nI'm still on the motherfuckin' come up\nBut y'all already know where I'm from, yeah\nStraight from the 502, hey\nSouthside Dirty, I grew, hey\nNow they wanna show my moves, hey\nEvery little thing that I do and say\nMy old bitch said she need closure\nI just think she wanna get closer\nI just think she want some exposure\nTell people how crazy I drove her\nTell people all the dreams I sold her\nI'm sorry, you cannot lean on my shoulder\nI already got too many burdens\nMost of them 'bout to give to my attorney\nI got too many niggas in my face now\nThis ain't the time 'nor place now\nThis for my niggas that stay down\nFuck all you niggas that wanna hate now\n\n[Hook: Bryson Tiller]\nWhat? Tell 'em how crazy I drove you\nTalk about how crazy you drove me\nTalk about them favors you owe me\nTalk about them\nTalk about them lies you told me\nTalk about true colors you showed me\nTalk about them, what?\nTell 'em how crazy I drove you\nTalk about how crazy you drove me\nTalk about them favors you owe me\nTalk about them\nTalk about them lies you told me\nTalk about true colors you showed me\nTalk about them\n\n[Outro: Gucci Mane]\nHuh, Tiller, Gucci, huh, brr! whoo, it’s Wizzop, huh!", "image": "https://images.genius.com/e346585343669f785da446478e1db2aa.600x600x1.jpg"}], "artist": "Gucci Mane"}