{"songs": [{"title": "New One", "album": null, "year": "2018-11-02", "lyrics": "[Intro: Ty Dolla $ign]\nOh yeah\nOoh yeah\nDolla Sign\nMustard on the beat ho!\n\n[Chorus: Ty Dolla $ign]\nIf she a freak then Imma find out, I don't know but Imma find out\nI'm in the club with a bool one, but I'm looking for a new one (a new one, yeah)\nLooking for a new one, a new one yeah\nI want a new one, yeah yeah\nLooking for a new one, yeah\nYeah, yeah\n\n[Verse 1: 2 Chainz]\nHere we go!\nIf she a freak Imma find out, I don't know but Imma find out\nAnd she ain't got no class, had to put that bitch on time out\nI just fucked her in the living room, pussy so deep I had to climb out\nAnd she never seen my bedroom, she ain't ever seen my momma house\nCheck a hoe, then I check my bank account\nI'm sipping codeine with my pinky out\nAnd I don't talk about bitches man, unless the head good enough to think about it\nSo hold on let me think about it\nWait a 1 minute, let me think about it\nShawty pussy so wet mane, I mean a bitch need a sink around it\n\n[Chorus: Ty Dolla $ign]\nIf she a freak then Imma find out, I don't know but Imma find out\nI'm in the club with a bool one, but I'm looking for a new one (a new one, yeah)\nLooking for a new one, a new one yeah\nI want a new one, yeah yeah\nLooking for a new one, yeah\nYeah, yeah\n\n[Verse 2: Lil Wayne]\nShe had some coke, she spread some lines out\nShe said don't tell nobody, I be mimed out\nShe unzip my pants and pull slime out\nShe said Tunechi you a beast, let me find out\nAss everywhere, ass everywhere, pull up in that thing you never saw, parallel\nTime to fuck a bitch, I never fuck\nWhere the fuck she at?\nI be standing like some colored clothes, blame the Laundromat\nWho you see?\nI walked in this bitch with a cute bitch\nAnd we gon' leave out this bitch with a new bitch\nMan I'm just stickin' to the bread like a toothpick\nNigga gon' head, cut that hoe if she don't do shit\nLick her like a fine bitch that find bitches\nShout out to all my side bitches\nYoung fly nigga thats jetlag, you don't know about time difference\nI rhyme different, I'm so hard I could do a verse and leave a line missing\nTunechi!\n\n[Chorus: Ty Dolla $ign]\nIf she a freak then Imma find out, I don't know but Imma find out\nI'm in the club with a bool one, but I'm looking for a new one (a new one, yeah)\nLooking for a new one, a new one yeah\nI want a new one, yeah yeah\nLooking for a new one, yeah\nYeah, yeah\n\n[Verse 3: 2 Chainz]\nJust bought a new crib, need a new one\nGot an old school red and a blue one\nMe and my niggas got fur coats on, make it look like the fucking zoo coming\nTold my old bitch I need a new one\nSold my last brick, I need a new one\nShe always talking about working out, so I stretched her out like a futon\nFuck my last bitch on a coffee table (ya dig!)\nFuck my new bitch on a hockey table\nIf this is a Miyagi hoe [?] I got like a hunnid flavours\nIf you don't know, you better find out\nBat cave, honeycomb hide out\nI slip in and I slide out\nI'm known to go deep, like a white out\n\n[Chorus: Ty Dolla $ign]\nIf she a freak then Imma find out, I don't know but Imma find out\nI'm in the club with a bool one, but I'm looking for a new one (a new one, yeah)\nLooking for a new one, a new one yeah\nI want a new one, yeah yeah\nLooking for a new one, yeah\nYeah, yeah", "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg"}], "artist": "2 Chainz"}