{"songs": [{"title": "Sun God Sam & The California Drug Deals", "album": "DROGAS WAVE", "year": "2018-09-21", "lyrics": "[Verse 1: Lupe Fiasco]\nCompose yourself, like a self-aware opera\nConjurer, in the zone like Sonic to\nProduce me a sign of the end-times\nIn time to make profit off the T-shirts\nAnd monetize all the research\nAnd leave Earth feet-first\nBreech, behold\nWhites get whiter in the cold\nAnd colors don't fade in the bleach, hah\nApplause then fall through a man-made south\nTalking to a doll at the pancake house\nThen bring the lightsaber-ers\nSo bring the lampshades out, mood\nTo say something lewd on the news\nAnd move like views on a cruise\nAnd fuse like the Q’s and the U's\nAh, ooh, ah, ooh\n\n[Chorus: Lupe Fiasco & Nikki Jean]\nWhich side are you on?\nAm I getting warmer? Cause I can't hold on\nAre you close to me? Sunset so long\nAnd can you call me? Cause I lost my phone\nShould I wait for you? Or should I go home?\nI can’t function, these drugs are too strong\nI'm seeing stars now, but I'm still unknown\nOut here alone, sunset so long, so long\n\n[Verse 2: Lupe Fiasco]\nMates for life, chillin' like space with ice\nHigh as a cape\nSnakes hiss, like air at the Sinclair\nWhen you put it in they face like skin care\nBut they just egg 'em on like a hen chair\nI've done that, I've been there\nThis a comeback, let me unpack\nAnd unwrap souvenirs\nFree as a speech on the untap\nFlat like time on the run\nWhy you bring a holster to a gun rack?\nThat's the alpha and omega, that’s the vodka and the vomit\nWhy you playin’ soccer with the Sonics?\nThat's a iPod to the Amish\nYou should get involved with the honest\nWhere everything’s honored like Elijah Muhammad\nMixed with the pontiff, hooked on phonics\nLet's be liars, that's not chronic\nCondone Islamic, and it's haunted, ay\n\n[Chorus: Lupe Fiasco & Nikki Jean]\nWhich side are you on?\nAm I getting warmer? And I can’t hold on\nAre you close to me? Sunset so long\nAnd can you call me? Cause I lost my phone\nShould I wait for you? Or should I go home?\nI can't function, these drugs are too strong\nStro-, stro-, stro-, stro-, stro-, stro-, stro-, stro-\nStro-, stro-, stro-, stro-, stro-, stro-, stro-, stro-\nStro-, stro-, stro-, stro-, stro-, stro-\n\n(I've always loved you)\n\n[Verse 3: Lupe Fiasco]\nSun god Sam and the California drug deals\nRain drop Wayne and the Bangkok love bills\nHoin', she knows that I'm crooked like Owen\nBut still goin' like a paradox, parasite, know it ain't right\nWhere the fan? Now she knows that I'm horny like Triceratops\nTogether, but separated like a pair of socks\nWow, like Pac using both hands\nAnd his head is the O\nI only follow escorts now, call it sticking to the program\nFucking all the police addicted to the pole dance\nC'm'here like Pol Pot\nYou love it over here like gold watch\nI would treat the box like it's UPS, I would treat the box like a sneakerhead\nIf you shake and throw it like a match with a cigarette\nThen drop it like a match on a gas trail\nFix another round for the mob, you the bomb\nLike Jihad, up and down 'til the guards of the back fell\nStill wanna, put my meat up in your V like I'm Maxwell\nStick a fork in it, dog, it's important to y'all\nBut it's pork in it so it ain't important at all\nSaw an underground lair with a torch in the hall\nWhen unfortunate calls from the horoscope cards\nAnd the fortunes and balls\nOutfit so small, saw a portion of drawers\nCareer slide off the track and put the Porsche in the wall\nLike skrt, skrt, skrt, skrt, skrt, skrt\n\n[Chorus: Lupe Fiasco & Nikki Jean]\nWhich side are you on?\nAm I getting warmer? Cause I can't hold on\nAre you close to me? Sunset so long\nAnd can you call me? Cause I lost my phone\nShould I wait for you? Or should I go home?\nI can't function, these drugs are too strong\nI'm seeing stars now, but I'm still unknown\nOut here alone, sunset so long, so long", "image": "https://images.genius.com/86aa1a0cb9e9a473ce83eb531fa78079.500x500x1.jpg"}], "artist": "Lupe Fiasco"}