{"songs": [{"title": "I’m Back", "album": null, "year": null, "lyrics": "[Rakim]\nYeah, with no further adieu\nYou know who it is\nUh, ghettos across the world\nYo this is what they want\nNew York City, it's what they need\nEast Coast to West Coast, it's what it is\nAcross seas, worldwide baby\n\n[Verse 1 - Rakim]\nAiyyo we stuck in a time of drought, nothin to rhyme to about\nGhetto of crime on the grind, pull an iron out\nIndustry cryin out, major labels buyin out\nWho put the fire out? Real Hip Hop is dyin out\nSound like the perfect time for Ra to set off the new beginnin\nLet me finish where Nas left off\nI went to L.A. to get with Dre, we tried to bridge the gap and\nTake night, mix it with day, I guess it wasn't meant to happen\nMy move, a lotta dudes hope I lose but it's cool baby\nI'm like Ray, I make it \"Do what it do\" baby\nBounce like medallions till it's off the chain\nAnd I remain up in the lab till it's engulfed in flames\nJust call me \"Too Hot\", the same old hood look like a new spot\nA new block, like Times Square and Forty Doo Wop\nWithout the gun on my Hip, I bring the new Hop\nFor Scott LaRock, Freaky Ty, L Eye, Biggie Smalls and 2Pac\n\n[Hook - Lil' Fame]\nSo where my goons at? - Stand up! We right here!\nWhere my thugs at? - Stand up! We right here!\nAnd all the OGs - Stand up! We right here!\nBounce for yourself homie, make yourself be heard\nBut you don't have to dance, play it cool and listen\nCause you know what this is, we give 'em the business\nYour crew is number 1 if not best and better\nHere's a hit, The 18th Letter\n\n[Verse 2 - Rakim]\nThis is hell and hell is where the storm is, drugs sellers killed for cornets\nDeath is here to haunt us, the president's still in office\nThe heavens hear the horrors, and let us feel what war is\nDeadly weather spill before us, to sever seals upon us\nRakim up here begin to fear the end is here, your goners\nStiff as Rigarmortis, now let 'em feel the chorus\nThe God spit, I'm still here y'all, stick for real performance\nRecord deals and tourin, my rep is still enormous\nI hit the block or party and mommies be watching pappy\nThe show get smashed, photographed by the paparazzi\nMy army's on it highly, don't bring no drama by me\nIt's deadly, period, point-blank slash kamikaze\nThe alpha and omega, no doubt an innovator\nIn front of your bodega it's the style originator\nYou doubters and you haters, Ra bout to end your data\nWith writer's block, I'm off the top without the pen, no paper\nThe archaeologist let y'all acknowledge it\nThen I start the apocalypse, then watch the god demolish it\nI heard the news, there's a dude they wanna hear from\nTake it from square one, lace up them air ones\nThen bring the new commandments to the planets\nFor livin life in the hood and for the music fanatics\nIt's for dimes and dons and for my love of writing songs\nWhen the club mic is on I'm on my justice cipher, hold back\n\n[Hook - Lil' Fame]\nSo where my goons at? - Stand up! We right here!\nWhere my thugs at? - Stand up! We right here!\nAnd all the OGs - Stand up! We right here!\nBounce for yourself homie, make yourself be heard\nBut you don't have to dance, play it cool and listen\nCause you know what this is, we give 'em the business\nYour crew is number 1 if not best and better\nHere's a hit, The 18th Letter", "image": "https://images.genius.com/6699b3c41af3d4ee6ce799b3b558d845.400x400x1.jpg"}], "artist": "Rakim"}