{"songs": [{"title": "Stronger (Demo/Lost)", "album": null, "year": "2014-07-11", "lyrics": "[Hook]\nN-now th-that that don't kill me\nCan only make me stronger\nI need you to hurry up now\nCause I can't wait much longer\nI know I got to be right now\nCause I can't get much wronger\nMan I've been waiting all night now\nThat's how long I been on ya\n(I need you right now!)\n\n[Verse 1]\nWhen the fast life takes its tole\nThat act right makes everything slow\nThem black lights make everything glow\nOne of those nights where everything goes\nEverybody goes through something\nPeople be talking to you like you nothing\nThen you be like bitch I'm me\nThen your boss be like bitch then leave\nYou covered up your tats too long with them sleeves\nYou've gotta hit the club let the real you breathe\nWould you believe, you'll never shine if you're not seen\nSo get all in they face like Noxzema\nI know you mesmerized about that ass in them jeans\nPlease don't hit that raw, it's not clean\nPlease don't forget that all when it seems\n\n[Hook]\nN-now th-that that don't kill me\nCan only make me stronger\nI need you to hurry up now\nCause I can't wait much longer\nI know I got to be right now\nCause I can't get much wronger\nMan I've been waiting all night now\nThat's how long I been on ya\n(I need you right now!)\n\n[Verse 2]\nLet's get lost tonight\nYou could be my black Kate Moss tonight\nPlay secretary, I'm the boss tonight\nAnd you don't give a fuck what they all say, right?\nAwesome, the Christian in Christian Dior\nDamn, they don't make 'em like this anymore\nI ask, cause I'm not sure\nDo anybody make real shit anymore?\nBow in the presence of greatness\nCause right now thou hast forsaken us\nYou should be honored by my lateness\nThat I would even show up to this fake shit\nSo go ahead, go nuts, go apeshit\n'Specially in my Pastel, on my Bape shit\nAct like you can't tell who made this\nNew Gospel homie, take 6, and take this, haters\n\n[Hook]\n\n[Verse 3]\nI don't know if you got a man or not\nIf you made plans or not\nIf God put me in ya plans or not\nI'm tripping, this drink got me saying a lot\nBut I know that God put you in front of me\nSo how the hell could you front on me?\nThere's a thousand yous, there's only one of me\nI'm tripping, I'm caught up in the moment, right?\nCause it's Louis Vuitton Don night\nSo we gon' do everything that Kan like\nHeard they'd do anything for a Klondike\nWell, I'd do anything for a blonde dyke\nAnd she'll do anything for the limelight\nAnd we'll do anything when the time's right\nUh, baby you're makin' it\n(Harder, better, faster, stronger)\n\n[Hook]\n\n[Outro]\nYou know how long I've been on ya\nSince Prince was on Apollonia\nSince O.J. had Isotoners\nDon't act like I never told ya", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}