{"songs": [{"title": "Very Best", "album": "Black Market", "year": "2015-12-04", "lyrics": "[Hook: Mary J. Blige]\nYou only get one life\nThat's enough if you do it right\nOpinions don't phase me\nYour hate ain't gonna change me, no\nBut I ain't gotta explain myself to nobody\n\n[Verse 1: Rick Ross]\nThe swag non-stop, the paper won't quit\nYet it's fly nigga, how she wanna skate on my dick\nThe all black drapes, hollow wall full of safes\nMy gas on fleek, jet fuel for the weak\nThese niggas wanna tweet, my niggas wanna eat\nDown south dope boy, D-boy, nigga eat\nAll red Yeezy's, women who be on TV\nGuaps in the marble, only all down these zee-zigs\nTellin' jokes, blowin' smoke, the finest artichokes\nFine dishes, pretty bitches on our ghost spokes\nI'm tipping through on my shorty, eyes look Tiffany blue\nMethodous flows killing these niggas, christians approved\nVery wild, no photos, these niggas rarely smile\nOnly problem is staying low while the paper pile\nScared to come to town, really? How you niggas sound\nI get my bitch to come pick you up, just to gun you down\n\n[Hook: Mary J. Blige]\nYou only get one life\nThat's enough if you do it right\nOpinions don't phase me\nYour hate ain't gonna change me, no\nBut I ain't gotta explain myself to nobody\n\n[Verse 2: Rick Ross]\nFame is a flaw, I give the game to you raw\nNumber one in the south, she can see that from afar\nShe can tell by the car, double R on the plate\nRolls Royce over those black market bumping in the rave\nBitch nigga with poor taste, starve while y'all ate\nI put my niggas on, they got 20 more on the weight\nWe all gotta die so that's double M to the day\nI know the devil try so I get on my knees and pray\nJesus still walks, we marchin' in a parade\nBlack and white holding hands\nWhile letting that thing blaze\nPistol on my waist, I can feel a police chase\nHomie cutting crack like home made cheese cake\nI get right, I get it right, I double back, I get it right\nWe make mistakes, but baby now is the time to get it right\nI see you on that Jeep, but really what you living like\n\n[Hook: Mary J. Blige]\nYou only get one life\nThat's enough if you do it right\nOpinions don't phase me\nYour hate ain't gonna change me, no\nBut I ain't gotta explain myself to nobody\n\n[Verse 3: Rick Ross]\nMy heart nickle plated, these haters they all hating\nHate to see me smile, hate to know I made it\nHate to see me toast with my niggas, I'm motivated\nHate to see me with these women at these publications\nI still get it poppin', let me get them keys\nI still do the proper, do the BET's\nI still roll it proper, let my niggas feast\nStill in that 'rarri blowing hella weed\n\n[Bridge: Mary J. Blige]\nI'm doing big things, I got big dreams\nMove out of my way, if you ain't for me\nFeel like a winter, I put in work\nSo many years, man I deserve to be celebrated on every level\nIf you can't take it, that's your problem\nI'm gonna thrive, I'm gonna shine\nI'm gonna live my life\n\n[Hook: Mary J. Blige]\nYou only get one life\nThat's enough if you do it right\nOpinions don't phase me\nYour hate ain't gonna change me, no\nBut I ain't gotta explain myself to nobody", "image": "https://images.genius.com/5443bc2c1a02c3c0df5d0f01baaa2ad4.1000x1000x1.jpg"}], "artist": "Rick Ross"}