{"songs": [{"title": "God Damn", "album": null, "year": null, "lyrics": "[Intro]\nAye, aye, aye, aye (Aye, aye, aye)\nAye, aye (aye), I've been off a Xan, aye\nParanoia, I can't stand, aye aye\nSauce, yeah, yeah, sauce, yeah\nAye, aye, aye, aye, aye, aye, woah, woah\n\n[Verse 1]\nOkay, okay, okay, okay, I done came through with the 'K\nI'm the man, with a dream, like I'm Martin Luther King\nWhere the lean? Pour it up, high fashion, tote it up\nAnd your girl? On her knees, yeah, she gon' swallow up\nI been balling like I'm John Wall, Wizards on these niggas\nWrist cold, mouth cold, like a blizzard on these niggas\nGod Damn, God Damn, Imma sauce on a bitch\nGold grills, rose gold, Imma floss on a bitch\nOkay I'm known for taking bitches on the daily, aye, aye\nI ball like rockets, that the new Tracy McGrady, aye\nYou got a problem, that's okay, I come through spraying, aye\nI got that Jackie Chan kush that lil Asian, aye, okay\nI got a Mexican bitch and an Asian bae\nAnd I've been fucking all these bitches by the fucking bay\nI got your girl doing acid, she snort fucking yay'\nAnd if she ain't paying for coke, out my fucking way, the fuck away, aye\n\n[Verse 2]\nI say I'm balling like a fadeaway\nYour girl gone fuck, another day\nI popped a Xan, what can I fucking say?\nI mix beans, going dumb, Dr. J, aye\nDamn, God Damn, God Damn, God Damn\nI am who I am, yeah, I am who I am\nI'm in the kitchen whipping eggs, young Sam-I-Am\nI'm dunking on these bitches heads, no NBA Jam, God Damn\nSaucing up, man i swear I'm the man, what the fuck\nI'm high as hell, I felt like this way for months (yeah)\nI guess that's what happens when you smoke 40 blunts (yeah)\nI'm super fly, super high, she call me her super guy\nImma fuck her once, hit the blunt, then i tell her bye, God Damn\nTried to wife a nigga, nah, nice try\nAnd you know I'm the fucking man, yeah, I am fly, too fly\nNew clothes, new shoes, new hoes, new cars, 2 doors, I ball D-Rose, woah, woah, woah, woah\nYour girl dancing like she mike [?]\nYou run up on me, that's okay, that 4 blow\nI got that fire like a damn Komodo\nYou run up on me Imma let this 4 blow, aye\nSauce up, sauce up, no sauce, getting lost\n\n[Outro]\nAye, aye, aye, I said aye, aye, aye, get the fuck out my way\nGoing 90 on the fucking highway, aye, aye\nWhat the fuck can I say? Aye, aye\nIt's been a wonderful day, aye, aye, aye, aye\nSauce, aye, aye, aye, swooh, swooh", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}