{"songs": [{"title": "86'", "album": "Lost Jewlry", "year": "2013-01-15", "lyrics": "[Verse: Raekwon]\nWood green jacket in the clapper\nCatch me inside Mojito City with a stretched plump actress\nGrabbin’ her thong, the light-skinned Mia Long\nRich niggas way back, the bitch do John\nWhy would you ever wanna be here?\nGuns bigger than me here\nI’m like the centipede, three pair\nWallabees, first pair ferocious\nGuns from Scotia, everybody know I flow like oceans\nTruck little pieces, how’re we gonna eat this?\nI walk around fly, high, telekinesis\nAnd my lady a well known designer who fell in line with me\nAnd all she do is sell LV\nWe in the grow house, trees look alone\nI built the Dutch Master train set, relax, you home\nAnd watchin’ Carmelo when the Knicks go in\nI’m playing my square, I’m in the front row, my bitch roll in\nThat’s not wifey, that’s a lover\nShe gave me some top, but how we met, she was alone with my brother\nGivin’ twenty-year veteran good dick, came to my senses\nStay strong like old man in dentures\nWintertime rockin’ the fox, hangin’ with Bruno Mars, The Lox\nSting, yo, Nas’ pops\nWe gettin’ honeys, Rat Pack clique in my gunny\nBlowin’ two Ls, Ocean 11 this money\nFloss stays coolin’ on them horses\nHoppin’ over logs, long Polo boots, ownin’ them Porsches\nMaxin’ king, everything Gucci\nJust like the suits I play Saturday to stay in Jacuzzis\nBrother Man, I’m floatin’ to mother lands\nAnd came back with ounces of gold, wrapped aside, rubber bands\nHangin’ in McCormick & Schmitz\nDoin’ my OG thing, slangin’ some ‘caine in the mix\n\n[Bridge: Altrina Renee]\nI’ll be flying to the islands when it’s cold outside\nMatching furs, his and hers, got matching black cars\nOn my life, livin’ right, baby, love is no limit\nLife’s good either way, 'long as you in this", "image": "https://images.genius.com/19a80eba7163d77cbc2f82096b06010e.612x612x1.jpg"}], "artist": "Raekwon"}