{"songs": [{"title": "Notorious B.I.G.", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Intro: The Notorious B.I.G.]\nYo, check it, Call Lil' Cease\nTell that muh'fucker to bring me some muh'fuckin weed for this hospital\n(No-no-notorious)\nMan fuck that\nTell that reporter to go pick up ten thousand from Dez\nAnd go take about like twenty G's from Gino\n(No-no-notorious)\nTell that muh'fucker get this nigga next door up out of here\nNigga be snorin all night I can't sleep (hehe)\n(No-no-notorious)\nCall that big butt nurse with the long hair to come suck my dick\n(Bad Boy Big, c'mon)\n\n[Verse 1: The Notorious B.I.G.]\nThe doctor said I need about three weeks of recovery\nBut the nurses is lovin me\nSayin the best part of the day is my half\nFeedin me breakfast, and givin me a sponge bath\n(Notorious) Niggas say I died dead in the streets\nNigga I'm gettin high, gettin head on the beach\nChillin, sittin on about half a million\nWith all my niggas, all my guns, all my women\nNext two years, I should see about a billion\nAll for the love of drug dealin\nGot no love for the other side, fuck them tricks (fuck them)\nAny repercussion, Junior M.A.F.I.A. spit clips (that's right)\nAll the time, Big Poppa kick the war rhymes\nRaw flows, and that's how it goes\n\n[Puff Daddy]\nNOTORIOUS!\nC'mon.. we are, we are\nNO, NO, NO, NOTORIOUS!\nHe is.. he is..\nNO, NO, NO, NOTORIOUS!\n\n[Verse 2: Puff Daddy]\nThis for my niggas slingin thangs, had my ring encaged\nTruck, necklace, igloo ring and things\nFor the bitches, who see them rims spin and grin\nThat shit with the V-trim that win\nAnd the enormous fields disperse of rap\nOn the road to the riches more furs to drag\nMore niggas to kill, than birds to bag\nHit the jeweler and splurge the tab, uh\nHops, out the truck like, \"Trick, what up?\"\nCall me Sean if you suck, call me gone when I nut (come on)\nThat's the end of us, get your friend to fuck\nUntwist and bend her up, you know the deal (No-no-notorious)\nNiggas talkin real greasy on some ballin shit (that's right)\nFunny how quick these pricks forget\nActin like I ain't the reason they traded they shit\nSwitched that 5, copped that 6 (that's right)\nIt's all good, you know who the clone is\nFuck the Joneses, niggas tryin to keep up with the Combses\n\n[Puff Daddy]\nNOTORIOUS!\nC'mon y'all..\nNOTORIOUS!\nWe are, we are .. (what's his name)\nNO, NO, NO, NOTORIOUS!\nHe is, he is.. (c'mon, what's his name?)\nNO, NO, NO, NOTORIOUS!\n\n[Lil' Kim]\nWho that queen bitch, keep her glass filled to the rim?\nThe Notorious K-I to the M (Notorious)\nThat's me, on MTV, no doubt\nTitty out like what - I don't give a fuck!\nY'all know my attitude, can't stand my cologne\nThen stay your ass home, you and your chaperone\n(Notorious) Things done changed, but we continue to reign\nAs the King and the Queen of hip-hop, me and B.I\nFrank White still listen to all the (a)'ttention\nI'm by his side, with the chrome fifth, playin my position (Notorious) Sexy, young thing, from the ghetto\nThat bitch rockin mics in high heel stilletos\nWe takin over like Francis\nSwitchin our styles like the hottest new dances\nSee, I let y'all live to stack a LITTLE paper\nBe glad I pushed my album back, I did y'all hoes a favor!\n(Notorious)\n\n[Puff Daddy]\nShe did you a favor, c'mon now, yeah\nNOTORIOUS!\nNO, NO, NO, NOTORIOUS!\nHe is, he is.. (c'mon, what's his name?)\nBad Boy baby, D.R. c'mon\nNO, NO, NO, NOTORIOUS!\nWe are, we are ..\nQueen Bee baby, we are, c'mon\nNO, NO, NO, NOTORIOUS!\nHe is, he is.. (B.I.G. baby, he is c'mon)\nNO, NO, NO, NOTORIOUS!\nWe are, we are ..\nBad Boy 2000\nNO, NO, NO, NOTORIOUS!\nB.I.G. Born Again (he is.. he is..)\nAnd he won't stop\nNO, NO, NO, NOTORIOUS!\nCause he can't stop, yeah, uh-huh\nWe are, we are.. (Brooklyn baby)\nNO, NO, NO, NOTORIOUS!\nHe is, he is..\nNO, NO, NO, NOTORIOUS!\nWe are...", "image": "https://images.genius.com/775b3d8c7a2831ed05dcc1429d07c48f.1000x992x1.jpg"}], "artist": "The Notorious B.I.G."}