{"songs": [{"title": "Trapped", "album": "2Pacalypse Now", "year": "1991-09-25", "lyrics": "[Verse 1: 2Pac]\nYou know they got me trapped in this prison of seclusion\nHappiness, living on the streets is a delusion\nEven a smooth criminal one day must get caught\nShot up or shot down with the bullet that he bought\nNine millimeter kickin' thinkin' about what the streets do to me\n'Cause they never taught peace in the black community\nAll we know is violence, do the job in silence\nWalk the city streets like a rat pack of tyrants\nToo many brothers, daily headed for the big pen\nNiggas comin' out worse-off than when they went in\nOver the years I've done, a lot of growin' up\nGettin' drunk, throwin' up, cuffed up, then I said I had enough\nThere must be another route, way out to money and fame\nI changed my name, played a different game\nTired of being trapped in this vicious cycle\nIf one more cop harrasses me I just might go psycho\nAnd when I get 'em, I'll hit 'em with the bum rush\nOnly a lunatic would like to see his skull crushed\nYo, if you're smart you'll really let me go, G\nBut keep me cooped up in this ghetto and catch the Uzi\nThey got me trapped\n\n[Chorus: Shock G & 2Pac]\nUh uh, they can't keep the black man down\nThey got me trapped\nNaw, they can't keep the black man down\nTrapped\nUh uh, they can't keep the black man down\nTrapped\nNaw, they can't keep the black man down\n\n[Verse 2: 2Pac]\nThey got me trapped, can barely walk the city streets\nWithout a cop harasskin' me, searching me, then askin' my identity\nHands up, throw me up against the wall, didn't do a thing at all\nI'm telling you one day these suckers gotta fall\nCuffed up throw me on the concrete\nCoppers try to kill me but they didn't know this was the wrong street\nBang bang, count another casualty\nBut it's a cop who's shot for his brutality\nWho do you blame? It's a shame because the man's slain\nHe got caught in the chains of his own game\nHow can I feel guilty after all the things they did to me?\nSweated me, hunted me, trapped in my own community\nOne day I'm gonna bust, blow up on this society\nWhy did you lie to me? I couldn't find a trace of equality\nWorked me like a slave while they laid back\nHomie don't play that, it's time I let 'em suffer the payback\nI'm tryin' to avoid physical contact\nI can't hold back, it's time to attack jack\nThey got me trapped\n\n[Chorus: Shock G & 2Pac]\nUh uh, they can't keep the black man down\nThey got me trapped\nNaw, they can't keep the black man down\nTrapped\nUh uh, they can't keep the black man down\nTrapped\nNaw, they can't keep the black man down\n\n[Verse 3: 2Pac]\nNow I'm trapped, and walkin' for my getaway\nAll I need is a G and somewhere safe to stay\nCan't use the phone 'cause I'm sure someone is tapping in\nDid it before, ain't scared to use my gat again\nI look back in hindsight the fight was irrelevant\nBut now he's the Devil's friend, too late to be tellin' him\nHe shot first and I'll be damned if I run away\nHomie is done away, I should've put my gun away\nI wasn't thinkin', all I heard was the ridicule\nGirlies was laughin', Tup sayin \"Damn homies is dissin' you\"\nI fired my weapon, started steppin' in the hurricane\nI got shot, so I dropped feelin' a burst of pain\nGot to my feet, couldn't see nothin' but bloody blood\nNow I'm a fugitive to be hunted like a murderer\nRan through an alley, still lookin' for my getaway\nCopper say, \"Freeze, or you'll be dead today.\"\nTrapped in a corner, dark and I couldn't see the light\nThoughts in my mind was the nine and a better life\nWhat do I do? Live my life in a prison cell?\nI'd rather die than be trapped in a living Hell\nThey got me trapped\n\n[Chorus: Shock G & 2Pac]\nUh uh, they can't keep the black man down\nThey got me trapped\nNaw, they can't keep the black man down\nTrapped\nUh uh, they can't keep the black man down\nYou know they got me trapped\nNaw, they can't keep the black man down\nTrapped\n\n[Outro]\n\"Yo ya'll seen 2Pac man? Y'all seen 2Pac man?\nThere he go! Ay 'Pac!\"", "image": "https://images.genius.com/403ac48ab882b3be433c19da7b3a8216.600x600x1.jpg"}], "artist": "2Pac"}