{"songs": [{"title": "I Need To Know", "album": "Freshmen Adjustment Vol. 1", "year": null, "lyrics": "[Chorus]\nI need to know, you down to do whatever?\nDown to get it poppin'? Down to get topless? Ohh\nI need to know if you about cuttin'\nOr you about frontin', baby, I need to know\n\n[Verse 1]\nI spent my last eight checks-s-s on a neck-e-lace\nSo I better get some sex for this, shit\nShe wanna sip up on the Crissy Cris\nLike it's Christ-e-mas and I'm St. Nicholas\nI got her and her sister in that white Benz, dyke twins\nI ain't gon' lie, they only fives but together they ten\nAnd would I do 'em again? Hmmm, hmmm\nIt's like old folks pissin' 'cause it all depends\nAnd it's no coke sniffin', just juice and gin\nGrey Goose to get you loose then hit the nigga producin'\nThe track that got you movin', this track got you movin'\nSo crazy you don't know what you doin'\nYou been telling them jokes, and it's not a rumor\nI like a girl with a sense of humor\nTo give me head 'til it ache and it's not a tumor\nSo let me know what's goin down 'fore I pay for this room 'cause\n\n[Chorus]\nI need to know, you down to do whatever?\nDown to get it poppin'? Down to get topless? Ohh\nI need to know if you about cuttin'\nOr you about frontin', baby, I need to know\n\n[Verse 2]\nNow if you got it, you got it\nAnd if you don't then you probably won't\nSissy nigga call 'em maricon\nI never hit a lady but my game might abuse 'em\nBuy 'em boots just to tell 'em that I Jimmy Choose 'em\nTake 'em back to confuse 'em\nSo she don't know if she comin' or goin'\n'Cause mami, after I'm cummin', I'm goin'\nBack to the show, just frontin' and flowin'\nJewelry stuntin' and glowin', this life is somethin', I know it\nAnd I been known to have a ho or two\n'Cause my diamonds yellow like a smoker tooth\nI tell 'em step into the vocal booth\nRoll a joint, smoke a few, after that I'm pokin' you\nAfter that, it's over, boo, baby, grab your coat and voom\n\n[Chorus]\nI need to know, you down to do whatever?\nDown to get it poppin'? Down to get topless? Ohh\nI need to know if you about cuttin'\nOr you about frontin', baby, I need to know\n\n[Verse 3]\nNow there's three different levels to relationships\nPollyin' at the club with 'em, talkin', gettin' affectionate\nLeavin' and havin' sex with 'em, kickin' 'em out\nTrickin' on models, dimes and rats\nNow I don't get into that, I kick that habit\nI just keep 'em impressed, let 'em seat in the Lex\nNever eat 'em unless that fuckin' cat looks fresh\nI got a lion in my pocket, I'm lyin'\nI got a nine in my pants and baby, I'm just dyin' for a chance\nWho ready to fuck? You ready to fuck off the sizzurp?\nSays she ready to cut, then she grabs my scissors\nShe probably look good, but what's scary to me\nHenny make hoes look like Halle Berry to me\n\n[Chorus]\nI need to know, you down to do whatever?\nDown to get it poppin'? Down to get topless? Ohh\nI need to know if you about cuttin'\nOr you about frontin', baby, I need to know", "image": "https://images.genius.com/11b5c3bdc828bc9942f2c195f9ffa76c.300x300x1.jpg"}], "artist": "Kanye West"}