{"songs": [{"title": "G.O.D. Pt. III (Remix)", "album": null, "year": null, "lyrics": "Artist: Mobb Deep\nAlbum: G.O.D. Pt. III 12\"\nSong: G.O.D. Pt. III (Remix)\n\nYeah, yeah, G.O.D\n\n[Havoc]\nLime Bacardi(no doubt) heavely bent peep my mission\nHave the chicks trippin the Eddie Bauer Expedition\nUptown hit the pet shop\nHit the tele crown plaza, proceed to wreck shop\nHad the shorties starvin, Gotti finessed the dutchie\nUnraveled the leaf, heave the gut like a phillie\nNow we politicin, layin G while they listenin\nIts a Mobb thang, ain't no time for intermission son\nIm thru wit mines play my part where I fit\nSchemes of gettin rich never eat where I shit\nWhats the drilly really, wanna be thugs constantly kill me\nNever had my PHD, Im just being me\nSpeakin in general, what beef I gotta settle now\nYou know the clik, never had to switch files\nBent off the St.Ides chase you down with Cristal\nCount this muddy collect loot from Loud\nThen I bow, forever in this the war crowd\nBless all my thuns that hold me down\nKeep it real wit me I keep it real wit you\nKeep it in the Fam, and got our eyes on you\n\nChorus\nIts the G.O.D. father Part 3\nQ-B-C sip lime Bacardi\nHeavy on the wrist cube link my ice ring\nDrama we bring yo thats a small thing\n\n[Prodigy]\nInfamous entaprisez, surprise kid\nGet up on that ass like a virus\nLive in the flesh its the freshest flyest connaivenest\nViolatin niggas you dont wanna fuck wit\nIm stuck wit my peoples and they stuck wit me\nAnybody in my crew would get bucked for me\nAnd I damned sure will take a slug for thee\nWe rep the Q-B-C fromn the N-Y-C\nLet me show you how this rap shit is supposed to be\nMost of yall rhyme niggas just disgust me\nNigga P thugly eruptly fuck thee, comin wit nuff G\nYou and SP fuck that regulate my way thru black\nMove the crowd even like this or even wit that\nI kick thug raps, for my niggas in pants\nRocked the same gear for years guzzilin beers\nYo son, I hear alot a niggas call theyself infamous\nLets sit back and take a look at this, respect this\nWe be the most infamous livin reckless\nWe'll undress kids , come on pop the necklace\nTo go against my Mobb would be senseless\nTo resent this you must gotta deathwish\nYou simp kid you really in this my nigga face bent\nBut still carrying gats goin for his\nWhat the deal....you know the drill\n\nChorus/Outro(Singing)", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}