{"songs": [{"title": "Life’s A Bitch (Live)", "album": "Illmatic: Live From The Kennedy Center", "year": "2018-04-20", "lyrics": "[Spoken: Nas]\nYou know, it's life\nLife as I know it man\nThis life is crazy\nI realize that we're all here for a purpose\nI was lucky to find mine\nI didn't come from a privileged family\nI didn't read no fancy books like Outliers or Bounce, and found my way\nWe just rise, right?\nWith no help, we can risw in the wave\nFor me, I needed more than money though\nI wanted to be heard man\n\n[Verse: Nas]\n20, it's a blessin'\nThe essence of adolescence leaves my body, now I'm fresh and\nMy physical frame is celebrated ‘cause I made it\nOne quarter through life, some godly-like thing created\nGot rhymes 365 days annual, plus some\nLoad up the mic and bust one, cuss while I pus from\nMy skull, ‘cause it's pain in my brain vein, money maintain\nDon't go against the grain, simple and plain\nWhen I was young, I used to do my thing hard\nRobbin' foreigners, take they wallets, they jewels and rip they green cards\nDipped to the projects, flashin' my quick cash\nGot my first piece of ass, smokin' blunts with hash\nNow it's all about cash in abundance\nNiggas I used to run with is rich or doin' years in the hundreds\nI switched my motto; instead of sayin', \"Fuck tomorrow!\"\nThat buck that bought a bottle could've struck the lotto\nOnce I stood on the block, loose cracks produce stacks\nI cooked up and cut small pieces to get my loot back\nTime is illmatic, keep static like wool fabric\nPack a 4-matic to crack your whole cabbage\n\n[Chorus: Nas]\nLife's a bitch and then you die, that's why we get high\n‘Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n‘Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we puff lye\n‘Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n‘Cause you never know when you're gonna go\n\n[Spoken: Nas]\nShoutout to my father Olu Dara\nThis is his horn part he wrote\nCan we hear the horn?\nHe played that shit so right\n\n[Chorus: Nas]\nLife's a bitch and then you—then you get high\nYou never know, it's real shit, right?\nLife's a bitch and then you die, that's why we puff lye\n‘Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n‘Cause you never know when you're gonna go\nLife's a bitch and then you die\n\n[Spoken: Nas]\nY'all making me high right now, we don't need no weed\nYeah, oh\nThank you for that", "image": "https://images.genius.com/9fb8160b2c6d56c5e7237de79281fbdc.807x807x1.jpg"}], "artist": "Nas"}