{"songs": [{"title": "Polo Jeans", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro: Gummo Sample & Mac Miller]\nDamn you rabbit, you smell like fucking piss!\nYeah, no fucks when I go nuts\nYou can kiss my ass\nGive no fucks when I go nuts\nCause I smoke dust, overdosed on the sofa, yeah\nFucking rabbit!\n\n[Verse 1: Mac Miller]\nI give no fucks when I go nuts\nCause I smoke dust, overdosed on the sofa, dead\nWoke up from a coma\nPoured up with a soda, smoked, went back to bed\nNever thought I'd be such a loner\nI tell my bitch that I fucking own her\nMy neighbor's daughter just got a dog\nI'ma run it over, I'm a fucking soldier\nSo cold bro, fuck pneumonia\nAll my bitches got love for Sosa\nI just wanna fuck Rosa Acosta\nThen disappear in Southern California\nStrung out to the night, I'm chilling\nEverybody worried that the lights might kill them\nUh, via sight slipping\nLong lines of those white women\nI'm with the homies, bump Counting Crows\nJust went through a half ounce of coke\nBlood pouring all out my nose\nDon't tell my mom I got a drug problem\nI'm fucking high-ly publicized\nWhen the sun go down, I come alive\nCause the guns go off in the summer time\nThe guns go off in the summer time, blaow\n\n[Hook: Mac Miller]\nThis another motherfucking rap song\nBroke and crazy, rich and famous doesn't last long\nSpent all my cash on a broken dream\nWent from weed and liquor to the coke and lean\nAll-all-all I got's this mansion and this potpourri\nBut don't I look so handsome in these Polo jeans?\nDon't-don't-don't I look so handsome in these Polo jeans?\nWhoa\n\n[Interlude: Gummo Sample]\nThe rabbit can kiss my ass\nCome on, let's go man\nI hate you\nFucking rabbit! Kill his ass!\nI don't like rabbits coming to my fucking house, I kill 'em\n\n[Verse 2: Earl Sweatshirt]\nI blow a spliff before the ink dries on the paper\nAnd lately, I don't like shit, I been inside on the daily\nGetting wasted as the time that I'm spending high and sedated\nI'm putting five in his face, because we don't buy into bullshit\nAs soon as it's flashing lights then it's kush to hide in the bushes\nI do this shit out of spite cause there's niggas that overlooked me\nForever, I'm more content with dark and stormier weather\nFlip the fucking cross on your rosary, we supposed to be better\nBut here's a toast to your efforts\nAnd don't approach me with nothing that isn't money or breakfast\nI'm close to choking a pussy, pussy\nSweaty Man, you best had bet your bottom dollar on him\nWith a couple niggas, weighing sess like it's a lot of options\n15 on me for soda and swishers\nAnd who's the shit, a bag of chips and a colon decleanser?\nI'm over bitches trying to act like I owe 'em a picture\nRather introduce these hoes to Vince who could show you a pistol\nListen, ST was the older initials\nBeen rap game tighter than boa constrictors\nRolling stone like a boulder raving\nI'm so impatient and going dumb as\nDisclosing my fucking home location to total strangers\nNo love in my heart for coppers, blood from my lungs on the sink\nCashing out off the garments, the artist, fuck what you think\nThe sky'll turn black and the carrions could pick\nAt my flesh when I rest, tell 'em bury me adrift\n\n[Hook: Mac Miller]\nThis another motherfucking rap song\nBroke and crazy, rich and famous doesn't last long\nSpent all my cash on a broken dream\nWent from weed and liquor to the coke and lean\nAll-all-all I got's this mansion and this potpourri\nBut don't I look so handsome in these Polo jeans?\nDon't-don't-don't I look so handsome in these Polo jeans?\nWhoa\n\n[Outro: Ab-Soul]\nIt's the official drug user, Soulo\nIt's Ab-Soul, jack... listen, yo!\n\n[Excerpt: Gummo Sample]\nNo you didn't!\nYes I did!\nHe looks like a queer rabbit!\nHe can kiss my ass!\nRabbits are queers! They always gotta shit on themselves!\nAwh those are the queer-ass rabbits!\nLook at these little fag bunny ears\nFucking rabbit! I'm sick and tired of it, this shitty-ass rabbit stinks! Smells like pussy! He smells like an asshole! Smells like wet-back dick!\nHe smells like a bunch of bullshit!\nIs it dead?\nI dunno but I'm finna make sure\n*continuous gun firing*", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}