{"songs": [{"title": "Show Me", "album": "The Movie (Gangsta Grillz)", "year": null, "lyrics": "[Hook]\nBend your back, flip your shoulders, drop your head\nBust it open if you love it like you say you love it, baby girl\nShow me some, girl (show me some, girl)\nGot that back bent, shoulders drug and got it bust open\nSaying \"if you won't it come and get it, Gucci Mane, show me!\"\nShow me some, girl (show me some, girl)\n\n[Verse 1]\nYou know I'll do it, sure I'll do it\nShow me some, girl. Call me Gucci Mane La Flare\nMy name went down around the world\nBuy you diamonds, buy you a purse\nPotential to be my \"Gucci Girl\"\nTake you to the Gucci store\nThey call that shit the \"Gucci World\"\nWord: in the Louis shop you'll be my Louis girl\nBuy you Louis, buy you Prada cause you look just like a model\nWe'll be poppin' bottles? Naw! We'll be poppin' cases\nGucci Mane La Flare got lawyers to fight all the cases\n$100,000 car, 50-carat bracelets\nHalf a million for the chain, Gucci Mane crazy!\nPull up in an '08, looking like a stingray\nThen calamarr' in my brand new Ferarr'\nSorry, stepping on your fins with my Maurras\nGot a nasty model cause it ain't about the dorras\nStaring, staring, it's apparent that they staring\nBaby girl, cause I'm fresher when I'm glaring\n\n[Hook]\n\n[Verse 2]\nShorty want to marry me\nSay she don't have sex casually\nDon't want to be a casuality\nGot a faculty, got more Magnums than an infantry\nBaby, that's the penalty and trapping is just energy\n\nGucci Mane La Flare, you can call me \"Guccirace\"\nMillion-dollar shine: call me \"Gucci Dibiase\"\nLike Ted Dibiase, put you in a \"figure-4\"\nGucci Mane La Flare: my car is on some 24s\n\nGot them 4's on the Maserati\nO, kimosabe\nGot them bitches in the lobby\nAnd they waiting on Guccirace\nI got 4's on the Maserati\nO, kimosabe\nGot them bitches in the lobby\nAnd they waiting on Guccirace", "image": "https://images.genius.com/ca110e221f46b8af087d06bf5919f5a4.400x400x1.jpg"}], "artist": "Gucci Mane"}