{"songs": [{"title": "Guess Who’s Back", "album": "Greatest Hits", "year": "2002-08-06", "lyrics": "[Intro: Jay-Z]\nTalk to me man…\nThis ya boy Young Hova, yo, turn the muh'fuckin' noise up\nWe can get right into the proceedings this evening\nHeadphones are distortin', bring it down a lil' bit\nOkay, now we workin' with it\nThe boy Face up in Baseline (Face Mob!)\nWelcome to New York City\nIt's ya boy Young Hov' (chyea!)\nKanye West on the track (woo!)\nChi-Town, what’s goin' on now?\nCan I talk to y'all for a minute?\nLemme talk to y'all for a minute\n(Just gimme a minute of ya time baby, I don't want much)\nLemme talk to these muh'fuckas, uhh\n\n[Verse 1: Jay-Z]\nGuess who's bizack? You still smellin' crack in my clothes\nDon't make me have to relapse on these hoes\nTake it back out to taxin' them road; when I was huggin' it\nNiggas couldn't do nuttin' with it, straight from the oven with it\nCame from the dirt, I emerged from it all\nWithout a stain on my shirt; you can blame my old earth\nFor the shit she instilled in me, still with me, pain plus work\nShit, she made me milk this game for all it's worth\nThat's right, these niggas can't fuck with me\nI'm callin' guts every time, drag my nuts every time, homie\nWe make a great combination, don't we?\nMe and the Face Mob, every time we face-off\nFace it, y'all, y'all niggas playin' basic-ball\nI'm on the block like I'm eight feet tall\nHomie, I'm in the drop with the AC off\nThat's why the streets embrace me dawg, I'm so cool\n\n[Chorus: Kanye West]\nGuess who's bizack? Back on the block with them O's\nFace Mob, Mack Mittens and Hov'\nDon't make me relapse, back to the block with the four\n'Cause this street shit is all I know\n\n[Verse 2: Scarface]\nFrom the womb to the tomb, a hot pot, a jar and a spoon\nTryin' to make me forty thousand and move\nMotels, star-studded, rock stars and goons\nPlain clothes wanna run in my room (woooo!)\nBut nigga guess who's bizack? It's ya boy Face Mob\nStarted with an eightball, gotta get this cake dawg\nGive niggas a break, nah; you know how the game go\nFuck you think I slang for? To go against the grain? No\nI'm out here in grind mode, wrapped up in the paper chase\nI wanna fuck a fine ho and candy-paint the 88\nDon't got no wholesale, 'cause that ain't how I wanna run it\nHere, take these five stones and bring a nigga back a hundred\nGotta set my feet dude, you do shit a fiend do\nThe fire get too hot in the kitchen, I hit the streets, fool\nMoney is an issue and that's on the fo' shizzle my nizzle\nYa block warm, and I come by with the fizzle\nAnd make fo' sho' I get to work mines, a car at a time\nWe go to war and you ain't makin' a dime (haha!)\n'Cause I got shit to lose; a nigga out here payin' his dues\nMy baby walkin', gotta get him some shoes\nIt's a new game brewin', lemme give ya the rules\nGet out of line and I'ma give ya the blues\nIt's a new game goin', lemme give ya the rules\nGet out of line and I'ma give ya the blues, whoa (haha!)\n\n[Verse 3: Beanie Sigel]\nGuess who's bizack? The boy B. Mizack, AKA Mr. Crack-A-Brick\nTurn a whole one from a half a brick, look I mastered this\nYou can smell it once the plastic rips\nA hot plate'll make ya swell up if ya gas get clipped\nYou can make ya chips swell up, you don't have to pitch\nPlay them corners like a safety, watch the traffic switch\nYoung'n never pump fake, and you'll get past the blitz\nAnd keep ya whole hood on flip, like old box-spring\nPissy mattress shit, low old box of things\nStrictly glassy shit, I hug the block like quarter water\nShit, I used to hug a corner like a old deuce and a quarter\nTil' like deuce in the morning, with the old heads (uh!)\nSlangin' loose quarters, this Philly cat back at it\nStill fuckin' with 'em crack addicts, still bustin' with that black-matic\n\n[Chorus: Kanye West]\nGuess who's bizack? Back on the block with them O's\nFace Mob, Mack Mittens and Hov'\nDon't make me relapse, back to the block with the four\n'Cause this street shit is all I know", "image": "https://images.genius.com/5eb25741266e087e51cc814bb4a051e9.600x600x1.jpg"}], "artist": "Scarface"}