{"songs": [{"title": "The Commercial", "album": null, "year": null, "lyrics": "Yeah I know, man\nI'm just, I'm a connoisseur baby\nIt's what you do\nYou like that? Man, I know you like that\nIt's an acquired taste\nI know what I want because I know what I want\nNow give me those in an 11\n[Intro: Lupe Fiasco]\nYeah, uh (whoo!)\nYou know what it is\nDanno, what up baby?\nAs-salamu alaykum, Street Connoisseurs\nMr. Mighty Mighty\n1st & 15th\nYou know Hype Beast's up in this too, right? Kevin, what up man?\nWe just proudly present to you some\nYou know, some freshness, you know what I'm talking about\nSome swagger, you know what I'm talking about\nLupe\n\n[Verse 1: Lupe Fiasco]\nLook at these shoes Joe, you can't find that\nUnless you flying to Singapore, homie, you ain't buying that\nRemember that line? Well I wasn't lying Black\nMatter of fact, homie, it's that time that\nI put you up on what we been up to\nUh, just up the ante, it's FNF up, fool\nPlus cool multiplied by fresh\nDown the West, I swear they never been to such school\nBut we gon' take 'em there\nAssigned seats, take attendance, give 'em detention, make 'em wait in there\nTry and learn 'em a little something, give 'em lunch breaks\nAnd God willing, them children will graduate, yeah!\nUh, I do declare\nOn that there just awful pair--\nAnd they so rare, homie, you can't wear--\nOnly way you're getting these is if you my heir\nUh-uh, no way nowhere\nGot the Streets times the Beast times 1st & 15th\nNow player that ain't fair\nAnd don't forget RKF bringing up the rear\nLike this y'all, like that y'all\nRodney Mullen's a wrap, nose manual ain't on the track dog\nCrept up by the way, they was sellin crack dog\nStepped up to tell them we was never going back, naw\nUh, yeah that's right\nRemember by respect and not by hype, uh\nSo from the minds of two entrepreneurs\n1st & 15th meets Street Connoisseurs\nLike that y'all, like that y'all, like that y'all, like that y'all\nYeah!\n\n[Outro: Lupe Fiasco]\nStreet 0404\nConnoisseurs\nMeets 1st & 15th\nIt's a match made in heaven, baby\nYou know what I'm talking about?\nI'm saying it had to be literally\nBecause if God invented everything and he knew everything that was going to happen He had to know that\nYou know, there was going to be this\nSingapore, you know, Chi-town connection going on\nYou know what I'm saying so it's a match made in heaven, you know what I'm talking about\nSo just sit back and enjoy\nBada-bing, bada-boom, forget about it", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}