{"songs": [{"title": "Purpose", "album": null, "year": "2015-03-11", "lyrics": "[Intro]\n(Goose)\nYeah, Thugger, Thugger, Yeah\nGoose with another\n(Goose with another one)\nYeah, uh\nThugger, hey!\n\n[Verse 1]\nThis a letter to my slimes, what's brackin' slimes?\nI had your back every single last fuckin' time\nAnd you know I'm the only one who's gon' die 'bout you\nAnd you know in Pluto I can stand side to side with you\nI'm livin' every week like it's my birthday week\nI can be a birthday freak\nBitch, I'm working while you lurkin' me\nI'm in the street like it's my worst week\nMy bitch boolin' and she say she want that Birkin B\nMa asked was my purpose, then\n\n[Chorus]\nMama say I ain't have no choice but to do my mothafuckin' thing\nGot my shoes, I tied 'em up and made a whole 'nother lane\nMy diamonds shining, they glistenin', but they ain't from Johnny fuckin' Dang\nYou say her cat was terrific and I said the same damn thing\n\n[Verse 2]\nSame damn time\nThese bitches and these niggas wanna see a nigga dead\nDamn why's that? Spam that shit nigga\nI'm dumpin' on your bitch\nNo Donald, I'll Trump that bitch\nHo say it again, say it again\nKush smell like a skunk\nBitch, I'm fresher than a punk\n\n[Bridge]\nOkay, now tell me how you want it (What!?)\nYou know that I got it (What!?)\nBig booty ho from Houston\nI bang red like a Rocket\nOkay, well she done been around you\nI know all about her\nI wanna put a eight-ball in her corner pocket\n\n[Verse 3]\nI just read her diary, went and bought her that Mercedes\nNo cop car, she a Taurus\nYeah, that \"T\", that mean she taken\nShe don't feel right 'til she play me\nShe won't take my bread, no baby\nAnd just for that, I would love to keep her\nShe keep going 'round like an equator\nI'll introduce her to paper\nBitch, it's a bando, it’s vacant\nI bought ice just for my acres\nDamn, there go a superstar, no shaker\nHey, I grab that pistol and erase 'em\n\n[Chorus]\nMama say I ain't have no choice but to do my mothafuckin' thing\nGot my shoes, I tied 'em up and made a whole 'nother lane\nMy diamonds shining, they glistenin', but they ain't from Johnny fuckin' Dang\nYou say her cat was terrific and I said the same damn thing\n\n[Outro]\nYou feel the same way 'bout it, you feel the same way\nI swear I’ll catch me a body, these niggas try to play\nYou know I'm rich, but ain't make you the girl in the same day\nYou know I don't care about cheese on my head like Green Bay\nNo way, José (Yah)\nYou like my motherfuckin' fate today (Ohh)\nI might catch her ‘round the way, stray and save the day\nPut that dick inside her she stuck, she stuck like clay\n(Yah, yah)", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}