{"songs": [{"title": "In the Bag", "album": "GO:OD AM ", "year": "2015-09-18", "lyrics": "[Skit: Mac Miller & Domo Genesis]\nDriving in my car, Sunday afternoon, chillin'\nWho is coming up to my car? What?\nI know niggas think you white\nAnd you not bout to go in with these bars, my nigga (uhh)\nBut that is not the truth (okay)\nWord to God I take another shot of Hennessy\nIf you don't go in right now\nI need your fade right now, bruh\nWhat the fu...\n\n[Intro: Mac Miller & Juicy J]\nOkay, okay\nYeah, the hustle continues, man\nOkay, yeah\nYou's  a wild motherfucker, Mac\n\n[Hook: Mac Miller & Juicy J]\nSo this the music that made white people mad\nMake 'em mad\nYeah, this the shit to blow your speakers out\nThis the shit you dream about\nYou can have the world it's up for grabs\nUp for grabs\nLeave with everything cause everything is in the bag\nIn the bag\n\n[Verse 1: Mac Miller]\nWhen I was younger, I was just a little wild motherfucker\nTryna be like all the people on the television\nThey had all the bitches that I wanted\nAll the cars and all the extras\nAnything money could buy, they was spending millions (cash)\nI was tryna get to pimping\nI was tryna blow up talking demolition\nThat boy got the devil in him, swear he need an exorcism\nI'm all by myself, got no competition\nKeep it real in a world that's filled with politicians\nYou want to talk about your problems\nDon't you wish the life you lived was motherfucking awesome\nDon't you wish you had all the pussy?\nToo much money you could spend?\nYou could get away and never see your shitty life again?\n\n[Hook: Mac Miller & Juicy J]\nSo this the music that made white people mad\nMake 'em mad\nYeah, this the shit to blow your speakers out\nThis the shit you dream about\nYou can have the world it's up for grabs\nUp for grabs\nLeave with everything cause everything is in the bag\nIn the bag\n\n[Post-Hook: ScHoolboy Q & Mac Miller]\nAnd we never done with this shit, here we come with that shit\nI ain't stressing, I ain't worried bout nothing, don't trip\nIt's amazing all the shit that I be coming up with\nShit is real, tell 'em chill, keep on bumping my shit\n\n[Verse 2: Mac Miller & Juicy J]\nYeah, all my life I been a fuck up, never did anything right\nThat's why everyday I'm fucked up\nMy Mom pray to Jesus Christ (Jesus Christ)\nAsking somebody to save me (Somebody save that boy)\nBut I'm way too motherfucking crazy\n(No one can save that boy)\nYeah, all the kids is doing drugs (Drugs)\nThey just want to break the law and find someone to fuck\n(They wanna find someone to fuck)\nYeah, nobody doing as they told (little bad ass kids)\nYeah, everyone out of control (fuck it, that's just how it is)\nI'm self made, dream came true, I'm a miracle\nEvery time I put my dick inside a bitch, it’s spiritual (It's holy)\nGot the whip that say \"wealthy\" on my steering wheel (brand new car)\nBrand new model bitch made me waffles and some cereal\nThat's what I call a good morning\nYour mom work an extra job just to get you Jordans\nJust so you could show up at your school looking fresh saying\n\"I don't know 'bout you, but me, I'm important\"\nI'm so gorgeous\nYou got money in your pocket, you the shit (you the shit)\nYou got everything you want\nAnd bitches on your dick (on your dick)\nYeah, a couple grand got you feeling like the man\nEverybody walking tall til they trip\nThey just cut the check\nYou had to go and cop the whip (cop the whip)\nDrive up to your ex's crib\nAnd tell her she ain't shit (you ain't shit)\nThere's just something about the money\nMake a motherfucker crazy\nWhen I die, bury me in my Mercedes, God damn\n\n[Hook: Mac Miller & Juicy J]\nSo this the music that made white people mad\nMake 'em mad\nYeah, this the shit to blow your speakers out\nThis the shit you dream about\nYou can have the world it's up for grabs\nUp for grabs\nLeave with everything cause everything is in the bag\nIn the bag\n\n[Post-Hook: ScHoolboy Q & Mac Miller]\nAnd we never done with this shit, here we come with that shit\nI ain't stressing, I ain't worried bout nothing, don't trip\nIt's amazing all the shit that I be coming up with\nShit is real, tell 'em chill, keep on bumping my shit\n\n[Bridge: ScHoolboy Q & Mac Miller]\nBumping my shit\nBumping my shit\nBumping my shit\nBumping my shit\n\n[Outro: ScHoolboy Q & Mac Miller]\nComing!\nAye, open up! Aye! Yea, that’s right\nYea, aight. Nigga, these niggas got me fucked up\nWho? Who do I gotta call? Who?\nYeah, nigga I’m fucked\nOh we gonna take care of this right\nListen to me, nigga can’t park the car\nNigga can’t go to the store (Tell me about it)\nNigga can’t, nigga can’t text his homie on the phone no more\nI didn’t talk about nigga, that’s the ticket\nWell, that is dangerous\nNigga I just got my Ls last week, but anyway\nYou just got your license?\nNiggas pulled me over (yeah) asked me for my license and registration (right)\nI give ‘em my license and registration (As you should)\nAnd he got the nerve to tell me I smell like weed (Pshhh)\nNigga you asked for my license and registration\nOf course I smell like weed, nigga I smoke weed!", "image": "https://images.genius.com/3fafe062032c4ec3d42f4b11c25a02a1.375x375x1.jpg"}], "artist": "Mac Miller"}