{"songs": [{"title": "As I Come Back", "album": "Genesis", "year": "2001-11-27", "lyrics": "Here we come yo, here we go (Its goin on now) - 3x\nBusta Rhymes nigga, here we go\nFlipmode nigga, here we go\nNeptunes nigga, here we go\nOnce again my niggas, here we go\nArrrrah!\n\n[Verse 1]\nCome on, guess who's back in town\nBitches get on the dance floor and pull ya shit on doownnah!\nFrom miles around\nI been fuckin bitches up and flip a brand new soundraah!\nThe most hot shit all around\nSo hot it make a bitch wanna give me a poundraah!\nHuh, fall on the ground, (come on)\nRoll up a backwood and stay steamin the brrownraah!\nThe way we comin to town\nSee we controllin the fort now, nigga give me the crrownraah!\nTalk that shit to me girl, arrah, wha you say, arrah!\nStrip for me, I got the camcorder shorty make her flick for mearrah!\nAnd how ya ass get split for mearrah!\nSee how we makin you black\nAnd from the party and we keep the DJ bringin' it back\nI'm sayin\n\n[Hook 2x]\nUh, uh, uh along with the track man\nUh pardon me, uh, as I come back\nUh, uh, uh along with the track man\nUh pardon me, uh, as I come back, nigga\n\n[Verse 2]\nWhat we gon do in 2002\nEven though we havin fun in 2001 raah!\nStay strapped, grippin my gun\nUp in the truck, packed with bitches stackin my onerrah!\nAnd while we wlyin' in fun\nAll of my bitches show me ya ass and rep where you fromraah!\nCome on, arrah, cuttin' it down\nSuch a way we make police come and shuttin it downrraah!\nI hope you see how we takin it there\nAnd while we at it motherfuckers throw ya hands in the airraah!\nValet parkin the car\nWhile we up in the club buyin every drink in the barraah!\nWe givin you this shit, come on\nWe showin niggas how we always flip the script come onrraah!\nBack off, get out of my face\nAnd every time we come through nigga, give me my space\nI'm sayin\n\n[Hook 2x]\n\n[Verse 3]\nFor my dogs we be keepin it raw\nBut bitches be gasin a nigga, please give me some moreraah!\nThey way you be shakin ya shit to the floorrah!; Damn!...arrah!!\nI'mma give it to you mami for sure\nAnd if you couldn't take it what is you fuckin me forrah!\nYa niggas know how to act\nAnd when we arrive niggas know we come to pushin shit back\nI'm sayin\n\n[Hook 2x]", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}