{"songs": [{"title": "Walk with Me", "album": null, "year": null, "lyrics": "[Intro from the motion picture \"The Education of Sonny Carson\"]\nWhat you doin' on our turf, punk?\nGot a message for Smokey\nGive it\nYou Smokey, man?\nGive it!\nIf you ain't Smokey, it ain't yo' motherfuckin' message\nMotherfucker, I said gimme the message!\nIt's from Willie, in the slam\nNigga, you been busted?\nYeah, the man picked me up\nWell, I ain't got no fuckin' time to play witchu! Now gimme the message\nWillie's in Warwick, doin' 1-3. Told me to tell y'all motherfuckers to\nKeep cool. He be out one way or another. Quick. Maybe I could stick\nAround for awhile\nNaw, that's out, man. You know? What can we The Lords do with a punk like you?\nKiss my ass, motherfucker! (Burn 'em) Just me and you, motherfucker, just\nMe and you. I put trademarks around your fuckin' eye!]\n\n[Portrayin', won't be payin'. Uh huh, Uh huh]\n[Yeah, no doubt, no doubt, this Wally champ cat. Yeah, it's on this one]\n\nRaekwon:\n\nYo, Gambino niggas who swipe theirs\nDeluxe rap cavaliers\nMidgets who steal beers, give 'em theirs\n\nChorus: Raekwon\n\nSit back jollyin'\nMy team be gamin' like three card Rolly an'\nDrug Somalians pollyin'\n\n[Verse One: Raekwon]\nMany raps they crochetin'\nAy yo Iron, these niggas portrayin'\nBut haven't been payin'\nFor real, slide on these niggas like flesh fear\nCaesar fade style, usually tough grenade\nThrow a blade, fuck gettin' laid\nGuzzle this shit like Gatorade\nBig-dick Wallies have never half-suede\nConnectin' with the hot style is done\nLight up a chalis\nI run with nuttin' but the wildest, foulest\nCome on now, long-dick style\nNiggas on the hit out, ay yo Iron bite my shit out\nEventually, bust a rap gun mentally\nBeen doin' this century kid, just meant to be\nGet on your knees and bless me with a gem in the Caribbean\nSkiin' off by P.M\nSnatch Canadian cream with Scandinavians\nFellatium style, play it like thirty-two Arabians\nThe greatest lesson is don't owe, you might get stole on\nWhen I go bury me wit Valow on\n\n[They come to me, and understand, just let me get mines first. Then after I\nGet mines, y'all can do what y'all wanna do. Fuck 'em up bad]\n\n[Verse Two: Ghostface]\n'Sho 'nuff, hit the bank and thrust\nCool Nauticas Jamie Summer got trained on the tour bus\nWe upgrade, swallow raw eggs, read the label\nHittin' white-label, left the Winnebago unstable\nSmooth sailin', walked in, my earth started kneelin'\nStarted stealin', I'm too ill, see we're bellin' at the parlay\nKicked up, mack, max motion\nMichael Bolton magazine call, I'm too potent\nLouisville mix pain kill rap, Fuck benadryl\nThe violin in 'Knowledge God' sounded ill\nTremendously obnoxious, no blotches\nMy telephone watch'll leave bartenders topless\nDead on the prosecutor, smacked a juror\nMe and my girl'll run like Luke and Laura\nWe sit back on Malayan islands\nSippin' mix drinks out of boat coconut bowls, we whylin'\n\n(Break) Raekwon:\n\nSit back jollyin', Uh huh, Uh huh\nUh huh, Uh huh, Sit back jollyin'\nUh huh, Uh huh, Uh huh, Uh huh\n\n(Chorus) x 2\n\nSit back\n\n[Verse Three: Cappadonna]\nDeep meditation sound orientated, war the blizzard\nRap para-medical the wizard\nCappadonna, never caterin' to none\nMy microphone and three verse weigh a ton of slaughter\nYou oughta five thousand back across the water\nMy laboratory story keep me flowin' with the glory\nAcapella or deep dirty instrumental\nI could blow the sky like the stormy wind blew\nOne gallon of whylin', Park Hill profilin'\nI cut your face up rough fifty sure while you're smilin'\nFor violatin' my position\nI leave you smoked like a crackhead on a mission\nTwo tokes of mic dope, one stroke of elegance\nRated like the movie graphic told intelligence\nPerson to person, it'd be hard for you to take a trophy\nYou better off to get somebody out to try to smoke me\nCause I'm P-L-O T-K-O every day\nDancehall General, Party Fanatic Colonel\nCappadonna son'a old school just go infernal\nVeteran for rappin' with the new set of rule of hard rappin'\nNinety-six jive, I keep the live crowd clappin'\nWhen I bow, all praises due to Staten Isle\nI spark the mic and Shaolin spark the methtical\nEvery evenin', I have a by myself meetin'\nThinkin' who's gonna be the next to catch a beatin'\nFrom my mental slangin', bitchin' rap twist the point of warfare\nI brutalize, all competition catch ill hair\nChance him, that's what they said, threw up a ransom\nI jacked it, stripped the beat naked and packed it\nGimme my rewards\n\n[The way I, the way I wanna get 'em. I want 'em gotten. I want 'em layin'\nOut. I want 'em gotten. Cause niggas need to be gotten. He need to be\nTaken off of here. That's right.]", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}