{"songs": [{"title": "Give It Up", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro: Tech N9ne]\nIt's for real emcees only, nigga\nEverybody on this mothafuckin' flow\nThis real shit right here\nLebowski hit 'em!\n\n[Verse 1: Lebowski]\nGotta give it up 'cause it is a must plus\nI'm fast like a rushed bus\nOn her ass we bust nuts\nThen we smash past your city\nNever last, the big bucks\nI'ma gas this pair up\nWhoop ass and kick dust\nThey try to talk tall but their money is straight dwarf\nAnd you won't think it's funny when we pull up in the grey Porsche\nWe treat 'em like stray whores\nWe leavin' their face sore\nGot the gun in the safe\nShoot from the waist and the case fall\nKeep on testin' me especially when my ass be up on it\nIt'll be a death, defeat, don't mess with me\nKilling off all opponents\nNever slipping, never tripping off money, matterless moments\nWill you take it or you'll leave it\nIf you'll leave it you don't want it\nI'm a strange individual\nLeaving you suckers to drown\nThe flow's continuous, when I begin to it\nChopping your bitch, it goes up for the pound\nI cover the turf of the pelagic sound\nI'ma diminish 'em off to the ground\nWe never knew gimmick, you know that we clowns\nThey all get with it when they hear the sound\n\n[Hook: Tech N9ne]\nWhoop! So jittery they think I'm back on it (back on it)\nSo shivery they be like \"doggone it\" (doggone it)\nSo quivery they freeze at that moment\nNo liberty for lil bitty pretenders that want it, guess what\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\n\n[Verse 2: Godemis]\nThis here'll put the desire in 'em\nLight 'em up and put a fire in 'em\nDon't nobody wanna openly worship the Devil\nBut know that I'm writing with him\nLook at the way that I ride the rhythm\nI put the virus inside the venom\nI don't wanna call 'em pussy but I know what they eating\nI see the vagina in 'em\nI admit I'm off of my rocker with underlings\nYou've been warned! Call Ces (creamed corn)\nWe running things\nYou fly? Fucker be gone\nIt's not flapping a hundred wings\nI'll snatch the mermaid from out bloody water and gut her clean\nWhen I say I got it together\nThey say I'm insane - funny!\nThe city is no utopia, notice it ain't sunny\nLike Philly, really get silly, they spaz and they brains runny\n'Cause everybody keeps asking what's up with the strange money\nI tell 'em it's nothing to it\nAnd choreograph the murder\nTell Fyre to play the track\nAnd ask Ubi to bag the burger\nWe eating, look at 'em sleeping\nNow doobie sucker you supper\nI tell 'em \"welcome to Kansas City, duck motherfucker!\"\n\n[Hook: Tech N9ne]\nSo jittery they think I'm back on it (back on it)\nSo shivery they be like \"doggone it\" (doggone it)\nSo quivery they freeze at that moment\nNo liberty for lil bitty pretenders that want it, guess what\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\n\n[Verse 3: Ubiquitous]\nStranger things have happened\nTech told 'em and now the channel in tune\nPicked from the street and hit the beat, now the planet in doom\nMy cannon boom, if you can believe they put a man on the moon\nMission complete my landings aloe and lanolin smooth\nListen to me, oh there's so many other fish in the sea\nFrom clown to shark so which fish are you fixing to be?\nDrown in the dark or bathe in the light in the blistering heat\nOf a thousand suns son 'cause it's all 7's and 6's to me\nFelicity, the U-B-I be so promiscuous with\nThe gift that he been blessed with, Ces clips that he spit\nWith a stench of tree peace to McGillicuddy's lit\nUp in penitentiary\nCes essentially, quintessentially crescendoing, I settle beef\nKilla City could never Gepetto me\nAnd you better believe that I'm changing in red and the green and you're never ahead of me\nMan I'm a better when up in the mezzanine\nIn a settlement over the evergreen\nAnd my medicine it is acetylene, huffing this oxygen\nWhen I set it free, putting my enemies down on [?]\nAnd we ne'er gon' let ya\nLive it down again, I'm gonna get ya\nNobody wanna Erica, they wanna Ke$ha\n'Cause in America everybody is messed up\nI came to raise the Midwest up\nAnd do things with Strange and big Tecca\nThis'll be the first time the Ces heard\nPressure, give me that yessir!\n\n[Hook: Tech N9ne]\nWhoop! So jittery they think I'm back on it (back on it)\nSo shivery they be like \"doggone it\" (doggone it)\nSo quivery they freeze at that moment\nNo liberty for lil bitty pretenders that want it, guess what\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\n\n[Verse 4: Tech N9ne]\nYou see me get money, honeys\nEverything I want I really feel it\nWhen a dude see cleavage funny\nDummy if you never heard of me - Tecca N9na's a beauty\nPeep it\nA lot of groupies need it\nAnd you a chump if you don't like it\nAnd give it up backwards say pu ti evig\nYou got a pootie, I leave it so juicy when I beat it\nFeed it mooley and I eat it like sushi\nBetta heat it, steam it\nMaking 'em crazy crazy\nNever much to sway these ladies\nIf you talk about me to a bitch and she don't suck a dick\nShe gon' say she pay me\nWunderschön, Tech is second to none\nInadequate bums you come\nBut you niggas under crumbs\nDust specks\nAnd you trippin' 'cause you know deep inside your fluffed ex fucked Tech\nPaid Lebowski\nThen wanted permission to suck Ces\nBetter give it up, check it, I'm bout' to rip it up\nTech impeccable, never no better flow\nWhen I flip a cut everybody so nigga what evolution is big enough\nTo get you hickin' up when your bitch'll be licking dick and nut\nDeath'll be the only way you're cold\nSo sorry I had to give away your soul\nTecca N9na never ever give it up\nFor the crown better try him later hoes\n\n[Outro: Tech N9ne]\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down\nGive it up 'cause I never let you down", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}