{"songs": [{"title": "Streets Is Watching", "album": "In My Lifetime, Vol. 1", "year": "1997-11-04", "lyrics": "[Produced by Ski Beatz]\n\n[Intro]\nUh-huh uh huh uh\nGee-gee-geyeah\nPeeping, watching, streets\nYou boys are soft like bread\nUh-huh uh huh uh\nLive from Brooklyn\nUh-huh uh\nThe streets is watching\nCheck it, check\nUh-huh uh, check\n\n[Verse 1]\nLook, if I shoot you, I'm brainless\nBut if you shoot me, then you're famous\nWhat's a nigga to do?\nWhen the, streets is watching, blocks keep clocking\nWaiting for you to break, make your first mistake\nCan't ignore it, that's the fastest way to get extorted\nBut my time is money, and twenty-five, I can't afford it\nBeef assorted like Godiva chocolates\nNiggas you bought it, I pull the slide back and cock it\nPlan aborted, you and your mans get a pass\nThis rhyme, you're operating on bitch time\nY'all niggas ain't worth my shells, all y'all niggas\nTrying to do is hurt my sales, and stop trips to John Meneilly\nThe type to start a beef then run to the cops\nWhen I see you in the street got one in the drop\nWhen I'd rather be on tour getting a hundred a pop\nTaking pictures with some bitches in front of the drop\nThe streets is watching\n\n[Chorus]\nWhen the, streets is watching\nBlocks keep clocking\nWaiting for you to break, make your first mistake\nCan't ignore it\n\n[Verse 2]\nNow it's hard not to kill niggas\nIt's like a full time job not to kill niggas, can't chill\nThe streets is watching you\nWhen you froze your arms\nNiggas wanna test you when your gun goes warm\nCan't get caught with your feet up, gotta keep your heat up\nSweet niggas running 'round swearing shit is sweeter\nOnce you're tagged lame, the game is follow the leader\nEverybody want a piece of your scrilla, so you gotta keep it realer\nKidnap niggas wanna steal you\nBroke niggas want no cash, they just wanna kill ya\nFor the name, niggas don't know the rules\nDisrespecting the game, want you to blow your cool\nForce your hand, of course that man's plotting\nSmarten up, the streets is watching, it's on\n\n[Chorus]\nWhen the, streets is watching\nBlocks keep clocking\nWaiting for you to break, make your first mistake\nCan't ignore it\n\n[Verse 3]\nMy street mentality: flip bricks forever\nKnow me and money, we like armed co-defendants, nigga we stick together\nShit whatever for this cheddar ran my game into the ground\nHustle harder 'til secret indictment time came around\nNow you can look up and down the streets and I can't be found\nPut in twenty-four hour shifts but, that ain't me now\nGot a face too easy to trace, niggas mouths got slow leaks\nHad to hire a team of workers, couldn't play those streets\nSee out of space like Mercury, you jerking me? Hectic\nHad to call upon my wolves to send niggas the message\nIt said this: 'Let's play fair and we can stay here\nI'm trying to transform you boys to men like daycare'\nAy there's money to be made and, niggas got the picture\nStopped playing with my paper and, we got richer\nThen hard times fell upon us, half of my staff had warrants\nThe other half in the casket lay dormant\nI felt like life was cheating me\nFor the first time in my life I was getting money\nBut it was like my conscience was eating me\nWas this a lesson God teaching me? Was he saying that\nI was playing the game straight from Hell from which few came back?\nLike bad coke, pimp or die, was my mind frame bad?\nWas niggas thinking simplify was turning cocaine crack?\nAin't a whole lot of brain to that, just trying to maintain a stack\nAnd not collide like two trains that's on the same track\nBut, get my life together like the oils I bring back\nIn the bottom of the pot where the, water gets hot\nGot my transporter take it across the border then stop\nTo set up shop with a quarter of rock\nHere's the plan: for three straight weeks, niggas slaughtered the block\nBut you know the game is food, it fucked up me and my dudes\nOne drought can wipe a nigga out, faster than the cops\nAnd this unstable way of living just, had to stop\nHalf of my niggas got time, we done real things\nBy '94 became the subject of half of y'all niggas rhymes\nPublic apologies to the families of those caught up in my shit\nBut that's the life for us lost souls brought up in this shit\nThe life and times of a demonic mind, excited with crime\nAnd the lavish luxuries that just excited my mind\nI figured, \"shit, why risk myself I just write it in rhymes\nAnd let you feel me, and if you don't like it then fine?\"\nThe mind state of a nigga who boosted the crime rate\nSo high in one city they send National Guards to get me\nShit, bitch, who's fucking with that? The streets", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg"}], "artist": "JAY-Z"}