{"songs": [{"title": "You Need To Calm Down", "album": "Lover", "year": "2019-06-14", "lyrics": "[Verse 1]\nYou are somebody that I don't know\nBut you're takin' shots at me like it's Patrón\nAnd I'm just like, damn, it's 7 AM\nSay it in the street, that's a knock-out\nBut you say it in a Tweet, that's a cop-out\nAnd I'm just like, \"Hey, are you okay?\"\n\n[Pre-Chorus]\nAnd I ain't tryna mess with your self-expression\nBut I've learned a lesson that stressin' and obsessin' 'bout somebody else is no fun\nAnd snakes and stones never broke my bones\n\n[Chorus]\nSo oh-oh, oh-oh, oh-oh, oh-oh, oh-oh\nYou need to calm down, you're being too loud\nAnd I'm just like oh-oh, oh-oh, oh-oh, oh-oh, oh-oh (Oh)\nYou need to just stop, like can you just not step on my gown?\nYou need to calm down\n\n[Verse 2]\nYou are somebody that we don't know\nBut you're comin' at my friends like a missile\nWhy are you mad when you could be GLAAD? (You could be GLAAD)\nSunshine on the street at the parade\nBut you would rather be in the dark ages\nMakin' that sign must've taken all night\n\n[Pre-Chorus]\nYou just need to take several seats and then try to restore the peace\nAnd control your urges to scream about all the people you hate\n'Cause shade never made anybody less gay\n\n[Chorus]\nSo oh-oh, oh-oh, oh-oh, oh-oh, oh-oh\nYou need to calm down, you're being too loud\nAnd I'm just like oh-oh, oh-oh, oh-oh, oh-oh, oh-oh (Oh)\nYou need to just stop, like can you just not step on his gown?\nYou need to calm down\n\n[Bridge]\nAnd we see you over there on the internet\nComparing all the girls who are killing it\nBut we figured you out\nWe all know now we all got crowns\nYou need to calm down\n\n[Chorus]\nOh-oh, oh-oh, oh-oh, oh-oh, oh-oh\nYou need to calm down (You need to calm down)\nYou're being too loud (You're being too loud)\nAnd I'm just like oh-oh, oh-oh, oh-oh, oh-oh, oh-oh (Oh)\nYou need to just stop (Can you stop?)\nLike can you just not step on our gowns?\nYou need to calm down", "image": "https://images.genius.com/4253720bc19aaeec19d45e7750e318d0.1000x1000x1.jpg"}], "artist": "Taylor Swift"}