{"songs": [{"title": "The Art of Peer Pressure", "album": "good kid, m.A.A.d city (Deluxe Version)", "year": "2012-10-22", "lyrics": "[Part I]\n\n[Intro]\nEverybody, everybody, everybody\nEverybody sit yo' bitch-ass down\nAnd listen to this true mothafuckin' story\nTold by Kendrick Lamar on Rosecrans, ya bitch\n\n[Chorus]\nSmokin' on the finest dope, ay-ay-ay-ah\nDrank until I can't no mo', ay-ay-ay-ah\nReally I'm a sober soul\nBut I'm with the homies right now\nAnd we ain't askin' for no favors\nRush a nigga quick, then laugh about it later, ay-ay-ay-ah\nReally, I'm a peacemaker\nBut I'm with the homies right now\nAnd Momma used to say (say, say, say, say)\nOne day it's gon' burn you out (woo)\nOne day it's gon' burn you out, out, out\nOne day it's gon' burn you out (you, you, you, you, you, you)\nOne day it's gon' burn you\nBut I'm with the homies right now\n\n[Part II]\n\n[Verse 1]\nMe and my niggas four deep in a white Toyota\nA quarter tank of gas, one pistol and orange soda\nJanky stash box when the federales'll roll up\nBasketball shorts with the Gonzales Park odor\nWe on the mission for bad bitches and trouble\nI hope the universe love you today\n'Cause the energy we bringin' sure to carry away\nA flock of positive activists that fill they body with hate\nIf it’s necessary; bumpin' Jeezy first album, lookin' distracted\nSpeakin' language only we know, you think it's an accent\nThe windows roll down, all I see is a hand pass it\nHotboxin' like George Foreman grillin' the masses\nOf the workin' world; we pulled up on a bunch of workin' girls\nAnd asked them what they workin' with\nLook at me, I got the blunt in my mouth\nUsually I’m drug-free, but, shit, I’m with the homies\n\n[Hook 1]\nYeah, nigga, we off a pill and Remy Red\nCome through and bust ya head, nigga!\nMe and the homies\nSag all the way to the liquor store\nWhere my niggas pour up 4 and get twisted some more\nMe and the homies\nI ride for my mothafuckin’ niggas\nHop out, do my stuff, then hop back in\nMe and the homies\nMatter of fact, I hop out that mothafucka\nAnd be like \"doo-doo-doo-doot, doo-doo-doo-doo-doot!”\n\n[Verse 2]\nIt’s 2:30 and the sun is beamin'\nAir conditioner broke and I hear my stomach screamin'\nHungry for anything unhealthy\nAnd if nutrition can help me\nI’ll tell you to suck my dick, then I'll continue eatin'\nWe speedin' on the 405, passin' Westchester\nYou know, the light-skinned girls in all the little dresses\nGood Lord, they knew we weren’t from ‘round there\n‘Cause every time we down there\nWe pullin' out the Boost Mobile SIM cards\nBougie bitches with no extensions\nHood niggas with bad intentions, the perfect combination\nBefore we sparked a conversation\nWe seen three niggas in colors we didn’t like\nThen started interrogatin'\nI never was a gangbanger, I mean\nI never was stranger to the fonk neither, I really doubt it\nRush a nigga quick and then we laugh about it\nThat’s ironic, 'cause I’ve never been violent\nUntil I’m with the homies\n\n[Hook 2]\n(Just ridin’, just ridin’)\nMe and the homies\n(Bullshittin’, actin’ a fool)\nMe and the homies\n(Trippin’, really trippin’)\nMe and the homies\n(Just ridin’, just ridin’, just ridin’)\n\n[Verse 3]\nBraggin' 'bout the episode we just had\nA shot of Hennessy didn't make me feel that bad\nI'm usually a true firm believer of bad karma\nConsequences from evil will make your past haunt ya\nWe tryna conquer the city with disobedience\nQuick to turn it up, even if we ain't got the CD in\nBut Jeezy still playin'\nAnd our attitude is still \"nigga, what is you sayin'?\"\nPull in front of the house\nThat we been campin' out for like two months\nThe sun is goin' down as we take whatever we want\n\n[Break]\nAye, aye, nigga, jackpot, nigga, pop the safe!\nAye, nigga, I think there's somebody in this room!\nWait, what?!\nNigga, there's somebody in this room!\n\n[Verse 4]\nI hit the back window in search of any Nintendo\nDVD's, plasma-screen TV's in the trunk\nWe made a right, then made a left, then made a right\nThen made a left, we was just circlin' life\nMy mama called: \"Hello? What you doin'?\" — \"Kickin' it.\"\nI shoulda told her I’m probably ‘bout to catch my first offense\nWith the homies\nBut – they made a right, then made a left\nThen made a right, then another right\nOne lucky night with the homies\n\n[Outro]\nK. Dot, you faded, hood?\nYeah, we finally got that nigga faded\nI think he hit the wrong blunt though\nOoh, which one?\nWell, which one he talkin' about?\nI was finna hit the one with the shenanigans in it\nI pray he ain't hit that\nNah, that nigga straight, he ain't hit that one\nGot the shenanigans? Give that nigga the shenanigans!\nNigga, I think we should push back to the city, fo' real doe\nNigga, for what?\nWhat that nigga— what's that Jeezy song say, nigga?\n\"Last time I checked I was the man on these streets!\"\nYeah, yeah, that shit right there\nI'm tryna be the nigga in the street\nThere he go. Man, you don't even know how the shit go\nLook, here's the plan, luv\nWe gon' use the kickback as a alibi, wait 'til the sun go down, roll out, complete the mission, drop K. Dot off at his mama van, at the park\n'Cause I know he tryna fuck on Sherane tonight\nThat's what he’s not gon' do\nThen we all gon' meet back at the block at about 10:30\nThat's straight, but we should meet up around 12\nI'm tryna fuck on somethin' too\nNigga, sit yo' dumb-ass back down!\nNigga, you ain't doin' shit tonight!\nMatter of fact, nigga, get in the mothafuckin' car!\nWe finna get active!\n\n[Produced by Tabu]", "image": "https://images.genius.com/b386cd0530f6f348b478eba2927b0f91.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}