{"songs": [{"title": "Watch My Shoes", "album": "No Ceilings", "year": "2009-10-31", "lyrics": "[Verse]\nOK, No Ceilings, motherfucker, good mornin'\nDick in your mouth while you're yawnin', I'm goin' in\nGudda, why they started me? Marley, why they started me?\nI’ll bring it to your front door like you ordered me\nBack in this bitch, but a lot more rich\nOn my Papa Bear shit, need hot porridge\nGot a lot more shit than you can ever fathom\nA big-head nigga couldn’t even imagine\nThe shit I do, most doers never done\nI'mma fuck this beat, ya bitch, ooh, ya better cum\nBet I run this shit, I don't run from shit\nI'll still beat your ass like a fucking drumstick\nWeezy Fucking Baby, baby, make the ladies come quick\nThe money can’t fit in my pockets but I'll bet that gun fit\nAnd I’m so unfit 'cause all I eat is rappers\nAnd these rappers ain't shit, I like my fast food faster\nSyrup got me slow like a turtle 'round this ho\nAnd I'm flyer than the highest-flying bird around this ho\nWhat's the word around this ho? You'll get served around this ho\nYeah, you'll get served like a fucking hors d'œuvre around this ho\nI don’t splurge around no ho, no I don’t shine in front of no bitch\n'Cause after she get off my dick I be like \"Find the front do' bitch\"\nI don't know why in the fuck your bitch keep coming by\nI done fucked your bitch a hundred times\nWhat the fuck your bitch got on her mind? My fucking dick\nI call her dickhead, spicy like a Big Red\nStrike you like a Bic head, your flow sick? My shit dead\nSillier than V.I.C. said, Soulja Boy and Arab\nYou should see my 11 year old daughter do they dance\nI call it the Nae-Nae dance, proud to be Nae-Nae’s dad\nGun on the waistline, leave you in the wasteland\nWe are not the same, I am a Martian, this is Space Jam\nNo Ceilings, R.I.P., Amen\nMotherfucking caveman, beating on my chest\nYoung Money, Cash Money, and I'm eating all the rest\nNigga, no offense, sorry if you're offended\nRiding high like I'm on 54 inches\nMan, I'd rather chill with 54 bitches\nCh-chill like, ch-chill like an Eskimo, let's get mo', let's get mo' bitches\nAnd I be like \"Let's get mo' bitches\"\nMr. Officer, stop arresting your bitches\nStop lettin' the messy hoes mess with your business\nMickey Mouse cheese, hip-hop Walt Disney\nSheesh, gosh, Oshkosh B’gosh\nSmokin' on that Bob Marley, listenin' to Pete Tosh\nI-I-I do me, no, I do three at a T-I-M-E\nWhy when we say we Young Mula\nThe bitches leave y'all and relay run to us\nAnd payday comes sooner than later 'round here\nAnd you see my sharks like they got some bait around here\nHey, you better stop the hate around there\nBefore Tommy, Mac, and Nina debate around there\nYeah, you see it in my face, I don’t care\nWhole court hearing, trial, and the case around there\nI'm the best thing yet, I know I got that thing wet\nEverybody wanna be fly but don’t know where their wings at\nHuh, had to pause for a minute\nNow I'm right back in it, like the drawers of the women\nOn a scale of one to ten my girl be a twenty\nMy girls so bad make a nigga think he's sinnin'\nMy goons so gritty, my goons is so with me\nHaters gotta go on iTunes to go get me\nGators, matadors, baboons, and those grizzlies\nAll come out me when I'm on the micropho-N-E\nMic check, two, three; I am different like blue pee\nAnd my girls be half naked like Betty Boop be\nLike a hoopty, man, the boy been ridin'\nAnd I ain't gassed up, 'cause I'm more like a hybrid\nYou think I'm stuntin', but no, I'm just survivin'\nAnd I’ve been here, but my soul is just arrivin'\nLook up in the air, it's a crow, it's a robin\nNo Ceilings, full dose, I'm prescribin'\nMedication free, and for meditation we\nSmoke some better tastin' weed that you’ll ever taste or see\nS-H-A-R-P, as a tack, hotter than\nRiding through the desert on a camel back, I done been\nRiding through wherever with the hammer strapped, I ain't lying\nI can do whatever if I'm planning that\nSo I got my guns, let's dance, like FannyPack\nAnd we cook the hard, cut the soft and bring the whammies back\nMafio, bitch, where your motherfucking family at?\nCall my nigga Gudda if you trying to get your mammy back\nAll up in another nigga's woman, I be ramming that\nSeeing through these see-through niggas like they're laminate\nHip-hop so contaminate, I swear, just examine it\nAnd I'm such a philanthropist, the God to these Evangelists\nI dress so Los Angeles, but I love Miami though\nI act so New Orleans, yes, I go Pistachios\nThat means I go nuts on any beat they throw at me\nAnd the bitches is so at me, and you know what they throw at me\nHa, No Ceilings", "image": "https://images.genius.com/4a183c010cf184b2a9fecdfcb8e16142.320x320x1.jpg"}], "artist": "Lil Wayne"}