{"songs": [{"title": "Mr. Nice Watch", "album": "Cole World: The Sideline Story", "year": "2011-09-14", "lyrics": "[Intro: J. Cole]\nHey... huh, Cole World\nYeah\n\n[Verse 1: J. Cole]\nYeah, everybody got a bad side, drop, let me see that shit\nWhat you say? \"Cole ain't hot,\" what?\nWhere you read that shit? You believe that shit?\nAll cause some lame nigga tweet that shit?\nHave you seen my shows? Have you seen my hoes?\nIf I wasn't hot, would they be so thick?\nGuess not, got the game in a headlock\nI'm blasting that, I'm laughing at you old niggas, Redd Foxx\nDon't mind me, boy, I'm red hot, aw, nigga, they not\nI'm over here, I'm over there, I'm everywhere, they not (I said)\nYou'll never play me, nice try, balling in a nice spot\nNo more Mr. Nice Guy, hello Mr. Nice Watch\nYou don't want no problems, put yourself in a tight spot\nSo, you can look, but don't touch\nI stay on my toes like the White Sox, cause\n\n[Chorus: J. Cole]\nIt cost me a lot, my chain and my watch\nThey say time is money but really it's not\nIf we ever go broke girl, then time is all we got\nAnd you can't make that back, no you can't make that back\nSo let's ball while we here, let's ball while we here\nLike ain't no tomorrow, like ain't no next year\nDrink away all our problems, make it rain with no care\nLike I'll make that back, fuck it, I'll make that back, go\nUgh, nice watch (turn up)\nUgh, nice watch (I know)\nUgh, nice watch\nNo more Mr. Nice Guy\nHello, Mr. Nice Watch\n\n[Verse 2: J. Cole]\nStack on black, I ain't never been a high-roller\nNow it's racks on racks, never thought that I would ride Rover\nBut I'm back on track, add to the fact that I never really drive sober\nCole World but I'm hot as shit, do that mean that I'm bipolar?\nYoung, black and gifted, I rap like it's Christmas Eve\nCoach wouldn't let a nigga off the bench\nNow wonder why I didn't quit the team, but\nI'm cut from a different sleeve\nCole World 'til the wrist'll freeze\nHurry up with your pictures please, I gotta make history\n\n[Chorus: J. Cole]\nIt cost me a lot, my chain and my watch\nThey say time is money, but really it's not\nIf we ever go broke girl, then time is all we got\nAnd you can't make that back, no, you can't make that back\nSo let's ball while we here, let's ball while we here\nLike ain't no tomorrow, like ain't no next year\nDrink away all our problems, make it rain with no care\nLike I'll make that back, fuck it, I'll make that back, go\nUgh, nice watch (turn up)\nUgh, nice watch (I know)\nUgh, nice watch\nNo more Mr. Nice Guy\nHello, Mr. Nice Watch\n\n[Verse 3: JAY-Z]\nYeah, I got a Hublot, I call it Tebow\nI strap that bitch with a gator band\nY'all niggas ball half-time, y'all niggas like the Gator band\nY'all niggas need a time out\nWho got these niggas all wound up?\nCocksucker, I'm 730\nY'all know where y'all niggas gonna wind up?\nNo more Mr. Nice Guy, hello Mr. Nice Watch\nOnly but a matter of time 'fore I hit yall niggas with a nice shot\nY'all niggas better not call the law\nGet no blood on my Audemar\nMeaning y'all better not waste my time\nWhen y'all ready I take you all to war\nMeanwhile I'm just chopping off doors\nPut the front on the back, cause I'm back and forth\nPut the front on the back of the 'Bach like a boss\nSo I'm fronting on niggas when I'm backing off\nWhat up, Cole? It's your time, let's these niggas know\nAdjust your Rollie on these motherfucking hoes\nWhenever you ready, go\n\n[Outro: J. Cole]\nIt cost me a lot, my chain and my watch\nIf we ever go broke girl, then time is all we got\n(Ugh, nice watch)", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg"}], "artist": "J. Cole"}