{"songs": [{"title": "Fuck Your Blog", "album": null, "year": null, "lyrics": "[Verse 1: Flynt Flossy]\nCh-ch-check the blogs, what you gon' see?\nEverybody talk about Flynt Flossy\nIs he real? He can't rap\nTake that back, I rip all tracks\nAnd some blogs be talking smack\nBeen chill too long, time to react\n(Y'all got fans?) Yes, we do\nAnd sold-out shows so screw you too\nFloss got fame now, he's sexy\nDamn, these girls be all on me\nOpen those legs bon appetit\nGimme those toes when you lick them feet\nLike doggy food, I'm pedigree\nSo hating blogs get off of me\nDon't care 'bout what you gotta say\nAnd no, I'm not Charlie Murphy!\n\n[Verse 2: Yung Humma]\nI hang with the Jeep, bang with the Jeep\nGot lady fans that really wanna smang with a Jeep, y'all\nThink it's a date, won't creep, wanna peep\nTryna dig up dirt, yeah the jeeps gon' sleep\nToo difficult to figure out so little bloggers simmer down\nOr you just might lose it\nHave a seat, shut your mouth, turn us up\nTake the thinking cap off, and enjoy the music\nWhere I'm from? Does it make a difference?\nIf I said to look away, would you turn around\nAnd take me off the hit-list?\nI don't think so\nAre you mad right now? Yeah, I know\nGo home, put your thumb in your mouth\nAnd lay in a position that’s fetal\nNo time for babies\nAll the credit to the fans who ladies\nStart writing this trash in your blog\nPlay around, acting like you hate me\nYung Humma\n\n[Verse 3: Childish Gambino]\nYeah\nI'm a Mac Pro with an afro\nAnd you guys blow like the Satchmo\nAnd my cash flow out the asshole\nAnd my last show was the Camp Tour\nSaw your blog on Thursday\nYou only re-blog shit girls say\nYou didn't re-tweet my birthday\nAll your comments say \"first\" or \"so gay\"\nOkay, we the fanboys\nSex fantasies with Androids\nBut I fuckin' mean what I'm writing\nIf I see you, nigga, we fightin'\nOn that shit, take a whiff\nMove in silence like a .gif\nIf you try to hack my phone, you'll see pics when you ain't home\nMan, royalty to the maximum\nGot racks, and we stackin' 'em\nI like beef when it's actual\nI love how niggas talk that shit when you know you ain't catching 'em\nMan, racist on your page, you should be on Key & Peele\nIs that really how you feel?\nNigga, the internet isn't real!\nYeah, I saw a lady get fucked in the ass by a goat\nLaugh for an hour, that's all she wrote\nWould I laugh if I saw that shit in real life?\nYes (yeah)\nFuck your blog with a broomstick\nI could fuck your girl with a Q-Tip\nIf I see you, nigga, let's do shit\nGambino boy, you stupid", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}