{"songs": [{"title": "Takeover Freestyle", "album": "Dat Kid From Cleveland", "year": "2009-01-01", "lyrics": "[Intro]\nStop that, stop the madness! I rap off the dome! Let's do it\nJust make sure the beat is... in the room. Make sure it's... it sounds good for me, yep\n\n[Verse]\nFirst thing's first, if I ever curse, since my birth\nCame through the room, had to rock shit all day\nIf I'm in the tomb, mothafuckas' better give me room\nI'm fighting with the demons 'til im done dude\nWhile I consume the Henny\nWork for every penny I'ma grinder\nAsk about a nigga and your girl, I will find her!\nYeah, the Jesus piece blind her\nYeah, check the baby girl, right, I'm behind her\nAsk what she wanna do?\nIf she wanna sip and dip?\nIf she wanna roll baby, girl we can do it, biatch!\nI'ma show you 'bout the Double O'\nShow you 'bout Cleveland City\nShow you how da grind go\nHey! Baby girl wanna meet Yeezy?\nCome ride in the Benzy\nWe gon' take a ride, we gon' ride down in Hollywood\nHolla' at me homeboy like it's Hollygood\nYeah, I wish you would get outta' line!\nNever \"Chris Brown\" a ho, but I'm on the grind\nLemme' tell you 'bout the \"New Shit!\"\nKid Cudi in the game, mothafucker you should know it, biah!\nI'm on my mothafucking V.I\nAsk about a nigga, yeah came in so shy\nNow I'm so fly with my Bathen Apers\nMost people know the game 'cuz we paper chasers\nWhile I'm sitting back, chopping it up in Japan\nWith Nigo in the van\nAnd we rollin' like Damn!\nAnd recipt that!\nThe camo' is hiddin\nYou see it with your glasses\nMagnifyed for sizzle\nIf you see me with Snoop\nWe will be all in the coupe\nAnd we smoking the kush\n'till we up in the booth\nYeah V.I.P. is where you find me\nBut I be- the coolest mothafucka' \"G\" in the street\nNot a \"G\", as in gangster, I'mma \"G\", as in grinder\nY'all niggas know the game, man the flow is a shiner\nShining like a star, or riding past a cloud\nI scream Kid Cudi!\nI scream the shit loud\n'Cuz I'mma put it down from here to Chatanooga!\nMah' Cleveland City representers rollin' with them Moovas'\nThe niggas down in Cali', they roll up in a Bently\nWe show them what these niggas gotta grind for every penny\nHey, hey, hey, all off the dizome, all off the dizome, all off the dizome!\nShout to Busta Rhymes, shout out to Jayda, shout out to Jeezy, see you on the block man!\nHolla' atta' nigga! Lemme' know whas' good\nIf you need a hook or verse, Kid Cudi is the goodness\nOh mah' gooooodness!\nThat's some goooood shit!\nMothafuckas' need to know I spit goooood, bitch!\nI'm, I'm not a gimmick, niggas need to turn it up, mothafucka' please listen!\n\n[Outro]\nYeah, I'm extra good. Stop playing games! I'm here, I'm not joking this is a real movement...(echoes)", "image": "https://images.genius.com/1296191c98641182cc6ae0378210daf7.1000x1000x1.png"}], "artist": "Kid Cudi"}