{"songs": [{"title": "You Tried It", "album": null, "year": "2016-06-25", "lyrics": "[Intro]\nWho steals from fans from Kickstarter, my nigga? (Whoa)\nWho made a diss record about me? Who does that? (whoa)\nNah, I don’t know who that is, son (who does that?)\nThey say I rap too fast\nI got to slow it down so these fucking troglodytes can understand me\n\n[Verse 1]\nLet me tell a little story about a fuckboy named Diabolic\nBig baby, talks a lot of shit, I call him Diaperbolic\nTrolling me on Twitter, this bitch is trying to get his life acknowledged\nMaking all them threats will get you wet, don’t be hyper, Bolic\nYeah, some of these white rappers be out of pocket\nBlack rappers talk oppression and here they come trying to stop it\nPromise, I’m on another level, I’m way above their garbage\nI’m about to show these fucking devils who the true god is\nNow here come Diaperbolic on his usual ho shit (you see him)\nI tried to Google one of this loser’s songs, but he got no hits (wow)\nFocus, then address me properly as the legend\nWhen you get accustomed to privilege, equality feels like oppression, don’t it?\n\n[Bridge]\nToo many people focus on the little shit\nIlliterate, ‘till Kweli bring the light like a [?]\nSo elegant, intelligence will make you feel irrelevant\nEspecially when I just begun, the story just developing (This for Brooklyn)\n\n[Hook]\nYeah you tried it, but you failed though\nYou tried to hide it, but we can see that you’re frail though\nYou tried to fight it, but you’re real slow\nSo when you get the lightning, that shit hit you like a real blow\n\n[Verse 2]\nYou’re dishonest with a stale ass delivery, you should spit harder\nGive the fans their money back, you’re a homeless rapper with a Kickstarter (fucking thief)\nI crowdfund for the people, you crowdfund for your ego\nYour bullshit excuses about back orders is feeble, ho\nWhat you’re nervous, man? You brought up me and Don Lemon in Ferguson\nI was in the streets with the people, no media, no advertisements\nThe news cameras [?]\nYou say you’re hip-hop, but you never speak about the blacks the cops is murdering (crickets)\nBut let a black rapper try to speak on his people’s struggle\nHere you go, all up in your fragile fucking feelings with your weak rebuttals (coward)\nI know you’re mad that I topped so many white people’s favorite lists\nI go to one of your shows, but they don’t fucking exist\n\n[Transition]\nDisrespect, you’re getting checked, ho, you start it, I’ma end it though\nYou ain’t got the heart, my intuition like a stethoscope\nBe accountable for your words, make sure that shit you talk is credible\nAnd if justice ain’t served, then never ask me to let it go\n\n[Verse 3]\nNobody was talking to you, why you ‘reso fucking fragile, huh?\nGaggle cock, you’re just a fucking muppet, bitch, you’re Fragile Rock\nYou say you’re showing up to fight, but Brooklyn is kind of far\nFrom the dash dreams of a fake R.A., rhyming in the basement of Long Island bars\nBitch, you mad you’re white? You’re about to be black and blue\nStalking me on Twitter, why so fragile? No one’s attacking you\nAw, who hurt you? Point me to the place of the doll where they touched you?\nThis is a safe space, stay in your fucking place\nYou can’t silence me, my blackness is my property\nMy life matters, my fist in the air’s exactly where it’s got to be\nOppression is vulgarity, but it is the violence that they’re shocked to see\nWould you call my tactics terrorist if my name was fucking Cadmus?\nSuch hypocrisy, this a movie, is it horror or is it comedy?\nI’m [?] of this rap shit, don’t get shot like James [?]\nMy discography is sort of like Jesus with the carpentry\nDon’t ever question how I move the booth to stay on top of me\n(Bitch)\n\n[Bridge]\nToo many people focus on the little shit\nIlliterate, ‘till Kweli bring the light like a [?]\n(Wait, I got some bars for Remedy too\nIn case he wants to bring his bitch ass back up)\n\n[Verse 4]\nMy superior ability causes inferior fragility\nYou had a buzz once, but you’re soft as the fuzz on a killer bee\nI really don’t know about this beef with Remedy and Cilvaringz\nBut Remedy gon’ meet a field nigga living in the field of dreams\nFor real, nigga, you’re a philistine, lyrically I’m a guillotine\nRZA called him a thief, he’s a good actor so he might steal the scene\nI’m still a king, your respect in the game don’t amount to a fucking hill of beans\nYou’re still a fiend, crack is wack, I ain’t know that was still a thing\n\n[Outro]\nI’m done man\nMan fuck these white supremas rappers, my nigga man\nAyo, Poison Pen, Immortal Technique, come get your boy\nHe’s embarrassing your fucking crew, man\nWu-Tang, come get this Remedy nigga, man\nI’m out\nTalib Kweli\nPeace", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}