{"songs": [{"title": "Pick It Up", "album": null, "year": null, "lyrics": "[Eminem]\nYo yo, back again\nHa-ha-ha (Agh!)\nTurn it up a little bit, pick it up pick it up\nYo pick it up, pick it up\nYo pick it up\nIf you find a phone call in a Tim Westwood line, what the hell you gonna do?\nPick it up! Pick it up!\n\n[Proof]\nIf your ball falls out with a pad on the floor, what the hell you gonna do? (Pick it up! Pick it up!)\n\n[Eminem]\nWhile I'm smacking up girls to keep the hoes in check\nThe double S-Slim Shady wreck the London set\nSit back and relax while my squad smokes crack\nAnd tap your man back and be like (Did you see that?)\nAh yes, coming from the mother freaking Midwest\nLift your shirt up and let me see them big breasts\nWe molest girls three times a day, three times a night\nI got G-fulls of criminal peoples\nJumping out when we ten deep\nBeat you down and speed off in a Benz Jeep\nBrothers be like: Eminem changed his style up!\nShut the hell up, I'm still seven miles slut!\nIt's '97 so get with it\nPeep that back in the day stuff when that Infinite tape was hitting\nListen, must we forget\nI originated all that rough shit, that talk drug shit\nThat left motherfuckers who said our sound like [?]\nDetroit city is where I grew up bitch\nPeace to all my Outsidaz in Jers\nForget what you heard, this is three and one third\n\n[Proof]\nIf you got an STD and your penis falls on the floor (What the hell you gonna do?)\nPick it up! Pick it up! (Ahhh yeah yeah yeahhh pick it up, pick it up)\nIf you see a Slim Shady tape on the fucking rack\nWhat does Dre do? (ooohhhh)\n(On the uckin rack, on the uck without the f)\n\n[Eminem]\nI get deaf MCees stepped to the left\nI bust MCees and my name is Wyclef\nHow you doing? I play the banjo, piano whatever it is I rock like Barry Manilow\nYo it's Slim Shady on the freaking deck\nY'all don't check it out I wreck the Frim Shady set\nThe Frim Shady is what I said because I'm freaking drunk\nI pick it up, pick it up, I sound like a punk\n\n[Proof]\nAyo they wish that they could ban me black\nYo, you standing back\nDef methods, ayo got my hand in that\nWho ever running it, ayo you get a jammed knee cap\nMake the healthiest in your fam, handicap\nYou a fan of rap, my clan will tap your school, home, ya bitch house\nPull my nine millie, you gonna die with your fist out\nEnemas is over with\nVenomous is cobra spit\nAggressive dialect with aggressive sober pitch\nMy bionic phonics, demolish your logic, demonic can't stand the chronic impossible to hold on like vomit\nMics I palm it, cause they the bomb-it\nLike terrorist is Islamic, I enter your atmosphere like a comet\nThe new god of rap, call me bigger Thor\nSnap your back when I slap your ass in a figure four\nFrom miles around they can feel us lethal\nI make hardcore groups like Wu Tang sound like the village people (haha)\nBe no sequel, of the energize, finish style, bust 'em down right now, the winner is... me\nThen my man Mr. Paul we gonna star\nMake your heart beat for your trying get down with us\nWe ball to the end, it's time to pretend\nMy friend to the left of me, the death of me\nMe recipe to be with this don't even test MCees\nY'all can't get with us it's the dress, dress on ya", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}