{"songs": [{"title": "Play the Game", "album": "You Know What it Is Volume 3", "year": "2005-06-19", "lyrics": "[Intro- The Game]\nYou niggas is soldiers man, fuckin toy soldiers\nYeah get in line cadet; atten-HUT!\nYayo you punk-ass bitch\nI know you can't wait to get off house arrest nigga\nSo you can run the fuck outta New York, you faggot\n\n[Hook]\nNiggas love to play The Game, with 50 Cent, 50 Cent, 50 Cent\nWhy you tryin to play The Game, with 50 Cent, 50 Cent, 50 Cent\nCan't play The Game with only 50 Cent, 50 Cent, 50 Cent\nSo why you tryin to play The Game with only 50 Cent\nCome back when you got a couple dollars, holla\n\n[Verse One]\nYou gon' need more than 50 Cent to play this Game\nNigga hatin on me cause I'm doin my own thang\nI'm ain't Lloyd Banks bitch I don't share your brain\nI was in the fast lane before the G-Unit chain\nYou was hatin on Ja cause him and Irv went pop\nNow yo' ass run around singin the \"Candy Shop\"\nAfter \"Westside Story,\" I took your fans\nI seen it for myself, that bitch Olivia's a man\nI got word from the wise, nigga you dead wrong\nStole the real 50's name and wouldn't pay for his headstone\nNigga got mad when \"How We Do\" start climbin\nActin like a bitch cause he \"Got Rich and Stopped Tryin'\"\nGot niggas locked up, you a snitch in Queens\nTold 'em Touch shot 'Pac then rated out Supreme\nBut on the rizzeal, I'm talkin about you and me\nToe to toe, five-oh-C-E-N-T, faggot\n\nBanks is a bitch, 50 is a bitch\nYayo is a bitch, Buck is a bitch\nOlivia's a bitch (Jersey Devil exclusive) no\nOlivia's a man, ha ha, God damn\n\n[Verse Two]\nYou reported more names than the evening news\nI guess now Reebok makin cement shoes\nYayo the only real motherfucker from the street\nYou swingin on me like you want five heartbeats\nOkay 1, 2, 3 4 flatline\nIf you say you wrote my shit one mo' time\nYou ain't a hood nigga you \"Got Rich and Stopped Tryin'\"\nJimmy scared Chris Lighty and Jay stop lyin\nYou a snitch, what'chu know about movin in silence\nEven N.Y.P.D. can't deny it\nThe life of your story is fuckin Vivica\nBut your baby momma left you cause you couldn't get it up, bitch\n\nYayo went to jail, Banks sold a mill'\nThen Buck sold a mill' then 50 gave a deal\nTo a bitch named Olivia who titties ain't real\nNow they all hidin behind the police shield\n\n[Hook]\n\n[Outro]\nG-G-G-G-G-you niggas ain't shit, bitch-ass niggas\nI told you this shit was real nigga\nThis is Fat Rat nigga, motherfucker\nAll you get up on there and sing a few hooks\nNigga and you wanna claim a nigga fame, nigga\nYou was Ashanti, you bitch-ass nigga, fuck is you talkin 'bout?\nYou wrote somethin nigga, the real is the real nigga\nBlack Wallstreet nigga, THE Black Wallstreet nigga\nGon' tell yo' bitch-ass nigga\nI ain't gon' get up on this mic and play them games nigga\nI told my nigga let me get that last 16 nigga\nI'm rappin right now nigga, but I'm spittin the real nigga\nYou know who I'm talkin to nigga\n50! Nigga, bitch-ass nigga\nBLACK WALLSTREET NIGGA\nBrazil and Wimelton, what block you on nigga?\nWe'll be there! What block you on?\nScary-ass nigga, fuck this shit man\nNiggas woke me up with that bullshit nigga", "image": "https://images.genius.com/94aac16d9845daeefdcaedcb5eeb289b.360x360x1.jpg"}], "artist": "The Game"}