{"songs": [{"title": "Calling out names", "album": null, "year": null, "lyrics": "[Intro]\nSup Fred?\nGangsta shit\nWest Coast...\n\n[Verse One]\nNiggas with hepatitis\nUnauthorized hard-to-move arthritis\nInfected selected neglected ejected\nAnd next time ya hit the West\nYou could best believe, believe the best, mothaFUCK the rest\nWhat you supposed to be snatchin'?\nYou comin' to a world of punctured hearts and jackin'\nLethal illegal overseein' the [??] be like seagulls\nBalls in ya jaws on the hunt like bald eagles\nThe end of the sequel\nI'm the milli-mac and the strong-end and nigga to blame you\nAnd I'mma start callin' ya'll bitch niggas by name:\nMothafuck D\nMothafuck M\nOnly X I know is Xzibit or RBX\nExtraordinary, trynna snatch my bitch\nYou can have the bitch, two bitches gettin' rich\nJust to come to the West Coast and get stripped down\nBeat to death and stripped, all over a bitch\nNow it's 50 MC's that ain't worth shit\nGet ya ass kicked 50 times, beat to 10 cent\nI love New York, but the niggas that represent, ya'll ain't shit New York\nThey actin' like a bitch New York\nBuckshot, Noreaga, Jigga - cool\nCanibus, Wu-Tang, my niggas - cool\nDef Squad and DefJam, but fuck Ja Rule\nIrv Gotti I can't wait for Raekwon to break fool\nTrynna sign Daz, nigga Daz 'll sign you\nAnd when you hit the West, this is what we gon' do:\nGet ya'll niggas, slap ya'll niggas like bitches\nDippin' through the 'hood on switches\nI just bought me a Cadillac last week\nWit' a new bitch since my old bitch tweaked\nNaw homeboy, the game just ain't the same\nIf you wanna know, Kurupt said it, and I'm Callin' Out Names\n\n[Break]\n*scratching* \"Never did like him\"\n\"You know what?\" *scratching* \"Fuck, fuck, fuck all ya'll\"\n\n[Chorus: Kurupt, (Xzibit), ]\n\"It's for my niggas and my bitches\nMy bitches and all my niggas, my niggas and\nMy bitches, my bitches and all my niggaaaass!\"\nCallin' Out Names!\n(Now if it wasn't for the West\nThese rap niggas wouldn't need a vest around they chest)\n(Now if it wasn't for the West\nThese rap niggas wouldn't need a vest around they chest)\n\n[Verse 2]\nI don't give a fuck\nCatch me in da 'hood all blue Chucks, gangbanged the fuck out 'cause\nOnly thing I like that Ryde Ruff is Eve\nAnd all the rest of ya'll niggas who Ryde Ruff get these\nI'mma tell you one mo' time and I won't say it again\nKurupt said it mothafucka from beginnin' to end\nYou salamander-ass caterpillar-ass mothafucka\nFake-ass busta-ass fake killa mothafucka\nIf it wasn't for the West\nThese rap niggas wouldn't need a vest for they chest\nQuoted from a fucka homie X\nThe Lox ya'll my mothafuckas, can't forget ya'll\nAnd that's spoken on from the mothafuckin Dogg\nAll the rest of ya'll, tell ya like this\nEat a fat dick bitch\nI'm Callin Out Names!\n\n[Break]\nFuck Ruff Ryder\nFuck The Firm\nFuck Belly\nKurupt says fuck 'em\n\n[Chorus]\nNigga, now if I didn't say yo name, then this ain't for you\nBut if you try to speak then I'mma peel the paint for you\nI cause brain tumors, thinkin' of a thought to think\nLettin' off caliber's 'til the chamber need to be changed\nEmpty out, simply don't tempt me\nI empty out until everything in this mothafucka's gone\nI empty house off of empty rounds\nNow what the fuck you gotta say?\nWhat the fuck you wanna see? The homie's on my K\nI never worry 'bout none of ya'll so why now?\nI run it through and this is how you do it Dogg Pound (ROOF!)\nThe Gang, we master blast and maintain\nWeed money cocaine got us all insane\nBitch niggas remember even though the times may change\nI want Kurupt said it nigga, and I'm Callin' Out Names\n\n[Break]\n*scratching* \"Never did like him\"\n\"You know what?\" *scratching* All ya'll! \"Fuck, fuck, fuck all ya'll\"\n\n[Chorus: Kurupt, (Xzibit), ]\n\"It's for my niggas and my bitches\nMy bitches and all my niggas, my niggas and\nMy bitches, my bitches and all my niggaaaass!\"\nWest Coast! Bout Time!\n(Now if it wasn't for the West\nThese rap niggas wouldn't need a vest around they chest)\nLet's start!\nCoasta' nigga!\n(Now if it wasn't for the West\nThese rap niggas wouldn't need a vest around they chest)\nHolla at'cha boy On the West Coast get at me homie!\n(Now if it wasn't for the West\nThese rap niggas wouldn't need a vest around they chest)", "image": "https://images.genius.com/e051ff42cc180d489d4e1b4e3e2906cd.333x333x1.jpg"}], "artist": "Kurupt"}