{"songs": [{"title": "Senegal", "album": "Trouble", "year": "2004-06-29", "lyrics": "[INTRO: Akon Talking]\n\nYo. In case you ain't know, I go by the name of Akon...and I'm from (Africa! Africa!)\nHome of the Goree Islands - I'm from Senegal, West-side (Africa! Africa!)\nSo I'mma share with you where I'm from and how I was comin' up (Africa! Africa!)\n\n[Verse 1]\n\nSo what you know about the struggles that my people went through so you can live the way you live now\nSo what you know about seeing that brand new mother givin away her newborn child\nSo what you know about Mr.Amadou diallo, a Senegalese, cops shot down\nSo what you know about how people love to perceive us when we come into a brand new town\nSo what you know about the Goree Island, where all the slaves were shipped from\nSo what you know about being born in America to avoid immigration\n\n[Hook]\n\nStill from the ghetto ooohh of Senegal (Africa!Africa!)\nComin' from the ghetto ooohh of Senegal (Africa! Africa!)\nComin' from the ghetto ooohh of Senegal (Africa! Africa!)\nYes, I'm comin' from the ghetto ooohh of Senegal (Africa! Africa!)\n\n[Verse 2]\n\nSo what you know about Thiéboudieune, Yassa, Thiéré and Maafé, my favourite foods\nSo what you know about niggas throwin rocks, bustin' shots at the military invadin my hood\nSo what you know about kids with automatic machines waiting for the war to get on that side\nSo what you know about how God comes first in our lives, everything that we do is for Allah\nSo what you know about that Holy place called Touba where Prophets were born\nSo what you know about comin here, gettin money and investing it back home\n\n[Hook]\n\nRight in the ghetto oooo of Senagal (Africa! Africa!)\nGive it to the ghetto oooo of Senegal (Africa! Africa!)\nTake it to the ghetto oooo of Senegal (Africa! Africa!)\nSend it right to the ghetto ooo of Senegal (Africa! Africa!)\n\n[OUTRO: Akon Talking]\n\nNow see that's just a little piece of how it is (Africa! Africa!)\nSee, but we can come together and make it 'lot better back home (Af-ree-caa! Africa!)\nSo don't complain about how they treating you here, take your millions of dollars there, back to (Africa! Africa!)\nWe own that land, we own those diamonds, (Africa! Africa!)\nWe kings man, we dont take orders, we give em\nThink about it", "image": "https://images.genius.com/e0fbdd98225dbcf35afd9d128af8098d.974x974x1.png"}], "artist": "Akon"}