{"songs": [{"title": "Karate / Never Hesitate", "album": "Rolling Papers 2", "year": "2018-07-13", "lyrics": "[Part I: Karate]\n\n[Chorus: Wiz Khalifa & Chevy Woods]\nCup full of gin, I want her and her friend\nI might fuck once, but I never ever call again\nFucked your bitch in my vans, slapped the shit up out yo' man\nFuck the police, I go HAM\nHit her from the back like, \"Damn!\"\n\n[Verse 1: Wiz Khalifa & Chevy Woods]\nDamn! How you get all that?\nAll that OG in my joint, how you hit all that?\nI be always movin' forward, I ain't never movin' backwards\nNatural with the talent, I don't ever have to practice\nAnd since we talkin' practice bitch, I'm ballin' just like Iverson\nMy new bitch immaculate and I'm so used to traffickin'\nI be with the baddest bitch and best believe I'm stabbin' it\nI hit her with the magic stick, my car could do a magic trick\nYou can't lock me down baby, let me live my life\nWhip a four into a six, 'cause baby I'm not nice\nAyy, you ain't bossed up nigga, you can't change that price\nTried to short me, got him on the phone like, \"Make that right\"\nGot a plane to catch, we can only fuck for 30 minutes\nSay she got a man, but she say she love me when I'm in it\nI'm a real nigga, scratch my tattoos when I hit it\nFuck her real good, make her call a Uber when I'm finished\nThat's my nigga Chev, I get to the bag\nFlight came wit' a bed, yo' bitch give me head\nLike, \"Ooh!\", ooh she smart\nThis a spaceship, this a robot, watch it park\n\n[Chorus: Wiz Khalifa & Chevy Woods]\nCup full of gin, now we're huntin' her friend\nI might fuck once, but I never ever call again\nFucked your bitch in my vans, slapped the shit up out yo' man\nFuck the police, I go HAM\nHit her from the back like, \"Damn!\", (ooh)\n\n[Verse 2: Wiz Khalifa & Chevy Woods]\nI can see the plot (ooh)\nOoh, I just bagged a thot (ooh)\nDiamonds, they be dancing macarena in my watch\nSippin' Faygo, servin' Legos baby, you know I have blocks, ayy\nMother-fuck the neighbours, they was wishin' that it stop, woo\nGun in my crib and we gettin' it André\nGettin' them Benjamins all day\nNo I ain't payin' attention, my charm is a artist, my chain a magician\nPourin' and drinkin', I'm sippin', I'm in there one time roll that dank and I'm finished\nAnd my bitch bad like Dennis the Menace, I gave her the business\nI just fucked your baby mama, ooh boy, you the enemy\nText and said she sick and need the dick, she want the remedy\nI just want the headshot, I just want the Kennedy\nGot to rappin' like I'm Wopo, don't know what got into me\n\n[Chorus: Wiz Khalifa & Chevy Woods]\nCup full of gin, now we're huntin' her friend\nI might fuck once, but I never ever call again\nFucked your bitch in my vans, slapped the shit up out yo' man\nFuck the police, I go HAM\nHit her from the back like, \"Damn!\"\n\n[Part II: Never Hesitate]\n\n[Intro: Wiz Khalifa]\nPounds of good smoke\nUsed to smoke blunts, but now it's paper she roll (two)\nAnd I'm with some gangstas, gangstas\nAnd I'm with some gangstas\n\n[Verse 1: Wiz Khalifa]\nUh, heaven and glory\nShe so high tellin' me stories\nPuttin' on for the G's before me\nWe the motherfucking gang, Army, Navy, Air Force\nBlowin' KK got me airborne\nGettin' comfortable's what I'm here for\nConfidence in my approach, the fans wanna hear more\nTherefore, I built this whole belief that I'ma stand on the foundation, that's real\nSmokin' on what Beatrix wanted to do to Bill\nChill, as my driver turns the wheel\nRollin' papers, never let the paper stand still\nI'm on a mission and I can, will\nEliminate the competition to destroy the enemy, just gotta break the image\n\n[Chorus: Darrius Willrich]\nHow do I anticipate\nWhat I need in my relationship with you\nHow do I never hesitate\nWhen I'm afraid and don't understand what to do\n\n[Verse 2: Wiz Khalifa]\nGot your nigga emotional\nGoin' through his feelings\nNever fit in but always manage to get my dividends\nWe at the crib, bring your friends\nI could show you how I live\nSay you want to fuck but it depends\nI met her at Penn, leave 'em in the wind\nHardly ever call them again\nSwedish bitch, call her Harley Quinn\nNigga, your squad hardly win\nI could just send out one call them hoes fallin' in\nThey cheerin' for the kid 'cause I'm ballin'\nWinter, spring, summer, fall, I just want it all\nGot a joint rolled for each and every one of y'all\nAll my clothes is recent, all my hoes is decent\nCan't join us or beat us\n\n[Chorus: Darrius Willrich]\nHow do I anticipate\nWhat I need in my relationship with you\nHow do I never hesitate\nWhen I'm afraid and don't understand what to do\n\n[Outro]\nGot you rollin' papers, got you rollin' papers\nPullin' up to Ubers, wakin' up the neighbours\nGot you rollin' papers, got you rollin' papers\nGot you rollin' papers, got you rollin' papers\nFallin' asleep, wakin' up days later\nHuh-huh-huh-huh\nAin't it ain't about the clout man\nIt's about getting paid and smokin' up\nThat's what we about\nHah-hah-hah-hah", "image": "https://images.genius.com/a52c028d5348dd3a779d4c0e8431c193.939x939x1.jpg"}], "artist": "Wiz Khalifa"}