{"songs": [{"title": "Is There More", "album": "Scorpion", "year": "2018-06-29", "lyrics": "[Verse 1: Drake]\nOnly holdin' up I do is my end of the bargain\nOnly beggin' that I do is me beggin' your pardon\nOnly tryin' that I do is me tryin' the hardest\nOnly problems I do are math problems with profit\nOnly lyin' I do is lyin' out in the tropics\nOnly cryin' I do is cryin' from laughin' 'bout it\nOnly lackin' I can do is my lack of responses\nOnly rest that I do is \"Where the rest of my commas?\"\nStill I rise, Maya Angelou vibes\nWhen life comin' at you from all angles and sides\nAnd they don't wanna see that you smilin' from inside\nIt really boils down to how you plan to survive\nLove certain ones but never get attached to 'em\nGive 'em nice things, but what's that to 'em?\nEspecially when another girl I flew in is flickin' up in my bathroom\nAnd they recognize the bathroom\nAll hell starts to break loose in my texts\nI only tell lies to who I gotta protect\nI would rather have you remember me how we met\nI would rather lose my leg than lose their respect\nBut that'll never happen the way I'm watchin' my step\nThat ain't what I'm 'bout\nI'm in control of my destiny, never in doubt\nIf I can't make it with you, I'll make it without\nThey say take the good with the bad, I'll take it without\nHouston women I wine-and-dine and take to the house\nMy moral compass is janky, it breaks in the South\nIs there more to life than digits and bankin' accounts?\nIs there more to life than sayin' I figured it out?\nIs there more? Yeah\n\n[Verse 2: Drake]\nSweeter the berry, the blacker the juice\nThe boy is back in the booth, ready to tap into truth\nToo many lyrics 'bout houses and loot\nToo many Walt Disney characters, mouses and goofs\nI mean you know I love a challenge, but challenged by who?\nI'll let you bring a thousand recruits\nMy peers are a talented group\nBut even if you take all their statistics and carry the two\nEven if you rounded up the numbers and rounded the troops\nThere's still nothin' they could really do\nIt's too bad reality checks don't cover the balances due\nWhenever it's time to recoup\nYeah, soon as this album drop I'm out of the deal\nIn the house playin' D'Angelo, \"How Does It Feel?\"\nI got a fear of havin' things on my mind when I die\nWhat you got, time on your hands or time on your side?\nIs there any sense in doin' these songs when I'm high?\nIs there more to life than goin' on trips to Dubai?\nYachts on the 4th of July, G5 soarin' the skies\nIs there more to life than all of these corporate ties\nAnd all of these fortunate times\nAnd all of these asses that never come in proportionate size?\nAm I missin' somethin' that's more important to find?\nLike healin' my soul, like family time\nIs there more to life than just when I'm feelin' alive?\nIs there more?\n\n[Outro: Nai Palm]\nPassion, instant\nSweat beads, feel me (Feel me)\nCupid's shot me\nMy heartbeat's racing (My heartbeat's racing)\nTempt me, drive me (Tempt me)\nIt feels so exciting\nThought of highly (Highly)\nIt's yours entirely\nI'll be, I'll be more than a lover\nMore than a woman\nMore than a lover for you", "image": "https://images.genius.com/2fee80dd9aec0717aef8e1eb7aaaae4c.809x809x1.jpg"}], "artist": "Drake"}