{"songs": [{"title": "Why You Mad At Me?", "album": "Urban Legend", "year": "2004-11-30", "lyrics": "[Verse 1]\nRemember late nights earn stripes serving straight white\nTalk shit slapbox clear into the day light\nMight fuss may fight but stay tight\nKeep what the J need 'fore the lighter hit the base pipe\nIf the trap was the ocean or the sea\nYou could consider me and them the killa whales and great whites\nBefore a nigga tried to click it make them think twice\nCause they knew Cap would kill a nigga 'fore you blink twice\nThey right. I'm reciting my life\nNigga I was there no matter what: through sirens, on a silent night\nCold Sundays, slow Mondays, hot Friday nights\nTuesday, Thursdays, serving whether or not they ride tonight\nOn peaceful days, hostile evenings, even violent nights\nChip on my shoulder, hold a grudge -- cause you can die tonight\nI swear you niggas have no idea what my life was like\nBefore the bright lights and a half a mil just to grab the mic\n\n[Hook]\nIs it cause I came from the bottom to the top\nWhy you mad at me?\nMaybe cause I Spent a hundred on a drop\nWhy you mad at me?\nIs it cause I kept it pimping and stayed down\nWhy you mad at me?\nOr is it cause I am the A-Town\nWhy you mad at me?\nIs cause you a lame and I'm a \"G\"\nWhy you mad at me?\nIs it cause I got love in the streets\nWhy you mad at me?\nIs cause you know your time running out\nWhy you mad at me?\nIs it cause you know I'm King of the South\n\n[Verse 2]\nNiggas mad cause I got it like this\nGold on my wrist hoes on my dick, my dick\nBut I could give a fuck about this industry\nI'm a be the same Tip til the end of me\nThat's something you know automatically if you a friend of me\nYou question that or think other wise now you've offended me\nI came in this game not looking for a friend or enemy\nFound them both now that niggas in to me\nGot little rap niggas lighting into me\nMajor labels and police want to censor me\nFeds on my ass cause I'm in the streets\nThink I still slang, listen to lame niggas who lie to snitch on me\nIt ain't my fault that you can't picture me\nRiding in a Phantom. Man I swear I never fathomed\nAll the fame that a nigga can gain from Atlanta\nNow I'm just trying to maintain for Atlanta\nBefore niggas was saying Atlanta\nI was Grove Park, Doug High -- I stayed in Atlanta\nNow true enough I sold yay in Atlanta\nBut what is that compared to contributions I made to Atlanta?\n\n[Hook]\n\n[Verse 3]\nAy pick a reason any reason all excuses'll do\nBut man you lucky I ain't bucking like I used to do fools\nWhile you was throwing one's and two's\nI was lifting up tools and then\nShoot at his shoes just to see if he move\nOr either bust at his head to check if he dead man\nDon't talk around him cause I heard he the fed's man\nThey offer him time and they knowing he scared and tell him\n\"Give me they names or you doing the stretch man\nOr wear a wire go record what he said.\"\nAnd then you can tell his lawyer that his clients a dead man\nA rat I'm smelling. Blow? I ain't selling\nWhere you got that impression? Ain't no telling\nYes I'm a felon, why was that in question?\nWhat about all these records I'm selling?\nI'm Bankhead born and Bankhead bred\nAnd when a nigga die I'm gone be Bankhead dead", "image": "https://images.genius.com/639bf5b825c66e0f59d87574014bc4cf.600x600x1.jpg"}], "artist": "T.I."}