{"songs": [{"title": "Syllables", "album": "King Mathers", "year": "2010-12-23", "lyrics": "[Intro: Eminem]\nIt is not about lyrics anymore\nIt’s about a hot beat and a catchy hook\n\n[Verse 1: Eminem]\nIf we gotta dumb down our style and A-B-C it\nThen so be it, ‘cause nowadays these kids, geez\nDon’t give a shit 'bout lyrics\nAll they wanna hear is a beat and that's it\nLong as they can go to the club and get blitzed\nPick up some chicks and get some digits\nAnd the DJ's playin' them hits\n\"Oh, this my jam! This my shit!\nWe don't know a word to a verse, all we know is the chorus\n‘Cause the chorus repeats the same four words for us\nAnd the song's ginormous, the whole formula’s switched\n‘Cause we don’t know anymore what are hits\"\nIs it the beat? Is it the rap?\nIs it a finger snap or the same 808 clap?\nAnd how do we adapt and get TRL votes\nWhen 13-year-olds control the remotes?\nAnd Ashlee's got a brand new nose\nWe gotta put some new em-pha-sis on our syl-la-la-bles\n\n[Verse 2: Jay-Z]\nIf the emphasis on the compact disc\nIs in the beat, then I’m gon' feature Em and get rich\nAnd let Dre mix the shit and drive off in the Range Ro'\n‘Cause everywhere I go they love the \"bling bling\" flow\nBang bang, look at the way my chain glow\nThe ring on my fing’ cost your man a lot of dough\nOh, the fuck am I bustin' my brain fo'?\nIt's just the way the game go, oh, it takes two to tango\nYou call this a lame flow? You bought the shit\nI guess you to blame, too, I just found an angle\nNo more reality flow\nI’m tryna time my album droppin' with a reality show\nCock the MAC-11 in front of Hot 97\nAnd call my publicist, tell her we in press heaven\nNo one gives a shit except some kids\nThat just got into sex on the Internet\nSo you want the chat room or the house in Malibu, Em?\nYour emphasis is on the wrong syl-la-la-ble\n\n[Verse 3: Dr. Dre & Eminem]\nThey said 30's the new 20\nFunny, must mean 40's the new 30, interesting\n'Cause ever since then it's been in a sense an extension\nFor veteran rappers that are better than half\nOf the shit coming out right now, it's all trash\nThe torch is gonna burn out before it gets passed\nJay said it’s his last, then 50 and Em\nThen what? Detox drops, what do we got then?\nSo now our whole camps is running around\nScramblin' over what to do\nGamblin', and every time we put a record out\nJust lookin' for that hook (Wait, Dre, look!)\n\n[Hook: Eminem]\nShorty, I love you\nAnd you love me too\nWe were meant to be\n‘Cause, shorty, you love me\nAnd I love you too\nAnd I promise I’ll be true to you\n\n[Verse 4: 50 Cent]\nGo shorty, it's your birthday\nYou made it just in time to hear my wordplay\nIt's the kid that flip-flows who used to flip O's\nAnd run G for days, you should see how I get hoes\nI'm international, I get my dick licked 'round the globe\nI'm sick right into shows, ridin' on lolos\nPuffin' on coco, my bitch in Manolos\nDon’t fuck with the dodo’s, that's slang for dumb hoes\nI'm playin', I ain't got time to joke, joke\nYou fuck around, you could get your ass smoked, Loc\nIt's not a game, me, B, I ain't playin'\nBeat behind me playin', so you don't hear anyway\nYou don’t hear what I’m sayin'\nMe fin-nini-na, fee-fi-dididee-yay\nJust give me my check and I’ll be on my way\nSunny, bunny, money and funny\nYou ain't even listenin' and I just took your money, ha\n\n[Verse 5: Stat Quo]\nThere once was a time everywhere you turned\nShady/Aftermath was all you heard\nBut they say 50 sang too much, and Em got soft\nAnd they say Dre just fell the fuck off\nWell, fuck the fuck-offs, all y'all eat salt\nBe mad, we back, fresh up outta the vault\nOh! New syl-la-la-bles, eat ball, you fuck-offs\nYour house, your bitch, I'm getting sucked off\nEast, South, Midwest, even up North\nFallin' victim to wax, spittin', bring out the white chalk\nAll for the gingerbread, we get it and get lost\nCatch me if you can, I’m runnin' past while y'all walk\n\n[Verse 6: Cashis]\nShady made me for bringin' it back\n'Fore the history of rap is gone with a snap\nA snare and a clap, what happened to just spittin'\nAbout livin' in the mothafuckin' city you at?\nIn the grimiest condition, I breathe in drama\nKing Mathers and Cash, me, that's free karma\nI'm everything, anything you can never be\nIt's a hidden rhyme of the month deep in the beef\nI speak with a piece, no peace on my mind\nI repeat every evil deed done of mine\nNo rest contest, contract to sign\nBy blood, I'm in this squad for life\nHear about out my windpipes and I just chime\nI'm the reason you guys won't say that line\nI’m crazy, renegade like Em and Jay-Z\nI’m Rosemary’s baby, I want you to hate me\n\n[Hook: Eminem]\nShorty, I love you\nAnd you love me too\nWe were meant to be\n‘Cause, shorty, you love me\nAnd I love you too\nAnd I promise I’ll be true to you\n\n[Outro: Eminem]\nIt is not about lyrics anymore\nIt is not about lyrics anymore\nIt's about a hot beat, a hot beat\nIt's about a hot beat, a hot beat\nA hot-hot-hot beat and a catchy hook\nA hot-hot-hot beat and a catchy hook\nNobody gives a damn about them syllables\nSyl-la-la-bles, whatever they are\nI don't care if you gotta rhyme schmo, mo, Joe, toe and glow\nNow, get out there and sell some goddamn records!\nNow, get out there and sell some goddamn records!\nNow, get out there and sell some goddamn records!\nNow, get out there and sell some goddamn records!\nNow, get out there and sell some goddamn records!\nNow, get out there and sell some goddamn records!\nNow, get out there and sell some goddamn records!\nNow, get out there and sell some", "image": "https://images.genius.com/300a5ec50d3af21e9979b28e6f0451b4.1000x1000x1.jpg"}], "artist": "Eminem"}