{"songs": [{"title": "Murder My Foes", "album": null, "year": null, "lyrics": "[Verse 1]\nMy seductive introduction be specific, still elusive\nBut exclusive's what I give you when I kick it, and I'm still lifted\nNiggas can't get with Mr. Wicked\nPicture me flipping my adversaries, gettin the dick swiftly\nNiggas are swinging wild, but they styles miss me\nYou can bring that bitch but you whole click'll still get treated shitty\nBusiness never personal I'm up before the sun come up on thai\nJust a ghetto star, a dropped up double-R is what I'm riding\nNigga, if you was half the man your bitch was, bring you artillery\nWhen you come for me, cause we sick thugs\nNo hesitation when I pull and blast, cause Syke was busting\nPlus, bow had 'em ducking, screaming, \"Get they cash!\"\nSo now I got the law on me, my phone's tapped\nSo I had to send word through my little homies\nTell them niggas this the year when they pull the trigger\nShit, this is what you get, for fucking, with the wrong nigga\nThis is what you get, when you fucking with the wrong nigga\nHehehehe, yeah nigga, peep it\n\n[Verse 2]\nBefore I lay me down to sleep I, pray and thank the Lord\nFor giving me another fruitful, day\nI wanna be a peaceful man but still when niggas come for me\nAll I can see is getting 'em, killed\nFor real it's how I feel, reflect my thoughts, flowing on these reels\nMake my enemies deal with my steel, they caps peeled\nWe still cool but you played yourself\nGive him the mac and make him spray hisself, hey\nFalling legends clutching chrome three-five-seven\nPuttin two bullets to they dome, wanted to die in heaven\nWhy call in shots nobody really as clear as me\nAin't trying to help the feds get a case for conspiracy\nMurder my foes get disposed of\nWe all homies to the death, so my true niggas show me love\nGod forgive me for my lifestyle, a negative figure\nBut why they fucking with the wrong nigga, you know?\nIt's like..\nWhy you fucking with the wrong nigga..\n\n[Verse 3]\nI was raised by thugs, schooled by killers\nLearned my mathematics skills from real drug dealers\nTried to rise but they tried me\nI guess they all had to die cause we tried peace\nI die in these streets, blast 'til they recognize\nStill do or die, all my niggas gettin high watching time fly\nBest strategize on the way to profit\nBest organize how you ride so they can't stop it\nThen keep it poppin lot of busters wanna see me fall\nI fucked your bitch and now this new shit gonna' fade 'em all\nMy niggas ball made a call for some backup\nFor little' homies and my dogs in the black truck\nBuck buck was the sound as they gats burst\nNo need for ambulance, baby bring the black hearse\nShould've never fucked around buster, how you figure?\nMa kin moves on the wrong nigga, is what it sounds like\nDing ding ding.. when you fuck with the wrong nigga..\nNiggas gettin hit, when they fuck, with the wrong nigga..\nFucking with the wrong nigga..", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}