{"songs": [{"title": "Freaky Side", "album": "Dedication 6: Reloaded", "year": "2018-01-26", "lyrics": "[Intro: DJ Drama]\nDedicated!\nFree my nigga Meek Mill!\nD6!\n\n[Verse 1: Lil Wayne]\nI walk inside the strip club buy what I want then I go hey\nAll this snow up in my house these bitches call me Coldplay\nWalk inside the strip club give the baddest one a big hug\nShe know daddy been a real one aimin' at a nigga ear drums\nI don't have to beat to my own\nDon't have to keep my eyes on your rhinestones\nTake yo' watch and kill you if the time wrong, so pop off\nWe gon' kill a watch dog 'til the top dog knock a opp off\nSet his ass on fire I smell popcorn\n\n[Verse 2: Lil Wayne]\nI walk inside the strip club buy what I want then I go hey\nAll this white up in my house these bitches call me Colgate\nWalk inside the strip club buy what I want then I go hey\nAll this snow up in my house these bitches call me cold case\nWait I fuck yo' ho\nHol' on hol' up wait no they don't go they fucked the GOAT\n(Brr) hello hello hello hello I fucked yo' bae\nJust like Jodeci she tryna stay I said okay\nOkay okay okay okay\nI been a real nigga since a mini lil' nigga\nPullin' choppers like a dentist lil' nigga\nIn my skinnies lil' nigga, lookin' skinny lil' nigga\nFuck a limit lil' nigga like the Millers lil' nigga\nDoin' business lil' nigga, risky business lil' nigga\nOwn plane wit my own flight attendants lil' nigga\nLife is splendid lil' nigga, fuck yo' hoe, now yo' hoe on blow\nI swear I make her snort more blow than Pinocchio, okay!\n\n[Verse 3: Lil Wayne]\nI walk inside the strip club buy what I want then I go hey\nIt's all these hoes and only me you bitches gotta rotate\nWalk inside the plug house buy what I want then I dip, hey\nAll this coco in my bando bitches call me milkshake\nWait I fuck yo' hoe, now yo' hoe won't go\nHol' up wait I fuck yo' hoe, now you yo-ho bro\nHol' up wait I fuck yo' hoe, now that hoe on dope\nI know you know I know you know\nI know I know I know I know you know my niggas shooters\nDon't fuck wit' computers, ugliness is cuter\nAnd all this shit from Cuba, throwin' parties in the sewer\nActavis and Buddah, the dancers doin' maneuvers\nCome shake hands wit' Freddy Kreuger\n\n[Verse 4: Lil Wayne]\nWoah I walk up in the strip club buy what I want then I go hey\nI give all my hoes the green light them hoes call me no brakes\nWalk up in a night club pick who I want then I go hey\nAll these dick riders in here I don't have time for road rage\nWalk up in the strip club buy who I want then I go hey\nBitches know I keep that 'cane on me they call me old head\nWalk up in the strip club buy who I want then I go hey\nI live in Miami but the bitches call me Snowflake\nHol' up wait a second, you know what I make a second, nigga\nAll my pockets pregnant, nigga, all yo' pockets naked\nGot the sauce I got the method\nAnd of course I gotta spread it on that presidential kush\nI'm in here coughin' at election\nHol' up presidential rollie, Clinton, Obama, Reagan\nIt's all about a check, just in case you checkin'\nGot a suitcase full of weapons just in case you trippin'\nNiggas out here building cases well I like to plead guilty\nLike yo' wifey knees filthy and she likes my seeds milky\nI'm a king but can't deal me underpaid but overwhelming, wait\nLit, and my homies they some livewires, quick to do a drive by\nWherever you got Wi-Fi, lit, like a powerline\nGet right in a line of fire\nCocaine on the table make her get down to the bottom line\nMen lie, women lie, people live and lie\nSome people cross the line knowing it's the finish line\nSome even walk the line knowing it's the thinnest line\nPuttin' they life on the line then they just forget they lines\nSome people get in line, some try to skip the line\nMe I'm in the lunch line, starving like it's dinner time\nBefore the begin of time, I been in a different time\nShe pay yo ass little mind, you pay that hoe rent on time\nDamn, slime it's Carter 5 time, give me high five, my fire high\nI'm waving bye bye, to the fireflies\nI got guys on your guys guys, and your guys guys\nR.I.P. to Soulja Slim, soldiers die tryin', damn\nPurple heart, purple drank, better yet ultraviolet\nCouple bitches one Tunechi I let 'em argue 'bout it, damn\nI ran out coke last week and now it's time to re-up\nAll these keys in this Prius now this bitch a Kia\nPray for Cita, the kids and the work\nPray that none of my niggas get murked\nPray that enemy bitch ain't a nurse\nPray that one day I get reimbursed\nPray that one day I get reimbursed\nPray that one day I get what I'm worth\nNiggas wanna taste victory first, gotta work to have it for dessert\nBust a nigga head in the mall, shoot a nigga head 'til it's off\nThrow a nigga head to the dogs, can't we all just get along?\nA hearts for wings to fly, I bought them dreams alive\nI pulled my team aside to get they finger size\nYou shoulda seen they eyes, I got them rings to shine\nYou bet that we would die, the whole casino tried\nOh but when we arrived, the whole arena cried\nI swallow my pride and drive you crazy yeah I drink and drive\nPile of coke on the table break it down and put it in single files\nIt's Weezy F. Baby and she know that F is for her freaky side\n6 shit\nYeah yeah yeah yeah\nYeah yeah yeah yeah\nYeah yeah yeah yeah\nThat's some 6 shi'\n\n[Skit: Lil Wayne]\nUmm to help these multiple generations that look at me as the reason they started rapping or the reason why they rap and into music is ... uh ... it's unexplainable. There isn't a word for it. You can't describe the feeling. Um if there, you know what I mean, there's words that's probably close to it, and when I say close I mean light years away from it, words like amazing, awesome, that's probably the closest, and like I said, that's light years away from the feeling, you know what I mean. I can't explain it, it's crazy just to turn on the television, just to see my own children walk inside and be like, you know what I mean, singing something you know like what is you talking about right now, what are you singing, what are you listening to on that iPad, what are you watching? And they be like \"such and such\" and I be like, you know, what is that, and they be like, you know what I mean, \"he loves you Daddy, he loves you Daddy, he always shouting you out Daddy, he always...\" and that's when they put me on, you know what I mean. I just sounded so old just now told you how my kids be, man Drama if you keep that shit, dawg you bad, that should let you know that you're older than me", "image": "https://images.genius.com/3622689a5172c789024942436b11dce2.800x800x1.jpg"}], "artist": "Lil Wayne"}