{"songs": [{"title": "Seduction", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Intro: Eminem & Sly Jordan]\nLike a verbal seduction when\nSeduction when I tell 'em girls on the star\nI don't know, man (Geh-geh-geh)\nJust feels like we're a lot different (Right now)\n(Girls on the star) It kinda feels like (Like a verbal seduction when)\nI'm on a whole different page right now than you (Girls on the star)\nIt feels strange, but umm (Girls on the star)\nI guess it's kinda like, it's kinda like...\n\n[Verse 1: Eminem]\nI feel like I'm morphin' into somethin' that's so incredible\nThat I'm dwarfin' all competitors\nBetter get your girlfriend in check\nIt's psychological warfare, endorphins I effect\nYour self-esteem shatters as dialect comes blastin' out your deck\nShe loves me, such passion, you'd expect\nThis sort of reaction from her, yet you strong-arm\nYou're fuckin' corny, you try to turn your charm on\n'Cause you just think you're Bishop the Don Juan\nBut if you think that you're fuckin' with me, homie, you're on one\nI'm cockin' my head back like Ed Lover, \"C'mon, son!\"\nShe's on my Johnson, she brings my name up constant\nYour boys are like, \"She's fuckin' with dude, she wants some\"\nHomeboy, you better get a clue\nShe's on my dick 'cause I spit better than you\nWhat you expect her to do?\nHow you expect her to act in the sack when she's closin' her eyes\nFantasizin' of diggin' her nails in my back to this track?\n\n[Chorus: Eminem & Sly Jordan]\nSeduction, seduce\nAin't nobody who's as good at what I do\n(It's like a verbal seduction when)\n'Cause one minute she loves you, the next she don't\nShe's been stolen from you\n(It's like a verbal seduction when)\nSeduction, seduce\nAin't nobody who's as good at what I do\n'Cause one minute she loves you, the next she don't\nShe's been stolen from you\n(It's like a verbal seduction when)\n\n[Verse 2: Eminem]\nShe's sittin' there gettin' liquored up at the bar\nShe says it's quicker to count the things that ain't wrong with you\nThan to count the things that are\nThere's a seven-disc CD changer in her car\nAnd I'm in every single slot, and you're not — aww!\nI'm the logo on that Dallas Cowboy helmet: a star\nAnd I'm not about to sit back\nAnd just keep rhymin' one syllable — naw!\nSwitch it up and watch them haters not give it up\n'Cause they're just not good enough, but I'm not givin' up\n'Til I get my respect and I won't stop 'til I get enough\n'Cause I'm not livin' up to my own expectations (Aww!)\nThat hater alarm is soundin' off\nAnd Obama took the bomb from my name (Aww!)\nSo quit cryin' that I took your dame, homie, she's my dame (Aww!)\nYou sadly mistaken if you thinkin' that I'm not on my game, boy\nAnd things just ain't been the same since the day that I came forth\nYou wear your heart on your sleeve, I sport that white tank, boy\nBut you got a hard-on for me, what you hollerin' my name for?\nIt's your bitch on my dick, ain't my dang fault, man, I can't call it\n\n[Chorus: Eminem & Sly Jordan]\nSeduction, seduce\nAin't nobody who's as good at what I do\n(It's like a verbal seduction when)\n'Cause one minute she loves you, the next she don't\nShe's been stolen from you\n(It's like a verbal seduction when)\nSeduction, seduce\nAin't nobody who's as good at what I do\n'Cause one minute she loves you, the next she don't\nShe's been stolen from you\n(It's like a verbal seduction when)\n\n[Verse 3: Eminem]\nIt's like we're playin' lyrical tug of war with your ear\nYou hear it, girl? Come here\nPut your ear up to the speaker, dear\nWhile I freak this world premiere\nSeducin' her, loosen up\nWith a little freestyle that'll— wait, am I losin' ya?\nAm I makin' you look bad? Well, I got news for ya\nHomie, you losin' her\nOh wait, she don't like when I spit it fast\nAm I tryin' to show how? Let me slow it down some\nIt's still gonna be a blow-out\nYou're gonna wanna throw out your whole album\nRummage through the shit and try to salvage somethin' to see\nIf you can save any of it, punk, but none of it's fuckin' with me\nPrick, you really feelin' that bullshit?\nYou think you killin' them syllables? Quit\nPlayin', these beats ain't nothin' to fool with\nThey call me Fire Marshall: I shut the shit down\nYour entire arsenal is not enough to fuck with one round\nI am also the opposite of what you are like\nYou're a microcosm of what the fuck I am on the mic\nI am awesome and you are just awe-struck\nShe's love-stricken, she's got her jaw stuck\nFrom suckin' my dick... aw, fuck\n\n[Chorus: Eminem & Sly Jordan]\nSeduction, seduce\nAin't nobody who's as good at what I do\n(It's like a verbal seduction when)\n'Cause one minute she loves you, the next she don't\nShe's been stolen from you\n(It's like a verbal seduction when)\nSeduction, seduce\nAin't nobody who's as good at what I do\n'Cause one minute she loves you, the next she don't\nShe's been stolen from you\n(It's like a verbal seduction when)", "image": "https://images.genius.com/7b93181ae4ed594c902bf7e4e2149ca7.1000x1000x1.jpg"}], "artist": "Eminem"}