{"songs": [{"title": "U Got a Problem?", "album": "Incognegro", "year": "1999-05-16", "lyrics": "[Intro]\nYeah, come see this nigga\nCome see this ol' light-skinned motherfucker\nI seen him and I'm addicted\nDisturbing tha Peace is the clique\nPlease tell these fake-ass niggas who you are\n\n[Verse 1]\nI be that nigga named Luda\nAlert! alert! it's the ATLien intruder\nCollege Park waterboy, spit in the c-cooler\nI Jam 'til they Def, they call me Slick Dick the Ruler\nWomen, indeed! Keep yo' eyes closed\n'Bow blows, come on out them clothes, hoes\nLow-pros, low blows, watch out for the po-pos\nAnd I chose to be that number-one contender\nSouthern offender, fucking up your whole agenda\nWhen I walk, you try to run; when I run, you try to hide\nYou skate at the snap of my fingers; call me Golden Glide\nIt's you and I, do or die, who am I?\nI got a pocket full of family stones, cats think I'm Sly\nOh, why try? You one of them niggas that like to cheat death\nAnd I'm one of them niggas\nThat rip out Excursions 'til there's no seats left\nYou shit out wheat Chex, and fart out deep breaths\nWhile we toss darts at the bottom of y'all V-necks\n\n[Interlude]\nWho, that nigga 'Cris?\nAww, that nigga's aight\nThat nigga can't fuck with me, though!\nLet me get on the mic\nNigga, who the fuck are you, nigga?\n\n[Verse 2]\nI be that nigga Bronze Bridges\nPlayers wanna ball but go on strike 'cause of my pitches\nThey think I want they bitches\nBut I don't want no pigeons; yeah, pigeons can scrub my dishes\nAnd y'all don't want no scrubs 'til y'all pull out y'all extensions\nY'all in school detention and'll never come out\nMan, I'll cut your achilles tendon and put a sock in your mouth\n'Cause we the shit in the South, Fate know what I'm talking about\nYou see we Jack and we Daniel, y'all Earl and Ralph\n4-Ize, twirl it out, lick it dry and tend it to flames\nNot even Joshua can come to war with these games\nThese bitch niggas is lame and comin' down with the rain\nYou all wet behind the ears but it's a drought in your brain\nAnd that's the simple and plain mayne, three-W dot, shhhh...\nMan, that dude Luder's got some hotter-than-hot shhh...\nWell sh-sh-sh-shut the fuck up\nBefore you get cu-cu-cut-cut the fuck up\n\n[Interlude]\nHold on man, hold on, lil buddy\nY'all talkin 'bout shorty, man?\nShorty up at the radio station, man?\nShorty be popping, man!\nI'm saying, let the name be known!\nWho y'all talmbout?\n\n[Verse 3]\nI be that nigga the Lova-Lova\nI'm nastier than thinking about your parents sex each other\nNo glove, no love; better tell your dick to run for cover\nSo when lightning strikes, you'll be safe on a few rubbers\nIf you know what I mean!\nNot everybody's Mr. and Mrs. Clean\nSome get burnt like Freddy Krueger, sweet dreams\nGirls \"backin' they ass up,\" now they 400 Degreez, ha\nHot girl, trying to give to niggas up on the block, girl\nHave you screaming, \"Stop, girl!\"\nI rock worlds with my nine inch Louisville slugger\nStill wonder why they call me Lova-Lova?\nSelf-explanitor-ium, ass valedictorian\nI bring 'em Back to the Future like a '85 Delorean\nThe Luda drug emporium; on the counter prescriptions\nYou like my diction and my doctor/nurse convention\nI place the stethoscope quite close to your titty\nAnd have your buttcheeks red, man, like Uncle Quilly\n\n[Outro]\nSee me!\nSee me! Hahahaha\nCEO, D.T.P\nInfamous 2-0, Fate Forrester\n4-Eezy\nShondreezy on da beat\nPlayaz Circle,Tity Boi\nCollege Park, nigga! Virgo, nigga! What-what!\nAhh, ahh-ahh, ahh\nAhh, ahh-ahh, ahh", "image": "https://images.genius.com/9ea8d719979b4d9e52d89271c9e0b7da.1000x1000x1.jpg"}], "artist": "Ludacris"}