{"songs": [{"title": "It’s Alright", "album": "Dangerous Ground (Original Motion Picture Soundtrack)", "year": null, "lyrics": "Too Short:\nI love things about you (it's alright) you got it going on\nI'm not in love and this is not a love song, but you've been down for so long\nYou should never be wrong, I know it's all my fault\nMy mind been gone, I'm always on the chase\nLipstick on my face, when I get home\nYou gotta get on my case, cause I've been fuckin' up\nComing home smelling like her, I can't fuck it up\nCall your mama tell her how it hurts, tell her\nI'm a dog, but don't say that's all\nI came in first place at the players ball, and now I got my skrill on\nMy new grill on, put you through some shit girl\nBut I know you're real strong, you say I never find a real one like you\nBut I never take the time to feel like you, I put the game down\nThe way it's suppose to be, don't be a punk ass bitch, just get open with me\n\nToo Short talking:\nCause I'm a real player. A-yo Pimp C I don't think they feel us\n\nPimp C:\nIt's a very thin line between love and hate\nAnd it's a very thin line between a fuck and a date\nGirl you know when I was hollering at you\nI want to hit, I ain't got time to get caught with one girl and lose my grip\nI'm screaming \"Steady pimp\" you steady trying a change me\nRunning that game your mama taught you, bitch that shit don't faze me\nSay bitch I'm Pimp C, I shall be seen again\nBut all that shit your cousin told, bitch blowin' in the wind\nJust cause I pimp my pen, you think you moving in\nLike I'm a trick I'm a let you have half of everything I spend\nYou talking week rent, I'm trying to whip a Benz\nFlipping the club with pimps like Too Short, freakin' new lady friends\nTalking bout your sister saw me with a brand new bitch at the club\nComing at me with high school shit, bitch you must be in love\nSpace Age, new faze, I done payed the price\nHo you ain't bout to wreck my stable, she said I'm shift\nBut bitch that's alright\n\nPimp C talking:\nYou can keep your funky ass pussy, you know what I'm saying? Straight up\nWhat's up Short?\n\nToo Short:\nShit go back to pimpology man. These ho know it's alright though and if\nThey don't Bun will let them know\n\nBun B:\nBaby you're hangin' on a rope, it's getting crucial like dope\nI can't cope, I guess the situation has lost all hope\nCause you've obviously flipped your lid, but what's done is did\nI'm putting youup for sale for the highest bid\nOr an ass from kid shit, you got me twist-ed\nLittle Bun won't be another statist-ic, this love affair went ballist-ic\nPuttin' them messy ass hoes up in my mix like Bisquick\nAnd thinkin' you gonna leave Big Bun juiced like mystic\nNigga believe me shit's thick, loves lost\nNothing's gained but confusion about the pain\nYou losing about the same, you can't tame, a wild animal\nFeeding lettece to a cannibal, make a grown man wear goranibals\nAnd I can't handle, bullshit that's unnessessary\nYou can't handle being with a G, I guess it's scary\nIt's the very thing that put us together seperated us\nPlayer hated us, and things will never be the way it was\nI hate to say it cause, but find another shoulder to cry on\nStop gettin' your lie on, baby it's alright\n\nToo Short talking:\nI wanna dedicate this song to my bitch, quit tripping and bring your ass\nHome, baby I love you, al long as you got my money\n\nPimp C talking:\nYou know what I'm saying? It's 199 rich, know what I'm sayin', Strictly pimpin', you know what I'm talking about, I'm trying to see some papers\nSome dead ones\n\nBun B talking:\nSome real shit going on, you know what I'm saying? This is Big Bun and I'm\nOut with my nigga Short and my nigga Pimp C. You know how players is with\nBitches on your dick\n\nPimp C talking:\nPimping ain't dead, niggas just scared you know what I'm talking about?\nWhat's up Short?\n\nToo Short:\nAin't no love bitch (ha ha ha ha) Beeotch. Tell them motherfuckers at Jive\nTo quit trippin'", "image": "https://images.genius.com/1eaca4cf191ec44c1facdb2a2cb46464.399x399x1.jpg"}], "artist": "Too $hort"}