{"songs": [{"title": "Go to the Floor", "album": null, "year": "2002-11-11", "lyrics": "[Intro]\nHard-working\nThe star of the show\nMisdemeanor here\nHard-working\nThe star of the show\nMr. Mos' on the beats\nHard-working\nThe star of the show\n2000 eternity!\nHard-working\nThe star of the show\nI'm, the star of the show\nLet the show begin\n\n[*Beat changes]\nThis is a Missy Elliott exclusive\nSET IT OFF! (set it off)\n\n[Missy]\nMama say, mama sah, mama can you do this\nTalkin' like you baddest when you just new to this\nEverytime I come out yall be like 'who dat is'\nBe more like Ashanti and be unfoolish\nYou don't really want to bring it with me\nYou wear Dada, I sport the Fendi\nMy Lamborghini against your Benzi\nDirty diamonds in your ring, see mine's cling cling cling\nDing-ding-ding-ding-ding-ding-da-ding-ding\nI used to get so high they called me Ming Lee\nSpiked up my hair to look like Don King\nHaters keep on hatin cause them don't worry we\nThem don't worry we or me and Timothy\nIn my SE slim down my bodee-ee-ee\nBang bang to the boogey, oohhweee\nPlaya keep on playin watch me do my duty\n\n[Hook]\nGo to the floor (And tell me what you want)\nGrab me a drink (Then what you gon' do)\nI came to shake, shake my booty down\nDown to the beat (whoooooooop!)\nStand on the chairs (And dance like who)\nDance like the freaks (And what you came to do)\nI came to shake, shake my booty down\nLight the party\n\n[Missy]\nI'm underrated, glad I made it\nIndependent operated\nI never hesitated\nHaters keep me motivated\nThe beat is penetrated, I'll let Timmy regulate it\nAnd we laid it in the shaded drink a glass of lemonaded\nDamn I'm faded, ain't no other way to say it\nAin't that complicated\nAin't no other chicks gon' ever make me feel invaded\nI keep droppin' hits like water breakin' two centimetres\nAnd I'm dialatin', radio patient\n(Awwwwwhhh), (come on) check my translation\nFrom my observation, my fans is real patient\nThey don't wanna hear the lies so stop fakin'\nYa greasy like bacon, keep my stomach achin'\nIf you wanna battle let there be no more delayin'\nI hope ya did some prayin cause when I come swayin\nPop-she-pop-pop-pop, yeeeeaaaaaahhhhh\nSometimes I flow, sometimes quick\nYou was on the verge of kissin ass so slick\nI be on the verge of makin' hits after hits\nThis the kinda shit that tell ya mami don't forget\n\n[Hook]\n\nEverybody, move your body\nNow do it\nHere is something that's gonna make you move and groove\nHey DJ keep playin that song all night\nOn and on and on (on and on and on)\n\n[Missy]\nNow is the niggas over there\nCuz the bitches right here\nYea-yea-yea-yea-yea-yea-yea-yeah\nAll night long I hope you all came prepared\nIt's five o'clock and we ain't goin' nowhere\nAwwwwhhh yeeeaaahh, oohhhhhwwwweeee\nAnd will the guy with the cash choose me\nAwwwhhh yeeeahhh, baby\nI got a man I ain't seen lately\nGo to the floor!\n\n[Hook]", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}