{"songs": [{"title": "Niggaz Nature (Remix)", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: Lil' Mo]\n2Pac and Lil' Mo, hmm, how gangsta is that?\nHehe, ooh-ooh, ooh-ooh, ooh-ooh\n\n[Verse 1: 2Pac]\nOne two.. to a nigga nature, haha..\nNo need to cry now, go wipe your tears, be a woman\nWhy you actin' surprised? You saw the bullshit\nComin' fake hair, fake nails, fake eyes too\nSo why you, bound to fuck wit fake guys too\nAin't nothin' hard about it why you lookin' sad? Shoulda though about it\nSay you learned, I truly doubt it\nI guess you got a problem with affection, kinda loose with the love\nGettin' freaky with the thug niggas up in the club\nAsk to buy you a drink, you holla Dom Pérignon\nKnowin' I'm a cash getter still I, remain calm\nLet you chill with me; plus you was smilin' 'til the bill miss me\nThat's what you get for tryin' to dick me\nMissed me with that \"Buy me this, buy me that\" syndrome shit\nBitch get a job if you wanna be rich\nGettin' mad cause I cursed and I scream I hate'cha\nIntroduced you to a nigga nature, feel me?\n\n[Chorus: Lil' Mo]\nKissed the girls, made them cry\nThuggin' life, and gettin' high\nWhy you gangsta, all the time?\nThat's a thug's nature (that's a nigga nature)\nThough sometimes, I can deal with it\nI realize, that I'm feelin' it\nIt's a love and hate relationship\nBut that's a thug's nature\n\n[Verse 2: 2Pac]\nI'm probably too nice at first, I let you kiss me where it hurts\nMe and you gettin' busy, slingin' dick in the dirt\nMet you at a pool party it was cool to kick it\nSee us, tounge-kissin', you was truly with it\nLittle ecstacy, Hennesey, mix with me\nPicture me pay for pussy when the dick's for free\nHey now, where my niggas at? Tell these hoes\nBefore I pay; I jerk off, word to Moses\nVisions of you sittin' there sweaty and wet\nPointin' to the places that you want me to hit\nGive me room all up in the womb, call the cops\nNigga, hittin' walls 'til them bastard drop\nLabel me Makaveli - thug nigga with bite\nLivin' life like a rock star's Friday night\nMake money, get pussy, always keep a pager\nCell phone in the ride to complete my nature now!\n\n[Chorus: Lil' Mo]\nKissed the girls, made them cry\nThuggin' life, and gettin' high\nWhy you gangsta, all the time?\nThat's a thug's nature\nThough sometimes, I can deal with it\nI realize, that I'm feelin' it\nIt's a love and hate relationship\nBut that's a thug's nature\n\n[Verse 3: 2Pac]\nHaha.. started as a seed from the semen; straight outta papa's nuts\nLustin' for creamin' - bitches with big butts\nCurves make a nigga cry, tits and shit\nWhen I'm locked down beggin' you for porno flicks\nSneak weed in, help a nigga pass the time\nPut my name tattoo'd so that ass is mine\nTell everybody; 'Pac put it down for good\nA local legend through the whole hood, follow me\nI got a gun on me, goin' for none on the run baby\nYou know a nigga need some, is my son crazy?\nWhy I cry, when I be thuggin' 'til I die\nPicture a nigga in heaven, high off weed I fly\nGot me missin' dead homies wishin' phonies would die\nHit the weed and hope it get me high; dear God\nUnderstand my ways, livin' major\nBlessed with a thug's heart.. and a real live nigga nature\n\n[Chorus: Lil' Mo]\nKissed the girls, made them cry\nThuggin' life, and gettin' high\nWhy you gangsta, all the time?\nThat's a thug's nature (that's a nigga nature)\nThough sometimes, I can deal with it\nI realize, that I'm feelin' it\nIt's a love and hate relationship\nBut that's a thug's nature (cause that's a nigga nature)\nKissed the girls, made them cry\nThuggin' life, and gettin' high\nWhy you gangsta, all the time?\nThat's a thug's nature (hey, just be a nigga nature)\nThough sometimes, I can deal with it\nI realize, that I'm feelin' it\nIt's a love and hate relationship\nBut that's a thug's nature (cause that's a nigga nature)\n\n[Ad-libs: 2Pac & Lil' Mo]\nIt ain't my fault\nHehe, Q.D., where you be? Ahh\nDon't blame me blame my momma, a nigga nature\n\n[Outro: Lil' Mo]\nQDIII, and Lil' Mo\n2Pac, puttin' it down fo' sho' (\"'cause that's a nigga nature\")\nI realize, that I'm feelin' it\nCause that's a thug nature\nThough sometimes I can deal with it\nI realize, I'm feelin' it\nLove and hate, relationship\nCause that's a thug's nature (\"'cause that's a nigga nature\")\nYeah yeah yeah.. yeah yeah yeah..\nYeahhh yeah.. and that's a thug's nature\nWhere you at? Holla", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}