{"songs": [{"title": "Afterparty", "album": "Tical 0: The Prequel", "year": "2004-05-18", "lyrics": "[Intro: Method Man]\nDamn... yo, yo\n\n[Method Man]\nWoke up in the morning, like ten A.M\nWalked passed the Listerine, went straight for the gin\nOsama Bin Laden on my chinny chin chin\n\n[Ghostface Killah]\nYo, Meth, the mailman!\n\n[Method Man]\nYo, Ghost, let him in!\n\n[Ghostface Killah]\nWill you sign, Mr. Ghostface, package for a friend, here\nRight by the X, my bad, here's a pen\n\n[Method Man]\nGucci flip flops, I box my way to the kitchen\nMy keys is missin', my trees is missin'\nNo more parties, cuz Doc need to listen\n\n[Ghostface Killah]\nCuz something in my closet, go look (he's a pissin')\nI cursed this bitch out, we be laid back\n\n[Method Man]\nHalf a box of cereal gone, my milk's warm\nThta's wrong, this is John John, pro and con phenomenon\nStretch with a morning yawn, party 'til the break of dawn\nLadies throw your faces on, sing it when the break come on\n\n[Hook: Method Man (Ghostface Killah)]\nIchi, ni, san, shi\nBoats (suites) dough (beats)\nNo cat give you these, rap flow triple g's\nMeth, Ghost, Killa Beez, you know we ride\n\n[Ghostface Killah]\nWu-Tang, the best rap group of all time\nRush little shotgun, rest around nine\nRefrigerator, fish and sweets with no swine\nDirty and Meth guest room with four dimes\nAnd U-G. had a Masta headache\nHim and Genius flew back from, Uganda black, gettin' that cake\nWhere Divine at? Wine at\nTell a DJ to rewind that, Killa killed it wit a blind back\nDime sack, you know we blew that wit the cognac\nThem bowling ball lead head niggas, we call them pawn yacks\n\n[Method Man]\nI say my girl, like to party all the time, Ghost\nSpend up my ends, every week, she always cryin' broke\nThank God it's friday, I just got paid\nFeelin' good like I just got laid\nThe next drink's on me, instead of, oh God, you think O.G\nWhite girls they comin' out, like they Pink on E\nSo you better get the party started, we get it crunk regardless\nWe got the 'dro and hypnotic, them kids is puffin' garbage\nIs where it's crackin' at, Street is you passin' that?\nMami's is grabbin' ass, Johnny, I'm grabbin' back\nYou know my habitat, you know my peoples\nIf you wit me, where you at\nThere ain't nothin' compared to that, come on!\n\n[Hook: Method Man (Ghostface Killah)]\nIchi, ni, san, shi\nBoats (suites) dough (beats)\nNo flows ill as these, M and Ghost, nigga please\nMeth, Ghost, Killa Beez, you know we ride\n\n[Hook 2X: Method Man (Ghostface Killah)]\nI got me some Seagram's gin\nEverybody got they cup, but they ain't chipped in\n(These cheap muthafuckas be grown ass men\nTight muthafuckas finish your shit then they bounce off with them)\nCome back again, drunk off your gin\nAnd when they try to get you for they ends, that's no friend\nThat's no friend, eh, eh\n\n[Outro: Method Man]\nYeah, greedy muthafuckas, always wanna get high\nBut never wanna buy, first one to come to the party\nLast one to leave, man, fuck all that\nAiyo, Mr. Streetlife, tell 'em where we come from man..", "image": "https://images.genius.com/b570b137bfca42564ca115c745cf3a4c.500x500x1.jpg"}], "artist": "Method Man"}