{"songs": [{"title": "Shit On You (Snippet)", "album": "Detroit, What? (Snippet)", "year": "2000-01-01", "lyrics": "[Intro: Proof]\nLet me tell y'all one motherfuckin' thing\nWe done got cheated out the Blaze battle\nWe done won the Source battle\nWe done had two members in the unsigned hype column\nWe ain't got shit to prove to y'all motherfuckers\nWe done ruled the underground, grit's going over the top\nYou know what I'm saying?\nAnd all the motherfuckers that keep poppin' off at the lip\nI got one motherfucking thing to tell y'all\nI'll-\n\n[Hook 1: Eminem]\nI'll shit on you -- da da, da da, da da\nI'll shit on you -- da da, da da, da da\nI'll shit on you -- da da, da da, da da\nI'll shit on you -- da da, da da, da da\nI'll shit on you! I will shit on you\nI'll shit on you! Girl you know, its true\nI'll shit on you! Bitch or man, its true\nI'll shit on you! I will shit on you\n\n[Verse 1: Swifty McVay]\nI remain fatter than gluttony\nTaping bombs to the back of record companies\nBlow 'em up if they ain't want me\nThe national guard, they scared of huntin' me\nI love beef; I got you hoes ducking me\nA drug thief, bitch I'll take your marijuana\nThese slugs'll keep your ass away from my corner\nI drown niggas in hundred degree saunas\nYou can act a fool if ya wanna (biatch!)\nIt's this lyrical piranha\nStrapped wit a grenade, in the pool with ya mama\nAttack her by the legs then I pull her to the bottom\nTwist nuttin' up like a condom\nSlap it if you fuckers got a problem\nWhen I see 'em, you hoes ending up in a fucking mausoleum\nOr hidden in the trunk of a black and gold BM\nPull in the garage while you screaming\nKeep the motor on then I'm leaving (I'll shit on you!)\nI'll shit on you!\n\n[Hook 2: Eminem]\nI will shit on you I don't care who you are\nI'll shit on you!\nI don't give a fuck about you or your car\nI'll shit on you!\nFuck your house, fuck your jewelry and fuck your watch\nI'll shit on you!\nFuck your wife, fuck your kids, fuck your family\nI'll shit on you!\n\n[Verse 2: Bizarre]\nI'm a alcoholic, where's the fucking toilet?\nPass the hot dogs (Bizarre aren't you Islamic?)\nBitch, shut your fucking mouth\nI'mma keep eating 'til Richard Simmons comes to my house\nWith a chain saw to cut me out (me out, me out!)\nI'll fuck your wife, I had sex since I met her\nToo busy fucking-\n(fades out)", "image": "https://images.genius.com/ad7f2e74e0a3f8350a8e678a37d1a8fa.600x925x1.jpg"}], "artist": "D12"}