{"songs": [{"title": "AAAHHHH!!!", "album": "BR9", "year": "2016-12-13", "lyrics": "[Intro: Busta Rhymes]\nYeah, yeah\nWoo! Yeah, woo! Yeah, woo! Yeah\nLook\n\n[Verse 1: Busta Rhymes]\nNiggas want me to busta rhymes, so ironic\nIt's Busta Rhymes, so iconic\nNiggas can't fuck wit the kid, you know the logic\nBounce dookie should move, 'fore we make it a topic\nI'm shitting on niggas to where I need a colonic\nOr when I'm showing up and only collecting the profit\nSha, sha, sha, que sera is how I picks it up\nMaking niggas put holes in the wall is how I rip shit up\n'Tron, a lil yak and some kush is how I mix it up\nI love the way she gets down on her knees and how she licks it up\nThe way a nigga give you the shit and how he thinks it up\nLook, pardon me, yeah look, peep how I lift shit up\n\n[Hook: Swizz Beatz]\nWoo! Yeah, yeah\nI just dropped a big bag\nOn a brand new\nAAAHHHH!!!\nYeah I just pulled up to the club\nWith the top all gone, new\nAAAHHHH!!!\nWoo! Went shopping for four days, four days\nRiding with the, riding with the\nAAAHHHH!!!\nRight! I don't really give a\nAAAHHHH!!!\nNow let the beat drop\nClap on, now we gon' clap on\nClap off, clap on, yeah we gon' clap on\nNigga talking all crazy, strap all on\nTell my homies clap off from the clap, Let's get it!\n\n[Verse 2: Busta Rhymes]\nClap off, clap on, bitch see we back on\nWall in the west wing, hang all my plaques on\nI be blacking in this bitch 'til the whole track gone, King Kong\nGot 'em bouncing off the walls, ping pong\nRolls Royce Wraith seats, I'm resting my back on\nBottles of 1942, getting my drank on\nFunny how my mommy say she love my new rap song\nHow a nigga keep it fresh, Balmain slacks on\nNow that's wrong, she ripping off her new black thong\nNow she bugging, shorty, can't believe the dick that long\nCollapse on the couch inside of my mansion\nWish y'all niggas could've really seen my reaction\n\n[Hook: Swizz Beatz]\nWoo! Yeah, yeah\nI just dropped a big bag\nOn a brand new\nAAAHHHH!!!\nYeah I just pulled up to the club\nWith the top all gone, new\nAAAHHHH!!!\nWoo! Went shopping for four days, four days\nRiding with the, riding with the\nAAAHHHH!!!\nRight! I don't really give a\nAAAHHHH!!!\nNow let the beat drop\nClap on, now we gon' clap on\nClap off, clap on, yeah we gon' clap on\nNigga talking all crazy, strap all on\nTell homies clap off from the clap", "image": "https://images.genius.com/8f51b0d05562038921651c1a9d7dc2f2.1000x993x1.jpg"}], "artist": "Busta Rhymes"}