{"songs": [{"title": "Gangsta Noize", "album": "G-TV (Bonus Music CD)", "year": null, "lyrics": "[Kurupt]\nSmash\nGangsta shit, gangsta shit\nYeah y'all won't respect that gangsta shit, nigga\nCalifornia's Finest under the sun\nYeah, who want see me on the 101, bustas?\nShut up punk\n\n[Hook]\nWho's that makin that Gansta Noize? (That's Kurupt)\nDippin through just not giving a fuck, bitch (That's Kurupt)\nGangsta's in this muthafucka givin it up (That's Kurupt)\n\n[Kurupt]\nBitch Nigga, touch me, nigga, and I touch you back\nRush me nigga and I'll pop off this\nAnd push you back, chest hit back\nShells up and the West hit back\nSo bitch nigga just get back\nBitch boy just don't know how to act\nI'ma have to clap like an applause and make him sit back\nCus bitch boy just won't get back\nFocus like scanners, file load to memo randoms\nI'ma leave ya numb, peel like bananas\n\n[Hook]\nWho's that kickin that gangsta shit? (That's Kurupt)\nDippin through just not giving a shit (That's Kurupt)\nGangsta's in this muthafucka givin it up (That's Kurupt)\n\n[Kurupt]\nDeal me in and I'll deal you out\nLiable to put something in your mouth\nMake my day and I'll make ya year\nJust when you appear\nYou make a U-turn, and then disappear\nI guess it's clear\nNo bitch ass bitch made muthafuckas allowed in here\nGive me a pistol I'll give you a cannon\nPut it to your face and then start rammin\nI heard gangsta rap music, they're gonna start bannin\nI'm planning, to make gangsta rap music in Canada\nTo shift the parameter\nQuake the equator, Young Gotti muthafucka\nEminent danger, bitch nigga\n\n[Hook]\nWho's that makin that Gangsta Noize? (That's Kurupt)\nDippin through just not giving a fuck, nigga (That's Kurupt)\nGangsta's in this muthafucka givin it up (That's Kurupt)\n\n[Tri]\nMy super duper, coupe maneuver\nSome think I'm too cute to shoot the Rugger\n\n[Roscoe] (2x)\nNow how many hoes want nut all over they face? (Face)\nThrow your hands all over the place\nHow many niggas all over they case?\nThrow your hands all over the place\n\n[Hook]\nWho's that makin that Gangsta Noize? (That's Kurupt)\nDippin through just not giving a fuck, nigga (That's Kurupt)\nGangsta's in this muthafucka givin it up (That's Kurupt)\n\n[Kurupt]\nI can't smoke no more weed in the red form\nI need to concentrate in the pill form\nCall the homies, start off the swarm\nShow 'em it's on\nFirst one to bomb, Southern Vietnam\nCalifornia Cong\nStudied game like the Muslims studied a Koran\nBack On The Smash, Kurupt and Daz\nTwo to the spleen, Kurupt and Mike Dean\nThe hoes gotta go, Kurupt and Roscoe\nBlastin Roscoe into Young Assassins\nThe methods of a ridaz, Snoop and Tha Eastidaz\nTwo to the head, yeah, what up Fred?\nWith so many hoes givin all the head\nCan't you see Nate and Warren G?\nThese the muthafuckas that be rollin with me\nWe control whole, patrol the streets, nigga\nInquiries of vocabulary you need\nBut we ignore bitches when they tryin to speak\nTalking 'bout..\n\n[Hook](2x)\nWho's that makin that Gangsta Noize? (That's Kurupt)\nDippin through just not giving a fuck, nigga (That's Kurupt)\nGangsta's in this muthafucka givin it up (That's Kurupt)", "image": "https://images.genius.com/89dacfaffd6a17ef6bdc2beb2d810fb1.339x475x1.jpg"}], "artist": "Kurupt"}