{"songs": [{"title": "Pimp Me", "album": "Gettin’ It (Album Number Ten)", "year": "1996-05-21", "lyrics": "So what are you sayin Todd?\nSo what are you sayin Todd?\nBeyotch!!\n\nHa-ha-ha-ha yeah\n$hort Dog still in this mothafucka for the nine-six\nLike this\n\nHere comes the hogg with the big nuts\nHe's flowin like a breeze\nI said here comes the hogg with the big nuts\nAnd he's flowin like a breeze\n\nToo $hort:\nThis ain't Halloween, ain't no trick or treat\nYou young silly ass hoes can't get shit for free\nI give a fuck about what niggas been buyin you\nI'm $hort Dog bitch, I ain't tryin to\nGet on your good side, you better get with me\nSo we can roll in luxury\nAround the world, gettin money\nI'm pimpin hoes on Sunday\nI'm the kind of nigga that you'll work all night fo'\nWon't discriminate, I'll pimp a Chinese-White ho\nYou never seen money with a black man's face\nBut I swear mothafucka I done had my taste\nCan't slow down, full speed ahead\nI'm laughin at you squares sayin pimpin is dead\nThey say sex can kill, you catch AIDS and shit\nBut the fact stand, hoes get paid from tricks\n\nI'll never let a ho, pimp me\nI'll never let a ho, pimp me\nAnd all my hoes say (pimp me daddy)\n\nKool-Ace:\nI'll never ever, be pimped again\nI had to be played once to really understand\nBut I appreciate it, $hort cause I related\nI probably stuck my game and ah participated\nGot baptised, it wasn't a dream\nNow I'm mackin with the Dangerous Crew, and smokin green\nHit old school playas up, on their help\nAnd we all decided to take a trip\nWe on a world tour, checkin our clientele\nWant to see how much pussy these hoes can sell\nFeds say this crew is scandelous\nWanna charge us all for pimpin and panderin\n]From the Mississippi Valley to the A-T-L to Chi-town, Oakland\nThese bitches will understand\nP-I till the day I D-I-E\nHa-ha you'll never pimp me!!\n\nI'll never let a ho, pimp me\nI'll never let a ho, pimp me\nAnd all my hoes say (pimp me daddy)\n\n*Sir Captain & Sir Charles Talking*\nSir Charles: Ahh Sir Captain...\nSir Captain: Yeah what's goin on Sir Charles?\nSir Charles: Man what ever happened to that great fine bitch\nYou had the other day?\nSir Captain: Yeah, that old bitch come to me the other day man\nTalkin about she wanna do her old pimpin, I knocked that\nBitch down man, I asked that bitch \"What part that you\nUnderstand bitch? Because I don't undertstand none of it\nHo, you's a ho to me bitch, you done still ho ho ho...\nSir Charles: So what you sayin, you never let a bitch pimp you man?\nSir Captain: Never man. Hey Sir Charles, what about that little\nExpensive broad I seen you the other say with you know, that little cutie-pie\nThat little\nBaby girl?\nSir Charles: Oh you talkin bout Unique, my little-bitty bear...\nSir Captain: Yeah, she that little old six-pence lookin girl, you know she\nLook kinda fine to me...\nSir Charles: Man that girl went to work the other night and brought me $999\nOff the street...\nSir Captain: You go boy...\nSir Charles: She asked me would I loan her $10 so she can get me a grand\nI said bitch you got to be crazy, go turn another date and\nPut\nMy money in my mothafuckin hand...\nSir Captain: Ah man, ain't nuttin but pimpin there...\nSir Charles: This ain't no joke, I'll never let a bitch pimp me...\nSir Captain: Never, never...\nSir Charles: Say man you know we rollin with this Dangerous Crew...\nSir Captain: Oh yeah, with ol' $hort Dog, you know he good for the pimpin\nSir Charles: He got ol' Suga Ray and Ace over there\nSir Captain:You know Goldy comin back in here, you know Goldy comin back in now\nSir Charles: Oh shit, it's gonna be big pimpin in this Atlanta, G-A\n\nGoldy:\nI be flippin hoes like a spatula, rakin em in like a new Acura\nBitin em with this game makin em mines for life like Dracula\nIt's like hypnosis, I pimps your mother, I pimps yo' sis\nHoes be nothin but slaves for me, ready to go to their graves for me\nI'm lookin for a ho to knock, hit with a Goldy lock\nGet at the ho, spit at the ho, now I got ho rollin cock\nPimpin ain't easy, I went from jeans, t-shirts, and tennis shoes\nTo gators and suits and zebra hats, my pimpin tools, I win or lose\nMy hoes be bringin me hoes, now I got more hoes than a golf course\nWith ass like a soft horse, I get em with game and never with all force\nWith a pimp stick on a pimp throne, that lazy ho better get goin\nHo ain't workin on Daddy's scratch, she bout to feel the grill of a Cadillac\nI was yours when the ho wouldn't leave me, cause an agry ho would decieve me\nBut I'm ten G's ahead of that ho, you want your shit better get it and go\nBut I be laughin with Sir Captain cause he always handle what happen\nFall in love with the pimpin and gettin ho money and be like fuck this rappin\n\nI'll never let a ho, pimp me\nI'll never let a ho, pimp me\nAnd all my hoes say (pimp me daddy)\n\n*Sir Captain & Sir Charles Talking Until Fade*\nSir Charles: Hey Captain, ain't you glad pimpin ain't dead?\nSir Captain: Yeah, one time I thought the pimpin was dead man, all the\nBitches of mine ran off, I called the Pimp God right, and he put\nMe on hold and said his bitch run off. I thought pimpin' was dead\nThen, but he called back though and said it was all good...", "image": "https://images.genius.com/7bf671ac92a336bfe3f391d4c6e34ef9.500x500x1.jpg"}], "artist": "Too $hort"}