{"songs": [{"title": "Gangsta (Street Hop)", "album": "Street Hop", "year": "2009-10-20", "lyrics": "[Intro: Trick Trick]\nYou goddamn right, nigga\nThis a no fly zone\nI ain't no motherfucking teacher so I ain't got no god damn passes\nYou niggas better get permission, bitch\n\n[Verse 1: Royce Da 5'9\"]\nI'm from the motherfucking D, nigga\nHome of the hit-man, murder mitten, bleed nigga\nIf you a rapper, I diss your ass\nThen get mad at you for getting mad at me\nThen when I see you, I'll flip your ass\nIt's quite easy, this big clip is for your whole motherfucking family\nIt's even for grammy like Weezy\nBeef is familiar, I ain't trying to give your ass no goosebumps\nI'm tryna make you feel like I'm 'bout to\nJump out your motherfucking speakers and kill you\nI'm one word, truest\nI'm P. Diddy's go-to guy recording at the lab Yung Berg's shoe is\nNiggas'll ride for you if you ride for you and\nThey see it, I got an AK that I come at you and HD it\nI don't play that shit\nShow me a target, I'll spray that shit motherfucker\n\n[Hook: Royce Da 5'9\"]\nI keep it (gangster)\nLong as I'm alive, I'mma keep it (gangster)\n(Can you feel my trigger hand?)\nIt's whatever, my nigga, Say whatever, my nigga\nGo wherever, my nigga, just keep it (gangster)\nAnd long as they alive, they gonna keep it (gangster)\n(Can you feel my trigger hand?)\nIt's whatever, my nigga. Go wherever, my nigga\n\n[Verse 2: Royce Da 5'9\"]\nThis is shooter music, I don't need to verbalize it\nWe play the drums with the K's, I know that you heard us vibin'\nMy auto-matic's faster, stronger\nBeta drums the size of Kanye's mullet in that Aston\nOnto fatigue, You ain't dead wrong make you wronger\nIt's me, the best out, as far as passes\nI'm like Maino, my nigga, you can be as diplomatic\nAs you wanna, professional as you wanna\nIt's gonna still get gangsta cause you fresh out\nGo ask, I take your baby mama shopping\nNo she ain't worth 50 cents just to get at your ass\nI'm so petty, any beef I'm so ready\nNow you trying kick it like you trying to go steady\nTrying to build a motherfucking relationship\nNiggas dissing and kissing and making up, I hate that shit\n\n[Hook]\n\n[Interlude: Trick Trick]\nOh, Royce, you know what's fucked up?\nNow we gotta make offers that these bitch ass niggas can't refuse\nSee, these niggas think they can buy respect\nThey never even earned respect\nThey never learned respect\nSo from here on out, Detroit is officially a no fly zone\nYou heard it, all these bitch ass niggas\nDon't come to this motherfucker without permission\nPlease don't make me have to demonstrate\nIt's not about attention\nIt's about the seriousness of what you bitch ass niggas think is a fucking joke\nY'all wanna play? I'm not fucking playing, man\nI'm not fucking playing, man, okay\n\n[Hook]", "image": "https://images.genius.com/13187be577e518c77f5c6ac278ec366a.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}