{"songs": [{"title": "Georgia’s Most Wanted", "album": "Mr. Zone 6", "year": "2010-07-19", "lyrics": "[Gucci Mane-Intro]\nWhat it do\nIts Gucci\nMic check.....\nYeaahh....Yeah....Yeah....Yeah\n\n[Bridge]\nATF (ATF),DEA (DEA)\nGeorgia wanted (Georgia wanted), murder warrant (Murder warrant)\nGBI (GBI),FBI (FBI)\nHouston Texas (Houston Texas), Michigan (Michigan)\n\n[Gucci Mane-Verse 1]\nI spent my winter in a jail, so I'm ballin all summer\nBad bitches on my tail, hunt me like a bounty hunter\nNever shed a tear for me, my momma never had a daughter\nPussy niggas scared of me, see through you like a bottled water\nGucci Manes a bottle popper, 100 bottles open up\nStill slangin opium] smoking at the atruim\nIn summerhill I'm making plays, right there by the stadium\nMove work like a gymnasium, yo birds might end up taking them\nWomen take one look at me, recognize the crook in me\nAnd if I go away they come put money on my books for me\nGeogia Wanted (georgia wannted), Murder Warrant (murder warrant)\nCatch me if you can, I'm in Cali homie (Cali homie)\nHouston Texas (Ohio), Michigan (Birmingham)\nSuspicious feds talkin bout I'm trafficking (Trafficking)\nCause I'm African (African), American (American)\nSuccessful, Confident and a Celebrity (Its Gucci)\n\n[Hook]\nATF (ATF) DEA (DEA)\nGucci Mane, I'm Tryna sell 10 bricks a day (10 bricks a day)\nGeogia Wanted (Georgia wanted), Murder Warrant (Murder warrant)\nCatch me if you can, I'm in Cali homie (Cali homie)\nGBI (GBI) FBI (FBI)\nYou say I sold you what? you a fucking Lie (Fucking lie)\nHouston Texas (Ohio), Michigan (Birmingham)\nSuspicious feds talkin bout I'm trafficking, I'm a Celebrity\n[Gucci Mane-Verse 2]\nSnitches see my picture tryna point me out the line-up\nNow its 70k a show, promoters screamin back the line up\nPay my barber 2-300 just so he can keep my line up\nCEO Gucci Bricksquad, bet you wanna sign up\nI'm laughin at these rappers, swag dead like a carcass\nYou a thirsty starving artist, I'm not an artist I'm an arsonist\nTrappers hear my voice on it, heavy I rejoice on it\nI'm Georgia's most anticipated, screaming who you want it with?\nBeef you want then beef you get, murk yo friend then plead the fifth\nTear drops on my face, so I sterotype my fuckin self\nI'm the last real nigga left, man its suckas everywhere\nNever infiltrate my circle, how could you when you a square?\nSittin in the electric chair, life flashing in front me\nThinking back, I'm walking bare foot, hardly nothing to eat\nEveryday I promised me, til they come and punish me\nI'll keep chasing money skee, and let these hoes keep chasing me\n\n[Hook]\n\n[Gucci Mane-Outro]\nATF (ATF), DEA (DEA)\nGeorgia wanted (Georgia wanted), murder warrant (Murder warrant)\nGBI (GBI), FBI (FBI)\nHouston Texas (Houston Texas), Michigan (Michigan)\n\nYeah.......Yeah.......Yeah.......Yeah.......\nGucci...........", "image": "https://images.genius.com/0ad1fedc3017fe83eecd678c80831b9e.400x400x1.jpg"}], "artist": "Gucci Mane"}