{"songs": [{"title": "Shut ’Em Down 2002", "album": "Genesis", "year": "2001-11-27", "lyrics": "Yeah.. back by popular demand, it's about to get Godly\nYeah.. hold it now! AOWWW!\nC'mon, c'mon (c'mon).. yeah\nHuh.. c'mon, c'mon (c'mon).. yeah\nHuh!\n\n[Busta Rhymes]\nBear witness on the way we stay cuttin 'em down\nIn two-thousand-two, shuttin 'em down\nHave you sippin on it 'til you start suckin it down\nI hope you know that we ain't FUCKIN around\nNiggas you betta BELIEVE when you see me the shit be double trouble\nI overLOAD and take this SHIT to another level\nI shut it down, sho' nuff, pack ya bags\nLet me work, make it hurt, cause I'm next wreck\nLay flat nigga hit the deck, or face big DISrespect\nIn addition the SHIT we wreck\nFirework flow, spit and make a BIG effect\nBang it in the truck until ya whole SHIT eject, c'mon\nStop nigga, close ya shop\nSCUD missile launched fire burn quick, every SHIT we drop\nFrom the GROUND with another sound yes we put it down\nAnd always BOOM and pound, so we shut 'em down\n\n[Hook: Busta Rhymes] + (Pete Rock)\nI shut 'em down (shut 'em down, shut shut shut 'em down)\nI shut 'em down (sh-sh, sh-sh, shut shut 'em down)\nI shut 'em down (shut 'em down, shut shut shut 'em down)\nI shut 'em down (shut 'em, sh-shut, shut shut 'em down)\nI shut 'em down (shut 'em down, shut-sh-shut 'em down)\nI shut 'em down (sh-sh, sh-sh, shut shut 'em down)\nI shut 'em down (shut 'em down, shut shut shut 'em down)\nI shut 'em down (shut 'em down, shut shut 'em down)\n\n[Busta Rhymes]\nHah!\nOne two three four five six seven eight nine\nComin THROUGH, betta tuck in ya shine\nOnce ya lookin for the HEAT, if ya seek it will find\nI had these devils watchin me sayin these sneakers is mine!\nNow hold up - we drop the bomb first then get under ya mom's skirt\nTo get her frenzied like a motherfuckin rock concert\nWhile you're busy and tryin to FIGURE what the God's worth\nI'll malfunction your plans 'til the motherfuckin sound work\nNow I'mma CUSS when I BUST ya ass\nAnd leave 'em stiff when I hit 'em like a MUSTARD gas\nSteam fire when I puff, then I flick the ash\nYou wack and I had enough, put your shit in the trash\nNow you know we got the shit in the smash\nWild until you slip and you crash, y'know we keep the SHIT in the stash\nFrom the GROUND when we come around, yes we put it down\nAnd always BOOM AND POUND, when we shut 'em down\n\n[Hook] - w/ minor variations\n\n[Intro to \"Genesis\"]\nAs we rockin you all to the future\nAhhh, we come to give you that\nOperatin like we be official\nYeah, we come to multiply\nAnd we're plannin the scheme for the long win\nYeah, our shit be always right\nEvery move you'll see how it's related..", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}