{"songs": [{"title": "Paramedics", "album": "The R.E.D. Album", "year": "2011-08-19", "lyrics": "[Intro: Young Jeezy]\nMaestro-Maestro\nYeah, see, it's that real nigga shit they been waitin' on, nigga\nYou know? That West coast shit, that down South shit\n\n[Bridge: Young Jeezy]\nI said one nigga down, two niggas run it\nGame and the snowman, a hunnid miles and gunnin', ayy\nHere come the paramedics!\n\n[Chorus: Young Jeezy]\nIt goes one for the money, two for the dough\nOn the count of three, niggas kickin' down your door, haha\nHere come the paramedics!\nHere come the paramedics!\nIt goes one foot down, two niggas run it\nGame and the snowman, a hunnid miles and gunnin', ayy\nHere come the paramedics! (Haha)\nHere come the paramedics!\nLet's go\n\n[Verse 1: Young Jeezy]\nHere come the pain! I've got a name\nEver since an adolescent I've been deep in the game\nAll I need is morphine, a lil somethin' for the pain\nEverything is all good like a hook from T-Pain (Haha)\nThey say you're nobody 'til somebody kills you\nI say, \"Go be somebody, even if it kills you\"\nThey say, \"Death smell like some bad ass weed\"\n'Nother watch, 'nother chain the last thing a nigga need\nI swear to God, chopper right by the night stand\nClip a half a hunnid pillowcase another hundred grand\nNow get some rest when your conscious keep wakin' ya\nThe evil kicks in and them demons start shakin' ya\nHavin' nightmares, I wake up in a cold sweat\nGet dressed and hit the club in a Corvette\nGod damn cuh, you souls say some cold shit\nProbably why they still ridin' to your old shit\nIt's probably why them beats all still ridin' wit'cha\nIt's probably why the rip riders still sidin' wit'cha\nIt's probably why them real niggas still hustlin' to ya\nI know you hear it everyday, it ain't nothin' to ya\nThey say pictures worth about a thousand words\nThese niggas talkin' like they really worth a thousand birds\nHere come the paramedics, bitch, I done told you\nWhen them niggas callin' beef, it's really tofu\n\n[Chorus: Young Jeezy]\nIt goes one for the money, two for the dough\nOn the count of three, niggas kickin' down your door, haha\nHere come the paramedics!\nHere come the paramedics!\nIt goes one foot down, two niggas run it\nGame and the snowman, a hunnid miles and gunnin', ayy\nHere come the paramedics! (Haha)\nHere come the paramedics!\n\n[Verse 2: The Game]\nSee us ridin' like some mobsters with the trunk full of choppers\nGive a nigga a couple shots and I ain't talking about vodka\nHangin' out the sunroof, Snowman drivin'\nNigga live through these shots: Put his ass on Survivor!\nFresh up out the trap, I ain't never been a rat\nGet cheese like a mouse, so I'm honest throwin' stacks\nLet you suckers make it rain, I'll make it Katrina\nAnd pile all them hoes in the back of my Beamer\nHit the freeway, bumpin' Geto Boys with the V12 steamin'\nTop down, in the rain, California dreamin'\nI'd be lying if I said I still flip birds, well, nigga, I still flip birds!\nWord to the doors on this Gina I'm sitting on\nAin't a rapper alive me and Jeezy ain't shittin' on\nWho else you know shit out Benjamins, and piss Patrón?\nPut Michael Buffer between us, and let's get it on!\n\n[Chorus: Young Jeezy & The Game]\nIt goes one for the money, two for the dough\nOn the count of three, niggas kickin' down your door, haha\nHere come the paramedics!\nHere come the paramedics!\nIt goes one foot down, two niggas run it\nGame and the snowman, a hunnid miles and gunnin', ayy\nHey, Snowman, these niggas hustlin' backwards\nHere come the paramedics! (Haha)\nI'ma pull the K out and turn 'em around, look\nHere come the paramedics!\n\n[Verse 3: The Game]\nIf I give you half a chicken, can you break that bitch down?\nTell the truth, it's me nigga, ain't nobody else around\nJeezy said it's a recession, so we hustling that May weather\nMy birds the best pound for pound, like Mayweather\nUndisputed: I never lost a brick\nUPS, FedEx and duct taped to a bitch\nPut her ass on the Greyhound\nTell that hoe to stay down\nSleep the first forty-eight and wake up in the A-Town\nGive a fuck about a bitch\nDie for the paper, hustle relentless\nNigga, I take the sky from a scraper\nThe Gerber out a baby mouth, the fire out of Satan's house\nThese rappers turned saints when we pull them fuckin' gauges out\nBlack Tims kickin' in the door at your lady house\nHe at the strip club, well, fuck it, we gon' wait it out\nShe tipped him off, so now all the K's is out\nRelocated, shot him down from the neighbor's house\n\n[Chorus: Young Jeezy]\nIt goes one for the money, two for the dough\nOn the count of three, niggas kickin' down your door, haha\nHere come the paramedics!\nHere come the paramedics!\nIt goes one foot down, two niggas run it\nGame and the snowman, a hunnid miles and gunnin', ayy\nHere come the paramedics!\nHere come the paramedics!", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg"}], "artist": "The Game"}