{"songs": [{"title": "Go to Sleep", "album": "Cradle 2 The Grave", "year": "2003-02-18", "lyrics": "[Verse 1: Eminem]\nI ain't gonna eat, I ain't gonna sleep\nAin't gonna breathe 'til I see what I wanna see\nAnd what I wanna see is you go to sleep in the dirt\nPermanently; you're just being hurt\nThis ain't gonna work for me, it just wouldn't be\nSufficient enough 'cause we are just gonna be\nEnemies as long as we breathe, I don't ever see\nEither of us comin' to terms where we can agree\nThere ain't gonna be no reasonin' speakin' with me\nYou speak on my seed, then me no speak-a Inglés\nSo we gonna beef, and keep on beefin', unless\nYou're gonna agree to meet with me in the flesh\nAnd settle this face-to-face, and you're gonna see\nA demon unleashed in me that you've never seen\nAnd you're gonna see this gangster pee on himself\nI see you D12, and thanks, but me need no help\nMe do this one all by my lonely, I don't need 15 of my homies\nWhen I see you, I'm seein' you, me and you only\nWe never met, but best believe you gon' know me\nWhen I'm this close to see you exposed as phony\nCome on, bitch, show me! Pick me up, throw me!\nLift me up, hold me—just like you told me\nYou was gonna do, that's what I thought, you're pitiful\nI'm rid of you, all of you, Ja, you'll get it too\n\n[Chorus: Eminem]\nNow go to sleep, bitch! Die, motherfucker, die!\nUgh, time's up, bitch, close your eyes!\nGo to sleep, bitch! Why are you still alive?\nHow many times I gotta say, close your eyes!\nAnd go to sleep, bitch! Die, motherfucker die!\nBye, bye, motherfucker, bye, bye!\nGo to sleep, bitch! Why are you still alive?\nWhy? Die, motherfucker! Ah, ah, ah, go to sleep, bitch!\n\n[Verse 2: Obie Trice]\nWe got you niggas nervous, on purpose\nTo hurt your focus, you's not MC's\nYou's worthless, you's not them G's\nYou's a circus, you's no appeal, please\nYou's curtains, you use words Kool Herc slurred\nIn two-thousand-third: you's perpin'\nYou's no threat, who's you servin'?\nWhen lyrically oughta bury you beneath the dirt when\nYou fuck with a label overseein' the Earth\nShady, mothafucka, O. Trice's birth\nAnd as I mold I become more cursed\nSo we can put down the verse, take it to the turf\nCock and squeeze, and he who reach the hearse\nIs he who depicts fiction in his verse\nAnd as I breathe, and you be deceased\nThe world believe you deceived just to speak\nYou's not the streets, you's the desk\nUse not your chest, nigga, use a vest\nBefore tools choose your rest, you chose death\nSix feet deep, nigga, that's the depth\n\n[Chorus: Eminem]\nNow go to sleep, bitch! Die, motherfucker, die!\nUgh, time's up, bitch, close your eyes!\nGo to sleep, bitch! Why are you still alive?\nHow many times I gotta say, close your eyes!\nAnd go to sleep, bitch! Die, motherfucker die!\nBye, bye, motherfucker, bye, bye!\nGo to sleep, bitch! Why are you still alive?\nWhy? Die, motherfucker! Ah, ah, ah, go to sleep, bitch!\n\n[Verse 3: DMX]\nHey dog, I'ma walk like a beast, talk like the streets\nI'ma stay blazin' New York with the heat\nStalk on the beat, walk with my feet\nUnderstand my pain, the rain ain't sleet\nPeep how I'm movin', peep where I'm goin'\nShit don't seep, then sleep not knowin'\nBut I'ma keep growin', gettin' larger than life\nEasy goin' with the same one that started the fight\nHe be knowin' how dog get when dog don't bite\nTried to show him the dog shit, it's dog for life\nGrand Champ, and my Blood Line is tight\n'Cause it's all good, it's all right\nNiggas tried to holla but couldn't holla back\nNow they got to swallow everything in the sack\nBlood Line, and we can go track for track\nDamn, dog, why'd you have to do them niggas like that?\n\n[Chorus: Eminem]\nNow go to sleep, bitch! Die, motherfucker, die!\nUgh, time's up, bitch, close your eyes!\nGo to sleep, bitch! Why are you still alive?\nHow many times I gotta say, close your eyes!\nAnd go to sleep, bitch! Die, motherfucker die!\nBye, bye, motherfucker, bye, bye!\nGo to sleep, bitch! Why are you still alive?\nWhy? Die, motherfucker! Ah, ah, ah, go to sleep, bitch!\n\n[Outro: Eminem]\nAll you motherfuckers, take that!\nHere, take this too, bitch!\nUh, uh, uh, uh, wahoo\nWe're killing all you motherfuckers dead\nAll of you! Fake-ass gangsters!\nNo more press! No more press!\nRot, motherfuckers, rot!\nDecay, in the dirt, bitch, in the motherfuckin' dirt!\nDie nameless, bitch! Die nameless!\nNo more fame! Ahh, hahahaha\nYo, X, come on, man! Obie, let's go! Ha ha", "image": "https://images.genius.com/44138b1aacaff54e5cf3f623fcd4da36.1000x1000x1.jpg"}], "artist": "Eminem"}