{"songs": [{"title": "Fuck The Police", "album": null, "year": null, "lyrics": "Punk Police\nFUCK THE POLICE\n\nOh you too, nigga\nDon't think we ain't talking about your punk ass\nYou ol' fake ass nigga\n\nHere we go\nTurn it up let it start\nFrom block to block we snatchin hearts\nAnd jackin' marks\nAnd the punk police can't fade me\nYou made me\nCrooked-ass beast something daisy\n\nBut right now\nI got my mind set up\nLookin down the barrel of my nine\nGet up\nCause it's time to make that pay back\nFact\nAnd my brothas on the block better stay strapped\nBlack\n\nAnd accept no substitutes\nI bring truth to the youth\nTear the roof off the whole school\nOh no, I won't turn the other cheek\nCase you can't see\nThis what we burned the other week -uh\n\nNow we go him in the smash - blast\nHow long will it last until the po' get mo' cash?\nUntil then, RAISE up\nTo my young black males, BLAZE up\n\nLife's a mess\nDon't stress - test\nOr give in\nBut be thankful that you livin bless\nMuch love to my brothas in the Pen\nSee ya when I free ya\nNot when they shove me in\n\n[ Chorus ] x4\n\nThug for life\nHigh till I die\nShootin crooked-ass cops\nLettin' it fly\n\nTell 'em\n\nThug for life\nHigh till I die\nShootin crooked-ass cops\nLettin 'it fly\n\nTell 'em\n\nThug for life\nHigh till I die\nShootin crooked-ass cops\nLettin' it fly\n\nTell 'em\n\nThug for life\nHigh till I die\nShootin crooked-ass cops\nLettin 'it fly\n\nPump your fists like this\nHolla if you hear me\nPump pump if you're pissed\nTo the sell-outs, livin it up\nOne way or another you'll be givin' it up - hugh\n\nI guess cause I'm black-born\nI'm supposed to say \"peace\" sing songs and get capped on\nBut it's time for a new plan - BAMN!\nI'll be swingin like a one man klan\n\n[ Chorus ] x4\nThug for life\nHigh till I die\nShootin crooked-ass cops\nLettin' it fly\n\nTell 'em\n\nThug for life\nHigh till I die\nShootin crooked-ass cops\nLettin 'it fly\n\n\nInterview [referring to playing a cop as an actor]:\n\"The good part about is, we get to show the human side of cops doing what they do\nCause, it's always been my belief that cops are just a gang themselves- with the good and the bad\nLike I believe the gang bangers on the street got both good and bad like the police officers do\nThey got stress and they got character flaws that come from their lifestyles\n\nI could be the best actor that anybody seen\nGiven the chance, the opportunity, and the experience and the lessons from people, I could be the best...\nBut right now I don't wish to the best, I just want to be one of them\n\nIf you look at it from a stereotypical point of view, like how people say, you know\n'All your troubles with the law, how can you play a cop?'\nJust from a stereotypical point of view\nWho could play a cop better?\nI've seen them and their evil when they think nobody's looking. I've seen the  compassion, I've seen the anger, I've seen the jealousy, I've seen fear,  I've seen respect and I've seen hate- from cops\nMore than anybody, know what I mean? I been there. I just got out of maximum penitentiary", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}