{"songs": [{"title": "What U Doin? (Bullshitting)", "album": "Finally Famous Vol. 3: BIG", "year": "2010-08-21", "lyrics": "[Intro]\nBoi, boi, boi\n\n[Verse 1]\nI-I-I say that shit again, I said it once before\nI just, I just, I just, I just want it all\nI glisten and shine with misses' fine model chick, big behind\nBad enough to skip the line but to me she just a nine\nI hop up out that double-0, you can call me Mr. Bond\nBitch, I am a monster, I belong in District 9\n\n[Refrain]\nCatch me in my office, office, doing business\nFuck you doing? Bullshitting\n\n[Verse 2]\nI get all the eyes when I step inside and\nThey all arise when I am arrivin'\nBring out the Rose, Nuvo, Ciroc and\nBring out the OJ like Johnny Cochran\nI guess they on son, cause my neck look like horizon\nJust a million people behind me and I don't have Verizon\n\n[Refrain]\nMan, I'm chillin with my niggas nigga, and a couple cool bitches\nFuck you doin'? Bullshittin'\n\n[Verse 2]\nMe and my nigga SayItAintTone\nHundred pretty girlies singing our song\nYeah I kick my feet up you can't say that I ain't home\nAnd I be blowing on that reefer you can't say that it ain't strong\nAnd she just, she just, she just, she just want a long dick\nI put it in her mouth and now that bitch look like a conehead\n\n[Refrain]\nWhen I'm done? Go ahead\n(Nigga what the fuck?) What you thought this is?\n(Hell naw) Fuck you doing? Bullshitting\n\n[Verse 3]\nI hear, I hear, I hear man but that shit just don't compare\nI tell you you the best, when I'm looking in the mirror\nBy the time y'all over here, I'm prolly over there\nAnd by the time you riding what I'm riding on I'm in the air\nNo wonder why my mind is so cloudy, I'm drowsy\nMy frequent flier miles is in the thousies, I'm outtie\n\n[Refrain]\nSomewhere chilling in Maui, swimming with the scuba fishes\nFuck you doing? Bullshitting\n\n[Verse 4]\nNigga I be splargin, I beg my pardon\nCause y'all niggas is starving, looking for a bargain\nGone and roll that weed yea I think it's time to spark it\nCause I be running through them trees niggas call me Tarzan\nWhat you think? We won't stop! Gone stop? Silly ho\nI'm living out my dreams, don't you dare hit that alarm clock\n\n[Refrain]\nI'm laid up with your girlfriend\nYou knocking like, \"What you doing, nigga?\"\n(What you doin', man?) I'm like, \"Fuck you doing?\"\n(Aww, come on, man!) Bullshitting\n\n[Coda]\nHa! Boi... (D-Town, nigga!)\nI hit you with an AMC, my nigga, that's a full clip\nAnd you could be like me if you just quit with all the bullshittin'\n\n[Outro]\nI do it! Boi, boi, boi\nEarl Mack, what up!\nFinally Famous in this, gettin'... money\nD-Town, nigga!\nG.O.O.D. Music, what!\nBoi, boi", "image": "https://images.genius.com/51bfce0400b8c3a40f795be4e14571d1.600x600x1.jpg"}], "artist": "Big Sean"}