{"songs": [{"title": "Soopaman Luva 6", "album": null, "year": null, "lyrics": "(feat. E3, Hurricane G & Melanie Rutherford)\n\n[Soopaman Luva Chorus]\n[Redman:]\nYo, yo, what up yo, I be the Soopaman luva\nI'm about five minutes right out ya baby mother\nI'm still broke, still gutter\nHit four chicks, then avenge like folk brothers\nThen rob a bank teller\nI'm sorta like old yella, call me for trouble\nI got chop for bullets that spread out the umbrella\nI'm advanced boy, da doc bigalow, the man whore\nGot Ms. Incredible and cat women on amcord\nWhen neighborhood or city in a drought\nFuck a boat I could fly there, 300 an ounce\nReup my account, wear and durag and I ain't got waves\nI only got haze pumpin out the bat cave\nSo when I'm flyin through ya hood it's a hit nigga\nIsabella I need that sour diesel quick nigga\n-Call for soopman luva on line 3-\nWell who the fuck is it?\n-Her name is Hurricane G-\nWhat up G?\n\n[Hurricane G]\nThey tryin to lock me up G\nI can't do time cause my time is money\nI just came from court for some bullshit charge\nThey tryin to do me like kim, throw me behind bars\nWhat am I gonna do?\n\n[Redman:]\nFuck that I'm comin\nWith a gun like willis so you could feel drummin\nI creep in when the lights out, sneak in to get you out\nLo jacks on my ears to tell me where your where abouts\nCause I air 'em out, sneak in though the West wing\nLaundromat, duffle bag thinking of the next thing\n\n[G:] But I'm in the East wing\n[R:] Damn my shit broke\n[G:] Hurry up nigga, this water look piss cold\n\n[Redman:]\nHold tight for me, I'm already in\nI'm in the kitchen corridor, climbin up the vent\nI'm hot so hurricane so it might take me awhile\nSo when I get ya we gonna roll like mickey and loud\n\n[Chorus]\n[Redman:]\nHere we go, Yo, Yo the Soopaman Luv\nCrawlin through the vent like that dude in breakfast club\nI made a pit stop, seen a freak in the shower\nSo I gotta quick pop, pimp slapped her with powder\nAnd told her if somebody asks you, you seen nada\nAnd every week I come fuck you with marijuana\n\n[G:] Okay if you looking for Hurricane over there\n[R:] Oh shit, Hurricane\n[G:] Hey yo get me outta here\n\n[Redman:]\nHey yo C.O.'s watchin\nGotta move like grown men\nCause a distraction\nLike the food gave you stomach pain\nWhen the doctors come in, start the examining\nI rush in with rubber gloves off the ambulance\nGun in one hand, the other palm around the nurse mouth\nOn the count of three this is how its gonna work out\n1, 2...", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}