{"songs": [{"title": "Track 13", "album": null, "year": null, "lyrics": "[Hook]\nYou can die on the strength of my gun, you heard me?\nMama's cry on the strength of my gun, you heard me?\nRide on the strength of my gun, you heard me?\nYou heard me, you heard me\n\n[Verse 1]\nMy gun got many ways to get you\nYou get hit with a missile and live, you would need barbed wire to stitch you\nThis is not fictional, this here is typical\nI will bring it to your door if you can't see the visual\nBlack Manson, won't you ask him\nHow I have sex with the trigger just to make the barrel orgasm\nRemember when it started, nobody protected me\nHad to make way for school in the mornin' and niggas sweatin' me\nWhere you from? Like shit, I'm tired of niggas questionin' me\nNow I'm in, I gotta have that thing next to me\nWent to my pop's closet\nThe next day I'm pullin' up my pants, grabbin' my crotch and walkin' awkward\nSomethin' pop off, then I have somethin' to spark with\nBy the bus stop like man I wish somebody'd push me\nI'mma let the hawk spit, with a killin' instinct\nLike some of these students gonna have an early coffin\n\n[Hook]\nYou can die on the strength of my gun, you heard me?\nMama's cry on the strength of my gun, you heard me?\nRide on the strength of my gun, you heard me?\nYou heard me, you heard me\nYou can die on the strength of my gun, you heard me?\nMama's cry on the strength of my gun, you heard me?\nRide on the strength of my gun, you heard me?\nYou heard me, you heard me\n\n[Verse 2]\nNow I got a love Jones for that [?] still on\nMichael Jackson niggas, the fifth'll change your skin tone\nSniper guns'll chirp [?]\nThey'll prolly chirp silent when your Nextel is off speakerphone\nHow real is that? Never\nNow niggas do dirt in daylight cause the [?] is clever\nI resign to the fact, that any [?] where the drama is at\nI'm reclinin' [?]\nKeep your wordplay intact\nAnd 50 couldn't say it better\nCan't find you, show me where his mama live at\nYou a gangsta, I'm not one, but it doesn't mean\nBy all means, I'm not very able to pump a shotgun\n[?] and watch as you [?]\nWith the MAC or the Ruger, nigga I got options\nSo while you play possum, I sit and watch 'em\nCreepin', Nas got his so you fucked if you don't got one\n\n[Hook]\nYou can die on the strength of my gun, you heard me?\nMama's cry on the strength of my gun, you heard me?\nRide on the strength of my gun, you heard me?\nYou heard me, you heard meYou can die on the strength of my gun, you heard me?\nMama's cry on the strength of my gun, you heard me?\nRide on the strength of my gun, you heard me?\nYou heard me, you heard me\n\n[Bridge]\nI don't know about you, but see, baby I'm ruthless\nTry to fight me, and see, baby you're useless\nShots from the MAC do more than have you toothless\nThe sound is exclusive, bang bang bang, boom\n\n[Verse 3]\nI explode like a Vietnam bomb\nHotter than firemans but my hand got a firearm\nFire at your arm, titty, and hands, breakin' your palms\nUsin' them to snatch purses the brand of Louis Vuitton\nNigga, what type of shit you on? It's simple mass destruction\nRevengeance, tension, you see I've had enough\nDid I mention? I sniff you pussy niggas out\nThe smell that you bring has aroma like an incensce\nPlay matrix, see if you the one\nIt's a million ways to die and this here is number one\nAnd that's starin' down a barrel of a gun\nAfter I smack you 'til it's gun powder on your tongue\nCause boy them shells get hotter than the sun\nAnd boy when I spit, please be prepared to run\nBoy, don't forget to have a vest when I come\nCause I'll hit your chest and clog up your lungs mothafucka\n\n[Hook]\nYou can die on the strength of my gun, you heard me?\nMama's cry on the strength of my gun, you heard me?\nRide on the strength of my gun, you heard me?\nYou heard me, you heard meYou can die on the strength of my gun, you heard me?\nMama's cry on the strength of my gun, you heard me?\nRide on the strength of my gun, you heard me?\nYou heard me, you heard me", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}