{"songs": [{"title": "Just Another Day", "album": "Compton", "year": "2015-08-07", "lyrics": "[Produced by Dr. Dre & Ron \"Neff-U\" Feemster]\n\n[Intro]\nIt's motherfuckin' Game time!\n\n[Verse: Game]\nSix pounds of chronic on my grandma coffee table\nThat's how you remember it? That's how I remember it\nYeah, dip into the liquor store, nine in my khakis\nCrips tryna get at me, my red Impala bumping like acne\nMy city a trap me; been shot, robbed, stabbed, chased home, socked out\nJabbed by esse's, cops, degenerate niggas with rags\nDisintegrate niggas when enemy, dome shots like Kennedy\nSlugs drippin' with Hennessey, got murderous tendencies\nAnd if you don't know where the fuck they got me from\nMartin Scorsese when I pull out my gun\nScarface, car chase, tell me how your blood taste\nAsk your baby mama, she'll tell you how a Blood taste\nBasket case, still I'm back with Dre, wait I never left\nRun up in Beats, \"Bitch pass the safe! Compton\"\nProduced by a billion in this motherfucker\nStill smokin', Dre we need a ceilin' in this motherfucker\nCompton! They killin' in this motherfucker\nThey grillin' in this motherfucker\nLock the door, they stealin' in this motherfucker\nNo chains, no rings, this my home\nNigga, this Hub City, no-fly zone\nNiggas pull out burners\nStart breakin' like Turbo on Ozone\nCrack fiends on the back streets\nWhere the tracks lean, where the needles lay\nAnd switchblades, if you bitch made\nPut chili all on your Frito Lay's\nWhere we dream of Montego Bay\nBut all we got is the swap meet\nWhere the cops meet, go bang bang\nLeaves blood stains on that concrete\nAnd I'm the only nigga bumpin' Mobb Deep\n'Cause I mob deep down that side street\n'Cause I'm a West side rider, live with gats on collars\nDon't hate me, better get your dollars\nI be on Rosecrans with a Glock in both hands\nLeanin' on that Brougham\nFlamed up like a Coke can with my name on it\n\n[Outro: Asia Bryant]\nAnother day in Compton, the thrill is high\nKnow somebody's watchin', but I don't know why\nFeel the fire burnin', it touches the sky\nFeel 'em coming at you, I won't die tonight\nSo I get by, I get by\nI get by, I get, I get by\n'Cause it's just another day in Compton", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "The Game"}