{"songs": [{"title": "If I Had (Radio Edit)", "album": "Slim Shady EP", "year": "1997-12-06", "lyrics": "[Intro]\n\"Life\" by Marshall Mathers\nWhat is life?\nLife is like a big obstacle\nPut in front of your optical to slow you down\nAnd every time you think you've gotten past it\nIt's gonna come back around and tackle you to the damn ground\nWhat are friends?\nFriends are people that you think are your friends\nBut they're really your enemies with secret identities and disguises to hide their true colors\nSo just when you think you're close enough to be brothers they wanna come back and cut your throat when you ain't looking\nWhat is money?\nMoney is what makes a man act funny\nMoney is the root of all evil\nMoney'll make them same friends come back around swearing that they was always down\nWhat is life?\n\n[Verse 1]\nI'm tired of life\nI'm tired of backstabbing ass snakes with friendly grins\nI'm tired of committing so many sins\nTired of always giving in when this bottle of Henny wins\nTired of never having any ends\nTired of having skinny friends hooked on crack and Mini Thins\nI'm tired of this DJ playing your shit when he spins\nTired of not having a deal\nTired of having to deal with the bullshit without grabbing the steel\nTired of drowning in my sorrow\nTired of having to borrow a dollar for gas to start my Monte Carlo\nI'm tired of motherfuckers spraying shit and dartin' off\nI'm tired of jobs startin' off at $5.50 an hour\nThen this boss wonders why I'm smartin' off\nI'm tired of being fired every time I fart and cough\nTired of having to work as a gas station clerk for this jerk breathing down my neck, driving me berserk\nI'm tired of using plastic silverware\nTired of working at Builder's Square\nTired of not being a millionaire\n\n[Hook]\nBut if I had a million dollars\nI'd buy a damn brewery and turn the planet into alcoholics\nIf I had a magic wand\nI'd make the world suck my dick without a condom on while I'm on the john\nIf I had a million bucks\nIt wouldn't be enough because I'd still be out robbing armored trucks\nIf I had one wish\nI would ask for a big enough ass for the whole world to kiss\n\n[Verse 2]\nI'm tired of being white trash, broke and always poor\nTired of taking pop bottles back to the party store\nI'm tired of not having a phone\nTired of not having a home to have one in if I did have one on\nTired of not driving a BM\nTired of not working at GM\nTired of wanting to be him\nTired of not sleeping without a Tylenol PM\nTired of not performing in a packed coliseum\nTired of not being on tour\nTired of fucking the same blonde whore after work in the back of a Contour\nI'm tired of faking knots with a stack of ones\nHaving a lack of funds and resorting back to guns\nTired of being stared at\nTired of wearing the same damn Nike Air hat\nTired of stepping in clubs, wearing the same pair of Lugz\nTired of people saying they're tired of hearing me rap about drugs\nTired of other rappers who ain't bringing half the skill as me\nSayin' they wasn't feeling me on \"Nobody's As Ill As Me\"\nAnd I'm tired of radio stations telling fibs\nTired of JLB saying \"Where Hip-Hop lives\"\n\n[Hook]\nBut if I had a million dollars\nI'd buy a damn brewery and turn the planet into alcoholics\nIf I had a magic wand\nI'd make the world suck my dick without a condom on while I'm on the john\nIf I had a million bucks\nIt wouldn't be enough because I'd still be out robbing armored trucks\nIf I had one wish\nI would ask for a big enough ass for the whole world to kiss\n\n[Outro]\nY'know what I'm saying?\nI'm tired of all of this bullshit\nTelling me to be positive\nHow am I 'posed to be positive when I don't see shit positive?\nY'know what I'm saying?\nI rap about shit around me, shit I see\nY'know what I'm saying?\nAnd right now I'm tired of everything\nTired of all this player-hating that's going on in my own city\nCan't get no airplay\nY'know what I'm saying?\nBut hey, it's cool though\nY'know what I'm saying?\nI'm just fed up\nThat's my word", "image": "https://images.genius.com/672f82b07e927570becdf0e67c91fc5e.1000x1000x1.png"}], "artist": "Eminem"}