{"songs": [{"title": "Ride Slow", "album": "These Days…", "year": "2014-06-24", "lyrics": "[Intro: Ab-Soul]\nAin't no sitting down in here, my nigga\nYeah, hahahahah\nYeah, keep sayin', oh I think niggas is laughing at me\nThat's right, make that spooky shit\nYo, yo-yo-yo-yo-yo-yo-yo-yo, look-look\nI ride slow\n\n[Verse 1: Ab-Soul]\nThese rhythms of visions of me living colossal\nAhead of my time, in time you'll find that I'm a fossil\nKnow not what I do, Lord do you have mercy on my soul?\nFar as I know, I'm a poet or in an apostle\nSmoking my 'dro, smell the aroma on my clothes\nRose from the dirt, so I'm down to Earth, oh, I know\nYou made a few bucks now you feel buck, your chains gold\nMy shades all black, I can do this with a blindfold\nThis ain't rap, this is find a mine in your mind blow\nYour brains back out of your wave cap, I don't know Tae-Bo\nBut I kick that, you're a Kit-Kat\nLife's sweet but, way down the line, you're just a snack\n\n[Hook: Earl Sweatshirt & Ab-Soul]\nIt gets cold on the road to the riches (yeah, I ride slow)\nThe cars and the clothes is expensive (yo, I ride slow)\nThese hoes with they nose in my business (yeah, I ride slow)\nNigga (yo, I ride slow)\nThese rhythms of visions of me living colossal\nAhead of my time, in time you'll find that I'm a fossil\nYo-yo-yo-yo-yo-yo-yo-yo\nYo-yo-yo-yo, yo-yo, yo (insane in the membrane!)\n\n[Verse 2: Ab-Soul]\nI ride slow, live fast, small time to big cash\nCut corners, cut loose, cut class, fuck school\nHad to learn though, the harder way, pushing pennies\nBut, see, a three's a 16 in my sport, figgadeal me?\nI'm filthy, I know it's greedy out here, I told you that\nBut I made my way through it like Moses did with his staff, relax\nAnd try not to step on the crack, that'll break your mother's back\nOn the surface I will certainly scratch\nSee Mac, he made this from scratch\nJust imagine what we could do with a flick of the wrist\nYou're puppets anyway, let's say I'm playing ventriloquist\nGo this a way, go that a way, I'm scatter brain with this shit\nWhat's that a K? Put that away, no weapons formed against\nMe shall pass, remember that? I'm biblical with this shit\nThe tales from the Crip, on the soul of Sunday schools finna flip\nOh! (blow) The camera's gone so bring the acid tabs along\nAnd let's all gather round and sing my fucking song\nYo, I ride slow\n\n[Hook: Earl Sweatshirt & Ab-Soul]\nIt gets cold on the road to the riches (yeah, I ride slow)\nThe cars and the clothes is expensive (yo, I ride slow)\nThese hoes with they nose in my business (yeah, I ride slow)\nNigga (yo, I ride slow)\nThese rhythms of visions of me living colossal\nAhead of my time, in time you'll find that I'm a fossil\nYo (insane in the membrane!)\n\n[Verse 3: Danny Brown & Ab-Soul]\nCheck! I ride slow, sparking like exhaust, smite a pyro\nA psycho, Xannys in my cup before I pour a fo'\nYou nacho, mean a nigga put cheese on you\nPulling up, no headlights but there's red beams on you\nApostle, smoking on this dope, my brain colossal (Smoke!)\nHelps out the flow to do tricks like a brothel (Stunt!)\nRoll the lace with angel dust from pages of the bible (Stunt!)\nSurvival tactics, target practice if you lacking, it get drastic\nCaskets If you niggas talking ass-backwards (Black!)\nUp shit's creek with a tissue paddle\nOG Kush make a nigga chest rattle (Smoke!)\nCall your number like you just won the raffle (Ugh!)\nNigga, you Snapple sweet, come after me, it's casualty (Blow!)\nTurn you into vegetables as if I dropped the celery (Blow!)\nThe reality is all you niggas fictions (Bitch!)\nSmack you with the hand of Satan cause you need good sanitation (Ill!)\nAny nigga hating, we gon' turn them to a raisin (Blow!)\nOne nigga, .30 clip, turn your brain into bacon bits\n(Doot-doot-doot-doot!) And I ain't saying shit\nCause I'm coming from Detroit where I'm coming up short\nThem niggas riding slow, AK-ing up your porch\nI ride slow!\n(Insane in the membrane)\n\n[Part II]\n\n[Interlude: Doeburger & Ab-Soul]\nI-I-I ride, I ride, I-I, ride\nNiggas talking about all this lean shit (I ride slow)\nNigga I been sipping this shit since, been sipping this shit (I ride slow)\nSilly out here, niggas wanna tell me about 2 cups\nNigga I gave this nigga Soul his first two cups nigga\nI gave cuz his first cup of Lean, what you niggas talking bout? (I ride slow)\nCuz older than me, that's what I be talking about see? Fuck it\n\n[Bridge: Ab-Soul]\nI ride slow, these rhythms of visions of me living colossal\nAhead of my time, in time you'll find that I'm a fossil\nAlright, here right? Soulo\nLa, la-la-la, la la (I ride slow)\nDo you wanna ride or die? (I ride slow)\nWhat do we have here now? Run quick see\nCome with me (inhale Mary) (Y)\nCome with me (exhale Mary) (M)\nCome with me (inhale Mary) (F)\nCome with me, la, la-la-la, la la la la\nAlready, I ride slow\n\n[Verse 4: Ab-Soul]\nI heard they stopped making Actavis\n(You know when I heard that?) While I was sipping Actavis\nFast life, slow motion in my double cup\nThe screw give me drive like a flat-head, every fill up\nI must be Captain Phillips, these niggas don't speak my language\nResidue on my debit card, don't tell my moms\nThat it's a lot more than marijuana in her son\nI walk on the dark side, only to shed light where they ain't no sun\nDeadline snapback on my mind, I ain't suicidal, I'm just fly\nMy rhymes Ciroc and Ayahuasca, would you like a sip?\nEnlightenment from a low life that's more than likely high\nWhat I do with eight zips nigga? You don't know the half\nAll these lines add up like a motherfucking graph\nRap as if I had two left feet, tryna walk a righteous path\nSo here's a question that I ask\nWhat's a negative with no plus? A Benz with no bus?\nA curse with no gift? Who's God with no us?\n\n[Verse 5: Delusional Thomas]\nDelusional, murder marsupials when I puke a flow\nPut my dick in witches from \"The Crucible\"\nI'm hard to get a read on, that pussy shakin, Parkinson's Disease on\nPardon me, I sneezed, blessing conscious as it speaks freely\nDeath is cold homie, breathe easy, loaded gun in front of me\nShoot the soul right out of Soul, yeah you my homie\nYou do my murder and\n\n[Interlude: Ab-Soul & Delusional Thomas]\nAy-ay-ay-ay-ay-ay-ay-ay (fuck off!)\nRelax, relax my nigga (Maaaaaan!)\nCalm down my mom listens to this shit, bruh (I ride slow)\nYou need to stop sniffing that goddamn bleach is what you need to do\n\n[Verse 6: Delusional Thomas & Ab-Soul]\nWell how dare a man talk about the potency of my pack?\nI snort dope that's mixed with crystal meth and gastric bypass\nSatan's blood in my flesh, nobody is high as\nAnd these days the iPad\nWill tell you that your life will be no longer than an eyelash\nAnd then float away (I ride slow) so good luck\n\n[Outro: Delusional Thomas]\nBoop boop boop boop boop boop! Fuck yeah!\nYo Doeburger man", "image": "https://images.genius.com/077bbd628ad3b7383f095afde8670b76.560x560x1.jpg"}], "artist": "Ab-Soul"}