{"songs": [{"title": "Ill Mind of Hopsin 3", "album": "Ill Mind of Hopsin Saga", "year": null, "lyrics": "They tell me that my vibe is too dark, my eyes are too harsh\nThat's all I ever hear when I rhyme a few bars\nI kinda live a rapper's life, shit, minus two cars\nAnd free girls to fuck\n'Cause where I'm from the hynas do charge\nMy label hyped me up\nAnd told me I had about twelve hits—they lied\n'Cause when my fuckin' album dropped, I didn't sell shit\nWell, bitch, you tried to fuck my life up? You nailed it!\n'Cause you didn't promote my record\nAnd I don't know who the hell did\nYou shoulda hired Tanner Guinn, yup, Hop is mad again\nJust enough to leave your little skull frame hammered in\nSee, this is what happens when I take that little magic pen\nAnd get to scribblin' psychotic lines worth some damagin'\nI hate to tell you, but you are crazy\nYou were born as a retard baby\nAnd when I come around, you start shaking\n'Cause you're a bitch who dates hard ladies\nWith big beards who say, \"Arr, matey!\"\nYo, Pillow Man the alias Hopsin has been the signature\nI'm far from similar to you niggas whose flow is minature\nYou'll be diminished for crossin' limits on my perimeter\nI'm not a gimmick, I'm a committed, demented, sinister\nIt's Funk Volume, now what?\nIf you thinkin' that rap's officially dead, you haven't found us\nWe built the movement from the ground up, your sound sucks\nUntil now we let you slide, but you're now fucked\nIt's just reality, you posers done been wack\nI hold it down like my boner in gym class\nAnd fuck Wayne! Man, I'm doper than his ass\nHim, Nicki, and Drake can get thrown over a cliff fast\nYou got cash? Big whoop-dee-fuckin'-doo!\nIf I had a knife right now, it would be stuck in you\nYo, you ain't gonna like this corner that you pushed me up into\n'Cause all you rap about's how you beat the pussy up and ooze\nFuck your fast car, your cheap singin'\nYou keep sayin' the same shit, while T-Painin'\nAnd we bangin' simply because it's all we hear\nMan, look at all these queers\nThe shit is so watered-down I developed soggy ears\nKill me! Shit, I'm waitin' to die, bitches\nI hate on all you rappers who made it, 'cause I didn't\nAnd I admit it, man, I ain't gon' bullshit y'all\nAs long as you walkin' away sayin' that fool spits raw\nYo, I'm from the West, I throw up the W and I stay hot\nBut still ain't mentioned\nWith Nipsey Hu$$le, Glasses, or Jay Rock\nWhat I gotta do, dig 'Pac up out of his grave spot\nAnd wear his face as a mask to my next show to create props?\nPeople always ask why do I sound mad\n'Cause I ain't got a girlfriend with a round ass\nAnd all my fuckin' dinners come in a brown bag\nHow sad! I need a crossroad to get found at\nMost rappers be in a six-four\nI prefer a big horse, lit torch, and a pitchfork\nWhile you out late workin' your shift when the kids snore\nI'm fuckin' your wife while the bitch snorts\nWearin' swim shorts\nI got a message on Facebook from some lame guy\nAnd he was like, \"Hopsin, dude! I fucking HATE life!\nI wanna rap, but I have stage fright, and I can barely write\nAnd I never make music that the babes like!\nAnd when I come home from school, I wait 'til late night\nAnd bump your music really super-loud\nAnd paint my face white\nFor real, bro, if you just help me, dude\nI swear to God, I'll do anything you tell me to!\"\nWhoa, don't hit me up tryna suck my dick!\n'Cause I'm a guy, and I would rather fuck five chicks\nWith some plump nice tits and the butt size thick\nSo I can hit the G-spot that only tough guys hit\nSo if you hear a rumor that I rape mics, it's true\nWhen I drop RAW, that will be the day I get sued\nDamon Elliot, I might as well just say bye to you\nFuck the industry! Go out and get Haywire too!", "image": "https://images.genius.com/97082d935a6e1d042a7818ec8d9ad76d.800x800x1.jpg"}], "artist": "Hopsin"}