{"songs": [{"title": "Dead Man’s Gun", "album": "Rise Up", "year": null, "lyrics": "[feat. Young De]\n\n[Intro: Sample from Them Two's - \"Am I A Good Man\"]\n\"Am I a good maaaaaaan?\nAm I good maaaaaaaan?\nAm I a foooool?\nAm I fooooooool? \"\n\n[B-Real:]\nIt was a cold dark night in December\nRunning from the po-po's the alleyway I enter\nTrying to hideaway - when I stumbled on a gun\nAnd nobody's knows nothing about - where it came from!\nAnd nothing hotter then the summers in June\nWho knows how many souls - they put in the tomb\nWhen I picked it up man, I felt alot of pain\nLike a shot [shot] thru the brain - for reasons I can't explain!\nAfter it went away - I felt a sudden change\nLike - I can do anything. - And don't get in my way!\nI'm scared for my family! - They couldn't understand\nWith gun in my hand - I became - another man\nNo more running and hiding away from the cops\nNo more getting robbed from the dudes on the block\nYou're looking at a new man in the light of the sun\nYou're staring down the barrel of a dead man's gun! (dead man's gun...)\n\n[Chorus: Young De]\nCause you never know what's around them corners\nEnemies try to run up on us!\nSo I keep that gun right by my siide\nIf you want it you gotta take my liiiife\n\nAnd if you got problems, I got answers!\n\"One shot from the Revolver [shot] - can solve it! \"\nAnyway you want it, it don't mat-ter!\n\"If you got hard. - I'm a go harder! \" - You gotta take my liiiife!\n\n[B-Real:]\nYou walk into a dream and shit feels like a game\nEveryone is different - but they all end up the same\nEven the places - and the faces all change\nAt the end of the dream - I could see - the bullets rain!\nI thought it was me who brought these people to the death\n'Til I noticed a funny thing, I was standing on the left!\nLooking at other people with their hands on the gun\nAnd pulling the trigger - until their enemies were done!\nAnd with each hand that held the gun it got deeper\nThey ended a question against the shoulder of the Reaper! (yeeeahhh!)\nThey all look invincible with the weapon that was cursed\nUntil it was their turn - to ride in the hearse!\nSeems like the history - is passing down to me (GO!)\nCause my finger was itching (GO!) to go after my enemies. (GO!)\nI welcome them all (GO!) with the best on my chest (GO!)\nBecause I put 'em (GO!) to the test and laid those bodies to rest. (bodies the rest...)\n\n[Chorus]\n[B-Real:]\nSpring for more pimpin' - it's time passes by\nAnd people are telling me about the look in my eye\nSayin' it seems there's a chip on my shoulder\nAnd for some reason my attitude has gotten bolder!\nI knew it was true - cause I felt myself changin'\nBut I don't care what they think cause I'm still the same man\nI don't show weakness - anymore without a question\nDon't wanna be stressin' and have to teach them rappers a lesson!\nNever a time - I felt so alive (GO!)\nAn' situations (GO!) I thrive - like bees to a hive. (GO!)\nI murder these (GO!) new kids - who got something against me. (GO!)\nThe thought of you (GO!) talkin' shit - really fuckin' offends me! (GO!)\nIn no time at all we come back to each other\nSeems like I've seen it before. - I swear it on my mother!\nA shot [shot] rang out - and then my hands went numb\nSeen my body on the floor - with the dead man's gun! (dead man's gun...)\n\n[Chorus]\n[Outro: Young De]\nYou gotta take my liiiife... (liiiife...)\nYou gotta take my liiiife... (liiiife...)\nYou gotta take my liiiife... (liiiife...)\nYou gotta take my liiiife... (liiiife...) [echoes] [beat stops]", "image": "https://images.genius.com/f469b84836527dfec52206e182dfacce.220x220x1.jpg"}], "artist": "Cypress Hill"}