{"songs": [{"title": "Evil Deeds", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro]\nLord, please forgive me for what I do\nFor I know not what I've done\n\n[Hook]\nFather, please forgive me for I know not what I do\nI just never had the chance to ever meet you\nTherefore I did not know that I would grow to be\nMy mother's evil seed and do these evil deeds\n\n[Verse 1]\nMomma had a baby and its head popped off\nHead popped off, head popped off, head popped off, head popped off, head popped off\nBut Momma don't want me, the next thing I know, I'm gettin' dropped off\nGettin' dropped off, gettin' dropped off, gettin' dropped off, gettin' dropped off\nRing-ring-ring on the doorbell of the next door neighbors, on their front porch\nTheir front porch, their front porch, their front porch, their front porch\nBut they didn't want me neither, so they left me on someone else's lawn\nElse's lawn, else's lawn, else's lawn\n'Til somebody finally took me in, my great aunt and uncle, Edna and Charles\nEdna and Charles, Edna and Charles, Edna and Charles, Edna and Charles, they were the ones who were left in charge\nMy elementary, they'd gang up on me and sing this song\nSing this song, sing this song, sing this song, sing this song\nIt went a little something like\n\"Mary had a little lamb, little lamb, little lamb\nDebbie had a Satan spawn, Satan spawn\"\nMomma why do they keep sayin' this? I just don't understand, understand\nAnd by the way, where's my dad?\n\n[Hook]\nFather, please forgive me for I know not what I do\nI just never had the chance to ever meet you\nTherefore I did not know that I would grow to be\nMy mother's evil seed and do these evil deeds\n\n[Verse 2]\nPredominantly, predominantly, everything's always predominantly\nPredominantly-white, predominantly black. well, what about me?\nWhere does that leave me? Well, I guess that I'm between predominantly both of 'em\nI think if I hear that fuckin' word again, I'ma scream\nWhile I'm projectile vomitin'; what do I look like, a comedian to you?\nDo you think that I'm kiddin'? What do I look like, some kinda idi...\nWait a minute, shit, don't answer that; why am I so misunderstood?\nWhy do I go through so much bullshit? It's such bullshit, it's tush mull bish\n\"Woe is me, there goes poor Marshall again whinin' about his millions\nAnd his mansion and his sorrow he's always drownin' in\nAnd the dad that he never had, and how his childhood was so bad\nAnd how his mom was a dope addict, and his ex-wife, how they go at it\nMan, I'd hate to have it as bad as that Mr. Mathers claims he had it\nI can't imagine it. That little rich, poor, white bastard\nNeeds to take some of that cash out of the bank and take a bath in it\nMan, if I only had half of it\"\nShit, if you only knew the half of it...\nHaha\n\n[Hook]\nFather, please forgive me for I know not what I do\nI just never had the chance to ever meet you\nTherefore I did not know that I would grow to be\nMy mother's evil seed and do these evil deeds\n\n[Verse 3]\nEvil deeds, while I plant these evil seeds\nPlease release me from these demons\nI never had any of this shit planned, Mom, please believe\nI don't wanna be Satan's spawn\nNever got the chance to say I'm sorry\nNow look at all the pain I caused\nDear Santa Claus, why are you not comin' this year again?\nWhat did I do that was so bad to deserve this?\nEverything could have been so perfect\nBut life ain't a fairytale. I'm about to be hoisted up in the air\nForty feet below me there's people everywhere\nI don't even know but who feel like they know me 'cause I'm in this ferris wheel\nAnd all I wanna do is go to the mall and take Hailie on the carousel\nWithout this crowd everywhere I go, but life is like a merry-go-round\nHere we go now, do-si-do now, curtains up, the show must go now\nRing-around-the-rosie, the show's over, you can all go home now\nBut the curtain just don't close for me, this ain't how fame was supposed to be\nWhere's the switch I could just turn off-and-on? This ain't what I chose to be\nSo please, God, give me the strength to have what it takes to carry on\n'Til I pass 50 back the baton, the camera's on, my soul is gone\n\n[Hook]\nFather, please forgive me for I know not what I do\nI just never had the chance to ever meet you\nTherefore I did not know that I would grow to be\nMy mother's evil seed and do these evil deeds\nI said, Father, please forgive me for I know not what I do\nI just never had the chance to ever meet you\nTherefore I did not know that I would grow to be\nMy mother's evil seed and do these evil deeds\n(Evil deeds, evil deeds, evil deeds)\n\n[Outro]\n[Gunshot]\n[Crowd cheering]\nOh!\nLast one, baby, let's go\nLast one, baby, let's go\nDetroit!", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}