{"songs": [{"title": "Through The Wire (Freestyle Remix)", "album": null, "year": null, "lyrics": "Yo Ferris, they can't stop me from rappin', can they?\nI spit it through the wire, man\nIf this ain't dedication I don't know what is, man\nListen, first of all I want to thank you for your support\nChi-Town, what's goin' on?\n\nUh, yeah, feels like, uh, every sunshine is brighter\nSunsets feel righter\nPlease light ya lighter for the producer and the writer\nFeel like God wrote this\nI'm just here to quote this\nI don't know if you notice but them accident pictures were bogus\nDoctor, doctor, would you please say somethin'?\nI know I almost was the final destination\nI musta had a blessin' from Pastor Mason\nCuz that trip to L.A. coulda been my last vacation\nAnd, man, I know I can drop a down payment on that Porsche Cayenne\nBut, what, I went along with the plan\nPaid for my own video, directed by my man\nMan, I know God was holdin' my hand\nWouldn't let me go before I go on Def Poetry Jam\nWouldn't let me throw in the towel 'fore I got to throw in some vowels\n'Bout what we goin' through now\nGirls got a crush on me like I did beats for Mr. Cheeks\nAnd since the accident they tellin' me it's the cheeks\nAnd if you look at history\nThat last rapper that almost died sold 6.5\n'Cept I'm comin' from the Chi\nThrough the wire to the wall\nAll my rhymes is raw\nAll these beats beats beats beats beats\nAll of them could of been lost\nI always got to floss\nI almost paid the cost\nSo before I go to sleep sleep sleep\nAlways thank the Lord\nFor this mic and my keyboard\nHeck naw, that boy is raw\n\nYou hear that? That's all that jewelry I got on man\nSometimes I take it off at the airport but I still get stopped\nThey be like \"There go Kayne, there go Kayne!\nCan I see some I.D. please? So thank you very much\"\nFirst of all, my momma named me Kanye so y'all gon' call me Kanye\nI'm like the girl on the 'Sixth Sense'\n\"I'm feelin' much better now\"\nI feel a whole hell of a lot better man", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}