{"songs": [{"title": "If You Can Huh! You Can Hear (original version)", "album": null, "year": null, "lyrics": "Hey, yo man, I think that dude's tryin to break into your car\n...what?\n\nNew york life... type trife...\nThat's why I'm tryin to shine the light, yo\nHere it come, here it come, here it come, y'all\n\nMos def, blessed with the breath of life so arise and give praises\nTurn my face to where the mighty sun raises\nMy book of rhyme pages, filled with phrases that amaze\nI could go on for days\nFirst name dante, last name beze\nBuild the house of tomorrow with bricks of today\nMy foundation rests on allah corner stone\nShine the light throught the mic to radiate your zone\nSee, the world that we know is about to get finished\nI'm watching last days wind down to final minutes\nGot dreams of paradise and my whole fam in it\nSo I ain't got time to play no crime lieutenant\nDo you got time to play the crime lieutenant?\nSee time is the asset, how you gonna spend it\nThe way you handle yours will be well documented\nIt's the raw authentic, sandalwood scented\nTo make you bump the joint and in beyond city limits\nTwenty-first, no time to, approach a thing timid\nMy name is mos def and this is how I get in it\n\nChorus:\nHey yo, my man (huh? )....\nSomethin tight comin through the pipe (what? )\nYou heard the first time, the rhyme is designed\nTo incline throughout space and time (yeah)\nYou don't believe, lend a ear, yo my man (huh? )\nSomethin tight comin on your right (what? )\nYou heard the first time, the rhyme is designed\nTo incline, I hold the fold to shine (yeah)\nIf you can huh, you can hear it...\nIf you can huh, you can hear it, we in your atmos'\n\nShine like black gold, burn like black coal\nMake a old timer roll up her sleeves, now that's cold\n\nBehold, the one and only has blessed my testimony\nApproach the ceremony authentic, never phony\nFor delf, but never lonely, keep the kinfolk close\nWatch me rip it on pacific and atlantic coasts\nWith the antidote, for the poisonous snake lies wit\nOnly wimps put the hiss on tape\nYou can't get on straight, this is dead on tape\nAccompanied by shawn j. with the bid on bait\nPut the grid on plate, on the ear or tray\nHot damn it captain kirk and the klingons say\nYou can't sit on stage, you got to get on the m-o-\nT-i-v-a-t-e real life, ain't no freebie\nMy seed can't be needy, no time for freaky-deaky\nI'm movin on up like george and wheezy\nWho said that this was easy, they must have been treetop high\nStandin yieldin to our boldfaced lie, we all got to die\nSo all got to try, to live life right\nIn the sight of most high, to live life right\nIn the sight of most high, to live life right\nIn the sight of most high, to live life right in the sight\n\nChorus:\nHey yo, my man (huh? )....\nSomethin tight comin through the pipe (what? )\nYou heard the first time, the rhyme is designed\nTo incline throughout space and time (yeah)\nYou don't believe, lend a ear, yo my man (huh? )\nSomethin tight movin on your right (what? )\nYou heard the first time, the rhyme is designed\nTo incline, I hold the fold to shine (yeah)\nIf you can huh, you can hear it yo, my man (huh? )....\nSomethin tight comin through the pipe (what? )\nYou heard the first time, the rhyme is designed\nTo incline the pure genuine (yeah)\nYou don't believe, lend a ear, yo my man (huh? )\nSomethin tight movin on your right (what? )\nYou heard the first time, my rhyme is designed\nTo incline, I hold the fold to shine (yeah)\nIf you can huh, you can hear it...\nIf you can huh, you can hear it, we in your atmos'...", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}