{"songs": [{"title": "Outta Proportion", "album": "Evil Genius", "year": "2018-12-07", "lyrics": "[Intro]\nHah\nCook that shit up Quay\nScooch (Evil)\nHah (Genius)\nFast coupe, haha (Nyoom)\nHah\n(Mr. Nice Guy, haha)\n\n[Verse ]\nIf you ain't 'bout lettin' that choppa go, we ain't got none in common (No)\nI hate snitches, I like bitches (Snitch), but I'm so in love with money (Money)\nHad to cut some of my kinfolks off, they didn't keep it one hundred (What's up?)\nIf I said it, then I done it (Huh?), fuck that fake love, I don't want it\nTime to renegotiate my contract, bitch I feel like Andre Drummond (Wow)\nI'ma throw a half a mil' on Instagram lookin' like I play on Sundays\nYou just chick who suck my dick\nMiss Lady, you're not the other woman (No)\nFuck that friendship that's platonic (No)\nI need a friend that keeps me cumming (No, no)\nTouch down in Boston, Gucci be flossin'\nI'm about to go Stone Cold Steve Austin (Scooch)\nThieves on my trail, but you know I lost 'em (Scooch)\nFour pipes, yeah I quadruple exhaust 'em\nOutta this world like Marvin the Martian (Hah)\nFifty a verse and I'm underchargin'\nThese rappers so fake that they screamin', \"Extortion\"\nMy choppa keep blowin' shit out of proportion\nShout out these saucin', niggas are horsin'\nBooties and titties, the perfect proportion\nPostin' a pic and it's makin' me horny (Yeah)\nBaby these carats, these are not pointers\nKillin' that pussy, I'm Gucci Kevorkian\nBallin' in Fresno like Jerry Tarkanian (Yeah)\nGucci's the alien, I'm from uranium\nDroppin' the top, yeah I'm crackin' the cranium (Drop)\nOut in the stadium (Top) like I play (Guwop), all my kinfolks call me Ray (Ray)\nThen my grandad look at me, like, \"I'm so damn glad you lit\"\nWhy's your jewelry lookin' aluminum?\nWhy's it dull? What did you do to them?\nI'm gettin' full, pockets on stuffed (Ooh)\nDressin' like a plug, yeah I stay jerked up (Scooch)\nKnocked me down, picked 'em up\nSalt me down, yeah fuck me up (Yeah fuck me up)\nToo turnt up, too turnt up\nKnocked me down, but I picked them up (Whoa)\nSalt me down, salt me down\nYeah they salt me down, but I turnt them up (No)\nBut I'm too turnt up (Too), I'm so up (Up, up, up, up)\nWop\n\n[Chorus]\nOutta proportion, outta proportion\nMy choppa keep blowin' shit outta proportion\nOutta proportion, outta proportion\nMy choppa keep blowin' shit outta proportion\nOutta proportion, outta proportion\nOutta pro-outta proportion\nOutta proportion, outta proportion\nMy choppa keep blowin' shit outta proportion", "image": "https://images.genius.com/4f3deff165261badc2f2958b01df3902.1000x1000x1.jpg"}], "artist": "Gucci Mane"}