{"songs": [{"title": "Compton Story", "album": null, "year": null, "lyrics": "Intro:\n\"Uncle Chucky would you read us a bedtime story please, huh please?\"\n\"Alright you kids get to bed, I'll get the story book\nY'all tucked in?\"\n\"Yes\"\n\"Heeeere we go...\"\n\nSlammed the Impala door hopped out\n\"What do you see?\"\nSome niggas hanging on the fence looking at me\nI had fat red laces in my Adidas\nBig chain around my neck like mardi gras\nSo I stepped up to 'em, \"is there a problem here?\"\nOne nigga lifts his shirt then he yells out \"yeah\"\nSo I turned around quickly and i jumped in my car\nI was about to hit the switch then I thought like, \"nah\"\nSo I reached under my seat and I grabbed my shit\nIt was the chrome .45 with the kung-fu grip\nStuffed it inside my dickies as I jumped out the car\nKept my hand on the trigger as I walked in the store\n\nOne nigga walks in then here comes two\n\"What did you do?\", I shot, \"Are you crazy fool?\"\nOne nigga hit the ground and the other two scrammed\nNow the cops are outside well I'll be damned\nIt was 7:15, on my rolex watch\nAnd i can't do the time that my rolex got\nAnd like the hands on the clock, I went this way that a-way\nRan around the corner and that's when I threw my gat away\n\nAn Impala passed, its my home boy Clyde\nHe gave me the hand signal so I jumped in his ride\nIt was a clean '64 original inside\nWith no key in the ignition, \"where'd you get this clyde?\"\nNevermind I'm out, its a stolen whip\nAnd I'm already runnin from the cops and shit\nSo I hopped out the car like the dukes of hazard\nThen Clyde yells out \"you stupid bastard!\"\nStart runnin' through traffic and I almost got hit\nI lost one of my shoes, its my air force shit!\nIm hobblin' down the street with one shoe on\nWalked straight into some niggas with all blue on\nI only ran 30 blocks, how I end up in Long Beach?\nCause in California, the gangs in arm reach\nHe saw my red strings so he punched and caught me\nThen I knocked his ass out and took his boy out his Barkley's\nI ain't seen these since 92\nI'm feelin' like a bad boy without the shiny suit\n\nHere the cops come, shit! So I dashed behind the Honda\nAnd look who's here, my baby momma's friend Rhonda\nIn the car kissin' on this dope dealer Chris\nBut little did he know he was suckin' my dick\nI start bangin' on the window \"I don't mean to disturb\"\n\"But Chris can you drop me off downtown on 3rd?\"\nHe said \"why sure, what up game hope in\"\nHe was bangin Slick Rick then I got an idea\nBefore we get to 3rd drop me off right here\nSo I can walk inside the mall and cop some new gear\nAs I walked in the store they could see I was in a rush\nSo they bout me some jeans, a t-shirt and some fresh chucks\n\nWalked out the store looked left, \"oh no!\"\nRan back in the store, here comes the 5-0\nSo I ran real quick, made a move to the back\nCold knocked this cute bitch into a polo rack\n\"sorry\", jumped over her and fled to the back door\nThen I kicked the shit open, you won't believe who I saw\nIts the nigga Chris in hand cuffs pointin' at me\nAnd the cops made chase before they let Chris free\nOne cop tried to grab me and the other one missed\nI got away one more time and they both got pissed\n\nFull speed out the mall, spotted this blue coupe\nDogg Pound on the plates, that gotta be Snoop\nSo I ran up to the car and I said \"Yo Snoop, the cops got me on the run\"\n\"need a ride nephew?\"\n\"Hell yeah big snoop\"\n\"Lil homie hop in\"\n\"Drop me off in Compton\"\nAnd that's where my story ends\n\nNow this ain't funny so don't ya dare laugh\nJust another story about the wrong path\nHad a long day so I reclined my seat\nIt was a 20 min ride to the CPT\nWalked straight into the house, pulled out my key\nOpened up the door, it's my girl playing Biz Markie\n\nOh you, you got what I neeeeeeeeeed", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}