{"songs": [{"title": "Run This Town (Bambi Remix)", "album": null, "year": null, "lyrics": "[Intro: Rihanna]\nFeel it comin' in the air (Uh huh)\nHear the screams from everywhere\nI'm addicted to the thrill\nIt's a dangerous love affair\nCan't be scared when it goes down (This, this goes out)\nGot a problem tell me now (To everybody in middle school)\nOnly thing that's on my mind (That didn't fuck with me)\nIs who's gonna run this town tonight? (Listen)\nIs who's gonna run this town tonight? (This goes out to all them, them dudes that get picked on)\nWe gonna run this town (Here we go)\n\n[Verse 1: Childish Gambino]\nYea, the flow so absurd\nIt's C.G. boy, king of the black nerds\nI gotta get my Urkel on\nI won't stop until I see an afro at Comic-Con\nAnd not just Samurai\nI was an outcast, nickname Aquemini\nThe wait's over, like two pounds over scale\nI'm doing big things like I'm eating out a whale\nThese niggas do the same shit because they scared to fail\nI'm in a hot pink hoodie, I ain't ever scared\nThese niggas frontin', sayin' like \"he gay and shit\"\nAnd then they wonder why nobody wanna play they shit\n\n[Hook: Rihanna]\nLife's a game but it's not fair\nI break the rules so I don't care\nSo I keep doin' my own thing\nWalkin' tall against the rain\nVictory's within the mile\nAlmost there, don't give up now\nOnly thing that's on my mind\nIs who's gonna run this town tonight\nHeeeey-hey-hey-hey-hey-heyyy\nHey-heyyy-hey-hey-heyy\nHeeeey-hey-hey-hey-hey-heyyy\n(Is who's gonna run this town tonight)\nHey-hey-hey-heyyy\n\n[Verse 2: Childish Gambino]\nWe are, yea I said it we are\nNigga I'm a soldier, trooper like I'm VR\nWhere's my fuckin' key card\nIt was right behind me\nFuck it, home girl you can blow me in the lobby\nMy girl loves brains, so she is my zombie\nNa home boy, I don't practice, this my hobby\nThey all say make a demo tape so they can sign me\nCause yo boy stay mo hot than Gandhi\nListen up (Illll)\nI don't do this for the limelight\nI do this for kids who get picked on for talkin' white\nI do this for kids who rock out to The White Stripes\nIf you a nigga with glasses and skateboards, I got you right (Illll)\n\n[Hook: Rihanna]\n\n[Verse 3: Childish Gambino]\nIt's crazy how you can go from being Joe Blow\nTo get here, it takes guts like the aggro\nCrag\nThey used to call me fag\nCause I ain't wanna be on the corner holdin' the bag\n\"Well fuck them niggas, they only holdin' you back\"\nSaid a little voice inside of me wearin' a yellow cap\nOr maybe it was bright pink, I can't remember\nAlls I know I wrote my first verse that December\nNow I'm so sick boy, yea I'm straight loungin'\nNiggas used to say \"who?\" like I'm Pete Townshend\nYea, it's hard to stay grounded\nWhen you're Andre and MST 3000\nAll rolled into one nigga\nI 69 a 49er boy, gold diggers\nI grind all day to stay alive\nSo I guess I'm a Mac with a hard drive\nIf you think you hype now, see the boy live\nBright colors in the streets like I'm gay pride\nYea my hoodie look like it drank five alive\nAnd these dudes play my shit like I'm Goldeneye\nIf you could see the best, go be it\nAnd if I die young nigga so be it\nLike I told you on the other track\nIf there's a dude tight as me, I ain't seen him yet\n\n[Outro: Rihanna]\nHeeeey-hey-hey-hey-hey-heyyy\nHey-heyyy-hey-hey-heyy\nHeeeey-hey-hey-hey-hey-heyyy\nHey-hey-hey-heyyy\nHeeeey-hey-hey-hey-hey-heyyy\nHey-hey-hey-heyyy\nHeeeey-hey-hey-hey-hey-heyyy\nWe gon' run this town tonight", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}