{"songs": [{"title": "8-11", "album": null, "year": null, "lyrics": "[Girl signing]:\n8/11\nAll must fall\nAll must fall\nAll must fall\n8/11\nAll must fall\nAll must fall\nAll must fall\n\n[Royce talking]:\nJeah. I'mma tell y'all motherfuckers one thing right now. I just spilt my motherfuckin' liquor in this booth and I'm UPSET. Slaughterhouse is in the building. 8/11 album in stores. Nickle nine is in the building. You want a problem? It's yours\n\n[Verse One]:\nI am God's concoction of Molotov breathin'\nPut inside an out and lost region\nI am law, king and\nI eat body, buy 'em all blingin'\nPowder or weed, know I got it all seasoned\nAnd you should just agree that you could be a G\nAnd you can do the Shady thang, you can flip the E\nLike the fifth letter in my nigga Shady's name\nYou fuckin' with the head conductor of the gravy train\nI gotta thank the shooters\nCause they the reason niggas go missin' flyin' over that Triangle that ain't Bermuda\nSo what you speakin' 'bout?\nIt's ironic that I'm stayin' at The Palms and that's what your bitch eatin' out\nI ain't that worried 'bout what you want to do to me\nWhat the world would like to do to Dr. Conrad Murray\nI'll be flow, switchin' so much it's almost a given\n\n[Verse Two]:\nWho they gon' compare us to?\nThis is not a contest\nSlaughterhouse is a bionic bomb threat\nThis is God's doin' not a concept\nThis is not a contract\nWe are not The Four Horsemen, we are beyond that\nRespect to Wu cause that respect was due\nBut we will step to any of the rest of you\nIf you ain't the Random Axe I don't see how you can relax\n\nLet me repeat\n\nIf you ain't the Random Axe I don't see how you can relax\nThis is open season on any group, hammer back\nYou can jump in front of that barrel if you wanna\nYou on that marijuana, I'm high I'm feelin' like a pharaoh hailing from Ghana\nShark in that water though I am a whale of a problem\nBack up the Bird like I'm Kevin McHale, I got 'em\nHe a beast, you need to stay on your tippy toes to see his feets\nI let the re-up speak\nI'll let you owe me, playin' PSP, while I let the homies play that GPS\nSo street thugs I recruit, I salute\nThat way I ain't gotta spill your cheap blood on my suit\nWhat it cost me to tailor this, them niggas would kill for\nThey don't ask if it's rap beef or if it's real war\nI'm the best nigga out, cut and dry done\nNo matter what you up to/two, I won/one\nThe combination of lion hearts and fine art\nWe like a modern day tribe you couldn't pry apart\nIf we ain't competing with the Juice Crewers\nBusta Rhymes sittin' us down to Leaders Of The New Schoolers\nDJ Premier is sayin' \"Wow!\"\nBun B, M.O.P., askin' niggas how\nThis is done in a way where it works for the betterment of everyone involved\nIt's intelligent, it's awesome\nBefore we had the block sayin', \"Yeah, we fuck with y'all.\"\nBut now we got the Lox sayin', \"Yeah, we fuck with y'all.\"\nThis is legendary, death to new groups\nWe cuttin' niggas short like the end of February\nThis is straight up pioneer driven\nI ain't stoppin' till I am is where Em is\nI'm the template for the I Am There premise\nLike a butt naked snitch, bare witness\nThis is the undertaking\nI am the dead business\nAugust 11th niggas", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}