{"songs": [{"title": "Golden", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Intro: Tyler, The Creator as Dr. TC]\n\"Tyler, you... obviously have some fucking problems...\nAnd, this is... this is the end of this session, let's... anything else you've gotta say?\"\n\n[Verse 1]\nMom is getting jealous, I see my manager more\nThan I see her before I go on tour and it hurts (Yeah)\nI miss the days when this was fun, but now it turned into work\nAnd getting legal, so I got to watch the shit that I blurt out (As you should, that shit's outrageous...)\nMy friends are turning into opposites\nBecause my life is turning into opposite of sloppy wrist\nAnd all the bitches who forgot about me want to ride my dick\nHarder than the white kids who copy shit\nEnding it is all I fucking think about, that's the shit I think about\nAll alone, bawling 'til my motherfucking eyes bleed\nSee, he's a leader in person and smile, shit gets disgursting\nWhen there's no person around, talking discussion shit, man, fuck\n(I'm here to talk to you) I'm putting myself at a distance\nFor instance, my best friend is now my fucking assistant (Who, Travis?)\nNiggas saying \"Free Earl\" without even knowin' him\nSee, they're missing a new album, I'm missing my only friend\n\n[Interlude: Tyler, The Creator and Tyler, The Creator as Dr. TC]\nYou have everyone around you, with... thirty names a day?\nI don't see what it is? I mean, you--not like you don't have anyone to talk to...\nI'm here for you, I'm your friend\nWhen I say Odd, y'all say Future\nOdd... Uh-uh, nah, that shit's corny as fuck, fuck!\nTyler, you're doin' good. You have a cult following, you're-\nTo these white kids?\nOh, my gosh\n\n[Verse 2]\nCharbroiled nigga on these dark beats\nNauseous with the Nazi but it's normal what the cops see\nAwesome at his concert, but he never had a pop, see\nMommy was a living single queen with a lat ti\nSo while my wallets piling with symbolic colored paper\nI lace her, cause she gave me such a lot at such a young age\n20, why didn't she get that abortion?\nProbably cause that motherfuckin embryo was morphing\nInto a Grammy-winning schizophrenic fucking orphan\nOops, I mean bastard, skinny-ass disaster\nMom works hard, still working on her masters\nSon lies about taking classes at community college\nJust to record some bullshit he calls Bastard\nStart a fuckin cult, clash his talents in a brash way\nBefore he even had a mustache and cash\nAnd all I got was a fucking shitty article in Thrasher\n\n[Interlude: Tyler, The Creator and Tyler, The Creator as Dr. TC]\n\"Alright, just calm down\"\n\"That ain’t shit, man\"\n\"Now don’t, don’t, don’t make yourself seem guilty. That, that article was great\"\n\"No, fuck that, nigga\"\n\"You're beating yourself up and your living the fucking life right now, kid! When I was your age, I would have loved to be fucking doing the things that you're doing right now\"\n\"Fuck that… fuck all this shit\"\n\"You, you, you act like I’m not here\"\n\"You're not\"\n\"I'm exactly who you’re supposed to be talking to\"\n\"You don’t fucking help me with shit\nYou don’t help me with shit, fuck!\"\n\"Yeah, you get... that, that—who wouldn’t do that?\"\n\"Fuck you! Fuck you!\"\n\"Who wouldn’t, who wouldn't shoot their friend?\"\n\"Old fucking fuck!\"\n\"That’s fine, it’s not your fault\"\n\"I killed my fucking friends... fuck!\"\n\"I’m gonna need security in here, and, uh…\"\n\"Fuck! I didn't fucking sign up for this shit!\nI'm, I'm not fucking crazy—I'm a fucking table! I'm a fucking table!\"\n\"Yes, come quick. He’s losing it\"\n\"No, fuck this shit!\"\n\"Tyler, calm down\"\n\n[Verse 3]\nI'ma grab the Nina (No!) and find a nice arena\nCause I can’t even choose between Ortega or Sabrina (Get security in here.)\nAnd I’m not even human, I’m a body shaped demon\nWith some semen in my sack and some problems in the back (Calm the fuck down!)\nAnd a life that’s fill with crap, and a finger filled with hate\nAnd a gat that’s filled with love, now let opposites attract\nI can finally be one (No!) like a marriage in a church\nBut this marriage has a hearse and the parents of the one\nThat’s getting married has a curse and it’s made up inside of him\nToo late to reimburse but, wait, it gets worse!\nAll the guests that’s in the church all decided to disperse (Tyler...)\nSo there was nobody who could stop the wedding with converse (You don't want to do this...)\nSo they tied the knot, now it’s too late to reverse\nThis arrangement (Yes, it is) and the nurse is amazed\nAt the hurt that he was painting (Calm the fuck down!)\nBut it was obvious in all the photos he was paining\nNow a bunch of whispering immerse\n\n[Outro: Tyler, The Creator, Tyler, The Creator as Nurse, (Security Guard), Dr. TC]\n\"Yeah, he's right there. Security's right there.\"\n\"Shit! No, get away from me.\"\n\"Get him.\"\nAnd then the nurse blurts\n(\"Come here.\")\n\"What the fuck is his problem? Here, we have two doses to give him, here\"\nWhy didn’t anybody ask him first?\n(\"Get on the ground!\") \"Hold him down.\"\n\"I’ve been asking you this whole time, Tyler...\"\n\"Get the fuck away from me! Get away from me!\" (\"Come here, motherfucker!\")\nBecause nobody gave a fuck\n\"Get the fuck off of me...\"\nSomeone gave a fuck Tyler\nAnd, uh... the person that gave a fuck was me\nSee, you’re not, going crazy... it’s me. I’m your best friend, Tyler\nI know everything, I know everything about you\nYou’ve been helping yourself this whole time. Your friends? They’re just figments of your imagination\nDr. TC... See Tyler, I’m your conscience\nI’m Tron Cat, I’m Ace, I’m Wolf Haley, I’m... (Me)", "image": "https://images.genius.com/fd29e400e2d672aa992f9fda170e9959.640x640x1.jpg"}], "artist": "Tyler, The Creator"}