{"songs": [{"title": "Nina", "album": "The Drought Is Over 6 (The Reincarnation)", "year": "2008-11-26", "lyrics": "[Verse 1]\nNow it was me and Lil CC and we was chilling by ourselves\nPopped a pill and now I'm feeling myself\nAll these cuts on my wrist, it's like I'm killing myself\nDiamond cuts is what I mean, I'm so hot I might melt\nOnly in your bitch mouth, nigga whatcha talking 'bout\nYou ain't talking 'bout shit if you ain't talking bout this\nDon't worry 'bout me, worry bout my bitch\nDon't worry 'bout me, worry bout my bitch\n\n[Hook]\nI got a bitch named Nina, and Nina's so slutty\nCause she'll do him and everyone of his buddies\nSay, she'll do him and everyone of his buddies, yeah\nShe'll do him and everyone of his buddies\nProtection off, safety - I look straight ahead\n\"I got them niggas Weezy\", that's what the .380 said\n\"I got them niggas Weezy\", that's what the .380 said\nThat's what the .380 said, that's what the .380 said\n\n[Verse 2]\nMan y'all ain't ready\nI'll take one -- me and Lil Terry\nAnd we hold court like Mason Perry\nOops, I meant Perry Mason, the weed got me dyslexic\nI’ve been hungry since I entered and I ain’t looking for an exit\nEat or get ate, and you looking like breakfast\nYou done took it too far, now don't stretch it\nDamn, my bitch sexy\nAnd my bitch slutty\nCause she'll do him and everyone of his buddies, yeah\nShe'll do him and everyone of his buddies\nYeah, she'll do him and everyone of his buddies\n\n[Hook]\n\n[Verse 3]\nIn the back of the 'Bach\nIts just me and my little brother, bitch\nWe call him Little Snack\nUm, why we call him that?\nCause he like to eat snacks\nAnd I like to eat rappers like he like to eat snacks\nI call em emcee snacks\nYou emcees wack\nHow 'bout your funeral? Let me emcee that!\nThree emcee facts:\nMy name's Dwayne Michael Carter, DMC's back!\nNigga walk this way\nAnd I'm gonna paint your ass like an art display\nI'm really rich, I just talk this way\nAnd maybe if you get rich you'll talk this way!\nSee, right now I'm talking foreign, you dig? I'm talking foreign\nLeave a hole in the boy big enough to park a car in\nYou're on, but you ain't on it, I'm more on like Warren\nMove, boom! Now my bitch talking for me\nDamn, and she's so slutty\nCause she'll do him and everyone of his buddies\nSay, she'll do him and everyone of his buddies\nMan, she'll do him and everyone of his buddies\n\n[Hook]", "image": "https://images.genius.com/3f99fb60638817d357014fe4a769ff57.320x320x1.jpg"}], "artist": "Lil Wayne"}