{"songs": [{"title": "Stop Frontin’", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "[KRS-One]\nBo! Boom bye bye, hip-hop will never die\nDespite the fact that I'm fly I'm never dry\nYou could beat me, cheat me, when you meet me try to defeat me\nBut nevertheless you'll have stress, cause I don't rest\nYou wanna know what my problem is, if you're curious??\nI take this hip-hop shit too serious!!\nI forget that other rappers ain't true to this\nSo when they grab the mic I get hyped like LET'S DO THIS!!\nAll my rhymes are fat, while rappers are skimpy, wimpy\nSo I simply chew they crew like a Blimpie\nSkip me when you dissin, skip me when you on a ego mission..\nI blow up, like nitroglycerin!\nYou better tune in to Teddy Ted\n\"Yo stop frontin', and use your head\"\n\n[KRS-One]\nWell if you ain't called it hip-hop, there's a door, I ain't stoppin\nI got more flavors than Baskin Robbins!\nI flash the funky fresh flavors force-fully\nFreak the phonies and flip philosophy constantly (true!)\nThat reminds me, rappers rock drip-drop\nNot hip-hop, they wanna SING and all dem ting\nThank God KRS is still rappin; all that \"ooh I love you baby\"\nAnd \"blink blink blink\" - this ain't happenin\n\n[Kid Capri]\nYo this is curtains for these rappers that be frontin on the next man\nLookin down at brothers just because they gettin checks and\nHaven't got a skill but they're LARGE on the hum-bum\nYou wanna step to Kid Capri, COME COME COME!!\nI break em up, just for actin like a superstar\nAround the way, we got a neighborhood trooper car\nWe ride by, and spray your crew, and your honies too\nAnd rip you open and drink your blood like a Mountain Dew\n\n[KRS-One]\nI descend I lend a friend a helping hand\nTo stop a trend, again and again and again, I just can't say when\nI beg to confess my sins to other men\nReverands guard lips, within there I'll begin\nI'll always win, over-sakin\nThe party is ripped, without a hit or with a hit I'm rippin shit\nYou must admit, I'll never quit the lyrics I flip\nI'm tough like licorice, battlin Kid Capri? It's ridiculous\nWe come to the party inconspicuous..", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}