{"songs": [{"title": "Rap City Freestyle", "album": null, "year": null, "lyrics": "[Verse 1: Big Tigger]\nRap City, The Basement\nBig Tigger, off the top, freestyle, no replacement\nWith my man Ludacris, and I-20\nComing on down every week and scooping honeys\nYou know how it go but please abstain from testing us\nThe album called The Golden Grain\nDTP, watch the kids flow, step out the way\nAnd let my man Ludacris come through with the flow\n\n[Verse 2: Ludacris]\nI see some fools ain’t smart ‘cause they going against me\nI been rapping since Tyson punched Soda Popinski\nOn a whole ‘nother level, I pass the elite\nYou can ask Red and Meth, I’ll rip a Casio beat\nRibbit! Chicks dig it, long as my clique spit it\nMy Cadillac truck gets lower than six midgets\nIt’s wood, kid-id, cars for six digits\nI’ll rip ya eye out and play FOOS-ball with it\nGirls see me, they holler and holler hard\nSo much money, I’m ‘bout to buy College Park\nMy records just play, I don’t need payola\nLong as my eyes stay redder than crayon Crayolas\nAnd drill the player-hater, you hardly stacking\nWhen you see me, don’t say nothing like Charlie Chapman\nLudacris, mmm! “Velvet Jones”\nAKA “Slap a TRICK With a Cellular Phone”\nI’m carrying chrome, bullets headed straight to your dome\nI dig my cradle from my grave, bury my bones\nIt’s scary alone, scarier than hesitant people\nGotta smoke a lot of good, ‘cause my residence evil\nMy weapons are lethal, lethal like Murtaugh/Riggs\nAfter I blast you, I’ma hurt y’all kids\nWhen they see me in the street, parents blast and boo me\nTVs in my ‘Lac are showing nasty movies\nAnd all I gotta do is make a Hillandale call\nI’m big, you smaller than Avondale Mall\n\n[Break: Ludacris]\nWhat! What! What!\nI-20, what’s up? What’s up? What’s up?\n\n[Verse 3: I-20]\nYeah, after ground, I hit you, put you under the street\nThe only peace that I know is hidden under my seat\nDisturbing tha Peace, we selling out, you still on the shelf\n2-0, I’m Pee Wee Herman, man, I’m feeling myself\nYou feeling my wealth? Check it, dog, here comes the cream\nSo many throwbacks, you’d swear I got a time machine\nKnow what I mean? Jump in the big-body Benz and\nCar been stopped with the rims still spinning\nIt’s Information Infamous, I keep an infrared\nDucking D.A., neglecting off to never mess with Feds\nI’m all about the bread, chrome to ya head, I bust it down\nPeople call my style “monogamy,” ‘cause I don’t mess around\nYeah!\n\n[Outro: Big Tigger & Ludacris]\nI-Dub!\nTryna replace me in the worst way\nShoutout to JT, it’s his damn birthday\nWhat! Golden Grain, baby!", "image": "https://images.genius.com/d211edacb8de02968540124c6801063d.1000x1000x1.jpg"}], "artist": "Ludacris"}