{"songs": [{"title": "Drowning", "album": "Dedication 6: Reloaded", "year": "2018-01-26", "lyrics": "[Intro: DJ Drama & Vice Versa]\nA Dedication\nRest in peace Fredo Santana\nSay that she used to be a lifeguard\n\n[Chorus: Vice Versa]\nSo much fake love, I been drowning, drowning\nPop me a perc, in my zone and it's timeless, timeless\nI've been so hot, tell a nigga come find me\nBeen at the bottom, look down and I bet you gon' see diamonds\nSo much fake love, I been drowning, drowning\nPop me a perc, in my zone and it's timeless, timeless\nI've been so hot, tell a nigga come find me\nBeen at the bottom, look down and I bet you gon' see diamonds\n\n[Verse 1: Lil Wayne]\nDon't ask me for shit but this blunt or this dick\nFake love in the air, love bugs turn to ticks\nThat's more than enough, Pink Floyd in the cup\nBrrrrrp, I always pick up, 'less she callin' my bluffs\nSmell it, like it, buy it, light it, hit it\nMix it with some molly now we gettin' scientific\nBought another house just to put more pots to piss in\nBitches got they hands out\nI shake it like we just did business, this just business, wait\nOh my God, I'm drowning in her kidneys, she like\n(Oooooohhh) I just listen\nAnd the higher notes she hit it, I know I sound like a grizzly\nAnd the cocaine look like crystals, that's that white girl, call her Chrissy\nHol' up, listen, see, you fuck it all up, you put that wall up\nYou feelin' yourself, but I can't hate, 'cause you got that soft touch\nOkay, you standin' in rain and driftin' it\nYou lookin' for change but penny pinch\nYou swallow your pride, I'm sippin' it\nYou drown in your tears, I swim in 'em, 6 shit\n\n[Chorus: Vice Versa]\nSo much fake love, I been drowning, drowning\nPop me a perc, in my zone and it's timeless, timeless\nI've been so hot, tell a nigga come find me\nBeen at the bottom, look down and I bet you gon' see diamonds\nSo much fake love, I been drowning, drowning\nPop me a perc, in my zone and it's timeless, timeless\nI've been so hot, tell a nigga come find me\nBeen at the bottom, look down and I bet you gon' see diamonds\n\n[Verse 2: Vice Versa]\nI'm off the codeine refill my cup\nRobotic coupe while I'm pullin' up\nWas feelin' down so I spiked my cup\nWas in need of you so I hit you up\nHollywood, I'm in a loft\nCatch a plane, Randy Moss\nBag 'em up, ship 'em off\nFuck the law, what's the cost?\nPlease don't be freaks on me, ooh get the snakes on me\nBeen \"What's the cost?\" Get 'em in, get 'em off\nPop a perc I take off\nGot a bitch [?], then she claim she from Mars\nThat bitch a liar, though\nSay she a rider, bro\nSay that she also a model, bro\nSay that she used to be a lifeguard, savin' you\nYou don't see me drownin' hoe\n\n[Verse 3: Marley G]\nMarley don't shoot 'em, but I still keep a chopper on me\nTrap in silence, if they want you know that I'm a-(ooh)\nNiggas hatin', debatin', don't wanna see me prosper\nMy flow is ill as fuck, niggas better call a doctor\nOver when the fat lady sing done sing like an opera\nBack in the G, I was flippin', runnin' through the projects\nIn the backyard with Tune ballin' in a pair of Balmain's\nLast time I bought my bitches, I swear I love 'em all, mane\nI be high as fuck, I be fly as fuck\nMy bitches is nasty, fuckin' her from the back, she callin' me daddy\nWith two in Miami, all for the family, do it for granny\nI go with my move, nothin' to prove\nDroppin' Choos, wearin' jewels\nCouple thou' on the shoes\nShawty wet like a pool\nBitches see me and they drool\nWe don't [?]\nYM, never lose\nIt's my time, no snooze\nIt's my time, no snooze\nYM, never lose, yeah\n\n[Chorus: Vice Versa]\nSo much fake love, I been drowning, drowning\nPop me a perc, in my zone and it's timeless, timeless\nI've been so hot, tell a nigga come find me\nBeen at the bottom, look down and I bet you gon' see diamonds\nSo much fake love, I been drowning, drowning\nPop me a perc, in my zone and it's timeless, timeless\nI've been so hot, tell a nigga come find me\nBeen at the bottom, look down and I bet you gon' see diamonds\n\n[Outro: Lil Wayne]\nThe craziest place I've ever seen a Lil Wayne tattoo on someone is... you ready? So, I'm 'bout to explain it, um... inside the lips of their pussy. Um, that's just the craziest place. So like, even when you see the pussy, she can show any man her pussy, he won't see it. She has to literally open her pussy up for you to see the name. Shout out- shout my homegirl, that's my homegirl, one time for her. I love you, girl. What's the craziest place I haven't seen a Lil Wayne tattoo is when people come up to me and say \"You know I got your name on me, but, like, I can't show you right now 'cause I'm in work,\" or, \"I can't show you right now 'cause,\" whatever. You ain't got my fuckin' name on you, shut the fuck up", "image": "https://images.genius.com/3622689a5172c789024942436b11dce2.800x800x1.jpg"}], "artist": "Lil Wayne"}