{"songs": [{"title": "We Major", "album": "Late Registration", "year": "2005-08-30", "lyrics": "[Produced by Jon Brion, Kanye West & Warryn Campbell]\n\n[Chorus: Really Doe]\nYou muh'fuckers better do your job and roll up\nAnd watch how we roll up\nAn', I can't control it, I can't hold it, it's so nuts\nI take a sip of that 'gnac, I wanna fuck\nI take a hit of that chronic, it got me stuck\nBut really what's amazin is how I keep blazin'\nTowel under the door, We smoke until the day's end\nPuff puff and pass, don't fuck up rotation\nHpnotiq for Henny? Now nigga that's a chaser\nTurn nuttin to somethin, now pimpin that's a savior\nBest things are green now pimpin get your paper\nHigh off the ground from stair to skyscraper\nCool out, thinkin we local, c'mon, homie, we major\n\n[Post Chorus: Kanye West]\nWe major? C'mon, homie, we major\nWe major? C'mon, homie, we major\nWe major! C'mon, homie, we major\nWe major! C'mon\n\n[Verse 1: Kanye West]\nFeelin'better than some head on a Sunday afternoon\nBetter than a chick that say yes too soon\nUntil you have a daughter: that's what I call karma\nAnd you pray to God she don't grow breasts too soon\nProjects to' up, gang signs is thrown up\nNiggas hats broke off, that's how we grow up\nWhy else you think shorties write rhymes just to blow up?\nGet they first car and then IRS show up\nHe ain't never had shit, but he had that 9\nNigga come through flickin and he had that shine\nPut 2 and 2 together and a little bad weather\nGon' be your whole family on that funeral line\nAsked the reverend was the strip clubs cool\nIf my tips helped send a pretty girl through school\nThat's all I want, like winos want they good whiskey\nI ain't in the Klan, but I brought my hood with me\n\n[Chorus: Really Doe]\nYou muh'fuckers better do your job and roll up\nAnd watch how we roll up\nAn', I can't control it, I can't hold it, it's so nuts\nI take a sip of that 'gnac, I wanna fuck\nI take a hit of that chronic, it got me stuck\nBut really what's amazin is how I keep blazin'\nTowel under the door, We smoke until the day's end\nPuff puff and pass, don't fuck up rotation\nHpnotiq for Henny? Now nigga that's a chaser\nTurn nuttin to somethin, now pimpin that's a savior\nBest things are green now pimpin get your paper\nHigh off the ground from stair to skyscraper\nCool out, thinkin we local, c'mon, homie, we major\n\n[Post Chorus: Nas]\nWe major? C'mon, homie, we major\nWe major? C'mon, homie, we major\nWe major! C'mon, homie, we major\nWe major! C'mon, homie, we major\n\n[Verse 2: Nas]\nI heard the beat and I ain't know what to write\nFirst line should it be about the hoes or the ice?\nFo-fo's or Black Christ? Both flows'd be nice\nRap about big paper or the black man plight\nAt the studio console, asked my man to the right\nWhat this verse sound like, should I freestyle or write?\nHe said, \"Nas what the fans want is Illmatic, still\"\nLooked at the pad and pencil, and jotted what I feel\nBeen like twelve years since a nigga first signed\nNow I'm a free agent and I'm thinkin it's time\nTo build my very own Motown\nCause rappers be deprived, of executive 9 to 5's\nAnd it hurts to see these companies be stealin the life\nAnd I love to give my blood sweat and tears to the mic\nSo y'all copped the LP's and y'all fiends got dealt\nI'm Jesse Jackson on the balcony when King got killed\nI survived the livest niggas around\nLasted longer than more than half of you clowns\nLook, I used to cook before I had the game took\nEither way my change came like Sam Cooke\n\n[Bridge: Tony Williams]\nFeeling better than I ever felt before today\nLike better late than never; it's orientation\nStill we can make it better throwing all your cares away\n\n[Chorus: Really Doe]\nYou muh'fuckers better do your job and roll up\nAnd watch how we roll up\nAn', I can't control it, I can't hold it, it's so nuts\nI take a sip of that 'gnac, I wanna fuck\nI take a hit of that chronic, it got me stuck\nBut really what's amazin is how I keep blazin'\nTowel under the door, We smoke until the day's end\nPuff puff and pass, don't fuck up rotation\nHpnotiq for Henny? Now nigga that's a chaser\nTurn nuttin to somethin, now pimpin that's a savior\nBest things are green now pimpin get your paper\nHigh off the ground from stair to skyscraper\nCool out, thinkin we local c'mon homie we major\n\n[Hook: Kanye West + (Nas)]\nWe major? (C'mon homie we major)\nWe major? (C'mon homie we major)\nWe major (C'mon homie we major)\nWe major\n\n[Bridge: Tony Williams]\nFeeling better than I ever felt before today\nBut better late than never; it's orientation\nStill we can make it better throwing all your cares away\n\n[Spoken: Kanye West]\nCan I talk my shit again?\nCan I talk my shit again?!\nI can't believe I'm back up in this muh'fucker\nI'mma be late though\nI gotta figure out what I'm finna wear\nYeah... the Roc is definitely in the building\nGOOD Music's definitely in the building\nI gotta say what's up to Tony Williams\nOn the vocals! Sings, he sings quite beautifully\nDon't you agree? Don't you agree?\nUhh, and Jon Brion on the keys right now\nAnd Warryn Campbell on the keys right now\nSo they ask me: \"Why you call it Late Registration, 'Ye?\"\nCause we takin these muh'fuckers back to school\nIf you know this part right here, feel free to sing along\n\n[Bridge: Tony Williams + Kanye West]\nFeeling better than I ever felt before today (If you feelin good)\nBut better late than never; it's orientation (It's orientation)\nStill we can make it better throwing all your cares away\nWe want you to get used to this\nUhh, they can't do what we do baby\nUh-uh, uh-uh, they can't do what we do baby\nUh-uh, uh-uh, they can't do what we do baby\nYeah", "image": "https://images.genius.com/20be4a5ccc57daf3577b7e0d12f092f8.1000x1000x1.jpg"}], "artist": "Kanye West"}