{"songs": [{"title": "Eminem Freestyles on Tim Westwood | 2010", "album": null, "year": "2010-06-30", "lyrics": "[Verse 1: Mr. Porter]\nWelcome to the ill world of Mr. P-O\nAyy, keep the talk, B, I'm tryna see dough\nIf it ain't about bread, what we gon' speak fo'?\nIf it ain't no lead, then it ain't no beef, bro\nYou better get a leash ‘cause yo' freak ho\nSpecialize in wood like she Home Depot\nI'm like Chico DeBarge, we stars\nRoscoe P. Coltrane in these bars\nMan, Amtrak, I'll break her damn back\nMan, it's Ralph Lauren, this ain't no damn Chaps\nIt's all Polo, I'm so pro though\nYou bird-crazy; El Pollo Loco\nTalkin' about cheese and this ain't no photo\nAskin' about rings like the ho know Frodo\nYou better get out of my house and shit\nI think I threw up in my mouth a bit: I'm sick\n\n[Verse 2: Royce da 5'9\"]\nNiggas be lyin', talkin' about they bust a heater\nOnce I see him, maybe more like Justin Bieber\nLeavin' my rivals underground, like Skyzoo's, how I do\nI have him layin' in the street and bleedin', butt-naked\nWith a bullet in his mothafuckin' head like Erykah Badu\nI find irony in bein' in a place\nWhere I'm wearin' Gucci, mane, gettin' whiteboy wasted\nI tell a nigga: break bread or take lead\nI'm tryin' to get rid of this weight, like K-Fed\nMe and Denaun got a gangsta bond\nWe like that once-in-a-lifetime thing to you\nThat ain't the prom\nThe next MC that rhyme official, with ref, with a whistle\nThat ain't Young Money, I'ma definitely diss you\nIf you rhymin' \"packin' a MAC\" with \"back of the Acura\"\nOr perhaps you can't match my spectacular vernacular\nYou still rhymin' bottles with models, college with knowledge\nUsin' the word swagger, you're probably garbage\nYou thugs funny, comparin' 5'9\" to anybody\nYou comparin' Superman to Bugs Bunny\n\n[Verse 3: Eminem]\nI'm like a white Michael – Vick, psycho enough to stick\nMichael J. Fox in a microwave with a Rott\nI might make a little Alizé with a side of NyQuil\nAnd ride a motorcycle bike\nRight through the side of my high school\nSatan's disciple with a sniper rifle\nAnd a knife and a white diaper\nLiable to shit on you while I snipe you\nSo dope he gets off opiates\nWhat an appropriate way to start off his day!\nHe may just smart off to Dre\nHe may be hard to contain\n‘Cause his rage is so hard to gauge\nSee, Hannibal ate his face, and met Jason, gnawed off his leg\nAmazin' hard-on for razors and blades\nAnd anything sharp, even poisonous darts\nIt all plays a major part of his game\nHoly water won't ward him off, crucifixes won't do the trick\nHe's so sick, it's ridiculous\nSawed the crazy part off his brain, he's still insane\nWhy's there bloodstains on his carpet, mane?\nThere's some crazy shit goin' on in Shady's apartment again\n\n[Verse 4: Mr. Porter]\nOkay, it's back to the blocks, slingin' yay like the old days\nSuperman on the beat, I carry my whole state\nYou wooden legs to a house: you can't hold weight\nOh shit, it's O'Shea Jackson… okay\nA little bit of this twisted out with Obama in it\nMr. Porter back with anthrax, like Osama sent him\nBitch, I'm all that, I drive the girls crazy\nThey gotta look at Rorschachs to get they thoughts back\nI ain't a small fry, small ticker, small tack\nI make 'em all cry with big dick and raw sack\nThe potblood of science to return a raw rap\nI'm the best, mane; Eli Porter stance\n\n[Verse 5: Royce da 5'9\"]\nY'all bitches should call Nickle the Don Bishop\nA poet, a mixture of Don Goines and John Grisham\nFlow'll have you rewindin' it four or five times\nThat landmine rhyme written with porcupine line\nStep up in here with the Slaughterhouse\nC.O.B. Gang will approach you\nAnd bend your gun barrel to a horseshoe\nOnly fuck with monsters, we the truth\nMonsters will pop up on you\nLike you said \"Beetlejuice, Beetlejuice, Beetlejuice.\"\nI can't even see the booth, I could fit in Stevie's shoe\nI'm sick, I got the Desert Eagle flu\nI'm rich, lil' nigga, we don't need a cent, we Teflon\nThe doctor tried to take blood, the needle bent; ask Mom\nOutta my mind if you can imagine\nUsin' Magic's johnson without a condom, I'm bonkers\nGot the streets goin', dude, it's tremendous\nIf I come for your blood, I ain't gon' be usin' syringes\n\n[Verse 6: Eminem]\nNewsflash, I'm still trash\nThem pills shoulda killed my ass\nBut they didn't; they just made me stronger\nIt's like they rebuilt my ass\nLike the Six Million Dollar Man after the crash\nIt's Aftermath, bitch! And my milk glass is still half-empty\nYeah, tempt me, Hell isn't enough\nThey need to invent somewhere new to send me\nAs sick as I'm getting\nThey'll stick me in a conventional oven\nWith a rotisserie setting and won't even notice me sweating\nShit, I done made a verse, said some foul shit\nTryna go back fix it, fucked around, and just made it worse\nYeah, I'm back, looking no worse for wear\nGot these haters mad enough to rip off their hair\nAnd start punchin' the air\nPanties so in a bunch that they can't function\nIt's Shady and Royce, fuck yeah! What a dysfunctional pair!\nSo stop actin' like a punk, get a pair!\nTake a pill and fall the fuck out, spill your lunch in the chair!\n\n[Verse 7: Mr. Porter]\nLook, I'm sick, somebody better get the Dimetapp\nWho I gotta shoot just to prove that I can rap?\nPeople ask where my shine is at\nI say check the liner notes, I done done all kinda crap\nI am so much of a star, bitch\nThat I can fart and piss on the red carpet\nLook, my bank account's retarded\nMy debit card's got a helmet and a harness\nHey, meet demands, but they all are harmless\nAt shows my riders always the largest\nI need four pounds of fried poultry carcass\nAnd red M&Ms chartered from Charlotte\nLook, and if you try to act dumb and start shit\nI just yell at 'em, like, \"I'm the artist!\"\nInfected — you know the deal\nIf you wanna play sick, we can all get ill\nLook, measles, mumps\nI made you bitches, I don't need you chumps\nY'all got cheese and I need my chunks\nHurry up, so I can go to burn rubber\nAnd get some more dunks\n\n[Verse 8: Royce da 5'9\"]\nNow, if your attitude determines your latitude\nThis house that we call hip-hop, I'm in the attic, fool\nA mic and two turntables, fit for the unstable\nConverted to a padded room\nKeep a street sweeper; in fact, I call the mag a broom\nYou seein' beef, seein' things\nYou musta had yourself a bag of shrooms\nI make a call, make 'em fake a fall\nMy clique is too sick, say goodbye\nIn the streets where the stakes is high, like Ruth's Chris\nI'm from the city of true shit\nWhere the mayor went to jail\nFor bein' a player right after Proof split\nLevels the head of competitors, Royce that\nI'm drinkin' everyday\n'Til Hex Murda get his regular voice back\nRas, I got ya, look scared at ya, blast from ya\nFrom a block away; ask Tricky, I'm that niggie\nI'm more hooder than black Dickies\nI rap like committin' suicide\nIn the booth, takin' the track with me\nPatrón's in my chromosomes\nIn order to leave it alone, you have to ween me off\nThat Lorena Bobbitt chopper will knock a weenie off\nPut your body between chalk\nI'm squeezin' the 9 iron, like I'm swingin' golf\nI'm with the best rapper alive, put somethin' on it\nYour sound's plain as a cheeseburger with nothin' on it\n\n[Verse 9: Eminem]\nI'll do a hundred-yard dash just to slash Kim Kardash'\nIn the ass with a shard of glass from Nick Hogan's car crash\nYou may look like the passenger for that, don't be a smartass\nYeah, laugh while you sit there\nThinkin' that the hard part passed\nYou ain't seen pain 'til Leatherface flips mane\nI'll cut your fuckin' balls off, homie, my saw's off the chain\nI chopped the bitch in half with it, sawed off her legs\nAnd the top half of the torso fuckin' crawled off insane\nI ain't seen shit like that since I went to Mike Jack's\nTook the Elephant Man's skull, fucked it, and put it right back\nHanded my dick to Bubbles\nWhile he sucked it and licked my nut sack\nGave him a reach-around\nWhile I fucked him right in his butt crack\nNah, I ain't takin' it back, faggot, fuck that!\nI give a fuck about nothin', so here's where you fucked up at\nDon't go touchin' that can\nMan, you don't wanna open up that\nWait a min, ah, shit… Alchemist, cut that!", "image": "https://images.genius.com/cab039f47fc34d93e3efed1b33887344.1000x559x1.jpg"}], "artist": "Eminem"}