{"songs": [{"title": "Buck 50", "album": null, "year": null, "lyrics": "[Method Man]\nSupreme Clientele\n\nWho on this? The Fenon, them niggas can't live\nWho on this? We ain't got shit, Summin Gotz ta Give\nY'll done flipped y'all wig, blacked out the kid\nDie and live for my nigs and my bad ass kids\nFreeze [sniff], lookin at your ice like please\nPlottin on the mouse trap, about to snatch the cheese\nI heard y'all kids is 'bout that, psycho therapy\nFuckin, where the cow chat? Blue till they bury me\nNever tell a lie, like George with the cherry tree\nNow it's cherry pie, if it's not broke, let it be\nAin't nuttin nice in, New York, stick ya for ya cake and ya icin\nAll that tough talk don't mean nuttin when ya up north\nSo keep them hands where I can see them like ya want freedom\nYou know that sayin, if ya can't join 'em\nBeat 'em and push ya way in\nWe ain't acrobats but we flip on occasion\nPick the Pace up, past snaggin, throw your waist up\nNiggas writin slum juice with Jacob, fool\nYou're like dude, I don't like your fuckin attitude\nFrontin on my Clan from Shao', we ain't mad at you\n\n[Ghostface Killah]\nYo, Starks dippin cheesy face, meesly pace\nGhostface, jump out the window for a little taste\nDroopy luck, my main bitches call me lazy\nEducated birds say, \"Ghost, you're so crazy\"\n\n[Cappadonna]\nCappa slide thru with the Ghost\nPost up like paint on walls\nDrip jew-els, big heat ruffle inside the bubble-goose\nIt's the odd couple, holo-points follow you home in Staten Island\nPlayin with the big toys that make noise\nEcho in the hall, a scared voice\nNiggas start to act choice, but Dunkin 'hinds\nDidn't know Betty Crocker had them two nines\nMade the club moist, shattered the windows\nDust heads runnin, the black kingpin buzz the Black Jesus\n\n[Redman]\nYo, the words you talk better be the words you walk\nBody you in the van while the nurse is off\nPut your vein out, watch me insert the dart\nTill it bleeds from Bricks to the Persian Gulf\nLight curcuits off, thirty-third if my brain is off\nThat explains why my language off\nMy gun aim and cough, y'all ain't trained to brawl\nY'all more like them training bras\nWet behind the ear, you're not prepared\nFor the project flow, with extra stares\nI pass out a vest to wear (bullets'll fly)\nYo, a hard wire, startin bonfires\nPullin mask, so you know it's me\nYour weave got more seeds than odb\nCan't smoke wit'cha, watch Ghost tie rope to ya\nDef and Wu will open ya\n\n[Method Man]\nYour shit lice\nBaby shake your shit 'fore your shit lice\nGet rich like...\n\n[Ghostface Killah]\nWord, it's me y'all\n\nWe in two sixes, flirtin with bitches\nDime plush, takin pictures\n\"How you doin baby, my name's Ghost\nDon't get caught up in my chains or the way that I speak\"\nSeek intelligence, slickest nigga doin it since Grease\nCheck out the greys on the side of my waves, my crew doze on Riker's Island\nStretched out, malled up in the cage\nPull a? Out on Jimmy Jam, shakes Space Jam\nSilky texture, Jordan jumped up like Clyde Drexler\nAll up in the parrot, nose numb, real as they come\nBiggie's Versacis, Snow White rabbit\nHands is like photographic magic\nFuneral love, boohoo when we hug, don't make it a habit\nHit the gym in two weeks, my back all chisseled\nElbows unique now, meet the new me\nGhetto fabulous, Tony Atlas\nZulu Nation in the 80's, in front of Masey's I start my own Chapters\nTyco, Nike glow, velvet pose\nSpecial effects, high-tech armors, murk you after shows\nSupercalifragilisticexbealidosious\nGhost'll hollar exbefragilisticcalisuper\nCancoon, catch me in the room eatin group up\n\n[Method Man]\nShoe fly shoe, Wally dark Clark crew\nFuck y'all wan' do? Crack a brew, smoke an L or two\nAnd flip like, yellin for the whole click, it's sick like\nThe way yo' stank bitch eat a dick like\nBaby shake yo' shit, hold yo' dick like\nGettin rich like..", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}