{"songs": [{"title": "Til’ Infinity", "album": "The Warm Up", "year": "2009-06-15", "lyrics": "[Intro]\nUh, yea\nLet me warm up man, let me warm up man!\nI got to warm up man!\nYea, Elite what up! Yea Warm Up\nYea\n\n[Verse]\nLook niggas wanna know the formula for success\nSheeitt, but I studied for this test\nAy nigga I'm better than the rest you just rest boy please\nMe I'm trynna stretch my treasurer chest, like some double D breast\nSo a nigga on a quest- no question\nSo I tell em birds no nesting\nLaying in my bed hope to lay a niggas egg, No- you'll never hatch mines\nBaby, you don't match mines\nI'm trynna shine like the bat sign, when it's crime\nAnd the gats flyin up in Gotham, watch em\nFar from a thug but I'll drop one\nFar from a scrub but I'll mop em\nWatch 'em better leave 'em alone (Malone) like Stockton, when he retired\nShit your shit is fire boy stop\nI don't buy it, boycott, stop lying\nYa shit is not hot man if niggas not buying\nIt's not rocket science\nBut the way I rock it help me build up my alliance\nThese niggas ain't playing in New York like the Giants-ha!\nA little line to show love to the city that got no love\nDon't want to see a nigga grow rather see a nigga hold-up\nThat's cold blooded, well never to fail\nIf you can make it here you can make if from heaven to hell\nI'm just a little nigga strait out the Ville\nAlways been sick probably never get well\nAnd no time soon, step to a nigga get 4 times 2\nBet the way I spit it leave your mind blew, with more rhymes due\nNigga you tryning who?\nSheeit, nigga you tryning me, bitch I'm better than all them niggas you trynna be\nShit, nigga you trying me? Bitch I'm better than all them niggas you trynna be\nLook, it's no time to chill I'm trynna get Mills\nThere's no time to chill I'm trynna build\nBitch there's no time to chill I'm trynna get Mills\nThere's not time to chill I'm trynna build\nIt's no time to chill I'm trynna get Mills\nThere's not time to chill I'm trynna build\nBitch it's no time to chill nigga! Yep", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg"}], "artist": "J. Cole"}