{"songs": [{"title": "Don’t Change", "album": "The Timeless Audemars Piguet Collection", "year": null, "lyrics": "[Verse 1:]\nYellow Wallabies in the Summer time remember me?\n38 special wife beater ain't no killing me\nRunnin with my dogs fucking with the hoes\nWe be acting like stars at them other niggas shows\nLuke Skywalker was my muthafuckin idol\nBack in middle school I'd watch the videos and get excited\nThen I started writing, but really I was biting\nAll that Big Daddy Kane I had the flat top like him\nFab 5 Freddy with Martin Luther King\nHe was quick to holler \"Peace\", boy did I have a dream\nNow I'm staring at the TV wishing I was Whodini\nHad me dancing like Hammer in the mirror with a peedi\nYou could see me, Ice Cube bumping as I'm rolling\nWe all said, \"Fuck you bitch!\" and kept going\nTo the pack jam that was our spot walking in\nWith a nickel bag in my hi-tops\n\n[Hook:]\nSome things change most stay the same\nWhile I'm chilling in the hood I keep hearing niggas saying\n(\"Don't Change\")\nWent and got a million, now my niggas tripping\nWhen you push a Lamborghini you just get a certain feeling\n(\"Don't Change\")\n\n\n[Verse 2:]\nBack in the hood, grinding on the block\nWhere we all had plans of climbing to the top\nKane got shot, Black got life\nI ain't really wanna write but they pushed me to the mic\nSo I put it on the pad, blowing in the pad\nReal D Boy I had blow up in the pad\nTapes of Scarface, the world is yours\nPlates and raw cake guns galore\nGo and sell a few is what a nigga better do\nEverything Federal when you're dealing with revenue\nHoping the casino is trying to clean some\nGot 50 in the trunk\nWho the fuck you mean mugging nigga?\nDo my dirty work give my brother a clean hammer\nIf mother nature nice it will be a mean summer\nSyrup on the dump, chrome on the wheels\nGot work in the trunk, the zone and some heels\nHO!\n\n[Hook]", "image": "https://images.genius.com/98acc041b4386f147a4d2bbacb78bd1d.540x540x1.jpg"}], "artist": "Rick Ross"}