{"songs": [{"title": "Looking for a Dollar", "album": "Chase the Cat", "year": null, "lyrics": "[Hook 2X: Jazze Pha]\nWe, roll dubs\nBall, in clubs\nDimes, no scrubs\nIf you're lookin for a baller, baller\n\n[Break: Jazze Phe]\nFrom the yay, from the yay\nPoppin my collar\nIf you're lookin for a baller, baller\nFrom the yay, from the yay\nPoppin my collar\nIf you're lookin for a baller, baller\n\n[Too $hort]\nWhassup baby?  Still dreaming?\nFor a rich man, you still fiending?\nWell I hope you got skills if you know what I mean\nEverything from oral sex, to cooking and cleaning\nRich niggas want it all, just like you\nAnd when I ball don't ask me what I do\nYou want to be kept, keep your mouth shut\nBut you'se a gold digger and you go out too much\nIf I choose you, it'll be the wrong choice\nI'm saying, \"fuck you\", loud, with a strong voice\nOne rainy day and you're ass is out\nNo money to spend, you start passing out\nSo dramatic, even though it ain't your cash\nBitches like you I wanna thank your ass\nFor being shallow, I know you a bad ho\nI wouldn't let your punk-ass stand next to my shadow\n\n[Hook]\n\n[Too $hort]\nI like a Cinderella story, but most of the time\nThese nothing-ass gold digging hoes are fine\nA nigga fronting, you wanna have sex with a star?\nHe drive a Benz, but it's the next nigga car\nThe only thing he own is that outfit\nBut he still stuck his dick in your mouth, bitch\nAnd after all that getting fucked on the floor\nHe called a taxi to take you home in the morning\nDumb bitch, you just got fucked by a flunkie\nSee you at the club and you acting like you want ME\nDon't make me laugh\nWe get married, and you take half\nI don't think so, see you at the bank, ho\nYou want to walk down the aisle but I can't go\nI got her number, but I never call her\nYou better look around and find another baller, beotch!\n\n[Hook]\n\n[Too $hort]\nI don't want your key, you ain't getting mine\nAsk to use my car, you committing a crime\nLeave your panties or your bra, I throw them away\nCan't find the door?  I show you the way\nHope you come back, but you just can't stay\nWe can get together on another day\nI come get you, when I miss you\nCause if I see you every day I'd probably dis you\nWhat you gonna do when you get you a baller?\nRich man, what she gotta do to get you to call her?\nBetter talk about, might like what you hear\nSay it right in her ear, every night of the year\nYou can be together, beotch!\nYou better get a job if you wanna be rich\nGo to school or something, get a degree\nI know you wanna baller but it can't be me\n\n[Break]\n\n[Pimpin' Ken outro bleeds over to skit on next track]", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}