{"songs": [{"title": "Get Back Up", "album": "No Mercy", "year": "2010-10-29", "lyrics": "[Intro: T.I. & Chris Brown]\nI'm only, I'm only human dog, hello, out there\nI'm only human dog, can you, hear me?\nI'm only human dog, it's an S.O.S\nAyy, ayy listen to me, to let me, be me\n\n[Chorus: T.I. & Chris Brown]\nAyy, when they push you down you got to get back up, I'm only human y'all\nAyy, when they push you down you got to get back up, I'm just a human y'all\nPush the dirt, off your jersey then go for the cup (ayy, ayy, ayy)\nOr the trophy, or the ring, champion no matter what\n'Cause when you got the belt, and the ring\nPeople with you popping bottles, taking pictures, look around (yeah, yeah, yeah)\nBut soon as you fall down all the haters passing judgment, oh no no\nFly as I'm is shawty, I'ma rise above this, oh no no no no\n\n[Verse 1: T.I.]\nHey, what it is world? (Ayy) Yeah, it's me again (again)\nBack before you, at your mercy, on bended knee again\nNo running from the truth (nah), as much as we pretend\nThat it ain't what it is, then it hits CNN\nApologies to my fans and my closest friends (I'm sorry)\nFor letting you down, I won't take you down this road again (uh-uh)\nMost of you now saying, \"Whatever, here we go again\" (what?)\nBlogs, radio and television all going in (ayy, ayy, ayy)\nI laugh to keep from crying through all of the embarrassment (I gotta say)\nI gotta say you fucking haters is hilarious (ha ha)\nHow dare you sit right there and act as if you holier than thou?\nPoint your finger now (now) with me looking down (down)\nSame clown that was Twitpicing at my wedding (ayy, what?)\nOn the same Twitter page disrespecting, wait a second (hold up)\nNever mind my imperfections, this a fact, remember that\nNo mistake's too great to recover and bounce back\n\n[Chorus: T.I. & Chris Brown]\nAyy, when they push you down you got to get back up, I'm only human y'all\nAyy, when they push you down you got to get back up, I'm just a human y'all (you gotta get back up)\nPush the dirt, off your jersey then go for the cup (oh, na na)\nOr the trophy, or the ring, champion no matter what (oh, na na na na na na)\n'Cause when you got the belt, and the ring\nPeople with you popping bottles, taking pictures, look around (yeah, yeah, yeah)\nBut soon as you fall down all the haters passing judgment, oh no no\nFly as I'm is shawty, I'ma rise above this, oh no no no no\n\n[Verse 2: T.I.]\nI admit, yeah I done some dumb shit, disappointed erry'body I know (damn)\nTry not to hold that against me though (ayy)\nMy road to redemption has no GPS\nSo guess that time must be invested for this to be manifested (yeah, yeah, yeah)\nYes it's, hard living life in the spotlight\nTrying to dodge the haters same time as the cop light (woo)\nThe Bible say, \"Let he without sin cast the stone first\" (stone first)\nThe sinner or the one who judged him, who was wrong first? (Huh)\nYeah, he go to work, never done no drugs up until the Fed\nHe just drink his liquor, touch his kids, beat his wife instead (damn)\nDifference is my shortcomings hit the media\nThanks to TMZ, the AJC and Wikipedia (what?)\nSee the stairway to heaven while stepping down Jacob's ladder\nMy good outweigh the bad, God ain't that what really matter? (Nope)\nAnd matter fact, I'm wrong but after that\nThe good I done in yo' hood, should it over-shadow that?\nGot the world laughing at me for the moment\nBut it gonna be your turn 'fore it's over with, even if you're so legit\nThat you get a house with a dog and a picket fence (ayy, ayy, ayy)\nThe people with you then but when they turn on you remember this (ayy, ayy)\n\n[Chorus: T.I. & Chris Brown]\nAyy, when they push you down you got to get back up, I'm only human y'all\nAyy, when they push you down you got to get back up, I'm just a human y'all\nPush the dirt, off your jersey then go for the cup (ayy, ayy, ayy)\nOr the trophy, or the ring, champion no matter what\n'Cause when you got the belt, and the ring\nPeople with you popping bottles, taking pictures, look around (yeah, yeah, yeah)\nBut soon as you fall down all the haters passing judgment, oh no no\nFly as I'm is shawty, I'ma rise above this, oh no no no no\n\n[Bridge: Chris Brown & T.I.]\nSo I say...\nHello, out there (I'm only human dawg)\nCan you hear me? Can you hear me?\n(I'm only human dawg)\nIt's an S.O.S (oh, oh, oh, oh)\nTo let me, be me (yeah, ayy)\nHello, out there (You gotta get)\nAyy, you can love me, or either leave me\nCan you hear me? (You gotta get)\nBefore you judge me, just let me be me\nIt's an S.O.S, to let me be me\n(You gotta, gotta believe in me)\nAyy, you can love me, or either leave me\nBefore you judge me, see life ain't easy (Hey!)\nHello, out there\nYeah, you gon' miss me when I'm gone\nCan you, hear me?\nI know when I'm gone, I bet you gon' miss me when I'm gone\nIt's an S.O.S\nYou gon' miss me when I'm gone\nTo let me, be me\nI know when I'm gone, I bet you gon' miss me when I'm gone\nYou gon' miss me when I'm gone\nI accept full responsibility for all the wrong I've done\nIf y'all thought I was perfect\nI apologize for being human man\nBut never again partner, you could put my life on that\n\n[Chorus: T.I. & Chris Brown]\nAyy, when they push you down you got to get back up, I'm only human y'all\nAyy, when they push you down you got to get back up, I'm just a human y'all\nPush the dirt, off your jersey then go for the cup (yeah, yeah, yeah)\nOr the trophy, or the ring, champion no matter what (okay)\n'Cause when you got the belt, and the ring (yeah)\nPeople with you popping bottles, taking pictures, look around (look around)\nBut soon as you fall down all the haters passing judgment, oh no no\nFly as I'm is shawty, I'ma rise above this, oh no no no no\n\n[Outro: Chris Brown & T.I.]\nHello, out there, ay you can love me, or either leave me\nCan you, hear me? Before you judge me, just let me be me\nIt's an S.O.S, ay you can love me, or either leave me\nTo let me, be me, before you judge me, see life ain't easy", "image": "https://images.rapgenius.com/13c3a9e0d054c7b3e43a946fd48f4b32.1000x1000x1.jpg"}], "artist": "T.I."}