{"songs": [{"title": "International Q", "album": "Gangsta & Soul", "year": "2009-05-14", "lyrics": "[Intro]\nYeah, you know it's Mr. International Q, man\nScHoolboy on front of that, yeah, Top Dawg\nUh, uh, uh-huh, uh-huh, yeah, you know I go there, man\nQ, G.E.D., yo, uh, look, uh, uh, uh\n\n[Verse 1]\nWell, you know I like to drop, drop\nKeep them lyrics comin' cause I'm harder than the gravel\nThe proper vision, steady countin', splittin' division\nUh-huh, best rapper alive out the squad, make decision\nI hope you're listenin', where y'all ball? Play my position\nUh, always cookin' somethin' like I'm a kitchen\nAnd I ain't bitchin', we just flyin' takin' trips to a land\nAnd I think it's called France, here we go, here I am\nBonjour, well, I guess I'm on tour\nShit, I don't what to say, can I order soufflé?\nHa ha, out the next day, Paris to Tokyo like Lupe\nAs soon as we land, the zoo shake\nNow to Hong Kong, need a cookie with a fortune\nThe way it's (?), I don't think they do abortions\nWalkin' through the mall, every store look like it's (?)\nNo gang violence, no funerals or coffins and it's cool\nPerformin' in Germany for a school\nGangbangin' for real when niggas show me the two\nChillin' in rider, we smokin', the (?) bought it\nTalkin' 'bout Afghan, I ain't fuckin' with Laden\nNigga, please, did a show in Vietnamese\nOnce an Australian endin' up in Belize\nEverywhere else who went shit, they wouldn't accept felons\nGot on a cruise, same while we all sellin'\n\n[Hook]\nGo on, yo, uh, uh, yeah, where we at?\nUh, uh, where we at?\nYeah, Q, you know, I can switch it up too, man\n\n[Verse 2]\nNow we at the dock and I'm fresh off some ass\nWaitin' on the Rock who try out from gym class\nChillin' in the suite, then we write to a beat\nThen we dap because the deal be hittin' the streets\nMiami Beach we we headed, 305, with Trick\nThen we stop at Wayne's, curly fries and chips\nBack to the top of the West, yep, in the middle\nState of Illinois, goin' hard like armadillo\nPost up, big chillin' when I'm out in Texas\nNever seen so many fresh cars drivin' reckless\nSeen a little nigga rockin' Hoover on his necklace\nCrips and Bloods too, ah, shit, I better exit\nUp to the North, I'm chillin' out in Seattle\nYeah, man, a lot of emcees here want to battle\nDamn, shit is not important, a couple hours to Portland\nNow back home, I'm happy to be alone\n51st block, I'm posted up where it's hot\nDamn, I almost forgot about the cop\nFuck, damn, the cops done raided all of the spots\nMy niggas got knocked, distribute all the Glocks\nBack to the crib, I'm bakin' my girls bread\nHappy to be alive, gettin' it how I live\nOn the microphone, now you know I'm the man\nPiss in a cup for my P.O. and do it again\n\n[Outro]\nYeah, yeah, ha ha, uh, what? What? Yeah, G.E.D\nEvery dollar, Q, ScHoolboy in front of that\nTop Dawg E-N-T, uh, uh", "image": "https://images.genius.com/73430f875ce330bebb52280d5c91ac36.500x500x1.jpg"}], "artist": "ScHoolboy Q"}