{"songs": [{"title": "Lick a Shot", "album": "Malpractice", "year": "2001-05-22", "lyrics": "Smokin! (Okay!)\n{*monkey sounds: oooh oooh ahh ahh ahh*}\nHere we go.. smokin! (Okay!)\n{*more muted monkey sounds*}\n\n[Redman]\nYo, yo.. jungle habitat, peep the wildlife in the open\nOff the hook, nigga dial twice if it's broken\nDoc, wall to wall with a mic and I'm loc'n, shit\nYou might find termites in the chokin(?), yes\nD.O., my wood grain say, \"Fuck P.O.\" (Okay!)\nAnd I'll prove it when I redline a buck-three-oh\nHoes wit it, but never gave a fuck befo'\nI'm frontin a hundred on top, and ones below\nBitches - fuck you star hoes, my hoes run out\nDepartment stores with alarms and bar codes on\nThink you catchin me and my bitch? You dead wrong\nI'm over here prepared, blowin a air horn\n{*BLAAM!*} You niggas talk widdit\nI do it blind blindfolded without walkin with sticks\nAs dark as it gets, you slept in the Bricks\nNow you lose - like e'ry year, you betin the Knicks\nWe walk, dogs with more balls than pool rooms (Okay!)\nAttitude wolf, I react to full moons (aoooooo)\nI, shoot up the place so y'all can see\nYou stuck up like them white boys on Harley's be\n\n[Hook: Redman]\nAre you ready to get, high with Doc (Okay!)\nIf you high nigga then lick a shot (That's right!)\nAll my niggas out in Brooklyn keep your heaters cookin\nKeep the mamis lookin (Yeah yeah!)\nAre you ready to get, high with Doc (Okay!)\nIf you high nigga then lick a shot (That's right!)\nAll my niggas out in Jersey keep smokin the hershey\nKeepin your money thirsty (Yeah yeah!)\n\n[Redman]\nYo, yo dawg, I'm an MC, I don't think how you rap stars'll think\nI rush you, like you made the last call for drinks\nMy pipes burst and I ain't installed the sink\nA radiator, I keep it in the car to mink\nChk-chk, yo trail the Bricks where I wrestle grizzly bears (Okay!)\nAnd stick a track for it's snare and kick\nWhen it's committed, damned if you see 'em again\nCold-hearted, leaves fall off the tree on my Timbs\nHelp me; I keep the flow cold like your wrists\nThe words practically geronimo off the disk\nWhen Flex bomb it look, everybody runnin\nYou bitches goin wild, even Kitey wanna tongue 'em\nI'm like the Gooch, lookin for Arnold Drummond\nWalkin with a trenchcoat to part the pumpin\nLike MJ, I wanna be startin somethin\nWhoever ain't widdit, gotta move widdit\nOne-fo'-fo' hydro smoke to choke on (Okay!)\nBranson holdin handguns to toke on\nUptown with Big L watchin over\nHe tell me there's NARC's parked on the shoulder\n(Look over there) I don't care, cause I'm drunk as hell\nShit I do eighty on a speed bump to bail\nDoc Deebo, keep both cannons on reload\nWeed keep my fingertips yellow like Cheetos\n\n[Hook]\nAre you ready to get, high with Doc (Okay!)\nIf you high nigga then lick a shot (That's right!)\nTo my niggas in Atlanta that, carry the hammer\nWrap 'em with bandanas (Yeah yeah!)\nAre you ready to get, high with Doc (Okay!)\nIf you high nigga then lick a shot (That's right!)\nTo my niggas in the Chi, that smoke on the lai\nProceed to gun-fire (Yeah yeah!)\n\n[Redman]\nYo, to my bitches, my niggas jump up\nIt's Elmer Fudd with the shotty pump, who want duck?\nRide in my hooptie, back, slumped up\nFive niggas with me, strap, pumped up\nDump Forrest Gump, hand on the pump\nJanitor, gettin drunk off a janitor drum\nWay I spit, on my tongue, I branded the gun\nTarzan, I rap loud, animals come..\n.. I'm on top of a giraffe neck\nThrowin spears, I'm Def Squad in both ears\nY'all niggas ready for streets? Here it is\nCircle status, with no pyramids\n\n[Hook]\nAre you ready to get, high with Doc (Okay!)\nIf you high nigga then lick a shot (That's right!)\nTo my niggas in the West that walk without a vest\nThat just brrrrrap (Yeah yeah!)\nAre you ready to get, high with Doc (Okay!)\nIf you high nigga then lick a shot (That's right!)\nTo my bitches in the Bricks that get they money quick\nThat get they pussy licked (Yeah yeah!)\n\nAre you ready to get, high with Doc (Okay!)\nIf you high nigga then lick a shot! {*BLAM*}", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}