{"songs": [{"title": "Get ’Em", "album": "Dedication 2", "year": "2006-05-22", "lyrics": "[Intro: Lil Wayne & DJ Drama]\nYou are watching a master at work\nYeah!\nHaha! Drama, I'm back\nYeah! This what y'all was waiting on?\nDedication 2, bow\nI put a couple pounds on since the last go-around\nI ain't gonna even wait on 'em, I'ma get 'em now\nWe been eating around these parts!\nGet 'em!\n\n[Verse 1: Lil Wayne]\nMy block pumping, and I'm trying to keep that ho pumping\nIf niggas snitching, then I let them niggas hold something\nIf nigga owe something, need a doctor's note from him\nOr his throat from him; these lil niggas? (Pay attention!)\nThinking they fresh–get whipped out ya clothes, young'n\nI got it all, but I'll beat you like you stole somethin' (Oh!)\nMy bitch trippin', say I treat her like my old woman\nI tell the bitch I'm probably better off with no woman\nYeah, I get that brand new money\nI'm the boss, bitch, I'm touching every dollar that's coming\nStop playing, I know what I'm doing, let me get 'em\nI hope his kids not with him\nY'all motherfuckers know me, I'm a rider in the side of the south\nGot the money in the mattress and the guns in the couch\nWhat up? Putting out cockroaches in the ashtray\nIt's payday 'til my last day\nYeah, walking that line, with a lot on my mind\nI get that money, never dropping a dime\nI don't hate, never, not on my time\nI'll put that little red dot on ya mind\nTalking that crime, but a lot of 'em lying\nI'm caught on the grind, never get off my grind\nI'm a pimp to these hoes, not a pimp in my mind\nNah, and everybody know I'm sharp when I ride\nHop out that new Ferrari with that little horse on the side\nYeah, zoom-zoom, bitch, ride a nigga broom, witch\nHalf a ki, wet, stinking up your whole room, bitch\nNow break out the perfume, bitch\nAnd niggas come from off that beach\nI'm in that water like a cruise ship\nStraight up, tell ‘em I do’s this\nOne pistol, two clips, I aim at lips\nWayne that shit, shit on y'all\nGiven to you from the God, I am the God\n\n[Bridge: DJ Drama & Lil Wayne]\nA Dedication!\nYeah\nMy nigga Philant, rest in peace!\nYeah, yeah, Weezy Baby, the God\nThat's right, heh\nFee, I had to!\nGangsta Gri-zillz!\n\n[Verse 2: Lil Wayne]\nYeah, money on my mind, money-money on my mental\nSuper-super soaker, wet a nigga like a swim suit\nI think they sipping on that \"I Can Fuck With Him\" juice\nTest me if ya wanna bet, man, I'll knock a limb loose\nI ain't never scared, I'm protected everywhere\nAnd if a nigga disrespect me, then he shall be buried there\nThat's my word, got a urge to hit a nigga and swerve\nAnd them birds in the tree get shot down to my feet\nIt's me, motherfucker, what's better to see?\nAnd when ya greedy like me, ain't nothing better than beef\nSee, I would meet each one of you niggas in the street\nThen eat, and pick you little bitches out my teeth\nShout out to the green and red stitches in my tee, nigga\nWith no Gucci, I'm a double-G, nigga\nMy brothers, you have sinned\nAnd the God, I am, Amen", "image": "https://images.genius.com/d3b5f479408c61bed346754e1bb3f8ad.1000x1000x1.png"}], "artist": "Lil Wayne"}