{"songs": [{"title": "I Am There", "album": "Life", "year": null, "lyrics": "{*knocking*}\n\n[KRS-One]\nCome in {*door opens*} sit down\nYeah...\nI have a magical mind, a magical body\nAncient metaphysician, you better AX somebody\nWith one handshake, I can tell if your plan's fake\nI am to hip-hop, what flour is to pancakes\nI write rhymes 'til my hand aches\nIn the mountains of Colorado, takin in the landscape\nWhen I'm in the city I can't wait to live again\nIn the underground hot springs of the Hopi Indians\n\nSo you look around your heart and your mind\nYou will find, I am there\nIf you're cold and you're broke and there's fog in your scope\nHave hope, I am there\nGet in tune with me, move with me, boom with me, room with me\nZoom with me, I am there\nI can see where you're at, feelin trapped, can't move can't act\nI was there\n\nAnd it's quite clear\nMy hardware was set ahead of most folks by ten years\nThe hand of God set it, so on Earth I speak prophetic\nPublishin papers with no edit\nI speak but most don't get it, but the few that do get it\nIn their minds my words stay embedded\nAnd they blessed if they don't forget it\nThey'll never need a psychiatrist, a psychic or a medic\nWhere we headed? To the ultimate state of freedom\nThat's where I'll lead 'em, if you let it I'll free 'em\nLet's set it, for human beings in recreation\nHavin fun recreatin themselves into a nation\nHip-Hop! It's home could never be a station\nSharin a space with R&B, stop fakin\nDo you know how much money they makin offa you and I\nJust because hip-hop won't unify?\n\nSo look inside your heart or your mind you will find\nEverytime, I am there\nIf you're cold and you're broke and there's fog in your scope\nHave hope! I am there\nGet in tune with me, move with me, boom with me, room with me\nZoom with me, I am there\nI can see where you're at, feelin trapped, can't move can't act\nI was there", "image": "https://images.genius.com/12162bd5dc20dab4c0cbb67190522d80.500x493x1.jpg"}], "artist": "KRS-One"}