{"songs": [{"title": "Drop a Gem on ’Em", "album": "Hell On Earth", "year": "1996-11-19", "lyrics": "[Hook: Havoc]\nIt's the infamous back in the house once again\nLive the life that of diamonds and guns and now gems\nPull gats like a basehead pull on stems\nThe Mobb got the bomb, run out and tell a friend\nDrop a gem on 'em!\n\n[Interlude]\nSome rain got to fall, some rain got to fall\nSome rain got to fall, some rain got to fall\n\n[Verse 1: Havoc]\nKnow what I mean? Drop a gem on 'em\nSick and tired, ugly fake crooks need to retire\nThey got you gassed, take a match and smack fire out ya\nMaggot ass, Havoc represent for the Q-B-C\nSmoke that ass like a loosie\nThough I need to quit, fuck it, I love it like a cloud\nOver the projects, your game I'm above it\nIt's combat, gats, bangers and all that\nYou's a small cat, whatever you on get off that\nI mention, nothin' but the real shit presentin'\nThe hollow-tip crew, 41st side convention\nStride full, you half-steppin'\nLike a fresh TEC out of the box yo, niggas I'm testin'\nThat's no question, bitch-ass have you confessin'\nLike a DT, left in state of depression\nYou under pressure, in tag no doubt catcher\nThe snitch-snatcher, shooken with asthma, you casper\nYou yell my name, that's only givin' me props\nPlus the fans that you got wonderin' what's got you hot\nIt's Tu-Not, knocked out the box and got rocked\nGot raped on the Island, you officially got\nKick that thug shit, Vibe magazine on some love shit\nKeep it real, kid, 'cause you don't know who you fuckin' with\n\n[Hook: Havoc]\nIt's the infamous back in the house once again\nLive the life that of diamonds and guns and now gems\nPull gats like a basehead pull on stems\nThe Mobb got the bomb, run out and tell a friend\nDrop a gem on 'em!\n\n[Verse 2: Prodigy]\nDrop a gem on 'em son, you know I got jewels, infamous son\nYeah, likewise I'm tired of rap guys that's faggots\nYour P'll shut eyes and swole up your whole outside\nI baptize, niggas get wet, hit up your backside\nGet claptized and set straight, put on your head straight\nWatch out for these upstate cats\nBe leary of New Yiddy niggas with gats, with the wall on they back\nRikers Island flashbacks of the house you got scufted in\nYou would think that gettin' your head shot's enough but then\nNow you wanna go at my team\nMust have been drunk when you wrote that shit\nToo bad you had to did it to your own self\nMy rebellion, retaliate, I had the whole New York state\nAimin' at your face at the gate\nBottom line off top soon as you came through\nShots flew, don't even know the half of my crew\nI got a hundred strong-arm niggas ready to rock your shit\nClocks tick, your days are numbered in low digits\nYou look suspicious, suspect niggas is bitches\nGet chopped up, Grade A meat, somethin' delicious\nAnd laced back up, two G's worth of stitches\nTo reconstruct your face and learn how to speak again\nMy mob's like a bunch of wild Puerto Ricans\nWith bangers the size of African spears, it's warfare\nIn the arena, we turn arenas into house of horrors\nIt's terrordome when you see my clique\nYou need to run behind shit\nYou got a gat, you better find it\nAnd use that shit, think fast and get reminded\nOf robberies in Manhattan, you know what happened\nSixty G's worth of gun clappin'\nWho shot ya? You probably screamed louder than a opera\nNew York got ya, now you wanna use my mob as a crutch\nWhat you think, you can't get bucked again? Once again—\n\n[Hook: Havoc]\n-back in the house once again\nLive the life that of diamonds and guns and now gems\nPull gats like a basehead pull on stems\nThe Mobb got the bomb, run out and tell a friend\nDrop a gem on 'em!\nIt's the infamous back in the house once again\nLive the life that of diamonds and guns and now gems\nPull gats like a basehead pull on stems\nThe Mobb got the bomb, run out and tell a friend\nDrop a gem on 'em!", "image": "https://images.genius.com/b26cf466b18804b4a2863f9933cda657.600x600x1.jpg"}], "artist": "Mobb Deep"}