{"songs": [{"title": "Black Jesus", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Interlude Dialogue]\n\n[Raekwon]\nBurn something kid\n\n[Popa Wu]\nYeah, youknowwhatImsaying, let me tell you something man\nThrough the man's mind, God\nHe see his elevation, God\nSee through his mind, he see his elevation, God\nSee this where he begin to know that where he come from\nSee some people don't have no direction, God\nBecause they don't know the science of they self\nSee the signs of life is the signs of you\nAll the elements that it took to create you\nEverything that's in the universe, God\nThat's created the universe, God, is just within you\nYou see what I'm sayin?\nAnd that's the mind that you can't see\nDon't you know if a man could take and flip himself inside out, God\nHe'll fall out and die if he sees the shit that goes on...inside?\n\n[Ghostface]\nSo you mean to tell me I'm the creator of all this right here?\n\n[Popa Wu]\nYou the creator of all this\nBecause all these things must happen, it must take place\nSee people go back in the day, God\nThey say: one man, one woman, Adam and Eve, there ain't no such thing\nEverything you see always has been and always will what be\nRegardless the womb or what, it's got to be\n\n[Intro: Raekwon]\nHit me, hit me, hit me, I don't wanna hear nothin\nWord Up\nGot to pay\nYeah, it's like that right?\nBlow his back out, make his shoes worth\n\n[Verse 1: Raekwon]\nA-yo, this shit be off the noggin rock it\nWhatever cock block it\nCat get blown, who own this street corner\nForeigner hesitate to rock a Hummer\nNavy Seal top runner, rhyme this summer\nFor real, marinating nigga's skating\nDebating waiting style flowingly relating\nFine line switch it on ya, like venetian blinds\nThe mission is mine, fabulous king I divine\nTitanium Hydro collide though\nYo dun dun polly this conjunction, son one\nSlang doctor, medicated kids pay it\nSay it, these niggas in affect dun, stay rap related\nCassette rhymer, 5-G consigner, line for liner\nPoet designer, sharp like Linus\nMic of the year award, fly gear award\nThem niggas over there be analyzing with one sword\nGet bent, pay the rent, plus still we invent\nNuff shit to get your whole team crazily sent\nNow all I need is a half gallon of weed\nProceed, to bust this mic dick and make three seeds\nThen max out like two Ac's inside the parking lot\nSon bark a lot and get his team hit in the dark a lot\nWhat now blow, clicking like a calico\nGold, Maximillion, one love keep it real yo\n\n[Verse 2: Ghostface Killah]\nYo, hit me for these Tommy Hill, ice-rocking niggas\nPeace, this summer's mines, I blow the biggest\nBack up off me, while I grab my dick and hold the Heini\nPark the Blue 600, Wally kings is right behind me\nTackle clubs, never rock Lugz, I'm way above\nThese mics is like the Golden Gloves verses spark plug\nIts like the pennant, seminar's the play-off\nStart the J off like Cochran got OJ off\nThis specialist who eyeballed your mistress necklace\nPerpetuous, this curly-head kid's treacherous\nLet go the eggo, so we can dip dip dive like Lego\nThrow on can-can, eat that plus this instrumental\nAh shit say Stark-ologist\nStarks-ologist, fried fish halibut\nPull out the bull horn, let's celebrate like Kunta was born\nWe elbowed our way inside Loud and got on\nI played the building, burn a branch and get filled in\nLike Pilgrims G-in' Pepridge farms from out of millions\nWho wanna rhyme, who wanna challenge the swordmans\nThat rock that fisherman hat like Gorton's\n\n[Verse 3: U-God]\nI hold down the place, no shots to the face\nElite Special force no religious style faith\nThe melting pot boil gun shot drama soil\nGamble when I scramble handle hot pots of oil\nManhandle pain killing erect my hidden\nStreets made me potent put your 9-6 bid in\nVampire curse disperse on each verse\nSwim in black water, axe slaughter through my earth\nYou're hit by my element Great Wall of China\nMountain peak holds the globe like vagina\nMeasure on my mic stand, molecule and strand\nFinger rolling rhythm ride the horse one hand\nGolden Eye, Spy vs. Spy, guilty of suspicion\nChess boxer, mic in dead body position\n40 oz. Ciga-art, three verse invention\nDivine universal black man representing\nSimilar to pure, rhyme blowing out the pore\nBattery in the back, keep me charged for the raw\nI'm bred type thorough, pistolero gun hero\nRenaissance rebel chatter-boxing your barrel\nFully woven Beethoven, hit you on a humble\nHard enough to hurt you, chastise my rap styles\nLock down, for this curfew", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}