{"songs": [{"title": "No Flex Zone (Remix)", "album": null, "year": "2014-08-31", "lyrics": "[Intro: Swae Lee]\nWon a gold medal, and a gold bezel\nI treat it so special, now ya ho jealous\nFreak hoes, got several, they tens or better\nI'm a trendsetter, I'm a go-getter!\n\n[Verse 1]\nWhen I slide down the ave I'm fuckin' trippin' (damn)\nMaserati bat black, all I wanna know is where the cash at?\nTNT tucked in my 'rillo, hundred racks under my pillow\nDifferent styles, I'm so versatile, nigga you know like I know\nJimmy, Lil Swae, hoes on the chase\nCash in the air make her forget her date\nHeard of my plan, she fuckin' with me anyway\nIf she thicky like Nicki I put that pussy on my plate\nHow you not notice the flyest niggas in the place?\nI hit the liquid and started drippin' into space\nHublot tickin', blowin' kisses at your baby\nHave fun, shotkilla like Mike reincarnated\nThrowin' out a fuckin' end\nI'm blowin' money in the wind\nI'm sick of wearin' skinny jeans\nI'm more into wearin' Louis V's\nThese hoes don't fuckin' listen\nThese niggas don't pay attention\nThese bitches are not yours\nWe keep them on all fours\nBreakin' down', rollin' up potent\nSippin' champagne like soda, poppin' red bitches like cola\nTrunk beat like Eardrummers\nSremm killed the haters, God bless 'em\nMothafuckas still all in my bone marrow\nFlyin' through the air like a fuckin' air devil\nAll these broke niggas just fish in a barrel\nRun back up and I turn into a bezel\n\n[Hook: Swae Lee]\nNo flex zone, no flex zone\nThey know better, they know better\nNo flex zone, no flex zone\nThey know better, they know better\nWon a gold medal and a gold bezel\nI treat it so special, now ya ho jealous\nFreak hoes, got several, they tens or better\nI'm a trendsetter, I'm a go-getter!\n\n[Verse 2: Nicki Minaj]\nHell no you can't use my lip gloss\nPop a perc' now I'm on lift off\nAss still fat, it's on Rick Ross\nYou bitches, make a nigga dick soft\nBitch ball like I'm at tip off\nGet it wet, then I rub the tip on\nRag and Bone jeans I can slip off\nBitch I've been hot since flip phones\nRunning this game for 5 years\nGuess that's why my feet hurt\nWonder when they bite me\nDo these bitches' teeth hurt?\nYes I am an icon, that's me on your T-shirt\n….THOUGHT YOU KNEEEEEEWW BET-TER!\nDo your fucking research\nYou ain’t know this the no rip zone\nThis the \"You can’t beat Nic” zone\nMadison Square when the Knicks home\nI live next door to Brad Pitt’s home\nI like bad bitches, cause they like bad bitches too\nI like hood niggas, with a bad attitude\nThey could never reach Young Nick, magnitude\nEven if they had a longitude, latitude\nListen up ho, this is my territory\nYou are my son, like an episode of Maury\nLike an episode of ER, bitch I’m hotter than the D.R\nWhen it comes to rap skills, nobody wanna see her (seer/CR)\nMotherfuckers flexin, motherfuckers acting (actors, A.R)\nBitches is my sons and they causin' contractions\nAin’t pushing out, I'ma give them to the clinic\nCah wait, we nuh rate dem gyal and dem gimmick\nWack sauce I can hear it in your tone\nThis nigga keep staring at my phone\nBut if you’re ugly it’s a no text zone\nIt’s a no sex zone, it’s a no flex zone\nWack sauce I can hear it in your tone\nThis nigga keep staring at my phone\nBut if you’re ugly it’s a no text zone\nIt’s a no sex zone, it’s a no flex zone\n\n[Hook: Swae Lee]\nNo flex zone, no flex zone\nThey know better, they know better\nNo flex zone, no flex zone\nThey know better, they know better\nWon a gold medal and a gold bezel\nI treat it so special, now ya ho jealous\nFreak hoes, got several, they tens or better\nI'm a trendsetter, I'm a go-getter!\n\n[Verse 3: Pusha T]\nWho ain't waiting on King Push?\nGot niggas checking for them new flows\nSold more dope than the old Jigga\nNow niggas calling me the new Hov\nLet the coupe go, planetarium\nLet the roof go like Cesarean\nClear my section nigga, no flexing nigga\nJust a hunnid bottles they carrying\nCross the border like I lost a daughter\nThis foreign nigga, he ain't know better\nHim pick and choose where them bullets fly\nI lose the plane on this fool nigga\nBought dope with my album budget\nPlay Cloths was the blueprint\nFour million in four seasons\nFuck who care for my fashion sense\nTell a ho come and swim in the money (splash)\nBroke niggas just stop at the heel\nI could body paint you in them name brands\nAnd put a red bow on the wheels\nSee I'm just in and out, I call a rent a mouth\nSuck the ice out of a bezel\nUse my rap persona, fuck baby mommas\nStill killin' haters, God bless em'\n\n[Hook: Swae Lee]\nNo flex zone, no flex zone\nThey know better, they know better\nNo flex zone, no flex zone\nThey know better, they know better\nWon a gold medal and a gold bezel\nI treat it so special, now ya ho jealous\nFreak hoes, got several, they tens or better\nI'm a trendsetter, I'm a go-getter!", "image": "https://images.genius.com/c95b15fdea4efa1be0848887807745c9.1000x1000x1.jpg"}], "artist": "Rae Sremmurd"}