{"songs": [{"title": "Watch Me", "album": "Vol. 3… Life and Times of S. Carter", "year": "1999-12-28", "lyrics": "[Intro: Dr. Dre & Jay-Z]\nYeah!\nUh uhh uh-uhh, boom boom boom\nD-R-E!\nSay with me niggas, boom boom\nAnd Jay-Z\nBoom boom boom boom\nWhat the fuck?\nBoom boom boom boom\nWatch me!\nJigga Man, ya heard? Boom boom boom\nBrooklyn, ya heard? Boom boom boom\nCompton!\nGotti Gotti ya heard? Yo\nC'mon!\n\n[Verse 1: Jay-Z]\nYou gotta, pop that styles, rock that watch dial\nSee that Benz? Cop that now\nDrop that top down, they gon' kill us anyway\nThem cops Uptown hit Homes with forty-one rounds\nLive yo' life, get yo' ice\nShe been with you since day one nigga, trick on your wife\nSpend that dough, when in doubt, take that trip\nShe ain't living for the moment homie, shake that bitch\nHe that cool, he can't take you nowhere? Leave that fool\nBe that rude if he that cool\nSave for what? Ball 'til your days is up\nThis place is fucked, all type of AIDS and such\nHow they make it where you afraid to fuck\nThey gave us drugs then turned around and investigated us\nLife is short, then you on life support\nSo in between it all, I'ma say I seen it all, watch me\n\n[Chorus: Dr. Dre & (Jay-Z)]\nPlace yourself in the shoes of true felons (uh-huh)\nAnd tell me you won't ball every chance you get (uhh, watch me)\nAt any, chance you hit (that's right), we live for the moment\n(Yo watch, watch) Makes sense don't it? Now make dollars\n(Watch me!) You see me around some cheese\n(Watch me!) See me with hustlers around them G's\n(Watch me!) Blowing 'dro running through pounds of weed\n(Watch me!) At the bar baby, round's on me\n(Watch me!)\n\n[Verse 2: Jay-Z]\nWatch me turn something out of nothing, turn Platinum from Gold\nWatch me light the Cohiba off the Viking stove\nI take an empty bank account, fill it with Os\nI take an empty building then I fill it with hoes\nWatch me, cop that Coupe, shine for the ladies\nHave 'em saying, \"Damn I never seen a watch that blue\"\nAnd while they still mesmerized I pop that cooch\nShit, law enforcement couldn't stop that dude\nGuess who? Fresh off of Vol. 2\nBack at you, peep the numbers my album do\nThey call me Champagne Hova, wake up with a hangover\nWhen y'all think the game's over, do the same thing over\nStill with the same soldiers\nStill getting brain and it's plain ain't a thing gon' change Hova\nHop out the truck, hand on my cock and nuts\nWho got the bank? I'm stocking it up (watch me)\n\n[Chorus: Dr. Dre & (Jay-Z)]\nPlace yourself in the shoes of true felons (uh-huh)\nAnd tell me you won't ball every chance you get (watch me)\nAt any chance you hit, we live for the moment\nMakes sense don't it? Now make dollars\n(Watch me!) You see me around some cheese\n(Watch me!) See me with hustlers around them G's\n(Watch me!) Blowing 'dro running through pounds of weed\n(Watch me!) At the bar baby, round's on me\n(Watch me!)\n\n[Verse 3: Jay-Z]\nYo, the watch too rocky, need shades\nContinental sitting on blades, spinning like waves\nGun too Brock-y, behave\nBig shot, plus I'm feeling like Rocky these days\nIce don't melt, I could ski through a heatwave\nNights won't help you see Jay, it'll be day\nMy shit too bright, I rip through mics\nPlus I push more powder than Crystal Light\nChick mad, said I hold my pistol too tight\nGet a grip bitch, this how I get through life\nI buy out the bar, spit Cris' through the mic\nSee Jigga in the 6 and all the shit you like\nSee Jigga giving dick to every bitch you like\nI told her, \"It's Jay-Day and Hit-You-Night\"\nYou wanna, see me again you gotta get two dykes\nI got rules I can't hit you twice, you heard me?\nWatch me!\n\n[Chorus: Dr. Dre & (Jay-Z)]\nPlace yourself in the shoes of true felons (uh-huh)\nAnd tell me you won't ball every chance you get (that's right)\nAt any chance you hit, we live for the moment\nMakes sense don't it? Now make dollars\n(Watch me!) You see me around some cheese\n(Watch me!) See me with hustlers around them G's\n(Watch me!) Blowing 'dro running through pounds of weed\n(Watch me!) At the bar baby, round's on me\n(Watch me!)\n(Watch me!) You see me around some cheese\n(Watch me!) See me with hustlers around them G's\n(Watch me!) Blowing 'dro running through pounds of weed\n(Watch me!) At the bar baby, round's on me\n(Watch me! Watch me!)\n\n[Outro: Jay-Z & (Dr. Dre)]\nUh-huh-uh uh-uhh uh-uhh.. uh\nUh-huh-uh uh-uhh uh-uhh..\nUh-huh-uh, Jigga Jigga shit huh!\nUh-huh, uh-huh-uh, Brooklyn-Brooklyn shit huh!\n(Compton!) Uh-huh-uh, Gotti Gotti shit huh!\n(C'mon) Uh-huh, uh-huh-uh, Lil Rob shit huh!\n(C'mon) Uh-huh-uh-UHH, Roc-A-Fella shit y'all\n(C'mon) Uh-huh, uh-huh, Murder Murder shit y'all\n(Watch me!)", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg"}], "artist": "JAY-Z"}