{"songs": [{"title": "Fuck In The Truck", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Intro: DJ Young Mase]\nMore dozen shit!\nVolume number 2\nProduced by Mr. Porter\n\n[Hook: Kon Artis]\nYellow, you know I know that's wassup\nThat's the reason for all the gnac in your cup\nSo go ahead girl, sip it up, sip it up!\nIn a rush because I'll fuck in the truck\nI know you used to having your way\nNiggas falling over you daily\nSometimes you wanna just do your thang\nLet a nigga fuck out your brains\n\n[Verse 1: Kuniva]\nI know you hear it all the time\nBut you ain't heard it from me\nA lot of guys would pay for it\nBut I get it for free\nAnd I ain't tryna talk you to death\nSo I'll be brief: if you smoke\nHere's a little something for you to chief\nSee, this movie's getting boring\nThe Henny got you warm. Plus you looking\nLike a stund double for Melissa Boyd\nI see you smiling, sexy little glancing\nLicking on your lips and you welcome my advances\nPretty Young Thing didn't know she liked it rough\nTil she ripped my clothes off and pulled out her\nHandcuffs - sho nuff. All over me, so it's only right\nThat I give it to her like a mad man with a knife\nAnd she's loving it! Scratching me up, push me off\nTurned around and started backing me up, that's what\nThe fuck I be talking about, girl\nA freak in disguise, banged her perm out\nAnd left her ass sleeping high\n\n[Hook]\n\n[Verse 2: Swifty McVay]\nI see you wyling, hands/legs over me while I'm driving\nOne of them out the window, 5 miles per hour\nSipping amaretto like a champ, and I\"m proud of you!\nStill flexible, double-jointed, I can't argue\nEverybody staring as you drive through\nI continue to pull over to the first curb I find, boo\nI take it you wanna be in control\nTake it slow, but no dominations on me\nSaid you wouldn't call me, figured I would talk shit\nI love the way we did it in the middle of an argument\nI don't play the game, I'm doing what you wanted\nBefore I told you my name\nIt's just me, no disrespect. You wearing Donna Karen\nAnd I got on a V-neck\nYou let it get this way, it'll remain\nYou got me, I grabbed you, fuck, I love your brains..\n\n[Hook]", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}