{"songs": [{"title": "House Shoes", "album": "More Malice", "year": "2010-03-23", "lyrics": "[Intro]\nAy Snoop Dogg\nAy ay ay Snoop Dogg~!\nWe the people, wanna know\nWhat's it like to be a boss mayne?\nI mean, what's it really like to walk in yo' shoes mayne?\n\n[Snoop Dogg]\n(Yo!) This ain't no cake walk nigga\nYour cuz keep it pimpin man I made y'all niggas\n(Yo!) The game played you niggas\nI'm 19 in, kush and a Swisher\n(Yo!) Cash by the bundles and bundles at wholesale\nNo bail the feds tryin to give me mo' jail\nBut I'm a superstar, ridin in my super car\nPonytail swangin, gangbangin, lookin super hard\n(Yo!) I wake up every day and blow a zip\nCount grams, contraband on my HIP\nOutstanding with my pimp hand, handing me my GRIP\nOutlandish on my tip like nigga this Crip\n(Yo!) The bouelvard star, red carpet walker\nSo +Famous+, feelin like +Amos+\nFuck the police, one time cain't contain us\nI'm rich as a motherfucker ain't I? Ain't I?\n(Yo!) I'm the boss and you know dat\nSend two I send 'bout fo' back, dead\n(Yo!) Don't let the names do you wrong\nI'm so involved with the heat I need meds\n(Yo!) My whole life is like a video\nI make good music like really doe\nStandin on my own two, lookin at you suckers, what'chu gon' do?\n{*shhhhhh*} Ballin ain't a thing that's what I'm gon' do\n(Yo!) Back at 'em, the 'llac with a chandelier\nWith a +Foxy+ bitch, I call her Pam Grier\n(Yo!) This my part of town, you can't stand here\nYou say you gangster? The Runners gettin ran here\nChop 'em up, sit 'em down, please don't disturb the Dogg\nAin't worth the call, shit I ain't even heard of y'all\nThe nerve of y'all, to face what you cain't see\nI don't give a fuck who went down, she he ain't me\n(Yo!) Khakis creased, All Stars, blue barette\nSo much money on him shit the city tried to sue the set\nBoss Dogg, here I go, hoggin in my own lane\nIn 1988, I was cookin up the whole thang\n(Yo!) And now I'm involved with slangin raps\nMillion dollar deals, movies and countin stacks\nThe critics try to fight the facts\nBut I'm loved everywhere, go and fight that\n(Yo!) I think they love it when I'm trippin\nThat pop shit make it hard to listen\n(Yo!) But when it sounds like this\nIt make a nigga wanna pop his clip in, now listen\n(Yo!) Turn that beat up, that bass got 'em feelin froggy\nQuit your talk, I got homies bigger than John Coffey\n(Yo!) And they'll tear this whole place up\nGot gangsters puttin on makeup, ya dig?\n(Yo!) The West coast king is on his shit again\nThey in panic like \"How do we get rid of him?\"\nThe answer is you cain't\nAnd even if you could, then motherfucker you ain't\nBeitch!", "image": "https://images.genius.com/463a0ac98c71553803f108dccc9e3499.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}