{"songs": [{"title": "N.I.G.G.A. (Never Ignorant Getting Goals Accomplished)", "album": "Loyal to the Game", "year": "2004-12-12", "lyrics": "{\"Niggas!\"} Yeah.. uh..\n{\"Niggas!\"}\n\n[Verse One: 2Pac]\nWho's afraid of the punk police?\nNiggas run the streets, no justice no peace\nFuck the law, I'd rather draw than do time\nDon't fuck with mine 'cross the line\nMy two 9's go BIYA BIYA when I shoot 'em\nKorean motherfuckers was crooked\nSo niggas had to burn and loot 'em\nNow the streets ain't safe at night, my niggas\n.. uhh, straight take his life\nSo don't sleep when my team creep up, how we hit 'em\nEmpty the clip, then dip cause we did 'em\nLickin off shots for Latasha, that's proper\nLove for my niggas but a Glock for the coppers\nSo what the fuck you wanna do now?\nI packed a 9 last year, in '99 I'm packing two now\nAnd even if they pull they triggers\nThey can shoot one man, but nothing's gonna stop the plan of true niggas\n\n[Hook]\n{\"Niggas!\"} Yeah, niggas - can't fuck with us\n{\"Niggas!\"} Yeah, niggas\nCause bein a nigga means you love niggas, haha\n{\"Niggas!\"} I was raised in this society so there's no way you can\nExpect me to be a perfect person, cause I'mma do what I'mma do\n\n[Jadakiss] HA!!! Uhh..\nAiyyo!\n\n[Verse Two: Jadakiss]\nMy dimes make the fiends go to sleep, so they call 'em Bedrocks\nNiggas is like photographers, all they take is headshots\nYour last words'll be, damn, what's all these red dots?\nNiggas nowadays they worry me\nMy bars is therapy, as long as you usin 'em thoroughly\nMuah 'til the day that they bury me\nMy niggas is stronger and tighter now than they probably ever be\nAnd I'm a product of the 70's\nThe hood got niggas on punishment, that's why they never leave\nIf I ain't eatin wit'chu I'm probably beefin wit'chu\nIf no money ain't involved ain't no need for me speakin wit'chu\nI know you got a gun but I'm hopin you keep it wit'chu\nCause unfortunately I'm one of the rappers that keep a pistol\nAnd know what the llama do\nShady/Aftermath, Ruff Ryders, D Block, and of course Amaru\nLot of people honor you, probably cause the way\nThat you used to bring the drama to, whoever you wanted to\nYou a leader when you can get a leader to follow you\nBut, anyway, life goes on\nSo I'll see you when I art in heaven like our fathers do\n\n[Hook]\n{\"Niggas!\"} Yeah, niggas - can't fuck with us\n{\"Niggas!\"} Yeah, niggas\nCause bein a nigga means you love niggas, haha\n{\"Niggas!\"} I was raised in this society so there's no way you can\nExpect me to be a perfect person, cause I'mma do what I'mma do\n\n[Outro]\n{\"Niggas!\"} Nigga! Can't fuck with us", "image": "https://images.genius.com/aff64f752ccfff1d48590e5db3c0357a.300x300x1.jpg"}], "artist": "2Pac"}