{"songs": [{"title": "Keep It Movin’", "album": "Deeply Rooted", "year": "2015-09-04", "lyrics": "[Verse 1: Scarface]\n\nIf this is love I don't see it\nCan't make me believe it\nYou a nice girl, but I'm a hood nigga on some street shit\nAnd yeah, you know my weakness\nSucker for some love type\nI come from the slums girl, you come from a good life\nI wonder what you see in me\nI love weed and Hennessy\nYou barely doing happy hour, I ain't never seen you drink\nAnd now that's leaving me to think, how I got so close to you?\nThis was just a hit and split, that's what I supposed to do\nOne thing let up to the next, I'm addicted to your sex\nYou addicted to this dick, every cause has its effect\nThat's what I get I guess, I can't commit that's killing this\nYou gave me an ultimatum, I'm numb I ain't feeling shit\nMust not know who she dealing with\nPuddles on her pillow case, tears running, eyeline, lipstick smeared\nHey are you ok?\nYou disobey, you pay for that\nWell, the love is gone, and she ain't made it back, pray for that\n\n[Chorus: Avant]\nWhat happened to us, you acting foolish\nI'm acting foolish, what we need to do is\nKeep it movin', that's what we need to do\nBefore something happens we better keep it movin'\nI'm 'bout to lose it, we're going through it\nThis shit confusin', what we need to do is\nKeep it movin', that's what we need to do\nBefore something happens we better keep it movin'\n\n(skit: Scarface/woman)\nI'm just sayin', a relationship should be 100-100 not 50-50, right?\nRight\nOh what you gon' think about that?\nYeah I'm gon' think about that\nLook, you want me here or not?\n\n[Verse 2: Scarface]\nThink before you answer that, it's hard enough we breaking up\nBut after this no turning back, brought this on myself with her\nMistakes I'm forced to live with that, I'm knowing more mistakes to come\nI'm human, that's my best excuse, in fact my only one\nTears fall, my kids call, 'This ain't me, it's his fault'\nOh shit no, we did this\nA partnership with no room for forgiveness\nI take the blame, take your aim\nShoot that shot, can't wait to claim\nAll of this, in Jesus name\nPray in church, they give you change\nI feel your pain\nSongs sung in the key of life, with no meaning right\nHopefully one day might come I'd see the light\nCan't sleep at night\nAnd I'm wondering who's fooling who?\nI'm sure you know who's fucking me, cause I know who's been fucking you\nWe used to be inseparable, never thought that that day would come\nWhere I'd take that shit so serious, and you get so good at playing dumb, you got away with one\n\n[Chorus: Avant]\nWhat happened to us, you acting foolish\nI'm acting foolish, what we need to do is\nKeep it movin', that's what we need to do\nBefore something happens we better keep it movin'\nI'm 'bout to lose it, we're going through it\nThis shit confusin', what we need to do is\nKeep it movin', that's what we need to do\nBefore something happens we better keep it movin'\n\n[Verse 3: Scarface]\nYou had me I'll admit that, fell into the trap you set\nLookin' me in my eyes, lyin', killing me with that soaking wet\nWouldn't let me meet your connect\nScratching me all across my face\nSays she loves the way it feels when I'm in it all the way\n60 calls a day, wondering where the fuck I'm at\nWondering where the fuck I stay, who else I fuck like that\nNow let's be honest, you got him with whom you made your promise\nAnd let us not forget, it's her with whom I made my woman\nI know our days are numbered, enjoying moments after\nPlus in lust we fell in love, the pains are more than laughter\nLiving our separate lives, are husbands reckless why?\nBeneath the questions lie, why was she left to cry?\nShould have left shit quiet, but you was out of line\nBetter step aside, gotta tell me why?\nI was everything, you was all I had\nNow this is change, and then this change is bad\nMake a note of that\n\n[Chorus: Avant]\nWhat happened to us, you acting foolish\nI'm acting foolish, what we need to do is\nKeep it movin', that's what we need to do\nBefore something happens we better keep it movin'\nI'm 'bout to lose it, we're going through it\nThis shit confusin', what we need to do is\nKeep it movin', that's what we need to do\nBefore something happens we better keep it movin'", "image": "https://images.genius.com/8962738e6fdff4298d09683da33f7a92.1000x1000x1.jpg"}], "artist": "Scarface"}