{"songs": [{"title": "Cracker Jack", "album": "Nigga Please", "year": "1999-09-14", "lyrics": "\"C'mon baby, c'mon c'mon baby\" repeats\nIn background all throughout the song\n\n\"You bitches can't do nothin\" repeats\nIn background through intro\n\n[Intro: ODB]\nIt's Ol' Dirty Bastard and shit, know'm sayin?\nI wanna give a big shout out to my nigga Lou\nKnowI'msayin? You know, you know, know\nI wanna lock all the bitches down\nI wanna lock all the bitches down from the North\nTo East, to West, to South\nKnowI'msayin?\nI wanna.. help me put these bitches in my trance\nI want y'all to suck my lizard\nYou bitches wanna fuck me when you smell my under-arms\n\n[ODB]\nI'll make yo' dick disappear\nI ain't hearin' anymore weird sounds in the air\nPSSSSSSS... you can't purr no more\nYou wanna kneel and suck dick? I'mma keep your throat sore\nBitch you got herpes in ya ass\nEvery time you fuck a nigga, he dies fast\nAnd you won't last\nThe pussy break down from a rash\nIt's hard for you to walk, cuz you stuck up in your ass\nDon't ask me for no cash\nYou better not be tellin' me to give them no cash\nAsh, bash, crash, sad ass\n\n[Hook: ODB]\nGive me a little of that Cracker Jack\nYou ain't caramel coated Cracker Jack\nWell surprise, bitch you gonna get waxed\nThat's that shit, you can't do nothin' about\n\n[ODB]\nGirls ain't pretty to me anymore\nCuz you ain't bein a real whore\nOoh, you ain't a real whore\n*I'm gettin' hot and touchin' myself!*\nYou can't say, wear nails anymore\nYou ain't givin a, manicure\nSuckin' my dick is gonna be your cure\nIf you don't, your punishment\nYou can't get off until you suck my dick\nPhysically I operate your brain to function\nGive me anything, that I want and\nALL GIRLS WANNA FUCK ME EVERYDAY\nAnd give me that, the money\nDon't even know it happens naturally\nEspecially when I'm playin with the chemistry\nTHE MONEY COMIN TO ME FIRST\nYou gonna keep dyin til you die from thirst\nI WANT A DIFFERENT GIRL EVERYDAY\nIf you wanna die, you gotta drink my sperm\nThe other way to die, is eat a can of worms\n\nChorus 3X\n\n[Outro: ODB]\nGive me a little...\nYo, I love you girls cuz you wanna stick your tongue up in my ass\nOr you can't taste, smell, touch or hear, or see\nI got you in a smash, give me it!\n\n[Instrumental for next 58 seconds]", "image": "https://images.genius.com/ab1797ebd0d89e0846bb01b1a14efb3e.220x220x1.jpg"}], "artist": "Ol’ Dirty Bastard"}