{"songs": [{"title": "Slacker", "album": "Absolute Power", "year": "2002-09-24", "lyrics": "[Intro]\nSlacker: a person who shirks his work or duty; a person who evades military service in wartime... hahahahaha! I know one thing, man. I'm gonna have my kicks before the whole shithouse goes up in flames. You know what I'm saying? Hahahaha! Eat, drink, and be merry. Tomorrow you may die. That's what life's about, man. Good times, noodle salad. Haha...\n\n[Verse 1]\nI'm a product of Reaganomics\nNeurotic, they saying I'm it\nJust got up, inhaling chronic\nThe oddest, I'm staying honest\nI'm 'bout to make it famous\nSo you can take that J-O-B and you can shove it up your anus\nI ain't never understood how the world works\nBut I always understood why the girls twerk\nFor a baller, not a 9-to-5\nBarely making it with disgust behind your eyes\nSo I just grip my piece, rip-off fleece\nOut to take your lip off, chief with my peeps\nWe ruthless, if you got money induce it\nGoofs get toothless, we loose off two-fifths, we useless\nI wanna kick it but ain't got the dough\nSneak in the concert, trip, and make 'em stop the show\nWe gots to go! Push me and I sock the po'\nGettin' the bail from my parents is impossible\n\n[Hook]\n(I'm a slacker) Never did I have a lot of dough\n(I'm a slacker) Smoking pot and watching videos\n(I'm a slacker) Go whichever way the wind blows\nThose just tuning in, I'm just letting you know\n(I'm a slacker) Every time I take a look around\n(I'm a slacker) Stuck upon my face is a frown\nI don't do enough, I just fool around\nY'all can go to hell, how does that sound?\n\n[Verse 2]\nNow you can tell by my everyday 'fits, I ain't rich\nI sneak with a piece when I grit (grit)\nI'm just another gatman caught up in the mix (mix)\nTryna take yo' dollar and your fifteen cents (I grind with a pistol)\nI stay rid of you lames (y'all gay!)\nI play video games (all day!)\nWhat Kansas City, MO brangs is a gritty slow game\nWe diddy-bop with really no change (y'all pay!)\nAnd people holla \"How you do that there?\nWhy your pants hanging low and why you grew that hair?\"\nLighting a bleeze with my people riding a Regal\nAlways in trouble with coppers 'cause we drivin' illegal\nI ain't never giving them leeway, to hear me neigh\nThe judicial assembly's gay (hey!)\nI come out at night 'cause I sleep all day!\nTryna get with Def Jam, Loud or MCA!\n\n[Hook]\n(I'm a slacker) Never did I have a lot of dough\n(I'm a slacker) Smoking pot and watching videos\n(I'm a slacker) Go whichever way the wind blows\nThose just tuning in, I'm just letting you know\n(I'm a slacker) Every time I take a look around\n(I'm a slacker) Stuck upon my face is a frown\nI don't do enough, I just fool around\nY'all can go to hell, how does that sound?\n\n[Verse 3]\nYo, yo, check\nEnter the party and my homies got to pay for me\nHolidays, them be just be another day for me\nGetting drunk, hoping I get to the crib safe-a-ly\nPray for me, 'cause I'm needin' money majorly\nSit at home watching MTV with a empty P-\nO-C-K-E-T, I MP3, everything that I hear on the streets\nNever buy it, don't deny it, I'm the fear, I'm a beast\nYou say get a job? I say hit a knob!\n'Cause the way you run the world is every bit a fraud\nSo what you ask of me? You get no tax from me\nI got whites, natives and Mexicans and blacks with me\nHuh! I'm tryna get up there with Master P\nPass the D, 'cause, that's the way it has to be\nWe bust to be free, we trust to be G\nSo fuck who be glee, it sucks to be me\n\n[Hook]\n(I'm a slacker) Never did I have a lot of dough\n(I'm a slacker) Smoking pot and watching videos\n(I'm a slacker) Go whichever way the wind blows\nThose just tuning in, I'm just letting you know\n(I'm a slacker) Every time I take a look around\n(I'm a slacker) Stuck upon my face is a frown\nI don't do enough, I just fool around\nY'all can go to hell, how does that sound?\n(I'm a slacker) Never did I have a lot of dough\n(I'm a slacker) Smoking pot and watching videos\n(I'm a slacker) Go whichever way the wind blows\nThose just tuning in, I'm just letting you know\n(I'm a slacker) Every time I take a look around\n(I'm a slacker) Stuck upon my face is a frown\nI don't do enough, I just fool around\nY'all can go to hell, how does that sound?\n\nI'm a slacker (doo) I'm a slacker (doo-doo-doo-doo) yeah (doo-o)\n[Repeat until fade]", "image": "https://images.genius.com/bbaf58500fd47391da9bf51423b8a155.600x600x1.jpg"}], "artist": "Tech N9ne"}