{"songs": [{"title": "Overtime", "album": "DON LIFE", "year": "2019-07-24", "lyrics": "[Intro]\nYeah, woah, woah\nI just been feeling like, it's all clickin', ya know?\nHit-Boy\nLike it's all working out, and I'm 'bout to work out\nColossal\nB.I.G, look\n\n[Verse]\nThe universe been throwing me all the signs except stop it\nNiggas been plotting on me, but here's the plot twist\nI can't throw fits no more unless it's profits\nLord, why you keep boxing me in, 'cause I'm God's gift?\nI might set my mic back up in the closet, though\nJust to give myself that same feeling from '04\nWhen my hunger was more, advice to you and yours\nThey say it's over for you, that's when you go overboard, okay?\nShit, I didn't take a break, my nigga, I broke\nBroke my heart, broke my soul, don't cry for me though\nIf you don't break nothing down then it's no room to grow\nOne mental block lead to another, shit it's dominos\nMixtape Sean, but I'm in album mode, ooh\nShe give me praise, I love her angel face\nAss so fat she could work at TSA (Damn)\nI went to school at Cass, Aaliyah went to DSA a mile away\nJust letting you know the types of kings and queens my city make and I probably need a parade\nAll the soldiers with me, this shit like green beret\nSo legendary, I'ma probably need a day (June 29th)\nForgot I already got one, be dammed if I'm not one\nYou talking 'bout the hottest in the city, most influential rappin' ass niggas and I'm the top one\nMe and Em' knocked down doors for y'all that was locked once\nI know they may never get me, I still put on for the city like the Lions first round picked me\nI ain't been fucking I been too busy, I got two phones they both business, I got fake ones tryin' to end me\nI got real ones gon' defend me like a fucking co-defendant\nI got Don Life on my pendant, I’m conditioned to do the distance\nAnd I just set up the pensions, family set like my intentions\nBeen balancing trying to keep my company with the girls who wanna keep me company\nYou know the ones who claim they over me but would much rather be under me\nIs confident and been through too much just to be done with me\nAnd you know that shit gets stressful right?\nShit taxing, the same thing that got Wesley Snipes\nAnd you know how I'm rocking, rocking Elvis Presley white\nYou know highlight reelin'\nAll highlights like we sitting on top of museum ceilings\nNo more resisting\nIf you ain't on my frequency, you out of tune and not tuned in\nTo break the unbreakable, escape the unescapable\n'Til you push your fucking limits, you don't even know what's capable\nFuck that shit that you believe in, I believe in me\nTalkin' on they phones and PC like they off that PCP\nBitch, I spit that Eazy-E, face to face, Smack DVD\nI don't got no time for hanging out and all that E-T-C\nJust cut the check, C-T-C, Godbody my physique\nI can look inside your eyes and know exactly what you mean\nFuck you mean? Energy the first language that I speak\nNo facade, I belong in the Palace of Versailles with a queen by my side\nIn this hot girl summer, I'm just trying to find a wife\nVisualizing from every island that's on Hawaii\nWith my team on each side, like ha-ha-ha-ha-ha\nWith the last laugh like Kawhi\nAnd you know that you that one when you beat all the other odds\nI keep one foot planted at home and the other one on a swivel though\nGotta keep 'em both 'cause this shit get way too pivotal\nAll the work is analog, all the payment digital\nWhen tempers tend to flare up, I'm the one to be cool since preschool\nI know which ones that's been rocking with me, dawg, since the prequel\nJust be cool\nI know your favorite one, dawg, I'm 'bout to drop the sequel\nNigga, this just the preview\nDon\n\n[Outro]\nStrike to claim it, a strike to claim it\nAnd he got it\nGoddammit, yes, that is why I did it\nAnother five, are you kidding me?\nThat's right\nWho do you think you are?\nI am", "image": "https://images.genius.com/f5618e2f5dbc086f8445fbb91ff7c52c.1000x1000x1.jpg"}], "artist": "Big Sean"}