{"songs": [{"title": "Kilo", "album": "Self Made Volume 3", "year": null, "lyrics": "[Intro: DJ Scream]\nThe Untouchable Maybach Music Group\n(Yeah, we was really sellin' that powder, nigga)\nThis a gift to the street accept that with honor\n\n[Hook 1: Louie V Gutta]\nI used to pray to get a kilo, a kilo\n36 O's up that route for my amigo\nThrow it in that water, watch it swim like Nemo\nMan I swear to God I pray to get a kilo\n\n[Hook 2: Louie V Gutta]\nThen I got a kilo, a kilo\nBetter keep that on the low if you got them kilos\nYou might get booked or get murdered for that kilo\nNow I’m steady getting money and this ho wanna fuck\nCause she know I got a kilo, she only want me cause I got bricks\nShe only want me when I got bricks\nBefore a nigga, I ain’t had shit\nShe only want me cause I got kilos\n\n[Verse 1: Meek Mill]\nKilos all on my neck, these niggas ain’t no threat\nSky Dweller gold our plane, and I ain’t comin in no jet\nAnd all I want is straight cash, I ain’t even takin' no checks\nCause these hoes don't do credit\nAnd they don’t pop pussy if the money on debit\nI got them kilos - she only want me cause I got bricks\nShe only want me cause I got shit\nBefore a nigga ain’t have shit\nMan she only want me cause I got kilos\n36 O's in the pyrex, I be going HAM in the projects\nGot a bad bitch with me and she all that\nShe ain’t nothing but a jump shot, all net (swish)\nYa'll suckers play foul like Artest\nI make a brand new flow, you can borrow that\nSelling all these bricks, need a hard hat\nI hit your ho one time, never call back\nSay these niggas used to wanna be like Mike\nNow these niggas wanna be like me\nAnd these hoes twerkin' on Instagram\nStill talkin like they wanna be like B\nAnd these dudes y'all say getting money\nLookin' like groupies in the VIP\nAnd if these dudes got all this paper\nCause all these niggas wanna be like me, ho!\n\n[Hook 1: Louie V Gutta]\n\n[Verse 3: French Montana]\nHAH! HAH! Ay, ay, ay, ay\nYou ain’t got enough on me nigga, 44’s tucked on me nigga\nLong nose like Ginobili nigga, 5 rings like Kobe nigga (bling!)\nI was flippin kilo after kilo (after kilo)\nRockin that Versace shit way before Migos\nStarted with them grams at the project with a stack\nThen I flipped it to a brick and then I did the Project Pat\nLike, homie what’s the problem? Semi or revolver\nCatch a nigga with the bricks, you know we goin' rob em\nOnce I caught the liquor we was fresh up out the drop\nMan the bitches on the corner watch a player like the scout\nI said all I wanted was a kilo, all them bitches wanna free load\nAll I wanted was a drop with the head cracked like Cee Lo\n36 them O’s nigga, thousand grams on gold nigga\nPower plants at the broke nigga, BC, coke boys nigga\nArmy come, pistol on me, smoking on California\n10 chains, catch pneumonia, yea\n\n[Bridge 2: Yo Gotti]\nAin’t no refunds nigga\nWanna get your money back? Best bring your guns nigga\nAin't no receipts in the streets, all sales, you know they final nigga\nSo if you lose some then it’s your loss\nIf you don’t way up then scale off, if you trap right it’ll pay off\n\n[Hook 1: Louie V Gutta]\n\n[Hook 2: Louie V Gutta]", "image": "https://images.genius.com/a0e5d4137e24ca9bb8d23cbf6a051f80.500x500x1.jpg"}], "artist": "Meek Mill"}