{"songs": [{"title": "Krazy Drazy (Das EFX), Do It All (Lords Of The Underground)", "album": null, "year": null, "lyrics": "[Intro: Nas] (Redhead Kingpin)\nAiyyo check it out y'all this is Nas, y'all know what I do to the business\n(Yeah! Uh!!!) I bring back the business (Nas you my dude for this B)\nAwww man y'all ain't ready (Straight check it)\nHere they are the remix, let's go\n\n[Verse 1: Redhead Kingpin]\nIt's Kingpin plus two I'm on the guestlist fam\nBut if this dude ain't like thirty he don't know who I am\nBoo boo my name, monetary gain is better than fame\nBut let's face it without the spotlight you thinkin Red is Eddie Kane\nIf I was drugs then I used to be a key\nNow I'm a couple ounce, on the come up hustle me\nYeah, and hip hop man ain't no 401K\nI got my MPC I'll see you one day\n\n[Verse 2: Rob Base]\n(\"Hit it!\") I'm still here, still flippin flows\nStill rippin shows, Rob Base let me get ill yo!\nIt's the O.G., (who?) R to the O-B\nB to the A-S-E, reppin N.Y.C\nI toured the country, since I dropped my first CD (what?)\n\"It Takes Two\", remember me?\nIf you don't it's the one that hit you with the WHOO YEAH\nUsed to make it so hot, you couldn't breathe the air\n\n[Verse 3: The Original Spinderella]\nAin't but too much for you to sweller\nHard body, fuckin wit a Coke bottle model\nAuburn, full back and observe\nWhile I BLAP BLAP to your nerves, uh! (OH!)\nI'm that Original, S-P twelve hunnid\nAnything y'all will do, Spin dunn done it\nThe baguettes, the Prada stilet's\nOn the turntables, call me Gillette\n\n[Verse 4: Father MC]\nYo! First of all big up to Nas the killer rip spitter\nThe Q.B. hitter called this Far Rock nigga\nYeah I'm drippin heavy from my head to my feet\nFrom the bars that I spit to my name on her cheeks\nCatch me on the mixtape, Bentley with the Queen draped\nPilot on deck G5 when I gotta skate\nLet you know when I'm out on the dough that shows I'm sellin them\nMy LP's drugs nigga be like runnin listen\n\n[Hook: Nas]\n(HEY!! Where are, where they nooooooow, huuuhhhhhooohhh HEY!)\n(*Awww man can you believe it it's like a holiday man)\n(*It's like Nas bringin a rap holiday man, ha ha ha, yeah)\n(Where are they now?)\n(HEY! Hit me! Where are they nooooooow?)\n(*Here they are , two thousand and seven they right here, yeah, they right here)\n\n[Verse 5: Monie Love]\nOne baby drop two to the three\nIs she out for the count UK mic deceased?\nYou never heard again from words not the least\nI checked first set net worth mic relief\nRemain calm more vowels spit battles\nAnd associate the kid when they hustlin up the cattle\nI don't care to give when they ride like a saddle\nHip Hop crowd well in doubt where are you now?\n\n[Verse 6: Mike G. from The Jungle Brothers]\nIt's the Jungle Brothers +housin+ with that fiiiiiive thousand\nBlowin up your project housin, Baby Bam Lee just bouncin\nMake me wanna crack a 40 ounce and, and straight get LOUD and\nChase her blouse and, turn her out\nCause I know we rockin party it's all about\nAiyyo cool calm collected and my name is Mike G\nAnd I'm reppin for Nas and my crew the J Beez!\n\n[Verse 7: EST from 3XDope]\nEight bars, ten stars, fuck five mics!\nI'm +The Source+ and the boss, show you what it's like\nTo play bad mitten at the top of your position\nWit a whole lotta niggas wouldn't play but it's written\nI'm the first to murk, chea! Representin Philly boy\nThe same kid that spit this wrote ?Baby Gram?\nNicholas one son the +Greatest Man+ livin\nTrue school be like e'ryday thanksgiving\n\n[Verse 8: Positive K]\nPos. K! Uh, uh, still spits this summer\nCame up like I hit the number, yeah y'all know me!\nI'm not a stranger to y'all in the orgies\nSqueeze ya dick up in ya in the ear as if ya for me\nI'm more \"primetime\" than Maury\nPlus I took ya to the \"Bridge\" like James Brown and Nas applaud me\nMy rhymes is suppository, it feels shit\nTop {?} watch Nemo then they watch the stories\n\n[Hook: Nas]\n(HEY!! Where are, where they nooooooow, huuuhhhhhooohhh HEY!)\n(*Yeah did you hear your favorite yet?)\n(*I know some of y'all buggin out, did you hear the dudes y'all used to like? the crazyness?)\n(Where are they now?)\n(HEY! Hit me! Where are they nooooooow?)\n(*The Original Spinderella, all that, awww man, I can't believe it yo, don't go nowhere)\n(*I got more!!! I got more!!!)\n\n[Verse 9: Krazy Drazy from Das EFX]\nMiggity +microphone check+, \"Where Are they Now\" Nas remix\nFeel how real Hip Hop needs this\nWish B.I.G, Pun, and Pac could see this\nDiggity Das-EFX piggity pioneers in this\nMade his kids just reminded y'all\nThrowback go back to the nineties y'all\nLook it up, hook it up, get the catalog\nWe your favorite rappers, rappers, rappin dog\n\n[Verse 10: Mr. Do It All from Lords Of The Underground]\nYeah I go Nas, Lord Do It All\nMe and you got something in common through Marley Marl\nBurst in the bricks, talked to buyin ?leather?\nGolden aged flows, you sound undiscovered\nI do this with a passion, spray-paint tag in\nHip Hop's alive, and I'm the breathing dragon\nOn the stage whylin, jumpin and laughin\nIt's Lords of the Underground and that's if you're askin!\n\n[Verse 11: Chip Fu from The Fu-Schickens]\nYo! I strip the booth anytime my lips move\nAnd it spews, my screws and they loose, I'm a move and it's proof\nNow give me two minutes I'm still wicked and still kickin it\nWith skills built and hot {?} you can't step in my shoes YO!!\nWhen I'm in the mood, when I'm in the booth and whenever when you\nI spit phantom in a boost you better just prepare to make room!\nNas give me eight bars, eight stars Escobar\nYo we rule, and we still ain't got nothin to prove, yo!\n\n[Verse 12: Dres from Black Sheep]\nFor the second I'm wreckin I got you double-checkin\nFor me to flash your big chain wheeler, shiny weapon, step in and holla\nI gotta hit the kids that shit Hip Hop\nThe wack gets spit lot, the man bullshit stop\nYo they call lot and I accept the invitation\nBut I not try and snitch upon my ?inclamation?\nOn the real God, I'm good, a brother been in mediation\nAnd my mind has been kenotic, kill the pres led a netion, Dres\n\n[Outro: Nas]\nAiyyo Chi Ali hold ya head up in the peniles\nThis your man Nas, here they are\nUnbelievable , Hip Hop is Dead\nLet's see what happens aight!!!", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}