{"songs": [{"title": "Still Here", "album": "Views", "year": "2016-04-29", "lyrics": "[Intro]\nDoin' well dog\nYeah, me and all my\nYeah, me—yeah\n\n[Hook]\nMe and all my niggas doin' well, doin' well, dog\nYou not from the city, I could tell, I could tell, dog\nDid it, did it, did it by myself, by myself, dog\nBlew up and I'm in the city still, I'm still here, dog\n\n[Verse 1]\nHow did I finesse all of this shit from Jane and Weston?\nGirls all in my bed and they don't trip off first impressions\nGirls all in your bed and they just ask a hundred questions\nI can't fuck with you no more cause you be actin' extra\nDo your favorite rapper like my son, like my son though\nNothing mutual about my funds, 'bout my funds though\nAll you niggas fightin' over crumbs, where the bread at?\nHow they feel about you where you're from, where yo bed at?\nI don't need no pill to speak my mind, I don't need that\nI make people pay me for my time, yeah, I need that\nAnd I see your girl like all the time, all the time though\nI can't tell you if she's yours or mine but I do know\n\n[Hook]\nMe and all my niggas doin' well, doin' well, dog\nYou not from the city, I could tell, I could tell, dog\nDid it, did it, did it by myself, by myself, dog\nBlew up and I'm in the city still, I'm still here, dog\n\n[Verse 2]\nOh and I'm back, dog\nOh, you just went and turned your back, dog\nI thought that we were family\nYou showed me that we can't be\nI gotta talk to God even though He isn't near me\nBased on what I got, it's hard to think that He don't hear me\nHittin' like that 30 on my jersey, man, I'm gifted\nWhole lot of sixes but I'm still like\nHallelujah, Hallelujah, Hallelujah\n6-point star, Lion of the Judah\nAll my niggas ain't off rockin' Gucci\nOne do it then we all gotta do it\nGot the key, now the doors open and we all goin' through it\nWhole city at your head for the boy\nI ain't even gotta call no one for it\n\n[Hook]\nMe and all my niggas doin' well, doin' well, dog\nYou not from the city, I could tell, I could tell, dog\nDid it, did it, did it by myself, by myself, dog\nBlew up and I'm in the city still, I'm still—\n\n[Outro]\nWow, all praise to the most high up...", "image": "https://images.genius.com/6f4b9c41ccb18485cccd6aa364ccc3b8.1000x1000x1.jpg"}], "artist": "Drake"}