{"songs": [{"title": "Instigator", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Hook: Swifty McVay]\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, take heed to the words I speak\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, 'til it hurts to breathe. Fuck with me\n\n[Verse 1: Kuniva]\nI love getting shit started. I instigate a peace talk\nInto a beef talk until police need chalk\nTo chalk you up. Have bitches walking up\nSmacking you in your face; screaming that you talk too much\nTell women you said you fucked 'em\nTell the hardest nigga you said you snuck him\nRan his pockets and stuck him\n'Til they gather in front of your crib, guns and long clips\nLaughing when they shoot at you over the wrong shit\nI lock down your block with lies that's so believable\nYou'll run and grab your shotguns, Glocks and nines\nWalking blind; excite fights until they erupt\nInstigate my own death 'cause killing you ain't enough\n\n[Verse 2: Swifty McVay]\nI don't give a fuck if we beefing or not: I'll squeeze first\nI'mma heat up your spot; I'm a nigga that breathe dirt\nOn these streets every day, snatching nigga's yay\nHow you bitches needing work, you can get it from McVay\nI'm just spiteful. I tie a ho; a maniacal foul animal\nLiable to leave you strapped with your bible\nI'm psycho; my bullets won't fly by you\nYou wanna kill me? You got the right to\nAin't gotta wait 'til night to snipe you: if I don't like you\nYou getting hit in broad daylight with a white rifle\nIn front of your window: I'm looking right through\nI love when I see a nigga get stuck\n\n[Hook: Swifty McVay]\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, take heed to the words I speak\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, 'til it hurts to breathe. Fuck with me\n\n[Verse 3: Kon Artis]\n(I'm an instigator) Drama tends to follow me, I know\nI probably owe all of my friends apologies\nLie to every bitch just to get her to swallow me\nGet a lobotomy; nigga, this one's to my arteries\nGuns are a part of me: I pack more than pottery\nI ought'a be jailed for depicted mockery\nEgg on fights to plot on the niggas that shot at me\nI don't twist the truth I just make it Gothic, see\nI'm nothing but a liar with a big-ass mouth\nDick and fists big enough to knock your bitch-ass out\nGot no reason to tell you the truth\nBut to be honest with you, I rap with him but I don't like Proof\n\n[Verse 4: Proof]\nNigga, fuck you. Me and Swift got plans to jump you\nType of nigga to shake your hand and stomp you\n(I'm an instigator) Convince a tenth-grader\nTo run up inside his classroom and leave the kids [sprayed up]\nBitch, straight-up. This is the season\nFor squeezing off triggers on niggas for no reason\nEither jump or quit running your mouth\nPull a gun out, better use it 'til the bullets run out\n\n[Hook: Swifty McVay]\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, take heed to the words I speak\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, 'til it hurts to breathe. Fuck with me\n\n[Verse 5: Swifty McVay]\nI throw a brick at your crib, have you standing on the porch Screaming \"Look what you did!\" I ain't feeling no remorse\nNigga, just pick up the kids. Swift got first dibs\nWith these cherry-hot slugs that'll barbecue your ribs\nI'm preparing deathbeds. Quick to bust lead\nWhile I'm staring at the Feds, tearing off they legs\nOnce you drop dead, they'll be swearing it's a plague\nI'm sicker than a coke Rastafarian with dreads\nYou get shanked if you move; ditched with no clues\nDopest shit on yo' tape was yo' skits and interludes\nAnd once I finish you, they wouldn't put it in the news\nI'm nuts, so you hoes ain't got the guts to interview\n\n[Hook: Swifty McVay]\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, take heed to the words I speak\n(I'm an instigator) Nigga, can't you see?\n(I'm an instigator) Ain't nobody worse than me\n(I'm an instigator) I'll be the first to beef\nFirst to squeeze, 'til it hurts to breathe. Fuck with me\n\n[Outro: Swifty McVay]\nI'm an instigator\nI'm an instigator\nI'm an instigator\nI'm an instigator\nI'm an instigator\nI'm an instigator\nI'm an instigator\nI'm an instigator\nI'm an instigator\nI'm an instigator", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}