{"songs": [{"title": "Put Your Hands Up", "album": "Violator: The Album V2.0", "year": null, "lyrics": "{We about to set this motherfucker off in here tonight!}\n{It be like da, da, da-da-da, da}\n{This that real shit dawg, real shit dawg.. c'mon, c'mon, come}\n{What you say?} Mr. Smith\n{Nigga, what you say?} I said my name is Mr. Smith\n{Yo, I want you to state the business}\n{You know what I want y'all to do?} Do your thing, do your thing, uhh\n\n[Chorus]\n{I said put your hands in the motherfuckin air - where?}\n{Put your hands in the motherfuckin air}\n{I know you like hoes} Yes {I know you got cars} Yes\n{I know you spit bars} Yes {I know you like stars}\n{But put your hands in the motherfuckin air - you hear me?}\n{Put your hands in the motherfuckin air - LADIES}\n{I know your nails done} Yes {I know your hair done} Yes\n{I know your toes done} Yes {I know you look good - bitch}\n{But put your hands in the motherfuckin air - right}\n{Put your hands in the motherfuckin air - c'mon, c'mon}\n{BITCH!} Uhh {BITCH!} Uhh uhh\n{BITCH!} Uhh {BITCH!} Uhh uhh\n\n[LL Cool J]\nPapi way too pimply to live this fast life simply\nPlease squeeze at them twin armored Bentleys, I love envy\nEvidently, the pesos made 'em resent me\nCause I clown on 'em, pull they broad gently, leave the bar empty\nI pimp Benzoes, you smell cherry air freshener\nLeather and indo, I cruise slow spit slick lingo\nYou might mingle with more stars than Ringo\nOn the beach in Santo Domingo lightin trees with singles\nBut I'm a mandingo I make your guts tingle\n'til your doorknockers jingle, stack chips like Pringles\nBall like the Bengals, spread love like Kris Kringle\nGet paid off the single, let them dollars co-mingle\nBaby, baby, deep dish is chrome, navy\nGray interior you feel inferior, it's crazy\nIt's over baby your vision's hazy they plantin daisies\nYou tried to play me but couldn't fade me that's why they pay me\n\n[Chorus] w/ minor variations\n\n[LL Cool J]\nSince I dropped \"I'm Bad\" I've been in Jags with nickle bags\nHoes I had give better blows than Felix Trinidad\nOne I had flew her Benz in from Baghdad\nWith personalized tags, chrome mags and Prada bags\nI refused to stab, now she cryin in the rehab\nWishin while reminiscin about all the sessions we had\nYou knew all the positions to keep me on a mission\nPut the Playstation 2 in your Limited Expedition\nYou're the mami I kept dipped, slept wit, crept wit\nOnce you got needy and greedy sweetie I flipped like a brick\nSharin my oochie spendin my chips\nLike I'm up in the Bricks politickin for new flicks\nOn the FreakNik tip, grabbin your phattie on the 6\nI ain't faded by them hips\nI split, just like Xzibit from Tha Liks (X)\nI got major bread to break\nRecipes for cake, keys to V's and estates, I'm straight\n\n[Chorus] w/ minor variations\n\n[LL Cool J]\nRide.. aww yeah, that's crazy\nE Mr. New York Knicks, B. Daltry\nViolators, \"Rock the Bells\"\nT Rhone, get money, Markee, we doin this\n{Violator, Violator 2, 2, we out - freeze!}", "image": "https://images.genius.com/7192c76005d4451007e0a80856d4c669.500x500x1.jpg"}], "artist": "LL Cool J"}