{"songs": [{"title": "Feelin’ So Sexy", "album": "Battle of the Sexes", "year": "2010-03-08", "lyrics": "{*phone rings twice*}\n[Ludacris] Hello?\n[Shawnna] Whassup?\n[Ludacris] What's up baby?\n[Shawnna] I need you right now\n[Ludacris] What you doin?\n\n[Hook: Shawnna + (Ludacris)]\nI'm all alone in my room, layin on my bed sheets\nCome undress me, I'm feelin so sexy\n(You feelin so sexy?) I'm feelin so sexy\nCome undress me, I'm feelin so sexy\nMy body's so tight and I'm needin you to stretch me\nCome undress me, I'm feelin so sexy\n(You feelin so sexy?) I'm feelin so sexy (ha ha)\nCome undress me, I'm feelin so sexy\n\n[Verse 1: Ludacris + (Shawnna)]\nWell I'm way over on the Southside cruisin in the 'llac\nBut I'mma make it to yo' crib in 'bout fo' minutes flat\nKeep talkin how you're talkin baby, what you got on?\n(I got a blace lace bra, leather boots and a thong)\nWell I'll be there in a double\nExpect when I step through the door that it's 'bout to be some muh'fuckin trouble\n(Ooh, what you gon' do?) Sweat you out 'til you thirsty\nPin your body to the ground and have you beggin for mercy\nOoh, baby wait a minute, you in my head\nIf I'm woke or if I'm dreamin I see you in my bed\n'Til you makin me MMM, and you makin me YEAH\nNow hurry up and make it to me cause you makin me wet\nI'm drivin fast as I can baby hold it together\nCause when I get you in my arms I'mma hold you forever\nGet you wet as Niagara Falls, a rebel with a cause\nI'll be breakin down the do' so tell me where you are\n\n[Hook: Shawnna + (Ludacris)]\nI'm all alone in my room, layin on my bed sheets\nCome undress me, I'm feelin so sexy\n(You feelin so sexy?) I'm feelin so sexy\nCome undress me, I'm feelin so sexy\nMy body's so tight and I'm needin you to stretch me\nCome undress me, I'm feelin so sexy\n(You feelin so sexy?) I'm feelin so sexy (ha ha)\nCome undress me, I'm feelin so sexy\n\n[Verse 2: Ludacris + Shawnna]\nSee, you got me eager as a beaver\nSee this the type shit get you the keys to the Beamer or some cheese if you need it\nCause you got that good-good; you love it how I beat it\nLike you stole it when you throw it cause we keep it hood-hood\nAnd I wish you would-would be my slave for the night\nWe could turn the bedroom into my cave for the night\nI'll be yo' favorite delight\nAnd make me call you daddy while I'm takin the pipe\nYou makin me bite after you push it too deep\nI need that type of lovin that'll put you to sleep\nI wish you could see\nWell I could see it if you want me to, we could get the camera\nWe could roleplay, you the artist I'll be your manager\nYou could be the nurse I'm the doc (doc fill me in)\nPlay \"cops and robbers\" or \"cowboys and Indians\"\nIn the end, let's say you won't know what hit ya\nNow I'm pullin in the driveway and comin to getcha!\n\n[Hook: Shawnna + (Ludacris)]\nI'm all alone in my room, layin on my bed sheets\nCome undress me, I'm feelin so sexy\n(You feelin so sexy?) I'm feelin so sexy\nCome undress me, I'm feelin so sexy\nMy body's so tight and I'm needin you to stretch me\nCome undress me, I'm feelin so sexy\n(You feelin so sexy?) I'm feelin so sexy (ha ha)\nCome undress me, I'm feelin so sexy\n\n{*door opens and closes*}\n[Shawnna] Hey baby\n[Ludacris] What's up?\n[Shawnna] Took you long enough\n[Ludacris] Yeah, I'mma make it worth the wait though, lay down\n[Shawnna] Yeah... {*moans*}\n[Ludacris] Mm-hmm, yeah", "image": "https://images.genius.com/05b5494c6b36a8d257cb2950d2d8896c.640x640x1.jpg"}], "artist": "Ludacris"}