{"songs": [{"title": "God’s Plan", "album": "The Return of the Dragon: The Abstract Went On Vacation", "year": null, "lyrics": "[Verse 1: Busta Rhymes]\nStep up in the spot, sizzle it to death\nAlways leave a mark like when the metal hit your flesh\nBlessed muhfucka, everything about me fresh\nEvery time we do this shit, we doing it to death\nWe getting money too, this shit don't make no kinda sense\n(Pop!) Make 'em run until they hop another fence\nWhen I'm in the building, niggas know I always got 'em and\nThe way we keep on winning, how the fuck you gon' stop' em?\nBitch my money long, thicker than a waffle\nY'all know how we do it, everything colossal\nThirty karat diamond pinky ring look like a marble\nI don't mean to startle, making bitches argue\nPut it in your mouth, stop the yapping, and gargle\nTake over the whole shit, never do it partial\nFucking up the building till they call a fire marshal\nDrop another classic, add a chapter to the novel\nPop a couple bottles, fuck a couple models\nRev it to the point where niggas bust open the throttle\nYou think you got a pot of gold? Got a couple potfuls\nCould give a fuck about your shine, bitch I got a watch full\n\n[Hook: Busta Rhymes]\nThem boys hot bitch, aw man\nMake sure the penthouse suite got a ceiling fan\nSee, when I win, it's like it's God's plan\nAnd when they see it, got these niggas saying \"God damn!\"\nShit changed nigga, chain hang nigga\nEvery time we drop, see how the shit bang nigga\nWe buzzing in the street until the shit sting nigga\nWe profit every time, that's why we rich, lame nigga\n\n[Verse 2: J-Doe]\nI'm bout my paper, I'm bout my dough\nI keep my watch face twenty below\nBitch it's only three things you need to know\nAll three is \"Can't no one fuck with J-Doe\", aye\nI'm getting moolah, I'm getting cash\nIf I say \"hi\" to her, she give up ass\nI got a Ruger, don't make me blast\nMy flow is too hot, why y'all listening to trash?\nAw yeah, I'm a beast lil nigga, off the leash lil nigga\nI just bought a car that you can't even lease lil nigga\nDon't reach lil nigga, just retreat lil nigga\nCause you looking like a muhfuckin' feast lil nigga\n\n[Hook]\n\n[Verse 3: O.T. Genasis]\nAye, okay, wrist look Rollie, charm look trophy\nTop three rappers: O.T., O.T., and O.T\n.45 on me so my shirt look pokey\nBuss that muthafucka till that barrel get smoky\nDiamonds Tropicana, got a bag like I am Santa\nIt's like 50 bitches wit' me and they all in my cabana\nFrom the West Coast where these niggas throw they sets and wave bandanas\nIf that's at your neighborhood, you will go nail down from the hammers, I\nRide through any nigga hood in them GTs\nNo Bloods, Pirus, CCs\nSelling Os, and I don't mean CDs\n360 diamond chain, Butterfinger BBs, yeah\n\n[Hook]", "image": "https://images.rapgenius.com/c56614f26b159de8e2ce892a4d54be4c.500x500x1.jpg"}], "artist": "Busta Rhymes"}