{"songs": [{"title": "Too Late (remix)", "album": "XiX", "year": "2016-09-25", "lyrics": "[Verse 1]\nI'm back, second take, hoping you patiently awake\nWhat I'm working on today, I know it's getting kinda late\nBut it's great, hold on, mate, what you doing, saying \"c\nI've been waiting for the crazy but it's looking like it's caged\"\nWhile you wait, I don't play, I've been working quietly\nI don't blame you if you hungry but I ain't a take away\nGotta wait, gotta wait, gotta wait\nEverybody looking at me like I quit and went away\nDamn, I'm getting everybody talking 19\nDrop it on my B-day, get a BJ and a wifey\nGetting 'em to replay so they hearing all the fire, b\nGet it, put it out like all the stuff I'm dropping, wow-e, AHH\nSwitching flows, gotta hop on a plane\nTravel from the UK to tour that USA\nWell, when I'm getting paid, you know I'll do it, ayy\nBut I ain't falling off, shouting out Donald's toupee, ayy\n\n[Hook]\nIt's too late, too late, oh\nYou're two-faced, two-faced, oh\nI hear you say the kid ain't the same, wha?\nAre you fucking insane, boy?\nDon't make me come up in your face, boy\nWhat a motherfucking waste boy\nAre you really tryna play with a killer on the throne\nKilling all that's in his way, boy?\n\n[Verse 2]\nBack to back, I'm killing tracks, I'll make you glad\nI'ma attack, \"You killing everybody, man\"\nShoutout to Matt, to Brad and everybody, man\nWhen I drop that tape, everybody wanna shake my hand\nToo bad, it's too late, I don't want you too\nLooking at me, I'm an expert, you a fucking novice, boo\nWhat am I to do if you come up and start that asking, you'll\nGet up out my face before I make you wish you fucking moved\nI'll start a fight club, Brad reputation\nGetting everybody bumping 'Ye, that's my occupation\nGetting everybody screaming \"c.\", that is what I'm saying\nAnd I'll give it just a couple years, I'll try to get them haters, yeah\nMaybe not, maybe get that golden ayy-claim\nAs you making golden claims, I've been wearing golden chain\nI've been wearing what you making in a year, for me: a day\nGetting lit, shoutout La Flame, watch the Birds, they fly away, ahh\n\n[Hook]\nIt's too late, too late, oh\nYou're two-faced, two-faced, oh\nI hear you say the kid ain't the same, wha?\nAre you fucking insane, boy?\nDon't make me come up in your face, boy\nWhat a motherfucking waste boy\nAre you really tryna play with a killer on the throne\nKilling all that's in his way, boy?", "image": "https://images.genius.com/8c9f4f64bf1e30735dab1ce67b9fa5e6.1000x1000x1.jpg"}], "artist": "Kid Cudi"}