{"songs": [{"title": "Act A Fool", "album": "Misdemeanor", "year": null, "lyrics": "[Intro]\nThis is, an exclusive\nSuckas...\nLet's go!\n\n[Verse 1]\nWe don't stop till we done with it, done with it\nWe gon' come and have fun with it, fun with it\nTonight we goin' ghetto, whaaat!\nGet a drink-drink in our cups\nGo ahead let me see that donkey\nWatch me I'ma show my monkey\nSay we gon' turn that party down, we gon' turn that party down\nLet me see all the ladies with the real hair\nLet me see all the ladies with the fake hair\nIt don't matter if you're short or taller\nHands up if you're looking for a baller\nHands up if you're looking for a baller\nShow your number payboy gonna call her\nCause You got that, and we want that\nDat, dat, dat, dat, dat, dat, dat, dat, dat\n\n[Chorus]\nTonight we find that, act a fool\nGive up while I'm all on you\nLike when you touch all my body\nLike when you touch all my body (yeah!)\nCome and dance with me tonight\nPromise I got what you like\nLike when you touch all my body\nBu, bu, bu, bu, bu body (c'mon)\n\n[Verse 2]\nHey shorty where you live (L.A!)\nHey shorty where you from (V.A!)\nWhere da get it crack, cracking (New York!)\nWhere to get it pop, poppin' (D.C!)\nMiami, Orleans, Atlanta, wave your bandannas, hey\nWe be flossing everyday\nWe be flossing everyday\nWell this one for my fellas in the whips\nDrop top sounds system in the whips\nFor when ya down go turn it up\nBoom, boom, boom let it thump in the truck\nWe gon get drunk till we bend out the slums\nSee the girls moving they lump diddy lumps\nPop that, pop that, we gone rock that\nMr. DJ, could you bring the hook back\n\n[Chorus]\nTonight we find that, act a fool\nGive up while I'm all on you\nLike when you touch all my body\nLike when you touch all my body\nCome and dance with me tonight\nPromise I got what you like\nLike when you touch all my body\nBu, bu, bu, bu, bu body (woop woop)\n\n[Verse 3]\nPull over, my ass to fat\nYour bitch wanna be like me, too bad\nCan't be me i'm supa dupa\nBet a 100 dollars, ain't a bitch cuter\nBet a 100 dollars, ain't a bitch cuter\nBet a 100 dollars, ain't a bitch cuter\nWe gon turn that party down\nWe gon turn that party down. (let's go!)\nTonight we gon turn the party down\nLadies squat down, turn around\nWe gon show you how to do the duck walk\nWalk that walk, gon' talk that talk\nDusk till dark we gon let the blunt spark\nLet the blunt spark till dusk till dark\nWe gon, we gon, light it up\nWe gon, we gon, light it up. (yes!)\n\n[Chorus]\nTonight we find that, act a fool\nGive up while I'm all on you\nLike when you touch all my body\nLike when you touch all my body\nCome and dance with me tonight\nPromise I got what you like\nLike when you touch all my body\nBu, bu, bu, bu, bu body", "image": "https://images.genius.com/c25e550800143af9c466d14c80419c09.300x300x1.jpg"}], "artist": "Missy Elliott"}