{"songs": [{"title": "Rap God (Traduzione Italiana)", "album": null, "year": "2013-11-05", "lyrics": "[Intro]\n\"Guarda, stavo per andarci leggero con te e non ferire i tuoi sentimenti\"\n\"Ma coglierò quest'occasione e basta.\"\n\"Qualcosa non va lo sento.\"\nSei minuti. Sei minuti. Sei minuti, Slim Shady, sei in onda!\n\"Solo un sentore che ho. Tipo che sta per succedere qualcosa, ma non so cosa. Se significa quello che penso significa siamo nei guai, grossi guai; e se è cosi pazzo come dici, non rischierò nulla.\"\n\"Sei solo quello che il doc ha ordinato\n\n[Chorus]\nSto cominciando a sentirmi come un Rap God, Rap God\nTutti i miei fan dal fronte al retro annuiscono, annuiscono\nOra, chi pensa che le loro braccia siano abbastanza lunghe per fare a ceffoni, ceffoni\nDicono che rappo come un robot, quindi chiamami Rap-bot\n\n[Verse 1]\nMa per me rappare come un computer deve essere nei miei geni\nHo un portatile nella mia tasca posteriore\nLa mia penna esploderà quando lo impugno\nHo un grosso legame con il profitto del rap\nCi ho fatto i soldi per una vita  e un casino sopra\nSin da quando Clinton era ancora presidente\nCon Monica Lewinski che gli leccava lo scroto\nSono un MC onesto come allora\nSillabe, Abilista (Abile + Alcolista) (Uccidi tutti con queste)\nQuesto hip hop innovativo, cattivo, esplicito\nNon vuoi davvero fare a gare a chi piscia più lontano\nCon questa canaglia del rap, che porta un MAC nel retro di un' Ac'\nImpacchetta il rap di merda, chiacchiera, parla\nE allo stesso identico momento in cui provo questi esercizi lirici acrobatici\nSarò ancora in grado di rompere un fottuto tavolo\nDietro a una coppia di froci e a romperlo a metà\nSolo io ho capito che ero ironico, ho firmato all'Aftermath dopo l'evento\nCome potevo non sfondare? Tutto quello che faccio sono bombe-F\nSentite la mia ira dell'attacco\nI rapper stanno avendo un periodo duro, ecco un'assorbente enorme\nÈ proprio disastrosamente pessimo per gli scarsi\nMentre sto costruendo questo capolavoro con maestria\n\n[Chorus]\nSto cominciando a sentirmi come un Rap God, Rap God\nTutti i miei fan dal fronte al retro annuiscono, annuiscono\nOra, chi pensa che le loro braccia siano abbastanza lunghe per fare a ceffoni, ceffoni\nDicono che rappo come un robot, quindi chiamami Rap-bot\n\n[Verse 2]\nTutti quanti vogliono la chiave ed il segreto per l'immortalità nel rap che ho. Beh, per essere veritieri il metodo è\nSemplicente rabbia ed esuberanza giovanile\nTutti quanti amano tifare per una seccatura\nHo colpito la Terra come un'asteroide\nDa allora non ho fatto altro che mirare alla luna (Pew!)\nGli MC vanno a scuola con questa musica\nPerchè la uso come veicolo per \"spostare la rima\"\nOra guido una nuova scuola piena di studenti\nIo? Sono un prodotto di Rakim\nLakim Shabazz, 2Pac, N.W.A, Cube, hey Doc, Ren\nYella,Eazy, grazie, hanno creato Slim\nMi hanno ispirato abbastanza per crescere, un giorno sfondare ed essere nella posizione\nDi incontrare Run-D.M.C., invitarli nella fottuta Hall of Fame del Rock and Roll\nAnche se entrerò in chiesa ed esploderò in una palla di fiamme\nL'unica Hall of Fame in cui entrerò sarà l'alcol of fame\nSopra il muro della vergogna\nVoi froci pensati che sia tutto un gioco\nVoi froci pensate che sia tutto un gioco, fino a che cammino su un mare di fuoco\nSopra una tavola, e ditemi a che cazzo state pensando?\nPiccolo ragazzino che sembra gay\nCosì gay che a malapena riesco a dirlo senza ridere, bel ragazzino\nStai assistendo ad un massacro\nCome se guardassi una messa svolgersi, bel ragazzino\n\"Oh ehy, quel ragazzo è gay!\"- è tutto quello che dicono, bel ragazzino\nTi prendi un pollice in su, una pacca sulla spalla\nE un \"vai così\" dalla tua etichetta ogni giorno, bel ragazzino\nHey bel ragazzino! Che dici bel ragazzino?\nHo preso un \"Hell yeah\" da Dre, bel ragazzino\nLavorerò per tutto quello che ho, non chiederò mai un cazzo a nessuno\nSparisci dalla mia vista, bel ragazzino!\nPraticamente, ragazzo, non sarai mai capace\nDi tenere lo stesso mio ritmo, bel ragazzino, perchè\n\n[Chorus]\nSto cominciando a sentirmi come un Rap God, Rap God\nTutti i miei fan dal fronte al retro annuiscono, annuiscono\nIl modo in cui corro attorno a questa traccia, chiamami NASCAR, NASCAR\nDale Earnhardt nel campo delle roulotte, Il bianco Dio del teash\nInginocchiati davanti al generale Zod\nQuesto pianeta è Krypton-no, Asgard, Asgard\n\n[Verse 3]\nQuindi tu sarai Thor e io sarò Odino\nTu arrogante, io onnipotente\nSmetto, dopo ricarico\nImmediatamente con queste bombe, sto mirando\nE non dovrei essere risvegliato\nSono la morte che cammina, ma solo una testa parlante, uno zombie fluttuante\nMa ho tua mamma che mi succhia il cazzo\nSono fuori dal mio Noodle Ramen\nNon abbiamo niente in comune, fallito\nSono un Doberman, datti un pizzico sul braccio e mostra rispetto, allievo\nSono io, la mia onestà è brutale\nMa onestamente è inutile, se non utilizzo che faccio perciò\nAlmeno una volta ogni tanto\nVoglio essere sicura cho da qualche parte nei miei scarabocchi da gallina, io faccia abbastanza rime nei miei sgorbi e scarabocchi da poter provare e aiutare qualcuno a superare brutti momenti\nMa devo tenermi alcune battute finali perchè anche voi rapper senza contratto\nSiete affamati, guardatemi, sono il vostro pranzo\nLo so che c’è stato un tempo in cui sono stato il re\nDell’ underground , ma faccio ancora rap, sono il goal  Pharoahe Monch\nPerciò io mastico rime, ma qualche volta, quando mescoli\nAttrazione con il colore della mia pelle\nDiventi troppo potente e eccoli qui loro che provano a censurarti\nCome quella rima che io ho scritto in “I’m Back” di Mathers L.P\nDove io provo a dire che prendo 7 bambini dalla Columbine\nLi metto tutto in liena, aggiungo un AK-47 , un revolver, una nove millimetri\nVedi, se riesco a farla franca ora con questa rima che non sono così grande come ero\nMa mi sono trasformato in un essere immortale che viene da un portale\nMa tu sei rimasto fermo nello spazio temporale del 2004, credo\nE non so per quale cazzo di motivo rimi a fare\nTu sei senza senso come Rapulzel senza quelle fottute treccine\nTu sei tipo normale, fanculo essere normale\nE io ho appena comprato una nuova pistola a raggi X dal futuro\nSolamente per venire e a spararti  come quando Fabolous  ha fatto incazzare Ray J\nPerché Fab ha detto che lui sembrava un frocio nel suo appartamento in Mayweather\nCantando ad un uomo mentre suonano il piano\nAmico, oh, amico, quello fu uno speciale di 24 su 24, 7 giorni su 7  in una canale via cavo\nE allora Ray J  andò dritto alla radio il giorno dopo\n“Hey, Fab, ti ammazzo!”\nLe rime ti arriveranno troppo veloci ora\nUh, sama lamaa,dumaa, lamaa tu credi che io sia un essere umano\nQuello che sto cercando di farti capire è che io sono un supereroe\nOriginale, sono stato creato dalla gomma\nPerciò tutto quello che tu mi dici mi rimbalza contro e diventerà colla per te\nSono devastante, di più di quello che ho dimostrato\nCome dare una fottuta audience  la sensazione che stiano lievitando\nNon declina mai, e lo so che gli Haters aspetteranno per sempre\nIl giorno che loro potranno dire che io sono crollato, celebreranno\nPerché io so che il modo per motivarli\nIo faccio musica per sollevarti, tu fai la musica per gli ascensori\nOh, lui è così di tendenza\nBeh, questo è quello che dicono quando diventando gelosi, si confondono\nNon è hip hop, è pop, perché ho trovato il giusto modo per fonderli\nCon il rock, shock rap con il Dottore\nHo tirato fuori “lose yourself” e li ho fatti perdere (nella musica)\nNon so come fare canzoni così\nNon so quale parole usare\nLascia che ti spieghi come possa accadere questo a te\nMentre sto rappando tutti questi versi, contro di te\nFa male, ti sto inavvertitamente facendo male\nQuanti versi devo uccidere per provarlo\nChe tu sei alquanto carino nelle tue canzoni, puoi sacrificare le vergini\nBocciato a scuola, pillola dipendete\nMa guarda quanti grammy la mi attitudine mi ha portato\nSono pieno di me stesso, ma sempre affamato\nMi costringo a fare ciò che voglio fare\nSono mille volte sopra di te, malato quando parlo diverso lingue\nCosì ubriaco che Satana ha preso il timone, mi sono addormentato nel sedile\nAscoltando Heavy D e Boys, ancora potente ma funky\nMa nella mia testa c’è qualcosa che sento  che mi strattona e lotta\nAngeli che lottano con i diavoli e ecco cosa vogliono da me\nMi chiedono di eliminare alcune delle donne che io odio\nMa se prendi in considerazione l’amaro disprezzo che io ho avuto\nAllora tu potrai essere un pochino paziente e più comprensivo per la situazione\nE riusciresti a capire le discriminazioni\nMa fanculo, la vita ti sta dando limoni, allora fai le limonate\nMa se io non posso comportarmi meglio con le donne, come cazzo posso  cucinare a loro una torta allora?\nNon confondermi per Satana\nÈ un errore fatale se tu pensi che io abbia bisogno di uno sconosciuto per\nPrendere una vacanza  per viaggiare in giro\nE farla colpire nella sua stessa faccia , e non essere un ritardato\nEssere un re? Credo di no, per quale motivo essere un Re quando puoi essere Dio?", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}