{"songs": [{"title": "The Struggle Continues", "album": "The Beautiful Mixtape Vol. 2: The Struggle Continues", "year": null, "lyrics": "[Talib Kweli]\nYeah... yeah... let's take it there\nYou know what the struggle is? (What is it?)\nIt's beautiful! (Oh yeah, c'mon)\nIt's not an oxymoron, means the same thing\n\nBeautiful!\n\nLike the passion of sex when you don't have to get protection\nAnd the seed is fertilized it's an immaculate conception\nAnd it grow into a fetus crying like priests having confession\nBaby coming out the womb packing and blasting a weapon\nFor the struggle to show, I let my scars keloid and bubble\nKeep it popping all you toys[?] is in trouble\nI'm all city, the benjis is all gritty, my pennies is all pretty\nIf you believe in making change and progress then walk with me\nLet me show you a bigger picture (Yeah)\nSpit kicker never spit the poison like the liquor\nThat's filling up your nigga liver\nIt's more like the herbal medicine - purple lettuce and orange hair\nI inhale yesterday's breath and blow out tomorrow's air\nI'm taking the throne\nInstead of creating a poem\nI'm making a song\nThese niggas is happy with just making a clone\nSo my rhymes turn these wack emcee's faces into stone\nLike they just saw Medusa with them snakes in the dome... Rashid\n\n[Common]\nOne man rises another falls\nTo discover all is one and one is all\nI come to call like Jericho with the trumpets\nIt's wild in the hundreds\nGramps in the choir hummin'\nThe Lord soon cometh\nFrom blow some grow, many stay stunted\nTalks with the shorties knowing, I learn from it\nKeep the dumb shit from my circumference\nI run with niggas that want it and done it\nThe hunted and blunted (It's beautiful!)\nL said it gotta come from the stomach\nTo me the stomach is the voice of the Lord\nThe revolutionary people's choice the award\nSeeing souls move forward\nGoals move toward new homes and new floors\nFor us to rise to, in the attic taping up my bible\nThinking how can I apply it to survival?\nThe un-American idol, seeing vital signs of the times\nI put it in my rhymes it's the beautiful struggle\n\n[David Banner]\nI came here to curse the states, like \"Fuck You!\"\nI kill for my sons with guns, like I'm John Q\nNow get celled[?] in hell, the Buddha-blessed smoke\nEndorsed by the DLs, Crips, Bloods and Folks\nIf I have to, I'll throw myself on the cross\nMy souls lost, fuck it man, Jesus paid the cost\nSo I guess I'll tell a racist cracker go and lay it down\nIf I die, I die high, blowing on a pound\nIf you die, you die twice, a neck full of ice\nI'm hellbound on trying to save black kids' life\nBut my Tribe, left a nigga on a Quest like Phife or Jerobi\nWhite bitches scream like Kobe\nBut you would never know me or what I went through\nThat's why I'm quick to say \"Suck a dick, bitch, and fuck you!\"\nAnd I'ma tell the white kids the truth:\nThey dads raped mine, now what the fuck they gon' do?! (YEAH)", "image": "https://images.genius.com/77b2cb0937e1d9604da173026219d5ac.705x706x1.jpg"}], "artist": "Talib Kweli"}