{"songs": [{"title": "Ride wit Me", "album": "Country Grammar", "year": "2000-06-27", "lyrics": "[Intro: Nelly]\nWhere they at? Where they at?\nWhere they at? Where they at?\nWhere they at? Where they at?\nWhere they at? Where they at?\nCome on, now\n\n[Chorus: Nelly]\nIf you want to go and take a ride with me\nWe 3-wheeling in the fo' with the gold D's\nOh, why do I live this way?\n(Hey, must be the money!)\nIf you want to go and get high with me\nSmoke a L in the back of the Benz-E\nOh, why must I feel this way?\n(Hey, must be the money!)\n\n[Verse 1: Nelly]\nIn the club on the late night, feeling right\nLooking, trying to spot something real nice\nLooking for a little shorty I noticed so that I can take home\n(I can take home) She can be\n18 (18) with an attitude\nOr 19, kinda snotty, acting real rude\nBut as long as you a thicy-thicy-thic girl you know that it's on\n(You know that it's on) I peep something\nComing towards me on the dance floor, sexy and real slow\nSaying she was peeping and I dig the last video\n\"So when Nelly, can we go?\" How could I tell her no?\nHer measurements was 36-25-34, tell it\nI like the way you brush your hair\nAnd I like those stylish clothes you wear\nI like the way the light hit the ice and glare\nAnd I can see you, boo, from way over there\n\n[Chorus: Nelly]\nIf you want to go and take a ride with me\nWe 3-wheeling in the fo' with the gold D's\nOh, why do I live this way?\n(Hey, must be the money!)\nIf you want to go and get high with me\nSmoke a L in the back of the Benz-E\nOh, why must I feel this way?\n(Hey, must be the money!)\n\n[Verse 2: Nelly]\nFace and body Frontenac, don't know how to act\nWithout no vouchers on her boots she's bringing nothing back\nYou should feel the impact, shop on plastic\nWhen the sky's the limit and them haters can't get past that\nWatch me as I gas that 4 dot 6 Range\nWatch the candy paint change, every time I switch lanes\nIt feel strange now, making a living off my brain\nInstead of 'caine now, I got the title from my\nMomma put the whip in my own name now, damn shit done\nChanged now, running credit checks with no shame now\nI feel the fame now (come on), I can't complain now (no more)\nShit I'm the mayne now, in and out my own town\nI'm getting pages out of New Jersey from Courtney B\nTelling me about a party up in NYC\nAnd can I make it? Damn right, I be on the next flight\nPaying cash; first class - sitting next to Vanna White, c'mon\n\n[Chorus: Nelly]\nIf you want to go and take a ride with me\nWe 3-wheeling in the fo' with the gold D's\nOh, why do I live this way?\n(Hey, must be the money!)\nIf you want to go and get high with me\nSmoke a L in the back of the Benz-E\nOh, why must I feel this way?\n(Hey, must be the money!)\nIf you want to go and take a ride with me\nWe 3-wheeling in the fo' with the gold D's\nOh, why do I live this way?\n(Hey, must be the money!)\nIf you want to go and get high with me\nSmoke a L in the back of the Benz-E\nOh, why must I feel this way?\n(Hey, must be the money!)\n\n[Bridge: Nelly]\nCheck, check, yo\nI know something you don't know\nAnd I've got something to tell ya\nYou won’t believe how many people straight doubted the flow\nMost said that I was a failure\nBut now the same motherfuckers asking me for dough\nAnd I'm yelling: \"I can't help ya\"\n\"But Nelly can we get tickets to the next show?\"\nHell no (what's witchyou?!) you for real?!\n\n[Verse 3: City Spud]\nHey yo, now that I'm a fly guy, and I fly high\nNiggas want to know why, why I fly by\nBut yo, it's all good, Range Rover all wood\nDo me like you should, fuck me good, suck me good\nWe be them stud niggas, \"wishing you was\" niggas\nPopping like we drug dealers, sipping Chrissy, bubb' macking\nHoney in the club, me in the Benz\nIcy grip, telling me to leave with you and your friends\nSo if shorty wanna... knock, we knocking to this\nAnd if shorty wanna... rock, we rocking to this\nAnd if shorty wanna... pop, we popping the Crist'\nShorty wanna see the ice, then I ice the wrist\nCity talk, Nelly listen; Nelly talk, city listen\nWhen I fuck fly bitches; when I walk pay attention\nSee the ice and the glist'; niggas staring or they diss\nHonies looking all \"they wish,\" come on boo, gimme kiss, c'mon\n\n[Chorus: Nelly]\nIf you want to go and take a ride with me\nWe 3-wheeling in the fo' with the gold D's\nOh, why do I live this way?\n(Hey, must be the money!)\nIf you want to go and get high with me\nSmoke a L in the back of the Benz-E\nOh, why must I feel this way?\n(Hey, must be the money!)\nIf you want to go and take a ride with me\nWe 3-wheeling in the fo' with the gold D's\nOh, why do I live this way?\n(Hey, must be the money!)\nIf you want to go and get high with me\nSmoke a L in the back of the Benz-E\nOh, why must I feel this way?\n(Hey, must be the money!)\nHey, must be the money!\nHey, must be the money!\nHey, must be the money!\nMust be the money!\nIf you want to go and take a ride with me\nWe 3-wheeling in the fo' with the gold D's\nOh, why do I live this way?\n(Hey, must be the money!)\nIf you want to go and get high with me\nSmoke a L in the back of the Benz-E\nOh, why must I feel this way?", "image": "https://images.genius.com/1291df1aa36eade0d20f53e79a7e667a.366x327x1.jpg"}], "artist": "Nelly"}