{"songs": [{"title": "Intro (Dreamchasers)", "album": "Dreamchasers", "year": "2011-08-11", "lyrics": "[Intro: DJ Drama]\nYou see\nWe dream chase cause that's all we was given to start with\nThen we realized the dream was obtainable\nNow look at us\n\n[Verse 1: Meek Mill]\nCounting money all I seem to hear is Benji talking\nHater we ain't conversatin' it's just semis talking\nUsed to be the boy\nThey said they have a penny on 'em\nNow I walk around with twenty chains with like a milli on em\nLace up my boots, put on my strap\nAnd go lookin' for that paper I'm like \"where it's at?\"\nThey lookin' at, I'm staring back (I see you)\nFeelin' like I'm superman\nEvery time I wear this mac\nMonday, it's probably 106 & park\nTuesday, probably in the hood where it get dark\nWednesday, Probably catch me swimming with the sharks\nWith blood dripping from my shoes, these Loub's cooler than my heart\n\n[Break: DJ Drama]\nSee dream chasing is an occupation\nThose with the job understand the process of manifestation\nYour dream starts as a thought\nThen its nurtured, achieved, and sustained\nThen we go back into our minds for more\n\n[Verse 2: Meek Mill]\nLet me out my cell, right back on the mission\nFresh from off a bail, right back in the kitchen\nWho the fuck gon' pay my lawyer\nI got booked with this Sig Sawyer\nAnd like eighty grams of crack\nHe said the feds probably come for ya\nI'm like \"oh lord!\"\nCopper said I tried to kill em when I go to court\nI hope they dont find me guilty, it's my word against they word\nAnd I won't get a chance to speak\nI caught my case with nine of my niggas, and I'm the only one they beat\nI took it for the team\nEven though I had a dream like Martin Luther King\nWho thought that I'd be cover of these magazines\nCause I be spitting fire flow, I'm kerosene\nLemme talk to em\nFuck y'all niggas gon' say about me?\nMy North niggas they don't play about me\nSouth Philly niggas that'll spray about me\nPay q million dollar bail in a day about me\nAin't gotta sound real, cause they'll tell you that\nI'm on the top floor, I started where the cellar at\nSelf Made, bitches\n\n[Outro: DJ Drama]\nI had a dream one time\nIt was, I was gonna make a lotta money doing what I wanted to do\nI went after it and it was a struggle to achieve\nBut you know what?\nI caught that bitch!\nDreamchasers!\nThis is where dreams become reality", "image": "https://images.genius.com/444ab187fd5c557d6d65efc6fb8931ea.320x320x1.jpg"}], "artist": "Meek Mill"}