{"songs": [{"title": "Bobby Did It (Spanish Fly)", "album": "Bobby Digital in Stereo", "year": "1998-11-24", "lyrics": "[Intro: Islord]\nAiyyo, let me tell y'all niggas somethin'\nOne thing, let me tell y'all niggas somethin'\nI don't give a, flyin' fuck about\nNone of y'all niggas out here\nNone of y'all niggas out here\nCause you ain't, none of my motherfuckin' comrades\nI don't give a, flyin' fuck, what?\nYou want it? Bring it son, bring it son\nBring it, yo, check it on out\n\n[Ndira: talking over Islord above]\nBobby, como puede ser que me jodistes?\nHijo de puta\n[?] el coño de mi, maricon\nY nunca me llamas, Roberto\nYou treat me like an analog ho\n\n[Verse 1: Islord]\nYo, lyrically, I got all y'all niggas under my wing\nCause I bring terror throughout this rap era\nLike them Muslim cats, who don't give a fuck\nAbout blowin' this rock, off the map\nWhere Mayor Guiliani rest at, so let me get that\nMicrophone up off of you, cause it's\nDefinitely not meant for you to have it in your palm\nTo try to rock the crowd\nPuttin' it all on to stay calm\nYou waited for the God Islord to drop the bomb\nAnd swarm the stage about a hundred fat\nWith lyrical material that's all that\nLike a two point five carat clustered jew-el\nRock like Patti La-Belle\nCause everything is real kid, you dead up\nDissect the true kids gettin' set up\nFor a car/Jeep heist, it ain't nice\nAs we ran up in the crib and stuck the kid\nAnd smacked the wife, cause she, had on two chains\nWith a tray full of ice in 'em\nBut that's how it goes down when you livin in the Cold World\n\n[Interlude: Timbo King]\nCold World, what?\n\n[Hook: Ndira]\nTodo lo que a ti te gustas es music pa' lo puta\n\n[Verse 2: Timbo King]\nYo, I spit flames thermonuclear type\nIgnite mics, blow up U.S.A. satellites\nInsane Unabomber, my whole fam lace golden armor\nRoyal calmer, black queen black Madonna\nThe missing link be the big lips on the Sphinx\nIntelligent instincts\nI say knowledge is the foundation\nWhen I move in the L's formation, against Hell's nation\nBobby Digital cybertech test micro-check\nHigh bias, record the levels\nAnti four devils, anti four devils\n\n[Bridge: Ndira]\nBobby, como puede ser que me jodistes?\nHijo de puta\n? el coño de mi, maricon\nY nunca me llamas\nMe tratas like an analog ho, Roberto\nNadie te importa, cariño\nI wanna be Digital Bobby\nBobby Digital\nRZA me advertio de Bobby\nBobby Digital\n\n[Verse 3: Bobby Digital]\nAll you analog cats from weak tracks and weak raps\nAnd weak video clips and weak stacks\nWeak bitches with weak lawyers and weak acts\nAnd weak staffs, born life couldn't copyright\nWith weak math, come get a dose of the strong\nCoconuts splittin', all you chocolate deluxe butter alms\nFrench buttercups probably wanna see Bobby in handcuffs\nWith the toes in my mouth\nStand up or rape me, rotate auto-locate me\nIn the center solar\nCorner block Hip-Hop now expand to the polar\nFuzzy low short frequency\nCircuit breakers, try to take\nUs on illusionary rides to the future\nPolygram graphic rap actors, flash ya\nCash and jewelry like bus passes\nThat's why your ass got stuck up\nSo wake the fuck up or get smoked\nAnalog rhymes hoes are like groupies we fucked\nTook for derelict, sales are too soupy\nBetter get the Bobby Digital movie!\n\n[Hook: Ndira]\nTodo lo que a ti te gustas es music pa' lo puta\n\n[Verse 4: Ghostface Killah]\nTarantula, that groove season\nNewlywed of rap, which G you believe in?\nRally back, twist a half a man arm off\nLate night, nearly happy standoff\nHow boldly blinded by Bobby crossthievin' van diva\nLever 2000 mic talk, might bolt to match\nPinch me in the eve carved perfectly from God\nManufactured through the eye, same Puma dash\nI snares Dumar, Nicolas, half a face, Cage\nHalf a coke Dutch sprinkle sage\nBounce to Huey crib yo and got laid\nStraight off the ground y'all word up\n…Bad bitch\n\n[Verse 5: Jamie Sommers]\nYo, yo, yo my tapdance sword splash\nYo.. my nigga Dix'll leave you whiplashed, feel the cash\nPussy worth a key a stash, bloodbath\nHard to walk the righteous path\nFlavor for life into death, this berry tart your ginger\nOoh she mad tender, analog surrender\nOff my motherfuckin' splendor, Jamie Sommers pussy bionic\nSupersonic, splash you with the Wu-Wear garments\nFor the 9 fuckin' 9, motherfuckers\n\n[Hook x2: Ndira]\nTodo lo que a ti te gustas es music pa' lo puta\n\n[Outro: Jaime Sommers]\nBobby, all you ever want is weed, money, music and pussy", "image": "https://images.genius.com/10f833f6fa5be4455d32a441346e0086.431x431x1.jpg"}], "artist": "RZA"}