{"songs": [{"title": "Take Me Away", "album": "Raw Footage", "year": "2008-08-19", "lyrics": "[Ice Cube]\nHahaha, today was a good day\nKnow what?, sometimes I just get on my knees\nYou know what I mean?\nAnd pray to the man with the master plan\nTo swoop on down (swoop on down)\nOn that mothership, scoop a nigga up...\n\nLord have mercy, my people so thirsty\nCome feed 'em, either Jesus or Muhammad\nAll we get is vomit, come like a comet\nPut it in my brain Lord, put it in my stomach\nOnly you can run it, I'mma learn from it\nDo what I gotta do, try not to plummet\nAmerica eats its youth like reptiles\nDon't worry bout tomorrow, let's get this right now\nThey want to run us in the ground\nEducate yourself before they dumb you down\nGet your money boy, the legal way\nBeat 'em with they own bullshit if you may\nNow rich white men they got the world fucked up\nWhy should I give a fuck about a styrofoam cup?\nEnvironmental scene, I'll keep it clean\nBut if I go green, you know what I mean, bitch\n\n[Hook]\nTake me away from these people\nTake me away from these people\n(Take me away)\nTake me away from these people\nTake me away from these people\n\n[Ice Cube]\nIce Cube for President\nLet's just do it for the hell of it\nSee how I'd run the government - make money irrelevant\nI might tell a chick, it's illegal to be celibate\nSecret Service don't know where the hell I went\nSorry y'all, I had to fuck a Superdelegate\nDream ticket, Ice Cube and Obama\nAmerican dream, Ice Cube and yo' mama\nThe Terminator, are you Sarah Connor?\nArnold Schwarzenegger, can kill who he wanna?\nIn California, they strap you to a gurney\nAnd murder yo' ass, in front of your attorney\nDo you really wanna take this journey?\nAin't scared of none of y'all motherfuckers like Bernie\nMac (step back) Step back, I got the Mac-11\nUnlike Obama, I'mma have to back my reverand\n\n[Hook]\nTake me away from these people\nTake me away from these people\n(Take me away)\nTake me away from these people\nTake me away from these people\n\n[Ice Cube]\nNow the Lord is my shepherd, my flow is respected\nWorldwide, from the West I got to rep it\nSo please check it, cause my style is infected\nWith the virus, Ice Cube's the Osiris\nI bail through, they wanna put me up in Bellevue\nCause my point of view is not red, white and blue\nIt's black and blue residue\nI know what crack can do, to a whole fuckin' avenue\nSpeak on it and they'll get mad at you\nYou think I do this bullshit for your gratitude?\nI'm a Nigga With a Attitude\nI'mma do what I gotta do just to change my latitude\nPimp the system, rollin' with my diamonds glistenin'\nAnd niggas listenin', from your local prison\nI'm a prism, your only vision is a rainbow\nIn the sky when I spit the ism, come on\n\n[Hook]\nTake me away from these people\n(Take me away)\nTake me away from these people\n(Take me away)\nTake me away from these people\n(Take me away)\nTake me away from these people", "image": "https://images.genius.com/284f4145950de6c7f91a598379e2bb40.1000x1000x1.jpg"}], "artist": "Ice Cube"}