{"songs": [{"title": "Desperation", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Verse 1: Eminem]\nGirl, you give me writer's block, I'm at a loss for words\nUhh, my mind's as lost as yours\nI rack my brain but still no thoughts emerge\nNever seen no ass as large as yours\nHow much that cost? That's what I call a Roethlissplurge\nYou drive me bonkers, I’m about to get my swerve on for sure\nThought I was pimpin' 'til I felt like Nas, the first\nDate 'cause I think I gave you power\nWhen I gave you flowers in a vase\nA box of chocolates, throat lozengers, cough drops and Certs\nProbably shoulda never let me call that job of yours\nTo talk to your boss and ask him if you can take off from work\nShoulda been one of the first signs to cause alert\nMan, we jumped in too fast\n'Cause since then I just can't be apart from her\n'Cause nobody's body's awesomer\nI lust her and she loves me 'cause I'm popular\nBut you know this ain't love\n\n[Chorus: Jamie N Commons and Eminem]\nYou know this ain't love, oh no (Oh this ain't love)\nYou know this ain't love (Oh this ain't love), oh no\nWhat is it then?\nIt's desperation (She's looking for Mr. Right) (Hey!)\n(Wants me to be that guy to her)\nIt's desperation (I can't even put up a fight) (Hey!)\n('Cause I give in at the sight of her)\nAnd I here I go again\n\n[Verse 2: Eminem]\nYou were obviously oblivious to me\nI swore I was just invisible to you\n'Til I went to the lengths I did to meet you\n'Cause you played so hard to get with me from\nThe beginning, now I'm in disbelief, I\nNever knew that this could be such misery, ah\n'Cause now you see nothing but me\nAnd I don't see nothing but you\nAnd I'm about to flip 'cause we are – super glued in\nWe stuck to each other's hips and we can't\nDo anything individually, which is to cling on\nScared to be alone, can't specifically describe it\nI just can't seem to give a reason\nThat's definitive, just need ya\nTalkin' about I live and breathe ya\nAnd you pretend to be as mentally and physically\nAddicted to me as Wiz Khalifa is to reefer\nDon't wanna be without you\nDon't wanna be with you neither\nBitch, put me in a situation in which it's both I wish to seek\n'Cause this ain't love\n\n[Chorus: Jamie N Commons and Eminem]\nYou know this ain't love, oh no (Oh this ain't love)\nYou know this ain't love (Oh this ain't love), oh no\nWhat is it then?\nIt's desperation (She's looking for Mr. Right) (Hey!)\n(Wants me to be that guy to her)\nIt's desperation (I can't even put up a fight) (Hey!)\n('Cause I give in at the sight of her)\nAnd I here I go again\n\n[Verse 3: Eminem]\nJust want you to myself\nDon't wanna share you with no one else\n\"What the fuck you whisperin' for?\nYou get on my nerves, you make me sick\nI think our relationship, it seems to be on the fritz\nI mean it's time that we just split and leave the\nGames behind, your frame of mind ain't the same as mine\nI think you need to finish developing a\nLittle more mentally to get the picture.\"\nThat's a negative, Alicia, I will never give the keys up\nTo the crib ever again, no Visa\nNot even a gift certificate from Tiffany's\nYou better have an epiphany, slut\nGuess what? (What?) The lease up\nI'm just mad the time it took to discover\nYou were usin' me for loot like I used you for looks\nOh, thought you was too good for me, huh?\nYeah, toots, used to be my Carrie Underwood\nI was your lumberjack\nBut I can't stomach this, I'm leavin' you, I'm not comin' back\nShe said, \"The fuck with that!\nWhere's my Louisville Slugger at?\"\nShe grabbed that fuckin' bat\nAnd swung it at my head, I barely ducked and that's\nRight when she came up with a kick to the nuts twice\nSteel toe, girl probably coulda put a 100-yard field goal\nThrough the uprights\n\n[Chorus: Jamie N Commons and Eminem]\nYou know this ain't love, oh no (Oh this ain't love)\nYou know this ain't love (Oh this ain't love), oh no\nWhat is it then?\nIt's desperation (She's looking for Mr. Right) (Hey!)\n(Wants me to be that guy to her)\nLord, it's desperation (I can't even put up a fight) (Hey!)\n('Cause I give in at the sight of her)\nDesperation (And I here I go again)", "image": "https://images.genius.com/a24c8428273f315c50a002663b515ffb.1000x1000x1.png"}], "artist": "Eminem"}