{"songs": [{"title": "Who Do You Believe In", "album": "Made", "year": "2007-12-04", "lyrics": "What Up?\n\n[Verse 1: Scarface]\nThis past year was a rough ride, joking aside\nA lot of niggas left to do bids, and most done died\nMy neighborhood is like a ghost town\nWould hype some trash\nThe BGs got the hood hot\nWith whites and rats\nThe old folks is mad at us cause they kids is lost\nHow you expect for us to teach when all you did was talk\nThe trickle down theory but this generation of thugs\nAin't nothing like my niggas was when was hustling blood\nIt went from weed to cocaine\nCocaine to drank\nDrank to handlebar, heron, x and crank\nSmokin' dip, plottin' homicies, killin theyself\nButt naked waving pistols round the feeling of death\nGot mama crying, cause she know deep down they needin' her help\nBut he's a dead man walking, still she pray for his health\nWhy did Cory have to die young\nI'm losing my friends\nFought the war against Cancer\nBut he lost in the end\n\n[Hook]\nWho do you believe in?\nWho do you believe in?\nWho do you believe in?\nWho do you believe in?\n\n[Verse 2: Scarface]\nOutside I see the cop cars flashin they lights\nRaindrops symbolizing God is saving the life\nThe sun shining so they say the devil beatin his wife\nThe body bloody underneath the sheet is waitin for Christ\nThe streets is hungry so I know they watchin'\nWaitin' to strike\nBut anything you ever got for easy\nCame with a price\nIts just the chance a nigga took\nHe was shaking the dice\nCommitted suicide to get his chain covered in ice\nI ain't 'gon lie I did the same thing\nI wanted to shine\n25 and had a drop Rolls\nTop of the line\nI came a long way from rockin' up\nOunces or dimes\nTo moving big boys\n4 or 5 blocks at a time\nAnd since this rap it wasn't paying bills\nI did what I did\nGot my money for it\nLet these niggas see how I live\nWrong answer\nYou'd think a motherfucker be proud\nTo see his homie on his feet instead of talking him down\n\n[Hook]\n\n[Verse 3: Scarface]\nNow if the ghetto ever made a change\nIt changed for the worse\nBut I love it so I write in tears\nAnd pray til it hurts\nPrick my fingers\nTil the blood stains would cover the page\nWipe my eyes and look ahead\nAnd hope to see better days\nI turn my TV off\nCuz I don't wanna look at the news\nHard times seeing people crying\nArabs and Jews\nFighting for they religion\nNiggas livin like niggas\nMexicans on the border\nWhite boys saying kill em\nPoliticians playing puppet\nGotta answer me this\nDo you believe you really God?\nMy answer is this\nDid you say\nLet there be light, give Adam his wife\nProduce the vegetation\nSeparate the day from the night?\n\n[Bridge]\nCreate the land and the sea and man in your own image\nIf not, then I want all this bullshit ended\nSending the kids to fight a war that they ain't have to be in\nThat Saddam shit is dead, let's see you fuck with them Koreans\n\n[Hook]", "image": "https://images.genius.com/1c0bc9b0924a9edae782646100a68a4d.500x500x1.jpg"}], "artist": "Scarface"}