{"songs": [{"title": "Da Goodness", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "[Intro by Redman]\nCheck it out (out)\nCheck it out (out)\nCheck it out (out)\nCheck it out (out)\nCheck it out (out)\nCheck it out (out)\nCheck it out (out)\nCheck it ouuuut\n\n[Redman]\nYo, bless the steel, step out dressed to kill\nSpark the L, \"Whattup Doc?\" What the deal?\nClock the squeal, the MC overkill\nCertified cylinders 35 mil'\nJumpin out planes, Doc's Da Name\nCock the flame, back to relieve the pain\nHater, IKSRFO don't Piscopo\nHit the safe for cake, shoulda switched the code\nNigga, sneak a pound through custom drug hounds\nBound to rob your neighborhood Waldbaum's\nMe and my man jumpin' out Sedans\nTappin' your jaw, like Sugar Ray did Duran\nI, execute like wars in Beirut\nTwenty-two inch rims to parachute out the Lex Coupe\nThe rhythm hit 'em without the venom in 'em\nPin 'em skin 'em with the shit, I pull out the John Lennon\nHa, dog style your girl, smokin' a lot\nI been had a demo before \"Ridin' High\"\nBuy a whip straight up, cash out the car lot\nClorox your Fort Knox, til y'all call SWAT\nBite off your ear for a souveneir\nSwitch from Red to Roy, give you Primal Fear\nIf you don't know the click then you're smokin' wet\nFunk Doc, Def Squad, from the Jersey set\n\nWild the fuck out, smoke the fuck out\nDrink the fuck out, freak the fuck out\nBug the fuck out, scream the fuck out\nBlack the fuck out, act the fuck out\n\nDo you feel it in your body? Shake your stankin' ass\nDo you feel it in your body? Shake your stankin' ass\nDo you wanna rock a party? Shake your stankin' ass\nDo you wanna get naughty? Shake your stankin' ass\n\nOoooh-weeee! I think the heat is on\n'97 Cheech and Chong, I'm reachin y'all\nRight on, my palm is like the cape on Spawn\nActive frequency, trip the car alarm\nRibbit Ribbit Ribbit, got moves to make\nChoose the date, today you hallucinate\nSmokin me out without war, torn, ghettoes\nOpposite of Goodfellas, Dinero\nGo to any borough who rock the mic thorough\nGot your wife sayin, \"Not tonight, hello!\"\nMoney talk, bullshit walk, ask Chris\nThe baptist, roll Garcia's with hashish\nYou need classes for practice to tap this\nJurassic crab shaft nasty ass bitch\nHot potato, drop the data\nGuard your Emancipation Proclimator\nLock shit down, cock the pound - no doubt\nAs a juvenile, brought cazals off canal\nBrick City be the pros at wildin' out\nOff at the mouth, get dressed like Thousand Isle\nGot a degree, on the hash and the leaky\nCrash in the V while we Master the P\nI beez Bout It Bout It, causin low mileage\nBlacka, make Zsa Zsa Gabor cha-cha\nSpit somethin to you then turn your eyes cockeyed\nDown with the Outz - ah ha ha, ha ha!\nYo tremblin, pickin up the pen again, adrenaline\nGot impact like DJ threw on \"Benjamins\"\nSentiment, hit you with your thongs and your Timberland\nFuck ya, rob ya, cops say, \"It's them again!\"\n\nChoke the fuck out, joke the fuck out\nSweat the fuck out, pass the fuck out\nBlack the fuck out, flip the fuck out\nDrunk the fuck out, bug the fuck out\n\nDo you feel it in your body? Shake your stankin' ass\nDo you feel it in your body? Shake your stankin' ass\nDo you wanna rock a party? Shake your stankin' ass\nDo you wanna get naughty? Shake your stankin' ass\n\n[Busta Rhymes]\nYo, Pepé Le Pew I ain't messin' wit you\nOr stressin your crew, your own niggas be testin you too\nFuckin wit you, makin your bitch unbuckle her shoe\nWatchin this bitch while she already know what she wanna do\nShe follow me home, and on the way she swallow me bone\nThe Don Corleone, she wildin all inside of my zone\nC'mon bitch, let me creep you out, peepin you out\nSneakin you out, over to my crib, freakin you out\nEveready, now turn off the telly, turn off the celly\nThe way I be hittin it got you sweatin makin you smelly\nShit funky like your mother with her stinkin ass\nType of shit that'll have you aggie and ready to blast, WHOO!\nBaby just hold a second and give me a chance\nLet me go put my rubber on so that we really can dance\nNow we huggin you know we fuckin until my nuts bust out\nCardiac arrest of the pussy and pass the fuck out\n\n[Redman]\nBug the fuck out, sweat the fuck out\nDrink the fuck out, stink the fuck out\nAct the fuck out, smack the fuck out\nFuck the fuck out, freak the fuck out\n\nDo you feel it in your body? Shake your stankin' ass\nDo you feel it in your body? Shake your stankin' ass\nDo you wanna rock a party? Shake your stankin' ass\nDo you wanna get naughty? Shake your stankin' ass\n\nDo you feel it in your body? Shake your stankin' ass\nDo you wanna get naughty? Shake your stankin' ass\nDo you wanna rock a party? Shake your stankin' ass\nDo you wanna drink a forty? Shake your stankin' ass\n\nStankin' ass\nStankin' ass\nStankin' ass\nStankin' ass", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}