{"songs": [{"title": "Wu Will Survive", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro: Antoine Lundy and Streetlife]\nWu Tang will survive, no no no-no no no\nWu Tang will survive\nCause every time they flip a party\nYou know the party screams and shouts\n'Cause you... DAMN! Aw, TC that was the bomb...\n\n[Raekwon]\nGet all my peoples, get all my peoples headphones\nAll of em\nLay em a death warrant\nAaaah, yo, show it off, kid, show em, what, what\nLet em have it, bust it, hey yo, hey yo\n\n[Verse 1: Raekwon]\nBlend wine, who wanna win mine?\nShorty get a ten-round for floatin' with the richest, huh\nFlexed out, Flinstone style\nYour crimi-nal pen pal kidnapped Loud, jetted the\nMosyin, posin' for them niggas up in Poland\nRollin' waxed out museum, G 'em\nThem richest niggas bless this like Russian cut VVS's\nSlide the hatchback, black, word, finessin' this\nThem niggas over there know, Gazelle goggles and them Lottos\n'88 style, throwin' bottles (bottles)\nScenario rap, imperial material (uh, yo, yo, yo, yo)\nYo, dunn, dunn, murderin' cats is like that real\n\n[Verse 2: Ghostface]\nYo, come do me somethin', word to Michelob, peep the Land Rov'\nSleeper hold club faggots lay your dome on a stove\nIt's like space kid, the whole world is pitch black, granola rap\nDough got smaller famous team, walked up in Fotomat\nBlack down, numerous rounds, boots is brown\nGetaway driver - this white bitch from outta town\nWe love horse races, shakin' Jakes and high-speed chasin'\nPorno stations, drinkin' violations, Godly nations\n90 minute Maxell tapes\nInstrumental breaks bangin' earaches\nLay my verse down in two takes\nThe speaker pops, the Winchester rifle's in the kitchen\nMurder the DJ's, eyes twitchin', woofer hissin'\n\n[Bridge: Raekwon]\nYo, he's strong armin', manipulatin niggas, scrapin' niggas\nTakin' play from niggas, hate fakin' niggas, yo, you hear me?\nThe whole shit's like wrestling\nWhat you dare me? Back the fuck up, kid, we flexin'\n\n[Verse 3: Method Man]\nThis rap shit bust yo' gums, and leave you stunned\nPull your plug, now you can't function\nThere's no to-tal or sum to this equa-tion, you fro-zen\nMany may come but few are cho-sen\nPretty niggas want to play the war po-sin\nWhen the ruckus come, they be the first to get their shine stolen\nDo or die, it be I, Meta-physical Man\nHoldin' court from my Wu indivisible Clan\nI see your thoughts and your hand reachin'\nIt's getting deep in this mud\nCats heat seekin', for one blood\nNameless thugs with aimless slugs, shootin' at these stank bitches\nLess he gon' bring this above, I make switches\nFrom the lamp, I grant three wishes\nJohnny be parlayin', I Blaze britches, then I roll\nOne hundred percent mind, one hundred percent body\nOne hundred percent soul, individual\nAssholes tend to run\nFrom this PLO extortion to the one\nThe next chamber, you fuckin' with the star spangler\nTo the dawn's early light with this head-banger\nBoogie, represent this shit fully\nLike I'm constantly at war with the town bully\nWho want that pressure? About to get smacked silly\nLike a fat bitch in Spandex, free Willy!\nWe on some milli, check the joint, engine number nine\nNiggas wastin' time worryin' about me and mine\nGet your own shit", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}