{"songs": [{"title": "Jukebox Joints", "album": "AT.LONG.LAST.A$AP", "year": "2015-05-26", "lyrics": "[Part I]\n\n[Chorus: A$AP Rocky & Joe Fox]\nAnd I'm a man of my word, that I got nothing at all\nSo tell me now does it hurt or is it too late? I'm a man of my law\nI gotta keep my weight up, but where do I land if I fall?\nBut never mind, I'm fly, you know\n\n[Verse 1: A$AP Rocky]\nShe the type to seek love and make it everlasting\nI'm the type to wake up and say you never happened\nI mean, I fucked the girl with hella passion\nBut it's cold how we smashing, left her sleeping on a separate mattress\nI think her body makes for better practice\nGood excuse for my absence like, \"Flacko, where your ass been?\nHeard you done with fashion, now yo' ass is acting\"\nI'm tripping off the acid, now yo' ass is looking massive\nThis ain't the shit equipped with columns from my reckless swagging\nThis that dark house party with this record blasting\nRolling spliffs, clique beside me, fingers Liberace\nWhen I seen this bitch in vintage Tommy and some mid Huaraches\nI'm all alone though, mood music makes me bop slower\nTrippin' on how I shifted pop culture, changed hip-hop on ya\nSmoking like a rasta was my pop's culture\nI be damned if I die sober, I'll be sure to visit Pac for ya\n\n[Chorus: A$AP Rocky & Joe Fox]\nAnd I'm a man of my word, that I got nothing at all\nSo tell me now does it hurt or is it too late? I'm a man of my law\nI gotta keep my weight up, but where do I land if I fall?\nBut never mind, I'm fly, you know\n\n[Verse 2: A$AP Rocky]\nAnd shout outs my pretty womens in the spot tonight\nLet me see them fuckin' hands\nAnd for the freaks that love the niggas with the Jeeps\nLex, coupes and the Bimmers and the Benz, come again\nWhen my death calls, I pray the Lord accept collect calls\n'Cause I be playing with these womens like they sex dolls\nCall my Prada prior, cause it's dropping next fall\nDon't you short the next ball, my closet like the Met ball\nShe said, \"I just love it when you speak soft-spoken\nUp in the magazines with your teeth all golden\"\nTook the whole year off just to learn to make beats\nDropped the flames on my release and leave the streets all smokin'\nThat touch your soul music, I get you higher\nGrab your lighter fluid, might add a preacher and a choir to it\nI speak the father's music, hallelujah\nAlways Strive & Prosper, stupid\nEven Montell can't tell you how we do it\nSit back and watch me do it\n\n[Chorus: A$AP Rocky & Joe Fox]\nAnd I'm a man of my word, that I got nothing at all\nSo tell me now does it hurt or is it too late? I'm a man of my law\nI gotta keep my weight up, but where do I land if I fall?\nBut never mind, I'm fly, you know\n\n[Part II]\n\n[Verse 3: A$AP Rocky]\nOkay, let's get past all the swag trapping and fashion talking\nYou want that take it to gats or keep it in rapping talking\nThey rap impulsive, get embarrassed, it actually happens often\nYou my son like my last abortion, I'm just laughing off it\nI changed rap, pushed fashion forward, yeah, I'm that important\nYou jack my style, she jack me off, and y'all both acting awkward?\nJiggling baby, nah, go ahead, bitch\nAin't nothing better than the pretty big forehead bitch\nListen close I got some shit to tell you, motherfuckers get familiar\nIt's not just model bitches on my genitalia\nDid Azalea's from Australia, trips to Venezuela\nCinderella's under my umbrella for different weather\nElla, ella, ayy, just play it like I didn't tell ya\nNiggas taking pictures any time we get together\nAnd hope to fly away just one day like some love birds\nOnly one word that I'm afraid of is the \"love\" word\n\n[Verse 4: Kanye West]\nMore power to you, more power to you, my lovely one\nMore power to you, more power to you, my lonely one\nMore power to you, more power to you, my lovely one\nWhat's up, bruh? That all depends\nWith friends like you, who need friends?\nSometimes the best advice is no advice\nEspecially when it's your advice\nOh! Man, remember\nYour man was on stage dressed like a family member\nMan, everything basic to Ye Guevara\nThat means Saint Laurent is my Zara\nI remember Rochelle ain't wanna fuck me with the polo\nAyy, bitch, you missed out, #fomo\nI got one child, one child\nBut I'm fuckin', fuckin', fuckin' like I'm tryna make four more\nThey wanna throw me under a white jail\n'Cause I'm a black man with confidence of a white male\nHallelujah", "image": "https://images.genius.com/3054c642a320e82b70b35c53ad1cc8d5.1000x1000x1.jpg"}], "artist": "A$AP Rocky"}