{"songs": [{"title": "Let it Flow (Get You in the Mood)", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "[KRS-One]\nIn the begining, it was WHBI\n\n[G.Simone - singing]\nJust let it flow...do what you know..\nTo get you in tha mooooood..\n\n*DJ scratching*\n\nJust let it flow...do what you know..\nTo get you in tha mooooood..\n\n*DJ scratching*\n\n[KRS-One]\nCheck it Now!Back up on the set KRS is on the mic' kid\nI rock the black and white kid, smash that ass and you fly, kid\nNo need to hype it but KRS-One's the one who pipe's it\nThese lyrical freestyles meanwhile you're gettin excited\nQuickery, inginiery, over my delivery I'm glittery\nI'm rhyming against biggetry while youre giving me...\n...ignorance, incompetence, inexperience!Im not hearing it!\nI battle with expedience and obedience, you macking the ingredients\nHiphop youre not being it!!Youre trying it\nMy whole style right now youre I and it\nI'll take ya dark demo and put the sky in it\nYou say youre dope but like an Elvis Presly CD I ain buying it\n\n{*Beat Stops and KRS-One speaks with G.Simone adding additional vocals*}\n\nTell me the relevance of Money without intelligence?!?!\nThere is none!EXPERIENCE= Wisdom!MC's I flick Dem\nLyric lick them, trick them, Kick Them, HAA HA-HA!!\nStick Them!\n\n{*Live audience laughs and sound fades.KRS continues rapping*}\n\nYeah! Yo!\nNow ev'ry time I kick this style that get you open\nI remind I rhymes yeah I know you opened\nFor sum'thing more gifted uplifted!\nTopical, rocking you, if its possible\nLet me give it to you logical\nGive it up is what you got to do! Like a bad habit!\nTo battle KRS you need battle skills and magic\nSee this talus mineral around my neck can try to grab it\nBut remember: I don't write rhymes I write classics\nYou can get your ass kicked, get back up in ya strolla\nKRS-One is seven dope albums older, the holder of a boulder\nYou want a fresh style? Let me show ya...\nWe will be here forever I told ya!!!\n\n[G.Simone - singing]\nJust let it flow...do what you know..\nTo get you in tha mooooood...(2x)\n\n[KRS-One]\nWatch me now, wa-watch me now, wa-watch me now Glock me now\nYou be looking sloppy now, drop me how?rock me how?\nYou can't even stop me now!\nWatcha really thinking bout when you wanna think it out!?\nWhen I'm bout to bring it out the terror that I sing a bout?\nIf you do the crime then you must do the time and\nIf you kick a rhyme and its wack thats your behind and...\nDont be blinded looking this way 'cause you'll be fine dead\nMy career going up-hill while yours declining\nI'm the bomb on foot K-1 land mind\nBumping to this you will shatter same time!!\nThese rappers be blind - they simply forget\nThat I'm the god of rap and my pride.. study the rhyme\n\n[G.Simone - singing]\nYeaaaaah!!If youre feelin what we're feeelinnng!\nLet it floww.Yeaaahh!!\n\n[KRS talking - G keeps singing]\nKRS-One keeps it toasty!Ha Ha.Whut!!\nBigging up the supreme team\nAll college radio DJ's, all underground MixTape DJ's\nRock on!!Yea Yea!!  Mad shoutout from New York City to the world!\nWORD UP to the World KID!\n(yea yea yea)to the World!!", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}