{"songs": [{"title": "Yeap (feat. B.o.B, Trae & Young Dro)", "album": null, "year": null, "lyrics": "[Intro: T.I.]\nYeap, yeap\nOkay, okay\nYeap, yeap\nOkay, okay, okay\n\n[Verse 1: T.I.]\nI double cup my lean, while I penetratin’ your ho\nShorty Im twice as raw as you seen\nBy far the coolest you know\nNigga you can ask anybody you know bout me they tell ya shawty gon’ go\nI been bowty, you know bout me shawty that four\nOkay, I keep warrant no I.D., got a couple bad bitches by me\nYou can't be walkin .. with that two lead don’t try me\nTry lotto my auto cost two million euros\nThese hoes all on me like they think my manure gold\nOkay these hoes be actin’ up\nThese niggas be actin’ tough\nHustle Gang, everybody got rap with us\nWanna see I her dont even gotta ask to fuck\nSee your chicken’ my pimpin as soon as I walked in\nShe just asked me one question, she said do you like woman who really like woman?\nI came with my friends and we comin’ with you\nIs you with it? I was like\n\n[Hook: T.I.]\nYeap, yeap\nThat right? That right?\nOkay, okay, okay\nYeap, yeap\nThat right? That Right?\nThat right? That Right?\nOkay okay okay\n\n[Verse 2: B.o.B]\nI pull up front about four doors\nI’mma roll up blunts with about four O’s\nI’mma young nigga with an old soul\nThat’s why these niggas all got my old flow\nThey get mad cause they hoes chose\nI’mma slang that wood, I’mma throw that oak\nI dont call her back, cause I dont owe that hoe\nI just ignore that bitch like I don’t know that hoe\nAye,did you know that?\nEveryday is a Kodak\nAnd they didn’t know me so until I went Pop\nBut I was gettin’ money we before that\nWith your main bitch on my floor mat\nWhen I’m finished with her here’s your hoe back\nI told that bitch, don’t act like you know I wouldn’t call where your coat at?\nNiggas is freezing Hustle Gang season\nGoons on the payroll, looking for a reason to create some balance when she get uneven\nSo say what you mean and do no be misleading\nShit the fuck up when real niggas is speaking\nCause life is a game and you will be deleted\nNigga, you will be obsoleted\nYou will witness the rise of the Phoenix (gang)\n\n[Hook]\n\n[Verse 3: Young Dro]\nKill em in the Benz, kill em in the drop\nUp my flow nigga hit em with the pop\nNigga I’mma rebel slash killer misionary\nI be going fuckin’ stupid, I’mma fuckin adversary\nBackyard cemetary,where you wanna get buried?\nPut you right next to the bitch named Mary\nThat’s the last bitch I motherfuckin’ strangle’d\nShe tried to set me up, so I hung her like a hanger\nI’mma keep it real I’m a God damn sinner\nI can hit a note like Aretha damn Franklin\nBut I bet I still snap on a God damn banger\nNigga I’ll work your bitch like a trainer\nHit it from the back, then tell bitch push up\nDick on the chin, yeah bitch chin up\nTrick got bent up, pockets on fill up\nIf your sick of looking at a nigga bitch spit up\nForty-five grand on my motherfuckin’ wrists\nI like you hoe, I finna blow that bitch a kiss\nIf she stick around, I’m a throw the bitch dick\nIf the bitch get smart, I dont throw the bitch shit\nI like doing this, but I love doing that\nHorse this label nigga need to get on my back\nNigga I’ll run to the motherfuckin’ end\nCall me Joe Biscuit, I’mma win\nAin't gettin’ paper, Trick come again\nBitch I’m besides you just like a sin\nYa’ll nigga friendemy’s ya’ll ain't friends\nHustle Gang nigga we ain't never gon’ bend\n\n[Hook]\n\n[Verse 4: Trae The Truth]\nYeah nigga money really long\nChopper down what the fuck you niggas really on?\nFuck nigga you can see I’m worth a million\nTell em my hustle be a minute before this milli gone\nTruth got it on lock no keys on em\nPush a nigga top back no breeze on em\nGive a nigga the whole clip I squeeze on em\nIce gang so cold I sneeze on em\nSomebody kill before I make shit freeze on em\nI don’t talk about shit I put fees on em\nThey’ll get and put another couple G’s on em\nMake em put them in the dirt grow trees on em\nI’ll throw a motherfuckin’ fit\nThis two-door Phantom you ain't fuckin’ with\nJump out like bitch who you fuckin with?\nNot me, everything you ain't fuckin shit\nI’m gold in my zone keep nobody come safe\nI’m turnt to the max, diamonds looking like Vegas\nI ball like Durant, rip the rim like the Lakers\nI do this for real other niggas is fakers\nYeah, niggas better get they mind right\nWhen they come to get money, nigga mine right\nWhen its time to shine on em, I’mma shine bright\n… on em my time right\n\n[Hook]", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}