{"songs": [{"title": "Pain Killer", "album": "The Lost Scripts of K.O.D.", "year": "2010-03-30", "lyrics": "(The Hole)\n\n[Verse 1: Tech N9ne]\nMy painkillers' in my dresser, right next to my rester\nWhat insane brain would agree to this gesture?\nTo unjest less stress left with no extra\nView's a mess, true depressed steps can infect ya\nI'm a product of some shit gone wrong\nEven though I speak to many, with a hit song tone\nEven though I'm famous and I'm giving chicks long dong\nMan, I feel like the coppertop just a sick stone throne\nOne Flew Over The Cucoo's Nest, then he cashed some beaucoup checks\nBut he was not nearly stable to crew new Tech\nAs a, phenomenon, but karma wanna noose dudes' neck\nDesigner of death, get to choose who's next\nIs it real to you?\nBut if you got evil you kind to come and steal a few\nCondemned souls, cause of what the old painkiller do\nKeep having these dreams of me taking my nine milla\nWho can help me execute this desire to pop a pill or two?\n\n[Hook: Tech N9ne & Krizz Kaliko]\nYou can't give me medical attention to ease my pain\nSometimes I feel helpless and need some thing to relieve my brain\nYou may love your M.D, but he has none in store for me\nSo when the raining pours on me, my dream fulfill us\nPainkillers\n\n[Verse 2: Tech N9ne]\nMy pain comes from me, being a fuck up\nWith Strange Music we, really we lucked up\nCause being a lost soul got my bucks up\nEven though my cerebral cortex and spirit\nNeeded a touch up\nEverybody around me hurting and shit\nWhile everybody on TV, kicking it, reject, jerkin and shit\nI be the one on stage and studio stressed out\nWorkin and spit\nThis shit to the people that I know\nThat I got a lotta evil lurkin and quick\nWomen want me-want me, so they flaunt the monkey\nEven during sex sometimes\nA heap of stress still\nWants to haunt me\nWhen I grabbed the yalk she couldn't talk\nAnd it was no humpty-dumpty\nEven though I'm sick in the head we kicks it like a donkey, don't we?\nMy apology to everyone who've been labeled a victim\nI be losing my mind, I just picked up the nine and I gripped 'em\nAnd I put it off in a direction like I was the Kiss one\nI always think about the day when I'm able to pull back and I click 'em\n\n[Hook]\n\n[Verse 3: Tech N9ne]\nNo meds for me, just lead for me\nAny light inside of my head is just too dead to see\nAny kind a way out of this whole, can I pull this darkness out of this soul?\nA lot of people wanna know how it's sold\nCause a lot of motherfuckers' having doubt on this globe\nAnd I'm one of 'em\nYou can see it on the television, everybody trippin', it's a ton of them\nStraight feeling that pain, go insane then bang and it ain't no none of 'em\nMany ways to end these days when the darkness make you wanna shun the sun\nTen million ways to die when you constantly cry and the gun is one\n\n[Hook]", "image": "https://images.genius.com/7e2b9eeebdc1cc709ccef0b274fe2dfa.600x600x1.jpg"}], "artist": "Tech N9ne"}