{"songs": [{"title": "People", "album": null, "year": null, "lyrics": "[Verse 1]\nI know people that try, people that don’t\nPeople that fly through the air, just float, like smoke\nI know people that joke, know people that’s rich, know people that’s broke\nKnow people that love, people that hate\nSome tell you that you good, some say you doin' great\nHey, I know people can’t wait\nThey wanna hear every single thing I gotta say\nSome people act cool, some act phony\nPeople are your friends, but they never be your homies!\nI know people think they know me\nI guess I’m lame and untalented, old me\nGirls wanna own me, labels wanna clone me\nHaters wanna choke me, stoners wanna smoke weed\nPeople never gonna change\nCause no two people are the same!\n\n[Hook]\nHey! We, we are just two people\nWhat more can we do\nGive me one more day\nI’mma spend it with you\nWith you\n\n[Verse 2]\nI can’t complain, that people know my name\nAnd when I come back home, not a damn thing change!\nI bet people can’t believe\nSome after the money\nSome want a degree\nIf you’re showing love, then you’re cool with me\nI’m the same old dude, before the jewelry\nAnd everything kinda new to me\nThings ain’t nothing like they use to be!\nPeople thought I wouldn't\nSome people thought that I probably could\nSome people think that boy turned to Hollywood\nLiving up every day, worth while\nDude roll away when they see the girl smile\nI’m glad I get to call her mine\nThis the type of thing so hard to find\nYou can't tell a star to shine or a carpet fly\nShit's gonna happen, it's just all in time\n\n[Hook]\nHey! We are just two people\nWhat more can we do\nGive me one more day\nI’mma spend it with you!\nWith you!\n\nI'm dealin' with somebody, and I don’t know what to do\nThey may not understand you cause they see you on the move!\nGirl this dinner over, I'm tryin' to get you to my room\nCause I’ve been going crazy, baby you don't got a clue\n\n[Hook]\nHey! We are just two people\nWhat more can we do\nGive me one more day\nI’mma spend it with you!\nWith you!", "image": "https://images.genius.com/366878b883f76791456cd61fd70a9b6c.275x275x1.jpg"}], "artist": "Mac Miller"}