{"songs": [{"title": "Touch Me", "album": "Forever King", "year": "2009-07-03", "lyrics": "[Intro: 50 Cent]\nThis time.. I'ma make it clear..\nThat I'm number one, uhh\n\n[Verse 1: 50 Cent]\nYeah, yeah, yeah\nYeah, she so vicious, sweet kisses, taste delicious\nMaybe this is who I should make the missus\nLet's conversate a little like a fiddle, play with the middle\nThey way she shake when it wiggle, I mean she hot like a kettle\nWell, me I'm strapped with the metal when I go hard for the bread\nSo I line you up and I dent you\nYou run you're fucked when I catch you\nYou only eat cause I let you, I hate the fact that I met you\nWhen you could say that you know me and act like I'm your homie\n\n[Chorus: Mary J. Blige (50 Cent)]\nTouch me, tease me\nFeel me and caress me (come on come on...)\nHold on tight and don't let go, baby I'm about to explode\n(Come on come on...)\n'Cause all my love you can control... (yeah...)\n\n[Verse 2: 50 Cent]\nHaha... yeah... yeah... yeah...\nShe scratch my back when I'm stroking\nShe scream she like it, she open\nI'm sitting back while she sucking, she super freaky, I love it (woo!)\nThe sex is better than basic, that kitty kat, yeah, I chase it\nShe do it just how I like it, position after position\nFast stroke, short stroke, deep stroke, listen\nShe down for pushing her limits, that's why I'm pushing up in it\nStart kissing her lips then I'm kissing her neck\nWhen my tongue cross her tatas, then bet it get wet to her, easy\n\n[Chorus: Mary J. Blige (50 Cent)]\nTouch me, tease me (touch me baby...)\nFeel me and caress me (tease me baby...)\nHold on tight and don't let go (50...), baby I'm about to explode\n(Wooo...!)\n'Cause all my love you can control...\n(This is how it's supposed to feel\nI said this is how it's supposed to feel...)\n\n[Verse 3: Case (50 Cent)]\nI'll spend the night with you (haha...)\nIf you promise you will do\nAll the things to make me scream, and you know just what I mean\n(Girl you know what he mean...)\n'Cause tonight you taste like ice cream\n(Yeah... yeah... yeah... yeah... yeah...\nWork it out now... wooohooooooo... !)\nI wanna make you fall in love\nMake you touch the stars above (haha...)\nPlease me low and be my friend\nI'll come back and hit it again (and hit it again...)\nAnd again, and again, and again (again and again...)\nDon't go away (yeah... come on girl...)\n\n[Chorus: Mary J. Blige (50 Cent)]\nTouch me, tease me (make it feel good...)\nFeel me and caress me (I mean real good...)\nHold on tight and don't let go, baby I'm about to explode (haha...)\n'Cause all my love you can control...\n(Yeah... I can feel it... owwwwww...!)\n\n[Verse 4: Foxy Brown (50 Cent)]\nWhat?\nLet me get that Lex, nigga\nSex wetter than aquariums\nFlashing, to get their ass and (uhh...)\nWho fucks slow in Lear jets and coupes\nMy ones stacking\nYou ain't know that I be macking, uhh (nah...)\nThe extra set of keys, the thirty G's\nThem trips to Belize, had you living on your knees, uhh (yeah...)\nNot to mention the laced out crib in Dallas\n(Yeah... yeah... yeah... ah!)\nThe forty room palace, sipping Cristal-ise\nUhh, what, uhh\n\n[Chorus: Mary J. Blige (50 Cent)]\nTouch me, tease me (yeah...)\nFeel me and caress me\n(Now bend, and stretch come on...)\nHold on tight and don't let go (now bend, and stretch come on...)\nBaby I'm about to explode\n(Work it out... I said work it out...)\n'Cause all my love you can control...\n(Come on break it down... that's how they break it down... haha...)\nTouch me, tease me (this is what I call fun...)\nFeel me and caress me (I'm having so much fun...)\nHold on tight and don't let go, baby I'm about to explode\n(I'm back to work...)\n'Cause all my love you can control... (yeah...)", "image": "https://images.genius.com/c43e4058469760b042583905a14fbf35.300x300x1.jpg"}], "artist": "50 Cent"}