{"songs": [{"title": "Really", "album": "Blood Moon: Year of the Wolf", "year": "2014-09-23", "lyrics": "[Verse 1: Yo Gotti]\nFuck buyin' jewelry, buyin' ammo\nTeflon, bulletproof the Lambo (really?)\nHate rats, got my niggas in the fed\nGot money in the bank and money on my head\nReally? Niggas sound silly\nWanna talk money? Yeah, count it, ten milli\nFree my nigga Meek Milly, bad bitch out of Philly\nSold that white girl so I guess I sold Iggy\nWho you think I give a fuck about, an enemy?\nThink I give a fuck about the industry?\nPussy ass nigga better Google me\nBoy I really made a million out the fuckin' streets\nBoy I had a white car back in '04\nBack in running wood days and ridin' low\nWhen bein' a street nigga really meant something\nNow niggas sell his soul for a follow\nIf you wanna talk streets, what it mean to you niggas?\nTake pictures with guns so that make you a killer?\nNah, L.A. Reid gave me that check today\nTook that shit to the 'jects, empowered the hittas\nI'm Crenshaw at Fatburger, fuckin' with Nipsey\nAnd I bet you I'm rockin' my chains\nOr I'm in the Watts with Jay Rock\nOr slidin' through Compton with Game\nCause real niggas livin' the same\n\n[Verse 2: 2 Chainz]\n2 Chainz!\nMy auntie did 20 years, my pop did like 16 (TRU)\nMy partner did a decade so what the fuck you really mean?\nReally ho, Billie Jean jackets in my video\nCausin' all this racket, no tennis court\nReally made a million in a kitchen fork\nSkrt, skrt, skrt, skrt, dinner fork\nOften offended\nI told that bitch there to get out when she finished\nNeed me a bitch that's gon' suck me and fuck me\nAnd freak me and pass me to all of her friends, that's what it is\nVerbal telekinesis, Kurupt mixed with Jeezy\nBig Meech mixed with Yeezy\nKeep playin' them games and get shot from them bleachers\nI still got my stripes when I'm not wearing Adidas\nGot a fresh hairline from Peter\nGot me a hockey mask, choppers start talking fast\nGive it to 'em direct just like Jeter, uhh\nNiggas ain't killing shit\nNiggas they playing, they saying they killing shit\nGot me an A and a K and a 220 trey\nAnd this shit here might burn a little bit\nI'm like, \"Really little bitches? Say really?\"\n\n[Hook: Soulja Boy]\nFuck these niggas\nNiggas say they gon' kill me (really really? Really?)\nNiggas say they gon' kill me (really?)\nNiggas say they gon' kill me (really really? Really?)\nNiggas say they gon' kill me (really?)\n\n[Verse 3: T.I.]\nBrand new Benz with the top down\nIn my old neighborhood, all the cops 'round\nI don't give a fuck, motherfucker act up\nLet him and the police hear how the Glock sound\nComin' with the bullshit, get shot down\nSucker free, no fly zone in my town\nAnd there ain't no discussion\nIt's simple, you try me, we gon' get to bustin'\nI promise, my nigga, you want it, my nigga?\nMy young niggas ready, they goin' on guard\nMm, they act like they know ain't no God\nWe so official, for sure, no facade\nTrap nigga shine like I glow in the dark\nStill got my .4-4 in the door\nI'm not finna  play with you, homie get laid with you\nCement your feet, then it's off in the lake with you\nUnderestimate you, that mistake I couldn't make with you\nI hit you with the K myself and show you what the paper do\nAnd can't nobody handle you the way I do\nI'll give a boy a K or two, kill you in a day or two\nAnd no disrespect boy\nYou violate me, we gon' handle that\nBlow your ass off the map\nAnd you still reachin' your hand out for no dap\nMy demonstration in exchange for your hatin'\nI put this flame all in your face, boy you fakin'\nWe come through in Mercedes\nAnd shoot you, you'd think Call of Duty would make it\nBacon, a nigga medulla off top\nHe don't give me my moolah off top\nGive a damn what the naysayers say\nAnd we waitin' a day in the A with the K and I'm gone\n\n[Hook: Soulja Boy]\nFuck these niggas\nNiggas say they gon' kill me (really really? Really?)\nNiggas say they gon' kill me (really?)\nNiggas say they gon' kill me (really really? Really?)\nNiggas say they gon' kill me (really?)\n\n[Verse 4: Game]\nNiggas ain't gon' kill shit\nI'm ridin' 'round, seven pounds, nigga, Will Smith\nIt's a whole heck of y'all and a whole deck of cards\nThis shit right here you can't deal with\nTwo ice cubes and some cognac\nSpent some time in twin towers, I ain't goin' back\nSpent my commissary on some M&M's thinkin' I was Eminem\nRunnin' Aftermath in all black\nI'll slaughter your house with 5 9's\nLeave all of you niggas with crooked eyes\nGot the Louisville Slugger, Big Papi Ortiz\nKnockin' every button off your buttoned up sleeves\nPlease that's Jeezy the Snowman\nComin' straight to your window like Bruh Man\nSaid I ain't killin' your dog but stealin' my hog and fuck my conscience\nPuttin' bullets in your doberman, don't fuck with Compton\nDon't fuck with Kendrick, don't fuck with Problem\nDon't fuck with YG, I'm Mr. Miyagi, Daniel San, I handle them\nMy handle's dumb, I had no gun\nFuck around, stomp you out in these Durant's or somethin'\nI bear arms like Durantula\nThis rocket launcher'll blow your whole fuckin' mansion up\nAnd everybody gotta die, put them candles up\nHow you get caught up in the web with tarantulas?\nAnd for you fuckin' dumb niggas, let me slow it down\nI can screw you like Pimp and Big Moe around\nAnd when a nigga say \"Timber\", you don't need Ricky Rubio\nTo let a nigga know it's goin' down, fuck you clowns\nYeah, I put the word on you niggas\nGo A$AP Ferg on you niggas\nBeen all through New York with Diddy\nMy verse'll Schmurda you niggas\nAnd that's not a shot at TIP or a shot at Gotti\nTake shots of Ciroc in a black Bugatti\nGot a shotty in a backpack, napsack\nShawty got a black MAC 11, I will catch that body\nLike Nasir and Hov when I'm 40 years old\nI will still be the pilot that light up the stove\nAnd be cookin' that crack 'til the Doctor come back\nAnd tell niggas that \"Detox\" come out this October\nLike Ol' Dirty Bastard, I'm finally sober\nAnd verses like this'll get me a new Rover\nGet you a new home and a casket, you bastard\nYour funeral boring, I'm glad that it's over\nSoulja!\n\n[Hook: Soulja Boy]\nFuck these niggas\nNiggas say they gon' kill me (really really? Really?)\nNiggas say they gon' kill me (really?)\nNiggas say they gon' kill me (really really? Really?)\nNiggas say they gon' kill me (really?)", "image": "https://images.genius.com/3c242f72b054b6d20e2e8fd97f060d73.1000x1000x1.jpg"}], "artist": "The Game"}