{"songs": [{"title": "Double Standards", "album": "Control System ", "year": "2012-05-11", "lyrics": "[Intro: Ab-Soul]\nOne time for your mind\n\n[Verse 1: Ab-Soul]\nHe with the homies, he with the homies\nNo squares in his circle, nobody phony\nHe with the homies, he with the homies\nWe don't love them hoes, let's get this money\nHe got a main chick, been with her for a while\nLove making, and making out\nHis fellas' in his ear, \"You acting like a queer\nYou going on dates, we tryna get this cake!\"\nWhen the pressure gets to setting in\n\"If you a real man, you would fuck her friend\"\nHead saying no, other one saying yes\nHis girl girlfriend been with it, it's scandalous\nUnfasten her clothes, she swore she won't tell a soul\nThe thrill of it all got him off, case closed\nHe hesitated, and she say \"Why you push me?\nIf you don’t get this pussy, then you a pussy, nigga\"\n\n[Hook: Ab-Soul]\nTired of living, living, living\nBy this double standard, standard, standard\nTired of living, living, living\nBy this double standard, standard, standard\n\n[Verse 2: Ab-Soul]\nShe with the girls, she with the girls\nHair done, nails done, no care in the world\nShe with the girls, she with the girls\nThey all wifey material, yes sir\nShe want a boyfriend, she been missing out\nOn love making and making out\nBut she ain't having the best luck\nEverybody who chop it up only want a cut\nOne of her girlfriends got one\nShe been jealous of the relationship since day one\nBut last week he made a pass at her\nShe knew she had him, her ass a little fatter\nUnbuttoned his jeans and then she fell to her knees\nShe finally found company for her misery\nHe hesitated, and she say \"Why you push me?\nIf you don't get this pussy, then you a pussy, nigga\"\n\n[Hook: Ab-Soul]\nTired of living, living, living\nBy this double standard, standard, standard\nTired of living, living, living\nBy this double standard, standard, standard\n\n[Verse 3: Ab-Soul]\nSee, the moral of the story is:\nShe a ho, he a pimp\nOld girl will forgive her man\nBut her girlfriends cut off like Edward's hands\nWhat's fucked up is he got at her\nBitches call her a rat, but shit, she's heard worse\nTo my niggas having bitches, it's what you just do\nTo the bitches having niggas, it's what a slut do\nMy auntie told me always treat my lady right\nMy uncle told me only love 'em for a night\nYou can see the immediate disconnection\nBetween a man and a woman, the reason for regression\nFor example, you heard of Amber Cole\nBut you don't know that nigga that was getting dome\nI'm saying we heard of Amber Cole\nBut we don't know that lil' nigga that was getting dome\n\n[Interlude: Ab-Soul]\nIt's just my interpretation\nOf the situation\n\n[Hook: Ab-Soul & Anna Wise]\nTired of living, living, living\nBy this double standard, standard, standard\nTired of living, living, living\nBy this double standard, standard, standard", "image": "https://images.genius.com/36147c3e9b6fcfa747233bb1c340f424.500x500x1.jpg"}], "artist": "Ab-Soul"}