{"songs": [{"title": "Jealous", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "Yeah.. youknowhatI'msayin? Eh-heh\nIt's real funny youknowhatImean?\nI like can't believe this y'know\nJealousy like tried to move on me youknowhatI'msayin?\nSo I said nah I ain't gonna, y'know\nMake no energetic hyped up yellin, type joint, knowhatImean?\nI'm just gon' cool back, youknowhatI'msayin?\nWord up to this slow gangster beat type thing\nCheck it out yo..\n\nJealousy - I wanna kill him and shoot him\nHe's a sucker - I'd like to execute him\nRecruit him - put him in my school and school him\nI said somethin simple, and I knew that I'd fool him\nHe's only mediocre, jealousy can't get with me\nHang up your clothes, cause jealousy ain't spent to me\nHe's just a monkey, ridin my back\nIn fact I kidnap, ramsack, hijack and backslap the fool..\n.. see my name is Cool J\nI play for keeps, the microphone's my tool\nI've been holdin back long enough I had to bring it\nJealousy is in the house y'all, fellas sing it\n\nJealous.. Jealous..\nThere's no need to be\nJealous.. Jealous..\nBih mellow, youknowhatI'msayin?\nJealous.. Jealous..\nGangster groove, word up knowhatI'msayin?\nJealous.. Jealous..\nCheck it out y'all\n\nI'm not lackadaisical or lazy on the microphone\nI bring the bacon home so jealousy go home\nOr play the wall and pout about the way the prince is rollin\nSo when they give it up, stand back and start foldin\nAll your jealous show clothes, I think you need to grab a\nHalf-pint of Cisco and hang out with Backstabber\nCause I'mma break down all walls Jealousy built\nAnd then walk tall, like I'm standin on stilts yeah\nJealousy the jam is mean you'll have to rewind it\nIf you didn't know about him, you must have been blinded\nAsk him if I'm right, he'll tell you he sure is\nExcuse me for a moment, fellas sing a smooth chorus\n\nJealous.. Jealous..\nKnowhatI'msayin? Smooth, word up\nJealous.. Jealous..\nHuh, crazy gangster beat, youknowhatI'msayin?\nIt's like a gangster lean\nJealous.. Jealous..\nYeah yeah youknowhatI'msayin?\nIt's Cool J in the house, youknowhatI'msayin?\nJealous.. Jealous..\nWord up, check it out\nCheck it, yo\n\nThank you fellas, the way you sung the chorus was swift\nBut now it's time to pump lyrics, and shoot the gift\nHis name is Jealousy fellas see what I mean now turn it out\nWithout a doubt and if it hits you in the heart don't pout\nCause I'mma hit Jealousy and his posse where it hurts a lot\nHim and his boys have a habit, they always smirk a lot\nAnd make mean faces, I see em in many places\nScared to face us, they wish they could erase us\nOr outdo us, can't do damage and never will\nThe Legend in Leather is clever, man I'mma never chill\nAllah take a break from this, yo I love swingin\nYo E, pop the bubbly, fellas, start singin\n\nJealous.. Jealous..\nKnowhatI'msayin?\nIt's like a crazy gangster groove, youknowhatImean?\nJealous.. Jealous..\nHuh-huh, Jealousy ain't got no wins, youknowhatI'msayin?\nJealous.. Jealous..\nYo but it ain't nuttin youknowhatI'msayin?\nCause yo I'm the prince of rap knowhatI'msayin? Word up\nJealous.. Jealous..\nYo.. it's crazy.. I am the one\nBust it\n\nOooh yeah, now I'mma wind it up\nIt's time to move on and end the Jealousy cut\nAnd head off with a bang that sang and kicked your brain in\nI flowed like water now I'm finished explainin\nIn the spotlight tonight his name was Jealousy\nAnd for some strange reason, it seems fellas be\nFallin for him, I hope you understood\nStay away from him he ain't no good\n\nYouknowhatI'msayin man yo (that's word yeah I hear that)\nYeah word up (can't hang out man)\nYo it ain't nuttin yo yaknowwhatI'msayin\nCause we gon' do this (we gon' do it right)\n(get involved man) Yo get the champagne man\n(just chill)", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}