{"songs": [{"title": "Incarcerated Scarfaces", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Skit]\n– He looks determined without being ruthless. Something heroic in his manner. There's a courage about him. Doesn't look like a killer. Comes across so calm. Acts like he has a dream. Full of passion\n– You don't trust me, huh?\n– Well, you know why\n– I do, we're not supposed to trust anyone in our profession anyway\n\n[Intro]\nKnock niggas out the box all the time\nBitches know my mothafuckin' repertoire, big one\n(Yeah, mothafucka, straight up, I'll fuck your whole team up)\nTake care of B.I., Chef\n(Yeah, bust it)\nFly G.I. niggas\n\n[Chorus]\nNow, yo, yo, what up, yo? Time is runnin' out\nIt's for real though, let's connect politic, ditto\nWe could trade places, get lifted in the staircases\nWord up, peace, incarcerated Scarfaces\n\n[Verse 1]\nThug-related style attract millions, fans\nThey understand my plan, who's the kid up in the green Land?\nMe and the RZA connect, blow a fuse, you lose\nHalf-ass crews get demolished and bruised\nFake be fronting, hourglass-head niggas be wanting\nShutting down your slot, time for pumping\nPoisonous sting, which thumps up and act chumps\nRae's a heavy generator, but yo, guess who's the black Trump?\nDough be flowing by the hours, Wu, we got the collars\nScholars, Word Life, peace to Power and my whole unit\nWord up, quick to set it, don't wet it\nReal niggas lick shots, peace Connecticut\n\n[Chorus]\nNow, yo, yo, what up, yo? Time is runnin' out\nIt's for real though, let's connect politic, ditto\nWe could trade places, get lifted in the staircases\nWord up, peace, incarcerated Scarfaces\n\n[Verse 2]\nChef'll shine like marble, rhyme remarkable\nReal niggas raise up, spend your money, argue\nBut this time is for the uninvited\nGo 'head and rhyme to it, bitch nigga mics is getting fired\nMorphine chicks be burning like chlorine\nNiggas recognize from here to Baltimore to Fort Greene\nBut hold up, Moët be tasting like throw-up\nMy mob roll up, dripped to death whips rolled up\nYou never had no wins, sliding in these dens\nWith Timbs, with MAC-10's and broke friends\nYou got guns? Got guns too, what up, son\nDo, you wanna battle for cash and see who sons who?\nI probably wax, tax, smack rap niggas\nWho fax, niggas' lyrics is wack, nigga\nCan't stand unofficial, wet tissue, blank busting Scud missiles\nYou rolling like Trump, you get your meat lumped\nFor real, it's just slang rap democracy\nHere's the policy, slide off the ring, plus the Wallabees\nCheck the status, soon to see me at, Caesar's Palace eating salads\nWe beating mics sending keys to Dallas\nI move rhymes like retail, make sure shit sell\nFrom where we at to my man's cell\nFrom staircase to stage, minimum wage\nBut soon to get a article in Rap Page\nBut all I need is my house, my gat, my Ac\nBank account fat, it's going down like that\nAnd pardon the French but let me speak Italian\nBlack Stallion, wildling on Shaolin\nThat means the island of Staten\nAnd niggas carry gats and mad police from Manhattan\n\n[Chorus]\nNow, yo, yo, what up, yo? Time is runnin' out\nIt's for real though, let's connect politic, ditto\nWe could trade places, get lifted in the staircases\nWord up, peace, incarcerated Scarfaces\n\n[Verse 3]\nI do this for barber shop niggas in the Plaza\nCatching asthma, Rae is sticking gun-flashers\nWell-dressed, skating through the projects with big ones\nBroke elevators, turn the lights out, stick one upstairs\nSwitch like a chameleon, hit Brazilians\nPass the cash or leave your children, leave the building\nNiggas, yo, they be folding like envelopes\nUnder pressure, like Lou Ferrigno on coke\nYo, Africans denying niggas up in yellow cabs\nMusty like funk, waving they arms, to Arabs\nSit back, cooling like Kahlua's on rocks\nOn the crack spots, rubber band wrapped on my knots\nView bitches who fuck dreads on Sudafeds\nPussy's hurting, they did it for a yard for the Feds\nWord up cousin? Nigga, I seen it\nLike a 27-inch Zenith, believe it\n\n[Chorus]\nNow, yo, yo, what up, yo? Time is runnin' out\nIt's for real though, let's connect politic, ditto\nWe could trade places, get lifted in the staircases\nWord up, peace, incarcerated Scarfaces", "image": "https://images.genius.com/1824186243b7be8ac6edcc89529ad7f1.600x536x1.jpg"}], "artist": "Raekwon"}