{"songs": [{"title": "Piece of Mind", "album": "B4.DA.$$", "year": "2015-01-20", "lyrics": "[Intro Skit]\nHello?\nYeah I hear you bro, I hear you\nYou got a minute?\nYeah I got a quick sec\nAlright I want you to hear somethin'\nI'mma play somethin' for you alright?\nAlright, alright\nYo yo you hear it bro?\nYeah\n\n[Intro]\nYeah\nAlright listen, listen\nLet me tell you what shit is like right now y'all\n\n[Verse 1]\nWhat's life like now, tryna figure out\nThey put this mic on trial cause he be killin' now\nForever bitin' my forbidden style\nBeen laying low for a minute in the game\nSince I came all these niggas lookin' timid\nMy light could never dimith, the Lord is my shepherd\nJesus woke a devil in him since sinnin' with least effort\nThinking back to those lefferts days\nAnd I ain't been the same since I left 6th grade\nMy mind strayed, used to have the biggest heart\nTaking walks with abuela in the park, I used to tell her\nI'ma grow propellers one day and be a good fella\nPlay the hero or whoever, the hood gon' tell us\nLet's just pray it ain't the villain\nTill then I be feeling some way\nThinkin' I can get the Maybach off gun play\nInstead I let the words play with 90 beats a minute\nBet the streets lose a heart beat before the verse finish\nBut life goes on, basic rules still apply\nBet you can feel that line in any hood you live by\nFrom Flatbush to Figg side, I was a schoolboy too\nHoppin' trains, I just missed my Q\n\n[Hook]\nAnd what's life like for me, it's but a dream\nEverything ain't what it seems, up underneath\nThe surface is but a screen, we only see\nWhat we know\nAnd what's life like for me, it's but a dream\nEverything ain't what it seems, up underneath\nThe surface is but a screen, we only see\nWhat we know\n\n[Verse 2]\nAnd what's life like now, I can't figure out\nThey put my mans on trial, say he a killer now\nConspiracies, we gon' get you out\nJust keep ya head up G, shit is wild\nIt's bugged out cause I know you tryna see your child\nBut I'mma hold you down still cause you my brother\nI just gave Will a lil' somethin' for your baby mother\nBut don't stress, know you caught up in some b.s\nBet next time you see us, we gonna be our best\nLove you my nigga, word is bond, you'll stay strong\nOut in New York the same shit is goin' on\nPeace to all my brothers who keep still holdin' on\nBeen away so long, feel like a tickin' time bomb\nThe misjudgment of my kind, whom the odds is against\nPut our backs on the fence, so we self defence\nFollowed by a series of unfortunate events\nLooking like white America got a brother again\n\n[Hook]\nAnd what's life like for me, it's but a dream\nEverything ain't what it seems, up underneath\nThe surface is but a screen, we only see\nWhat we know\nAnd what's life like for me, it's but a dream\nEverything ain't what it seems, up underneath\nThe surface is but a screen, we only see\nWhat we know\n\n\n[Outro: Dyemond Lewis]\nTake shots to the face with no peace of mind\nGive me my piece of mind\nTake shots to the face with no peace of mind\nGive me my piece of mind\nThis life is all we know, this life is all we know\n\n[Outro skit]\nMan that's crazy yo, that's amazing B\nThank you bro\nWord bro\nThat one is for you my nigga\nGood lookin' bro, good lookin' man. That just boosted my adrenaline. It's been ages, I gotta get out this joint b. I love y'all man, real bro, for real man. I think by every day that go by, I just be thinkin' bout y'all for real. You, Kirk, everybody bro. I heard the new one on Rosenberg, that shit is a bomber b\nOh you heard that shit!", "image": "https://images.genius.com/314e5f2acb3d276d4b374900e64b4c42.1000x1000x1.jpg"}], "artist": "Joey Bada$$"}