{"songs": [{"title": "Kanye West Talks Fashion and Surprise Concerts in Paris", "album": null, "year": null, "lyrics": "PARIS — Fashion has a new odd couple: Bernard Arnault and Kanye West\n\nThe luxury titan turned out Saturday night for an impromptu concert by West in the auditorium of his Fondation Louis Vuitton, the new Frank Gehry art destination that later this month will put on display Edvard Munch’s “The Scream,” Henri Matisse’s “Dance” and other modern masterpieces\n\nWest drew a crowd packed in like sardines — the kind that hold cell phones — to hear him proclaim, “I wanna thank my original family for having me this evening, the LVMH group,” as he ripped into a version of “Runaway,” the lyrics of which include the refrain, “Let’s have a toast to the jerk-offs/That’ll never take work off.”\n\nThe young crowd went wild, with Oscar-winning film director and video artist Steve McQueen twirling his scarf over his head up in the VIP box\n\n“He’s great,” Arnault said after the show, giving a thumbs-up sign and heading to West’s dressing room to offer congratulations, his classical pianist wife Hélène and four of his five children in tow\n\nIt was Alexandre Arnault, 22, formerly a DJ, who pulled off the four-night attraction in the middle of Paris Fashion Week. “We organized it in two days,” he said\n\nThe student and budding luxury executive, who already works on LVMH’s digital strategy, related that West also offered to premiere his new music video, “All Day,” directed by McQueen\n\n“You saw the film? Fantastic,” Bernard Arnault told a reporter before the concert, which also featured an exhibition of West portraits by photographer Jackie Nickerson\n\nMcQueen related how the project came about\n\n“Me and my daughter were shopping in London at Dover Street Market and I got a phone call from Kanye and he says, ‘I’m at Dover Street Market, where are you?’ and I said, ‘Hey, I’m at Dover Street Market,’” he recalled. “I always said I would never shoot a music video, and here we did one in 10 days. That’s Kanye: It’s been a wild ride.”\n\nThe director said West played him his entire forthcoming album, “So Help Me God,” and he decided to blend elements of two tracks, shooting the video at Chatham Dockyard, with West donning a vintage T-shirt, Acne Jeans and his new Kanye West x Adidas Originals Yeezy high-tops\n\nIn an interview after his performance, his wife Kim Kardashian curled up on a sofa manipulating her iPhones, West was unequivocal about how fashion shows, particularly in Paris, nourish his creativity\n\n“As a musician, I would have never been able to design a show like what you saw tonight if it hadn’t been for my experience in Paris — learning how to minimize and make design decisions, how we started with just the single light,” said West, a stickler for details who barked at security guards between songs for loitering in front of the giant screens surrounding the stage, upon which images of boiling clouds, waterfalls, stars and smoky forests were projected. “It’s part of the show,” he pleaded\n\nWhile a divisive figure in fashion — many are put off by his front-row ubiquity and often surly behavior — West clearly relishes his role as a cultural lightning rod where style, art and music intersect. The hip-hop artist lauded the creative people “that work here, the city itself, the music that’s played at the shows, the colors, the palettes. I actually get a lot that I take back and put into music.”\n\nWest’s ties to LVMH Moët Hennessy Louis Vuitton stretch back to 2006, when he performed at a Fendi event in Tokyo, later collaborating with Louis Vuitton on a sneaker range in 2009\n\nMore recently, after meeting at a Givenchy show, West struck up a friendship with Alexandre Arnault, who doffed his Dior Homme jacket at the show and bopped around with his friends, mouthing the words to songs on the playlist, which included “All of the Lights” and “Ni–as in Paris.”\n\nA tour of the foundation building sparked the concert idea. “When I saw it, I was just so in love with architecture and the modern space and the way they curated the art. I just asked would it be OK for me to do a performance there,” West said\n\nTickets for the four concerts, which end Tuesday, sold out quickly at 100 euros, or $113, a pop. West said all proceeds would go to charity\n\nMeanwhile, Kardashian had spent part of Saturday at the hairdresser to adjust the color on her new blonde locks, which had assumed a yellow cast, not the platinum she was after\n\n“He fully got the color right. And it’s so perfect, I’m like, ‘Don’t make me fly out to Paris every time I need to color my hair,’” she said with a smile. “I’m happy with it. It’s a look. But I have a couple of shoots coming up and everyone is like, ‘Huh, what’s going on?’”\n\nKardashian said Madonna was partly the inspiration\n\n“I’ve always had references of Madonna with platinum hair. They’ve been on my computer forever, ” she said, letting slip that she would keep the color for an upcoming campaign, but clammed up on the brand\n\nLike West, Kardashian keeps a rein on her image, noting that the black coat slung over her shoulders at the concert, which she took off as the heat intensified, was a Céline style she altered to her liking, making it slimmer, changing the color from white to black, and adding a fur collar\n\n“My mom has the one that’s just as is. So I feel like mine’s a little special,” she said\n\n“And now it’s a really dope coat,” West concurred", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}