{"songs": [{"title": "Take It Back", "album": "Everybody", "year": "2017-05-05", "lyrics": "[Chorus]\nTake it back, take it way back\nTake it way, way back to the first black man\nLong ago before the white man\nCould paint the black man with a gun in his hand\nTake it back, take it way back\nTake it way, way back to the first white man\nAt the very moment when they looked around and said\n\"Fuck it, I’ma steal this land\"\nTake it back, take it way back\nTake it way way back to the first black man\nLong ago before the white man\nCould paint the black man with a gun in his hand\nTake it back, take it way back\nTake it way, way back to the first white man\nAt the very moment when they looked around and said\n\"Fuck it, I’ma steal this land\"\n\n[Verse 1]\nEverybody wanna tell me what I am, what I am not\n\"You ain't black, you a mothafuckin' white boy\nShut ya mouth, do it right boy, a'ight boy?\nMan, why you such a hype boy?\"\n\"Why you always talk about being black?\nSkin too white, nigga fuck that\"\nEverything you talk about, cut that\nThat door you trying to open, you could shut that\nGrip the gat, yeah that’s how I’ma buck back\nTell me what I am and what I know now\nAll this prejudice has got to go\nLife is moving fast, it need to slow down\nCome and see me when I am in yo' town\nPractice what we preach before it go down\nPractice what we preach before it go\nYes, I got the gift to gab fo sho\nWill I have to get the gat? No, no\nYes, I got to gift to gab fo sho\nBut will have to get the gat, get the gat, get the, get the?\nMasta deep down inside of me\nThe plantation deep down inside of me\nEverybody fuck like sodomy\n'Cause one or the other what it gotta be\nTell me why my momma gotta lie to me\nUnity for everyone that lied to me\nPeace on Earth what I try to be\nI just wanna spread the message of equality\nAnd yes, I got to gift to gab fo sho\nWill I have to get the gat? No, no\nYes, I got to gift to gab fo sho\nBut will have to get the gat, get the gat, get the, get the gat?\n\n[Chorus]\nTake it back, take it way back\nTake it way, way back to the first black man\nLong ago before the white man\nCould paint the black man with a gun in his hand\nTake it back, take it way back\nTake it way, way back to the first white man\nAt the very moment when they looked around and said\n\"Fuck it, I’ma steal this land\"\nTake it back, take it way back\nTake it way way back to the first black man\nLong ago before the white man\nCould paint the black man with a gun in his hand\nTake it back, take it way back\nTake it way way back to the first white man\nAt the very moment when they looked around and said\n\"Fuck it, I’ma steal this land\"\n\n[Outro]\nTake it back, take it way back\nTake it way, way back to about 1990\nShady Grove Hospital in Rockville, Maryland\n7:36 a.m., where a biracial baby was born\nTo a black father and a white mother\nFather that wasn’t there\nAddicted to crack cocaine, alcohol, and various other drugs\nSame as his mom\n(Way, way back)\nSo I’m gonna tell you about that, right?\nAnd I’m gonna tell you about how\nAll this young boy ever wanted was happiness\nAll he ever wanted was positivity\nAll he ever wanted to do was entertain\nAnd this boy went through hell\nYou gotta understand, his mother was racist, which is crazy\n'Cause how in the fuck is you gonna have\nAll these black babies with black men but you racist\nLike bitch, that don’t make no sense, but it is what it is\nYou know, he grew up, her callin' him a nigger\nThe kids at school callin' him a cracker\nIdentifying as black, looking as white\nBeing told what you can or can’t be\nThis kid went through everything\nHe went through...\nHe saw narcotics in the household\nViolence, murderers, drug dealers, he was kidnapped\nThere was crazy shit that happened to this kid\nAnd he persevered while the whole world said\nWhat they said?\nSaid you wouldn’t be shit!\nYou ain’t gon' be nothin', nothin', nothin', nothin'\nNothin', nothin', nothin', nothin', nothin', nothin', nothing\nAnd I, and he, he said fuck that, I’ma persevere\nAnd that’s why the message is always peace, love and positivity\nSee, he always saw things from two sides\nHe always saw things from two sides\nHe always knew that the message\nEverybody was born equal\nRegardless of race, religion, color, creed, and sexual orientation\nHe knew that because he saw that\n(Take it back, take it way back\nTake it way)\nBecause he was stripped and torn down\nBy his black brothers and sisters that were uneducated\nAnd that did not know\nAnd he was stripped and he was torn down\nBy his white side that did not know\nThese people that are ignorant\nThat cannot see the bigger picture\nThat must fight and kill and murder each other\nBut once again, all he ever wanted to do\nWas spread a message of equality\nFor every man, woman, and child\nRegardless of race, religion, color, creed, and sexual orientation\n(Take it back, take it way back\nTake it way, way back to the first)\nNow imagine this child growing up\nAnd seeing the craziest shit\nBeing a part of the craziest shit\nRunning around with the wrong people\nRunning around with guns and knives\nAnd fighting and stealing and, and all this\nBecause he didn’t know, he didn’t know!\nBut he knew deep down in his heart that it wasn’t right\nAnd he knew that he needed to get away from it\nNow I want you to also imagine, that at 17 years old\nThis child, okay, leaves home and gets two jobs to support himself\nTwo jobs that he works in the morning and the evenings\nAnd then he would then come home\nTo about eight or nine hours of sleep\nBut spend four, five, six hours of that\nWorking on music, persevering\nGrabbing the remote control and looking in the mirror\nAnd pretending to see thousands and thousands and thousands of people\nJust chanting his name\nHoping that it would happen\nBut the, but the, but the world said no!\nMothafucka, little mothafucka no-no, no-no, no-no, no-no\nYa nigga, ya cracka, ya white boy, ya black mothafucka\nNo-no!\n(Take it back, take it way back\nTake it way, way back to the first)\nAnd he said fuck that\nHe said peace, love, and positivity\nHe said equality for all man\nRegardless of race, religion, color, creed, and sexual orientation, yeah\nNow I want you to also imagine\nPeople telling him that he did not live this life\n“You just a white boy\nYou ain’t never experienced that shit\nYou from Gaithersburg, Maryland, nothing happens there\nOh no, no, we know, we weren’t there\nWe didn’t live with you, we didn't live in your Section 8 household\nWe didn’t live with the narcotics and violence in your household\nWe just saw it from the outside, outside, outside, outside\nOutside, outside, outside, outside\nAnd since you white, you gotta have money, right?”\n(Take it back, take it way back\nTake it way, way back to the first black man)\nAnd this young man persevered in spite\nOf what people told him he was, wasn’t, and would never be\n(Take it back, take it way back\nTake it way, way back to the first black)\nAnd that man is here today, proud\nA lover of all human beings\nRegardless of race, religion, color, creed, sexual orientation, yeah, yeah\nAnd he’s here to say:\nEven though we’re all born and created equal\nWe are not treated equally\nThere’s extremists on every side\nAnd you should just do your best to live life\nAnd let other people believe whatever they wanna believe\nAs long as they’re not hurtin' anybody\nYou can believe they’re going to hell\nYou can believe it’s not right\nYou can believe you’re superior, fine\nJust stop killing each other", "image": "https://images.genius.com/1a2c364a06d2844fd9e294ee0ea798ff.1000x1000x1.jpg"}], "artist": "Logic"}