{"songs": [{"title": "Anarchy ’87", "album": "Against the Grain", "year": "2005-08-23", "lyrics": "[Intro]\nLet's do it\nBlaze that shit up then nigga\nStop talking to me\nWhat. What\nOne thing I know is I'm a keep it hood\nKeep it hood nigga\nWe gonna go against the grain\nFuck it!\nWe gotta do what we gotta do!\nThey mad at you nigga. My nigga\nKurupt don got neal harper mutha fucka\n\n[Verse 1]\nWalking is ya thing. Get your walk on. If talking is your thing. Get your talk on. Imma make\nOne thing loud and clear. You ain't gotta go home but get the fuck outta here. Imma do what\nI do best chest to toes. Hit all the counters straight to the west coast rolls. Shut up nigga\nPeel this mutha fuckas up my nigga. As we ease up front my nigga. Got a rocket in my\nPocket and I'm ready to bust. Got a pocket rocket in my pocket nicks and dust Man\nStanding in this bitch high as apple man. The homie down the street heated than an astro\nVan. Nigga in the hall fake as as holograms. I travel like Hallmark cards sent from Japan got\nCargo floating sent from Japan. I got K's in boxes shipped from Japan nigga\n\n[Chorus]\nMake it what it is. Don't talk be about it. Shut the fuck up. Eat dick nigga on some hood shit\nBitch. Be swimming in the cut nigga. Always hem it up. Alt ta what bayou. Pentagon what nigga\nWhat..\nSelf made to stop on Death row. Hostile anarchy '87. Word to Gates 911. Made it what it is\nDon't talk be about it. Neeya Simon. Now I know you bitches can't live without it. Without\nIt. Without it\n\n[Verse 2]\nNiggas get chip from shit shipped from Japan\nNiggas get chip when shit split and expand. Expand. Expand\nYou never get anywhere nigga unless you ride. You the type of nigga to dump and then run\nInside. Side. And ain't nobody dumping back. I guess you just a bitch like that. I'll raid your\nBlocks. I hit the game up. Stop time like broken clocks. Niggas useless like broken Glocks\nSeparating flocks unorthodox ox. Born in Philly oc. The oconel got a story to tell. A tell\nLike mini tells that don't end so well. The dream you live as the hardest nigga might be the\nCapture nuisance harness nigga. No escape. No way out and no exodus. Just pure war by\nStrategies and excellence. Nigga\n\n[Chorus]\n\n[Bridge]\nLiving life. Well I am the boss. Boss. Boss\nLife I am the boss. We living life behind the boss. But not I got a hammer in my hand . What\nShould I do? Do...\n\n[Verse 3]\nThere's a bank down the street. To much temptation for a nigga like me in the straights\nStraights...\nI'm so anxious to cock back my hate. Knock niggas out the front seat. Got my heat appeal\nAnd ready for niggas to start flipping on ground like seals. Nigga I'm terrible. Awful. A\nMutha fukin ass. That don't give a fuck about talking dase. Me and the homies hit the spot\nAnd spread the raft. It's all about the cash. Cash. Cash\nHit niggas powerful as whiplash in act shift front to back. Dip past Gotti\n\n[Chorus]\n\n[Outro]\nSpending life behind the bars. Life behind the bars\nWe always keep it hood. Living life behind the bars. Life\nBitch niggas, The streets is life,Suckas\nHuh. Oh. They all upset. Hood talk. Well let's talk it hood. What you got nigga. Nigga. Yeah\nLets's ride. Pentagon riders. Stalvo - Death Row records. Smothering these sucker niggas\nIts that time. Ya'll pull me out the cut", "image": "https://images.genius.com/901ee868384c5cb1f3a23f4bff250845.500x500x1.jpg"}], "artist": "Kurupt"}