{"songs": [{"title": "I’m Scared", "album": "So Much Fun", "year": "2019-08-16", "lyrics": "[Intro: Young Thug]\n(Yo, Pi'erre, you wanna come out here?)\nOh, really? Yeah\nOh, really? Yeah\n\n[Verse 1: Young Thug]\nI'm scared to break the top (Why?)\nI'm scared to make a mess because I'm watched by the cops (Fuck 'em)\nI'm scared to count my blessings 'cause I'm being watched by my opps (Foes)\nBut fuck it, Lethal Weapon, let it rip from out the top of the drop to his scalp\nNow he out like a light (Ayy)\nEvery nigga with me slime and sheisty\nStay on the PJ but I don't sight-see (No cap)\nSomebody tell Oprah I want wifey (Call me)\nI know that lil' mama tryna fight me (Ayy)\nI got slatt engrated in my Nikes\nOh, you caught a body? Doesn't excite me (Fool)\nAll my niggas murderers, you're tiny\n\n[Chorus: Young Thug]\nRunnin' from the cops in a goddamn Rolls (Ayy)\nI just cooked a opp on a goddamn stove (Cook him)\nShot up the opp block, and I robbed all they stores (Yeah)\nSlime, do you got clocks? Nigga, twenty times four (Let's go)\nRobbed him for his dank and his car and gas tank (Let's go)\nI'ma rob that bank, I'ma, I'ma rob that bank (I'ma rob the bank)\nIf I hit New York, I take my shank like a Yankee (On God)\nThey stabbed him and he died, 'cause it's pointy and they yankin' (Woo)\nRunnin' from the cops in a goddamn Rolls (Ayy)\nI just cooked a opp on a goddamn stove (Cook him)\nRunnin' from the cops in a goddamn Rolls (Ayy)\nI just cooked a opp on a goddamn stove (Cook him)\n\n[Verse 2: 21 Savage]\nStraight up out the 6, I don't talk, I just fire (Straight up)\nBook me for a show, I put a Glock on my rider (On God)\nNiggas clout chasing, they don't want smoke, they wanna go viral (21)\nI just cooked the opp block in a deep fryer (Straight up)\nWe don't go back and forth, dawg, we really shootin' shit (On God)\nY'all riding 'round like killers, nigga, who the fuck you hit? (21)\nShe let me nut in her jaw, I would've hit raw, but she ain't have walls (21)\nThis ain't middle school, when you sucking on me, please include the balls (On God)\nThirty hanging off my TEC, gang don't tippy-toe, nigga, we step (21)\nRichard Mille cost more than all that cheap ass shit sitting 'round your neck (Pussy)\nBuster, I could've booked you for a show same price that I booked this jet (Fool)\n12 already know not to interrogate me if he got hit below the neck (Shh)\n\n[Chorus: Young Thug]\nRunnin' from the cops in a goddamn Rolls (Ayy)\nI just cooked a opp on a goddamn stove (Cook him)\nShot up the opp block, and I robbed all they stores (Yeah)\nSlime, do you got clocks? Nigga, twenty times four (Let's go)\n\n[Verse 3: Doe Boy]\nYeah, nigga flexing money, if I want it, then I'll take it (Doe Beezy)\nHeard y'all run them faces, you ain't heard? I shoot faces, yeah\nFuck shit, better save it, you ain't heard? We don't play it, uh (No cap)\nIf a nigga had some beef with us, he met the pavement, uh (Gang gang, gang)\nThis that ain't no cap at all, I can't hang around no fraud\nNiggas hating 'cause I ball, grrah, problem solved\nHit your bitch, blow out her walls, I just bust all in her jaws\nBitch, we slimy as they come, my youngin probably snake his dawg (Slatt, slatt)\nCop that Rove' (Woo, woo), and that Rolls (Woo, woo, skrrt)\nAll my niggas sick, they wipe your nose (Grrt, bah)\nAin't never froze (Nah, nah), blow my pole (Boom, boom)\nHeard you gangster, it don't count no more, you told (Pussy)\nNo, this Raf shit can't change, we just running up them bands (Let's go)\nTryna figure out which opp that's gon' get murdered with my advance (Freebandz)\nPoppin' pills, it got me geeked up, nigga, catch me when I land (Let's go)\nPlease don't play like I won't hop right off the jet, jump in a minivan (Oh really?)", "image": "https://images.genius.com/33c52a00b694afff704c64a80dad42c2.1000x1000x1.png"}], "artist": "Young Thug"}