{"songs": [{"title": "The Proud", "album": "Quality", "year": "2002-11-19", "lyrics": "[Intro]\nThe proud. Stand tall or don't stand at all, come on. Uhh, yeah. Break it down. What we do?\n\n[Hook]\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\n\n[Interlude]\nJune 11, 2001. Timothy McVeigh is executed and the country breathe a sigh of relief. Goodness prevails over evil, it seems. Somehow when he's gone, we feel safer. Little do we know\n\n[Verse 1]\nToday the paper say Timothy McVeigh's in hell\nSo everything's okay and all must be well\nI remember Oklahoma when they put out the blaze\nAnd put Islamic terrorist bombing, on the front page\nIt's like saying only gays get AIDS, propaganda\nLike saying the problem's over when they locked that man up\nWrong! It's just the beginning, the first inning\nBattle for America's soul, the devil's winning\nThe President is Bush, the Vice President's a Dick\nSo a whole lot of fucking is what we gon' get\nThey don't wanna raise the babies, so the election is fixed\nThat's why we don't be fucking with politics\nThey bet on that, parents fought and got wet for that\nHosed down, bit by dogs, and got blacks into house arrest for that\nIt's all good except for that, we still poor\nMoney, power and respect is what we kill for, for real\n\n[Hook]\nIt's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\n\n[Interlude]\nAugust 4, 2001. A drunken police officer mows down an entire family in Brooklyn. The judge lets him go with no bail. It reminds us, of just how worthless our lives are to the justice system. I struggle, to explain the situation to my son, it's hard\n\n[Verse 2]\nNiggas with knowledge is more dangerous than than niggas with guns\nThey make the guns easy to get and try to keep niggas dumb\nTarget the gangs and graffiti with the Prop 21\nI already know the deal, but what the fuck do I tell my son?\nI want him living right, living good, respect the rules\nHe's five years old and he still thinking cops is cool\nHow do I break the news that when he gets some size\nHe'll be perceived as a threat or see the fear in they eyes\nIt's in they job description to terminate the threat\nSo 41 shots to the body is what he can expect\nThe precedent is set, don't matter if he follow the law\nI know I'll give my son pride and make him swallow it all (Damn!)\nFuck the pigs! I think the pigs killed Big and 'Pac too\nIf they didn't they know who did, they got to!\nWho they serve and protect, nigga not you\nCops shot off of ten G's, but they got Glocks too\nLet you protect yourself, or better yet respect yourself\nStraight into the hospital is where you gotta check yourself\nThey be getting tips from snitches and rival crews\nDoing them favors, so they working for the drug dealers too\nJust business enforcers with hate in they holsters\nShoot you in the back, won't face you like a soldier\nKurt Loder asked me what I say to a dead cop's wife\nCops kill my people everyday, that's life\n\n[Hook]\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\n\n[Interlude]\nSeptember 11, 2001. Terrorists attack the Pentagon and the World Trade Center kills thousands and permanently scars America's false sense of security. We see the best examples of humanity in the face of the worst. As firefighters, police officers, rescue workers and volunteers of all sorts, fight to save lives. The world will never be the same again\n\n[Verse 3]\nMy heart go out to everybody at Ground Zero\nRed, black, yellow, white and brown heroes\nIt's more complicated than black and white\nTo give your own life is the greatest sacrifice\nBut it's hard for me to walk down the block\nSeeing rats and roaches, crack viles and 40 ounce posters\nPeople broken down from years of oppression\nBecome patriots when they way of life is threatened\nIt's a hard conversation to have\nWe lost kids, moms and dads, people ready to fight for the flag\nDamn, when did shit get this bad?\nAmerica kill the innocent too, the cycle of violence is sad\nDamn! Welcome to the world, we here\nWe've been at, war for years but it's much more clear\nWe got to face what lies ahead\nFight for our truth and freedom and, ride for the dead\n\n[Hook]\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride\nWe survive, it's more than pride\nWe stay alive, ready to ride", "image": "https://images.genius.com/639d018fa60e7677cf3ab227ccd69dfc.300x300x1.jpg"}], "artist": "Talib Kweli"}