{"songs": [{"title": "Who Are You", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Intro]\nHudson\n\n[Verse 1: Nas]\nHeard you got your master's\nDid college up, never looked back, now that's what's happening\nAnd it's good to see you made it out the hood\nWith a degree, a true man with passion\nNow you could enter the so-called \"White Man's Society\"\nAnd go right past 'em\nLooking in the Wall Street Journal for your face\nBut it's always absent\nThere he go, that's him\nEating flan and ambrosia, watch on his arm, golden, laughin'\nTry to get his attention, but he's flinching\nGuess my grimy clothes threw him off, so I mention\nWe were neighbors some time ago\nHe was kinda cold, in this restaurant, full of his kind and more\nHe sighed, tried to look surprised, I know\nHis side of the city where he resides, so\nI had to go, I heard him laugh hard at some sad black jokes\nHate so-called \"intellectuals\"\nNo balls, he suggests we vote\nHe stand all proud, speaking to correct his folks\nHe want to lecture folks 'cause he professional\nAnd he suggest that we don't sell dope\nAnd I guess it's true, but who the fuck are you?\n\n[Chorus: David Rainer]\nWho are you, tryna tell me who I am?\nTryna tell me who I am?\nWho are you, tryna tell me what I'm not?\nTryna tell me what I'm not\nWho are you, tryna tell me who I am?\nTryna box me in, tryna find who I am\n\n[Verse 2: Nas]\nI'm Idi Amin, I'm Marcus Garvey\nH. Rap Brown, I'm Muhammad Ali\nI'm Reginald Lewis, George Washington Carver\nI'm Nas with incredible music, let's do it\nThinking of a master plan\nSipping on disaster, smoking on gangster\nWatching niggas argue, chillin' on my bar-stool\nWith my Hell Up in Harlem hat in hand\nWith a girl named Pat\nShe more than a waitress to order your drink with\nShe divorced a banker and bought the bar\nShe got an automobile, she give an order to kill\nYou get caught and robbed, we could see your walk is off\nYou could lose your rhythm when you outta the gutter for a while\nYou easily go to soft from hard\nNow we all about hustlers, number runners, hoes and sharks\nAnd we all know the code of the block\nAnd you talking some gibberish, anti-nigga shit\n'Cause you marched back with Rosa Parks?\nBrother, don't start, go build your Noah's Ark\nYou could float to the end of the world, and pretend what you not\nBut I know what you are\nWhile I roll in my car, and I'm spending my knot\nWhile my enemies plot, you ain't out of the shot\nMatter of fact, you're an easier target\nAnd I respect everything you accomplished\nBut I hope I never get old and talk that nonsense\nSo who the fuck are you?\n\n[Chorus: David Rainer]\nWho are you, tryna tell me who I am?\nTryna tell me who I am?\nWho are you, tryna tell me what I'm not?\nTryna tell me what I'm not\nWho are you, tryna tell me who I am?\nTryna box me in, tryna find who I am\n\n[Outro: Nas]\nShe Queen of Nzinga\nWinnie Mandela, Ida B. Wells\nWhy can't you tell?\nWhy can't you tell?", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}