{"songs": [{"title": "Tim Westwood Yonkers Freestyle", "album": null, "year": "2011-06-15", "lyrics": "[Verse 1: Method Man]\nUh oh you shoulda give me this beat.. I woulda... What?! Hold on, lemme see if I got something for this... no no no no lemme see. Lemme see\n\nUh oh, uh oh, uh oh uh oh. Uh oh, uh oh, uh oh uh oh\nCrime scenes, coppers and sirens, helicopters and high beams\nThe tensions is rising, fiends keeping their pipe clean\nThis is what life mean? A dollar and a dream everybody wants nice things\nThe kid was only nineteen, holding his chest now he's fighting\nFor his last breath, he's seeing death it's frightening\nThe grip on the ghetto is tightening, you try to do the right thing they do you just like King\nNow I can hear the night scream, sirens and light beams\nFiring off bad shots, hittin' people they ain't mean to pop\nThe neighborhood's in shock, block extremely hot\n'Nother black teen shot that's a dull routine to cops\nThey shoulda got good grades, worked a minimum wage\nNow he layin' on that stretcher with nothing in him to save\nKeep it ghetto and whatever ghetto you at\nJust don't love the ghetto, cuase the ghetto don't love you back\n\n[Verse 2: Masta Killa]\nTryna' be around this music it's therapeutic, first thoughts of the day it's so clear\nWhen I walk in my head there's a voice that talks, in my ear I can hear it so clear\n[Method Man] You think i'm buggin right?\n\n[Verse 3: U-god]\n\nListen, oh shit.... Yo\nThe average man wouldn't last that long\nShe like to work out, run marathons\nShe wear tight skirts with no panties on\nShe's a six foot one bronze Amazon\nSingin', complaining all the good men is gone\nI'm from Babylon, she reads the Qur'an\nVisits all the jails and the nail salons\nShe rock Coco Chanel, her smell was strong\nWith skin like velvet she rocked my bed\nShe gave me long head, sipping Long Island Red\nShe spread eagle at the tip of the bed\nShe rubbed on her legs this is what I said\nRap music's therapeutic to me, rap music's therapeutic to me!\n\n[Verse 4: Method Man]\nHey yo\nYou ain't lived till you made your first million\nAnd top models wanna swallow your children\nI thought I told you Wu Tang is for the children\nWay before rap movin' crack in your buildings\nYeah, now what’s the price of rice in China?\nThese women tryin' to raise the price on they vagina\nMe? I’m trying to live the life and get the grind up\nLike Diddy, but I ain’t trying to give the Shyne up\nPop pop, pop-off no question, see Ol' Dirty, like it raw no protection\nWhen the kid hold court, no objections\nMeth needs his money at the door, no exceptions\nI go hard in the paint on a rapper\nI go harder on a pussy no Viagra\nYou think I’m tripping, ain’t into tricking\nBut keep a snow bunny in the kitchen\nI’m the master like Killa", "image": "https://i.genius.com/aad2bc9337efc98a53e8e0991742a43b0fa677c5?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcS7sZ1qUqnA%26t%3D7m57s"}], "artist": "Method Man"}