{"songs": [{"title": "Never Be the Same Again", "album": "Bulletproof Wallets", "year": "2001-11-13", "lyrics": "[Intro: Ghostface Killah]\nYeah, damn mom\nIt's gone be aight, don't worry about it\nKnow what I'm saying, I'ma just go\nI'ma just pack my shit\nPeace out, aight\nDon't worry about it\nI still love you though\n\n[Hook: Carl Thomas]\nI'll never be the same again (I'll never be the same again)\nI'll bet you'll never understand (I'll bet you'll never understand)\nThe things you put me through (Ooooohhhh)\nI tried to be a better man (I tried to be a better man)\nBut you'll never understand, noooooo\nNow it's time that I move on (Move on!)\n\n[Verse 1: Ghostface Killah]\nEy yo I gave you everything and you still fucked my head up\nChildren (I'm sorry Ghost) Not now, shut up\nGot back off the road, heard you sleepin' with fam\nThe whole hood ran up on me, I was like \"Damn!\"\nSo I stepped back, sized the whole situation patiently\nArguments, face up in the air like you hatin' me\nAsk you one question, was it good?\nHe have you on the wall like me, was it hood?\nYou probably showed him your sexy faces, how you ride on top\nGrabbing the sheets, in a deep zone if he hit the spot\nI came home on Friday, Saturday I found out\nThat night I cried with the kids, I was out\nAnd my man, I'ma do him in\nAnd the Lord knows best what I'ma do to him\nAnd you can keep the crib - all I'm sayin' is\nLet me find out you got men around my kids\n\n[Hook: Carl Thomas]\nI'll never be the same again (I'll never be the same again)\nI'll bet you'll never understand (I'll bet you'll never understand)\nThe things you put me through (Ooooohhhh)\nI tried to be a better man (I tried to be a better man)\nBut you'll never understand, noooooo\nNow it's time that I move on (Move on!)\n\n[Verse 2: Ghostface Killah]\nIt was the beauty that caught me and held my soul hostage\n'Member those days had you smellin' my boxes\nOld Gold up in the hood and Big Dup\nWe could push through the grimiest streets\nThen throw it up, like \"That's my nigga!\"\nAnybody got something bad to say\nSon'll come through and deliver\nBrushin' off his 88 clocks, y'all can't touch him\nI bet a wad on it, y'all can't fuck with him\nSemi-shy, and I'm laid back, crystal hats\nHeard ya water broke I was like \"Phewww\" and ran back\nI ran back fast, broke my arm in the mix\nTo find out that bird nigga tappin' my shit\nIt's alright 'do, maybe he came up with the right dough\nBigger dick, I don't know, must have been the best flow\nThis thing here, ever man in the world goes through\nBut fuck that, I put a lot of money up, I'm hatin'!\n\n[Hook: Carl Thomas]\nI'll never be the same again (I'll never be the same again)\nI'll bet you'll never understand (I'll bet you'll never understand)\nThe things you put me through (Ooooohhhh)\nI tried to be a better man (I tried to be a better man)\nBut you'll never understand, noooooo\nNow it's time that I move on (Move on!)\n\n[Bridge: Carl Thomas]\nIt was like ecstasy girl\nFound out it was Disney World\nHad us living in a fantasy world\nI wish we never broke up, girl\nIt was like ecstasy girl\nFound out it was Disney World\nHad us living in a fantasy world\nI wish we never broke up, girl\n\n[Verse 3: Raekwon]\nEy yo, you killed me with that, \"who bought this?\" I bought that\nKnowin' damn well in all reality you bought jack\nYou ain't lift one finger, but you claimin' what's yours\nRunnin' all through the house, bugged out, slammin' doors\nWe used to dress like twins - sweats, baby blue Timbs\nYou even scratched my Benz, let the pigs in\nYou think that I'm the biggest bird in America?\nCatch me on TV, I'm come back, never the...\n\n[Hook: Carl Thomas]\nI'll never be the same again (I'll never be the same again)\nI'll bet you'll never understand (I'll bet you'll never understand)\nThe things you put me through (Ooooohhhh)\nI tried to be a better man (I tried to be a better man)\nBut you'll never understand, noooooo\nNow it's time that I move on (Move on!)", "image": "https://images.genius.com/bab7a4314966fc9b9d114f36fd959fd7.600x600x1.jpg"}], "artist": "Ghostface Killah"}