{"songs": [{"title": "Partytime", "album": "Born to Mack", "year": "1987-07-20", "lyrics": "Party time\nIt's party time\n\nWithout a doubt I'm coming back and I would do it again\nYou can take away my beat and don't touch my pen\nMy name is Short that's so fake because I rap so long\nOther rappers hear pop I put funk in this song\nYoung tender on the floor wiggle it all\nHomeboy keeps telling her to give him a call\nHe's been on her since ten and it's almost two\nWalking through the party with his dick on the roof\nTryin' to catch a little freak in the mini skirt\nShe was dancing real nasty all the boys like her\nYou can handle like a dog but you won't get game\nYou'll only get dog fake number and name\nShe's a mother to be and you better believe\nYou'll be looking at her mean next time you meet\nYoung tender won't care, she's still fine\nHere you come again with your playboy lines\n\nYou don't stop\n\nThe party start jumping five hours ago\nThe mix don't stop till it's way past four\nAt three A.M I hit the scene\nBuck-toothed freaks drop at three-fifteen\nPull out with one ditch the other\nI jumped in my ride and I burnt rubber\n\nParty time\nGet busy\nToo Short\n\nShe's the one, love those legs\nDanced two records but it seems like days\nBaby so fine I keep telling myself\nI want the young tender under my love spell\nShe could be all mine, nothing more or less\nLife with a smile never, ever depressed\nI give her ever lasting love around the clock\nBaby doll it's you and me so just rock\n\nBreakdown\n\nAll you superficial rappers will cease to exist\nIf I come into a party hitting raps like this\nThough I make you feel weak when you want to be strong\nYour soft so buddy as I state in my song\nAccording to the scriptures in the book of rhymes\nBiting on a line is considered a crime\nUnintelligent? Yes!\nNever fresh!\nRUN DMC tattooed in your chest\nI'll tell you one time and one time only\nYou might be fresh if you weren't so phony\nThe ability to rap is a gift from God\nAnd your biting what your writing and it won't be bought\nAt the spur of a moment I will bust a rap\nSimultaneously jamming with the beat in the back\n\nParty time!\nGet busy\nParty time\nParty time so get busy\n\nShake it, bake it, make it, break it\nWork that body girl just don't fake it\nI'm the kinda brother for a girl like you\nI can see in your eyes that you know it's true\nI'm the mack and the ? from the big Oak Town\nLaying track by track that vicious sound\nAll you sucker MC's hating my face\nEven though there's not a rapper who could take my place\nYou better hook\nLook\nOr just get took\nI know what you're about, see I read you like a book\nDesperate dreams are on your mind\nWith a 10 foot mic you couldn't touch my rhyme\nI'm impeccable rapping\nDon't stop capping\nFront one time and you'll see what happens\n\nParty time\nGet busy\n\nSo fresh to the sound\nI get down\nI'm so fresh from the Oakland town", "image": "https://images.genius.com/2cbe54aeda332def6155f0b3b28b1321.1000x1000x1.jpg"}], "artist": "Too $hort"}