{"songs": [{"title": "Masters of Our Fate", "album": "Shaolin vs. Wu-Tang", "year": "2011-03-07", "lyrics": "[Chorus: Audio Sample]\nNow we are the masters of our fate\nThat the task that which has been is, is not above our strength\nThat its pangs and toils are not beyond our endurance\nAs long as we have faith in our cause\nAnd unconquerable will power\nSalvation will not be denied us!\nSalvation will not be denied us!\nSalvation will not be denied us!\nWe are the masters of our fate!\nAs long as we have faith\nAnd unconquerable will power\nSalvation will not be denied us!\n\n[Verse 1: Raekwon]\nThe time has come, I just begun, this is designer rum\nMy wallet got flowers on it, killer cowards from milan\nThe stolen land where gold chains control a man\n300 holdin hands, stolen grams\nI play the fan, and wave and leave that nigga for dead, or should I save him?\nSpittin out phlegm, no, just grave him\nI remember days I used to work for niggas, eat jerk with niggas\nBuyin whippids, laughing at jokes and try to flip\nClip is loyal, fly spoil on the block, display royal\nEven though we go back to royals, black oils\nLive as ever, can’t tell me nothing\nWhatever this thing of ours is empowered by my niggas who pumping\n24 hours of sling motion, wave brush\nYa'll knew my hair was the ocean\nRunning through the building just nego-tion\nSome of the creeps knew me very well\nKnew he would sell, knew he was potent\n\n[Chorus: Audio Sample]\nNow we are the masters of our fate\nThat the task that which has been is, is not above our strength\nThat its pangs and toils are not beyond our endurance\nAs long as we have faith in our cause\nAnd unconquerable will power\nSalvation will not be denied us!\n\n[Verse 2: Black Thought]\nOk, bridges I burned some, lessons I learned some\nMoney I spend some, lent some, earned some\nMy eyes tell a tale of the hell I returned from\nSpark up a L for the homies I haven't heard from\nBurn when the urge come\nI’m living lurge(large)\nNever chilling on the curb, just a villian on the verge, son\nMy tenth shot is as official as the third one\nSecond one, first one\nWorse come, the worst run\nWhen I was pushed out of the womb the earth spun\nThe only way to describe this is inertia\nSome rappers think they could try me, Who the first up?\nI don’t guarantee no survivers, nigga surfs up\nYeah, soul on ice, courage and sacrifice, hold on tight\nAnd save your laughter for the afterlife\nThese chumps thinkin they good, ain't even half as nice\nYour fate will be a one-way ticket to paradise\n\n[Chorus: Audio Sample]\nNow we are the masters of our fate\nThat the task that which has been is, is not above our strength\nThat its pangs and toils are not beyond our endurance\nAs long as we have faith in our cause\nAnd unconquerable will power\nSalvation will not be denied us!\nSalvation will not be denied us!\nIn the words of the [?]\nHe shall not be afraid of evil tidings\nHis heart is fixed, rafting in the Lord", "image": "https://images.genius.com/bd1e2ea326f22bdcaa7332457249e1c5.1000x1000x1.jpg"}], "artist": "Raekwon"}