{"songs": [{"title": "Joey Bada$$ Freestyle | LA Leakers Freestyle #005", "album": "LA Leakers Freestyles", "year": "2017-03-21", "lyrics": "[Verse 1]\nFinally got a piece of the profit\nWine and cheese in the seat by the cockpit\nI ain't mean for your bitch to be watchin'\nI am me, she kept eyein' me\nEveryday we just makin' deep profits\nMoney long, I'm gon' need some deep pockets\nHands are to the ceiling when I'm in the building\nHow you make a living, hmm?\nLately never chillin', mind is on a million things I gotta do\nLadies want me, when there no time for chillin' no time for you\nI've been on a different type of time\nI never liked to rest, a different type of grind\nI'm on South Beach like Tony Montan'\nFeelin' like the whole world is mine\nAnd I sit back, let your mind run\nNo man knows when his time gone come\nEvery action, think about the outcome\n'Cause I never outrun no bullet from a gun\nDon't ask Malcolm, ask how come?\nAsk any real nigga really 'bout some\nWhen you in the field, nigga don't play dumb\nBetter keep your eyes peeled in the rearview\nKnow a couple niggas in the ville will kill you\nRun up in your hands in the wheel and air you out\nNever give a fuck, never hear you out\nNews clip poppin' up about you whereabouts\nYou don't really want the war so don't go there\nGot my middle fingers up in my underwear\nWhen I'm fuckin' the world on some G shit\nWith the waviest flow, make you seasick\nHope you can swim in the rhythm I'm deliverin'\nShe drown, I'm tellin' her to get a friend\nWhite girls and they love me for my melanin\nKiss me all over my brown skin\nI got the soul of a black king\nIt takes control when I'm rapping\nLet the bitch unload like a MAC-10\nDrrtt! Drrtt!—that's all that happened\n\n[Hook]\nBlast off, blast off\nBlast off, blast off\nLift off, lift off, lift off\nSaid I'm 'bout to lift off\nLift off, L.A. Leakers lift off\nLift off, said we 'bout to lift off\n\n[Verse 2]\nHol' up! These rap niggas be actin' up\nTalk mad shit, can't back it up\nDon't let me catch you lackin'\nI pack you inside the Maxima\nMark them days on the calendar\nDon't you dare dodge this challenger\nSonics is hedge-hodgin'\nGot heads boppin' way out in Africa\nRadios be lackin' though\nYou can't front on talents so\nI'ma kill like every show and any foe and any flow\nNo flex when I be in the zone\nKnow to watch when I come on\nI check-in in the microphone\nCollect this check then I'm headin' home\nBut it ain't always been like this\n'Member when we was broke as shit\nSavin' L's 'til next week\nMy ashtray still got a roach in it\nI hit it until my finger tips\nGet burnt at the filter tip\n'Fore I learn to take a risk, I ain't even had a pot to piss in\nListen, I'm twistin' the system\nThe mission, the recognition\nI see the future clearly: my premonitions is scary\nPray that they bury me\nWhere my soul has been heavenly sent\nFor the fathers and martyrs of this art that we formin'\nWe call it hip hop\nNigga, guess you must've forgot", "image": "https://images.genius.com/1eec180859a1269f6fae60821ba3df8b.600x576x1.jpg"}], "artist": "Joey Bada$$"}