{"songs": [{"title": "Lollipop (Remix)", "album": "Tha Carter III", "year": "2008-06-10", "lyrics": "[Intro: Lil Wayne]\nNo homo\nI say, he's so sweet, make her wanna lick the wrapper\nRemix, baby!\n\n[Verse 1: Kanye West]\nLollipop, lollipop, breastses just like Dolly Parton\nShe ride my spaceship 'til she hit the top\nThat hit the spot, 'til she ask\n\"How many li-i-li-i-licks do it take 'til she get to shop?\"\nDon't worry why my wrists got so freeze\nTell her, \"Girl, like Doritos, that's not yo cheese\"\nTell her friends, \"Like Fritos, I'm tryin' to lay\"\nI can't only have one and I ain't tryin' to wait\nThis a song with Wayne, so you know it's gonna melt\nBut you ain't finna murder me like everybody else\nI'ma rap like I got some type of respect for myself\nI don't do it for my health, man, I do it for the belt\nMan, I do it to the death, 'til the roof get melt\nHundred degrees, drop the roof, so the coupe don't melt\nMan, the flow so cold chicken soup won't help\nWe need fo' mo' hoes, we need oh-oh-oh-oh!\nYou know what it is when we're outta town\nWe ball in two-seats, and you out of bounds\nSo come here, baby girl\nYou're now fuckin' with the best in the world\nLollipop, the best in the world\n\n[Chorus: Static Major]\nShe lick me like a lollipop\nShawty want a thug\nBottles in the club\nShawty wanna hump\nYou know I like to touch\nYour lovely lady lumps\n\n[Verse 2: Lil Wayne]\nShawty say she wanna lick the wrapper\nAnd she gonna lick the rapper\nAnd I just wanna act like a porno-flickin' actor\nI Anita Bake her, now she caught up in the Rapture\nI got so much chips I swear they call me Hewlett Packard\nI got so much chips you can have a bag if you're a snacker\nGreedy motha-fudge cake, now tell me how that fudge tastes\nI do it for Bloods' sake, soo-woo, think it's voodoo\nHow that roof do di-di-dissipate, your girl wants to participate\nShe so so sophisticate, 'cause her brain is off the chain\nAnd then my diamonds are in the choir\nBecause they sing from off my chain\nAnd my Nina just joined the gang, because all she do is bang\nLike Ricky Martin, Wayne and Kanye: pick your poison\nIf that woman wanna cut, then tell her I am Mr. Ointment\nTell her to make an appointment\nWith Mr. I-Can't-Make-An-Appointment\nTake my lollipop and enjoy it\n\n[Chorus: Static Major]\nShawty want a thug\nBottles in the club\nShawty wanna hump\nYou know I like to touch\nYour lovely lady lumps\n\n[Verse 3: Lil Wayne]\nWhy would she? She probably be the odd cookie\nIn the plastic bag 'bout to get crushed by a building\nI flushed out the feelin' of me bein' the shit\n'Cause I was leavin' skid marks on everywhere I sit\nI am everywhere, I'm it, like Hide-n-Go\nAnd I can go anywhere: innie, minnie, miney, mo\nI'm in your neighborhood, area, CD thing, tape deck\nIPod, your girlfriend, and she say I got great sex\nSafe sex is great sex, better wear a latex\n'Cause you don't want that late text, that \"I think I'm late\" text\nSo wrap it up!\nBut he's so sweet she wanna lick the wrapper\n\n[Chorus: Static Major]\nShawty want a thug\nBottles in the club\nShawty wanna hump\nYou know I like to touch\nYour lovely lady lumps", "image": "https://images.genius.com/25a03935e85a9fad302e477f5718dc08.640x640x1.jpg"}], "artist": "Lil Wayne"}