{"songs": [{"title": "Haile Selassie", "album": "DROGAS WAVE", "year": "2014-10-24", "lyrics": "[Chorus: Nikki Jean & Lupe Fiasco]\nHaile Selassie, high as the eyelids of osprey, I'm thriving\nPoseidon, your trident can't stop me, from diving\nI'm looking for my, looking for my, looking for my, as I float\nBrand new shell for my ghost, tattoos all on my coast\n\n[Interlude: Lupe Fiasco]\n\"Throughout history, it has been the inaction of those who could have acted\nThe indifference of those who should have known better\nThe silence of the voice of justice when it mattered most\nThis, has made it possible for evil to triumph.\"\n- Selassie, uhh\n\n[Verse 1: Lupe Fiasco]\nMan's limitation, transfiguration\nHaka dance done at the welcome to the demo\nModern man comes to the weddin' in the limo\nMixin' doves with the rice rain\nUncle Ben's off the rails on the night train\nAnd that storm took us to the platform, pushas\nBack to the bachelor's backdoor, unhook us\nHope this track take you back to where the fat girl pushed us\nAnd that's very old\nLike Blackberry Bold but the juice\nSweeter than where the party at, or\nReleasing these niggas from the roofs, and\nLeavin' these niggas on the loose, or\nKeepin' these niggas in the coops, and\nLeavin' these niggas on the noose, free!\nShamu fan got a world to see!\n\n[Chorus: Nikki Jean & Lupe Fiasco]\nHaile Selassie, high as the eyelids of osprey, I'm thriving\nPoseidon, your trident can't stop me, from diving\nI'm looking for my, looking for my, looking for my, as I float\nBrand new shell for my ghost, tattoos all on my coast\n\n[Interlude: Lupe Fiasco]\n\"Then until the philosophy which holds one race superior and another inferior\nIs finally and permanently discredited and abandoned\nThat until there no longer first class and second class citizens of any nation\nUntil the color of a man's skin is of no more significance than the color of his eyes.\"\n- Selassie\n\n[Verse 2: Lupe Fiasco]\nTo the limit, the limit in the Methadone clinic\nRidin' with the pack like a Peloton\nFlyin' with the sack in the trap like the pregnant\nAs it breaks in the backs from the cracks that we step upon\nIf I triple my worth, will it cripple my mom?\nIf I simple my search, will it mental my calm?\nWill it hurt if I give you my palm?\nTo tell in it, don't put a nail in it\nHow you gonna see the world if you a whale in it\nAnd readin' my palms like there's braille in it (braille in it)\nIs it the trail or the forest? (forest)\nOr the forest with the trail in it?\nThat's a sail with a 12 in it\nWater coming through from impalin' it (water come through for me now)\nNothin' left of the boat but my holes\nStill I fill up the world and I float like Haile\n\n[Chorus: Nikki Jean & Lupe Fiasco]\nHaile Selassie, high as the eyelids of osprey, I'm thriving\nPoseidon, your trident can't stop me, from diving\nI'm looking for my, looking for my, looking for my, as I float\nBrand new shell for my ghost, tattoos all on my coast\n\n[Interlude: Lupe Fiasco]\n\"A qualified man with vision, unmoved by daily selfish interests\nLed to right decisions by his conscience\nIn general, a man who knows from whence he comes\nAnd where he's going will cooperate with his fellow human beings\nHe will not be satisfied with merely doing his ordinary duties\nBut will inspire others by his good example\nYou are being watched by the nation\nAnd you should realize, that you will satisfy it if you do good\nBut on the contrary, you do evil\nIt will lose its hope and confidence in you.\"\n- Selassie\n\n[Verse 3: Lupe Fiasco]\nHydrant open wide, on the side of the colonized\nSwimmin' in the street, fell asleep on my mama thighs\nBlockin' out the noise that destroys little boys\nLive enjoy, ships ahoy, get deployed by the rock-a-byes\nD-d-d-deep into the sea of my dreams\nLyin' fall asleep at the feet of my queen\nHawk, I'ma write to the beat of your wings\nSong for the Ethiopian King, Haile\n\n[Chorus: Nikki Jean & Lupe Fiasco]\nHaile Selassie, high as the eyelids of osprey, I'm thriving\nPoseidon, your trident can't stop me, from diving\nI'm looking for my, looking for my, looking for my, as I float\nBrand new shell for my ghost, tattoos all on my coast\nHaile Selassie, high as the eyelids of osprey, I'm thriving\nPoseidon, your trident can't stop me, from diving\nI'm looking for my, looking for my, looking for my, as I float\nBrand new shell for my ghost, tattoos all on my coast", "image": "https://images.rapgenius.com/e88f6bf2759bf04268d43038a9e82d2e.640x640x1.jpg"}], "artist": "Lupe Fiasco"}