{"songs": [{"title": "Macklemore Freestyles on Flex | Freestyle #073", "album": "Funk Flex Freestyles", "year": "2017-09-18", "lyrics": "I went from backpack rap, I thought that was the ceiling\nNever thought my underground ass would touch a million\nWrist two tone looking like a fucking penguin\nAnd tell PETA, yes, this is a plush chinchilla\nI said woo\nBeing modest, Funk Flex the bomb threat\nThe music department rejected me in college\nSo shout out to my alma mater\nYou know I got a couple Grammies that y'all can borrow\nNah nah\nI'm still winning, I'm still any, they still envy\nStill directing fans, no labels trying to steal pennies\nThe white walls clean as hell and they still spinning\nStill buying bootleg shit, this isn't real Fendi\nI pop off, get topped off\nMy watch got us looking like bath salts, the bezzler's crack rocks\nI wrote the playbook, no time to coach mascots\nGet your ass out of here, that goes for all of y'all\nGo politic at Comic Con, homie, knock it off\nGot my own kid to raise, you are not my job\nMamase, mamamakusa, bumping Chaka Khan\nThe other day, and another dollar in my pocket y'all\nWho told you I was falling off?\nThey lied to you, oh I'm booboo? No, not at all\nI hit your city and get litty, hoo, problem solved\nAnd throw a party with some cougars and some soccer moms\nThe champ, I come through, I slide through, I slam doors\nBench press arenas, and slam journeys, and dance sports\nCrash course, the whip looking like transformers\nNow I'm heading home 'cause Family Matters just ask Laura\nDrop another one, oh my God, hold applause\nWanna kick you while you're on your way up, they so Solange\nMy compadres eating empanadas, all my folks is on\nOn the autobahn, pushing Maseratis like old cars\nI'm so hot, I'm so damn hot could holler at the stars\nProbably could have fucked a couple, kept my Johnson in my drawers\nDon't want to box with God, competition? Not at all\nTake my shirt off, take my rings off, and I holler World Star!\nTweet that link, you get DDT\nMollywhop your squad, BBD\nBack in school I used to dream about this job, TNT\nRIP Craig Sager, that's my fucking dog\nAnd my suit game vintage, so Magic Don Juan\nHold up, if Jay or Ye is Jordan, and Kendrick is LeBron\nAnd Drake is Westbrook, and Durant is Big Sean\nThat means that Cole is Curry, and Eminem is Bird\nI'm not playing in the league to sit behind Dirk\nI said, one ring?\nFuck that, I'm on my third\nThis is unseen, bust past rapping on first\nI had one dream, to travel around the earth\nWith a 16, turn an arena into a church\nNow can I preach to 'em, Flex?\nThey said one hit wonder, yeah?\nFive platinum hits later, yes\nAnd Gemini September 22, yes", "image": "https://images.genius.com/ebe93e7d0d1706bd5ed421806aa03cd7.1000x563x1.jpg"}], "artist": "Macklemore"}