{"songs": [{"title": "Catharsis", "album": "Rejex", "year": "2012-01-01", "lyrics": "[Verse]\nVigorous, the illest realest lyricist\nI'm sick like syphilis\nGot a certificate for killing shit\nAnd any innocent who witnesses the fucking incident\nGot a team of militants\nPunch lines, crunch ligaments\nThis is Mr. Bada$$, the young villain\nHide the children and hide the women\nThere's no slides when you're caught slippin' so be cautious\nA homie keeps a gorgeous twelve gauge\nSo if you run your mouth, your jaw gone\nThe double entendre, monster\nNiggas thank me, say I'm number one in the rankings\nI tell 'em it's an honor\nCause these niggas faking and they nada\nFuckin' stupid Malagas, part of the Espana\nI sip on Coladas and feel your chick tatas\n'till I bust like pinatas\nOnly true Shotta, come kill 'em with the Patois\nSame time, met the gal, and up for dagga, that's word to Spragga\nI'm a young Wayne, I'm going insane, Liu Kang\nSuper Saiyan whenever the loops be playing\nOnly be a kid, but yo, see if the youth's playin'\nWhen the doobs flamed, I get enlightened 'til I be in Zeus' lane\nFind that quite amusing, I bone her like museum\nSit back, relax, and watch her bring it back, Boomerang\nNow bring that back like poo stains in your new jeans\nNo need to be too ashamed\nIf you didn't get that the first time like new names\nIn my city, I be Bruce Wayne\nYup, cause when I get put on\nI got them like new J's\nHe say, she say, who say that I'm not the next young Lupe\nThe one-handed shit you got to say, to you, touche\nI'm the type to pull a dyke and only hit it on Tuesday\nYou the chump that when I come, it feel like it be Doomsday\nCause the flow is Apocalypse\nYou say them niggas ill\nBut they still ain't even shocking us\nYo, who the fuck is stopping us?\nA bunch of nice niggas with aim like who blocking us?\nBK where we stay, but you can still see the Pac in us\nOh, no disrespect to Diddy\nDon't mean to be sadity\nBut I plan to conquer my city like yo, it's no Biggie\nNo really, it's no biggy and 50 can't bother\nIn a few years I plan to outshine Mr. Shawn Carter\nLook at the war I done started\nNotice the cartharsis revealed by the appeal of this young artist", "image": "https://images.genius.com/f19a23d547500fb2fba75dfe154e60cb.500x500x1.jpg"}], "artist": "Joey Bada$$"}