{"songs": [{"title": "Not Going Back", "album": "Hip Hop Is Dead", "year": "2006-12-19", "lyrics": "[Intro: Nas and Kelis]\nWhat nigga! What bitch-ass niggas! What!\nBabe, babe, start the car!\n(Nasir, come on, let's go!\nGet in the car now, let's go! Throw it out, let's go!\nAight, aight, aight, yeah\nBut I got 'em. But I got 'em, though\n(This is crazy, why didn't you just throw it out of the car?\nThis is so stupid, what are you doing?\nWhy are we even out here?\nWhy are we out here? What's going on?\nThis is retarded, yo, we gotta…\nThis is crazy. Never again\nYou'd throw everything away, for what?\n\n[Verse 1: Nas]\nYeah, my man Kool G Rap told me, \"Son, do not look back\"\nChill up in the mansion with a fat glutious max, relax\nWhen people act schoolin' with facts, tell 'em\nAt this point in my life I'm all about chillin'\nRidin' around in something sick and the dress flies\nAnd twist, homie's hermano just died, I gotta let it ride\nThat's what I got the public thinkin', my nigga\nJust ‘cause I ain't in the hood don't mean shit, my nigga\nI know who died before the body dropped\nI know the guns that were used\nHow much money the shooter got\n‘Cause on the private yacht I'm still within earshot of it all\nThe top ten list of the most grimiest guys of all time\nIs all we talk when we talk in New York, y'all\nWho to call and who to stay away from\nWhose mother's address to have just to play it safe, son\nWomen they lust up so quick to give 'em up\nWhat cars and what trucks they drive in\nWhat towns they spend the most time in when they grindin'\nI found out most of them are cowards\nThey hidin' behind reputations that's sour; I'm not going back\n\n[Hook: Kelis and Nas]\nThe streets keep tryin' to say\nCome back around this way\nI've already gone that way\nI won't go back today\nI'm not going back!\nX2\n\n[Verse 2: Nas]\nFirst thing that happen when you make a little paper\nYou think the Marriot is livin' in a skyscraper\nTill you come across some ever more flyer paper\nRealize that five-star tellies are even greater\nTerry-cloth robes, elegance, movie shit\nHeated-up marble floors with jacuzzis in it\nFirst-class flights, diamonds in your crucifixes\nAll those things, you still ain't really doing shit, kid\n‘Cause in reality, I'll earn my salary\nThe way I flaunted it then would now embarrass me\nIt kinda make me wanna hate bling\nIt's a race thing how they sell blacks to bootleg shit\nIn fact, real millionaires spend 60 mil on paintings\nWhores charge niggas with raping\n‘Cause we come out doors of Maybach cars\nWatch us make bets on race tracks, smokin' cigars\nSo they counter the laws to take what's ours\n'Bout 500K on a lawyer to beat the charge\nSo you can't stop us from making a billion dollars\nInstead of going back, I'm buying the projects\nBut I'm not going back\nThe hood's in me forever y'all, but I'm not going back\n\n[Hook]\n\n[Outro: Nas]\nAnd of course y'all know what I'm not going back to\nThose no friends of mine… (And I'm not going back to)\nTen carat gold, it shine… (And I'm never going back to)\nSony, if they don't have dough to sign…\n(Not going back to)\nY'all know that I'm not going back to\nThose liars who would… (Not going back to)\nNot help you if they could… (Not going back to)\nCoke on the stove in the hood…\nY'all should know that I'm not going back\nThe hood's in me forever y'all, but I'm not going back\n\n[Hook]", "image": "https://images.genius.com/ff6738f83747060eafd4a7af4964cd8f.1000x1000x1.jpg"}], "artist": "Nas"}