{"songs": [{"title": "Line In The Sand", "album": "The Bar Exam 4", "year": "2017-06-20", "lyrics": "[Intro]\nMy nigga King Los just tweeted out he the best\nCyhi know he the best?\nMy nigga Ab-Soul say he the best\nAnd even though I think these guys are three of the freshest, ever\nI look at opinions like I look at lickin' an asshole, I respectfully disagree with that\n\n[Refrain]\nBar Exam, where is the competition?\nBar Exam, where is the competition?\nBar Exam, where is the competition?\n(There is no competition)\n\n[Verse 1]\nI like guns more, you the type to knife\nI'm more the candy paint type, you more the Mike and Ike\nI'm from the 'Mo, I'm more the type to drive the Ghost tonight like I'm the Poltergeist\nEmbracin' crime like I'm supposed to die\nThe face of crime, like I'm the closing eye's poster guy\nI'm more the type to hold the door, I'm nice\nCall me \"so polite\", dawg you Molson Ice\nPrototype of pulverizing mics, avoid life's\nRollercoaster ride through polarizing alcoholic lows and highs\nI'm more the type to go incite the riot\nThrow hollows and watch them go in your body as though they got invited\nNot of this Earth trying to be godly of death cause I was Gotti at birth\nMight as well write a lot of these verses while I'm inside of a hearse\nTake your broad, show her more than just a front door and call that shit Lurch\nProlly gonna be the first artist to add a body to his body of work\nMy discography just like a map to rapper body bags\nNow process that, I might just drop a track where Jim Hoffa at\n\n[Intro Refrain]\nMy nigga King Los just tweeted out he the best\nCyhi know he the best?\nMy nigga Ab-Soul say he the best\nAnd even though I think these guys are three of the freshest, ever\nI look at opinions like I look at lickin' an asshole, I respectfully disagree with that\n\n[Verse 2]\nWe can agree to disagree, we can leave it at that, or we can bet\nEven if smack ain't got the fee correct\nAny supposedly ill rapper can get it for free\nFeared, revered rappers, Lupe Fiasco, tweet or text\nHand on the Desert Eagle squeezing the reapers neck\nWe can go for broke til things get repossessed\nWe can flow for keeps, go til either one of us slumped over the speaker dead\nYou takin a decease in that,  I'm hoping to be the next\nGreatest of all time, while these hard lines shake up the web\nYou facin' an ethernet\nAnd no this ain't no Kendrick Control move\nThis just a flow that never gets old, Malinda Williams in Soul Food\nHow could you Violate somebody who got Chris Lighty wisdom, who never bluff\nThem twin rifles is coming out looking like Blue Ivy siblings, better trust\nEverything on your mind that be on your lap like private dancers trappin\nI'll put three in your cap, it's not a good time to try and chance the rapper\nNah, I'm old school, still trying to dance with Patra\nHoes finding Vanity from The Last Dragon tryin' to romance the master\nYou need to hire a yes man to talk you off your competitve edge\nMy foot on the ledge tripping on all these woulda been, coulda been, shoulda been terrace(?)\nNobody round this bitch is better than me\nYou the competition? Only props I'll give is you bout good as dead\nI don't do memes and bickering, I see you out swing for the fences\nI don't like coonin' unless you Mary Blige singing for chicken\nY'all hopeless, every time y'all spit it I just envision lies\nThe gods focus, I ball doper than Lamar Odom already wishin' a nigga would\nLike Charles Oakley, in the Wizard of Oz\nMy niggas got they rags and sticks in the sky, like they hitchin' a ride\nUh, I'm sitting here counting this grip cuz I be standing for change\nThis bigger than any kind of redemption this is Andy Dufresne\nThe flyest nigga livin' reside inside the land of the fame\nBirthday instead of cake, I keep a pie lit like I'm landin' a plane\nBar Exam 4, this is the \"There is No Competition Edition\", my nigga\nBar Exam 4, this is the \"There is No Competition Edition\", my nigga\nBar Exam 4, this is the \"Where is the Competition Edition\", my nigga\nBar Exam 4, this is the \"Where in the Fuck is the Competition\", nigga", "image": "https://images.genius.com/2627cc5445030d64606928667383564b.800x800x1.jpg"}], "artist": "Royce da 5'9'’"}