{"songs": [{"title": "Radio", "album": "Big Momma’s House (Music From the Motion Picture)", "year": null, "lyrics": "[Radio DJ]\nHey DJ (I'm your radio)\nIt's a brand new day\nWhatchu say baby?\nYou wanna get down?\nYou gotta get up\nAnd I'm your wake-up man\nThe Gargamill is in your ear\nRappin' in your ear\nOn WBALL (Balls)\nIt's not on your radios\nYour radio is not really on\nIf it's too hot, then stay calm (Turn me on)\n\n[Phats Bossi]\nWho's the misfit stompin' through your district?\nWho's the man coming fully equipt? Who's the shit?\nWho be the head-honcho? Hit 'em low like Roberto\nGo blow-for-blow; I'm the man\nThe man'll get the suits like MacGuyver, move like Kaiser\nAin't nobody bustin' liver, fuck the pod-piper, ex-sniper\nRight beside ya, me and Max and a biker\nWhat's next? Whatchu think is next? Cash, checks\nYou likin' this shit? You ain't seen nothing yet\nThe army get dead, several of them dressed in fatigues\nPoliticin' with the Presidents and VPs\nSee me on TV sippin' keyed weed or on your local sippin' DP\nRegime be the team of the scream\nBalls lean, hit the scene and I'm way too clean\nOn your radio, yo, yo\n\n1-\tI'm your radio (Turn me on)\n\tWe make ya trunk pump everytime the beat bump\n\tI'm your radio (Turn me on)\n\tState to state, we jumpin' through your soundwaves\n\tI'm your radio (Turn me on)\n\tI'm on your radio, stay gettin' crazy dough\n\tI'm your radio (Turn me on)\n\tThat's cuz we bounce, rock, roll or skate\n\n[Kurupt]\nKurupt, Young Gotti, I don't play no games\nFeelin' Beyonce about to make her _Say My Name_\nI'm your radio baby in stereo baby\nG-dubulous fast Gotti to drive you crazy\nImpossible baby, impossible lives, the hospital lies\nListenin' to Gotti at five\nI'ma underdog dog, young balls dog, under balls balls\nYoung balls hog; a millon words a minute\nA billon balls to bust, a trillon and a half just to _Ride Wit Us_\nYo, G Dub, let the little homies bump\nAnd we gon' hit them in they head when we touch 'em up\nIf these fools wanna trip, we gon' light 'em up\nCuz we just don't give a mother-switch up\nOr your bubble contact, touch me where I love to be touched at\nCatch me in a Cut', in a 'Lac with a dub sack\nWhat up ROC?\n\nRepeat 1\n\n[R.O.C.]\nI got next (Why you?) cuz I'll be next\nThe name ain't debate when they conversate the best\nWhoever slept (Well) eternally rest and good night (See ya)\nI tuck haters in for life; so when you're bumpin' to the Man upstairs\nThen tell him something (What?)\nI cloned his persona specifically as a rhymer\nNo jewels and diamonds (Uh huh) rings and chains\nWon't ever change a thing or the slang I bring\nI'm from the basement, bottom, the \"Who shot 'em?\"\nPartna, what's poppin', rock cockin', double Glock\nAnd who's droppin'? Hip-hoppin' non-stoppin' on your radio\nNine blow your mind rotten cuz the rhyme style gangsta (Yeaah)\nMy requosition is flexxing the index (Uh)\nI suggest you adjust your vest position\nBet your lights darken when the pipes sparkin'\nAnd got Tha Pound barkin' G talkin', get your walk on\nI'm on your radio\n\nRepeat 1\n\n*Phone rings*\n[Radio DJ]\nKWBALLS, who's speaking?!\n\n[RZA]\nYo, this Dame Young, this the program director at Power 106\nBut everyone know me as the RZA \"I'm Your Radio\"\nI get calls from Jamaica that say that's bangin'\nLet me hear that heater go!\n\n[Radio DJ]\nThank you!\n\n*Phone rings*\n[Radio DJ]\nThis is KWBALLS, who's this?!\n\n[Dr. Dre]\nYeah, yeah, what up? This Dr. Dre. That new cut, \"I'm Your Radio\"\nI'm bumpin' it right now. Warren G- You're doing big thangs boy\nKeep it bangin'!\n\n[Radio DJ]\nWell, blow me down, KWBALLS is doing it again, startin' something\n\n*Phone rings*\n[Radio DJ]\nKWBALLS, who's this?!\n\n[Warren G]\nYo, what's up?! This Warren G and I was just calling in to say that new song\nBy Phats, Kurupt, the R.O.C.- it's off the hook baby. Keep banging it\n\n[Radio DJ]\nWBALLS, WBALLS, WBALLS\nWhat more can we have here folks?!\nLadies and gentlemen, pimps and hustlaz\nIt's going down\n\n*Phone rings*\n[Radio DJ]\nHot-line, who is this?!\n\n[Queen B]\nWhat's up?! This Queen B representin' all the rats and OGs\nAnd \"I'm Your Radio\". Keep banging that shit baby", "image": "https://images.genius.com/3dec82a70eb0e2a58fce48c9a19a9536.500x500x1.jpg"}], "artist": "Kurupt"}