{"songs": [{"title": "Outro (Red Bandana)", "album": "Stop Snitchin, Stop Lyin", "year": "2005-12-03", "lyrics": "[Intro]\nNot, Blackwall Street, The Game, Beach Boy\nCharli Baltimore (he wears a red bandana)\nRockstar, we are the Black Gang\nFree Shyne, motherfuckers! (he wears a red bandana)\n\n[Chorus]\nOn the front of murder talk (he wears a)\nOn the cover of the source you see (he wears a red bandana)\nThe whole world know (he wears a)\nEvery nigga in the hood know (he wears a red bandana)\n50 told the N-Y-P-D (he wears a)\nWhy you snitch on me and tell 'em that (he wears a red bandana)\nAll the Pirus know (he wears a)\nEven my crip niggas know (he wears a red bandana)\n\n[Verse 1]\nCheah, cheah, dear God let me cleanse my soul\nThrow away all the rims and the gold\nOh no I can't do that, do I love God?\nTrue dat, but I got a gun so move back\nI'm loco like 5 eses in the side of Chevelle ridin' on low pros\nI'm a renegade, ride with the .44\nBeen a gangbanger all my life, fuck the popo\nI ain't never been a cocky kid, know they could kill me if they shot Pac and Big\nBut I let my bandana hang, in the city of angels we gangbang\nI move that chronic and yayo, way before I met 50, Banks, Buck and Yayo\nAsk Eminem even Dr.Dre know I put one in last ten in the Range Rov\nUsed to push that rock like Jay Hov, you better lay low when the A-K blow\nOr get wings and a halo, run to the hood and tell 'em I'm the nigga they gotta pray for\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nI said run to the hood and tell 'em I'm the nigga they gotta pray for\nLay low and stay low\n\n[Chorus]\nOn the front of murder talk (he wears a)\nOn the cover of the source you see (he wears a red bandana)\nThe whole world know (he wears a)\nEvery nigga in the hood know (he wears a red bandana)\n50 told the N-Y-P-D (he wears a)\nWhy you snitch on me and tell 'em that (he wears a red bandana)\nAll the Pirus know (he wears a)\nEven my crip niggas know (he wears a red bandana)\n\n[Verse 2]\nCheah, cheah, I'm a gangbanger don't get it fucked up\nYou ain't never bang, you ain't never laced chucks up\nSo how the fuck you gonna criticize me\nI ain't the reason niggas is bangin' the N-Y-C\nMakin' bullshit threats on the M-I-C\nI don't wake up in cold sweats when I sleep\nI live comfortably With a red rag tied around the 45 in case niggas come for me\nMad cause I started my own company, I don't know what the fuck Niggas want from me, except something for free\nBefore The Documentary dropped, you bitch niggas wasn't bumpin' me\nAnd to some degree, I gotta keep that 4-5th under me\nI don't run from beef It's either cock back, squeeze or underneath 'Cause I'm from the streets of (Compton)\nAnd my grandmother died before I was multi\nWasn't raised right cause my parents was both high\nHigh off cocaine, my introduction to the dope game came in 85 watchin' Soul Train\nMama told me I was the future, and one day I'd be fly like Soul Plane\nJust don't bang, but back then I'd do anything for a jheri curl and a gold chain\nNiggas always got something to say\nLike they ain't never bumped N.W.A\nPunk niggas talk shit, but when they need hits\nThey swallow they fuckin' pride and come runnin' to Dre\nNiggas come to L.A. when they need to talk\n'Cause Kanye told everybody Jesus Walks\nBush killed more niggas in the towers then gangbangin' ever did\nThat's why they need New York\n\n[Chorus]\nOn the front of murder talk (he wears a)\nOn the cover of the source you see (he wears a red bandana)\nThe whole world know (he wears a)\nEvery nigga in the hood know (he wears a red bandana)\n50 told the N-Y-P-D (he wears a)\nWhy you snitch on me and tell 'em that (he wears a red bandana)\nAll the Pirus know (he wears a)\nEven my crip niggas know (he wears a red bandana)\n\n[Outro]\nYeah motherfuckers, Chuck Taylor\nOh you thought I forgot about that alias huh?\nI'm going back to my roots\nG-Unit is dead, as a staff, a record label, and a motherfuckin group\nYour clothes can't sell, your shoes are straight garbage\nYour movies suck! Chicken Little killed you nigga Hahaha\nHow you like it nigga, I took your style\nI ain't doin no third verse, I'm just talk to you nigga\nLike you do when you get mad at me 'cause you can't fuck with me lyrically motherfucker\nYou gonna do one of those sing song little clucky poppy hooks\nYou like the rap Lindsay Lohan you fuckin' faggot\nWrite 8 bars about me nigga, I do this shit all day 50!\nCurtis Jackson, Boo-Boo\nMarcus... Snitch\nBlackwall Street C.E.O. motherfucker!\nHurricanes in stores December 26th\nStop Snitchin' Stop Lyin the DVDs in stores December 6th\nIt's a tell-all nigga\nWait 'til my movie come out, I'm glad it ain't based on my life\nWith that knock off 8 Mile shit\nYou can never be Eminem motherfucker\nYou ain't lyrically inclined enough to be JAY-Z, Nas, B.I.G. or Pac\nAnd in the modern day... today, tomorrow, next week\nYou can't fuck with The Game nigga!\nOUT\n\n[Interlude]\nYo what's poppin' it's The Game\nI want you to go out and buy my new DVD\nStop Snitchin', Stop Lyin'. It's a tell-all\nStopsnitchinstoplyin.com\nTheblairesnitchproject.com\nAnywhere of sight.com", "image": "https://images.genius.com/01f294862dcdd3cf6d179355bd83e8a8.300x300x1.jpg"}], "artist": "The Game"}