{"songs": [{"title": "Blind Threats", "album": "Oxymoron", "year": "2014-02-18", "lyrics": "[Intro]\nRight, uh, same shit every day, homie\nLord, please forgive me for all my sins\nYeah, nigga wake up to the same shit every day, homie\nWalking in the valley of the shadow of death, no rules, right\n\n[Verse 1: ScHoolboy Q]\nWashing my sins off in hell's water\nFeel like the Bible told me lies as I pray to 'em\nKneel down, put my faith in 'em, will you answer me?\n\n[Refrain: ScHoolboy Q]\nBut if God won't help me, this gun will\nI swear I'm gon' find my way\n\n[Verse 2: ScHoolboy Q]\nUh, four corners\nCat and mouse chase, got cheese to catch\nHigh on on some drug, I'm Space Cadet\nDreaming I don't live up on the block no more\nTrapping, trying to make it out this obstacle\nLife on the edge, hell a block away\nPretty Snow White turned eight today\nSelling that base, no Dr. Dre\nUh, guess who in the building?\nBucket hat with a strap like a pilgrim\nUh, kneeling down with some questions to address like\nWhy the ones who commit the worst sins live the best?\nThe Ten Commandments, I can mark five checks\nBut I sense flaws, the Bible preaching blind threats\nStreets held me down, got faith in a Pyrex\nFaith in a four-five, I call it the clarinet\nSewer full of drugs when the toilet digests\nFrom the cop raid, all can relate from the streets\nTo the wall from niggas to compadres\nWhen the sun go down, I'm predicting a heatwave\nForecast your whole body, heat on, room full of homies\nI just pray that the Lord got me\n\n[Hook: ScHoolboy Q]\nBut if God won't help me, this gun will\nI swear I'm gon' find my way\nMic check, mic check, mic check\nLa-la, la-la, low-low, la-la, la-la, low\nLa-la, la-la, low-low, la-la, la-la, low\nBut if God won't help me, this gun will\nI swear I'm gon' find my way\n\n[Verse 3: ScHoolboy Q]\nAim that, shoot that, pledge allegiance\nKill mine, kill yours, make it even\nSoul need saving, Mr. Preacher\nI know I only come around when it's Easter\nFunerals, Thanksgiving, Christmas time\nWhen I'm in jail or when my card declined\nUh, will you answer me?\nTake me out of hell and make plans for me?\nMisery loves company, ain't a surprise\nIt was just me and my niggas, we was trying to survive\nBut we would never make it out alive\nShit, we living to die—oxymoron\nHope to get to heaven 'til that day arrive\nRunning through the ally, hope the bullet don't collide\nCar window shattered, glass on my right side\nDogs bark in the backyard, root for me\nOut of shape belly, courtesy of 40\nSpoiled only child, baby boy Jody\nSame jacket on from back in the day\nPraying that the Lord come and take me away\n\n[Hook: ScHoolboy Q]\nBut if God won't help me, this gun will\nI swear I'm gon' find my way\nMic check, mic check, mic check\nLa-la, la-la, low-low, la-la, la-la, low\nLa-la, la-la, low-low, la-la, la-la, low\nBut if God won't help me, this gun will\nI swear I'm gon' find my way\n\n[Verse 4: Raekwon]\nAyo, tuna fish sandwiches bread, dry and stinking\nBlack Lincoln, burgundy Mac, I clap a king-pin\nCaught me in the airport dusted that I was thinking\nOn how to stay rich and get bills with my acquaintances\nYeah, money is the issue, I diss you\nIt's no problem at all, yo, the bunch on the pistol\nCause I'm a suitcase king\nCooling at the gambling spot with a screwed face grin\nNew Beige Bent, we stay winning, play it again, yo\nPut the bone in your jaw, now say it again\nRound nightfall under the tents, coming to rinse\nGet out the way or let the shotty dispense\nRevenge killers who make the events iller\nThis is more realer, snatch you right up out of the Benz\nThe Wu wheelers who huddle up, coupes knows the truth\nYou know the whoopty-whoop, solo or group, I kill niggas\n\n[Produced by LordQuest and Sounwave]", "image": "https://images.genius.com/773557ec1d645f3fbdabdf05fb722361.894x894x1.jpg"}], "artist": "ScHoolboy Q"}