{"songs": [{"title": "Uh Oh", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "[Intro]\nYou ain't that tough ya\nChoose the right friends\nYou ain't that tough now\nDon't make your life end\n\n[Verse 1]\nYou walk around the town like you a big man\nBut you never know now that there's always a bigger man\nYou sling the M-16 and flash the M-1\nBut you don't know what you're doing never learned to handle one\nBut true! All you friend thinking you a gangster\nWhile your mother tried to warn you from certain danger\nSo when you in your room you playing with your Mac-10\nFully loaded automatic, just you and a friend\nYou posing aw dey mirror like you a gangster clown\nBut the Mac-10 go off and you friend go down\n\n[Chorus]\nUh oh! What you gonna do now?\nUh oh! They gonna blame you somehow\nUh oh! Tell me what you gonna say\nUh oh! Look, they cutting you away\n\n[Verse 2]\nYour father telling you \"Now son just go to school\nDon't go acting like a fool and don't go acting too cool\"\nYou get to the school and meet up with the right bunch\nJust a group of kids with no names taking people lunch\nYou join the clique because you wanna meet some girls\nAnd you want a little prestige in you little school world\nOne day you're walking with your crew along the road\nAnd a member of your crew pull out a gun and unload\nHe shoot a parked car and all you run far\nYou and your friends laughing like you a superstar\nAnd you get home and you thinking it was fresh\nAnd a cop meet you there with a warrant for your arrest\nThem ask, \"Who shot the gun? why you walking down the street?\nDidn't you see the little boy there in the back seat sleep?\nNow the boy dead we want to know from you\nWho shot the car up, are we gonna take you?\"\n\n[Chorus]\nUh oh! Now what you gonna do now?\nUh oh! Boy, them gonna blame you\nUh oh! Now tell me what you gonna say\nUh oh! Look, they cutting you away\n\n[Bridge]\nYou ain't that rough ya\nChoose the right friends\nYou ain't that tough ya\nDon't make your life end\n\n[Verse 3]\nWhite kids! You living in the whitest part of town\nYou are a white kid but you know you hang around\nSo you and your friends thinking that you are all of that\nWhen you see a youth walk by and yes the youth is black\nOne kid say \"Hey, what you doing on the block\nWe don't want no niggers here unless he is a cop\"\nSo the kid pull out a big baseball bat\nAnd them him slap with the bat because the kid is black\nNow then the kid fell down but still alive\nSo he reach in his pants and pull out a four-five\nPop! One friend drop and everyone run\nOut of all the white kids now you the only one\nYou start cry, cause now you gonna die\nAnd it's all because what your friends did to this guy\n\n[Chorus]\nUh oh! What you gonna do now?\nUh oh! He gonna blame you somehow\nUh oh! What you think you gonna say?\nUh oh! Now them cutting you away, check!\n\n[Outro]\nYou ain't that rough ya\nChoose the right friends\nYou ain't that tough ya\nDon't make your life end\nYou ain't that rough now\nChoose the right friends\nYou ain't that tough now\nDon't make your life end", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}