{"songs": [{"title": "Amethyst Rockstar", "album": "Summer Knights", "year": "2013-07-01", "lyrics": "[Intro: Saul Williams]\n(Fuck You!)\nI stand on the corner of the block slinging amethyst rocks\nDrinking 40s of mother earth’s private nectar stock\nDodging cops, cuz’ 50 be the 666 and I need a fix of that purple rain:\nThe type of shit that drives membranes insane\nOh yeah, I’m in the fast lane snorting candy yams\nThat free my body and soul and send me like Shazaam\nNever question who I am, God knows, and I know God personally\nIn fact he lets me call him “me”\n\n[Verse 1: Joey Bada$$]\nWhen did rap turn into a fashion show?\nToo many makeup artists won't let their passion show\nThe anti-social mogul, havin' 20/20 visions\nIn needa bifocals, for your eyes dilated ojos\nOpen wide, never did I owe hoes\nSuck a dick dilated, tell my old hoes\nHit my main bitch in the Poconos\nI'm not Pinocchio, I never lied, I poke her nose\nWith the dopest dope, brand new Pablo, brand new God flow\nIt feel like, Escobar and Apollo\nSwank apparel, I put a pic on the site ‘ya megabytes\nY'all niggas ticking me off like headlights\nGet your head right, it all falls down\nI bread right on the house\nEye was on 106 & Park and still on the couch like \"bitch fuck Jacob\"\nI went to meet my maker, with 25 sacred stones\nTold him save me a few acres\n\n[Hook]\nYeah, cause' we just some Amethyst Rockstars\nAmethyst Rockstar\nAmethyst Rockstar\nAmethyst Rockstar\nAmethyst Rockstar\nTry aim at this Rock Star!\nTime just keeps on falling, falling, falling\n\n[Verse 2: Kirk Knight]\nHow is Hip-Hop dead? I'm still makin' a killin'\nBanana clip peelin' and ho's I'm still stealin'\nThis is not for the soda pop niggas\nTake me to the leader of the new school or the block dealas\nCause all these fakes mcs take from those figures\nIs what get fake MC's infront of loose triggers\nCan't knock the hustle though, I may just bust a jigga\nAnd lookin' through my eyes, you can kinda get the picture\nMo money mo problems as you get notorious, inglorious, until you're a big Victorious, no show\nOnly way you get to see the kid is through a photo\nOr  branded up logos, and the females come out at night\nAnd when they find the pot a gold they strike, seducing me?\nWait y-y-yeah, you nice on the mic, yeah yeah, you lookin' right\nYeah, you just my type, yo\n(Bitch, don't get me tight!)\nHer friend split and dipped, damn I should've seen this\nI'm in a boobie trap and thats some clever ass cleavage\nWell, I think with my dick, I know you want to blow my mind for that reason\nShe said \"You got clever speaking\"\nAnd after I'm done, I still got it leaking\nI dipped off ‘cause knowledge a nigga is still seekin'\nWhat you lookin' at son? I might rob you blind\nDefined by every line, niggas tryin' to outshine\nWe’re both number one enemies, it’s sad though\nOne on one, and it takes two niggas to tango\nTwo niggas to tango\nWatch me go Rambo\n\n[Outro]\n\"Don’t Front on a nigga like me\nTime just keeps on falling, falling, falling\"\n\n[Hook]\nYeah, cause' we just some Amethyst Rockstars\nAmethyst Rockstar\nAmethyst Rockstar\nAmethyst Rockstar\nAmethyst Rockstar\nTry aim at this Rock Star!\n\nYO! YO! YO! YO!\nYO! YO! YO! YO!\nYO! YO! YO! YO!\nYO! YO! YO! YO!\nYO! YO! YO! YO!\nYO! YO! YO! YO!\nYO! YO! YO! YO!\nYO! YO! YO! YO!", "image": "https://images.genius.com/ccc6b3e099d7f0a3416209e4a5d67fd0.1000x1000x1.jpg"}], "artist": "Joey Bada$$"}