{"songs": [{"title": "I Love the Dough", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Produced by Easy Mo Bee]\n\n[Intro: Jay-Z]\nUhh, uhh\nUhh, uhh, uhh, uhh, what\nHah, what, how real is this?\nUhh, uhh, how real is this?\nWhat? Uhh, what?\nUhh\n\n[Verse 1: Jay-Z]\nWe push the hottest V's, peel fast\nThrough the city, play Monopoly with real cash\nMe and Biggie and the models be shakin' they sadiddy ass\nAnd Prada be somethin' you cats got to see\nAnd the watches be all types and shapes of stones\nBein' broke is childish and I'm quite grown\nRun up in the club with the ice on, me and Paisan\nScope the spot out, see somethin' nice and I'm gone\nYou cats is home screamin' the fight's on\nI'm in the fifteen hundred seats, watchin' Tyson\nSame night, same fight\nBut one of us cats ain't playin' right, I let you tell it\nPeople place yourselves in the shoes of two felons\nAnd tell me you won't ball every chance you get\nAnd any chance you hit, we live for the moment\nMakes sense don't it? Now make dollars\nCats pop bottles, bone chicks that favor Idalis\nAnd rack up frequent flight mileage\n\n[Chorus: Angela Winbush]\nGotta let it show, I love the dough, hey\nI love the dough, more than you know\nGotta let it show, I love the dough, hey\n\n[Verse 2: The Notorious B.I.G.]\nI'm poppin' Magnums while Jigga bag somethin'\nWatch is platinum, got jet lag from\nFlights back and forth, pop corks of the best grapes\nMake the best CDs and the best tapes\nDon't forget the vinyl, take girls break spinals\nBiggie be Richie like Lionel, shit\nYou seen the Jesús, dipped to H classes\nIce project off lights, chick flashes\nBlind your broke asses, even got rocks in the beards and mustaches\nRock top fashions\nAin't shit changed, 'cept the number after the dot on the Range\nWay niggas look at me now, kinda strange\nI hate y'all too\nRather be in Caribbean sands with Rachel\nIt's unreal, out the blue Frank White got sex appeal\nBitches used to go, \"Ewww!\"\nStill tote steel, I'm tryin' to see five mil off the single, for real\nYou ain't fazin' the amazin'\nWhile your gun's raisin', mine is blazin'\nSee you want see me all talkin' to sweetness\nTake it for weakness and leave quick\nBlocka, Roc-A-Fella, Bad Boy collabo\nTwo MCs with mad dough, you know\n\n[Chorus: Angela Winbush]\nI love the dough, more than you know\nGotta let it show, I love the dough, hey (I love the dough)\nI love the dough, more than you know (gonna let it show)\nGotta let it show, I love the dough, hey\n\n[Verse 3: Jay-Z]\nMiraculous, pockets stay full\nNiggas skip the bull 'cause we matadors\nSnatch the P89s that we pack in the drawers\nAnd we, clap the doors of your Acuras\nSnap like, cameras on amateurs\nMake you all dance, hold a hammer to yours\nJig and Big rock ice, no cracks or flaws\nEverybody got a part to play, back to yours\nRun up in your crib now, crack your doors\nWatch the real players live, it's a habit to floss\nPlay the charts like The Beatles, y'all adapt you lost\nAnd toast Cristal on behalf of y'all\nToo bad for y'all\nAin't too many as bad as yours truly\nDo we, we laugh at y'all\nLittle bastards y'all\n\n[Verse 4: The Notorious B.I.G.]\nUhh, uhh\nWe hit makers with acres\nRoll shakers in Vegas, you can't break us\nLost chips on Lakers, gassed off Shaq\nCountry house, tennis courts on horseback\nRidin', decidin' cracked crab or lobster\nWho say mobsters don't prosper?\nNiggas is actors, niggas deserve Oscars\nMe I'm, critically acclaimed, slug pass your brain\nReminisce on dames whose coochie used to stink\nWhen we rocked house pieces and puffy Gucci links\nNow we buy homes in unfamiliar places\nTito smile every time he see our faces\nCases catch more than outfielders\nHalf these rappin' cats ain't seen war\nCouldn't score if they had point game, they lame\nSpeak my name, I make 'em Dash like Dame\n(We love the dough...)\n\n[Chorus: Angela Winbush]\nI love the dough, more than you know (gonna let it show)\nGotta let it show, I love the dough, hey\nI love the dough, more than you know (gonna let it show)\nGotta let it show, I love the dough, hey\nI love the dough, more than you know (ah yeah)\nGotta let it show, I love the dough, hey\nI love the dough, more than you know\nGotta let it show, I love the dough, hey", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}