{"songs": [{"title": "Memories", "album": "The Art of Storytelling", "year": "1999-03-25", "lyrics": "[Intro: Slick Rick]\nYeah, know what I mean Rick?\nKnow what I mean Rick?\nKnow what I mean Slick, Whoa!\nYeah, wee!\n\n[Verse 1: Slick Rick]\nFine, grown Pine-Sol, heavenly rhyme throne\nRemember when you were young in the '70 time zone?\nStages, age is 'bout seven, I say, kids\nThe dress code of our parents looked awfully outrageous\nNot down on 'em, games and clownin'\nWhen soul was at its highest rate like James Brown and them\nSoothin' every black thing, a groovy era actin'\n'Member seein' Shaft in the movie theater back then?\nI feel Richard Roundtree got 'em a fly deal\nBlack men wearin' bell bottom and high heels\nLaughed a lot, some action, mass production\nRemember when cars were darn near half a block long?\nParents were so into that crap\nBunch of sweet memories to us older rap cats\nMuhammad Ali knucklin' in tournament\nPimp daddy hats with buckles and ornaments\nHow we forget Snappy?\nFive people sleepin' in one mattress and yet happy\n\n[Hook x2: Slick Rick]\nCould even make sex seem sour\nAs I impress the world with my extreme power\n'Cause Rick make memories sealed in almanacs\nNot to mention the immense appeal the mack had\nWhen you wake up in the mornin' (redeem from any crap)\nBecause I bring that lovin' feelin' back to rap\n\n[Verse 2: Slick Rick]\nFor situated as poor beneficialator\nKool-Aid couldn't last a hot minute in the refrigerator\nSchool notes, slidin' and stealin', hidin 'em\nBazooka, bubble gum cartoons still inside of 'em\nNo way, same essence of it's earned paper\nPimps flyest dressin' muthafuckas, weren't they?\nBut hood lies, you afraid of a good wine?\nI used to love the actor who portrayed one on Good Times\nYou need a friend to warn a soul, man, it kinda slow\nOne thing 'bout it bro, overflow when it's kinda so (shame)\nLife, a pitiful game\n'Member the robot? That was my shit on Soul Train\nGot hyped too, psyched too and the feelin's right too\nChillin' on the fire escape on a nice night, too\nNo one gone try hurt di mon\nRemember Right On, Blood and Jive Turkey slang?\nBrothers chippin' in for alcoholic money\nWhen you look at old flicks don't we all look funny?\n\n[Hook x2]\n\n[Verse 3: Slick Rick]\nYo' mama, damn, we used to talk improper then\n'Member when we used to walk bop, walk bop again?\nGivin' them the rhythm that we brought\nPush our hand back like we was swimmin' when we walked\nBad all about, Huggie Bear, Rat all about\n'Member afros, what the fuck was that all about?\nBuenos noches accents too, friends too\nEverybody had a lot of roaches back then, too\nProfusely around us, Lucy Afarensis\nFleets wearing Bruce Lee Bananas\nAnd kick shit, ball in the hand and stick with\nAnd we use to be in some of the \"Man, you in deep shit\"\nMost cases, father away for good\nLocal Flat Foot was part-of the neighborhood\nStandard, and the panthers (Wow)\nUsed to dress like Erykah Badu and Amanda's now\n\n[Hook x3]", "image": "https://images.genius.com/73539fff4e6ebc470e6cab73853f0ac6.1000x1000x1.jpg"}], "artist": "Slick Rick"}