{"songs": [{"title": "Real Friends", "album": "The Life of Pablo", "year": "2016-01-08", "lyrics": "[Verse 1: Kanye West]\nReal friends, how many of us?\nHow many of us, how many jealous? Real friends\nIt's not many of us, we smile at each other\nBut how many honest? Trust issues\nSwitched up the number, I can't be bothered\nI cannot blame you for havin' an angle\nI ain't got no issues, I'm just doin' my thing\nHope you're doin' your thing, too\nI'm a deadbeat cousin, I hate family reunions\nFuck the church up by drinkin' at the communion\nSpillin' free wine, now my tux is ruined\nIn town for a day, what the fuck we doin'?\nWho your real friends? We all came from the bottom\nI'm always blamin' you, but what's sad, you not the problem\nDamn I forgot to call her, shit I thought it was Thursday\nWhy you wait a week to call my phone in the first place?\nWhen was the last time I remembered a birthday?\nWhen was the last time I wasn't in a hurry?\n\n[Bridge: Ty Dolla $ign]\nTell me you want your tickets when it's gametime\nEven to call your daughter on her FaceTime\nEven when we was young I used to make time\nNow we be way too busy just to make time\nEven for my...\n\n[Chorus: Kanye West, Kanye West & Ty Dolla $ign]\nReal friends\nI guess I get what I deserve, don't I?\nWord on the streets is they ain't heard from him\nI guess I get what I deserve, don't I?\nTalked down on my name, throwed dirt on him\n\n[Verse 2: Kanye West & Ty Dolla $ign]\nI couldn't tell you how old your daughter was (Was)\nCouldn't tell you how old your son is (Is)\nI got my own Jr. on the way, dawg (Dawg)\nPlus I already got one kid (Kid)\nCouldn't tell you much about the fam though\nI just showed up for the yams though\nMaybe 15 minutes, took some pictures with your sister\nMerry Christmas, then I'm finished, then it's back to business\nYou wanna ask some questions 'bout some real shit? (Shit)\nLike I ain't got enough pressure to deal with (With)\nPlease don't pressure me with that bill shit (Shit)\nCause everybody got 'em that ain't children\nOh you've been nothin' but a friend to me\nNiggas thinkin' I'm crazy, you defendin' me\nIt's funny I ain't spoke to niggas in centuries\nTo be honest, dawg, I ain't feelin' your energy\nMoney turn your kin into an enemy\nNiggas ain't real as they pretend to be\n\n[Verse 3: Kanye West & Ty Dolla $ign]\nLookin' for all my real friends\nHow many of us? How many of us are real friends\nTo real friends, 'til the reel end\n'Til the wheels fall off, 'til the wheels don't spin (Yeah yeah)\nTo 3 A.M., callin'\nHow many real friends?\nJust to ask you a question\nJust to see how you was feelin'\nHow many?\nFor the last you was frontin'\nI hate when a nigga text you like, \"What's up, fam? Hope you good\"\nYou say, \"I'm good, I'm great,\" the next text they ask you for somethin'\nHow many?\nWhat's best for your family, immediate or extended\nAny argument, the media'll extend it\nI had a cousin that stole my laptop that I was fuckin' bitches on\nPaid that nigga 250 thousand just to get it from him\nReal friends\nHuh?\n\n[Chorus: Kanye West,  Kanye West & Ty Dolla $ign]\nReal friends\nI guess I get what I deserve, don't I\nWord on the streets is they ain't heard from him\nI guess I get what I deserve, don't I\nTalked down on my name, throwed dirt on him", "image": "https://images.genius.com/8081e8ac10f2d6d81e23afa8b750152f.750x750x1.jpg"}], "artist": "Kanye West"}