{"songs": [{"title": "Fuck You Tonight", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Intro: The Notorious B.I.G. & P. Diddy]\nUh, I like that, you like that?\nHere's another one, and another one\nAnd another one, and another one\nUh\nWhaat, whaat (c'mon)\n\n[Chorus: R Kelly & The Notorious B.I.G.]\nYou must be used to me spending (uh, uh)\nAnd all that sweet wining and dining\nWell, I'm fucking you tonight\nUh, here's another one\nAnd another one\nUh, uh, what\n\n[Verse 1: The Notorious B.I.G.]\nSome say the X, make the sex spec-tacular\nMake me lick you from yo' neck to your back, then ya\nShivering, tongue delivering\nChills up that spine, that ass is mine\nSkip the wine and the candlelight, no Cristal tonight\nIf it's all right with you, we fucking (that's cool)\nDeja vu, the blunts sparked, finger fucking in the park\nPissy off Bacardi Dark\nRemember when I used to play between your legs?\nYou begged for me to stop because you know where it would head\nStraight to your mother's bed\nNot the Marriott, we be lucky if we find a spot\nNext to your sister, damn I really missed the\nWay she used to rub my back, when I hit that\nWay she used to giggle when your ass would wiggle\nNow I know you're used to suites at the Parker Meridien\nTrips to the Caribbean, but tonight, no ends\n\n[Chorus: R Kelly & The Notorious B.I.G.]\nYou must be (uh) used to me spending\nYou must be used to me (uh)\nAnd all that sweet wining and dining (what)\nWell, I'm fucking you tonight\nHere's another one (fucking you tonight)\nAnd another one (no doubt baby)\nAnd another one (fucking you)\nWhat! What!\nYou must be used to me spending\nYou must be! (uh, uh)\nAnd all that sweet wining and dining\nWell, I'm fucking you tonight\nHere's another one (fucking you)\nAnd another one (no doubt about it babe, fucking you)\nUh, uh\n\n[Verse 2: The Notorious B.I.G.]\nGirl you look fine\nLike a wide face Rolex, you just shine\nI like that waistline\nLet me hit that from behind, which wall you wanna climb\nMy style genuine, girl I love you long time\nI got you pinned up, with your fucking limbs up\nAll because you like the way my Benz was rimmed up\nBitch keep yo' chin up, please watch me do thee\nNasty, like it when you make it move fast mami\nI like it when you tro' it pon me\nNo love making, strictly back breaking\nCease know, all his hoes, go to my door\nThen they go to his flo', to fuck some more\nSo no, caviar, Shark Bar, uh-uh\nStrictly sex that's sweaty and leftover spaghetti\nI know you used to slow CD's and Dom P's\nBut tonight it's eight tracks and six-packs while I hit that\n\n[Chorus: R. Kelly & P. Diddy]\nYou must be used to me spending\n(You must be, used to me)\nAnd all that sweet wining and dining (spending all his money baby, on you)\nWell, I'm fucking you tonight\nCan you feel me?, 'cause I can feel you\nCan you feel me?, 'cause I can feel you\nYou must be used to me spending\nYou must be used to me\nAnd all that sweet wining and dining\nWell, I'm fucking you tonight\n(fucking you tonight)\nCan you feel me? (make ya feel so right),'cause I can feel you (baby come to me)\nCan you feel me (give me what I need), R. Kelly take me to the bridge\n\n[Bridge: R. Kelly]\nLet's stop the bullshit, baby\nLet me take you to the spot, fit you hot\nSo you wanna be with me (say what), Puff Daddy (that's right)\nB.I.G. (let's go), bring that ass to me\n\n[Chorus: R. Kelly & P. Diddy]\nYou must be used to me spending\nAnd all that sweet wining and dining\nWell, I'm fucking you tonight\n(Said I'm fucking you tonight)\nCan you feel me? (fucking you tonight) 'cause I can feel you (stroking you tonight)\nCan you feel me?, 'cause I can feel you\nYou must be used to me spending\n(You must be used to me spending)\nAnd all that sweet wining and dining\nWell, I'm fucking you tonight\nFucking you baby, I'm fucking you baby\n(You must be!!) You must be used to me spending\nAnd all that sweet wining and dining\nWell, I'm fucking you tonight (I'm doing it baby, I'm doing it baby, I'm doing it baby ah yeahowow)\nYou must be used to me spending\n(you must be babe, used to me)\nAnd all that sweet wining and dining (spending money all of the time, on you)\nWell, I'm fucking you tonight\nNo matter what you may say, babe\nGiving it to you, any way I possibly can\nYou must be used to me spendin'\nAnd all that sweet wining and dining\nWell, I'm fucking you tonight, oohhh baby, sugar, honey", "image": "https://images.genius.com/50b90dd787ba51ed3d9f2160b2b73c2a.1000x1000x1.png"}], "artist": "The Notorious B.I.G."}