{"songs": [{"title": "Kendrick Lamar: Rapper of the Year - GQ", "album": null, "year": "2013-11-01", "lyrics": "Reminder that you can click the images for more annotations.\n\nEvery member of rap's Mount Rushmore dropped new albums in 2013—Kanye, Jay Z, Drake, Eminem—but it was another MC altogether who stole the crown, and he did it with just a handful of verses: Kendrick Lamar, the latest—and possibly greatest—rapper to come straight outta Compton.\n\n\nWe are 10,000 feet above Compton in a private jet, and Kendrick Lamar is explaining to me what happened to him yesterday, when he vanished. We had a plan: Kendrick was going to give me a guided, cue-the-G-funk-synth Star Maps tour of his neighborhood, the one he still more or less lives in, starting at his parents' house a couple of blocks from his old high school, Centennial High, near the corner of Piru and South Central. Instead, he went AWOL. The whole day, no one from his label, Interscope, or Top Dawg Entertainment, the baby Death Row Records that originally signed him, could track him down. Kendrick was gone.\n\nIt turned out he was sitting shivah for a murdered friend he calls his \"little bro\"—a kid from a neighborhood where friendship is defined primarily by neighborhood. A few weeks earlier, Chad Keaton, 23, had been wounded in a drive-by shooting very close to Kendrick's parents' house. He held on for a month but ultimately died of complications from the gunshot wounds.\n\nSo today, here on board this Challenger 300 seven-seater, en route to New York City's fall Fashion Week, a destination filled with people Kendrick isn't sure whether he wants to impress or fuck with, he's telling me about Chad. \"It all happened when I was overseas,\" he says. \"I had to talk to him over Skype on the hospital bed before he passed.\"\n\nIt's been a strange year. When it began, Kendrick was already regarded as something of a messiah among rap nerds—one of the best rappers ever to come out of the place that has produced many of the best rappers ever—and since then his legend has spread fast.\n\nIt actually began late last year, when Kendrick's major-label-debut album, good kid, m.A.A.d city,dropped, to universal acclaim. The album—about a day in the life of nerdy Compton teenager K.Dot and his homeys as they run around in his mom's minivan chasing \"that crazy-ass girl Sherane\"—is practically a black Ulysses: a portrait of the rapper as a young man, simultaneously a drive-by deconstruction of gangster rap's violent tropes and a celebration of its signature, slow-rolling sound. On good kid, Lamar is our embedded correspondent, spitting triple-time confessionals from a part of the country most of us had forgotten once the rap scene found a fresher inner city to fetishize. He's the game's most linguistically cerebral MC, but also its realest—the one who finds the most vivid way to tell a story about his unemployed buddies trying to rope him into robbing some dude's house—and it's this polarity that makes listening to King Kendrick feel like you're putting on the illest 3-D glasses in hip-hop. The music nods at influences far beyond the West Coast—Beach House samples, Dungeon Family lushness—but throughout, his voice stays singularly focused on a twenty-block radius around Central Avenue and Piru Street:\nIf Pirus and Crips all got along They'd probably gun me down by the end of this songGood kid, m.A.A.d city sold an industry-shocking 241,000 copies its first week and went platinum this summer. Then, in August, Kendrick snuck a sixty-four-bar Trojan horse into his buddy Big Sean's song \"Control\"—a guest spot on a song that didn't even make the final record. After Big Sean goes on for a while about drinking champagne in Detroit, Kendrick wakes up the entire hip-hop universe, calling out nearly every single young rapper in the game: Drake; A$AP Rocky; J. Cole; Tyler, the Creator; even Big Sean himself. The dude slaps Sean on his own song. He also proclaimed himself \"the king of New York,\" which to certain East Coast ears sounded like a Greek dude strolling into Troy and dropping a deuce on the tomb of Hector.\n\n\"Control\" leaked on YouTube late in the day on August 12; for a solid week, it was the biggest story in music. Just a few weeks after that, Kanye announced he was touring solo for the first time in five years and that his opening act would be Kendrick Lamar.\n\nKendrick's career momentum has created a dissonance that must look surreal from 30,000 feet. Chad Keaton's memorial service was held just before Labor Day weekend; Kendrick attended, then flew straight to a show in Alaska. Next it was on to Vegas to perform at a pool party. He only made it \"back to the set\" to grieve for a single day, the day we were scheduled to talk. \"It can be complicated and confusing,\" Kendrick says of his life right now, funerals for murdered friends one day, private jets to fashion parties the next. \"From my perspective, it's not just I'm famous—I still live in this world.\" And when someone back home needs something, \"I still gotta get that phone call.\"\n\nIt's clear the emotions are still raw. Kendrick is a small guy, just five feet six, and with his black hood pulled up over his head, a chain around the outside of his sweatshirt, it felt like I was talking to a wizened rap Jedi. After about an hour of questions, I gave him a break, and he lay down on the couch to rest. Just kind of curled up with his back turned.\n\nA bit later, I saw a tweet from him to his 2.4 million followers pop up on my phone: \"When the cameras stop rolling, it doesn't mean real life will follow.\" Instantly it had fifty-six retweets. After one minute, 600. After two minutes, 1,000. Then he tweeted a picture of Chad: \"Rest N Heaven my Lil bro. Watched u become a man. U fought bro. The city stole yo life, but not your legacy.\"\n\n\nOn the night of the 2013 MTV Video Music Awards, just as the heat over \"Control\" was peaking, I tailed Kendrick through the backstage maze at Brooklyn's Barclays Center. At one point, he ran into Drake, and they wrapped each other up in a big hug. It was their first encounter since Kendrick called him out on \"Control,\" and of all the slaps in that verse, this one felt the most personal, because Drake had helped break Kendrick, handing the kid not just a verse but an entire song on his second album. After Drake's VMA performance of \"Hold On, We're Going Home,\" Kendrick made his way back to the greenroom, crooning the hook: I got my eyes on you.... He caught mine and smiled. \"You watch,\" he joked, \"I'm going to be singing by my fifth album!\"\n\nI asked if this meant things were cool between him and Drake. He paused. \"Pretty cool.\" Shrugs. \"And I mean, I would be okay if we weren't.\"\n\nA month later, it became apparent that things between Kendrick and Drake were definitely not cool. After Drake's new album dropped, he gave a pair of interviews in which he sounded wounded by the \"Control\" thing: \"You can't just say that and then see me and be like, 'Yeah, man, what's up?'—pretending like nothing ever happened.\" Seemingly in response, during the BET Hip-Hop Awards cypher a few weeks later, Kendrick freestyled: Nothing been the same since they dropped \"Control\" / and tucked a sensitive rapper back in his pajama clothes.\n\nI got Kendrick on the phone after the BET taping, and he admitted to being surprised by Drizzy's public lash-out—\"Control\" named names, sure, but at its core it was a backhanded tribute to the peers Kendrick actually gives a shit about. Most of them took it in that spirit. Not Drake. \"Yeah, I guess he took it as a dis,\" Kendrick said, downplaying talk of a beef. But he was also clear that he doesn't look up to Drake, doesn't see him as any kind of creative influence. When I asked if Drake was a mentor or a role model, he replied quickly, \"No—peer. If anything. We all peers.\"\n\n\nWhen Kendrick Lamar was 21, 2Pac appeared to him in a vision. Before you roll your eyes, Lamar wants you to know that he's not the hermit-on-the-edge-of-the-Nitrian-Desert, vision-seeing type. He knows how this sounds.\n\n\"I was coming from a late studio session, sleeping on Mom's couch. I'm 26 now—it wasn't that long ago. I remember being tired, tripping from the studio, lying down, and falling into a deep sleep and seeing a vision of Pac talking to me. Weirdest shit ever. I'm not huge on superstition and all that shit. That's what made it so crazy. It can make you go nuts. Hearing somebody that you looked up to for years saying, 'Don't let the music die.' Hearing it clear as day. Clear as day. Like he's right there. Just a silhouette.\"\n\nThe visit from Pac changed Kendrick's connection to the world he was chronicling in his music and compelled him to think more carefully about who was listening to it. \"It wasn't just about money, hoes, clothes, drinkin',\" he explains. \"I mean, I come from that world, but at the same time, I started to realize that there's people out there that can't really connect to that lifestyle. They're in the struggle.\"\n\nMuch of Kendrick's music now is an attempt to transcend his ravaged world without separating himself from it in judgment, about somehow gaining control over his household's chaos—some of his uncles were Crips, and his father was reportedly a Gangster Disciple in Chicago before moving to Compton—and over his neighborhood's warped commitment to adolescent pride. It's an ethos that extends to his crew. They have a seriousness of purpose, a rigorous discipline that can feel slightly monastic at times. Kendrick doesn't smoke weed or drink booze. In the time I spent with him, I never witnessed anyone roll even the thinnest spider leg of a jay, nor did I see Kendrick so much as glance at the many, many girls around him. \"When I ask OGs why there's so much division in the streets—nobody never really knows,\" he says. \"But you know one thing that everybody always mention? A woman.\"\n\nA few hours after the VMAs, we were back in Kendrick's hotel room and everybody was in a lull, staring at cell phones, waiting for news about afterparties. A plan coalesced to hit a party being thrown by Diddy at the Dream Downtown hotel. But one of Kendrick's Top Dawg boys leaned back and said, \"Aw, man, I can't go to no club.\"\n\nKendrick spoke up.\n\n\"We have to go.\"\n\n\"Look at you! We have to go. You're never we have to go.\"\n\n\"You know me,\" Kendrick explained. \"I only go when there's a point. Usually the point is just niggas drinking. But walking through the club the week after I released the 'Control' verse? That's a point!\"\n\nTwenty minutes later, Anthony \"Top Dawg\" Tiffith, basically TDE's Suge Knight, asked if I had had a fun day. I said that I had and that I was surprised by their discipline. \"You guys seem so calm,\" I said.\n\n\"Well,\" Tiffith told me, \"we're going to have to call it a night with you, because we about to get uncalm. You understand.\"\nThe gossip from Diddy's Ciroc Amaretto Launch Party/VMA Afterparty sounded like it fell out of a massive tear in the mid-'90s West Coast-East Coast time wave. Bloggers breathlessly recounted a surreal scene at Dream: booths packed with hip-hop illuminati—Jay, Bey—mouths agape as a wasted Diddy, incensed by the \"King of New York\" boast, attempted to pour a drink (Ciroc Amaretto, presumably) over Kendrick's head, only to be thwarted by Jay Z acolyte J. Cole, who was kicked out in the ensuing chaos. Naturally Kendrick himself refused to corroborate any of this. \"It was all love at that party,\" he told me on the private jet.\n\nAfter we land at Teterboro Airport in New Jersey, I catch a ride with Kendrick into Manhattan. His show tonight is a New York Fashion Week kickoff party in Chelsea thrown by industry doyenne Jenné Lombardo, and in the car he goofs around, imagining the horror he and his Compton homeys could inspire: \"We invited Kendrick Lamar, not K.Dot and them Piru niggas.\"\n\nBy the end of his forty-minute set, the crowd is pretty fucked-up. There's chronic in the air; models are tottering in their heels. When Kendrick launches into the call-and-response for \"Swimming Pools (Drank),\" a song about his family's dark relationship with chemical dependency—Head shot. DRANK. Sit down. DRANK. Stand up. DRANK—a wraithlike six-foot blonde with a white veil dances around a little coven of models. There is something demonic about the scene: Kendrick recounting his fever dreams about the grim consequences of decadence while presiding over a decadent Fashion Week party.\n\nIt's hard to guess how scenes like this will change Kendrick and his music. Sometime in January, he will step into Top Dawg's booth again, and he expects to be just as surprised as the rest of us by what comes out. \"I don't know,\" he says. \"It depends on where my emotion is. How angry I'll be, or how happy I'll be, or how confused I'll be.\"\n\nAt one point on good kid Kendrick raps, \"I can feel the changes / I can feel a new life / I always knew life can be dangerous\". The biggest change in Kendrick's life is the inversion of rap's consummate observer becoming the observed. How will all eyez on him affect his art? Because he's already 10,000 feet above Compton, and rising.", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}