{"songs": [{"title": "Go DJ", "album": "Tha Carter", "year": "2004-10-05", "lyrics": "[Intro: Mannie Fresh]\nYeah, yeah, yeah, yeah, yeah\nGrown-ups, in between, children and babies\nRight about now is your boy, ya heard?\nBack again, DJ Mannie Fresh, Fre-re-re-re-Fresh\nYeah, Fre-re-re-re-Fresh\nFre-re-re-re-Fresh, Fre-re-re-re-Fresh\n\n[Hook: Mannie Fresh]\nGo DJ, that's my DJ\nGo DJ, that's my DJ\nGo DJ, that's my DJ\nGo DJ, yeah, well Weezy Wee\n\n[Interlude: Mannie Fresh & Lil Wayne]\nStep up to the mic, dude, do what you do, ya heard?\nYeah, yeah, yeah, yeah, yeah\nLadies and gentlemen\nWhat you have here is brought to you courtesy of\nThe young man Young Carter and the great man Mannie Fresh\nSo what I want y'all out there to do for me is\nSay this\n\n[Hook: Lil Wayne]\nSay \"Go DJ,\" 'cause that's my DJ\nSay \"Go DJ,\" 'cause that's my DJ\nSay \"Go DJ,\" 'cause that my DJ\nSo \"Go DJ,\" 'cause that my, 'cause that my\n\n[Verse 1: Lil Wayne]\nMurder 101, the hottest nigga under the sun\nI come from under the Tommy busting a Tommy\nYou come from under ya garments, ya chest and ya arm hit\nPow! One to the head, now you know he dead\nNow, you know I play it like a pro in the game\nNaw, better yet, a veteran, a hall of fame\nI got that medicine, I'm better than all the names\nAy, it's Cash Money Records, man, a lawless gang\nPut some water on the track, Fresh, for all this flame\nWear a helmet when you bang it, man, and guard your brain\n'Cause the flow is spazmatic, what they call insane\nThat ain't even my motherfuckin' aim, I gets dough, boy\nAnd you already know that pimpin'\n18, how I'm living? Young'n, show that Bentley\nStunna my Pa, so you know that's in me\nGotti my mentor, so don't go there with me, oh!\n(Let me hit the blunt first)\n\n[Hook]\nGo DJ, 'cause that's my DJ\nSay \"Go DJ,\" 'cause that my DJ\n(This is Tha Carter, oh)\nSay \"Go DJ,\" 'cause that my DJ\nSo \"Go DJ,\" 'cause that my, 'cause that my\n(These niggas is hilarious)\nGo DJ, 'cause that my DJ\nSay \"Go DJ,\" 'cause that my DJ\n(This is Tha Carter, blap)\nGo DJ, 'cause that my DJ\nSay \"Go DJ,\" 'cause that my DJ\n(Put your binoculars on, try to see me)\n'Cause that my, uh, that my\nLet's go\n\n[Verse 2]\nAnd I move like the coupe through traffic\nRush hour, GT Bent', roof is absent\nYour bitch present with the music blastin'\nAnd she keep askin', \"How it shoot if it's plastic?\"\nI tell her, \"You'll see if your boy run up\"\nShe sat back and cut Tha Carter back up, uh, fo' sho'\nAy, Big Mike, they better step they's authority up\nBefore they step to a sergeant's son, I got army guns\nYou niggas never harmin' Young\nFly Wizzy, my opponent's done, I'm done talkin' (shut up)\nAnd I ain't just begun\nI been runnin' my city like Diddy, you chump\nI fly by you in a foreign whip\nOn the throttle, with a model-bony bitch, pair of phony tits\nHer hair is long as shit, to her thong and shit\nWell, here we go, so hold on to this\n\n[Interlude]\nNow let's go\nHold on, let me hit the blunt again\nSo, go\nY'all say it with me this time\nThis is the, this is the, this is the\nThis is the, this is the, this is the\nThis is Tha Carter, oh\n\n[Hook]\nSay \"Go DJ,\" 'cause that my DJ (That my DJ, Mannie Fresh)\nSay \"Go DJ,\" 'cause that my DJ (Uh, that my DJ)\nSay \"Go DJ,\" 'cause that my DJ\n(These niggas so mad at me right now, Fresh)\nSay go DJ, 'cause that my, 'cause that my, 'cause that my\n(Guess what though, guess what?)\n\n[Verse 3]\nBirdman, put them niggas in the trash can\nLeave 'em outside of your door, I'm your trash man\nI'm steady lighting up the hash, and, riding in my Jag\nYou will need a gas mask, man\nYou snakes, stop hiding in the grass\nSooner or later I'll cut it, now the blade's in your ass\nYou homo niggas getting AIDS in the ass\nWhile the homie here tryna get paid in advance\nI'm staying on my grizzy, I'm a bona fide hustler\nPlay me or play with me, then I'm gonna find your mother\nNiggas wanna eat, 'cause they ain't ate nothin'\nBut niggas wanna leave when you say you out of mustard\nSo I'ma walk into the restaurant alone\nLeaving out, leaving behind just residue and bones\nIn your residence with Rugers to your dome\nLike, \"Where the fuck you holding the coke?\"\nHolding your throat, choke\n\n[Interlude]\nSo, go\nSo, go\nThis, this, this, this, this, this, this, this, this, this, this\nY’all say it with me\nThis is Tha Carter, oh\n\n[Hook]\nSay \"Go DJ,\" 'cause that my DJ\n(And that my DJ)\nSay \"Go DJ,\" 'cause that my DJ\n(Mannie, Mannie Fresh, yes, that’s my DJ)\nSay \"Go DJ,\" 'cause that my DJ\n(And this Tha Carter)\nSay \"Go DJ,\" 'cause that my DJ\n(Call me if you’re fuckin’ with me)\nGo DJ", "image": "https://images.genius.com/6ee63b9146a2a2f172e9188a9f1785a2.1000x1000x1.png"}], "artist": "Lil Wayne"}