{"songs": [{"title": "5% TINT", "album": "ASTROWORLD", "year": "2018-08-03", "lyrics": "[Chorus]\nWho's that creeping through my window?\n'Fore you come outside, I got the M4\nTook her to the endzone from the Enzo\nKnow I love to smoke, you love the liq more\nWanna hit the Jack, then what you call for?\nAll that out-your-name shit, that ain't called for, mm\n\n[Verse 1]\nWho that creepin'? Know the tint is dark (Five percent)\nAll that fall-in-love shit, gotta Kevin Hart (Yeah, yeah)\nAll that speed and fly shit, we might teleport, yeah (Skrrt, skrrt)\nAll that cop harass shit, I might clip a sarge, yeah (12)\nKeep bouncin' that ass, you just might get award, yeah\nIf she bad, she get a pass into the tour (Passes, yeah)\nI pick through the family, grab the bad sister like Janet\nOpps outside, don't panic, gotta switch, gotta change up transit\nStill jump around, move antsy, and I still don't like shit fancy\nUp late feelin' real chancy, they outside really tryna end me, yeah\n\n[Chorus]\nWho's that creeping through my window? (My window)\n'Fore you come outside, I got the M4 (M4)\nTook her to the endzone from the Enzo (Yah)\nKnow I love to smoke, you love to lick more (Yah-yah)\nWanna hit the Jack, then what you call for? (Yah-ah)\nAll that out-your-name shit, that ain't called for (Ya-ah)\n\n[Verse 2]\nWho the fuck is this?\nMet somebody baby mama inside of the VIP, while I'm tryna tip\nShawty said she holding, got a razor in her lip\nMix my cup and twist one up, I love that ratchet shit\nShe like, iced out wrists, iced out-iced out wrists (Iced out wrists)\nFuck don't kiss, fuck, she fuck don't kiss (Mwah)\nLook like friends but she say they twins (Twins)\nJump right in, there's legroom in this Benz (Legroom in this Benz)\nTen miles to the crib, you know that's deep (Deep, yeah)\nI think it's someone out there watching me, yeah\n\n[Chorus]\nWho's that creeping through my window? (My window, who?)\n'Fore you come outside, I got the M4 (M4)\nTook her to the endzone from the Enzo (Yah, yeah!)\nKnow I love to smoke, you love to lick more (Lick! Yah-yah)\nWanna hit the Jack, then what you call for? (Yah-ah, Jack!)\nAll that out-your-name shit, that ain't called for (Ya-ah)\n\n[Outro]\nWho's that creeping through my window?\n'Fore you come outside, I got the M4\nTook her to the endzone from the Enzo\nKnow I love to smoke, you love to lick more", "image": "https://images.genius.com/89e4a4dfbe3ff3a4f82963ff097ff443.1000x1000x1.jpg"}], "artist": "Travis Scott"}