{"songs": [{"title": "Take It EZ", "album": "Can I Borrow a Dollar?", "year": "1992-09-04", "lyrics": "[Intro]\n(Yo man, brothers out here saying you should come on a gangsta tip, and other brothers out here saying you should come on a smooth tip. You know what, be yourself and just take it EZ, you know what I'm saying?)\n\n[Verse 1]\nI'm (easy!) easy, easy like Sunday morning\nI can kick a stupid nervous joint when I'm yawning\nAhhh, Common's comin' with that old \"oh excuse me\"\nElizabeth, this is a big one, I mean a doozie\nDoogie, Howser, cause see, I'm like Bowser\nKickin it with the sha-na-na-na, the t-shirt\nAnd the trousers, how's the Family Ties?\nI'm left with the gift, open it up, SURPRISE!\nBig Mac, filet-o-fish, quarter pounder, french fries\nIcy Coke, milkshake, sundaes and apple pies\nAnd a cup? Nah, that's enough of that\nI'm like an Indian giver, yo, give me that back!\nComin again hip-pop-pop-pop bring it back selector\nWe be the thoroughbred, so use your head, play the Trifecta\nCommon infector, smug MC, heads up!\nYa better duck cause muthafuck', it's me\n[Now what's your name] Common\nCome in again... Common\n[How would you do it] Common\n[Now how was she] Common, check it out!\nCommon is coming soon to a theater near you\nTo the UAC crew, enough respect due\nDo I do, when I do, where I do\nI do, do, do, yo I do it on the ease\n\n[Verse 2]\nI be kicking it with the doubly-dope rhymer\nI'm trippin-and-dippin-and-slippin with the rhyme like Sliiiii-mer!\n(Who ya gonna call?) Ghostbuster\nI'm Petey Wheatstraw, and I'm just a\nHustler, I tried to scheme for a sec\nBut the record got wreck, tried to write a bad check\nSo I checked myself, before self got buck\nWild, tried to live how I had to fluctuate\nTo a state, and matriculate, yo I had to elevate\nYou can tell it's great, cause I'm state\nOff 87, the South side of Chicago\nFive-oh-one come follow me yo, everywhere that I go\nAnd I know I ain't did nothing [hell naw]\nThe district think I be just a lil trick kid fronting\nUAC got my back if there's any contact\nIn the back is a track from Immenslope soul cat\nAnd it's phat, sorta like Oprah before she lost weight\nI put my rhymes in good hands, hey like All State\nAnd I'm all in a state of ease, utopia\nI'm the Spiderman, givin bug MC's arachnaphobia\nHoly-molia, it's totally awesome\nThe survey says, I gets more skins than Richard Dawson\nBut I won't catch mono or no type of disease\nCause when I flex, for sex, I do it on the ease (Yeah!)\n\n[Interlude]\nOn the ease, (Check it out!) On the ease (How?)\nOn the ease, (Now here we go!) On the ease (Yeah!)\nOn the ease, (Check it out!) On the ease\n(Take it EZ!)\n(Yeah... In fact, it's feeling so good, let's take it all the way back to the '50s!\nSing it!)\n\n[Verse 3]\nA-wop-bop-a-loo-bop, a-lop-bam-boo\nI'm a Dr. Pepper, wouldn't you like to be a Pepper\nTwo-steppin' through, yodel-le-hee-hoo!\nOui oui ma cherie, et comment allez vous?\n(Contraire mon frere) Ok, truth or dare:\nIs it true that I'm dope? (Yeahhhh!)\nYippedy yes y'all, here we go a loopedy loop de loo\nA hubbeda hula hoop, a hubbeda alley oop to Coop\nI gots the Magic, but I'm not a Laker\nI'm shaking-and-baking and taking, cause I'm the back-board\nBreak her arm and feather, whipping the wonder when she activates\nHold up! My drawers are in my crack, [aight] pass the tape\nTime to activate, and ejaculate\nThis is the period where I menstruate (What!?)\nI meant to say demonstrate\nI'm in a state, where I've had too much eight, ball\nIn the corner pocket, count em, buck it\nA chicken, a finger-lickin with a finger-bone\nC'mon I'm on a roll, stippedy stutter-roll\nOwah-owah-owah-owah Ayatoll\nOf Khomein, my domain is infinite\nYa got trouble, well you need to get some dick\nAnd to the hip-hop shop, the future shock\nWhen we started kickin on the one two, and ya don't stop\nBut the buck stops here buckaroo\nYa got your instructions, now you know what to do\nTake it EZ!\n\n(Man... Matter of fact, we're gonna take it EZ so straight, so nice, we're gonna, we're gonna, we're gonna STOP!!!)", "image": "https://images.genius.com/53cc2f19e9b12ebe5a740bcb1f8cf8e5.465x465x1.jpg"}], "artist": "Common"}