{"songs": [{"title": "Black America Again", "album": "Black America Again", "year": "2016-09-22", "lyrics": "[Verse 1: Common]\nHere we go, here, here we go again\nTrayvon'll never get to be an older man\nBlack children, they childhood stole from them\nRobbed of our names and our language, stole again\nWho stole the soul from black folk?\nSame man that stole the land from Chief Black Smoke\nAnd made the whip crackle on our back slow\nAnd made us go through the back door\nAnd raffle black bodies on the slave blocks\nNow we slave to the blocks, on 'em we spray shots\nLeaving our own to lay in a box\nBlack mothers' stomachs stay in a knot\nWe kill each other, it's part of the plot\nI wish the hating will stop (war!) and the battle with us\nI know that Black Lives Matter, and they matter to us\nThese are the things we gotta discuss\nThe new plantation, mass incarceration\nInstead of educate, they'd rather convict the kids\nAs dirty as the water in Flint, the system is\nIs it a felony or a misdemeanor?\nMaria Sharapova making more than Serena\nIt took Viola Davis to say this\nThe roles of the help and the gangstas is really all they gave us\nWe need Avas, Ta-Nehisis, and Cory Bookers\nThe salt of the Earth to get us off of sugar\nAnd greasy foods; I don't believe the news\nOr radio, stereotypes we refuse\nBrainwashed in the cycle to spin\nWe write our own story, black America again\n\n[Sample: James Brown]\nYou know, one way of solving a lot of problems that we've got is lettin' a person feel that they're important. And a man can't get himself together until he knows who he is, and be proud of what and who he is and where he come from, and where he come from…\n\n[Verse 2: Common]\nHot damn, black America again\nThink of Sandra Bland as I'm staring in the wind\nThe color of my skin, they comparing it to sin\nThe darker it gets, the less fairer it has been\nThe hate the hate made, I inherited from them\nBut I ain't gon' point the finger\nWe got anointed singers, like Nina, Marvin, Billie, Stevie\nNeed to hear them songs sometimes to believe me\nWho freed me: Lincoln or Cadillac?\nDrinkin' or battle raps? Or is it Godspeed that we travel at?\nEndangered in our own habitat\nThe guns and dope, man, y'all can have it back\nAs a matter of fact, we them lab rats\nYou build the projects for, now you want your hood back\nI guess if you could rap, you would express it too\nThat PTSD, we need professionals\nYou know what pressure do, it make the pipes bust\nFrom schools to prison, y'all, they tryna pipe us\nTell your political parties invite us\nInstead of making voting laws to spite us\nYou know, you know we from a family of fighters\nFought in your wars and our wars\nYou put a nigga in Star Wars, maybe you need two\nAnd then, maybe then we'll believe you\nSee black people in the future\nWe wasn't shipped here to rob and shoot ya\nWe hold these truths to be self-evident\nAll men and women are created equal\nIncluding black Americans\n\n[Sample: James Brown]\nYou know, you know, you know, one way of solving a lot of problems that we've got is to let a person feel like somebody. And a man can't get himself together until he knows who he is, and be proud of what and who he is and where he come from, and where he come from…\n\n[Bridge: Stevie Wonder]\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story\nWe are rewriting the black American story", "image": "https://images.genius.com/565646b92582d86f0446dc67906334c7.1000x1000x1.jpg"}], "artist": "Common"}