{"songs": [{"title": "We Be Clubbin", "album": "Greatest Hits", "year": "1997-12-18", "lyrics": "Yaeeyaae uh huh uh huh brrr\nWe be clubbin'\nHeyy hey heyy heyy look here look here first of all I wanna welcome\nAll y'all broke ass entreponiggas to the Player's Club. Yaeeyaae\n\nVerse 1:\n\nIt's packed niggas don't know how to act\nWe the macks V.I.P's in the back\nWith a stack of numbers\nMy niggas like 'em dumber\nWe oughta get 'em smarter\nBaby take my order\nThe only shark that swim in Henn no water\nGot ya daughter doin' shit you don't think she oughta\nGave the order to slaughter any ass like that\nYou know how the lonely act off the cognac\nBrainiac with maniac Mack 10 (my nigga)\nDown ta get this mothafuckin' party crackin'\nNigga back in so we can smoke a dub\nDown ta bump all these bitches at the club (Yaeeyaae)\nShow me love [Hook starts over this line]\n\nChorus:\n\nWe be clubbin'\nEverybody likes when the girl\nShakes something\nNigga don't pull nothing (That's right)\nWe ain't dumping\nWe just bumpin' and bangin'\nLike it ain't nothing wrong\nGet ya club on (We be clubbin')\nAh, we be clubbin'(we be clubbin')\nYaeeyaae (we be clubbin' we be clubbin')\n\nVerse 2:\n\nWe gettin' in free so what the fuck now\nWSCG just touched down\nShow a nigga 'round\nLeast take a nigga to the sto'\n(Y'all in fo the night?)\nHell no\nSecurity bail slow up in the club\nRemember when they push & shove\nIt's only love\nDubs for everybody waitin' on us\nAnd fuck everybody hatin' on us\nDebatin' on us but we only visitin'\nAin't tryin' ta fuck with niggas in lizard skins\nI see you watching me, you should watch her\nCause if she sick of yo' shit I'm the doctor watch her\nShow her to the car\n& see how bad she wanna meet these stars\nThey know who we are (Where we going?) WESTSIDE\nNigga meet me by the bar\n\nBridge:\n\nShake it off shake it off take it off\nBreak it off break it off make it soft (4X)\nBrrr (we be clubbin') uhh (uhh) (we be clubbin' 2X)\n\nVerse 3:\n\nBaby beware Ice Cube is on tilt\nWaitress bitchin' off the drinks my nigga spilt\nEverybody's sweatin' like it's Armageddon\n1999 party over oops I'mma still grind\nStraight from the West put away yo' 9 (click click)\nDJ can ya play my shit one mo' time\nGoddamn you fine (my nigga speak on it)\nShe got ass for days (put a week on it)\nNow everybody in the world love to go clubbin'\nAnd after the club it's either breakfast or fuckin'\nHope we ain't duckin' from haters in the parking lot\nWho ain't got nothin' tryin' to prove sumthin\nFrontin' we be the niggas who be bluntin'\nOn our way to the Marriott keep 'em very hot\nWestside hittin' hairy cock all night long\nGet ya club on!\n\nChorus\n\nBridge\n\nChorus:\n\nWe be clubbin'\nEverybody likes when the girl\nShakes something\nNigga don't pull nothing (That's right)\nWe ain't dumping\nWe just bumpin' and bangin'\nLike it ain't nothing wrong\nGet ya club on\n\nHomeboys show me love up in the club (Yaeeyaae)\nHomegirls show me love up in the club\nSecurity show me love up in the club\nOwners show me love up in the club\nWaitress' show me love up in the club (Yaeeyaae)\nBartenders show me love up in the club\nL.A. show me love up in the club\nThe Bay show me love up in the club\nChicago show me love up in the club (Yaeeyaae)\nSt. Louis show me love up in the club\nMiami show me love up in the club\nNew York show me love up in the club\nDetroit show me love up in the club (Yaeeyaae)\nHouston show me love up in the club\nK.C. show me love up in the club\nDenver show me love up in the club\nD.C. show me love up in the club (Yaeeyaae)\nAtlanta show me love up in the club\nMemphis show me love up in the club\nDallas show me love up in the club (Yaeeyaae)\n\nI might spend a dub. Bitch!", "image": "https://images.genius.com/1e18d2f3fcd84f2299e63969ddae5710.600x596x1.jpg"}], "artist": "Ice Cube"}