{"songs": [{"title": "NY NY", "album": null, "year": null, "lyrics": "[Intro]\nTell 'em again, uh huh!\nWord to the world\nWord up, New York\nWord up, the Bronx, Brooklyn, Uptown, Queens\nMake noise!\nStaten Island, keep whylin'\nWord up (woo!)\nYeah, yeah, yeah NYC y'all\n\n[Verse 1]\nSteady bouncing in jeeps on these New York streets\nRecognize the elite, what we did with these beats\nYo your town wouldn't eat, if New York didn't speak\nDon't front with the heat, make me come with the fleet\nNew York is complete, all concrete\nThe center of the world, where all people meet\nI'm keeping this style simple, to make ends meet\nI could jump out of a window, and land on both feet\nNew York City is always ruling, reach and teach and always schooling\nNo I'm not fooling, crowd is not booing\nOriginal MC'ing, that's what I'm doing\n\n[Chorus + Hook]\nNew York, just so ya don't forget\nNew York, home of the Yankees and Mets\nNew York, something you have to see\nIt's the place to be, it's the place for me\nThat's.. tell 'em again..uh huh..yeah..that's right..word..word\n\n[Verse 2]\nNow you could shout your clique, and shout your town\nBut it's time we shout New York, hold it down!\nYou wanna see latinos, yo that's Boogie down\nAfrican-Americans, yo that's Uptown\nJamaicans, Haitians that's Brooklyn bound\nRun up to Queens, take a good look around\nLower Manhattan all the way out to Staten\nNew York is the birth of DJ'in and rappin'\n\n[Hook]\nThat's.. yeah yeah.. tell em again.. word word word.. uh huh.. yo yo yeah\n\n[Verse 3]\nCheck it!\nGun clap, and cops, cracks and rocks\nRoad blocks, routine traffic stops\nBut that raw Hip-Hop it's ova hear\nYou could check my city grammar, it's cold and clear\nWhat we gave the world, saved the world\nBefore hip-hop, pop enslaved the world\nBut we freed ourselves with the help of Kool Herc, Afrika Bambaataa, and Flash did work\nThis is the reason we respect these people\nCause when they was doing it, Hip-Hop was illegal\nNow we all legal, and heads wanna floss\nThey forgot hip-hop, and all the lives that was lost\nYou see the way they dress, and the way they talk\nThey claim they da best, but that's all New York\nImma shout it to the world, the truth is out, NY #1, and we in the house\nThat's...", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}