{"songs": [{"title": "P.L.O. (Remix)", "album": "Meth Lab Season 2: The Lithium", "year": "2018-12-14", "lyrics": "[Intro]\nCh'yeah\nUh huh\nIt's the remix, mother fucker!\nYes, sir!\nPLO\n\n[Chorus: Lounge Lo & Hue Hef]\nWhere you think he got it from? PLO (PLO)\nLights be so melodic at the PLO (PLO)\nPLO (PLO), PLO (PLO)\nThey'll be a buncha killers at the PLO (PLO)\nWhere you think he got it from? PLO (PLO)\nYeah\nCome and dig your pockets at the PLO (PLO)\nA new generation, we still out there gettin' money\nPLO (PLO), PLO (PLO)\nLook, look\nRaised me from the slums now I'm CEO (CEO)\nYeah\n\n[Verse 1: Hue Hef]\nYou heard PLO style, nigga, I'm back again (Okay)\nThey told you G Bully be well in love with them Africans (Facts)\nHeffner back on that shit, I guess they mad again (Aw shit)\nGet crazy on the records, I tear 'em down when I'm battlin' (Yeah)\nCome and off your re-up\nHit the strip, I drop a bomb in thirty minutes like I'm North Korea (Sheesh)\nIt take a lot to beat us (Yeah), you better join us (Uh)\nYou still keep lookouts on the corner, they be on us\nI still rep the PLO like I'm everythang (Uh huh)\nCrazy like a terrorist, hella, pitch it, then I'ma clap (Blap)\nPull the trigga on any jigga, you fade to black\nThis a liberation, they tried to take it, we took it back\n\n[Verse 2: Hanz On]\nThat's where the trappers go and post the clocks\nBacon, egg, and cheese, then it's off to get this gaup (Let's go)\nMr. Barker gray and he ain't never gon' stop (Uh huh)\nSeen it from the bottom, everything look like the top\nI swear to God, Park Hill made 'em, broke the mold (Yup)\nSolidify 'em, niggas frontin' on him, he reload (Reload)\nIt's all about the work, money, never 'bout them hoes (Nope)\nFrontin' on a Staten, get your fuckery exposed (Fuckery)\nFrontin' on a Staten, we dismantle niggas, facts\nFuck them niggas rattin', we should kill a couple stacks\nMy people, are you with me? Where the fuck my hittas at?\nPark Hill lives on, still I lay 'em flat (Park Hill)\n\n[Chorus: Lounge Lo]\nWhere you think he got it from? PLO (PLO)\nLights be so melodic at the PLO (PLO)\nPLO (PLO), PLO (PLO)\nThey'll be a buncha killers at the PLO (PLO)\nWhere you think he got it from? PLO (PLO)\nCome and dig your pockets at the PLO (PLO)\nPLO (PLO), PLO (PLO)\nRaised me from the slums now I'm CEO (CEO)\n\n[Verse 3: Streetlife]\nPLO style buddah monks with the Dutch Master blunts\nHashtag Fuck Donald Trump (Ha)\nMomma didn't raise no punk, tough love (Tough love)\nIf push come to shove, nigga, I don't budge (Don't budge)\nThis is what I does, I'm a born G (Born G)\nCheck my DNA, all in the family\nPark Hillian, thoughts covered like an Arabian\nTitanum nod pointed at your cranium\nCriminal minds and verse, no compromisin'\nIt's kill or be killed, no silver linin'\nThin line, life or death, Bruce co-signin'\nBottom line, dollar signs, gimmie mine\n\n[Verse 4: Method Man]\nPLO style, Mr. Meth, Staten Isle\nStill got shotguns to slam up in your chest piece, blow (Ha)\nWe hot son, you could catch a hot one now\nAnd I'ma keep kickin' doors 'til we knock one down\nThese rappers throwin' flags, they should be throwin' in the towel (Towel)\nHoney showin' me her pat I'm tryna throw it in her mouth (Ha)\nIn fact, I'm throwin' bows like they throw 'em in the south\nArm and Hammer, nothin' like the bakin' soda in your house\nY'all don't really know what PLO about (About)\nY'all just shoot box money to a CEO account (Ha)\nPut millions in the bank, roll a C-Lo and I'm out\nI be steppin' on these rappers like a kilo in the drought\n\n[Verse 5: Lounge Lo]\nI run through, the killer, high tops with the sweats on\nPLO boomers they lie and get they wreck on (Uh huh)\nPark Hill, my squad ill, you know the set strong\nIt's the god damn, god damn up on this Meth song (Right)\nI'm from the oob building, yeah, where they bet wrong\nSell crack, diss cats, yeah, boy, TEC long (Ha)\nI know you happy that that real nigga Tech gone\nSchoolboy load my flow y'all niggas slept on (Psh)\nRight, I'm in the elevator, lights out\nGet to the fourth floor, take a nigga life out (Ha)\nHanz On, my man's on, no whiteout\nMeth Lab 2, the water team, we ride out\n\n[Chorus: Lounge Lo]\nWhere you think he got it from? PLO (PLO)\nLights be so melodic at the PLO (PLO)\nPLO (PLO), PLO (PLO)\nThey'll be a buncha killers at the PLO (PLO)\nWhere you think he got it from? PLO (PLO)\nCome and dig your pockets at the PLO (PLO)\nPLO (PLO), PLO (PLO)\nRaised me from the slums now I'm CEO (CEO)", "image": "https://images.genius.com/ed8b9d6333cc29967da88416db3514c8.1000x1000x1.jpg"}], "artist": "Method Man"}