{"songs": [{"title": "Jodye", "album": "LONG.LIVE.A$AP (Deluxe Version)", "year": "2013-01-15", "lyrics": "[Verse 1]\nBitch motherfuckers trying to fake it trill\nSneak diss you just to make a bill\nNow the world won't take you serious\nWhen I met you, you was painting nails\nLeave a motherfucker layin' still\nB-bang him with the stainless steel\nCause I'm making the order\nLaugh at the altar, pullin' a Lord up\nDon't get someone sawed up\nYour brain in a sawdust, niggas is washed up\nI bang out in Florida\nShoot in Miami, goons out in Georgia\nBeen to New Orleans\nBut still a New Yorker, nigga the talk of\nTown, nigga we bossed up\nBounce, but when you talk to the Lord\nOf course, you're forced to\nBow down like a motherfuckin' peasant\nStill that pretty motherfucker\nAnd you know Harlem's what I'm reppin' nigga\n\n[Chorus]\nFuck them other niggas 'cause I'm down for my niggas\nFuck them other niggas 'cause I'm down for my niggas\nFuck them other niggas, I'll ride for my niggas\nI’ll die for my niggas, man, fuck them other niggas!\n\n[Interlude]\nLord, please talk to me Lord\nI am here for you Lord\n\n[Verse 2]\nGettin' faded, hair gettin' braided, Sophie sniffed a line of ye\nPlayin' spades, bumpin' Jimi Hendrix \"Purple Haze\"\nA 40 to the face, call my homies from around the way\nGive me that pussy, I'll be on my way\nBut grab the Jimmy so the bitch don't get no cash up out me\nPretty nigga, I'm a jiggy nigga, ask about me\nFuck niggas talkin' trash about me\nBut you know I toke a gauge, it can make any problem go away\nTalkin' Jay, talkin' Ye, that mean you niggas talkin' cray\nRazor blade across your face, I fix my face then walk away\nI guess then there's nothin' more to say\nTrill nigga to the death, whether Hell or the pearly gates\nI think back to my early days\nWhippin' and pinchin' that broad dough\nIt's a bit different now, switchin' and flippin' that raw flow\nSubstance get me higher, reefer and some fire\nThe devil is a liar, biased preachers shall retire\nJesus walked on water, I'm preachin' to the choir\nLong live A$AP, now bow to your Messiah, bitch!\n\n[Outro]\nLet the Lords toast with the Lords\nToast to the Lords\nWhen come gods, come Lords\nLords! Lords! Lords!\nOh, Lord! Toast to the Lords!\nAs we live this day, please pray for us\nWhen comes the saints, comes the evils, brings the Lords", "image": "https://images.genius.com/75621d1119a70043aadbe3fbf4387d88.640x640x1.jpg"}], "artist": "A$AP Rocky"}