{"songs": [{"title": "Smile For Me Now", "album": "Death Row Greatest Hits", "year": "1996-11-26", "lyrics": "[Intro: 2Pac]\nThere's gon' be some stuff you gon' see\nThat's gon' make it hard to smile in the future\nBut through whatever you see\nThrough all the rain and the pain\nYou gotta keep your sense of humor\nYou gotta be able to smile through all this bullshit\nRemember that!\nMmm, yeah, keep ya head up! Yeah\n\n[Verse 1: 2Pac]\nOur lifestyles be close-captioned, addicted to fatal attractions\nPictures of actions be played back in the midst of mashin'\nNo fairy tales for this young black male\nSome see me stranded in this land of hell, jail, and crack sales\nHustlers hardly think of culture\nOr the repercussions while bustin' on backstabbin' vultures\nSellin' my soul for material wishes, fast cars, and bitches\nWishin' I live my life a legend, immortalized in pictures\nWhy shed tears? Save your sympathy\nMy childhood years were spent buryin' my peers in the cemetary\nHere's a message to the newborns waitin' to breathe\nIf you believe, then you can achieve: just look at me!\nAgainst all odds, though life is hard we carry on\nLivin' in the projects, broke with no lights on\nTo all the seeds that follow me, protect your essence\nBorn with less, but you still precious; just smile for me now!\n\n[Hook]\nOh smile, oh won't you smile for me?\n(Oh won't you smile for me?)\n(Just smile for me now)\nOh won't you smile for me\n(Smile)\n(What you lookin' all sad for?\nNigga, you black, smile for me now)\n(All you gotta do is smile)\nOh won't you smile for me\n(You ain't got nothin' to be worried about)\n(No doubt, smile for me now)\n(I want you to smile)\nOh won't you smile for me\n(And the next generation)\n\n[Verse 2: Scarface]\nNow, as I open up my story, with the blaze of your blunts\nAnd you can picture thoughts slowly, up on phrases I wrote\nAnd I can walk you through the days that I done\nI often wish that I could save everyone, but I'm a dreamer\nHave you ever seen a nigga who was strong in the game\nOverlookin' his tomorrows, and they finally came?\nLook back on childhood memories, and I'm still feelin' the pain\nTurnin' circles in my 9th grade, dealin' cocaine\nToo many hassles in my local life, survivin' the strain\nAnd a man without a focus, life could drive him insane\nStuck inside a ghetto fantasy hopin' it change\nBut when I focus on reality we broke and in chains\nHad a dream of livin' wealthy and makin' it big\nOver football chose to cook raw, wouldn't take but I did\nAnd after all my momma's thankin' God for blessin' the child\nAll my momma gots to do now is collect it and smile; smile!\n\n[Hook]\nOh, won't you smile for me\n(Smile for me now)\nOh, won't you smile for me\nOh, won't you smile for me\nOh, won't you smile for me\n\n[Verse 3: 2Pac]\nFuck the world, as we elope and witness furious speeds\nUnanswered questions keep us all stressin', curious G's\nBackstabbed and bleedin'\nCrooked thoughts laced with weed, learnin'\nDuckin' stray shots, bullets be hot, they burnin'\nInhalin' sherm smoke, visualize the flames\nWill I be smothered by my own pain?\nStrange whispers, cowards conversate, so quick to diss us\nTakin' pictures for the feds in desperate hopes they'd get us\nHit us off, give us plenty centuries\nForgive my sins, since I entered many penitentiaries\nThe best revenge is \"Fuck friends!\" – we military minded soldiers\nBustin' shots blindly, tryin' to find Jehovah\nTo help me, somebody save me, lost and crazy\nScared to drop a seed hopin' I ain't cursed my babies\nMaybe now niggas feel me now, picture my pain\nEmbrace my words, make the world change\nAnd still I smile, nigga\n\n\n[Outro]\nOh, won't you smile for me\n(Sometimes you gotta let it feel good)\nOh, won't you smile for me\n(Smile for me now)\nOh, won't you smile for me\n(Oh, smile)\nOh, won't you smile for me\n(Smile for me now)\n(You know keep ya head up)\nOh, won't you smile for me\n(Hey, keep ya head up)\nOh, won't you smile for me\n(Oh, keep ya head up)\nOh, won't you smile for me\n(2Pac and Scarface keep ya head up)\nOh won't you smile for me\nOh, won't you smile for me", "image": "https://images.genius.com/9b791e9e8865e577e788752e38145914.1000x1000x1.jpg"}], "artist": "2Pac"}