{"songs": [{"title": "Quote Me", "album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "lyrics": "[Intro]\nJ. Cole\nHaha uh\nYeah, uh\nYeah, Yo\nBear with a nigga man\nGotta a little head cold, ya know?\nI'll still kill it nigga\nShow y'all niggas how it do\nReal Quick\n\n[Verse 1]\nUh You know what they say;\nThe window to the soul is in the eyes\nSo disrespect a nigga, I will close a nigga blinds\nYeah who can hold us? Super focused\nShoot them hoes with the Super Soakers\nI got 'em so wet\nFuck that Moet, I'm Hennessy drinking\nWonder what my enemies' thinking\nNervous? nigga, please\nI'm finna be caking with dough-\nSo much bread, its like a nigga be baking\nWatch so cold, it's like the shit will need blankets\nMoney coming soon, tell my niggas be patient\nWe gonna replace those whips with some sicker ones\nWe gonna erase them chicks for some thicker ones\nHit and run, bigger funds\nBut still can't forget to pour liquor\nAs I reminisce on them niggas that couldn't come\nRest in peace, can't control another man's destiny\nSo I do what's best for me\nI know you fake niggas well, ain't no test to me\nOn my plate is a meal, ain't no recipe for that\nSo nigga chill or the tec will speak, \"Blaaat!\"\nThem niggas will put you chest to feet\nI'm talking reckless\nWhat you expect nigga, I'm flexing\nY'all dyslexic, got a nigga twisted\nNever shot a nigga, I don't gotta get convicted\nCause if I say the word, your whole squad is getting lifted\nWhat up then? Niggas ain't saying nothing? Shut up then!\nWouldn't last a minute in the city I grew up in\nWhere I got my swag, cool as the breeze is\nChip on my shoulder, I walk like I'm Jesus\nAbout that paper, we could give a fuck if you believe us\nLooking for model divas that barely speak English\nFuck 'em while we rich, cuz when we broke, they gonna leave us\nWe earn stripes, looking like zebras\nY'all looking like Adidas\nWe do it for the streets, cuz they need us\nGot beef? Come meet us\nOk I thought so\nY'all niggas are so mad cuz I floss so bad on bitches\nAnd with this stroke, I'm Picasso\nMake her stomach feel the fossil\nNow she yelling out God so much thought I had her singing gospel\nShit, shout out to my apostles\nYa know me\nNicest nigga in the south\nYea you can quote me!\n\n[Outro]\nWooo Shit!\nHaha\nOoooh Shit, mother fucker!\nHahaha\nOohh Shit\nAnd I'm sick bitch, holla at me!\nYou know!\nFuck boy!!", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg"}], "artist": "J. Cole"}