{"songs": [{"title": "Backstabber", "album": "Infinite", "year": "1996-11-12", "lyrics": "[Intro: Police Scanner]\nAttention all units, attention all units\nWe have an all-points bulletin out on a man with green hair\nI repeat, we have an APB on a man with green hair\nHe's armed with a knife, I repeat, he's armed with a knife\nProceed with caution, watch your back, fellas\nHe could be coming at your girlfriend next\n\n[Verse 1]\nThere's a joker on the loose from the psychiatric ward\nHis face is up on the bulletin board with a reward\nHe'll stab you with a sword, don't be fooled by his charm\nHe's probably armed with intent to do bodily harm\nRing the alarm, look for a man with green hair\nCheck at your girl's house, he was last seen there\nHe's has a mean stare but usually cracks jokes\nGood luck on your mission and guard your backs, folks\n\n[Hook]\nCome here, you fuckin' backstabber!\n(Why I oughta) beat a bitch snake from the hood\nHaha, come here, you fuckin' backstabber!\n(Why I oughta) stay away from him, he ain’t no good!\n\n[Verse 2]\nWe got the walkie-talkies to keep us all informed\nSuited up head to toe in detective uniforms\nOur unit storms in, we split the ghetto in sectors\nLockin' down every block and put up metal detectors\nProtect yours and be sure that you stand close\nWatch each other's backs and guard your command post\nAnd most of all be advised that he's wise\nHe could be disguised as one of your very own guys\n\n[Hook]\nCome here, you fuckin' backstabber!\n(Why I oughta) beat a bitch snake from the hood\nHaha, come here, you fuckin' backstabber!\n(Why I oughta) stay away from him, he ain’t no good!\n\n[Verse 3]\nI'm on a solo mission to find him personally\nTo settle the score and to beat him unmercifully\nFor what he first did to me, it's sure to be the last\nFollowin' footprints with a magnifyin' glass\nTo drag his lyin' ass back to his padded cell\nI'm mad as hell, on the trail of this tattle tail\nI heard a yell, the voice sounded familiar\n\"Give me your girlfriend or I'm gonna kill ya!\"\n\n[Hook]\nCome here, you fuckin' backstabber!\n(Why I oughta) beat a bitch snake from the hood\nHaha, come here, you fuckin' backstabber!\n(Why I oughta) stay away from him, he ain’t no good!\n\n[Verse 4]\nI followed the voice that led down a flight of steps\nSneezin' at dust, and swingin' at the spider webs\nInside the depths of his basement\nI taste lint, in my mouth\nThen the lights in the place went\nI saw my life flash in front of my eyes\nI felt a butcher knife slash at one of my thighs\nNone of my guys knew where I'm at, I was doomed\nThen I remembered the flashlight in my costume\n\n[Hook]\nCome here, you fuckin' backstabber!\n(Why I oughta) beat a bitch snake from the hood\nHaha, come here, you fuckin' backstabber!\n(Why I oughta) stay away from him, he ain’t no good!\n\n[Verse 5]\nDealing with backstabbers, there was one thing I learned\nThey're only powerful when you got your back turned\nI yearned for the day that we finally met again\nSo I can give him a taste of his own medicine\nHe shed his skin, then he promised to come clean\nI took his butcher knife and jabbed it into his spleen\nCuffed him at the scene, then dragged the fella home\nBeating him over the head with the telephone\n\n[Police Voice]\nAttention all cars, attention all cars\nUnit 313 has apprehended the suspect\nHe's going back to the crazy home\nI repeat, he's going back to the crazy home\nJob well done\n\n[Hook]\nCome here, you fuckin' backstabber!\n(Why I oughta) beat a bitch snake from the hood\nHaha, come here, you fuckin' backstabber!\n(Why I oughta) stay away from him, he ain’t no good!", "image": "https://images.genius.com/a4f759aba2e16ec0dc9f29d1577cfede.1000x1000x1.jpg"}], "artist": "Eminem"}