{"songs": [{"title": "What in XXXTarnation", "album": "XXXTENTACION Presents: Members Only, Vol. 3", "year": "2017-04-18", "lyrics": "[Intro: XXXTENTACION & Ski Mask the Slump God]\nHahaha, haha, ayy, ayy\nOur haters not gonna like us for this one (Yuh yuh yuh)\nThey really not gon' like us for this one (Ayy)\nHey, tell all these industry niggas, \"suck my dick\"\nTwo times, (Water) three times, four times\nAnd if you listenin' to this shit and you don't like me (Wet, flex, huh-huh)\nEat my ass (Yuh)\n\n[Verse 1: XXXTENTACION & Ski Mask the Slump God]\nPosted with that pump (Ayy, ayy)\nRelay with that pump (Race) (Ra-ra-ra)\nHe stay with that pump (What he do?)\nYou fuck niggas punks (You fuck nigga)\nRevenge on my body, mhm\nShe want meet my shawty, mhm\nNot talking about my bitch\nI'm talking big guns, yes big body, mhm\nMy dick not impressed\nMy dick anorexic (Huh)\nMy gun got dyslexia (Dagger)\nThat mean I shoot backwards, backwards\nWhat's up with these questions (Wet)\nThese fuckboys detectives (Wet)\nFuck my codefendant (Mhm)\nIf he talk to the feds, Ash Ketchum, ayy\nWash (Wash), out your pussy, your shit stank, boy (Ewww, ayy)\nPause (Pause), like I'm Tosh 2.0, watch boy (Ewww, ayy)\nThot (Thot), suck on my dick like a damn lollipop, boy (Suck on my dick like a, suck on my dick like a)\nStop (Stop), talking about things that you know you are not, boy\n(Ayy ayy, ayy ayy, ayy ayy)\n\n[Bridge: Ski Mask the Slump God & XXXTENTACION]\nDiamonds just might shine like Skittles, huh(Ayy ayy)\nDiamonds white like Malcolm in the Middle, huh (Ayy ayy, ayy ayy, ayy ayy)\nDiamonds just might shine like Skittles, huh (Diamonds just might shine like)\nDiamonds white like Malcolm in the (Ayy ayy, ayy ayy)\nDiamonds just might shine like Skittles (Get it)\nDiamonds white like Malcolm in the Middle (Get it), huh\nDiamonds just might shine like Skittles, huh\nDiamonds just might shine like (Ayy, ayy, ayy ayy)\n\n[Verse 2: Ski Mask the Slump God]\nMy dick unimpressed (Wet)\nYou take Xans that's pressed (Okay)\nMy shirt striped like Ness (Stripes)\nFlash them titties at me like the press (Designer)\nSpeaking like I'm Hurricane Chris\nPull up on your mama I say \"A Bay Bay\" (A Bay Bay)\nLike I'm YMBAPE (Like I'm YM-)\nI'm beating on my chest when I see the pussy if they ain't coming\nBitch off the rip (Bitch off the)\nJust like a baby she just gon' take it from the tip (Just like a)\nI just \"Swiper, no swiping\" that pussy 'cause I dip (Mhm)\nWalked up in the division like \"are you tryna pull?\" (Huh)\nAnd there's no nigga that I fear (Huh)\nGot the horror of a spear (Huh)\nGot to be kidding me, made me giggle like tickle me\nYou said this nigga envy me\nBitch you shaped like a centipede\nAnd my songs long as centuries\nBitch I must have to pull the .45 on my hip (Pew, pew, pew)\nI just got her cum on my dick (I just got her cum on my)\nArthritis wrist on sick (Arthritis wrist on)\nCut my diamonds then get blisters (Ouch!)\nBlood diamond (Ouch!), ratchet ass bitch\nShe done sucked my dick and then you kissed her (Kissed her)\nYou just might just throw a bitch fit (Throw that! Throw that!)\nBender with me cause the metal on my hip (Throw that! Throw that!)\nFour-five bust like zit (Pew, pew)\n\n[Outro: Ski Mask the Slump God]\n(Bam!) Four-five bust like zit\nFour-five bust like zit (Aw)\nFour-five bust like zit\nFour-five bust like zit (Huh)\nFour-five bust like zit (Yuh)\nFour-five bust like zit (Water)", "image": "https://images.genius.com/453092ef82814c02da9aadb6ff9bb26d.1000x1000x1.jpg"}], "artist": "XXXTENTACION"}