{"songs": [{"title": "Tables", "album": "The Pimp Tape", "year": "2018-11-09", "lyrics": "[Intro: Too $hort]\nTables (Drumma Boy)\nTables (Tables), tables, tables, tables (Tables)\nTables (Tables), tables (Tables), tables\nY'all ain't got no more tables? (Bottle service!)\n\n[Verse 1: Too $hort & Snoop Dogg]\nSup Snoop? Where you goin' $hort?\nI'ma hit like six clubs tonight\nI'ma get a bitch, she gon' get a bitch\nGet another bitch, we gon' fuck tonight\n($hort, can I roll?) Your square ass don't know what it's like\nA Spanish bitch, an Asian bitch\nThe other white, I love my life\nHooked on the party, I can't go home\nGot two bitches on my phone saying they both on\nBitch I'm gone ho, we gon' have to fuck another night\nI'm at the strip club high as a kite\nI told the bitch she the love of my life\nYeah right, psyche!\nJust wanted some head before the flight\nGoin' to Vegas on the way to the fight\nI can't make that bitch my wife\nAsk Hef, \"Who was his biggest competition?\"\nFor the last twenty years I been fucking all his bitches\n\n[Chorus: Too $hort]\nI walked in, got a table at the strip club\nI walked in, got a table at the night club\nI walked in, got a table at the strip club\nI walked in, got a table at the night club\nTables (Tables), tables (Tables), tables, tables, tables (Tables)\nTables (Tables), tables (Tables), tables (Bottle service!)\n\n[Verse 2: 2 Chainz]\n(Yeah, 2 Chainz)\nI say I'm on the level (On the level)\nJust bought another bezel (Just bought another bezel)\nPut it in the paint shop (Put it in the paint shop)\nNow that bitch yellow (Now that bitch yellow)\nI be flying out to Cali just to duck and dodge raindrops\nFuck with me, you need your thang cocked\nNigga know my old studio where I rapped and trapped out the same spot\nI do kush, yup, y'all niggas trippin' (Trippin')\nWatch how I move through the city (City)\nBrand new .357 (Yeah)\nNose on it longer than pickles (Tell 'em)\nAnd yeah I know where the yay at (Uh)\nNever put it where you stay at (Nah)\nAnd you gon' need some CDLs just to drive this motherfuckin' Maybach (Yeah)\nStarted on the motherfuckin' block, stand on the corner with a streetlight and a Glock\nWhen I walked in the party, I walked in the party with a bad bitch from the south\n2 Chainz with a Z, ho (Ho)\nYour baby daddy is a zero ('Ro)\nAnd she know what time it is\nI told her \"mind her biz,\" left a ho like Tebow\n\n[Chorus: Too $hort]\nI walked in, got a table at the strip club\nI walked in, got a table at the night club\nI walked in, got a table at the strip club\nI walked in, got a table at the night club\nTables (Tables), tables (Tables), tables, tables, tables (Tables)\nTables (Tables), tables (Tables), tables\nY'all ain't got no more tables? (Bottle service!)\n\n[Verse 3: Snoop Dogg]\nTen hoes, one pimp\nMastermind, manuscript\nAdd that shit up and hit 'til I hit up\nAnd don't say shit, let my other bitch get up\nShoot 'til I shot up with Bill Gates daughter\nBetter act like that- na-na-not a\nSay a word, ayy, a word\nMy bitches fly like they a bird\nUnder my wing with one of my things\nAlways shine like one of my rings\nProfile, strobe light\nI'ma knock like six hoes tonight\nSo young, so tight\nSo rich, so white\nThat's my lil tramp I'm fucking with\nI am the one got her sucking dick\nKnock a new bitch like Dolemite\nPass my blunt, don't hold it light\nGet that dick, it's on tonight\nSpit that shit when I'm on the mic\nClick-clack, tic-tac-toe\nBig mack, pimp that ho\nReal talk, spit that flow\nPay a pimp, I gotta get that dough\n\n[Chorus: Too $hort]\nI walked in, got a table at the strip club\nI walked in, got a table at the night club\nI walked in, got a table at the strip club\nI walked in, got a table at the night club\nTables (Tables, nigga), tables (Tables), tables, tables, tables (Tables)\nTables (Tables), tables (Tables), tables (Tables)\nY'all ain't got no more tables? (Bottle service!)\n(Bottle service! Bottle service! Bottle service!)", "image": "https://images.genius.com/46e22a0f3338d4832cc1464e3d1176d3.680x680x1.jpg"}], "artist": "Too $hort"}