{"songs": [{"title": "From Adam", "album": "The Documentary 2.5", "year": "2015-10-16", "lyrics": "[Intro: The Game + sample]\nHere we go again\nTen years later\nYou know what man? Uhm\n(\"I wanna know!\")\nFuck it\nAyo C\nGive me that Jameson and that pickle juice\nThank you\nI got some shit on my mind\n(\"I wanna know!\")\n\n[Verse 1: The Game + sample]\nMy little nigga Frogg dead, dog\nThey shot my little nigga in his head, dog\nYou heard what the fuck I just said, dog?\nWalk inside my closet like fuck everything red, dog\nIf you seen your best friend stiff, you would cry too\nSometimes I don't even wanna be a Piru\nThen I think about it like, fuck everything blue\nWho killed my motherfuckin' brother?\n(\"I wanna know!\")\nWho killed G man too? The shit I seen men do\nIf I told you, I'd have me floating in some cement shoes\nSee Compton ain't shit really\nAnd I’ve been at the bottom of the pits, feel me?\nI done had some real niggas try to kill me\nFake niggas in my crew\nCrip niggas more loyal than a few of my Piru\nI done been shot, had a surgery or two\nAbove the rim like Pac, I’m like birdie at the troops\nI can’t lie, every time I see Suge my heart beat\nCause I don’t know if I should dap him or let the hawk speak\nWilmington and Brazil, nigga them my cross streets\nAnd who gon’ take it from me?\n\n[Hook: Lil Wayne]\nThey think they know me\nBut they do not know me\nCause I do not know me\nWho killed my homie?\nI wanna know names\nClick-clack explain\nI can kill you but ain’t nothing gon' change\nBut I might do it anyway\nYou gonna die any way\nI’m gonna die any way\nWe can go any day\nIt can be any day\nBut for you\nToday is the day\nToday is the day\n\n[Verse 2: The Game + sample]\nI was playing Madden then I heard a knock\nEverybody know I got shot but this for niggas that forgot\nSometimes I thank God that I got set up\nWhen you shot twice in the chest, it's kinda hard to keep your head up\nSuspect one: the homies never came to see me\nSuspect two: Red hid my gun behind the TV\nSuspect three: I was beefing with this Crip in my apartment\nShit started cause we fought and he couldn't see me\nThere's usually ten niggas in our dope spot\nCold ass night, I'm like a janitor at Wing Stop\nI usually play Xbox with the gun cocked\nI'm cool with taking mine, but I took other niggas' gunshots\nChest wide open, I'm tryna fight, but my lungs not\nHole in my chest bout the size of a kumquat\nI know who shot me 'cause I shot them\nBut who set me up? I ain't tripping but—\n(\"I wanna know!\")\n\n[Hook: Lil Wayne]\nThey think they know me\nBut they do not know me\nCause I do not know me\nWho killed my homie?\nI wanna know names\nClick-clack explain\nI can kill you but ain’t nothing gonna change\nBut I might do it anyway\nYou gonna die any way\nI’m gonna die any way\nWe can go any day\nIt can be any day\nBut for you\nToday is the day\nToday is the day\n\n[Verse 3: The Game + sample]\nLet me tell you how I met my nigga Wack\nShit, he ain't always have a nigga back\nWhen I met him, he was standing behind Suge\nAnd everything is all good when you banging for your hood\nCompton\nThat nigga Wack got my number and came through\nNow let me tell you the type of shit the Game do\nHe walked in the booth where I was spitting\nGave him ten thousand, couldn't even finish his fuckin' sentence\nI ain't owe him shit, but real recognize real\nNow we like two red-nosed Pits\nCross him, you gotta cross me\nAnd don't forget about where my nigga AR be\nHe be in the cut, that niggas nuts, don't give a fuck\nLove his nigga Game to death, and he mean it from the guts\nBlood, what's up? Which one of you dumb mothafuckas wanna try us?\n(\"I wanna know!\")", "image": "https://images.genius.com/72a00bceccb1bffdad5f44c0094145dd.1000x1000x1.jpg"}], "artist": "The Game"}