{"songs": [{"title": "Trap Phone Bling (Hotline Bling Remix)", "album": null, "year": "2018-12-01", "lyrics": "[Intro]\nPlease leave your message after the tone...\nHello?\nHello?\nYou need to hit me back cause you told me to call you when I need that\n\n\n[Chorus]\nYou used to call me on my trap phone\nLate night when you need my drugs\nYou would call me on my trap phone\nLate night when you need my drugs\nAnd I pick up like hotline bling\nThat could only mean one thing\nI-I pick up like hotline bling\nAnd I serve you that pint of lean\n\n[Verse 1]\nBrought the whole cartel with me, ooh!\nYou know I'm smokin' up now\nI got them drugs so pay that cut now\nI'm serving everybody, I don't give a fuck now\nEv-Ever since I hit the city, you\nYou know I got the gas now\nThe cops be on my ass now\nBut I can never back down\n\n[Chorus]\nYou used to call me on my trap phone\nLate night when you need my drugs\nCall me on my trap phone\nLate night when you need my drugs\nAnd I reply like hotline bling\nThat could only mean one thing\nI reply like hotline bling\nI serve you that pint of lean\n\n[Verse 2]\nBrought the whole cartel with me, ooh!\nYou know they got the white now\nI'm serving the people in the white house\nYeah we got that white now\nEver since I hit the city, you\nYou know I got the dope now\nI look like I be selling dope now\nMatter of fact I look like I be selling coke now!\n\n[Chorus]\nShe used to call me on my trap phone\nLate night when she needs my drugs\nShe would call me on my trap phone\nLate night when she needs my drugs\nAnd I reply like hotline bling\nThat cocaine got me a Gucci mink\nAnd I reply like hotline bling\nI'm serving niggas I don't even think\n\n[Verse 3]\nYou know how it go\nI've been serving on a road, baby\nI've been serving after shows, baby\nBut I don't got it for the low, baby\nI got the ecstasy to go, baby\nI got the molly at the show, baby\nShe sucked me up and then she throw up, baby\nShe smoked a dope and now she going, baby\n\n[Verse 4]\nJust because she hit me on my trap phone\nShe was on my trap phone\nI've been robbin' niggas all day, boy, I'm robbin' robbin' robbin' like a bad [?]\nNow what the fuck is you on\nYou ain't boomin' like my trap phone\nCause that bitch hit me on my trap phone\nYeah, that's your bitch callin' on my trap phone\n\n[Chorus]\nShe called me on my trap phone\nLate night when she need my drugs\nCall me on my trap phone (aye)\nLate night when she need my...\n\n[Outro]\nWoah woah\nAnd they used to always call me on my trap phone, you feel me", "image": "https://images.genius.com/5826c9317b9cb9ab271a4eebf055ffc4.600x600x1.png"}], "artist": "Juice WRLD"}