{"songs": [{"title": "Still In This Bitch (Remix)", "album": null, "year": null, "lyrics": "[Intro: Young Jeezy]\nMike Will on the beat you know I'm killin' this shit\nJust left the 'sace store you know I'm killin' this fit\nYeah we get the broke knob bro, ain't tryna to get fixed\nIt's the remix killer, yeah I'll kill ya remix\nWhassup!\n\n[Hook: B.o.B]\nI'm in my zone I'm feeling it\nStop blowing my buzz quit killing it\nSo buy another round; they tried to shut us down\nAbout an hour ago, but we still in this bitch\nWe still in this, we still in this bitch\nWe still in this, we still in this bitch\nTurn this shit up loud, and buy another round\nThey tried to shut us down about an hour ago, but we still in this bitch\n\n[Young Jeezy]\nI can do this shit all night cause I can stay up\nThat Rollie pull your bitch on sight, that's a lay up\nI blew about a 40 last night, that's a Jacob\nHad her face on my Givenchy jeans, left her makeup\nNigga I been running this for bout 8 straight summers\nI got mine off the stove like the chef at Benihana's\nNigga this is my year, fuck whoever don't like it\nSee that 2014 outside? Yeah that's my shit\nI took a trip out of town, brought a hundred things on\nI seen Jeezy in the club, he had a hundred chains on\nJust left the 'sace store, you know I'm killin this hit\nIt's the remix killer, yeah I'll kill ya remix\nWhassup!\n\n[Hook]\n\n[B.o.B]\nThey said, \"Bobby slow the flow down, you're burning all the dro down\"\nI tear the fucking club from the ceiling to the floor down\nAnd I ain't talking dancing when I tell them it's a hoedown\nAnd now she getting low down, that ass getting tore down\nCause we still in this bitch\nThere's a glass in my hand, I ain't spilling this shit\nI hop out the fucking coupe like it really ain't shit\nMan come to think about it, niggas really ain't shit\nI go tough, I go stupid\nAnd I get brawlin' baby, I beat that coochie\nNow go and throw them legs up, let's make a movie\nShe asked me can she get it from the back? Absolutely bitch, absolutely\n\n[Hook]\n\n[Young Dro]\nOk I'm still in this bitch, I'm killin this bitch, lame ass ho, ain't feeling that chick\nMan I'm like a big turd on the ground, and y'all are like flies come get on this shit\nI'm emptying gauges, hit 'em in faces, blow a nigga body in different places\nMan a nigga Young Dro still in this bitch, it's been a long time, that nigga courageous\nI'm raw, period, pussy nigga fearing it, calm down Dro, ain't goddamn hearing it\nNigga got caught well then I'm goddamn clearin' it up, nigga what's up? Feeling it?\nLayin' in the bed, getting head by Hilary, check my strap, check my artillery\nMe and B.o.B. and GDOD, rollin' up the wrong way feelin it\nTestatosa; burnin' these fuck niggas just like Sosa\nAnd I'll fuck your bitch on the sofa, in this bitch, please close the door sir\nI'm a lion boy I go rahh-rahh\nDesert Eagle clip up in this bitch and that thing go pow pow\n\n[Hook]\n\n[Yo Gotti]\nI'm Yo Gotti but I think I'm B.o.B., got bricks on bricks on C.O.D\nThat check's on deck, them cars on deck, that cocaine on delivery\nI'm in my kitchen I'm cooking it\nBitch want a plane ticket, I'm booking it\nCMG that muscle gang, TIP that Hustle Gang\nBrand dick all in what's her name, never gonna mention no buster name\nGot wordplay like that Rosa gang, make one phone call that get a bus of caine\nThat Forbes list, shoulda been on it, niggas talk beef but really don't want it\nI doubt it if you batted, I pull up and jump up out it\nBurn faith no mad dome, check your wise cracking\nLeft the tech to see exactly, lick the shells, try to count it\nLast seen in an Audi, turn a million for a bounty\n\n[Hook]   ", "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}