{"songs": [{"title": "Switch (The Science Project)", "album": "Fahrenheit 1/15 Part II: Revenge of the Nerds", "year": "2006-01-01", "lyrics": "[Intro (Spoken)]\nYeah, Revenge!\nNow what we gonna do right now, a-ha! uh\nIs gonna try a little experiment, just a little experiment\nYou know what I'm saying? A little \"science project\"\nYou know what I'm saying? I like to call it\n\n[Verse 1]\n(Switch!) You you you, yes let the words woo you\nTill you woozy, let the lyrics subdue you\nMassage and soothe you, move you, till conscience lose you\nLu now rules you, do what Lu do and you'll do beautiful\n(Switch!) I'm the meanest! You the meanest?\nI'm the meanest, and I mean this\nNow I don't mean this to sound fiendish\nBut I'm a genius, you a genius?\nAnd the cleanest, never seen this\nAs clean as my cleanest\nFrom on top, from underneath\nFrom behind, or in between us\n(Switch!) I'm a hustler, creeping with my hat low\nNiggas know I pack, so, what they gonna do that for?\nNiggas got my back, though, like answering the back door\nCatch you, I'ma slap you, leave you redder than the Batphone\n(Switch!) With a little bit of this and a little bit of that\nThat, mixed with a little bit of pimp and a little bit of mack\nAnd a little bit of limp, and a whole lotta gangsta lean\nI can't be seen, I ain't the King\nBut a nigga is strengthening to paint the scene\nAnd take the thing over like a soldier, colder than a polar\nGot the hood like a cobra, nigga thank the team (Switch!)\n\n[Hook]\nSwitch, nigga, this is how I got it\nI switch like hydraulic cars\nSwitch like DeBarge, nigga (Switch!)\n\n[Interlude (over Hook)]\nAight, now remember that\nThat's a, that was a part of the experiment\nI had to set it up, so, so, don't worry\nI know what you're thinking, I was thinking the same thing\nJust, just follow me, okay? Watch, okay? Come on now\n\n[Verse 2]\nMurder niggas, step on my shoes, I hurt a nigga\nKill a nigga, fill a nigga with holes, call women hoes\nHold up niggas, hold up hoes, break the calm, detonate bombs\nBlow up niggas, blow up hoes, turn around, smack they moms\n(Switch!) Heal niggas, educate and build niggas\nInstill in niggas, it’s real to respect women\nTreat 'em like they real, they feel, nigga, watch the words\nWatch Dr. Phil, nigga, chill, nigga, go learn a skill, nigga\n(Switch!) Rims, Mercedes Benz, twenties, twenty-twos\nTwenty-fours, rose gold, platinum watches, cases of Mo'\nGucci, rubies, mansions, models, VIP, Ferraris\nChinchillas, diamond rings, change, Range Rovers, bling bling\n(Switch!) Niggas bust his trains, pocket full of change\nDimes, quarters, taking orders, delivering pizzas\nAir conditionless, beaters, hand-me-down sneakers, silver\nWannabe models won't show me love and I can't get in the club\n(Switch!)\n\n[Interlude]\nHa, it's getting good right?\nYeah, aight, so check this out\nNow go back to the first one, aight? Run back to that one\nWe're going to have a little bit more fun with that one, aight?\nYou ready? Aight, come on\n\n[Verse 3]\n(Switch!) Hey hey hey, it's coming back to you\nLu no longer rules you, you can do what you do\nBack to your usual\n(Switch!) It's official, it's official, I'm official\nAs officials, got the stripes\nAnd the flags, and the whistles\n(Switch!)And watch my niggas come from the underground\nJust like Thriller, play Bambi and you gon' hear that Thumper sound\n(Switch!) They can't touch the sound that I'm busting now\nIt's like a cloud tryna touch the ground\nTough and bound, ever since we're touching down\nJealous niggas catch your feelings 'cause I'm hustling now, what?\n(Switch!) They be hating (Switch!) They be hating?\n(Switch!) What? What? What? They be hating\nDon't give them stage then\n(Switch!) What's a nigga s'posed to tell 'em\nWhen they up in my face then?\n(Switch!)That you got a cousin that don't mind catching cases\nBusting niggas' heads and slapping niggas' faces\n(Switch!)And he-a do it, he-a do it\nHe-a do it, and I'll prove it\n'Cause I done seen it, you done seen it?\nI done seen it, he the meanest\n(Switch!) Ho-ho-ho, wait, I mean it\nI thought you were the meanest\nSee? That's why this thing is fiendish, right now\n(Switch!)\n\n[Hook]\nSwitch, nigga, this is how I got it\nI switch like hydraulic cars\nSwitch like DeBarge, nigga (Switch!)\n\n[Outro: Lupe talking]\nYeah, experiment done\nI think that was a goody, I think that was a good experiment\nI think that was nice, it's a nice little science project\nHaha! Revenge!\nShoutouts to my homies at Asylum, what up? Yeah", "image": "https://images.genius.com/dbe43b56e43c0bf22c2ad2f2bce13dd0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}