{"songs": [{"title": "8 Mile: Lotto vs B-Rabbit", "album": "8 Mile (Battles, Cyphers & Freestyles)", "year": "2002-09-08", "lyrics": "[Lotto (Nashawn 'Ox' Breedlove)]\nYo, I'll spit a racial slur, honky, sue me\nThe shit is a horror flick, but the black guy doesn't die in this movie\nFuckin' with Lotto? Dawg, you gotta be kiddin'\nThat makes me believe you really don't have an interest in livin'\nYou think these niggas gon' feel the shit you say?\nI got a better chance joinin' the KKK\nOn some real shit though, I like you\nThat's why I didn't wanna have to be the one you commit suicide to\nFuck \"Lotto,\" call me your leader\nI feel bad that I gotta murder that dude from 'Leave It To Beaver'\nI used to like that show, now you got me in fight-back mode\nBut oh well, if you gotta go, then you gotta go\nI hate to do this, I would love for this shit to last\nSo I'll take pictures of my rear end so you won't forget my ass\nAnd all's well that ends okay\nSo I'll end this shit with a \"Fuck you\", but \"Have a nice day!\"\n\n[B-Rabbit (Eminem)]\nWard, I think you were a little hard on the Beaver\nSo was Eddie Haskell, Wally, and Ms Cleaver\nThis guy keeps screamin', he's paranoid\nQuick, someone get his ass another steroid!\n\"Blah-badi-boo-blah, bah-badi-bloo-blah!\"\nI ain't hear a word you said: \"Hippity hoopla!\"\nIs that a tank-top or a new bra?\nLook! Snoop Dogg just got a fuckin' boobjob\nDidn't you listen to the last round, meathead?\nPay attention, you're sayin' the same shit that he said\nMatter of fact, dawg, here's a pencil\nGo home, write some shit, make it suspenseful\nAnd don't come back until somethin' dope hits you\nFuck it, you can take the mic home with you\nLookin' like a cyclone hit you\nTank-top screamin', \"Lotto, I don't fit you!\"\nYou see how far the white jokes get you\nBoys like, \"How Vanilla Ice gon' diss you?\"\nMy motto: \"Fuck Lotto!\"\nI get the seven digits from your mother for a dollar tomorrow", "image": "https://images.genius.com/8b0796f6920cbb54e1b8f5f4622ed422.768x768x1.jpg"}], "artist": "Eminem"}