{"songs": [{"title": "Trouble", "album": "Stoned Raiders", "year": "2001-12-04", "lyrics": "[Verse 1: B-Real]\nIt's been awhile now, been around the block many miles\nMany faces, many places, that I found friends\nPlaces where I spend time, places where my mind roam\nPlaces I could call home, places I could get stoned\nI just wanna be alone when I'm feelin' in my zone\nPeople want to knock me down, 'cause they never have their own\nThey won't get the best of me, but they try hopelessly\nWhy you wanna fuck wit' me? I'm not, what you 'posed to be?\nUsed to not give a damn, coulda just killed a man\nSawed-off in my hand, but I had to kill the plan\nThink I've found my peace of mind, feet planted on the ground\nI just had to redefine, what I thought to myself\nIt all goes around me and others who would down me\nWho I don't give a fuck about, trouble always found me\nI know used to welcome it with my arms open wide\nTrouble's hand's on the door, but it can't come inside\n\n[Chorus: B Real + Sen]\nNOOOOOOOOOOOOOOOOO\nTROUBLE'S AT MY DOOOOOOOOOOR!\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\nNOOOOOOOOOOOOOOOOO\nTROUBLE'S AT MY DOOOOOOOOOOR!\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\n\n[Verse 2: Sen Dog]\nTrouble on the line, all the fuckin' time\nGot me contemplatin' the solution, the fusion my wicked mind\nGot suckers that hate me but it don't really matter\nI'm like a gat when I bust, niggas run and scatter\nMovin' in circles, throwin' elbows and fists\nYou got to be a real nigga in the Cypress Hill pit\nLike the critics talkin' shit, but I'm not concerned\nA hundred G's for sixty minutes is the bank I earn\nI try to put it to you bluntly so you bitches can learn\nThat nobody get tired when it's time to burn\nWith so many phonies out there lot of you have been fooled\nInto actually believin' that some shit is cool\nTake the blinders off and go look for yourself\nFuck hearin' about shit from somebody else\nI'm down for myself, I back up myself\nPut in all on the line make sure that I'm felt\n\n[Chorus: B Real + Sen]\nNOOOOOOOOOOOOOOOOO\nTROUBLE'S AT MY DOOOOOOOOOOR!\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\nNOOOOOOOOOOOOOOOOO\nTROUBLE'S AT MY DOOOOOOOOOOR!\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\n\n[B-Real] Nooooo!\n\n*scratching interlude*\n\n[Verse 3: B-Real]\nFelt the walls closin' in, and my shoe's wearin' thin\nHad to be the biggest clown, man you couldn't comprehend\nSome hated on my game, said I wouldn't be the same\nCalled me \"Rock Superstar\", \"Insane In The Brain\"\nBut I know I haven't changed, so I brush you to the side\nTrouble's knockin' on the door, anxious just to come inside\n'times I gotta block it out, no one likes to talk it out\nTrouble keeps comin' and I can't seem to lock it out\nGot my hands on the phone, I don't wanna have to talk\nIf you're feelin froggy, son, then I guess you gotta jump\nI can see it in your eyes, you don't seem to recognise\nI wouldn't fall into your trap, for many lives to compromise\nI'm not fallin' for your shit, you ain't gonna take me there\nYou can talk all you want, but I don't got your weight to bear\n\n[Chorus: B Real + Sen]\nNOOOOOOOOOOOOOOOOO\nTROUBLE'S AT MY DOOOOOOOOOOR!\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\nNOOOOOOOOOOOOOOOOO\nTROUBLE'S AT MY DOOOOOOOOOOR!\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\n\n[Outro: B-Real]\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?\nYou want trouble, c'mon, you want trouble?", "image": "https://images.genius.com/b0e5201adaaa026dce5a41c0cb1c6c5c.300x300x1.jpg"}], "artist": "Cypress Hill"}