{"songs": [{"title": "When I’m Gone", "album": "Curtain Call: The Hits", "year": "2005-12-06", "lyrics": "[Intro]\nYeah, it's my life\nIn my own words, I guess\n\n[Verse 1]\nHave you ever loved someone so much, you'd give an arm for?\nNot the expression, no, literally give an arm for\nWhen they know they're your heart and you know you were their armor\nAnd you will destroy anyone who would try to harm her\nBut what happens when karma turns right around to bite you?\nAnd everything you stand for turns on you to spite you?\nWhat happens when you become the main source of her pain?\n\"Daddy, look what I made!\" \"Dad's gotta go catch a plane\"\n\"Daddy, where's Mommy? I can't find Mommy, where is she?\"\n\"I don't know, go play, Hailie, baby, your daddy's busy\nDaddy's writin' a song, this song ain't gon' write itself\nI'll give you one underdog, then you gotta swing by yourself\"\nThen turn right around on that song and tell her you love her\nAnd put hands on her mother who's a spitting image of her\nThat's Slim Shady, yeah, baby, Slim Shady's crazy\nShady made me, but tonight Shady's rock-a-bye baby\n\n[Chorus]\nAnd when I'm gone, just carry on, don't mourn, rejoice\nEvery time you hear the sound of my voice, just know that\nI'm lookin' down on you smilin' and I didn't feel a thing\nSo, baby, don't feel no pain, just smile back\nAnd when I'm gone, just carry on, don't mourn, rejoice\nEvery time you hear the sound of my voice, just know that\nI'm lookin' down on you smilin' and I didn't feel a thing\nSo, baby, don't feel no pain, just smile back\n\n[Verse 2]\nI keep havin' this dream, I'm pushin' Hailie on the swing\nShe keeps screamin' she don't want me to sing\n\"You're makin' Mommy cry, why? Why is Mommy cryin'?\"\n\"Baby, Daddy ain't leavin' no more\" \"Daddy, you're lyin'!\nYou always say that, you always say this is the last time\nBut you ain't leavin' no more, Daddy, you're mine!\"\nShe's pilin' boxes in front of the door, tryna block it\n\"Daddy, please! Daddy, don't leave! Daddy, no, stop it!\"\nGoes in her pocket, pulls out a tiny necklace locket\nIt's got a picture, \"This'll keep you safe, Daddy, take it with ya!\"\nI look up, it's just me standin' in the mirror\nThese fuckin' walls must be talkin', 'cause man, I can hear 'em\nThey're sayin', \"You got one more chance to do right and it's tonight\nNow go out there and show 'em that you love 'em 'fore it's too late!\"\nAnd just as I go to walk out of my bedroom door\nIt turns to a stage, they're gone and this spotlight is on and I'm singin'\n\n[Chorus]\nAnd when I'm gone, just carry on, don't mourn, rejoice\nEvery time you hear the sound of my voice, just know that\nI'm lookin' down on you smilin' and I didn't feel a thing\nSo, baby, don't feel no pain, just smile back\nAnd when I'm gone, just carry on, don't mourn, rejoice\nEvery time you hear the sound of my voice, just know that\nI'm lookin' down on you smilin' and I didn't feel a thing\nSo, baby, don't feel no pain, just smile back\n\n[Verse 3]\nSixty-thousand people all jumpin' out their seat\nThe curtain closes, they're throwin' roses at my feet\nI take a bow, and thank you all for comin' out\nThey're screamin' so loud, I take one last look at the crowd\nI glance down, I don't believe what I'm seein'\n\"Daddy, it's me! Help Mommy, her wrists are bleedin'!\"\nBut baby, we're in Sweden, how did you get to Sweden?\n\"I followed you, Daddy, you told me that you weren't leavin'\nYou lied to me, Dad, and now you made Mommy sad\nAnd I bought you this coin, it says 'Number One Dad'\nThat's all I wanted, I just wanna give you this coin\nI get the point, fine, me and Mommy are goin'.\"\nBut baby, wait! – \"It's too late, Dad, you made the choice\nNow go up there and show 'em that you love 'em more than us\nThat's what they want, they want you, Marshall, they keep\nScreamin' your name, it's no wonder you can't go to sleep\nJust take another pill, yeah, I bet you you will\nYou rap about it, yeah, word, k-keep it real.\"\nI hear applause, all this time I couldn't see\nHow could it be that the curtain is closin' on me?\nI turn around, find a gun on the ground, cock it\nPut it to my brain, scream, \"Die, Shady!\" and pop it\nThe sky darkens, my life flashes, the plane that I was\nSupposed to be on crashes and burns to ashes\nThat's when I wake up, alarm clock's ringin', there's birds singin'\nIt's spring and Hailie's outside swingin'\nI walk right up to Kim and kiss her, tell her I miss her\nHailie just smiles, and winks at her little sister, almost as if to say\n\n[Chorus]\nAnd when I'm gone, just carry on, don't mourn, rejoice\nEvery time you hear the sound of my voice, just know that\nI'm lookin' down on you smilin' and I didn't feel a thing\nSo, baby, don't feel no pain, just smile back\nAnd when I'm gone, just carry on, don't mourn, rejoice\nEvery time you hear the sound of my voice, just know that\nI'm lookin' down on you smilin' and I didn't feel a thing\nSo, baby, don't feel no pain, just smile back\n\n*Curtains closing*", "image": "https://images.genius.com/0f31b12579405430b96dc8b2543c8624.1000x1000x1.png"}], "artist": "Eminem"}