{"songs": [{"title": "Kilo", "album": "Fishscale", "year": "2006-03-28", "lyrics": "[Intro: Ghostface Killah]\n(Yo, Oh, Yo Rae... I can't feel my face\nMy heart pounding and shit (audible heart)\nParanoid as a motherfucker right now, who the fuck?\nClose them blinds and shit! Who that? Captain Kirk?\nThis the fucking Stark...enterprise, enterprise outside and some shit?\nI need some pussy though I'm ready to fuck Catwoman or something\nF-fuck it, lets go!\nAiyyo shareefa go to the store for me. I need some razors and a fresh box\nOf baggies, the ones with the tint in them!\nAiyyo son turn that water down a little bit, just a little bit..Thank You\nI need two waters, a dutch, and a cranberry Snapple)\n\n[Hook]\nAll around the world today, the Kilo is the measure\n(Whoever got the kilos got the candy, man!)\nA kilo is one thousand grams, its easy to remember\n(You never catch the kid going hand to hand!)\nAll around the world today, the Kilo is the measure\n(Once you got the funds you got the panties, man!)\nA Kilo is a thousand grams, its easy to remember\n(Throughout I-95 I'm the Handyman)\n\n[Verse 1: Ghostface Killah]\nBricks, Tar caps, powder, cooked up crack\nPhones is tapped over franklin's stacks\nKingpins put in bullpens, old connects get paro'\nBreak out of town when the Jakes take down the Pharoah\nReason, He was moving that peruvian white\nBlowing coolies in the hoopties , slamming cuties at night\nBig heavy pots over hot stoves\nMayonnaise jars of water with rocks in them got my whole projects out of order\nA Kilo is a thousand grams\nBeige, gold, brown, dirty, fluffy, tan, extract oil cut from cuban plants\nThe chemist is brolic, pyrex scholars\nProfessors at war over raw, killing partners for a million dollars\n\n[Hook]\nAll around the world today, the Kilo is the measure\n(Whoever got the kilos got the candy, man!)\nA kilo is one thousand grams, its easy to remember\n(You never catch the kid going hand to hand!)\nAll around the world today, the Kilo is the measure\n(Once you got the funds you got the panties, man!)\nA Kilo is a thousand grams, its easy to remember\n(Throughout I-95 I'm the Handyman)\n\n[Verse 2: Raekwon]\nYeah\nAiyyo peace to those cooking that raw, powder white\nGet your sniff on, scarface niggas, we getting right\nSome call it bricks, some call it birds\nHow many niggas get they lives tooken playing with shit, then catch a curve\nYou would go to jail\nGet caught with this, niggas'll grow to fail\nStop playing, pot slaying, baking soda and scales\nThey lived like brothers, word life, connects discovered\nMost niggas get hard, from fucking with them pipes and hustlers\nKilo is one thousand grams\nYou know your ammo better be heavy cause soon kids is coming in camo\nProtect your land daddy, I'm an announcer\nYou get caught with an ounce and its over\nMatter 'fact they takin you down, son\n\n[Hook]\nAll around the world today, the Kilo is the measure\n(Whoever got the kilos got the candy, man!)\nA kilo is one thousand grams, its easy to remember\n(You never catch the kid going hand to hand!)\nAll around the world today, the Kilo is the measure\n(Once you got the funds you got the panties, man!)\nA Kilo is a thousand grams, its easy to remember\n(Throughout I-95 I'm the Handyman)\n\n[Verse 3: Ghostface Killah]\nSome say a drug dealers destiny is reachin the ki'\nI'd rather be the man behind the door, supplying the streets\nA hundred birds go out, looking like textbooks\nWhen they wrapped and stuffed\nFour days later straight cash, two million bucks\nStrictly powder, no cut\nYour coke is vialed in, whats up?\nY'all beefin over little shit, we sniff, the balance split up\nIn a plane or a penthouse, office or a warehouse\nTony's got it nice, we never heard of any big droughts\nKilo is a thousand grams\nA pile of sand is equivilant, to the eye\nIt's nice to have a thousand fans\nCoke buyers, some be liars\nTherefore, you check for wires\nDedicated dealers, during holidays we give 'em lighters\n\n[Bridge: Raekwon]\nRed tops, blue tops, green tops, yellow tops\nPurple tops, beige tops, white tops, grey tops\nBlack tops, clear tops, gold tops, pink tops\nSilver tops, tan tops, aqua tops, orange tops\nSalt tops, long tops, short tops, 12 12's\n58 58's, weed bags, ziplocks\nBig rocks, coke spots, two Glocks, one ox\nCrumbs chopped, hot pots, one plate, crack Spot\n\n[Hook]\nAll around the world today, the Kilo is the measure\n(Whoever got the kilos got the candy, man!)\nA kilo is one thousand grams, its easy to remember\n(You never catch the kid going hand to hand!)\nAll around the world today, the Kilo is the measure\n(Once you got the funds you got the panties, man!)\nA Kilo is a thousand grams, its easy to remember\n(Throughout I-95 I'm the Handyman)", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}