{"songs": [{"title": "TIPTOE", "album": null, "year": "2018-07-26", "lyrics": "[Intro]\nNiggas is just rapping 'cause like\nWhy not?\nGolf boys, ayo\n\n[Chorus]\nI tip-tip-tip-tip toe in this bitch\nEverybody got opinions, everybody got tips\nTell them Twitter finger niggas they can cancel my dick, hmm\nI tip-tip-tip-tip toe in this hoe\nSomebody tell the devil that I'm knocking at the door\n\n[Verse 1]\nAyo, ayo\nIn my mansion, niggas salsa dancing nigga\nSmiling on me face, I'm so handsome nigga\nI was edgy, nigga, now its Fetti\nI get my backyard, oh that's the Getty\nNigga I, was in the garden couldn't fathom\nIt was snakes in the grass but I couldn't grab 'em\nFocus on the Eve, nah focus on the green\nIn the trees with binoculars, looking for an Adam\nLemme tell ya, I got dreams to sell ya\nCause y'all reek of backwoods and some future failures\nWe was working deals, out finalizing hurdles\nY'all was out in Paris dick riding Virgil\nHope them Insta photos keep you cool in coach\nClout yeah, oh, you out here?\nOh, you network, where your self-worth?\nNigga dick ride 'til your neck hurt\nNigga we ok, boy better know BBK\nYou want war then I'm G.I. Joe\nYou get cooked nigga B-B-Q\nI Diplo then go MIA\nThen skate off like a T.I. role\nNiggas pretend to be bosses\nYou signed a 360, you lost it\nThat's 400 for my exhaust, the mean with the walk\nNow tell the Black Youth, to just be\nTell them never stop\nYeah we all moving, but you ain't gotta put us in a box\nWe can paint, we can draw, whatever\nWe can Lady Bird, we can Baby Boy\nWhatever movie setting you choose\nJust, just try to do better\nAnd don't let them stretch you too thin, new leather\n\n[Bridge]\nI tip-tip-tip-tip toe in this bitch\nI tip-tip-tip-tip toe run it (run it, run it, run it)\n\n[Verse 2]\n666 when we bag em, hmm\nY'all don't even know about the madam, hmm\nY'all can get the packet with the atom, boom\nSummer just got a lil heater, yeah\nFlower Boy gold no gimmicks, I joke\nAnd I ain't have to fuck a Akademiks to post\nNo radio play like once or so\nY'all swear y'all got the keys\nI play piano, stop\nNigga, I'm the ammo in the Glock\nChurch pants, sandals with the socks\nYou niggas done, you better get the mop\nNo violence, curly hair bounded at the top\nNo violence, ayo\nIncredible with commas I, make ya stretch like Violet's mama, ay\nI go Dash and handmade ones the, neck Frozone like papa's partner, say\nIncredible with commas I, make ya stretch like Violet mama in\nI go Dash and handmade ones the, neck Frozone like papa's partner, nigga\n\n[Outro]\nRunnin' in that bitch\nAt the bottom of the bitch\nHad the doubles in the bitch\nDouble O, double O, double T\nI was in a meeting, fucking with me\nI ain't say nothing this off top of the dome\nShoutout Carti", "image": "https://images.genius.com/97b8f45a0b686cf56093f67f79631fca.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}