{"songs": [{"title": "Heaven Or Hell", "album": "Dreamchasers 3", "year": "2013-09-29", "lyrics": "[Intro: DJ Drama]\nAyo, this the one? We all get caught in our own sins. Sometimes I have to remind myself, that on my worst day, I live like somebody on their greatest—and so do you. Don't let your demons take you to Hell. Introduce 'em to Heaven!\n\n[Hook: Gourdan Banks]\nSome niggas go to college, some niggas go to jail\nSome make it into Heaven, some make it into Hell\nNobody wanna lose, nobody wanna fail\nNobody wanna die, nobody wanna kill\nThe things we do just to make it through\nBut nobody wanna lose, nobody wanna fail\nNobody wanna die, we're just tryna live our life\n\n[Verse 1: Meek Mill]\nLook, I got homies in the ground, skeleton and bones\nAnd niggas doin' life, they ain't never comin' home\nThey said I wouldn't make it or never see the throne\nAnd my baby mama hate me ‘cause she said I did her wrong\n‘Cause I left, to chase my dream, get it any means\nI said that I'll be back, she wasn't listenin' to me\nThat back-and-forth arguin' was gettin' in between\nI said fuck them other niggas, I go get it with my team\nIf we all grind, we all shine, fuck a part time\nI used to play the block early mornin' and dark time\nNow it's G5 flights, fuck a depart time\nIt was hard times, nigga, now it's our time\nJust take a look at my life, rappin' brought me back to life\n‘Cause I was in them streets, my heart was cold as a pack of ice\nEvery night we strappin' like we was in Iraq to fight\n‘Cause niggas gettin' murdered for a block that do a stack a night\nWhoa, I got to make it home to my son\nOn them papers with a firm hold on his gun\nBefore I snitch they gotta burn a hole in my tongue\nGive me a hundred years in a hole on the sun\nIn boilin' water, in the world of no order\nIn the hood, ain't no loyalty, ain't no world for your daughter\nAin't no life for your brother, on the life of my mother\nI'ma get the fam right, nigga, you damn right!\n\n[Hook: Gourdan Banks]\nSome niggas go to college, some niggas go to jail\nSome make it into Heaven, some make it into Hell\nNobody wanna lose, nobody wanna fail\nNobody wanna die, nobody wanna kill\nThe things we do just to make it through\nBut nobody wanna lose, nobody wanna fail\nNobody wanna die, we're just tryna live our life\n\n[Verse 2: Jadakiss]\nYeah, I used to pop a lot of shit, now I keep it moderate\nThese niggas know I been iced out, hoppin' outta shit\nRight now I'm prayin' for my son to get this scholarship\nA nice university, one of these black colleges\nFar as the hood go, I acknowledge it\nBut whoever ain't a snake's usually a follower\nLuckily, I can tell the difference\nMy man comin' home, my other man gettin' sentenced\nSoft niggas usually send the hate through the bitches\nJealous Instagram niggas hatin' on your pictures\nWe dream-chasin', y'all niggas walkin' behind wishes\nWithout workin' for it, not often you find riches\nSome niggas find coffins, others just find ditches\nJust ask around 'bout the militia, they malicious\nD-block, finish that and cop more dope\nI'm two-stroke, you four-stroke\nIf you got enough cigars we can all smoke\nAin't nothin' all good when you all broke\nSo we could never be equal\nNever bite the hand that'll feed you\nNever fear a man if he bleed too\nSome niggas need a headshot, some niggas need two\nPlay sweet in these streets and they'll leave you\nYou can't see the Devil, he's see-through\n\n[Hook: Gourdan Banks]\nSome niggas go to college, some niggas go to jail\nSome make it into Heaven, some make it into Hell\nNobody wanna lose, nobody wanna fail\nNobody wanna die, nobody wanna kill\nThe things we do just to make it through\nBut nobody wanna lose, nobody wanna fail\nNobody wanna die, we're just tryna live our life", "image": "https://images.genius.com/9f7555483900d17e5492cc73d0fff0df.600x590x1.png"}], "artist": "Meek Mill"}