{"songs": [{"title": "Sunshine (2007)", "album": "Playtime is Over", "year": "2007-07-05", "lyrics": "[Verse 1: Nicki Minaj]\nYo... yo, yo yo yo, hold the doe\nLet me get up on the floor like Mardi Gras\nLike every time I rhyme I sun the shine\nLil mama, you a bird like you done some time\nEvery, every time I spit it's a massacre\nSo they better more fast like Nascar\nEveryone want a dime, I'm, I'm the best\nWhen I get up in the club I grind the best\nYou don't know, you better respect me\n[I'm with a tryfit, affidicuous Nicki]?\nI am the one, like Tracy McGrady\nNow little daddy let me, let me upgrade ya\nCome on, I make it hot, see I'm a hot one\nI keep the stack & let Max play the shotgun\nI'm in the good car, always with a hood star\nIntroducing Mr. & Mrs. Good Bar\n\n[Hook:]\nGet up on my level niggas, get it up\nGettin Dirty Money figures, throw it up\nGet up on my level bitches, get it up\nDrink some Dirty Money bitches, get a cup\nX2\n\n[Verse 2: Gravy]\nIt's frego daddy, grade V of coarse\nGod Willing coming soon, I'm the good of New York\nI shine like VVS stones in the dark\nTake a seat, when you here me like Rosa Parks\nFuck the chit chat\nLet's talk guns & drugs, you with that?\nTryin' to see a mill or two, fuck who I'm better than\nRollin up on a dutch, you know I need my medicine\nIt's high noon & I'm the nigga that shot the sheriff\nMe & Nicki's like Bonnie & Clyde, don't be embarrassed\nI'm sort of like a rabbit the way I love my cabbage\nBut I Still watch for 5-0 like I'm Garret\n08′ Challenger lookin' like Dukes of Hazzard\nTurn it into a coupe, and now the roofs gone\nWord to Nicki Minaj with daisy dukes on\nSee it's Max-a-millie-on, chumps so move on\nBefore I act like a auto-bot and transform\nToo Hot & I ain't Mims\nI flip bricks while you little clown still buyin' rims\nWho's in charge, stop frontin' like I ain't him\nI'm Saks Fifth Ave, you still shop at Fims\nSuperstar with the Audemar and a pair of Tims\nWho your wives screwing? Flossin', I been doin'\nFuckers\n\n[Hook x2]", "image": "https://images.genius.com/b256017f3b831150266cf5131d761bfe.600x599x1.jpg"}], "artist": "Nicki Minaj"}