{"songs": [{"title": "The Moment I Feared", "album": "The Great Adventures of Slick Rick", "year": null, "lyrics": "[Verse 1]\nWell I'm sittin on my lunch break, grinnin my teeth (my teeth)\nIt's the last day of the week, boy what a relief (relief)\nMy muscles kind of ache, they felt rigid and stiff\nSo I looked around, and I smoked this big fat spliff\nNow I'm happy as can be I'm in this pothead spell\nI put some Visine in my eyes so that no one can tell\nIt's 12:55 almost time for the bell\nPut the breathmints in the mouth so that the mouth don't smell\nNow back on the job, I don't bother no one\nI keep strictly to myself and all my work gets done\nNow the job's finally over it's time to have fun\nAnd I'm hangin out with Trevor there's a kid named John\nGot real drunker than a skunk and happy as can be\nWe went, to the Latin Quarters and we got in free\nScoopin all the girls like nuttin with my truck jewelry\nCause I'mma fly brown brother and you can't school me\nBoogie Down was performin hey they ain't no joke\nAnd a bunch of Brooklyn kids was lookin all down my throat\nWas it my big chains with the big plates on em?\nThen they rolled on me and told me to run em\n\n[Hook]\nThis was the moment I feared...\n\"Hey yo homeboy take off your chains man\nBout to hurt you real fuckin bad, I'm gonna fuck you up\"\nThis was the moment I feared...\n\"Yo what's the matter stupid? Take the shits off man!\nThe fuck is up?\"\n\n[Verse 2]\nI said, \"They're really not real, they're just a front for the girls\"\nThen a whole bunch of furious fists caved my world\nI was in pain, so ashamed, I wish I had not came\nHad to kindly pick up my face and then ride home on the train, then\nI went to an open store that's where I bought me a quart\nThen I went to the park, and I sat and I thought\nI seen Danny Boy though he's with his girl named Sarah\nIn one of his cars, I think this one's a Riviera\nShe calls out to me, but, I really couldn't hear her\nSo I went just a little bit closer so I'd hear a little clearer\nShe said, \"I need Veronica Place that's right near Tilden\"\nI said, \"I know where that's at cause that's right next to my building\"\nI gave em the information and they went on their way\nI went home, and there I slept til almost three the next day\nThen someone knocked on my door, I opened up, no quit!\nIt was Sarah with some magazines and a band-aid kit\nShe tried to use me and seduce me and at first I wasn't with it\nThen we did it and we did it and we did it and WE DID IT\nShe said it was great, she said she's glad we had done it\nThe elevator came and Danny Boy was on it\n\n[Hook]\nThis was the moment I feared...\n\"Hey yo what the fuck's goin on here?\nWhat you doin to my girl homeboy?\"\nThis was the moment I feared...\n\"Oh I just KNOW y'all didn't just finish fuckin\nI just KNOW y'all ain't just finish fuckin\"\n\n[Verse 3]\nWell he was huffin and puffin and he swung at me -- word\nSo I pulled out my jammy and I silenced the nerd\nThen he was dead two in the head I took the cash and the Visa's\nShe said, \"Don't worry about a thing just make sure nobody sees us\"\nWe went back to her apartment, there was blow in the freezers\nShe said, \"We're rich we're rich we can have whatever will please us\"\nNow I don't hang with no one who ain't good for my health\nSo I put the sugarhead out and I went for self\nNow I was rich as I was rich I could have whatever would please me\nNow I could wear real gold in front of folks that would tease me\nYah me, I'll be a new neighborhood dad\nCats'll roll up on me screamin, \"Yo Rick my man!!\"\nI guess I was too fly word up I'm sorry to say\nYa see a cop rolled up on me and told me, \"Make my day\"\nI said, \"Relax brother,\" but he had proof that I had done it\nYep, he had poor Sarah's underwear with my fingerprints all on it\nThis was the rise and fall of my fast lane style\nAnd I was the main event on the TV for a while\nBut now I'm in jail doin life and I'm scared\nSome kids snuffed me cold and greased me where no one dared\n\n[Hook]\nThis was the moment I feared...\n\"Turn around nigga (HAHAHAHA)\nSpread your cheeks\"\nThis was the moment I feared...\n\"UHH, AOWWHWHWAA! STOP STOP! AHAOWWHAHAOOHO\"", "image": "https://images.genius.com/09b48445ade4e1b5e75781bcfa6eb3c6.924x924x1.jpg"}], "artist": "Slick Rick"}