{"songs": [{"title": "Promiseland", "album": "All 6's and 7's", "year": "2011-06-11", "lyrics": "[Intro]\nTurn me up a little bit Ben\nSo I'm just 'bout to spit some shit real quick\nIt's the last song\n'Cause I ain't got to the Promiseland, baby\nLet's go!\n\n[Verse 1]\nI remember when my soul, hoes and dough was missin'\nWhen I went to all the shows, yo my bros are bitchin'\nNever meant to blow my goal so it's motor spittin'\nAnd when I enter all of my flows I'm so in pole position\nI promised to be the best to mom\nGet us through, get up at the dawn\nLet Tech spew, flip it like an omelette\nEver since the calm bet you Tech ain't made you yawn yet\nI sign checks in my pocket are the color upon Shrek\nThe industry never passed the baton guess I grabbed it\nIf it's beyond us even so I get the gauntlet\nThis music shit was enough to make me vomit\nBut I kept you all astonished, make way for the KC comet\nNow I'm winnin', I'm more sarcastic than Vince Vaughn yeah\nHonestly when I walk in I come off like bomb threats\n'Cause them no want Tech to go straight 'nam vet\nThrow on jets and get all the way to this land that was promised\n\n[Hook: Nikkiya]\nLook at me, what you see? Livin' life in luxury\nRolling down this road doing this thing\nThis is the Promiseland (this is the Promiseland)\nThis is the Promiseland (this is the Promiseland)\nWhat you people fail to see was me walking through desert heat\nThrough storm and rains with demons chasing me\nTo this promised land\nTo this promised land\n\n[Verse 2]\nWould you let me kiss 'em?\nCouldn't defeat me none\nWe started beastin' 'em\nSellin' records, millin' seconds\nLook at us teachin' 'em, yellin' Tech is hell and methods\nRippin' and reachin' 'em, felon jeffers tellin' heffers\nI ain't got no income but I got dough and then some\nIn come some friends, they wanna attend hundreds send 'em\nKnockin' 'em out, my chain go side to side just like a pendulum\nI'm in to one but the other is impatient waitin' for the sin to come\nThis is what goes on now that I'm in their light\nNow they know that I get my flows on they comin' out in their tights\nBeen chasin this for so long, never has been fair fights\nLookin' for them rare sights, it's in there right?\nIn the land where everything is yours\nNot fictitious like the boars, all delicious like a s'more\nI'm be walking through the doors they often to the stores\nGot me bossin', doin' more for the Promiseland I'm you and yours, Nina\n\n[Hook: Nikkiya]\nLook at me, what you see? Livin' life in luxury\nRolling down this road doing this thing\nThis is the Promiseland (this is the Promiseland)\nThis is the Promiseland (this is the Promiseland)\nWhat you people fail to see was me walking through desert heat\nThrough storm and rains with demons chasing me\nTo this promised land (Promiseland)\nTo this promised land (this is the Promiseland)\n\n[Verse 3]\nIs this it? Is this what it's all about man?\nEating, drinking, fucking, sucking, snorting? Come on man\nMeeting, feeling, touching, we on dames\nKilling, busting, really loving us 'cause we all strange\nHa ha ha ha ha I like it\nThe Promiseland is real simply because I write it\nDon't stare too long and envy 'cause you might get iritis\nNow to get me for shows and lyrics it's high prices\nIn Promiseland I'm gonna stand an honest man\nThis honor gets the drama yes the llama can\nBring disaster on rappers like water on Japan\nHe got his chance and Tech puts it all on his fans\n\n[Hook: Nikkiya]\nLook at me, what you see? Livin' life in luxury\nRolling down this road doing this thing\nThis is the Promiseland (this is the Promiseland)\nThis is the Promiseland (this is the Promiseland)\nWhat you people fail to see was me walking through desert heat\nThrough storm and rains with demons chasing me\nTo this promised land (this is the Promiseland)\nTo this promised land (this is the Promiseland)\n\n[Outro]\nStrange Music, baby\nIt's what we been waitin' on\nFor everybody to recognize the real shit\nIt's all happening, baby\nWe just gon' ride out to this, I love this beat\nYeah, we in the Promiseland, baby", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}