{"songs": [{"title": "Return Of Simba", "album": null, "year": "2011-05-23", "lyrics": "[Intro: Simba & Dad]\nOne day, Simba, the sun will set on my time here, and will rise upon you as the new king\nAnd this will all be mine?\nEVERYTHING\nEverything the light touches\n\n[Intro]\nIn my freshest J's, I ain’t slept in days\nGirl, you gonna make me late undressing me\nKnow you ain’t seen me since yesterday\nBut, see, I got a date with destiny\nCause this the summer that our life change\nHov asked me, “Is you ready for it?”\nI looked around at all his nice things\nTold him, “Nigga, you already know it”\n\nBitch, I’m the man of the year\nYeah, yeah, yeah\nStraight through this bitch\nBitch, I’m the man of the year\n\n[Verse]\nWhat you ‘sposed to do when the OG niggas don’t get it?\nLost what was once theirs but they won’t quit it\nHomie, it’s a new era, middle finger to the suit-wearers\nLemme show you how to move in a room\nFull of dudes that don’t got a fuckin’ clue how to do this\nProlly worked with Cube, so to them, this a Rubik\nMy President is black, but my jeweler’s still Jewish\nSo you know it cost, he makin’ a killing off me\nRed diamonds he designing got me shining\nSpotlight cover my body, my chain blinding\nA cop light runner, they wanna but can’t find him\nMe and Hovi Hov, out on the same island\nTook the whip to the other side of Jamaica\nSeen how he was living, said “I gotta get my weight up”\nFormulated my plan, motivated by dreams\nParlayed with my mans, motivated my team\nCed said, “Look, my niggas, we got a foot in”\nBeing good is good, that’ll get you Drew Gooden\nBut me, I want Jordan numbers, LeBron footin’\nCan’t guard me, Vince Lombardi, John Wooden\nGarbage? Hardly, you niggas silly like Chris Farley\nSo like him, you’ll be gone too early\nMama hands together like 6:30\nAnd Cole keep a thick bitch I like to call Big Shirley\nAll my ’90s niggas is gon’ get it\n18 and under, that’s prolly gonna take a minute\nI’mma be here for a while, none of these clowns can hurt me\nI’mma be here for a while, none of these clowns can hurt me\nAt the time of this rhyme, 5 years ’til I know 30\nCole World in the summer brings snow flurries\nThis next shit is in no way to boast\nBut my city love breakfast, ’cause niggas had toast early\nCoach had us doin’ jumpin’ jacks\nThen sent us to the water fountain after runnin’ laps\nMy nigga went and grabbed his bookbag, threw it on his back\nAnd brought it to me just to show me he was fuckin’ strapped\nWe was twelve years old, how was we to know better?\nI analyzed his life and see that he was so set up\nLive by the trigger, ’cause no father figure\nMeans you don’t got a nigga comin’ ’round to guide a nigga\nAll you got is mama bringin’ home these rotten niggas\nBlowin’ reefers, all the teachers do is ride a nigga\nSo this is who I speak fo’\nTo give the young niggas somethin’ they could reach fo’\nYou better dream, boy\nYeah, I stunt, but I’m a li’l more realer\nWhen it come from the heart, don’t it feel mo’ iller?\nWatch my flow go bananas, I’m a li’l gorilla\nSo pardon me, man, y’all gon’ have to pardon me\nThey say I rep that ‘Ville too much, but that shit just a part of me\nIt’s flowin’ out through my arteries, who hard as me? You JV, I’m varsity\nNo field trip, ain’t hard to see, this real shit, you R&B\nSeen a movie wit’ yo’ bitch in it, and listen it, was starin’ me\n(Woo!) That boy Simba crazy\nHotter than Ike Turner temper, you December, maybe\nAnd though you wish me well, I know deep down you wish I’d fail\nIt’s Judgment Day, I’m here to give you pussy niggas hell\nAnd some food for thought, I can serve a plate\nWith dessert to take, with dessert to take\nYeah, I heard the hate, but the wait is fuckin’ over\nIt’s like I’m fuckin’ Oprah, well worth the wait\nMaybe over your head, I’m ahead of my time\nNiggas scared of my future, I know they dreadin’ my prime\nCause I only made classics, now what that take? Timing\nCole under pressure, what that make? Diamonds", "image": "https://i.genius.com/1261d764f6822afc0e2d358f1eccb66943221708?url=https%3A%2F%2Fi1.sndcdn.com%2Fartworks-000007536893-sgifql-t500x500.jpg"}], "artist": "J. Cole"}