{"songs": [{"title": "We Miss You", "album": "Back on My B.S.", "year": null, "lyrics": "{*harmonized ad libbing for 12 seconds*}\n\n[Hook: DeMarco & Jelly Roll]\nThe way I rep the street and how a nigga killin every single second\nThey say I'm doin too muuuuuuuch\nI try to step back just a little just to give niggas a chance\nBut as you've seen they really couldn't do muuuuuuuch\nEven when I'm layin low I put it down for every city and every borough\nI love to put the hood uuuuuuup\nI disappear just for a minute and it's funny when the same people say\nWe hate the fact that you gone - SO NOW THE HOOD BE SAYIN!!\nAhhh-ahhh-ahhh-ahhh, we miss you, oh and we love what you doin sayin {*3X*}\nAhhh-ahhh-ahhh-ahhh, we miss youuuuu, ahh-ahh-ahh\n\n[Busta Rhymes]\nJack, lemme, lemme show you niggas progress\nLayin the law like I'm the head of Congress\nJewelry layin like a baby on they mom's breast\nGUESS WHAT~?! I'm 'bout to drop another bomb - YES!! YES!!\nBack with the crack, fiends get in line\nFeds patrollin the strip, see it's election time\nMr. Rhymes thirsty to lock up every town bagged\nMoney heavy like we carryin babies in them brown bags\nLike my brown Louis luggage, I'm in a brown suit\nA rare Louis collection, pushin a brown Coupe\nPaint job sick like a bitch leakin out brown douche\nHundred EX Phantom, suck in the brown pew\nBanned, cigar man now look around you\nPeople gather like they done finally found the truth\nEvery word so compellin; I'm burnin down the booth\nNow if you niggas need proof LISTEN!!\n\n[Hook]\n\n[Busta Rhymes]\nCheck - all rise, niggas get it straight (ha)\nI rep the hood, rain hail snow and earthquake (ha)\nI'm past rattlin buildings, I make the earth shake (OH!)\nAnd make the hood wanna rebel and start to hurt Jake (Jake)\nLike how the pavement lay on every street\nI turn savage and grow fangs when I'm on every beat\nThere's never been any problem! We harbor heavy heat\nYou niggas know that he got 'em, so listen when he speak\nGo 'head niggas! Peep how I'm rollin up my sleeves on 'em\nBoa constrictor flow I'm 'bout to put the squeeze on 'em\nMy money speak a different language, Lebonese on 'em\nAnd turn it up another two thousand degrees on 'em\nGET 'EM~! I dress bummy in Bugati, stupid\nAnd drown cities when I give you that tsunami music\nAnd watch my HOOD niggas spaz, peep the way I do it\nLong as you know who be the greatest DON'T CONFUSE IT\n\n[Hook]\n\n[Outro]\nYah!! Busta Rhymes, come fi take over\nYah!! Watch you dance, or you a lead\nYah!! C'mon go... yah!! Aight... {*fades*}", "image": "https://images.genius.com/39d2d4f1bba15212af6b346af49c7ff2.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}