{"songs": [{"title": "Your Life’s on the Line", "album": "Power of the Dollar", "year": "2000-10-12", "lyrics": "[Intro]\nNobody likes me\nNobody likes me, but that's okay\n'Cause I don't like y'all anyway\nMan, I don't like y'all anyway\nFuck all y'all!\nI let my watch talk for me, my whip talk for me\nMy gat talk for me, BOW! What up, homie?\nThem bitches who don't know me, they wanna blow me\n'Cause the shit I floss with be saying a lot for me\n\n[Verse 1]\nI came in the rap humble, I don't give a fuck now\nI'll serve anybody like niggas who hustle uptown (Uh-huh, uh-huh)\nCoke price go up, capsules come down\nThe Ds run in my crib, I'm nowhere to be found\nNiggas who hustle for me, they don't even stash tracs\nThey keep it on 'em, right there in they ass crack (Yeah!)\nWhen I don't like a nigga, I don't pretend to\nI'll have the paramedics wrapping your fucking head like a Hindu\nLook, I ain't going nowhere so get used to me\nOG's look at me and see I'm what they used to be\nI'm that nigga that sold coke, the nigga that sold dope\nThe nigga that shot dice, went broke, and sold soap\nThe thug that pop shit, the thug that pop clips\nThe thug that went from three and a half to a whole brick\nNigga ain't in his right mind going against me\nMy pictures painted through words, I make a blind man see (Woo!)\n\n[Hook]\nScream murda, I don't believe you\nMurda, fuck around and leave you\nMurda, I don't believe you\nMurda, murda, your life's on the line\n\n[Bridge]\nY'all niggas don't want no part of me\nYou tryna figure out how y'all started me\nYou gon' make me catch you on a late night\nPop shots with the fifth and slide off in the six\n\n[Verse 2]\nI'm not a marksman while sparking, so I spray random\nNot a pretty nigga, but my moms think I'm handsome\nI hate to hear \"he say, she say\" shit\nUnless he say she said she on my dick\nIt's no coincidence, niggas who fuck with me get shot up (Blat!)\nDo it Cali style, drive by and tear ya block up\nYou soft, duke, you putting up a crazy front\nI stay with the Mac cause niggas tried to blaze me once\nIn the hood, they like, \"Damn, 50 really spit it on 'em\"\n\"You heard that shit?\" \"Yeah, 50 really shitted on 'em\"\nBeef, you don't want none, so don't start none\nYou're just a small player in this game, play your part, son\n\n[Hook]\nScream murda, I don't believe you\nMurda, fuck around and leave you\nMurda, I don't believe you\nMurda, murda, your life's on the line\n\n[Verse 3]\nThese cats always escape reality when they rhyme (Uh-huh, uh-huh)\nThat's why they write about bricks and only dealt with dimes (Yeah!)\nLeave it to them, and they say they got a fast car\nNASCAR, truck with a crash bar\nAnd TVs in the dash, paw\nSee 'em in the five with stock rims, I just laugh, pa (Hahaha)\nI catch stunts when I ain't trying, I ain't lying\nI sip Dom P til I spit up, keep my wrist lit up\nGet outta line, I get you hit up (Woo!)\nNow if you say my name in your rhyme\nYou better watch what you say\nYou get carried away, you can get shot and carried away\nNow here's a list of MCs that can kill you in eight bars\n50, um... Jay-Z and Nas\nI'ma say this shit now and never again\nWe ain't buddies, we ain't partners, and we damn sure ain't friends\nThe games you playing, you get killed like that\nActing like you all hard, you ain't built like that\nSee me when you see me, nigga! WHAT!\n\n[Hook]\nScream murder, I don't believe you\nMurda, fuck around and leave you\nMurda, I don't believe you\nMurda, murda, your life's on the line\n\n[Bridge]\nY'all niggas don't want no parts of me\nYou tryna figure out how y'all started me\nYou gon' make me catch you on a late night\nPop shots with the fifth and slide off in the six", "image": "https://images.genius.com/cbca4592689bea2d38b837879605624e.300x300x1.jpg"}], "artist": "50 Cent"}