{"songs": [{"title": "Action", "album": "Tha Carter III", "year": "2008-06-23", "lyrics": "Go!\nI'm in love with a beauty\nShe is a cutie\nSomebody say they saw us kissin' in the movies\nWe had a drink or two\nWe saw Rush Hour 2\nThen we went home and we made our own movie\n\n[Chorus]\nLights Camera Action ya dig?\nLights Camera Action ya dig?\nIt's showtime, it's showtime, show me yours show you mine\n\n[Verse 1]\nLike OoOoOo it's goin' down in dis bitch\nLike a boxer in the first round in dis bitch\n1-800 I would dick ya down in dis bitch\nUptown in dis bitch don't make a sound in dis shhhhh\nNow let me whisper in ya ear\nEvery single word your little ear wanna hear\nFlip ya body over have no fear\nCan I put my tongue here until you tear?\nCry baby, cry baby, suck ya momma titty\nYou know I like dem old I might have yo momma with me\nI like your girlfriend and your girlfriendses\nHonor my pole like a flag on the end bitch\n\n[Chorus]\nLights Camera Action ya dig?\nLights Camera Action ya dig?\nIt's showtime, it's showtime, show me yours show you mine\nLights Camera Action ya dig?\nLights Camera Action ya dig?\nIt's showtime, it's showtime, show me yours show you mine\n\n[Verse 2]\nI say ohh girl I love you so\nOh ohh girl I love you so (psych)\nBut I don give a fuck about a dog ass ho\nBut I dont give a fuck about a dog ass ho\nPop these pills take take this glass\nPop pop that pussy shake shake that ass\nAnd if ur pussy stank girl u kno u better dush it\nUr nast girl now wash dat stanky funky funky pussy bitch\nStop talkin that shit and suck a nigga dick for an outfit ha\nAnd \"I wear my pants below my waist and\nI never dance when im this place cuz you and your man\nBe planning to hate im so hooddd\"\nAnd she likes it and when we fuck im keepin on my nikes\nIll tear dat pussy up ill tear dat pussy up\nIma good looking rapper I ain't tryna front\nOhhh she pussy poppin on a handstand [x3]\nAnd im the camera man\n\n[Chorus]\nLights Camera Action ya dig?\nLights Camera Action ya dig?\nIt's showtime, it's showtime, show me yours show you mine\n\n[Verse 3]\nCut, check the gates\nWait, why wait?\nWhen I can, just bend you over and do what I told ya\nDo what I wanna, do what I wanna\nYa heard me, I gotta lie like ??\nAnd now every once in a while her knees jerk\nShe forgets how to walk I better teach her\nI got her walkin funny just tell em that your feet hurt\nYou'll probably see her on one of my t-shirts\nI super soak a ho skeet skeet skeet squirt\nBut dont worry, cause if yall are like swingers\nHey im high over features\nHaha new single, oh so now you single\nYou crazy, say da baby", "image": "https://images.genius.com/70a7ef69242915a9cd1c3f68031e4c0a.1000x1000x1.jpg"}], "artist": "Lil Wayne"}