{"songs": [{"title": "Shit Stains", "album": "I Am Not a Human Being II", "year": null, "lyrics": "[Verse 1]\nTunechi, uhh...\nWalked in the bank like my shit don't stink\nBitch I'm from New Orleans, everybody ain't saints\nPockets never empty, Weezy F full tank\nTry to check me and I'mma leave that check blank\nTongue kiss that pussy make that woman have convulsions\nI'm in this bitch throwin' up blood like a ulcer\nReal nigga like a motherfuckin' slave\nI R.I.P. these niggas, like a page\nUmm, hello, how you doin', sir?\nDr. Carter M.D., that's mur-der\nBitches ain't shit and niggas ain't either\nBad bitches I get achoo like sinus\nThese niggas is fake like a bosom\nAnd everybody's on edge until you push 'em\nHaha, but the pleasure's all mine\n'Cause on my watch I'm the greatest of all time\nTunechi!\n\n[Chorus]\nAnd I don't know how fake feel nigga\n'Cause all my life I've been a real nigga\nAll my life I've been a real nigga\nDon't fuck up my night, I'm like\nWhat's poppin'? What's your friend name?\nWhat y'all drinkin' on? Come get a oil change\nI brung my AK, I'm on my \"A\" game\nBitch I'm a a-hole, leavin' shit stains\nHo!\n\n[Verse 2]\nI'm a asshole, but I don't give a shit\nLike a hard dick I'm in this bitch\nI'm sharp, I'm cold, icepick\nTop off the Maybach, nice tits\nI'm from Hollygrove, I used to hang with Elz\nI make them bitches *gasp*, they waitin' to exhale\nI'm on some gangsta shit, knock your head off\nBark up my tree, that's a dead dog\nWhere them hoes at? Tell 'em I said \"what's up?!\"\nI like a shaved pussy, no razor bumps\nI got that paper bitch, come get a paper cut\nDon't gamble in that pussy not even lady lucks\nI make 'em straighten up and fly right\nWhen life hands you lemons find the limelight\nYea, and the pleasure's all mine\n'Cause on my watch I'm the greatest of all time\nTunechi!\n\n[Chorus]\nAnd I don't know how fake feel nigga\n'Cause all my life I've been a real nigga\nAll my life I've been a real nigga\nDon't fuck up my night, I'm like\nWhat's poppin'? What's your friend name?\nWhat y'all drinkin' on? Come get a oil change\nI brung my AK, I'm on my \"A\" game\nBitch I'm a a-hole, leavin' shit stains\nHo!\n\n[Verse 3]\nUhh, I like my alcohol straight bitch\nI can't stop stuntin' I need my brakes fixed\nYea I'm on that shit like a fuckin' maggot\nOn the road to riches, you niggas stuck in traffic\nStomp a nigga out, keep the party goin'\nKick them hoes out if them hoes annoyin'\nBut if they friends bad then them hoes could join\nI'm bout to shoot a porn I'm castin' broken arm\nGot money on my mind, pussy on my agenda\nI beat that pink pussy magenta fuck bein' gentle\nMan I'm hard, these niggas is simple gun to your temple\nI smoke 'til I look oriental high as a window\nAnd I broke these niggas like pencils unaccidental\nBitch I meant to, dick in her dimples lick it I tremble\nI swear this shit is mental, fuck it, my rent due\nI school your ass and suspend you, you bitch you\nIt's Tunechi!\n\n[Chorus]\nAnd I don't know how fake feel nigga\n'Cause all my life I've been a real nigga\nAll my life I've been a real nigga\nDon't fuck up my night, I'm like\nWhat's poppin'? What's your friend name?\nWhat y'all drinkin' on? Come get a oil change\nI brung my AK, I'm on my \"A\" game\nBitch I'm a a-hole, leavin' shit stains\nHo!\n\n[Outro]\nYoung Mula, baby!", "image": "https://images.genius.com/025852747d34bfec09080ad4c10b07b6.1000x1000x1.jpg"}], "artist": "Lil Wayne"}