{"songs": [{"title": "Picture Me Mobbin", "album": "Us or Else: Letter to the System", "year": "2016-12-15", "lyrics": "[Hook: The-Dream]\nPour some liquor for my niggas\nJust to let you know how much I miss you\nI'ma hold it down for the block, triple white Maybach on my 2Pac\nPicture me mobbing (x4)\n\n[Verse 1: T.I.]\nWe riding late night, triple white Maybach on a mission walking off at Magic City\nIt's gon' be an ass and titty night, city light\nNow you front and glare, but I don't care\nIf you crackin' and [?], we gon' be all above it there\nMake sucker raise up and make that bitch raise\nEyebrows I ain't even gonna [mention names?]\nMan, I ain't never been is bitch made\nYou small time nigga, welcome to the big league , homie you passed\nPlaying tough, no we tenderony(?)\nOff a nigga quick and quick to offer testimony\nSo I stay up about my lonely\nThey phony, I'm [blodger?] dodging\nSophisticated thug life, see a nigga mobbing\n\n[Hook: The-Dream]\nPicture me mobbing\nPicture me mobbing\nPicture me mobbing\nPicture me mobbing\n\n[Verse 2: T.I.]\nPop a bottle pour it out for niggas who ain't with me\nGet a bankroll throw it out so ignant niggas listening\nFuck what haters talking bout\nTrap nigga fucking with me till the death\nI’m the last real nigga left\nYoung hugh hef, retired nino brown\nGraduated into royalty, oh you don’t see no crown?\nIt don’t matter still they know it’s me\nGangsta gutter poetry\nDon’t care what you think, my heart pure I know the Lord see\nOut this world officially in orbit\nFull of game lame niggas should absorb it\nAdversity endured it, he ain't all gorgeous\nJust hope they recognize a G when I’m at God's doorstep\nMade some bad choices of course but that’s only natural\nNow how will you react when the reaper is looking at you\nStacked the dough in my satchel, I’m ballin’ my money long\nShine on ‘em while I’m alive but when I’m gone you can\n\n[Hook: The-Dream]\nPicture me mobbing (x4)\nPour some liquor for my niggas\nJust to let you know how much I miss you\nI'ma hold it down for the block, triple white Maybach on my 2Pac\nPicture me....\n\n[Verse 3: T.I.]\nI still do it for my thug niggas and my drug dealers\nMiddle finger to sadiddy bitches who don’t fuck with us\nTriple felo ex-con nigga got told on\nJust came back on tryna get back on\nAy It wasn’t always bout the rap holme\nI still pull up on the street I used to trap on\nIt’s well known I went from flipping ____ serving\nOnto mobbing top down in Rolls down Melrose\n\n[2Pac lyric] – can you see me? is it clear to ya nigga? hahaha", "image": "https://images.genius.com/4a3af1ad50f638f4b221d88c280afff5.680x680x1.jpg"}], "artist": "T.I."}