{"songs": [{"title": "Hotel in Sydney", "album": "No Shame", "year": "2017-11-24", "lyrics": "[Intro: Hopsin & Police Officer]\n— Are you guys letting me go now?\n— Yeah yeah, I'm afraid not, ya fuckin' dog of a cunt! Let's go, dickhead!\n— Officer, you said I was only gonna be here for 30 minutes. It's been five hours, man, what's goi—\n— Yeaaah, shut your fuckin' mouth, ya fuckwit, before I fuckin' bash ya!\n— Man, what the fuck are you talkin'—\n— Go inside, ya fuckin' wombat!\n— Man, this is stupid.\n— Go on, sit down!\n— *sighs* Oh, god.\n— Now, your missus claims you assaulted her.\n— Psssssst.\n— Bloody oath, man, why'd ya fuckin' beat her?\n— Man, I didn't fucking beat her! Listen, I'm telling you…\n[Verse 1: Hopsin]\nI got her the engagement ring that she liked, booked a new flight\nTo come to Sydney, just to see her, start a new life\nMan, she's 20 weeks pregnant and I was tryin' do right\nFor us, the family, the kid, but maybe I was too nice\nMy homie text me a picture and I just burst into anger\nIt was my girl in a bed with her personal trainer\nI text my homie like, \"Yo, where you find this?\"\nHe says, \"Snapchat, bro, it's all on my timeline, shit.\"\nSwear it struck a fuckin' nerve in my chest\nI looked at my girl and said, \"Get a paternity test!\"\nShe said, \"NO! Don't you get all worked and upset\nI only slept in his bed right after work just to rest.\"\nI said, \"What? You expect me to believe that?\nHa, alright, yeah I'll 'relax'\nGuess it doesn't seem bad\nMy girlfriend's with a buff nigga gettin' t-bagged.\"\nOfficer, correct me if I'm wrong but she needed her head detached\nI said, \"Bitch, I can't believe this shit!\nDoes he know you're pregnant? Is that his kid?\nLook how big my headache is!\nThis whole time y'all havin' sex and shit\nWhat type of nigga would fuck a pregnant chick?!\nI said, \"Let's get this paternity test, I'm not kiddin', bitch!\"\nShe said, \"No, I'm not gettin' it!\"\nOfficer, I ain't seen her in months, I couldn't trust the lyin' whore\nPlus she told me she slept with this guy before\nAnd then I said, you know what? Forget it, it's all good, nevermind\nShit was makin' my blood pressure high\nI love her unconditionally, you know, I can't pretend I ain't never lie\nFor the moment, I guess I'll let her slide\nShe said, \"If you don't want to take care of this kid, Marcus, then say so.\"\nI said, \"Wait, no, it's mine too, I can't go\nHow you gonna support this kid without me? You don't make dough.\"\nShe said, \"Hahaha. I make loads.\"\nShe had six grand cash\nI said, \"But you was broke two weeks ago!\nHow you makin' chips that fast?\"\nShe said, \"I bartend, I made it all in tips, ha ha.\"\nI said, \"Girl, you must take me as a big jackass.\"\nI'm like, \"Please, we both know money is hard to come by.\"\nHer bullshit might fly over the heads of some guys\nOfficer, she's always tellin' dumb lies\nI've known her for six years, and she hasn't lifted a finger one time!\nI said, \"Where'd you get the cash from?\"\nShe said, \"I bartend, duhhh, from tips. I'm a waitress.\"\nI said, \"Where'd you get the cash from?\"\nShe started stutterin' like, \"Uhm-uhh-mmm, Marcus, wait just—\"\nI said, \"Where'd you get the cash from?\"\nShe said, \"Ok, ok, I'll tell you, just promise me you won't get mad.\"\nI'm like, \"Baby, where'd you get the cash from?\"\nShe said, \"I work at a strip club… it's how I made the six grand.\"\nI said, \"Woaah, no… NOOO!\"\nI fell down in tears, my heart broke, I turned cold\nI don't want the girl that I'm in love with doin' ho shit\nIf she needed cash I woulda loaned it, and she knows it\nThey won't let me get a refund on this $20,000 ring\nFuck, my head, it hurts, I need some ibuprofen\n[Interlude: Hopsin & Police Officer]\n— Yeah, Mr. Hopson, you need a minute?\n— Um, may I have some water please?\n— Ah, no worries at all.\n— I don't mean to cry and get emotional, but all this just bothers me.\n— Yeah, it's alright, you're good… yeah here ya go, mate!\n— Thanks… *sips water*\n[Verse 2: Hopsin]\nI wasn't me no more\nI looked her in the eyes and straight told her\n(What'd you say to her?)\nI need you to tell me where this strip club is at\nOr this family we're about to have is over\nI said, \"Tell me where it's at!\" — she said, \"No.\"\nI said, \"You about to make me mad!\" — she said, \"So?\"\nI said, \"Bitch, you better panic and run, the damage is done\nYou're doin' this four months away from havin' my son! UGHN!\"\nI told her I would always have her back\nI forgave her after all the careless acts\nI have one question, and she couldn't share the facts\nThe strip club — how come she couldn't tell me where it's at?\nWho the fuck she fuckin' in there?\nWhose dick she suckin' in there?\nShakin' her fuckin' butt in the air\nIt's like we've argued for a thousand fuckin' hours, I'm annoyed\nAnd I was at the point where somethin' was 'bout to get destroyed\nI grabbed her purse, threw that shit across the room\nI fuckin' launched it too\nIt was filled with makeup kits and all of her jewels\nI blacked out; she said, \"What the fuck is wrong with you?\"\nShe got up out the bed to get it, I pushed her ass back in it\nI said, \"We're still talkin', bitch, you and I ain't finished\nNow, this strip club, where is it? BITCH, WHERE THE FUCK IS IT?!\"\nI said, \"You know what? Fuck it. Awesome. Fine.\"\nIn the process of all this drama, I had lost my mind\nI felt lost and blind: the gym trainer, the strip club\nThe ring, the baby, she really crossed the line\nAnd then I finally came down and all the madness was finished\nThen she invited me to dinner with her family in Penrith\nI said, \"I ain't goin' with you, you can leave now\nI need to stay in this hotel room and figure some things out.\"\nOfficer, I know you ain't gonna sympathize\nI don't approve of any man puttin' hands on his girlfriend or wife\nEspecially when she's pregnant with his kid inside\nHonestly feel like I wasn't in the wrong, but still I wasn't in the right\nAsk her, she ain't got no bruises on her\nI'm human, there's only so much that a dude can conquer\nShe knew that her actions reflected true dishonor\nAnd tried to cover it, sayin' I'm an abusive monster\nThat's bullshit, huh, and that fast, poof\nAll of her wrongs are in the past, cool\nShe's just the innocent white girl\nAnd I'm the black guy who always gets mad, true!\nI know y'all about to make it hard for me to get back into Australia\nMan, this shit is fuckin' sad, dude\nI still don't know if this baby is mine or not\nSo when he's born, who's gonna be the fuckin' dad? You?", "image": "https://images.genius.com/538c208e6d573914c37ce0417736d005.1000x1000x1.jpg"}], "artist": "Hopsin"}