{"songs": [{"title": "Young Jedi", "album": "Young Sinatra: Welcome to Forever", "year": "2013-05-07", "lyrics": "[Intro: Logic]\nReal talk, just RattPack, besides that, nobody I trust\n\n[Verse 1: Logic]\nBack again like I never left, Young Sinatra, that’s to the death\nWe turnt up ’til we go deaf, rep RattPack ’til my last breath\nI cut records like Kid Cudi, day and night, that’s all the time\nFrom the underground to the mainstream, my same team get all the shine\nThey wanted beef but I never knew, I just keep the peace and get revenue\nStay true, they never do, cut all ties, I sever you\nThese rappers like women, that's off of their pill, we keeping it real but they flow is irregular\nGrab the mic and I murder on the regular while these bitches hit me up on my cellular\nI can’t take the time that I take to rhyme and just bullshit, man, that blow my mind\nI’m 23 like MJ, that’s no rest like overtime\nWriting rhymes on the tour bus, we stay real to the core of us\nThey talk shit ’bout RattPack but every day, man, there’s more of us\nThat money come and that money go, but this music shit, man, that’s all I know\nI been broke and I got paid, like a Goodfella that got made\nI’m draped up and I’m dripped out, went to school, got kicked out\nTold my mama, she flipped out, said “fuck it all” and I dipped out\nBut I’m back though, whole time, fuck bitches, I just rhyme\nBrand new state of mind, my lifestyle is so divine\n'Cause I’ve lived and I’ve learned, now I hustle and earn\nCause once you in the limelight, everybody concerned\nWith your wellbeing, and if you feel okay\nBitch, you wasn’t here a year ago, why are you here today?\nI got professor paper, your money need an extension\nI’m selling success, save up and pay attention\nMoney can’t buy happiness, but that shit can support it\n'Cause what’s a family of five if you can’t even afford it?\nSinatra\n\n[Beat Switch]\n\n[Spoken: Dizzy Wright]\nFeeling good, feeling great\nFeeling like a XXL Freshman on your bitch ass, nigga\nTry me\n\n[Verse 2: Dizzy Wright]\nCreeping on the come-up with my nigga Logic, time to get it popping\nGot your city watching, hit the stage, them titties popping\nWhat it do? Bruh, I fuck witchu, don’t let these haters knock ya\n(Keep it gangsta) Keep it, keep it G, don’t keep them lames around ya\n(Fuck the world) Fuck the, fuck the world, y’all gon’ feel my passion\n(Pass the blunt) I’ma create that shit that’s fuckin’ everlasting\nI’m overboard with the tactics, walk out the house\nAnd I ain’t even matching, but I’m stunting 'cause I’m the coolest and the youngest\nI told ‘em I was a threat, they scared of what’s next\nI’m Christoper Dorner in effect if you speakin’ down on my name (Pop pop pop pop)\nWalking down this road, I’m the only one in my lane\nAnd my fingers getting itchy, that’s that money coming to get me\nMr. Wright, Mr. Dizzy Wright, Vegas nigga shit (Making noise)\nWait a minute, ain’t them niggas on the list?\nMaking moves, making super moves, who the fuck is you?\nNigga what? Nigga, nigga, what? Them niggas the truth\nIt’s an honor to be a part of the heart of the young Sinatra (Wright)\nYou ain’t gotta smoke weed, we gon’ celebrate with this vodka (Uh)\nGrinding for some time, and I’m hella straight with the dollars\nSo if you call me and you need me, then I got ya\nDon’t talk about being the realest, niggas gon’ feel us regardless\nWe gotta keep on killing, I got the mind of a martian\nI’m spaced out somewhere in a world that I never been\nLiving out my dreams and I’m still tryna settle in\nSee it’s amazing, studio sessions (Uh), beautiful blessings (Uh)\nI’m faded, usually quiet (Uh), but I’ve got this message (Uh)\nSo I speak it like I know it\nGot my shot, I took it and I didn’t fuckin’ blow it, now everything is in motion\nCalling out my homies who understand what it means (Yeah)\nTo get off your ass, get on your grind and follow your dreams (Yeah)\nMaking it a fact (Uh) to be great at what you achieve (Yeah)\nIf I lead, would you follow with a ease? (Uh, uh, yeah)\n\n[Verse 3: Logic]\nOpen your mind, elevate to the level of this rhyme\nKeep it G to the dime, many seek, never find\nNever knowing when I’m flowing, feeling heroic, never ask\nChilling with your bitch, I can’t help but grab up on that ass\nSwerving at 120 while she’s rolling weed on the dash\nMany never follow their dreams but follow the cash\nAnd this is the reason the Reaper is coming for they ass\nTop dollar, money, bitches, Impalas, fuck it all, let me holler\nAnd show you how we do it where I come from\nWe getting money for the long term, not just no lump sum\nUh, how you feeling? Make a killing, bitches higher than the ceiling\nI’m Goku, you fuckers is Krillin with the spirit bomb\nFuck around, throw your body on the lawn\nRight in front of your mom, motherfuckers, I’m gone\nRattPack\n\n[Outro: Christopher Lee]\n\"As you see, my Jedi powers are far beyond yours\"\n\"You have interfered with our affairs for the last time\"", "image": "https://images.genius.com/da76d57af3e6ee702af91bac2a18326a.1000x1000x1.jpg"}], "artist": "Logic"}