{"songs": [{"title": "Da Bump", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "[Production by Erick Sermon]\n\n[Intro]\nOriginal rude bwoy... on your scene\nHaha, ha ha ha!\nEverybody light your blunts, get your smoke on\nHahah\nAll you bitches drop your drawers... witcha stinkin ass (stinkin ass)\nJust roll that weed (roll that weed) just roll that weed (roll that weed)\n\n[Verse One]\nAiyyo, yes it's me the MC Grand Royal\nSpittin that Newcleus I suggest you Jams On It\nI'm not a role model I cracks the Beck's bottle\nSmoke blunts, play pretty MC's as sex models\nSo inhale exhale what you smell?\nDerail the frail blind MC off my trail\nIf he use braille, see I never been touched\nRegulate the street tactics then parlay in the cut\nUhhahhh, lay back and hit this while I shit this\nFlip this, schizo ass flow at long distance\nAnd plus I pack nine inches in my britches\nAnd keep an instant lit for the funky ass bitches\nNewark, New Jersey's on the map, ?comprende?\nAnd confrontations start from the blunts and the Reme\nAnd if an-y, MC out there wanna test\nCall my boy Poppa C to put a slug in your vest\n\nChorus (from \"Tonight's Da Night\")\n\nCheck, I walk around the street with the black tec nine\nBy the waistline, kickin the hype shit\nSo turn the volume up a notch\nAnd watch the ba-bump, ba-bump, make your speakers pop\n(repeat 2X)\n\n[Verse Two]\nOwwww, shit I'm just one hip nigga\nShit is off the hook when my crew is in the mixture\nWhat I deliver, over tracks and rivers\nIs making your lungs collapse and quiver, it's the\nPPP foundation in your ass\nWe be the bomb like that Oklahoma blast\nThen outlast, a few clowns, sounds\nRaps, stay bein the mack like Dru Down\nAsk me what I smoke and I say, \"It's the method!\"\nFunk off the hook I leave shit disconnected!\nWhat's the name of that town rollin up trees?\nJersey smokin up the bom ba zee!\nIt don't stop, you better move slowly\nI make that chest wet and cosy\nThen dip lowkey like OG's\nThen inject that antidote to make you OD\nYou know a better flower get the dough G and show me\nI bet you I make em more pussy than Josie *meow*\nAnd show em How High I am just from the nosebleed (How High)\nI keep it Naughty By Nature\nKick that rugged shit that Maybelline couldn't make-up, lace up\n\n[Interlude]\n(Yeah Funk Doctor, represent one time for all the blunt smokers)\nSmokin weed\n(Yeah yeah, yeah yeah, it's how we do)\nLet me hear you go ooooohhhh! (ooooohhhh!)\nSmoke lalala (smoke lalala)\nLet me hear you go ooooohhhh! (oooohhhhh!)\nSmoke lalala (smoke lalala)\n\n[Verse Three]\nFunk Doctor, got your ass locked down proper\nLet me next blast derelicts, binaca\nI'mma Star at War, smoke blunts, don't Chew-bacca\nThe head banger boogie for the marijuana shoppers\nLace the tracks with stacks of artifacts\nMake the police arrest me for givin the cardiac\nCause I'm the shitter, headbanger non-quitter\nTwenty blunt a day nigga, Landcruise whipper\nI represent, commence to beat an instrument\nWho's next to get that ass bent ten percent\nI make you boo pass off your jewels you lose cause\n(I am so cool... cool... cool...)\nReact opponent, I Got Five On It\nMet some hoochie, now I got fifty-five on it\nWith two Coronas, I dominate my opponents\nTo the hardcore niggas, keep on! (motherfucker)\n\n[Hook]", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}