{"songs": [{"title": "How We Do It Over Here (LP version)", "album": null, "year": null, "lyrics": "(feat. Missy Elliott)\n\n[Missy Elliott:] Bus-a-Bus baby-baby! Now...\n\n[Hook: Missy Elliott]\nPop your collars like this\nBottles up like this\nSide to side like this\nHolla if your like this\n\n[Missy Elliott:]\nSee the ass? Touch me right there\nWanna touch my nookie baby? Touch me right there\nMake me lose my mind baby? Touch me right there\nParty over here, ain't shit overthere!\n\n[Busta Rhymes:]\nSee how I'm drillin' 'em baby?\nIt's Bus-a-Bus back bitch, I'm killin' 'em crazy\nWe off the Relaxic, I'm spillin' the gravy\nGot every club packed thick, creating a frenzy\nTo be the latest greatest for all you niggas from gazing\nBugatti off white tan, interior pastry\nSee my swagger sharp like that, these niggas amaze me\nAs a matter a fact just salute me & praise me\nEnough of that\n\n[Missy Elliott:]\nWe be up in the club, niggas sportin' them minks\nTipsy in the club, nigga buyin' 'em drinks\nWalk around lookin' like our shit don't sink\nIce by my neck so bright, watch 'em blink\n\n[Busta Rhymes:]\nOkay, now I got me a clear view\nI like it when you get up & I'm lovin' your hairdo\nThe way you cross your legs, ass spread in the chair you\nThe way your clothes skimpy, so it's easy to tear through\nAppreciate my presence, while I shine wit' a barrel\nI came up wit' cut diamonds, obscure in a rare blue\nShorty ain't checkin' for you, step to the way I do\nSuper senile, I ain't the one to compare to\nNow she was sayin'...\n\n[Missy Elliott:]\nSee the ass? Touch me right there\nWanna touch my nookie baby? Touch me right there\nIs that Dr. Dre baby? Touch me right there\nParty over here, ain't shit overthere!\n\n[Hook:]\nPop your collars like this\nBottles up like this\nSide to side like this\nHolla if your like this\n\n[Busta Rhymes:] What you sayin Missy!?\n\n[repeat Hook]\n[Break:]\n[Busta Rhymes:] We got some shit for that ass\n[Missy Elliott:] Come on give it to me\n[Busta Rhymes:] We got some shit for that ass\n[Missy Elliott:] Come on give it to me\n[Busta Rhymes:] We got some shit for that ass\n[Missy Elliott:] Come on give it to me\n[Busta Rhymes:] We got some shit for that ass girl\n\n[Busta Rhymes:]\nBounce back, brand new on the scene what?\nTook a little minute, I'm back with the re-up\nSwitched it up a little bit, back with a clean cut\nShorty's lost her head, see all the koochies I cream up\nI love the way she in all over the girls when I'm teamin' up\nIt's gettin' hotter in this bitch, windows are steamin' up\nAmazed by the pinky, neck & wrist be gleamin' up\nHow I dominate the scene, how a nigga be cleanin' up\nI see you likin' everything, you see me & you\nYou frownin' on your girl, like you ain't willing to share boo\nThe hotel ain't far, meet me there & if you\nYour girl lookin' like she wit' it, she can come in too\nYou get impatient Ma, show you just how the kid move\nI'm bangin' in the truck & let her watch in the rearview\nSee we don't really care about the niggas who came through\nOverthere 'cause over here, see I'm a show ya how we do\nSo check it baby...\n\nSee the ass? Touch me right there\nWanna touch my nookie baby? Touch me right there\nMake me lose my mind baby? Touch me right there\nParty over here, ain't shit overthere!\n\n[Busta Rhymes + Missy]\nSee it don't matter what your doin' overthere\nSee we gets it poppin' that's How We Do It Over Here\nThat's if we toss bottles, that's How We Do It Over Here\nCheck it, floss models, that's How We Do It Over Here\nListen, rare throttles, that's How We Do It Over Here\nCheck it, ice collars, that's How We Do It Over Here nigga\nSee it don't matter what your doin' overthere\nSee we gets it poppin' that's How We Do It Over Here\n\nOver here", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}