{"songs": [{"title": "You Got It", "album": "Friday Night Lights", "year": "2010-11-12", "lyrics": "[Sample: Janelle Monáe]\nMay this song reach your heart\nMay this song reach your heart\n\n[Refrain: J. Cole]\nHey one time, hey one time, one time\nThrow your hands to the sky tonight\n'Cause I think I see the baddest lil thing in the world right now\nBut I gotta make sure I’m right\nAnd girl you damn right\nIf your head right, I’ll be there every night\nI just might change your life\n'Cause baby you got it (you got it), you got it (you got it)\nYou got it (you got it), you got it (you got it)\n\n[Verse 1: J. Cole]\nHey Cole World, real cold world\nI watch it hit the floor and watch it drop it real low girl\nLast time I seen you, you was a lil old girl\nI had a crush now we grown and you still so thorough\nClap for her, work it till you exhausted\nI swear ain't nothing worse than a bad bitch that lost it\nBrains off the chain, smart mouth with a dumb ass\nGoddamn your ex-man is a dumb ass\nWhen you was leaving, did he put up a fight?\nWas he stressing you, wasn’t fucking you right?\nWell one man’s trash is another man’s treasure\nOne man’s pain is another man’s pleasure\nOne damn thing you can’t change is the weather\nBut even if it rain, we get rained on together\nIt’s whatever, you shine, I shine\nI know you got a 9-5 I’ll be your 5-9\n\n[Refrain: J. Cole]\nHey one time, hey one time, one time\nThrow your hands to the sky tonight\n'Cause I think I see the baddest lil thing in the world right now\nBut I gotta make sure I’m right\nAnd girl you dead right\nIf your head right, I’ll be there every night\nI just might change your life\n'Cause baby you got it (you got it), you got it (you got it)\nYou got it (you got it), you got it (you got it)\n\n[Sample: Janelle Monáe]\nMay this song reach your heart\nMan, I could hear 'em saying\nMay this song reach your heart\nAyy, yeah\n\n[Verse 2: J. Cole]\nYeah, go ahead and pop it like you do in the mirror\nI’m picking through the crowd tryna see a little clearer\nHigh heel wearer, ugh, hell of a body\nFirst one to spot you and I ain't telling nobody\nNope, I’m peeking at your ass, winking at your ass\nIf I don't bag I’ll be thinking bout your ass\nFor the whole week, no time for cold feet\nShe too bad to pass, so fine I'm gon' speak\nI tell her my name Jermaine, I’m tryna be low key\nShe tell me I got that flame, your rhymes are so deep\nDamn, girl thank you, shit, you so bad\nKnow your daddy wish he could still spank you, hol' up\n'Fore these other niggas roll up and try get ya\nThe ones that say they riders but never do ride with ya\nI’m tryna vibe witcha, so won't you throw me your phone number\nAnd let them lames get your old number\n\n[Refrain: J. Cole]\nHey one time, hey one time, one time\nThrow your hands to the sky tonight\n'Cause I think I see the baddest lil thing in the world right now\nBut I gotta make sure I’m right\nAnd girl you damn right\nIf your head right, I’ll be there every night\nI just might change your life\n'Cause baby you got it (you got it), you got it (you got it)\nYou got it (you got it), you got it (you got it), hey\n\n[Sample: Janelle Monáe]\nMay this song reach your heart\nMay this song reach your heart\n\n[Verse 3: Wale]\nRoc Nation, Wale, haha\nLook, Cole world, still a cold world\nAnd a couple you is cool but we a little more thorough, huh\nWhole time, a little more girls\nYou know I spit that sick shit and there’s still no cure\nHold up, loud packs like I got cancer\nChoking on them white boys make a Black Panther\nLove my women with high heels and high standards\nAnd only cheat on my broad if I run out of answers\nI got that vicious flow, Moncler winter coat\nI ain't superstitious, I make all these broads split my pole\nHa, you dig it, this shit ain't for beginners\nI’m something like a fetus, I'm not quite kidding\nAnd there's something you ain't seeing like I block y'all vision\nLike my Remy with no juice, you a lot like Bishop\nHundred K in twenty-two hours\nSee, money talks, you muthafuckers is Boomhauer\nNo check back, in debt, yep\nLoud in my jay, y'all smoke that Gallaudet\nHigher than I need to be, flyer 'cause I need to be\nLove our conversation but it’s late right now, I need to beat\nOne time for the Ville that Cole rep\nAnother time for the city of the slow death\nI don't understand why these niggas so vexed\nI don't need no chains with no cross to know I’m blessed\nHold up!\n\n[Refrain: J. Cole]\nHey one time, hey one time, one time\nThrow your hands to the sky tonight\n'Cause I think I see the baddest lil thing in the world right now\nBut I gotta make sure I’m right\nAnd girl you damn right\nIf your head right, I’ll be there every night\nI just might change your life\n'Cause baby you got it (you got it), you got it (you got it)\nYou got it (you got it), you got it (you got it)\n\n[Sample: Janelle Monáe]\nMay this song reach your heart\nMay this song reach your heart", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg"}], "artist": "J. Cole"}