{"songs": [{"title": "All Out", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: Kastro & (Napoleon)]\nWe goin' all out, we goin' all out\nWe goin' all out\nWatch your motherfuckin' mouth, niggas!\n(That's right, fuck these fag niggas!)\nDo it, do it, do it!\n\n[Verse 1: 2Pac]\nCome hell or high water, down to slaughter opposers\nJust another lost soul, stuck, callin' Jehovah\nOutlaw 'til it's over, brandish my strap, back like a cobra\nI stay drunk ‘cause I'm a mad man whenever sober\nOn a one-man mission, my ambition's to hold up\nThe rap game, while I pluck holes in niggas like donuts\nAnd still down to die for all my soldiers like hillbillies\nThey don't fear me, so we feud, bringin' war to the city\nWith each breath, death before dishonor\nNever let you swallow me, no apologies, Your Honor\nA general in war, I'm the first to bomb\nWith a squad of trusted killers, quick to move shit, heavily armed\nI'm similar to Saddam, sometimes I question who's sane\nLike fiends frantic for that last vein, stuck in the game\nI hit the scene like sandstorms, then transform, watch me\nI take the figure of 30 niggas who all got me\nWhile bitches wonderin' who shot me\nNo love, keep a grudge, shootin' slugs like Muammar Gaddafi\nMurder my friends, build a new posse\nWe takin' shots at paparazzi, go and fly now, nigga, like Rocky\nYou got a lot of nerve to play me, another gay rapper\nBustin' caps at Jay Z and still avoid capture (Buck buck buck buck)\nWhile y'all caught up in the rapture, still after me\nI'm in Jamaica sippin' daquiris, no doubt\nWe used to havin' nothin' then grabbin' somethin' and bustin'\nWanted to be the thug nigga that my old man wasn't\nI can't tour, fear of catchin' cases, litigation\nNiggas player-hatin', got me crooked in all 50 states\nI'm screamin' \"Death Row!\", throw my Westside, ain't no thing\nWe was raised off drive-by's, brought up to bang\nWe claim mob, M.O.B. if you be specific\nWe control all cash from Atlantic-Pacific\nAnd get this: I'm hard to kill when I peel with this live spot\nFather, how the Hell did I survive these five shots?\nLive it up or give it up and like demons\nLate night, hear them screamin', \"We goin' all out!\"\n\n[Hook: E.D.I.]\nWe goin' all out, bomb first 'til they fall out\nTake them the war route, without a doubt\nBall, which means we all ride if it's on\nEach nigga handle your own, bring it on strong\nIf you got bills to pay, nigga, go all out\nBustas playin' with your papes better go all out\nTryna see the next day, nigga, go all out\nObstacles in your way, you better go all out\n\n[Verse 2: Napoleon]\nI'm on my last leg, walkin' through the belly of the beast\nFeelin' like I'm all out, drunk as can be\nIt's plain to see, that we mob niggas hidin' in bushes\nClaimin' that they ride rough, but they softer than cushion\nThey softer than bitches in the worst way, drownin' in blood\nOutlawz, my blood brothers, I'd die for these thugs\nSay hi to this slug\nIt's a shame how some niggas on the West Coast\nWas ridin' with 'Pac, but when he died they went pop\nI'm out in Jers, to the fullest, like some West Coast love\nBut after 'Pac stopped rappin', it ain't no West Coast thug\nJust West Coast, slut, to my real niggas stuck in the street game\n‘Cause rappers like Jay Z be pumpin' Kool-Aid through they veins\nIs it true what I'm sayin'? Slap your soft ass to the floor\nAnd watch my fo'-fo' put peek holes through your door\nI ride or die, but these other fag niggas be bitin' this\nIt's all from my heart when I was writin' this; all out!\n\n[Hook: E.D.I.]\nWe goin' all out, bomb first 'til they fall out\nTake them the war route, without a doubt\nBall, which means we all ride if it's on\nEach nigga handle your own, bring it on strong\nIf you got bills to pay, nigga, go all out\nBustas playin' with your papes better go all out\nTryna see the next day, nigga, go all out\nObstacles in your way, you better go all out\n\n[Verse 3: Kastro]\nNow, we all ride, and down to die — who with us?\nSpeak up or get treated like you comin' to kill us\nThey ain’t nothin' but squealers\nIn this rap game, swearin' they rough\nTattooed up, and now them niggas swearin' they 'Pac\nStop that, and watch your back, we ain't forgot 'bout ya\nThese Glocks hot, and when shot it'll bring the bitch up out ya\nIt's me, Kastro with the goattee, walkin' like a OG\n‘Cause all these fag motherfuckers owe me\nI pray to thug lords like them motherfuckers holy\nFrontline soldier, 'til the Heavens call me\nI go all out, and if you real, you real\nFeel what I'm talkin' 'bout, ‘cause this game is ill\nI live it, forbidden fruit, shoot, 'til they feel it\nLivin' proof, Pac breed niggas they can't deal with\nHolla back, right back, and watch your mouth\nOr get blood in it, what! We goin' all out, nigga!\n\n[Hook: E.D.I.]\nWe goin' all out, bomb first 'til they fall out\nTake them the war route, without a doubt\nBall, which means we all ride if it's on\nEach nigga handle your own, bring it on strong\nIf you got bills to pay, nigga, go all out\nBustas playin' with your papes better go all out\nTryna see the next day, nigga, go all out\nObstacles in your way, you better go all out\n\n[Outro: E.D.I.]\nFool, you better go all out\nKeep goin' all out\nAll my niggas goin' all out\nWithout a muthafuckin' doubt\nAye, you niggas just gon' think you gon' be uhh\nTalkin' slick on all of these motherfuckin' records\nAnd we ain't gon say shit\nNow it's 1999, it's a different grind\nDon't disrespect the Don\nIt's still war, motherfuckers\nSo let's see you act like you know", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}