{"songs": [{"title": "Cheesy Rat Blues", "album": "Mama Said Knock You Out", "year": "1990-08-28", "lyrics": "[Intro]\n(Nothing can save ya\nNothing can save ya\nNothing can save ya\n*scratched* Nothing)\nJust throw your hands in the air\nAnd wave 'em like you just don't care\nKeep 'em there\nYo, run the jewels, run the jewels, run the jewels\n(Can you feel it?)\n\n[Verse 1]\nI used to be rollin' like a millionaire\nCash in a flash, bankroll to spare\nHomeboys hangin', champagne and girls\nGot my main woman diamonds, my mistress pearls\nEverybody laughin' at my corny jokes\nI was stupid; I thought that they were sincere folks\nIt turned out they liked the money and the fame\nIf I ain't get paid, I'd be 'that nobody James'\nThe nobody, who dreamed about bein' somebody\nChief rocker at the party\nAnd they was hangin' like, \"Yo, I'm your man\nI don't even care about the ring on your hand\"\nWe'd go out to eat and chill\nBut they would go to the bathroom when it was time to pay the bill\nI didn't notice all the chuckles and laughter\nToo busy with a female tellin' me I'm the master\nI was slick like, \"Huh, do I know you?\nI got play, here, let me show ya\"\nUsed to have a girl that was on the ball\nWhen the cash flow got low, so did her calls\nUsed to have a homeboy, always chillin'\nMy cash went low, he told me I was illin'\nAnd don't call 'cause he don't hang with derelicts\nBroke with no cash, yo, I was in the mix\nEverybody stepped 'cause my pocket wasn't fat\nMy girl got a new man, I fixed his flat\nI'm the one that they're laughin' at\nThey say, \"Cheesy rat, you ain't all that\"\n\n[Chorus]\n(Can you feel it?)\n(Can you feel it?)\n(Can you feel it?)\n(Can you feel it?)\n\n[Verse 2]\nI mean crabbin', played out by backstabbin'; I feel like tyin'\nA anchor to my ankle and jumpin' right in the ocean\n'Cause I'm ashy and I can't afford lotion\nSo-called friends in the jewelry store\nTold me, \"Todd, come back when you get off tour\"\nSouped as hell, I really regret it\nNow the only thing I got in my pocket is bad credit\nHow can a man like me\nBe walkin' around in a world of misery?\nAnd if women like a man with a body, it's not mine\n'Cause they be walkin' past me like I'm a stop sign\nMy homeboys laugh when they pass the forty\nSayin, \"Todd, as if he used to have a sporty\"\nThe Benz was slammin', the Jeep was pumpin'\nAin't that somethin'?\nI just laugh and say so what I was rich\nWhen I walk away, it's like ain't this a\nKick in the rear, that I'm standin' here\nAnd can't afford a tissue for my tear\nShould I drink wine and brandy\nOr get a job puttin' stripes on candy\nOr put a hole in donuts?\n'Cause when you're broke, your middle name is \"so-what?\"\nI had to learn in an incredibly fast way\nWhen you ain't got no money they treat you like an ashtray\nI pawned all my jewelry and clothes\nRight after that, I got dissed by all the hoes\nThat I thought was mine, but really never was\nSoon the whole neighborhood got the buzz\nThat my tank was on \"E\", and that means empty\nThat Twinkie looks good, so mister don't tempt me\nEverybody thought I was trippin'\nI rode the back of the bus, but my grip kept on slippin'\nI'm the man that they're laughin' at\nThey say, \"Cheesy rat, you ain't all that\"\n\n[Chorus]\n(Can you feel it?)\n(Can you feel it?)\n(Can you feel it?)\n(Can you feel it?)\n\n[Verse 3]\nI wanna hang with my man like, \"Let's do this\"\nBut this man like \"Who this?\"\nThat's right, the brother got two faces\nThey got me puttin' the tips on shoelaces\nP on the Puma, a mop and a bucket\nMy motto is... I don't care\nI don't give a damn, so what, why try?\nI might as well rob some Blake Carrington sucker for his money\nIt's so funny\nCars ride by with the boomin' system\nSayin, \"Leave him alone, my man already dissed him\"\nNow I'm on the cheeseline, poverty-stricken\nAs the red tape thickens\nI go to the park, they wanna baseball-bat me\nI go to the mall, they throw my old tapes at me\nI'm so horny\nAnd every girl I know be like, \"He's so corny\"\nI want money in a hurry\nI'm gettin' tired of leftover curry\nI wanna fall off, but I don't know where the edge is\nI'm so hungry, I eat my neighbor's hedges\nNow I realize I gotta go for mine\nIt's windshield time\nI take quarters, pennies, dimes and nickles\nAnd a kiddy's tricycle\nI'm a desperado\n\"I'ma steal your rims\" is my motto\nI watch wrestlin' until I'm dizzy sore\nSo if you're cashin' your rent check, know how to get busy\nGo to the drive-through, run with a milkshake\nGo to the supermarket, pocket a raw steak\nI need beer\nI'ma catch the Miller truck out there\nYou know how they throw, the newspapers in the morning\nThe owner don't want em\nI'm the man that they're laughin' at\nThey say, \"Cheesy rat, you ain't all that.\"\n\n[Chorus]\n(Can you feel it?)\n(Can you feel it?)\n(Can you feel it?)\n(Can you feel it?)\n\n[Outro]\nSo yo, one more time, one more time\nParty people in the house tonight\nJust throw your hands in the air\nAnd wave em like you just don't care\nKeep em there\nRun the jewels, run the jewels, run the jewels", "image": "https://images.genius.com/22e65b653eb6ded3289c8de99a5e66f7.1000x1000x1.jpg"}], "artist": "LL Cool J"}