{"songs": [{"title": "Tricks on Me", "album": "Future Hndrxx Presents: The WIZRD", "year": "2019-01-18", "lyrics": "[Intro]\nYeah\nJust got a call from my mom\nTellin' me what the lawyer was sayin'\nAbout the lawsuit\nI thought they had had that down, yeah\n\n[Verse 1]\nBig money shit, baby, I just bought a new six, baby\nFlintstone in my ears, pissed on my wrist, baby\nThis song just mutilated, everything decapitated\nDeep on new relations, just gotta be brand related\nAin't no sellin' out, no tradin', so you gotta be gang related\nPop stylin' this shit for my shottas incarcerated\nRockstar this shit, a street star, I stay acquainted\nPop stylin' this shit, how you get the high maintenance one?\nHow she gon' take my love and give it away like it ain't nothin' to her?\nHow you gon' judge my drugs I take when I never did offer you?\nHawaiian surfin' on the thick one to the PJ\nI can just imagine the pain on Bankroll PJ\nMurder murder, broad day, I got tears, I can't let 'em out\nI can't take it, I can't take it no more, I'm 'bout to spaz out\nI'm good on deposits but I gotta have a stash house\nI see you bein' greedy and I gotta work my ass off\nI chief on gas house, until I pass out\nRollin' in a Phantom, came with an umbrella\nSurvive the trenches, it thunder today, I'll walk through it\nHurricane Pluto, I'ma drip all through it (Icy)\nI was lettin' the shit I can't control destroy me\nIt was goin' too deep for you, baby, pardon me\nI tried to treat that shit just like a party\nI'ma feel weak if I tell you sorry\n\n[Pre-Chorus]\nGotta be a genius, gotta be extraordinary\nGotta plant seeds, nigga, like a florist\nI'm Future Hendrix but I'm not a guitarist\nI could've been starvin', I'm fortunate\n\n[Chorus]\nMaybe my mind playin' tricks on me\nMaybe my mind playin' tricks on me\nCould it be my ex playin' tricks on me?\nSomeone that's jealous playin' tricks on me\nBig boss shit, baby, I just bought a new pent', baby\nButler came with the elevator, greet my guests, baby\n​iPad high maintenance, everything's unordinary\nGrapes and strawberries, nothing's contemporary\n\n[Verse 2]\nRockstar in this shit, like a popstar in this shit, yeah\nTryna forget the way they did to Bankroll Fresh, gettin' harder\nSeen his son at my little boy birthday party, it was harder\nThe streets of the ATL don't respect nothin' but shottas\nHad to look the other way, could be the other way\nHit Yung Mazi up, that was in the broad day\nI popped two Xans and I been sleep all day\n(Let's go, let's go)\n\n[Pre-Chorus]\nI was lettin' the shit I can't control destroy me\nEverything's too deep for you, my nigga, pardon me\nI'm Future Hendrix but I'm not a guitarist (Super)\nI could've be starvin', I'm fortunate\n\n[Chorus]\nMaybe my mind playin' tricks on me (I'm so fuckin' hurt)\nMaybe my mind playin' tricks on me (Maybe my mind)\nCould it be my ex playin' tricks on me?\nSomeone that's jealous playin' tricks on me (Someone that's jealous, I know, I know)\nBig boss shit, baby, I just bought a new pent', baby\nButler came with the elevator, greet my guests, baby\n​iPad high maintenance, everything's unordinary\nGrapes and strawberries, nothing's contemporary", "image": "https://images.genius.com/34c65c1f7c7a487c413e910c3c5e6078.1000x1000x1.jpg"}], "artist": "Future"}