{"songs": [{"title": "He Wanna Be Paid", "album": "Celcius", "year": null, "lyrics": "[Intro]\nTech N9ne in this bitch (Tech N9ne, Tech N9ne)\nBout to make em dance once again baby (once again baby)\nBut this time, I'ma talk about my motha' fuckin friend baby\n(yeah) yo it's been long overdue baby (that's right)\nLong Overdue (how we do it)\nBut you asked for it\nSo now I gotta give it to you, (give it to you)\nGet Paid\n\n(Verse 1)\nLet me tell you a little story about this nigga I know\nFrom the M and the O\nA chemical nigga who says I got criminal flows\nI'ma set the record straight for a second\nEverybody knows this nigga is hot-headed\nAnd due for a mic checkin\nYou drew first blood in '94\nTrickin with my baby momma\nYou know the one you called a ho\nI'ma let you know\nThat if you take it back to the past\nWhen I was squeezing hella ass and playin hookie\nYou can ask my bro, He will let you know\nBack then I shared my pussy\nYou was using music as a form of pursuing\nPussy sneakin in her bed and beggin for a screwin\nWho the fuck is you foolin?\nI can still make her make you put yo muthafuckin mic down\nStraight interrupt yo show\nAnd serve yo ass in her nightgown\nRight now\nFuck the rappin, we can fight now\nTight style, Sell for miles\nChange the name Vell to Vall\nCall him Dame or Gal\nCause the way he came was foul\nNigga that's bitch shit\nTech N9ne you dissed it\nBut they missed it\nTold me that you sold 200,000 with pride\nBut you lied, I don't mean to hurt yo feelings inside\nBut you sold 5,000 Nationwide\nYou a clown man\nYou niggas think I bluffin, go check the SoundScan\nAll I wanna know is\n\n[Chorus]\nWhy this nigga steady savin his flows for me?\n(He wanna get paid)\nAnd why this nigga basin his whole life on challenging me?\n(He wanna get paid)\nFuckin with 56 Villain get you shota\nMidwest side will chase em down with a choppa\nMotherfucker thinking Teccanina gonna stopa\nSomething wrong with his medullah oblongota\n\n(Verse 2)\nYo\nThis nigga struggling to be the better man\nWhy fuck around with a tech milla meter\nWhen you know the nigga is a clever brand\nNaw, I ain't never ever seen the niggas video\nCause It never ran\nAnd you got the audacity to say Tech N9ne ain't a veteran?\nNigga, I wrote my first rhyme in '85 right\n'86, '87, '88, name me Tech N9ne right\n'89, '90, I was rippin shows, don't you even try cat\n'90 through '99 equals 15 years and I done rapped with some of the best\nMotherfucker can you buy that?\nWe recognize you wanna be the best rapper in Kansas City\nThat's small time\nThat's why yo shit will never be in the hands of many\nMy shit is clean and packs a punch pal\nAnd yeah you right, yo shit's a sloppy rum and drunk style\nThis nigga is failin in the biz\nBets step behind this\nDon't know where his mind is\nThat's why the Nina's bout to tell it like it is\nTech Tech N9ne is\nKansas City's Finest\nAll I wanna know is\n\n[Chorus]\nWhy this nigga steady savin his flows for me?\n(He wanna get paid)\nAnd why this nigga basin his whole life on challenging me?\n(He wanna get paid)\nFuckin with 56 Villain get you shota\nMidwest side will chase em down with a choppa\nMotherfucker thinking Teccanina gonna stopa\nSomething wrong with his medullah oblongota\n\n(Verse 3)\nYo, the fact is we both ain't made no real money\nAnd I'm blastin a nigga which makes the situation real funny\nI'm beginning to see real deal, scrill and real honeys\nAnd you don't wanna get with a nigga that's sick makes you a real dummy\nHe said I worship satan and he worship god that's why we can't work\nNigga that's a cop out, bout to make yo eyes pop out when I whip my cock out\nAnd say I seen you comin out of Roc house\nThis is the third round knockout\nWhen you die and all ya piss, cum, and feces drop out\nTellin motherfuckers we bit (Let's Get Fucked Up)\nFrom yo just locally hit (Bounce, Bounce, Bounce, Bounce)\nKnowin the shit that we spit (Make bitches wanna fuck)\nAnd make niggas get on they grit (And yo shit don't)\nWe officially bumped heads at the Lou Ou\nNiggas are through now\nWho growled at the Holy Temple Bandits Crew style\nNiggas are too foul\nSole and Tech, and you can bet you'll never see em wet\nYou sound like Chuck Rock, with a little bit of DMX\nNow I'ma end this by sayin Regime Life and 56 Vil\nSaid Tech rappin on that niggas payin for him and his kids meals\nI feel bad for the nigga, so I'ma let it out\nA gift from me to you, Ex-Cousin, Retalliate and go get breaded out...\n\n[Chorus]\nWhy this nigga steady savin his flows for me?\n(He wanna get paid)\nAnd why this nigga basin his whole life on challenging me?\n(He wanna get paid)\nFuckin with 56 Villain get you shota\nMidwest Side will chase him down with a choppa\nMotherfucker thinking Teccanina gonna stopa\nSomething wrong with his medullah oblongota\nFuckin with 56 Villain get you shot up\nMidwest side will chase him down with a choppa\nMotherfucker thinking Teccanina gonna stopa\nSomething wrong with his medullah oblongota\n(Outro)\nNIGGA\nA gift from me to you, this what you wanted, retalliate and go get yo bread\n(blows kiss)", "image": "https://images.genius.com/44b96a02c4ad68840aa7a37b7345ba30.1000x1000x1.jpg"}], "artist": "Tech N9ne"}