{"songs": [{"title": "Love is Crazy", "album": "Sick Boi", "year": "2008-06-05", "lyrics": "[Intro: Childish Gambino]\nYeah!\n\n[Hook: Childish Gambino]\nWe can go to Saturn, it doesn’t really matter\nWe can get there, we can do it if we try\nYou know that I love you, put no one else above you\nWe can get there, we can do it if we try\n\n[Verse 1: Childish Gambino]\nKnock, knock, it’s me\nI’mma take ya fine ass out to Applebee’s\nGet anything you want, this shit is free\nMy friend work here\nWhatcha mean, I ain’t romantic?\nI bought you flowers, so what they plastic?\nWe could fuck for hours, so what, I’m nasty?\nI ain’t got the roommate, that was my old place\nI’mma take you to the crib and show you the ‘O’ face\nYou make me feel like I’m back in the 5th grade\nHad a crush on Keana and she rocked the one braid\nAnd I thought that sex was when you touched a girl’s butt\nYou could get a girl pregnant, so look, but don’t touch\nI like you so much, I know it sound crazy\nBut I’d have a sex change just so I could have your baby\nThe roles are reversed, so you got a huge dick, and I got a Prada purse\nA nigga so sick, that my car’s a doctor\nTake a gamble on a nigga that your name was Proctor\nKick it in Chinese like you’re Shaolin soccer\nGot nothin’ but dinero, so you meetin’ the Fockers\nLook at my clock-ers, it’s time to roll out\nGet sneaks, sneaks, and sneaks, and they sold out\nThat’s what I’m all about and if you got the time\nIt’s hard to make change when you want one dime\n\n[Hook]\n\n[Verse 2: Eugene Cordero]\nWelcome back everyone to \"Pinoys in Space\"\nGot a new constellation for you to trace\nUse the far East star for your startin’ place\nYou see it? My big dipper's slappin’ you in the face\nStep out of the shed, let the sun be felt\nOn your head as you undo Orion’s belt\nOh nuts! I just crashed landed on the planet of the gay cliché\nTalkin’ Milky Way, bouquets, Broadway, bubblay and Michael Bublé\nSorry if I caught you off-guard with my five-second delay\nBut the jet-lag’s making me loopy and my sales are soupy\nSoupy Sales! I eat chocolate!\n\nWe can go to Saturn, it doesn’t really matter\nWe can get there, we can do it if we try\nYou know that I love you, put no one else above you\nWe can get there, we can do it if we try\n\nWe can go to Saturn, it doesn’t really matter\nWe can get there, we can do it if we try\nYou know that I love you, put no one else above you\nWe can get there, we can do it if we try\n\nI love you baby (I love you baby)\nI love you baby (I love you baby)\nI love you baby (I love you baby)\nI love you baby\n\nI love you baby (I love you baby)\nI love you baby (I love you baby)\nI love you baby (I love you baby)\nI love you baby\n\nI love you baby (I love you baby)\nI love you baby (I love you baby)\nI love you baby (I love you baby)\nI love you baby\n\nI love you baby\nI love you baby", "image": "https://images.genius.com/daedd4b19ad5d056f5ec69aae4af7839.500x500x1.jpg"}], "artist": "Childish Gambino"}