{"songs": [{"title": "Another Day", "album": null, "year": null, "lyrics": "Intro:\n(gangstas) let's spark up an idea, you know\n(gangstas) I don't know why you cats\n(gangstas) insist to get involved in our game man\nI mean, drug money, thug money, it's all funny money to me\nYou know scared money don't make no money man, so you know\n(gangstas) if you scared stay out of the game, baby\n\nVerse 1: kurupt\nAnother day, another dollar\nAnother nigga jacked for his sack, jeans, and them collars\nWhat the f**k makes life so complicated?\nWhy they playahatin, 'stead of congratulatin'\nOne of the homies just bought a new '64\nAnd they mad about it, and talkin bad about\nDon't trip 'cause you smoke dubs and he smokes ounces\nYour 'fo rolls and his 'fo bounces\nPlanted on the ground and this fool skyrockets\nGot a nigga hot enough to want to shake his pockets (all that shit)\nRoll like biggie, nigga, two Glock nines\nAny muthaf**ka whisperin about mine\nAll I got is, my twelve shottie\nI'm a gangsta nigga, kurupt young gotti\nMe and gonzoe and capone, with a chrome\nAnd a bone with a zone f**ked up gettin blown (yeah)\n\nChorus:\n(don't it feel good to survive another day)\nScared money don't make no money, (heyyyyy)\nCause uh, drug money, thug money's funny money, (and uh)\n(don't it feel good to survive another day)\n(check it out) this fear money don't take no money\n('cause uh), scared money don't make no money ('cause uh)\n\nVerse 2: capone\nNow I was standin alone against the cold world outside\nWithout no place to hide, or no will to survive\nThinkin who can I run to? basically\nIt was the big homie to go get the heat is what it come to\nI look around, from the gate I've been down\nBut I'm still broke as f**k, depressed and down\nSometimes I f**k around and wish I wasn't here today\nNow here to say sometimes it scares me to feel this way\nAin't there a name for this? ain't there a phrase that fits?\nAin't it called psycho, schizo, paranoia or some shit, trip?\nWith the mentality of a kid in the village of the damned\nWalking through the hood with a gun in my hands\n\nI had plans to be a superstar, rappin the rock\nBut all that stopped and dropped once the hammer was cocked\nI had to get out of dodge, I ain't tryina hide\nI'm just tryin to find a way to stay alive and survive, right (right)\n\nChorus:\n(don't it feel good to survive another day)\nScared money don't make no money, (heyyyyy)\nCause uh, drug money, thug money's funny money, (and uh)\n(don't it feel good to survive another day)\n(check this out) this fear money don't take no money, (whu? )\n('cause uh), scared money don't make no money, ('cause uh)\n\nVerse 3: gonzoe\nNigga gotta stay strong 'cause the weak die\nPlease God separate my life from the bad times, sufferin\nSurvivin ain't enough to cover it, 'cause I spend to much\nPlus I'm scrapin the tops of my pies to make crusts\nSo kurupt, nigga tell me how I'm 'sposed to feel\nNotice my attitude, drinkin, only smokin the real\nAnd it feels so good in the car with us\nLavishly, feel the extasy, bustin a nut\nAnother day, a nigga worship his weed and alize\nAnd the pussy I'm f**kin ? ? ? ?\nAnd ain't no scars on my daytons, my shit intact\nAnd that's real candy paint, all original lat'\nIt's so depressin, a thug with a hustle, no one messes\nAnd I'm destined I'm kissin my gun so you can bless it, nigga\nAnother day another dollar\nYeah nigga, it's me, gonzoe\nDon't act funny, haha\n\nOutro:\n(suprise) them promises didn't do nothing for me\n(suprise) it's time to set ourselves free\n(suprise) but as time marches on\n(suprise) the races grow strong, stronger than ajax\n(suprise) and niggas wanna be free, but they still watch tv\n(suprise), even though they can't see\n(suprise) and our chinese brothers don't cop no pleas\n(suprise), for they're into unity isn't that\n(suprise) the way we want to be? but the man\n(suprise) watches the music, 'cause the black people are confused\n(suprise) conquered and divided, tricked and undecided\n(suprise), and the good guys are there\n(suprise), with slugs (heyyyy) in the air but the rain still falls\n\n(suprise) and the (chorus) sun still rises and the man man\nMan is still full of trickies (suprise niggas)", "image": "https://images.genius.com/e051ff42cc180d489d4e1b4e3e2906cd.333x333x1.jpg"}], "artist": "Kurupt"}