{"songs": [{"title": "A.D.H.D.", "album": "L.A.U.S.D. Result", "year": "2013-10-17", "lyrics": "[Intro]\nIt's like I can't cooperate and stuff\nYes\nAnd I can't seem to do my work\nGo on\nAnd I just like laughing at people\nMhm it's interesting\nI guess it's just THE\n\n[Hook]\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\n\n[Verse 1]\nYo, ever since I been in school, teachers found a way to hate me\nNow they're saying that I got ADHD\nBitches don't blame me, it's your fault\nYou teachers are fuckin' boring, that's why I doze off\nI hate you fuckin' teachers, you all go for the fastest\nWhen I whip your asses for failing me in all my classes\nSo get ready! The bad kid is back bitch\nAnd I ain't doing schoolwork, I'm doing rap shit\nHopsin comin' after you, there's no way to stop him\nLAUSD don't do nothing but cause problems\nIf I ever get a chance to rob 'em\nI'ma just, fuck it next teacher I see I'll fuckin' sock him\nSo all you teachers better run for the border\nTryna tell me I got a fuckin' mental disorder\nThis goes out to every fuckin' teacher, I hate you\nI said it once and I'll say it again, I hate school\n\n[Hook]\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\n\n[Verse 2]\nNever in my life, did I think I would get it\nUntil the other day they told me, I was diagnosed wit' it\nFuck school it fucked up my life, it's time to quit it\nAnd I'll admit it, I never learned shit when I was in it\nLet me do whatever the fuck I wanna do\nI'll stab you in the head with a pencil, a number two\nIt's the ADHD, you can't tell what I'ma do\nI fuckin' mobbin' the school with straight bomb on you fools\nYou never answer my questions you pantomime\nAs a matter of fact bitches, fuck a Stanford-9\nWhy should I take it man, it's worthless\nThat's why every time I take it I always fail it on purpose\nLike I'ma waste my energy, tryna pass it\nJust hand me another test and see don't you get your ass kicked\nI'm not Batman, Spider Man or Heat-Man\nYou can just call me the ADHD man\n\n[Hook]\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\n\n[Verse 3]\nI wonder which one of my teachers even started this?\nTryna put me in the class, with all the retarded kids\nAnd I'm the only nigga up in there, I'm hard to miss\nI'm telling you man, one day I'ma just [?]\nAnd shoot it towards the teacher and crack his dome open\nBreak the locks in the door just so it won't open\nStomp his fuckin' face in until his nose broken\nI'm one hundred percent serious, no joking\nFuckin' teachers try to act like they reaching out\nThen they gon' talk about my ass in the teachers lounge\nI went up in there, went blasting every teacher found\nThey'll get they head bashed in 'til blood is leaking out\nEverything I did bad in class was intended\nSend me to the dean bitch, I wanna get suspended\nADHD, bitches I'm a lot smarter\nI'm just tryna make your motherfuckin' job harder\n\n[Hook]\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\n\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\nADHD, ADHD\nADHD, it's ADHD\nADHD, it's taking over me\nADHD-D-D\n\nHaha, yeah\nHopsin, listen\nI said it once and I'll say it again man\nAy yo fuck school!", "image": "https://www.google.com/url?sa=i&source=images&cd=&ved=2ahUKEwi59oLH-MrjAhVRfX0KHYb4AQMQjRx6BAgBEAU&url=https://www.datpiff.com/Hopsin-Lausd-Result-mixtape.701532.html&psig=AOvVaw2967Z3UD-DuDne-y9NhF2o&ust=1563967890886427"}], "artist": "Hopsin"}