{"songs": [{"title": "Thank You", "album": "E.L.E. (Extinction Level Event) 2: End of the World ", "year": "2013-11-06", "lyrics": "[Intro: Lil Wayne]\nWoo! Welcome to the bank\nWhere you deposit Young Money\nAnd, and you get Cash Money\nI'm Tunechi the boss\nAnd live from the vault, is Busta Buss\n\n[Verse 1: Busta Rhymes]\nYeah, yeah, yeah, yo\nSwag mania, pop that goes most, carry the most\nBeautiful bitches with us happily toast\nKeep the faculty close, gross when we give them a dose\nGot them OD-ing, leaning in each Coast\nScenery froze, take notes, rock Rolls, diamonds that fit us\nChanel minks in the winter, who fucking with us?\nWe coming to give them the shivers, watery flows spilling like rivers\nFlooding the street, hoping niggas swimming is moving gorillas\nKing Kongs, Godzillas when we roll up\nSeat filling niggas, get up when we show up\n\n[Verse 2: Q-Tip]\nUhh, shit\nPlease don't throw up, hold your liquor, grow up\nIf you robbing niggas, we gon' show you how to blow up\nThank your lucky stars it's the Rap Czar, tuck your shit in\nMy niggas bite like Rin Tin Tin, my chagrin\nYou never win, model thin, walking crack in your shin\nShe gives in every time that I spin\nSquare up, bow down to the kings of the hall\nWe wade on, talk shit while we ball so what's cracking with y'all?\n\n[Verse 3: Busta Rhymes]\nNative New Yorker, the slick talker keeps it in order\nCall the reporter, stepping like British walkers\nLegendary swag flu and see the influence, just see how we do it\nGet them into it steadily, God I'm stupid, so undisputed\nAct fool, back tool until they pop off\nPolice crowd up the street, blocking them off, locking them off\nGot these niggas wilding while I signal my soldiers\nBossing it up, maintaining composure, stand on the sofa\nThirty bottles, twenty waitresses, bring them over\nSee how we light up shit, nigga, call the promoter\nAnd tell that nigga bring the bag, better hurry up with it\nAnd count the money up proper, cause you can get it!\n\n[Hook: Alicia Myers & Kanye West]\nI want to thank You, Heavenly Father\nYeah, it feel good, don't it? Uhh\nFor shining Your light on me\nIt feel good, don't it? Uhh\nI want to thank You, Heavenly Father\nAy, I want to let y'all know\nAy, ay, I want to let y'all know, this Yeezy\nFor shining Your light on me\nAnd you listening to Q-Tip\n\n[Verse 4: Q-Tip]\nSettle up, stiletto up, saddle up and let's go\nGood times, only difference, niggas making it though\nChatter is up, peep the way we batter it up\nOn top of the mountain, folding the ladder up\nYou dead and done, rip up your paper 'cause your status is none\nTransfixed on the strengths of the page, whether chopper or gauge\nYou're just a single cause you wouldn't engage\nTurnt up with the script on the cup, you keep the goblets with us\n\n[Verse 5: Busta Rhymes]\nSee how we push sometimes a man fi get kuff?\nBeat him in the head, boop-be-de-de-boff, zippity-boof\nBeat him in the head again, \"Stop killing me, wolf\"\nWhop, beat a nigga till he drop, piggity-poof\nOxy in me pulse, he don't want no problem with niggas\nFuck it, let's get to drinking, poison our livers\nDammit we sinners, when me and Abstract together, see we deliver\nShe got me touching it, fucking on all my fingers\nDammit we winners, pillar of this rap shit, homie they know\nKill everything until it's time for me to go\nThat's when I bomb it with a blow and then I black and get a little bit dummy\nThe microphone is bleeding, you should take it from me\n\n[Verse 6: Q-Tip]\nIncredibly we do it and it resonates the music, iTune it, YouTube it\nIt could never ever be refuted\nIt's gnarly for niggas and naughty for ninas, bitches and ballerinas\nBallers and in-betweeners, blatant nonbelievers and overachievers\nKicking it in Pele Adidas, drink Alizé liters\nAll of you must reconcile a leader\nShe's begging to eat us and her man's attitude defeat us\nBut never a scandal because me and Bus, we're prone to handle\nWe're gentlemen\n\n[Verse 7: Busta Rhymes]\nNot to mention, we're veterans, second, he need some medicine\nBefore I black as he get off my premises\nBetter fly, you pelican, idiot ass niggas but then again\nYou need a suit for your funeral measurements\nSee me doing it effortless, it's never getting no better than this\nGiving your shit to convince a better preference\nWatch me turn them to skeletons, see how I come and bring out the betterness?\nTime is with it, I rep the foreverness\nFlying United Emirates, sized private plane, that kind of etiquette\nPurchasing diamonds, handle them delicate\nNow you need you a better ref\nYou could peep us regulating, see we all in this bitch like we ain't never left\n\n[Hook: Alicia Myers]\nI want to thank You, Heavenly Father\nFor shining Your light on me\nI want to thank You, Heavenly Father\nFor shining Your light on me\nI know it couldn't have happened without You\nOoh-ooh, without You\nOoohh, without You\nOoohh, without You", "image": "https://images.genius.com/a9f77bd244cc75a464a7bd98fed6485e.700x700x1.jpg"}], "artist": "Busta Rhymes"}