{"songs": [{"title": "The Star Room // Killin’ Time (Live)", "album": "Live From Space", "year": "2013-12-17", "lyrics": "[Part 1: The Star Room]\n\n[Intro: Mac Miller]\nThis next song right here is called the Star Room\nIts how i open up my album, man\nYeah eah ah ah, ah ah ah ah ah ah ah ah\nThis song is the moment you stop lying to yourself, alright?\n\nHallelujah, thank God I have a future\nPrayin’ I don’t waste it gettin’ faded\nCause I’m smokin backwoods till I’m coughin’ up tar\nThrough the surge, energy curve like a lumbar\nI don’t act hard, I still read Babar\nTrippin’ out, lookin’ at a bunch of Google map stars\nThey got a app for that\n\n[Verse 1: Mac Miller]\nBut me, I’m still trapped inside my head, it kinda feel like it’s a purgatory\nSo polite and white, but I got family who would murder for me\nThink I’m living paradise, so would I have to worry ’bout?\nDealing with these demons, feel the pressure, find the perfect style\nMaking sure my mom and dad are still somewhat in love\nAll these backfires of my experiments with drugs\nAnd I experience the touch of my epiphany in color form\nThe difference between love and war inform me – I’m above the norm\nBut, give me anybody though\nI’ll gladly chew his face off, them bath salts\nRhyming like it’s summertime on asphalt, hot\nHaven’t picked a major label, think I’m blackballed\nI still don’t got the heart to pick my phone up when my dad calls\nWill he recognize his son when he hears my voice?\nI put this music against my life, I think I fear the choice\nAnd I don’t know what I’m running from, but I’m running still\nI conversate with acquaintances, but it’s nothing real\nI’m from a city that you hear and think a bunch of steel\nSo a hundred mills wouldn’t make me sign a fucking deal\nMoney kills, that’s the truth, it’s called the root of evil\nBut I want that Rolls Royce that the homie Lennon drove\nSo, if you ain’t talkin’ bout some money I’mma send you home\nUnconventional, special but unprofessional\nAdolescent expression that’s letting me meet these centerfolds\nAs troubles fill my mind capacity, I let them go\nIf I was Johnny Depp in Blow, I would let it snow\nThat’s just me all wilding out and being extra, though\n\n[Interlude: Mac Miller]\nI wonder if I lost my way\nI wonder if i lost my wa-ay\nDid I lose my wa-a-a--a-ay?\nMy wa-ay\nDid I lose my way?\nMy way, yeah\nAye, uh come on, come on, come on, come on\nS-San Diego, come on, come on\nSo can you feel it?\nSaid, can you feel it?\nSaid, can you feel it?!\nLet's Go!\nWoo!\n\nSan Diego, California. We gon' start this one like this:\n\n[Part 2: Killin’ Time]\n\n[Verse 1: Mac Miller]\nSaid, I’m posing a question\nHow many been empty and holding aggression?\nClose to depression, open your eyes and just focus a second\nFuck a reccession my brother\nMy mind is my weapon I’m letting it go\nKnow that I’m pointing at negative energy, telling me stop\nThey’re telling me no\nYour aura is something you ain’t even sure of\nExplore the core of California, hoes got more to snort up\nI’ve had a smorgasbord pornographic thought\nThat’s a lot, the feeling come after the shock\nPraise me I’d rather you not, cause\nIt’s driving me crazy\nThe fact that you pay to make me into something I love\nYou come to the club searching for drugs, drunk\nFucking these sluts\nGod loves me, what if he does, what does it mean?\nYou’re wasting away doing nothing, you’re fronting\nWhy ain’t you chasing your dreams?\nWe wonder ’bout life but none of us willing to learn\nThe money we earn is something to burn\nWhy won’t they give me a turn–out?\nFeed the hungry and clothe the naked\nYou’re mistaken the world is cold and it’s lonely ain’t it\nWhen ‘em high roller homes in Vegas\nRaid them with some home invasions\nContaminating the place with plague, we just saved the day\nI waste away in a room spitting these raps\nYahweh put the world in my hands and I’m giving it back, Tay\n\n[Hook: Tay Walker]\nIt's a gift\nOur, our time to be alive\nNo earthly vehicle\nCan contain this drive\nIt's a gift\nOur, our time to be alive\nNo earthly vehicle\nCan contain this drive\n\n[Verse 2: Mac Miller]\nOkay, forfeit in the war, he lays a sword down and walks away\nGrabs a 40 from the corner store and begins to contemplate\nDealing with death like you work in the morgue observing the souls\nForgotten, he lost his way\nStarring down that barrel, thinking not today\nLife’s so precious, said Lord knows life is so precious\nFight to the death, til’ there’s nobody left\nYou’re holding your breath because you might get infected\nMinimalistic, instinctively thinking of getting ballistic\nBe specific, to those in control we all statistics\nMisogynistic with a twisted mind, I’m intertwined\nMy trigger finger itching, all I kill is time (*gunshot*)\nInitial symptoms is schizophrenic behavior\nThe mind is like religion, can’t agree on who’s its savior\nThe newest flavor of superhero, I’m shooting lasers\nExcept I’m cool with Vader\nAnd blowing up rooms that’s full of strangers\nA news anchor, the youth can relate to, it’s nature\nIf you a hater, I’ll deal with you later, no thank you\nI’m just your neighbor, please don’t do me no favors\nSaid, really doe, come on homie we major\nI waste away in this room spitting out raps\nYahweh put the world in my hands and I’m giving it back, Tay\n\n[Hook: Tay Walker]\nIt's a gift\nOur, our time to be alive\nNo earthly vehicle\nCan contain this drive\nIt's a gift\nOur, our time to be alive\nNo earthly vehicle\nCan contain this drive\n\n[Outro: Mac Miller]\nOne, two, one two, three everybody put your hands up!\nGet em up, so put your hands up!\nGet em up, so get em up!", "image": "https://images.genius.com/db53bad96e691f9ab9aec5c0405e2fc5.375x375x1.jpg"}], "artist": "Mac Miller"}