{"songs": [{"title": "Let Da Monkey Out", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "[Redman]\nWhat you know about it? (4X)\nA-what you know about it?\n\nYo.. get it right from jump\nDoc tape been on debate for months\nI got zits on your face that can't wait to bump\nBoogie Down to the point I barricade the Bronx\nPapi spins the rhymes through your opti-lens, check it\nIt's five below, my brain is cold\nRunny nose evey time Doc exchange a blow\nMy street team snipe the block up like Rob Lowe\nBodega liquor store, I'm dead in the window\nPPP symbol got FBI on lookout\nStrip the dirty clothes, hit a 118 cookout\nI woof out, son you better buckle in\nI write the madness, got ink foamin at the pen\nI tear a ligament when I spit it in the wind\nI got so much game I can Con Edison\nYeah chicken stand by for exposure\nShut your house down foreclosure ya in cold blood\n(Yo cuz) Shut the power out in your house\nCut the phone put a sock in your mouth, let da monkey out\n\nYo let da monkeys out\nShow them fools what it's all about\nHolla out, hear me out\n\nSay, oooh ooh ahh ahh ahh, yo yo (2X)\n\nYo let da monkeys out\nShow them fools what it's all about\nHolla out, hear me out\n\nSay, oooh ooh ahh ahh ahh, yo yo (2X)\nY'all motherfuckers ain't ready\n\nIs Redman in the house? (One time)\nForm a line, jack ya, then pawn the shine\nStay there, runnin with more kids than daycare\nOne shot prove it ain't nuttin but weight here\nWhen he lands flat I'm the minivan\nWith Lil' Cease, runnin cities like Geechie Dan\nWhen Richie Cunningham was Opie I was low-key\nAiring niggas that was more square than my gold teeth\nMy appetite for destruction is to hustle\nAll the cottonmouth'll turnbuckle when I rustle\nMr. Tough Guy on the side, I fuck him up too\nSlam him, when I bark I marked his Buchanan\n\nYo, New York niggas in the house?\nYo yo yo.. is Jersey niggas in the house?\nYo yo, I hold fort with a quart of Olde E from Newark\nI tell lies under oath if it please the court\nSupreme force, in the swamps with the green moss\nBug repellant suit, bustin machines off\nI'm Danny Roman with the forty-four blazin in\nNo negotiator, yo not even Chris Sabian\nCan save your life -- Doc'll creep in the house\nYo cut the phones, put a sock in your mouth\nLet da monkey out\n\nYo let da monkeys out\nShow them fools what it's all about\nHolla out, hear me out\n\nSay, oooh ooh ahh ahh ahh, yo yo (2X)\n\nYo let da monkeys out\nShow them fools what it's all about\nHolla out, hear me out\n\nSay, oooh ooh ahh ahh ahh, yo yo (2X)\n\nYo let da monkeys out\nShow them fools what it's all about\nHolla out..\n\nSay, oooh ooh ahh ahh ahh, yo yo (2X)\n\nYo let da monkeys out\nShow them fools what it's all about\nHolla out.. yo\n\nSay, oooh ooh ahh ahh ahh, yo yo (2X)\n\nYo, haha, 199motherfuckin9 niggas\nBrick City comin thru\nIf you don't know this is Dr. Trevis\nAin't shit changed motherfucker\nPack your own heat, supply your own motherfuckin ammo nigga\nPPP comin thru, this is Dr. Trevis\nBitch asses", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}