{"songs": [{"title": "Dirty Dirty", "album": "Osirus", "year": "2005-01-04", "lyrics": "[Ol' Dirty Bastard]\nTwo steps from the border line\nAnything closer will kiss the nine\nThink I'm out the game? You out of your mind\nCuz I stay on track, like transit line\nKeep it nappy or braided up\nDirty in the cockpit, blazin' up\nStop frontin' when you made it up\nTellin' all my hoes, you can't spray it up\nHah, huggin' nuts like tighty whites\nStill trickin' on hoes like Heidi Fleiss\nYou know why niggas don't give you much respect\nCuz they seen you gettin' slapped with the empty gat\nKnow Dirt, like bow know death\nWhen I'm huntin' down, birds of rap\nHate Dog, cuz I ate your cat\nAnd you can eat my ass and have a coke with that\nUse a spoon, unless you want a fork\nPull my dick out, watch the room get dark\nStay high with the zombie walk\nGotta sit my ass down, like Rosa Parks\n\n[Hook 2X: high pitched female (Ol' Dirty Bastard)]\nDirty Dirty, you tell me how you do it\nIt look so easy, like there was nothin' to it\nBut they don't understand, about the Dirty M.C\nIt's the.... (Ohhhhhhhhhh), new track by ODB\n\n[Rhymefest]\nThey say dirt and sunshine make the flowers grow\nI say, fuck a bitch raw and drive your nut on the floor\nCall it what you want, you son of a ho\nI was 5 percent til' white bitches came and dropped it down to four\n3, 2, 1, I can lick the sun with my tongue\nPull it out and smack a nigga, just for thinkin' I'm done\nShut your trap, razor blade cut your wrap\nFat girls seen me comin', started tuckin' their flab\nRhymefest and Dirt Dog, gon' spark this\nThe day he got to heaven, track mud on the carpets\nHot like the hot potato, you niggas ain't macho\nYou hot as gazpacho\nGo to the show, for hot dogs and nacho's\nThis me and Dirt Dog's style, it's not yours\n\n[Chorus 2X}\n\n[Ol' Dirty Bastard]\nWhat can make a ho, look more cuter\nHennessey shots, or smoke more Buddha?\n\n[Rhymefest]\nI don't know Dirt, now she look like Zab Judah\nTest my manhood, go get my dick ruler\n\n[Ol' Dirty Bastard]\nNow you hungry, wanna eat right through her\nBut you better first track for a noter\nLike does she have a best friend, or a daughter\nHas she ever tried fuckin' under water\n\n[Rhymefest]\nDown down with the fishes, deep sea dishes\nI ain't a genie, bitch, I don't respect your wishes\nThis trick ain't fuckin' me though, god damn\nSomething very wrong, I don't understand\n\n[Ol' Dirty Bastard]\nMisinterpetate, let me break it down\nTwo pulls make the your merry go round\nTouch your toes, show me that rose\nButt naked, in a Wu-Tang pose\nWide open, girl, everything goes\nReal freaky, when you powder that nose\n\n[Rhymefest]\nKeep it and move, I sleep in the nude\nI'm keepin' it rude, pull out my dick and pee in the food\nOn the way to the stars, don, where's the map?\nWe fuckin' there, and we gonna fuck back\n\n[Hook 2X]\n\n[Outro: Rhymefest]\nYeah, Dirt Dog, Rhymefest, you want it, man\nRest in peace, I know you heaven right now\nTrackin' mud on the carpet, so, we gon' let ya\nDo what you do it's the ohhhhhhh\nDon't forget the crew, it's the Wuuuuuu\nI thought you knew, it's the Ol' Dirt Dog\nRhymefest, yeah yeah, from now to 3000, man\nWhat's rap with Dirty? What's the world without Dirt?\nJust a bunch of fuckin' water, ohhhhhhhhh\nWe out....", "image": "https://images.genius.com/4250840e6d0ec82feb74e42c448c72d7.455x455x1.jpg"}], "artist": "Ol’ Dirty Bastard"}