{"songs": [{"title": "Baruch College Session", "album": null, "year": "1997-01-01", "lyrics": "Bust it\nThe final problem is solved by throwin' sulfuric acid all over your back to see your spinal column dissolve\nDroppin' bodies like it was domino season\nMy phenomenal legion will shoot out\nYour fuckin' abdominal region\nSlim Shady, responsible for your permanent stillness\nJust escaped from the hospital with terminal illness\nItchin' to rip your fuckin' frame out\nCuz I ain't got nothing to lose\nLike that movie that just came out\nCallin' your name out, first, last and your middle initial\nYour mom, your dad, and your pregnant widow will miss you\nAnd anybody else poppin' some shit'll go witchu\nCuz I ain't tryna hear it like a political issue\nSo until I can leave with enough funds\nI'mma shove guns up in the mouths of your loved ones\nDrown 'em face down in the bath while the tub runs\nGot a rap sheet that's longer than Tubby's sub buns\n\n\nAnd I'mma kill it, just so y'all think\nThat I can't come of the top\nAnd I be forced to rock unorthodox styles\nFrom off the top of the dome\nWith a popular poem, forget a damn team\nI can stop you alone\nRapper's thinking they putting out\nThey records cause they sell\nBut that can't fuck with what me, we doing here with AL\nY'all don't wanna do it, when we kick it\nWhen we kick the fluid\nRappers don't wanna get into it, Y'all knew it\nCause the feds want me, they headhunt me, I'm Ted Bundy\nI ain't dead, I just fled country\nSaid bluntly, a cannibal, animal, fed monthly\nEating bread crunchy, cement bed's comfy\nHead's lumpy, funky like a dead skunk be\nMed flunkie, jump off cliffs with thread bungee\nWearing red undees and a black cape\nRollin' through the hood cracked out\nBumpin' your whack tape\nI'm coming through dumpin'\nChange your rap name to Richard Jewell\nCause you ain't blowing up nothing\nI'm showing up puffin', throwing up drinkin'\nKilling brain cells till I'm slowing up thinking\nGrowing up stinkin', born with bad odor\nGimme Hennessey but please don't add soda\nNow who's doper? You couldn't beat me when I'm sober\nI'm off my fuckin' rocker like your Grandma tipping over\nSlim Shady\n\n\n\"Son, where you from son?\"\n\"Yo, I'm from Detroit city\"\n\"Uh huh\"\n\"I'm bout to do a little something like this\nA little something like this.\"\n\"Ok, drop that shit.\"\n\"Bust it, bust it\"\n\nYo, I hang with a bunch of hippies\nAnd wacky tobacco planters\nWho swallow lit roaches and light up like jack-o-lanterns\nOutsidaz baby, and we suin' the courts\nCause we dope as fuck and only get a two in the Source\nYo, they never shoulda booted me outta reform school\nDeformed fool, taking a shit in a warm pool\nTill they threw me out the Ramada Inn\nI said it wasn't me, I got a twin\n(Oh my God, it's you! Not again!)\nIt all started when my mother took my bike away\nCause I murdered my guinea pig\nAnd stuck him in the microwave\nAfter that, it was straight to the forty ouncers\nSlappin' teachers and jackin' off in front of my counselors\nClass clown freshman, dressed like Les Nessman\nForget the next lesson, I'll pass the test guessin'\nAnd all the other kids said \"Eminem is a thizz head\nHe'll never last, the only class he'll ever pass is phys-ed\"\nMaybe true, 'til I told this girl in gym class\nThat she was too fat to swim laps she need a Slim Fast\n(Who? Me?) Yeah, girl you so big\nYou stepped, walked into Vic Tanny's\nAnd stepped on Jenny Craig\nShe picked me up to snap me like a skinny twig\nPut me in a headlock, then I thought of my guinea pig\nI felt the evilness and started transformin'\nIt began stormin', I heard a bunch of cheerin' fans swarmin'\nPicked that bitch by her hair, drug her across the ground\nAnd threw her up to the highest\nDiving board to toss her down\nSorry coach, it's too late to tell me stop\nWhile I drop this girl face down and watch her belly flop, cause it's like that\nAnd I come in and I start wildin' and shit\nThen I be busting a lyric\nAnd rappers don't believe I'm freestyling it\nWell here it goes when I'm kicking lyrical flows\nFrom your head to your toes\nSo that every rapper in this place knows\nCause when it comes to the freestyle\nComing off of the top of the dome\nI'm knocking your mouth and ya off, so who you copying off?\nStop being soft, I'm standing on top of your loft\nKilling you off slowly, like Roberta Flack\nI've never heard of wack\nMCs that try to step to me, I'll break your verta-back\nOr vertebrae, increase the murder rates\nIn 79 states... Yo, check it\nI'm bout to pass the mic to the next\nMC who wanna step up and flex\nWith the techs, but make sure your shit is fresh\nCome on, wreck it, who wanna be next?\n\n\nIt goes like this:\nBroke the rubber, busted a nut up in your mother\nSo how do you feel about having another little brother\nNasty motherfucker, talking trash like a trucker\nSnatch your bitch up out your track\nI'll smack her up and fucked her\nAlways talk shit high, smoking chocolate Thai\nSo y'all can die, just for walking by giving an awkward eye\nI've lost my motherfucking marbles\nSmelling like a brewery\nDroolin' at the way your jewelery sparkles\nHead full of charcoal, smoked out brain particles\nBurning holes in clothes articles\nA retarded fool since I started school\nBurned the weed before I learned to read, disregarded rules\nSkip the classes to blaze the blunt ashes\nKissing front dashes from smashing up\nCars like stunt crashes\nHall passes for restrooms, chewing mushrooms\nDoing rush fumes in the lunch room\nLooking nervous, liquor in my thermos\nHung with hermits that carry guns without permits\nStaring at the bitch with firm tits\nJacking off, aiming straight for both lips when my sperm spits\n\n\nSet it off\nRappers get beheaded if they soft\nYo they get they wires crossed\nRappers try to step to me but I'm so ill I'll fire your boss\nAnd this is all freestyle, killing it\nWhile I'm filling it with adrenaline, rappers be feeling it\nLike it was braille, so y'all can touch me anywhere\nCause I want you to feel me,\nRappers wanna kill me, but they don't thrill me\nSo check it, I'm bout to wreck when I make the record\nCause I'm, skinny like an anorexic girl headed for the exit\nRunning butt naked away from just being date raped\nRappers? I twist 'em into a great shape\nAnd throw 'em in the Great Lakes\n'Cause I'm from the Michigan state\nFor fishermans' sake, I throw 'em and toss 'em in\nRappers try to step to me\nBut this is the Holocaust and you'll never win\nCause I've forever been bent, forever demented\nRappers try to step to me but their shit is sweet-scented\nAnd I'm demented, and if I said it I meant it\nKillin' any MC cause I'm Infinite, and when it\nComes to the way that I'm spittin' lyrical infinite ammunition\nAnd putting a clip in this lyrical track that I just be rippin'\nCrushing it, killing it, taking your best line and hushing it\nTaking your shit and flushing it down the toilet\nTaking your biggest plot and foil it\nRappers can't uncoil it, I'll take my shit and aluminum foil it\nThen throw it in the microwave and watch burn up\n'Cause I'mma blow up\nRappers? I make 'em ill enough to throw up\nDon't show up if you come to the battle\n\n\n\"Can I speed it up? Just a little bit?\nAlright that's cool. Alright\nBust it, bust it, bust it, bust it, bust it\nThis one for Quest.\"\n\nSome people say I'm strange, I tell them ain't shit changed\nI'm still the same lame asshole with a different name\nCame late to the last show with a different dame\nBrain ate from the last O' that I sniffed of 'caine\nYou know you're spaced the fuck out like George Lucas\nWhen your puke is turning to yellowish-orange mucus\nSo when I grab a pencil and squeeze it between fingers\nI'm not a rapper, I'm a demon who speaks English\nFreak genius, too extreme for the weak and squeamish\nBurn you alive till you screaming to be extinguished\nCause when I drop the science\nMotherfuckers tell me to stop the violence\nStart a fire and block the hydrants\nI'm just a mean person, you never seen worse than\nSo when Slim gets this M-16 bursting\nYou getting spun backwards\nLike every word of obscene cursing\nOn the B-side of my first single with the clean version\nStopping your short life while you're still a teen virgin\nUnless you get a kidney specialist and a spleen surgeon\nIn the best hospital possible for emergency surgery\nTo try to stop the blood from your\nRuptured sternum internally\nI'll take it back before we knew each other's name\nRun in the hospital and snatch you out your mother's frame\nI'll take it further back than that\nBack to Lovers' lane, to the night you were thought of, and\nCock block your father's game\nI'll plead the fifth like my jaws were muzzled\nSo suck my dick while I take a shit\nAnd do this crossword puzzle\nAnd when I'm down with ten seconds left in the whole bout\nI'mma no a head-butt so hard, I knock us both out\nNo doubt", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}