{"songs": [{"title": "All Right", "album": "Adventures in Emceein", "year": null, "lyrics": "[KRS-One]\nGather round, I want to tell y'all a story\nSee if you can get the meaning\nWe gonna go real far (all right)\nWatch this (God, you alright)\n\nI'm steppin' in this place like it's all right\nI got my partners with me, yep we feelin' all right\nI got my woman with me, yup she lookin' all right\nWhen it's time to move I'm never left, I'm all right\n\nWell, I met my man \"What up Duke?\" - \"I'm all right\"\nHe said \"Listen to this\", I said \"All right\"\nHe said \"This strictly confidential\", I said \"All right\"\nHe said \"Yo, you like this spot?\" I said \"It's all right\"\n\"You wanna change it?\", I said \"All right\"\n\"I got a way that we can purchase it in 30 days\" - \"All right\"\n\"How we gon do that?\" He said \"All right\"\nHe put a stack of hundreds on the table right there, I said \"All right\"\n\n30 days later we all right\nLimousines, elevators, yo things are lookin' all right\nAll night everybody feelin' all right\nI told my man \"I gotta go\", he said \"All right\"\n\"Let me take your Jeep\", he said \"All right\"\nBut just as I started the car it got all bright\nI started liftin' up, felt my spirit driftin' up\nWhat's goin' on? The Jeep is gone and everything's all white\nI heard people sayin' \"Is he all right?\"\nFloatin' above my body I felt all right\nHow can I tell 'em, really tell 'em, that I'm all right?\nStandin' outside my cerebellum I'm all right\nThe fourth dimension is all right\nThe fifth dimension is sure right\nThe sixth dimension is all light\nLivin' as a spirit is all right\nBut then I didn't feel all right\n\nI felt the shock in my chest, it wasn't all right\nThey revivin' me - all right\nI heard a paramedic say to someone \"Yep, he gonna be all right\"\nI'm back alive, people askin' \"Are you all right?\"\n\"The Jeep exploded. It's a miracle you all right\"\nLayin' there on my back, strapped up all night\nI smirked and said to myself \"God, you all right\"\n\"Ha, you all right\"\n\"Yes, God, you all right\"", "image": "https://images.genius.com/ad42a510e6be3523569fba6178f6bcf5.419x382x1.jpg"}], "artist": "KRS-One"}