{"songs": [{"title": "The Girl", "album": null, "year": null, "lyrics": "[Verse 1]\nGirl I make you come fast, I mean come right over\nYes a nigga so street, call a nigga Grover\nHit it like I'm supposed to, love it when you're smiling\nExcept when you're not smiling giving my dick oral hygene\nGirlfriend you know me, I'm all about my benjamins\nBut you stay sweet like an ever-lasting entenmann\nGirfriend center them geniuses, that's me\nTalking bout in and out with a girl named Ashley\nJessica, Tamika, Alison, Stacy\nWhy does every girl in the world wanna date me?\nSpecially right now man, specially when I'm busy\nTell me that they love me, then they try to kiss me\nBaby don't you see me? Knee-deep in that dope game\nMeaning that I'm dope mane, hotter than that propane\nHotter than that propane, yes I said it twice dude\nAlways on the move I love the Journey like a white dude\nYes I know I'm quite rude, arrogant as Alva\nBut I have the decency to back all of my words up\nSo let's not pretend like every girl don't wanna be ya\nYou can be my Ms. Obama minus Sasha and Maliya ugh!\n\n[Hook]\nYou make me feel, feel so shiny and new\nLike I'll never be blue again\nAnd the magic moment feels so right\nI wanna spend the rest of my life with you oooh!\n\n[Verse 2]\nWhy you always mad at me, I was gon come right back\nFucking with them fly girls, that was only chit chat\nIt's part of my job, yes I'm young and charming\nAnd I smell like money so these girls are all up on me\nLet's have bygones be bygones, they don't know what they're doing like a cylon\nTrying to get my python, you can check my iPhone\nRolodex Gchat\nWhen you come over all I ask is \"Where my V at?\"\nLike I work at ABC, look at me rambling\nYou can be a pimp, these girls making money but they'll never make sense\nHalf of yall crazy, the other half trying to get their paper having babies\nNaw I ain't down with that \"Hooohh!\" like a thundercat\nTry to poke holes in the base where I keep soldiers at\nSneaky like a Cheshire cat, sneaky like a baby sneaker\nOne of these girls got my number I ain't trying to meet her\nYes you are fine Anita, but I ain't trying to be the\nFather of five you need to find a new guy or either\nStep it up 2, but you are not Cassie\nCause you have full head, I mean you're smart nasty\n\n[Hook]\n\nOoohhh girl (x4)", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}