{"songs": [{"title": "The Juice", "album": "1992", "year": "2016-10-14", "lyrics": "[Hook: Lorine Chia]\nYou got the juice now, baby, you got the juice\nYou got the juice now, baby, you got the- you got the juice\nYou got the juice now, baby\n\n[Verse 1: Game and Lorine Chia]\nIt been ten years since you heard from niggas from the West side\nNow we on the cover of the Vibe\nA nigga shot me five times, I'm happy to be alive\nAnd my mama told me, \"You got the juice now, baby\"\nMy first album went five times plat'\nLookin' for California, it was on my back\nI was 23 when I had my first kid\nAnd his mama told him when he came out\n\"You got the juice\" Like father, like son, uh\nTop down, Mercedes throttle\nWrist lookin' like a nigga just played the lotto\nI am to Compton what Ye is to Pablo\nRun up on the car, just spray with hollows\nI grew up in the six-trey Impala\nAin't make the league but I made the dollars\nRecordin' my demo, knew Dre will follow\nRemember, Eve told me\n\n[Hook: Lorine Chia]\n\"You got the juice now, baby, you got the juice\nYou got the juice now, baby, you got the- you got the juice\nYou got the juice now, baby\"\n\n[Verse 2: Game and Lorine Chia]\nLeft the Unit and the world went cray\nI blame it on the California mindstate\nToo much weed, weather, women, chronic seeds, ass, titties\nCan a nigga pour his Henny?\nWithout niggas actin' fake in his motherfuckin' face one time\n'Fore I pull the .40 up out the waist line\nI'm the first Compton nigga Dr. Dre signed\nAnd Mary J. told me at Baseline: \"You got the juice now, baby\"\nThen my second album went plat' too\nAnd it was thug life with this Eazy tattoo\nBut I never forgot where I came from\nOr where I got my name from, my grandma told me\n\"You got the juice now, baby,\" and here's something I can't forget\nMy mama brought a nigga up on that L.A. gangster shit\nYour boy ain't never gonna change, mama\nHere's some change, mama, and a Range, mama\nShe looked back and said\n\n[Hook: Lorine Chia]\n\"You got the juice now, baby, you got the juice\nYou got the juice now, baby, you got the juice\nYou got the juice now, baby, you got the- you got the juice\nYou got the juice now, baby\"\n\n[Outro: Lorine Chia]\nSo much pressure applied, all this pressure applied\nPray this pressure applied to our lives\nFeels like we gon' bust, feels like we gon' bust\nOver gestures you die, ain't no question that I'm\nTryna make it out alive but sometimes\nFeels like I'm gon' bust, feels like I'm gon' bust\nFeels like I'm gon' bust, yeah\nFeels like I'm gon' bust, oh\nSo much pressure applied, all this pressure, I'm fly\nGreatest pressure, applied to our lives\nWe gon' bust, we gon' bust", "image": "https://images.genius.com/5470139be6822474317a28c8796fb0da.1000x1000x1.jpg"}], "artist": "The Game"}