{"songs": [{"title": "Fire", "album": "Undisputed", "year": "2012-09-11", "lyrics": "[Intro: DMX]\nUh, uh, uh, uh, grrrrr\nGrrrrrr, WHAT!\nUh, uh, uh, uh, uh\n\n[Verse 1: DMX]\nI love music cause it's somethin special\nI just have the words and when I'm done, I bet you\nIt'll make you easier to cope with the pressure\nIn dark, cause you think the light won't let ya\nRight now all I see is shapes and sounds\nYou snake you clown that's why I shake you down\nGot somethin I want, I'ma take it now\nIt is what it is, you cryin like \"How I'ma make it now?\"\nGet the FUCK off your knees, I don't swing like that!\nCause when I let it go I let it go, I throw that thing right back\nMan, I can smell pussy from a mile away\nNigga yo' style is shade so, put the smile away\nNiggas actin like I'm the only one with problems\nYou know somethin I don't? Fuck it, let's solve 'em\nAnd at my worst you not even HALF of me\nWhich is one reason why you'll always be AFTER me\nFAGGOT!\n\n[Interlude: Kashmir]\nOh my God!\nNo matter how hard I try I just can't get away from it\nI got so much fire built up inside of me\nBut when it's time to let it go\nI got one thing to give and one thing only\nYO DOG!\n\n[Verse 2: Kashmir]\nHot bars is the only thing these muh'fuckers gettin\nIt's time to show these niggas Dog ain't raised a fuckin kitten\nEat twenty niggas like a 20-piece bucket of chicken\nAin't on my level snowflake, who the fuck is you kiddin?\nThe hottest chick in the game is what I am still\nFire hot enough to burn your whole entire grill\nAnd believe me, them third-degree burns are hard to heal\nI'll have you wishin you liestened to Fire Marshal Bill\nYou can't take the fire that I'm bringin y'all\nI'll have yo' ass beggin for a fire extinguisher\nAnd all your mans, lookin at you like damn holmes\nI'm hot enough to burn the flesh off your damn bones\nSo for you niggas be claimin that you got heat\nAnd claimin that you're the best and the next to eat\nI'll be next to X or next to Grease\nWith bars that'll hit you like a bottle of Texas Pete\n\n[Verse 3: DMX]\nWHAT!\nDon't start what you can't deal with\n'Cause I'm a nigga that still get all up baby, real shit\nI'm a dog for real, I beast on niggas\nTake it back to the streets on niggas, feast on niggas\nOpen a bottle of liquor, pop a can of beer\nPour out the first sip for the homies that ain't here\nBecause you know in your heart they still right there\nIt is what it is, at times life ain't fair\nYou ain't me so what I'm 'bout to do to this rap shit\nWill have some real niggas on some \"excuse my back\" shit\nWish a nigga would, wish a nigga could\nRegardless of what you think, a nigga's still good\nSo easy to, kill a nigga\nEspecially when you don't, feel a nigga\nCan't see the, real in a nigga\nWe don't know about Gucci, we don't know about Prada\nBut what we do know is we gon' do what we gotta\nNIGGA! WHAT!", "image": "https://images.rapgenius.com/76e36e2e315efcb7a55fef8360116cfd.1000x1000x1.jpg"}], "artist": "DMX"}