{"songs": [{"title": "Dope (M.I.C.)", "album": "M.I.C. (Make it Count)", "year": "2004-10-26", "lyrics": "[Hook: Royce da 5'9\"]\nBLOW, 'bout to do it after I make\nOne of your favorite rappers buck or basically outdo 'em LIKE SMACK!\nBout to do as soon as your mouth single you out\nTo show you the trigger fingers is out LIKE CRACK!\nBout to slip through it like a fiend\nBout to pick through the pictures of the game like a dream LIKE GAY!\nFrom far away, from a fan\nWhen you hear it then you know you the man, you dope!\n\n[Verse 1: Royce Da 5'9\"]\nYeah, they say I rhyme like I'm from Columbia\nCause I shine like weed lights, that's why I'm signed to Columbia\nWith three mics at a time - I come from the underground\n'bout a hundred a pound, it's the way that my grind\nHoes know the most potent blow\nOn both coasts is approachin yo' nose\nLeft 'em, mo' open, right steppers turn left or\nBurn your sceptum, before a mic checks or\nThey sell, it takes me to teach y'all\nOn my weight scale, we basically seesaw\nEvery word that you heard is the murderous version\nServin you herbs when you mergin with birds\nI got what you want\nProduct that I come with, I got a mic that light up like a blunt\nIf you seen it then you know that the flow is the meanest\nIf I'm screamin that I'm dope then I mean it\nCause I'm like\n\n[Hook]\n\n[Verse 2: Juan]\nNiggas feel me introvenously\nThen hail and feel the realness, they needin me\nJust to get through the day when my voice ain't there\nIt's your commercial bullshit, the top choice ain't there\nWhile the A-1 Prada shit\nYou puttin mix jive in your shit\nTryna get, too much out of it\nHeads been tired of it, here's the real\nCop my shit, take the rap and all, feel the chill\nI'm like an epidemic, therapeudic music infectious\nVocals so potent had to check the logo, skull and crossbones nigga\nGo on and try get your spark on nigga\nFuck stepped on, your flows sound walked on nigga\nGot that dope pure hundred percent, uncut\nTake it whatever, monster flow bangin wherever\nAny hood, any project borough, any country\nWhy I'm that thorough, the same effect, ain't no comparin\nI'm bout to\n\n[Hook]\n\n[Verse 3: Royce Da 5'9\"]\nI whip out the wires of this game\nThis thang'll make you feel Ma$e to just plain retire\nRunnin 'round the lottery\nMy numbers is high, and y'all wonderin why I dumb it down for quantity\nWhatever you like, I got it\nI can sell it for twice to my competitors 'stead of the pipe\nI'mma be the best seller, yes feller\nI was pedalin mics when you was pedalin bikes, now let's sell it\n\n[Verse 4: Juan]\nYeah, the seal is cracked\nI'm 'bout to bag mine nigga, it's time to get stacks\nThugs scramblin tryin to get it, I got the slums in a frenzy\nTryin to find out who got it, my product liver than theirs\nOne hit, got 'em noddin they heads\nDamn near about to break they neck\nAny harder it'll break they deck\nMy name Juan nigga bang that shit\nAnd every time I'mma brang that shit\n'til I\n\n[Hook]", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}