{"songs": [{"title": "Peso (Feat. Machine Gun Kelly & Pusha T)", "album": null, "year": null, "lyrics": "[Hook: Machine Gun Kelly]\nI be going hard for that\nPeso, peso, peso, peso, peso, peso\nI be going hard for that\nPeso, peso, peso, peso, peso, peso\nShit, I be goin' hard... (I need a dollar, dollar, dollar that's what I need)\nThat's right... (I need a dollar, dollar, dollar that's what I need)\nGet money... (I need a dollar, dollar, dollar that's what I need)\nThat's right... (I need a dollar, dollar, dollar that's what I need)\n\n[Verse 1: Machine Gun Kelly]\nKells\nI be going hard for them pesos\nCame from the bottom made a milli\nSquad move when I say so\nGotta bring them dollars to the city\nMuthafuckas thought I wasn't living\nDaddy thought I never could've did it\nNow my hood see that Wahoo fitted on the TV screen next to Diddy\nPraise God for my brothers\nI'll rob for my brothers\nCause when times was hard I flipped that pack like somersaults for my brothers\nAnd I never ride with them suckers\nDick hard for my bitch\nAnd without me half of these rappers wouldn't exist, shit I be going hard for that...\n\n[Hook]\n\n[Verse 2: Pusha T]\nMy taste level on Ace level\nSpade nigga for a paid nigga\nWe darkskinned, south of France\nAll acting like Jay nigga\nJetski and I'm jetlagged\nStill smelling like jet fuel\nThat PJ split three ways, 60 making that jet move\nMy pesos from Play Cloths, Pyrex from Pedro\nTags pop from Pucci to Paul Smith to Penrose\nBeen down, that's ten toes\nScore nigga, that's endzone\nAsk me I sell dope, N-O from this Benzo\n\n[Hook]\n\n[Verse 3: Meek Mill]\nI'm getting paid when I wake up cause I hustle hard before I go to sleep\nAnd now I got my cake up, I'm balling hard like I'm suppose to be\nGot bad bitches tryna roll with me\nWhite bitches like \"totally\"\nV.S. stones all over me\nAnd I'm killing niggas no first degree\nCause I'm going hard for that peso\nSelling blocks no lego\nGot killers all on my payroll\nAnd they shoot like O.J. Mayo\nIn the coupe, pull up like \"hey ho\"\nWith the top down on that bitch\nAnd when they cat scan my body it was dollar signs on that bitch, whoa!\n\n[Hook]", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}