{"songs": [{"title": "Happy Valentine’s Day Alyce", "album": null, "year": "2014-02-13", "lyrics": "[Verse]\nYo\nThere's something that everyone needs to know about\nThere's a special girl her name is Alyce and yes we go out\nI can't be with her at the moment cuz I'm doing shows now\nSo I had to do this shit the only way I know how\nYou set my heart right again I swear I'm always smilin'\nIf you ever down I'll hold you up like you were violin\nGroupies reaching for my love but no I don't invite em' in\nMy heart is in your hands and that's the only place I like it in\nI do believe you're meant for me\nI swear to God this shit's a dream\nThe saying goes when you find the one you'll know it instantly\nWay back in 2010 I've been known\nBut I was having trouble tryna get up out that friend zone\nBut it's O-kay cuz every treasure's worth waiting for\nI thank the lord that I have you cuz I was filled with so much hate before\nShit I've been cheesing hard every single day on tour\nI gotta stop that shit though, for real my face is sore\nFor real Alyce, it's like you changed me to a new guy\nI never felt the urge by a woman so much to do right\nWe gonna travel the planet through the Bahamas to Dubai\nAny preference you like, we're gonna be in the moonlight\nLiving like death is foreign\nHaters we'll just ignore em'\nThey get salty because we found happiness way before 'em\nBaby we hotter than a whistling tea pot\nAnd we don't need no outsiders telling us what we got, peace out\nGirl you're so beautiful you're looking like a goddess\nBut still you always humble and stay modest\nYou ain't digging in my pockets\nYou got your own money up inside your wallet\nGirl you so fucking bad you need stop it, I just\nFeel like I need to fly away with you baby\nNo other girl can ever take what you gave me\nWill you be my Valentine? Baby let me know\nWe go together perfectly, the Cancer and the Leo, yeah!\nI ride for you like a soldier\nBaby all you gotta do is give me your love, yeah\nThe world can get to know us, show love\nIf you'll be my valentine\n\n[Outro]\nHappy Valentine's day Alyce. I hope you like this. Sorry I can't be there, I'm on my tour but, just letting you know that I'm thinking about you, and I want the world to know as well. Peace", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}