{"songs": [{"title": "WordPerfect", "album": null, "year": null, "lyrics": "I, brrrrrrrrrrrrrring!\nPhilosophy when I s-rrrrrrrrrrrrrrr-ing!\nI step like wildabeasts, killll-llll-lllling!\nMC's harming me I sling-lllll-ling!\nRhymes don't copy me you gots to be crazzzyaaayyyyy\nYet you believe that you can slay me play me maybe\nFlip the style I be killll-illl-ing, the track\nObey me, easssssse back, you're silly wack and idle\nGive me back the title my arrival questions the survival\nOf any rival rapper you're simply a promotional data\nMe, Kris the Master, beat, this the Master\nSeek, Kris the Master, eat, with the Master\nTreat, this the Master, but don't compete with the Master\nOr you'll seek disaster\nFaster than the BlastMaster's folk can say \"Oh!\"\nThat means YOU yo, you wrestlin with the style in your mind\nBut I'm like sumo, doin judo, you know\nI go then you go, lyrics we run through run through\nYou think you got the 4-1-1\nBut I got the 5-5-5-1-2-1-2\nYou're done through rhyme sessions with the teacher\nYou know you shouldn'ta come to\n\n\"Once again back is the incredible, rhyme animal\" --] Chuck D\n\tKRS, K-K-KRS (or variations)\n(repeat 4X)\n\nCanibus/Can-I-bust, like weed?\nAnd give you what you need\nThere's the kickoff and KRS-One has the lead!\nIndeed I'm all around your neck like beads, raw hell\nI knock like doorbells, I'm hot while you chili/chilly like Hormel\nI'ma sure sell, no doubt\nHow you think you gonna battle and take me out\nWith my phrases in your mouth?\nStop I rock your socks your blocks and set fire\nTo your Reeboks, can't you see dat de God of rap I be dat\nFrom the highest tree top you'll hang\nI ride the fly cars like Chitty Chitty Bang Bang\nYou can't hang, with my mic con-cep-tion\nCause we're not in the same gang, my juice is instant like Tang\nYou rhyme beginner, wack rap sinner\nYou attack next snap back CRACK and I'm the winner\nBut that's simple for me to do as I'm speakin defeatin you\nFairly beatin not cheatin you, heat-seekin and leakin through\nAll styles be creepin through, in amazement they keepin you\nYou be thinking, \"What were you doin?  The teacher competes with you?\"\nYou can run like the people do or you stay and you see it through\nI be lyrically eatin you anywhere I be seein you\nOn the hip like I'm beepin you in your mental you're peek-a-boo\nNo limit what we can do metaphorically teachin you\nTell me what can you show me, simply you do not know me\nNo I am not your homie, yo my lyrics are Epic\nBut I'm not down with Sony, in the middle like Monie\nScarfacin like Tony, your whole style is baloney\nYou think you off the hook... but you're simply a pho-ney\n\n\"Once again back is the incredible, rhyme animal\" --] Chuck D\n\tK-K-K, KRS (or variations)\n(repeat to fade)", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}