{"songs": [{"title": "The Curse", "album": null, "year": "2018-12-07", "lyrics": "[Intro]\nYeah, yeah, ooh-oh\nYeah\nYeah, ooh-oh\nYeah, yeah\nThey love you then they hate you, that's the curse\n\n[Chorus]\nThey love you then they hate you, that's the curse, yeah\nNiggas always plottin' on your worth, yeah\nBut momma always taught you put in work\nPut in work, yeah, put in work, yeah\nWhen your niggas switch up on you, that's the worst, yeah\nThey love you then they hate you, that's the curse, yeah\nThey love you then they hate you, that's the curse, yeah, ooh-ah\n\n[Verse 1]\nGot a call on the plane, I just left Mich'\nSecond row, the guy next to me havin' a slick conversation\nMama said the state denied for the fifth time\nShe need to borrow right now, yeah\nI wrapped the money, flew it like a kite to H-Town, yeah\nNow we on now like the light bill, but never cuttin' off, yeah\nI'm on top now, still comin' down, but never fallin' off, yeah\nI might need the distance, all I need is time, time\nCan't even look at my phone line\nWithout a couple texts that I can't deny\nLocked the phone, I had to close my eyes\nHalf the time, man, they tellin' lies\nWho to trust? Man, I can't decide\nNowadays, we just don't reply\nBut they know my name, they compare it, still\nWe was busting seals before we had a mil'\nWe done had the grills before we had a deal\nI'm a Houston nigga, that's what made me here\nThat's the curse, yeah\n\n[Bridge]\nThey love you then they hate you, that's the curse, yeah\nThey love you then they hate you, that's the curse, yeah\nBut your momma always taught you put in work\nPut in work, yeah, put in work, yeah\nYeah! Yeah!\n\n[Verse 2]\nThey might hit you with that Tyga, never do you right\nHit you with that Bill Cosby, thirty bitches overnight\nI might have to hit my back up, hit that 713 side\nI might have to pull a Tiger, I might have to crash my ride\nCan't be like you niggas, no, can't be like you guys\nI can't tell no stories, no, I can't tell no lies\nAll we do is money, do that money exercise\nWe just pay our taxes, pay our tax, don't pay no mind\nThat's the worst\n\n[Refrain]\nThey love you, then they hate you, that's the curse, yeah\nThey love you, then they hate you, that's the curse, yeah\nThey love you, then they hate you, that's the curse, yeah, yeah\nYeah! Yeah!\n\n[Outro]\nYeah, yeah, yeah (Yah, yah)\nYeah, yeah, yeah (Yah, yah, yah)\nOoh-wah-oh (Yah, yah), ooh-oh (Yah, yah), yeah\nYeah, yeah, yeah (Yeah)\nYeah, yeh-ayy, yeah-ayy-ayy, yeah-ah, yeah, oh, oh-ooh-ohh", "image": "https://images.genius.com/62d241389823ea14f6a4612f37e29db8.1000x1000x1.jpg"}], "artist": "Travis Scott"}