{"songs": [{"title": "House Party (Remix)", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Intro: Fabolous]\nAy Meek Milly, is my niggas there? (Yeah)\nIs there some bitches there? (Yeah)\nIs that Ciroc there? (Yeah)\nWell let's go\n\n[Verse 1: Meek Mill]\nI tell her meet me in the bathroom, hol' up, better yet my bedroom\nI call that my V.I.P., fuck a bad bitch get some head-room\nIf I score and her girlfriend, I'm calling that And-1\nIf I murder that from the back, I'm calling it redrum\nAll these bad hoes in my sight\nI see bad hoes on my left, I see bad hoes on my right\nAnd they like shots! shots! shots! shots! Loso bringing by Ciroc\nMac gonna bring some OG and we gonna party, La-Di-Da\nWale said he on his way with Black Cobain and BOA\nMMG we in this bitch, we balling hard, no we don't play\nWe stacking chips like Frito Lay, flexing on these mother fuckers\nI walk in the building and I'm fresher than a motherfucker\nShawty bad, yeah she a star\nI tell her bring it back like a DVR\nAin't nobody leaving, cause we too far\nI tell her my dick can't breathe and she gon' give me CPR\n\n[Refrain: Meek Mill]\nCiroc all on my table, bitches in the living room\nThey gon ask you at the door, \"what you tryna get into\"\nOnly me and my niggas, tell her bring a friend or two\nBottles poppin' models watching all in my living room\nWelcome to my house party party\n\n[Verse 2: Fabolous]\nI say one big room full of real niggas\nBunch of bad bitches, and some chill liquor\nCrib out in Bel-Air, No uncle Phil niggas\nSo I take em' in the basement and yea I feel Tigga\nI don't hear niggas corny raps, yeah I feel Jigga\nYou little niggas do whatever make you feel bigger\nEvery time I'm around yall, something's a little fishy\nI smell, I smell, I smell pussy!\nWhat's your name, where you from? Almost done with interview\nI'm into having intercourse, is that something that interests you?\nYes, no, maybe so, baby bro fix me up\nReal house party shit now hold up your Dixie cup\nWith your other hand, do me a fucking favor\nPut your middle finger up and say \"Fuck the neighbors!\"\nAnd Fuck the haters they never invited\nThey can't get on my level, my level is private\nWho fly more than me? My level is pilot\nMy pockets stay fat, I'm never on diet\nDon't be stuntin' out of town when you get on\nI do you like Kid and whoop your ass when you get home\n\n[Chorus: Meek Mill]\nWelcome to my house party, party\nWelcome to my house party, party\nWelcome to my house party, party\nWelcome to my house party, party\n\n[Verse 3: Wale]\nHol’ up, this gon’ be one vicious flow, show me what it’s hittin’ for\nPromise if I kill her pussy, I’ll send you home in a Ghost\nAnd we on, Joe, Burberry my winter coat\nGermantown my older bitch, she call me her youngin jawn\nKick game ain’t on Kelly Bund, I’m fuckin with plenty Bud\nGot a new Lorraine, she got her a Cindy?\nMMG and we out, couple blunts deep as fuck\nHaters love to talk you down when bitches always speak you up\nMaybach! Bitch, we the winning team\nHow can I illustrate, you drawling if you ain’t with me\nBalling like I’m in that league, flossing out, you bitch gon’ leave\nParty at the L-I-V, y’all gon’ be like this shit O.D.!\nMansion party, yea they on the couches\nMost of ‘em got no conscience, I promise I keep a condom\nE’ry Friday new polish, shawty fly but she modest\nDouble M G money speakin’, bet you tired of talkin'\n\n[Refrain: Meek Mill]\nCiroc all on my table, bitches in the living room\nThey gon ask you at the door, \"what you tryna get into\"\nOnly me and my niggas, tell her bring a friend or two\nBottles poppin' models watching all in my living room\nWelcome to my house party party\n\n[Verse 4: Mac Miller]\nYou only getting one shot, I hope your picture takes\nBitch I'm spitting on this remix like I'm Kid and Play\nYou know I'm getting laid like I'm Vincent Chase\nI'm thinking 'Ye should hit me up just say that shit is cray\nOff the backboard playa, I enjoy to bank\nPlus my people smoking on that pack, noise complaint\nI murder beats and get away, it's First 48\nBut this the house of love homie, word to Courtney's place\n20 racks a night, that's on merchandise\nI'm rollin' up this killer, sippin' purple Sprite\nParty hard then head to Europe on a early flight\nWalking 'cross the London Bridge, that's that Fergie life\nWhite boy, gone wild\nEvery time I do a show it's like the Pope in town\nAnd I call my girl Titanic, cause she go down\nHope she don't drown, bitch\n\n[Chorus: Meek Mill]\nWelcome to my house party, party\nWelcome to my house party, party\nWelcome to my house party, party\nWelcome to my house party, party\n\n[Refrain: Meek Mill]\nCiroc all on my table, bitches in the living room\nThey gon ask you at the door, \"what you tryna get into\"\nOnly me and my niggas, tell her bring a friend or two\nBottles poppin' models watching all in my living room\nWelcome to my house party party", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}