{"songs": [{"title": "Freestyle", "album": null, "year": null, "lyrics": "Check, I just wanna know your mindset\nHere starin' at your fine ex\nDamn, this where you put your time at\nUnappreciated like that Timex\nLet me rewind that, G-shit, let me rewind that\nI just wanna know your mindset\nHere starin' at your fine ex\nDamn, this where you put your time at\nUnappreciated like that Timex\nShe ready for this dope boy dialect\nIn the kitchens with Getty whippin' that Pyrex\nThe East Coast meets Kanye West\nDeath Row reeks underneath my breath\nStorage wars, all the whores, I walk away\nChad and Evelyn evidence, just a block away\nDo the bitches love you when you out the league?\nWill my car still crank when I hit the keys?\nWhen did dark skinned brothers learn to ski?\nGot a thing for Khloe, Lamar lost his feet\nScott Dis'nick, Taylor check me in a week\nBlack bottle boy, nigga blazin' peach\nSuch an amazin' piece, such an amazin' speech\nThis is easy to me\nRuthless records, next Eazy to be\nMay we live long, rich forever\nShe can hear it in my tone, rich forever\nStandin' on my own, Anderson Silva\nBreak a bone, nigga gone 'til November\nRun in your home, put your infant in a blender\nSippin' a smoothie or give it up smoothly\nDon't panic, only lyrics for my movie\nYou couldn't handle my tender life, for real\nHood stripes worth more than my deal\nMotherfucker ain't as real\nTen mil' in a duffle, make a nigga shiver\nSaint Bartholomews chillin' for the winter\nYou makin' wack songs with the nice titles\nAll chains, no rings, never see the finals\nI know you're tired of loving, of loving\nWith nobody to love, nobody, no (Uh-huh, honey)\nClose your eyes and let the word paint a thousand pictures\nOne good girl is worth a thousand bitches\nBound you're falling in love\nBound you're falling in love (Uh-huh, honey)\nI wanna fuck you hard on the sink\nAfter that, give you something to drink\nStep back, can't get spunk on the mink\nI mean damn, what would Jeromey Romey Romey Rome think?\nHey, you remember where we first met?\nOkay, I don't remember where we first met\nBut hey, admitting is the first step\nAnd hey, you know ain't nobody perfect\nAnd I know, with the hoes I got the worst rep\nBut hey, their backstroke I'm tryna perfect\nAnd hey, ayo, we made it: Thanksgiving\nSo hey, maybe we can make it to Christmas\nShe asked me what I wished for on my wishlist\nHave you ever asked your bitch for other bitches?\nMaybe we could still make it to the church steps\nBut first, you gon' remember how to forget\nAfter all these long-ass verses\nI'm tired, you tired, Jesus wept\nI know you're tired of loving, of loving\nWith nobody to love, nobody, nobody\nSo just grab somebody, no leaving this party\nWith nobody to love, nobody, nobody\n(Uh-huh, honey) Jerome's in the house, watch your mouth\nJerome's in the house, watch your mouth\nBound you're falling in love\nBound you're falling in love (Uh-huh, honey)", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}