{"songs": [{"title": "Your Ass Got Took", "album": "Mr. Scarface is Back", "year": "1991-10-03", "lyrics": "Uh(yawning)...shit\nHere I go again. One more motherfucking time\nGiving you examples on all your asses gettin took\nYo Doug, drop that shit\n\n[Verse 1]\nGet em up motherfucker this is it\nHold them up where I can see them, or take a slug, bitch\nCause if you make a false move it'll cost ya\nNo need to cry for help, the world just lost ya\nAnd I don't give a fuck about no witnesses\nWitness this (gunshot)\nMake it so you can't be fingered out\nIf you gotta kill a bitch, let them bring her out\nHave no mercy when you jack\nDress the whole motherfuckin family up in black\nFuck a five-oh, you gotta bail out\nOr your black ass is headed for that jail house\nPeople all the judges wanna bust you\nThe D.A. does the hangin, he agrees because he's fuckin her\nAin't no redneck judge gonna boot\nA nigga like the Brad cuz a nigga like the Brad shoots\nDon't be afraid my brother\nPut your finger on the trigger, close your eyes and squeeze the motherfucker\nFuck the press, you gotta pop a chest\nIf they don't cooperate, grab some hostages\nKick an old bitch in her pouch\nSkull an old nigga, knock his motherfuckin dentures out\nPush an old man out his wheelchair\nHe's still there and squeals there, he gets killed there\nIf it's left up to me I'd bury em\nThey got a nigga livin in a sanitarium\nA real thief goes by the book\nAnd that's the first example of your ass being took\n\n[Verse 2]\nI'm pullin them motherfuckin Boones Farms\nA nigga's talking shit he's got me reaching for my firearm\nBut I ain't goin out like a sucker\nI open up the bar now motherfucker\nIf you're caught in the crossfire\nIt musta been time for your ass to expire\nCuz I don't shed tears on a victim\nFuck with me, I gotta get him\nThat's how it is in the motherfuckin streets\nMotherfuckers check your nuts, and try to play a nigga weak\nBut I got news for your ass\nHere's a little blast from the Brad\nNow put that in your pipe and smoke it\nPut your hands around your dick and choke it\nYou gotta keep your nuts out your stomach, miller\nCuz I'mma put a twelve gauge on your ass, nigga\nAnd never take a second look\nYour ass got took\n\n[Verse 3]\nHere's some game for you dick-suckin bitches\nYou hoes who's givin up the pussy for the riches\nBut a nigga like me don't pay shit\nTo put it blunt to you, homey don't play, bitch\nSo open up and let me get it\nMe pay for the pussy? Bitch quit it\nAin't no pussy in the world worth cash flow\nPut bank in your ass, oh no\nIt ain't no way, motherfucker\nYou can be the world's best dick sucker\nBut you still don't fit on the payroll\nI run game on a bitch and lay low\nAnd let her roll with someone else\nAnd let the other motherfucker play his self\nLet her get his cash flow\nBut I'm still gettin that ass bro\nLet the other nigga keep her\nBut every time you fuck her ain't that pussy gettin deeper?\nI bet it kinda makes you wonder\nWhen you're home all alone, \"Yo, Akshun place is farther\"\nHa ha ha, thought you had her\nBut when you fall asleep, yo, she's rolling with the Bradster\nI peep out game and just chill\nYou gave her money for rent, but honey paid my light bill\nIt ain't like a nigga ain't rich\nBut a bitch has gotta pay for this dick\nReverse the game, get her hooked\nYo, her ass got took\n\nScarface is in the house. Douglas King is in the motherfuckin house\nOle' Jay is in the motherfuckin house. Bido in the motherfuckin house\nGeto Boys in this motherfucker, and we outta here, yeah!", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}