{"songs": [{"title": "G.O.A.T.", "album": "Straight from the Lab Part 2", "year": "2011-12-18", "lyrics": "[Intro]\nAnd I’m willing to borrow your grass\nBut I specialize in eating MC's\nIn the immortal words of LL Cool J\nAs he would say: \"I'm a G.O.A.T.!\"\nAnd for those of y'all who don't know what a G.O.A.T. is\nIt means the Greatest Of All Time\nAnd I consider myself one of those\nSo thank you very much, here it goes\n\n[Verse 1]\nThis is the part I was worried about\nEveryone thinks that my career is down the tubes\nAnd I'm in some dusty garage\nInhalin' them carbon monoxide fumes\nAnd everyone's tellin' me what I should do\nAnd how I should come out and what to rap about\nAnd I know I got a lot up\nIn my medulla oblongata that I gotta get out\nAnd I'm not sure how this is gonna come off\nThey're probably gonna think that I'm comin' off as cocky\nLike I just started givin' a fuck what you really think about me\nSee, the thing about me\nIs you don't really know a thing about me\nEveryone's makin' a stink about me\nLike there's some kind of an aura of that of the king around me\nSurround me with nothin' but gangsters\nKillers and bangers and the most dangerous criminals\nAnd I feel like I'm more comfortable around them\nThan I do my own motherfuckin' neighbors\nBut see, my dream is to be remembered as one of the best when I leave\nBut why does it seem like I'm not even put up in the same category as other MC's?\nSo when Weezy says that he's better than Jay Z\nPlease be that just subliminally\nMeans he thinks Jigga's the best\nAnd that he's the only one up in that league, see\nAnd it's easy just to consider me\nOne of the greatest white rappers there is\nKnowin' goddamn well that I'm one of the best motherfuckin' rappers who ever lived, period\n\n[Hook]\nI'm a G.O.A.T. and I don't mean to gloat\nBut I know what I know and I know what you think\nAnd these magazines'll never put it in ink\nBecause how would it look if they considered me as a G.O.A.T.?\nAnd for those of y'all who don't know what a G.O.A.T. is\nIt means the Greatest Of All Time\nAnd I consider myself one of those\nSo thank you very much, here it goes\n\n[Verse 2]\nMaybe they figure that I'm on my way out the game\nSo they gotta go try to find 'em a new Eminem or a new Shady\nIf they think it's gonna happen, man, I thought I was crazy\nOr maybe I could be takin' it wrong\nAnd they're tryna pay homage to me in a strange way\nSo let me pay homage to my fellow white competitors almost in the same way\nSee, you hardly ever do hear anyone even bringin' up that Paul Wall's white\n‘Cause lyrically he doesn't pose a threat to anyone, see, he's just aight\nAnd Bubba Sparxxx, he just won't write\nBecause he's so caught up in that snow white\nThat Timbaland can't even get him in the studio\nHe's so gone off that coke, right?\nAnd it's so sad ‘cause he's dope, right?\nAmerica's next great white hope, right?\nSo now they feel like they gotta come up with some corny-ass White Rapper Show, right?\nAnd which I'm still havin' mixed feelings about\nThey said it'd be real, I'm just spillin' it out\nThere's somethin' about a white boy talkin' black\nAnd runnin' around with a damn grill in his mouth\nAnd I love when the say that Tiger Woods shit\n\"Isn't it ironic that the best rapper's white\nAnd the best golfer's black?\"\nAnd I'm the one who's gotta catch all the flack off of that\nBut these are the people who never had heard of an Eminem until 8 Mile had came out\nBut I had already hit middle America\nParents had all got to likin' me now\nWhen suddenly I wasn't such a bad guy\nAll of the hatred for me must've died\nThought I committed career suicide\nSo I had to turn back into the bad guy\nSo faggoty faggoty faggoty gays\nAnatomy God made Raggedy Ann and Andy\nNot Raggedy Andy and Andy and Andy\nAnd Angelina Jolie is just another ho\nAnd Brad is a sucka, because once I fuck her\nShe wants to go to Somalia to adopt another baby\nYou know what I say? — \"No.\"\nYou better save some of them kids from Madonna\nShe needs all the publicity she can get\nYou wanted Shady, well you got it, man, I ain't apologizin' for shit\n\n[Hook]\nI'm a G.O.A.T. and I don't mean to gloat\nBut I know what I know and I know what you think\nAnd these magazines'll never put it in ink\nBecause how would it look\nIf they considered me as a G.O.A.T.?\nAnd for those of y'all who don't know what a G.O.A.T. is\nIt means the Greatest Of All Time\nAnd I consider myself one of those\nSo thank you very much, here it goes\n\n[Outro]\nMan, I'm takin' my ball and goin' home\nMan, shit is too easy\nNobody even wants to pass me the ball\n‘Cause I'm a G.O.A.T.\nSo don't worry, I'm out the motherfuckin' game\nAnd y'all can sit and argue about who's the motherfuckin' best\nBut y'all know that I'm a G.O.A.T.\nAnd like I said, I'm one of the motherfuckin' best\nBefore you get your panties in a motherfuckin' bunch\nBut before I go, I'd like to say fuck you very much\nTo everybody who wasn't there from the start\nAnd thank you very much to everybody who was\nAnd y'all ain't gotta say it, just think it\n‘Cause I know that you know that I know\nThat you know that I know that I'm a G.O.A.T.\nI'm out y'all, it's been real—peace!", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Eminem"}