{"songs": [{"title": "Shake N Fries", "album": "1.21 Gigawatts: Back To the First Time", "year": null, "lyrics": "[Hook]\nHey how you doin', Ms. Lady? You so fine with it\nI know you handlin' business, can I get your 5 minutes?\nDon't be offended by me telling you you thick with it\nWith all that shake - can a player get some fries with it?\nWith all that shake - can a player get some fries with it?\nWith all that shake - can a player get some fries with it?\nDon't be offended when I tell you that you're very pretty\nWith all that shake - can a player get some fries with it?\n's Gucci\n\n[Ludacris]\nThat waist got a swivel to it\nBut that ass a Cali earthquake jiggle to it\nShe a stallion - no horseshit\nYou could fit that bitch's booty on a forklift\nBeep! Beep! Bitch back it up\nI put my balls on the table, tell her rack 'em up\nVanilla bed sheets, chocolate laid one way\nSprinkle my nuts on top — what a sundae\nWhipped cream cherry on top\nAnd when I ain't wit' her, pussy on lock\nThrow away the key, it's a wrap bitch!\nLarge shake and a Ludacris sandwich\n\n[Hook]\n\n[Gucci Mane]\nYo, mama turned out, she so popular\nYou suckers can't see her with binoculars\nShe'll suck your pocket dry like Dracula\nHer last boyfriend bought her an Acura\nDon't try to get all attached to her\nShe an alley-cat type — that chick'll scratch you up\nLike Bel Biv DeVoe said, \"She's dangerous\"\nHer old man used to snort angel dust\nSo, don't be quick to judge, shorty bad as fuck\nShe's the type that drive back with the bricks for bucks\nShe had a ballplayer dude but she fucked him up\nHe bankrupt, selling cars like an auctioner\n's Gucci\n\n[Hook]\n\n[Ludacris]\nI've got a sausage for them hot cakes\nAnd I be fuckin' while you niggas out on hot dates\nYou all polite and open doors for her\nWhile every night I put that blanket on the floor for her\nThese hoes be sprintin' like it's track 'n' field\nBecause this supersize dick is their Happy Meal\nSo for an extra value woody\nPut this Big Mac into that Quarter-Pound pussy, yes!\nIt's Ludacris \"Mr. Slay-A-Bitch\"\nUnless that pussy is smelling like a Filet-O-Fish\nShoo Fly, ho! Kick the bucket\nAnd niggas talking shit I bust 'em in their chicken nugget", "image": "https://images.genius.com/5482bdd9a892ee8a85e236881855cbce.320x320x1.jpg"}], "artist": "Ludacris"}