{"songs": [{"title": "SLMD Remix (R.I.P. Bernie Mac)", "album": null, "year": "2017-03-15", "lyrics": "[Refrain]\nJust like at Pizza Hut, I serve your order\nAnd might I just mention, I just met yo' mother (Boom)\nHer nose is humongous, Mr. Krabs' Daughter (Bitch)\nShe got a big head like on the fuckin' quarter (Ayy, ayy, ayy)\nTop rope (Ayy)\nSwingin' in the pussy, Rey Mysterio (Swingin' in the)\n619 to her pussy hole (Pussy hole)\nBite-bite (Bite-bite)\nHit it too hard, she might cry-cry (Bitch)\n\n[Interlude]\nYuh, VR lifestyle, lil' bitch (VR, bitch)\nGling, what the fuck, stop\nMay I, come get\nYour auntie neck 'bout as long as a NASCAR race, nigga\nListen up, lil' boy\nAyy, ayy\n\n[Verse 1]\nHot boy I might need a ceiling fan (It's hot)\nPeter Pan fly, hot like summer tan (Sing it)\nPopeye, flex strong, spinach can (Flex, flex)\nYour diamonds dirty (Wet, flex)\nLook at this, dirty dan, ayy\nNutter and butter\nIs what I left on the chin of yo' mother (Chin)\nFuck with two bitches, that be my wishes\nI'm feelin' like Danny Glover (Two bitches)\nUnder the covers, handin' me out\nDamn, that lil' bitch's a slugger (White back)\nSome of my niggas is still sellin' dimes\nDodge a cop car like it’s Frogger (Frogger)\nDick in her mouth like a Black & Mild\nWhen I fuck doggy style I be like roof (Stank)\nI'm a clown, but yo' bitch like my style (Wet, flex)\nFuck a damn camel toe, she got a hoof\nNo, I'm not a cook\nI'm Ratatouille, spilled sauce on my foot (Cook)\nJust like my right, I'm a hook\nI want the booty like I'm Captain Hook\n\n[Chorus]\nRest in peace to Bernie (Rest in)\nSo I got a mac (Got it)\nRed dot like a red light (Bitch)\nStop him, heart attack (Woo)\nTalkin' cray, talkin' cray, Kevin Hart\nHe gon' learn today (Bitch)\nSki's flow clean like a LeBron fadeaway (Look at it, look at it)\nAyy\n\n[Refrain]\nJust like at Pizza Hut, I serve your order\nAnd might I just mention, I just met yo' mother\nHer nose is humongous, Mr. Krabs' Daughter\nShe got a big head like on the fuckin' quarter\nTop rope (Top rope)\nSwingin' in the pussy, Rey Mysterio (Swingin' in the)\n619 to her pussy hole (Pussy hole)\nBite-bite (Bite)\nHit it too hard, she might cry-cry (Okay)\n\n[Verse 2]\nEat on that pussy like bath salts (Bitch)\n'Til I make a million not takin' my durag off (Bitch, bitch)\nChain on me wet like I put Axe on\nNiggas be some pussies just like in the show Cat-Dog\nFuck on your mother with slacks on (Look at it)\nWhen she be doin' that back talk (Back talk)\nB-Mac I just spilled some sauce though, ayy\nShout-out my parents and Rick Ross hoe, ayy, ayy, ayy\n\n[Chorus]\nRest in peace to Bernie (Bernie)\nSo I got a mac (Got my mac)\nRed dot like a red light (Hit 'em)\nStop him, heart attack (Pussy hoe)\nTalkin' cray, Kevin Hart\nHe gon' learn today\nSki's flow clean like a LeBron fadeaway (Bitch)\nRest in peace to Bernie (Come here)\nSo I got a mac (Alright)\nRed dot like a red light\nStop him, heart attack (Wait, wait)\nTalkin' cray, Kevin Hart\nHe gon' learn to-fuckin'-day (Yup)\nSki's flow clean, like a LeBron fadeaway\n\n[Outro]\nBitch, bitch, bitch, bitch, woo, woo\nI'ma whip you like your auntie boy, bye\nAyy ayy ayy\nAyy! Bitch", "image": "https://images.genius.com/7bdc4880df9019b534d951effc4ba47a.500x500x1.jpg"}], "artist": "Ski Mask the Slump God"}