{"songs": [{"title": "Slap Niggas", "album": "The Beautiful Mixtape Vol. 2: The Struggle Continues", "year": null, "lyrics": "[Verse 1: Saigon]\nCatalyst raps, crackers out to add to the stats\nThey're manufacturing gats to kill Latins and blacks\nIf it ain't each other it's black on Latin or Latin on black\nBoth get a box, one in the dirt, one up in Adirondacks\nThese rappers on wax, was growing up\nTheir mom, dad, even cat was on crack\nYeah get on and yap on a track\nCall it what you want, black hating or mad rap\nAll that material crap ain't abstract, shit's mad wack\nMy flow is here to show what the difference is\nBlind folks follow a book in which they don't really know the significance\nReligion ain't feeding babies or curing the sicknesses\nThese Jehovah's Witnesses need to open some businesses\nSpitting with no specificness\nBlow the mischief and show prolificness\nAin't too many MCs that could go the distances\nFather had it on since Matawan, fought Babylon\nSick of y'all, pick a wall for your brain to get splattered on\nWhoever said bad is wrong, never slept on a pissy mattress\nIn a cell on the same tier there's a faggot on\nHawked cause you got ratted on\nRough said a burner is like a magic wand\nAbracadabra, crackers is gone (they gone)\nOutta here (motherfucker)\nWish I had a magic wand (fuck is y'all niggas talking bout)\nAnd all y'all fake rapping niggas (hit em in the head nigga)\nAnswer me this:\n\n[Bridge: Saigon]\nWhat makes ya cool to be a gangsta?\nWhat makes ya cool to be a thug?\nWhat is it that's so cool about possibly\nGetting hit in your head with a slug?\nWhat makes ya cool to be hip hop?\nWhat makes a grown man wanna crip walk?\nWhat is the reason I swear to fucking God\nThat I seen George Bush with a pitchfork\n\n[Verse 2: Talib Kweli]\nI slap niggas, kicking that wack nigga shit in my ear\nMy vision is clear, we see the same shit every year\nPeople still shedding tears for names said in they prayers\nWe need change, the evidence here, but this is never what the president hear\nThey stick to they lies, and peddle they fear\nAnd so I pimp the system, watch it shed its brassiere\nHunt em down, put em up on the mantle like the head of a deer\nYou can feel it in your heart when your enemy near, yeah\nThe moment that you bought this, the route you're taking is alternate\nThe way I'm walking and talking they call it ultimate, ultimate\nFind your girl coordinates, all up in it, we intimate\nShe calling cause I get her wet, you balling, but you ignorant\nI'm proficient in reading the body language, you illiterate\nA little bit of class wouldn't hurt, you should consider it\nI'm flashy with the lyrics, a nigga funny and serious\nSpectacular vernacular, all the honeys is curious\nKweli, the one I'm running and I'm shining like the sun in it\nHitting like a ton of bricks since Hulk Hogan was Thunderlips\nNever with the fronting shit, draw me some blood with it\nBeat you down with the belt buckle, brass knuckles shit", "image": "https://images.genius.com/77b2cb0937e1d9604da173026219d5ac.705x706x1.jpg"}], "artist": "Talib Kweli"}