{"songs": [{"title": "Sho Nuff", "album": "Planet", "year": "2018-03-02", "lyrics": "[Intro]\nHella faded\nYou wonder why everything so celebrated\nAnd all of our team's dreams shot down\nBut made it to the top now out of Hell and above hard ground\nWe spreadin' our wings, all of my team make the Planet Rock, don't stop now\nWas supposed to be a ghost, now when we party, I'm the host\nWe made it through the rain to the fame so I wanna make a toast\n\"I'd like to thank everybody that showed up\nNow we 'bout to get poured up\n'Cause we made it through the days it was so rough\nSo is everybody with me? Sho Nuff!\"\n\n[Verse 1]\nI been at the bottom where they fought and then they shot 'em\nWas a problem summer, winter, spring and autumn\nGotta pray to God is what they taught 'em\nHavin' not is what they got, so you right up in the column\nUnless you got the will to go and get it\nUnless you find a lick and go and hit it\nI didn't bitch, I didn't march or picket\nI just kick 'em something wicked then it turned into a ticket\nWent from fights in school\nTo partyin' on stage where the hip-hop junkies Nice and Smooth\nWay back in the day then Quincy J gave me a brightened view\nTold me to rap what you know, took his advice then grew\nSick mother with no father, but still I made it as a scholar\nBut now I got to pop a collar, 'cause I started deep in squalor then I made some million dollars\nI'd like to thank everybody that showed up\nNow we 'bout to get poured up\n'Cause we made it through the days it was so rough\nSo is everybody with me? Sho Nuff!\n\n[Chorus]\nEven though we had a lot of nothin,' were we poor? Sho Nuff!\nDid we find a better way of livin' through this flow? Sho Nuff!\nComing up feeling good right now\nLot of love in the hood right now\nTell me something if you ain't a hater, do we go? Sho Nuff!\n\n[Verse 2]\nI remember rubber sole footies on my feet\nIn the dead of winter, freezin' cold, walkin' in the streets\nOff to 7-Eleven, only had enough to eat\nA bag of Doritos with the chili and cheese inside 'em, it was cheap\nMomma in the hospital, 17 I got little copped vittles\nPushing the bricks, scrubbing off the hot griddle\nToo much struggle to tell y'all\nBut it ain't so much that I quit and stop makin' my mail tall\nAw hell nah! Made it through the rainy day\nNever liked the devil and the games he play\nEven though we in a gang, we pray\nYeah we broke the chains and the money and the fame, we slay\nUse to be a man with no hope\nNow to all my many fans I'm a G.O.A.T. (I'm the G.O.A.T.)\nMy struggle was a blast in the past\nNow I'm gonna lift my glass 'cause I wanna make a toast\n\"I'd like to thank everybody that showed up\nNow we 'bout to get poured up\n'Cause we made it through the days it was so rough\nSo is everybody with me? Sho Nuff!\"\n\n[Chorus]\nEven though we had a lot of nothin', were we poor? Sho Nuff!\nDid we find a better way of livin' through this flow? Sho Nuff!\nComing up feeling good right now\nLot of love in the hood right now\nTell me something if you ain't a hater, do we go? Sho Nuff!\nEven though we had a lot of nothin', were we poor? Sho Nuff!\nDid we find a better way of livin' through this flow? Sho Nuff!\nComing up feeling good right now\nLot of love in the hood right now\nTell me something if you ain't a hater, do we go? Sho Nuff!", "image": "https://images.genius.com/9512e7de485fe45a8b0365fd80465887.1000x1000x1.png"}], "artist": "Tech N9ne"}