{"songs": [{"title": "Outro", "album": "Return of the Dozen Vol. 2", "year": "2011-04-11", "lyrics": "[Intro: DJ Young Mase]\nYeah, I want to thank y'all for coming out\nThis is the last song from the Return of The Dozen, part 2\nY'all haven't heard D12 in a while\nSo we gonna give you what you being asking for\n\n[Verse 1: Bizarre]\nStraight out the Halfway House, they let this bastard out\nCheck all the doors; there's no way to get out\nI'm far from a pussy, I'm more like a dick\nI'm the pain in your stomach when you're about to take a shit\nShit, bitch suck everybody dick\nPatch on my eye: I'm the new Slick Rick\nAnd my boys, we'll call 'em Doug E. Fresh\nAll this period blood; clean up all this mess\nIf I don't get my record on Shade-45\nI'm going in the building and make sure everybody dies\nShoot Rude Jude, blast Lord Sear\nShoot Howard Stern and he don't even work there\nBizarre gets high, everybody dies\nEven the nigga who drove in the drive-by is gonna die\nMe and Goofy Gary raping Halle Berry\nSay 'Bizarre' ten times like Bloody Mary\n\n[Verse 2: Swift]\nI'm a Grenade aimer, applying heat like radiators\nI detonate a concoction; you won't play possum\nI snatch that oxygen out you're biological time-clock\nWith one shot between your eyes, now you're a cyclops\nI'm lyrically retarded; I turn your apartment into an icebox\nWith a pipe-bomb taped to your hot-top\nI smithereens 'em\nI use my fingers the same fashion as Wolverine\nGo with a pistol, Gilbert Arenas\nIf I say it, I mean it. I feed you slugs\nAnd have you throwing up blood like a bulimic\nBecause of me a lot of people died\nBe scared that I will be outside\nStarring through the window like a peeping tom\nWith the mind of a Vietnam Vet injected needles in my neck\nWith a high, I still haven't came down yet\nI'm not a threat, I'm a promise\nI'm as, crazy as Osama slash Unabomber\nShoot the llama through your momma! (Bitch)\n\n[Verse 3: Kuniva]\nI take my time with the skill that I utilize\nIll commit suicide\nSucceed then do it twice\nWhatever happen on gettin' your shoes, coat and hat tooken?\nCheese an pretzel combo\nSuper-sizing an ass whoopin'\nI'm too cool but I acted out in a violent manner\nWhen I am Adam, leave everything but its heimlich shattered\nWho dares to hurt me?\nI'm posted outside 7-Eleven sharin' slurpies with a known whore flarin' Herpes\nLyrical God-king like Xerxes\nWho's hooks bleeds tongue sharp\nI spit in the forests, and split the earth's trees\nYou blood pirate I got hatred to get off me chest\nAn ounce of weed, a 40oz of Milwaukee's best\nI take the rage of the niggas who have faiths\nAnd you don't want a test like you afraid that you have AIDS\nThat bullets have you losing weight like anorexics do\nThis ain't a DMX flick when you see the exit wounds\n\n[Verse 4: Fuzz Scoota]\n.22 is a sheepskin, .38 is a furry\nNiggas are pussying me outI can tell the way that it burns\nYou like cock you female, I can say that you heard\nD12's always a suspect when some shady occur\nOpen pill bottles, guns with their safety's broken\nDuncan Heines' nephew giveaway guns when the bakery is open\nPistol smack your bitch, kiss your shortie\nDitch the 40 than chain smoke some piff with Gordy\nDifferent shorties whose bitches like a change of clothes\nCuz house got a driveway and I need them flames to go\nBack the fuck up like you've never seen goons\nMy sixteens is grown up, bitch will be seventeen soon\nShe got a fucked up attitude and she mean in a way\nYour team in the way she on Facebook cleanin the keg\nAnd she's a 20 til you wanna be chanche\nNow niggas on Facebook requesting that they wanna be friends\n\n[Outro: DJ Young Mase]\nThank you for having us\nD12, Return of the Dozen Volume 2, It's a wrap\nYoung Mase, Shady Records, third album on the way!", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}