{"songs": [{"title": "The Motto", "album": "Tical 0: The Prequel", "year": null, "lyrics": "[Intro: Method Man]\nMy niggas, how we do it? You know it like a poet, baby doll\nBreak through it, you know it like a poet, baby doll\nI spit, chew it, you know it like a poet, baby doll\nGet in the music, you know it like a poet, baby doll\n\n[Method Man]\nIf you don't know, you better, ask somebody who I be\nOn land, air, or sea, I don't need No I.D\nOnce again, let's get under their skins like I.V.'s\nOr Roman numerals fours (IV's) who we doin' the score\nI got a shoe in the door, nothin' new anymore\nYa'll got love for me? I got love for you and yours\nTical Part 0, my friend, rappers is fightin'\nLike Tyson, when nothin' else work y'all start bitin'\nMy shit, and his shit, I'm hopin' it end\nI live my life like a lotto ticket, hopin' it win\nPurple haze got me chokin' again, open again\nI'm what's crackin', like your mamma smokin' again\n\n[Hook: Method Man]\nIf you see a model, then you might see me follow\nRubbin' her thighs like Aladdin rub the Genie bottle\nBack for another swallow, Method, you know my motto:\n\"Ya'll might just win today, but I'll be back tomorrow\"\n\n[Method Man]\nYa'll tryin' to get me started\nWho on the short yellow bus tryin' to get retarded?\nKid don't be the artist, formerly known as artist\nJump off a skyscraper, the roof who hit the hardest\nWhere the bastards at and where they habitats?\nI send they asses back to foldin' sweaters at the Gap\nI like Nikes, food spicy, I'm a Pisces\nThat's why women love me and any nigga that's like me\nThoroughbread, I'm with gettin' this dough instead\nNeed a ho, like I need another hole in the head\nLord help me, I'm crackin' the safe, pocket like 'Face\nMighty Healthy, you know I'm the shit, soon as you smelt me\n\n[Hook]\n\n[Method Man]\nFor what it's worth, the early bird sit at the table and eat first\nMy niggas need work, mami buggin', rippin' my t-shirt\nWe can kick it until our feet hurt\nMothers warn your daughters 'bout this tall drink of water\nSpoiler, waiter give her anything she order on the menu\nMethod Man, live at your venue\nSmokin' it, jumpin' off the dick, like he mental\nKid, I got a murder rap, and my head is simple\nOpen up the pussy, put the lead in the pencils\nAnd people sayin' Wu gon' break up, ya'll\nWe got y'all numbers, it's time ya'll got your wake up calls, and..\n\n[Hook 2X]", "image": "https://images.genius.com/b570b137bfca42564ca115c745cf3a4c.500x500x1.jpg"}], "artist": "Method Man"}