{"songs": [{"title": "Shark Niggas (Biters)", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "Niggas is fucking crazy, you know what I'm saying?\nHell yeah, man\nWord, you know how niggas be biting and shit\nNiggas be biting mad styles and shit from niggas, man\nYeah, no doubt\nThat's what I be hating man, I can't stand a fucking biting ass nigga\nWanna use your lines all ahead of time before you even get a chance to shine on your own shit\n\nTrue, nah niggas be killing me though son because you know\nThey be they be coming with your words and shit\nThey hear you say one word then here they come with the word\nTrying to flip it and bounce it and shit on some bullshit\nYeah, yeah\nNot sounding right first of all and shit, you know what I'm saying?\nBoom, but then you got niggas son on the real, you know what I'm saying?\nNiggas niggas niggas niggas is biting off your album cover and shit\nYeah!\nBoom, bad enough they biting lines like niggas killed me when they came with some Na-\nNiggas bit offa Nas shit! You know what I'm saying?\n*chuckling*\nWord niggas niggas niggas niggas caught his little album cover, boom\nThen done did a Nas for that shit\nYeah\nI'm like damn what the fuck man?\nIt's like these happy-go-lucky niggas man when they get on man\nThey wanna pop a little, a little champagne, you know what I'm saying?\nBut like I said...\nEvery few, every time you see 'em, you know what I'm saying?\nLike, front on, don't front for me, man\nYou gon' play that role man, play it though\n\nYo man, it's like this man, niggas man\nNiggas know not to fuck around with this shit though\nI don't give a fuck how nasty niggas get\n\nNah son, let me tell these niggas something, God\nI don't want niggas sounding like me... on no album!\nYou know what I'm saying?\nFor real cause I'mma approach a nigga man\nFor real man, I don't want nobody sounding like me man\nFor real son, you know\nNo doubt\nBad enough nigga, I don't want nobody sound like nobody from my Clan, man\nKeep it real, get your own shit man, and be original\n\nWord up\nThat's all man\nAnd you'll be a better man\nAnd you gonna come out on your own way\nWord up\nWhatever how you gonna take it man, fuck it\nWord up", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}