{"songs": [{"title": "On God", "album": "Hella Disrespectful: Bay Area Mixtape", "year": "2017-11-10", "lyrics": "“Yeah, we hella disrespectful”\n\n[Chorus: Lil Yase]\nYoungin’s thuggin’ so hard probably think they know Pac\nGang, gang, gang, gang, gang, whole mob\nNo suckas, Blow Pops\nWe slide, on God\nOn God, on God…we slide…\nOn God, on God, on God, on God\n\n[Verse 1: Mistah F.A.B.]\nOn God, that cha-cha beat y’all shit\nKnock shit if you proud of shit, especially if you opposite\nAround here, nigga get popped\nDraco lettin’ off a hundred shots\nGot two options for the hospital, but he died before he seen doc\nYoung L did it, this shit knocks, still be slidin’ around my block\nBustin’ knots, stackin’ guap\nWorry about mine, ain’t worried about what another nigga got\nPussy niggas love to talk a lot\nWhat that check talk? What it’s talkin’ ‘bout?\nMine talkin’ about 200 thousand worth of cars, nigga, in that parking lot\nHouse all in the hills, nigga\nGetting in, might hit a deer, nigga\nFour-car garage, four stories, little broke boy, can you hear, nigga?\nI don’t hear niggas, don’t fear niggas\n‘What year your whip?’ This year, nigga\nKeep playing wit’ a nigga, we gon’ give it to you here, nigga\n\n[Chorus: Lil Yase]\nYoungin’s thuggin’ so hard probably think they know Pac\nGang, gang, gang, gang, gang, whole mob\nNo suckas, Blow Pops\nWe slide, on God\nOn God, on God…we slide…\nOn God, on God, on God, on God\n\n[Verse 2: Young Gully]\nI put this shit on my God, on that early morning like IHOP\nOld school soul like an IROC\nAin’t no snitchin’, won’t crime-stop\n2Pac without five shots, don’t blue block, don’t dime-drop\nWe get it in on my spot, make bricks flip, make pies hop\nHurtin’ feelings like ‘Ouch, nigga’, Benjamins in my couch, niggas\nConfident with a couple bands ‘cause there’s 20 more in my house, nigga\nLowkey like them O.G.’s, they talkin’ crazy, they O.P\nI stay solo, no co-D\nHow he hate on me but don’t know me?\nI’m OT, can’t coach me; my watch red, nigga, mo’ me\nWhat I got tucked, you won’t see\nI’m off drugs, don’t approach me\nDeath to you, put Tec to you; he cross me, put a X through you\nHe broke, can’t be next to you; he play around, that’s death to you\n\n[Verse 3: Lil Yase]\nOn God…God…ay, gang, ay\nNigga, all blues (All blues)\nI just run and check for all blues\nI’ma spend it all on more Trues\nSike, I’ma spend it all on more shoes\n$1500, nigga, all Lug’s\nGot a white bitch, A.K., all boos\nNigga, who is who?\nGimme two, I’ma do a nigga crew\nTell ‘em too, they don’t even know that it was due\nGang gang getting money like an old dude\nPull up in a Chevy old school\nO.G.’s saying “Little man a cold dude”\n\n[Chorus: Lil Yase]\nYoungin’s thuggin’ so hard probably think they know Pac\nGang, gang, gang, gang, gang, whole mob\nNo suckas, Blow Pops\nWe slide, on God\nOn God, on God…we slide…\nOn God, on God, on God, on God", "image": "https://images.genius.com/cb0202ebcc599ee42eec3506fa19dd2f.500x500x1.jpg"}], "artist": "Too $hort"}