{"songs": [{"title": "Do You", "album": "Pimpin Ain’t Dead ", "year": null, "lyrics": "Huh\nYea baby girl, you know how it's going down\n2003, Do or Die, J.P., Twista still\n\n[Verse 1]\nWell, when I heard a knock at the door\nMust of been the girl that I met on the lo\nShe real thick, nice shape 5-4\nHad a few here so we head to the show\nAfterward we hit the Mo Mo Mo\nYes stay click, in the Expo\nI'm city sharp, buy the mink to the floor\nDamn natural, never walk from the store\nGimme a minute, and get down with a pro\nP. I. M. P. P. O. get a few friend like a party fa sho\nWe can hit a tune like my homie Debo\nAll in the mall buying Avirex, we can sport mine called S.E.X\nPlatinum link, all in effect\nI can pick head but I'm a bad for a check\nIn the truck though, so I can hop in the Lex\nBaby got back, but I'm trying to relax\nP.L.A.Y.E.R., giving her eyes\nThen we head to the bar\nNever give her money, cuz she know she a star\nDid you wanna ride in my car?\n\n[Hook]\nDo you? (Do you? Do you? Do you?)\n\n23's like Jordan on the Escalade\nGot a pound of dro' girl, if you wanna blaze\nYou can let your hair down, while the AC blow\nBefore you get in, I just need to know\n\nDo you? (Do you? Do you? Do you?)\nI'll keep it on the low\nDo you? Do you?\n\n[Verse 2]\nIn the mood, like yes y'all\nRather be, let it test y'all\nLight the B if it's special\nCan I undress to relax y'all\nWell, stretch out like a Lex ball\nIf it's that raw, to the chests with the Remy\nLike a slug with your vest off\nLet me touch it, if it's that soft\nAnd relieving in the menopause\nI can't believe how they sent them off\nTook the number then I'm in the mall\nBeing grinning bout to spend them all\nJust balling, shot shot calling\nHolla at my dogg while they sipping alcohol\nReally want to kick it, but they all just stalling\n6 dime pieces, checking out my pausing\nThey looking like ooh, he flossing\nBaby girl, I don't do this often\nIn the 5 double 0 for sho'\nWe still ride the Cadillac, slam the doors\nSuppose I kick back, keep the flows\nDressed to impress, then flex the ho\nCheck the dough\n\nDo you? (Do you? Do you Do you?)\nI'll keep it on the lo\nDo you? Do you?\nDo you?\n\nAn it really don't matter, where we go\nLet's sip this Henny, pop this\nMo\nBefore I strip you, I just need to know\nCan I do you?\n\n[Verse 3: Twista]\nNow I was geeking, when I met you in the club\nHad me feeling on your booty, and the brother was a 50ball\nFor you, I even popped some Crissy in the tub\nAnd my body was start wondering when if I'm a get the draws\nLet me know if I'm in the right lane\nTell me when I say the right things\nI got tight flame\nRollin thru stunting why are you running\nCuz I'm coming with some pimp-type game\nIced out charm, chromed out truck\nComing thru balling like I don't really give a fuck\nBlowing the fatty, an purple, with the windows up\nWhen I'm sipping on Hennessey and Hypnotic getting stuck\nAnd I need a thug\nTo care for me while haters be attacking me, backing me\nTo a corner while a brother trying to get theirs\nAnd I need a queen backing me while I'm running my faculty\nTelling me I be lethal when I spit words\nHit herb................\nHold it in, then blow it out\nDo you like the way I flow it out\nDon't ever act funny or petty with the money\nWhen I throw it out\nDo you like how I talk\nDo you like the way I ride\nDo you like the way I pimp spree's\nYou can let me down easy\nCuz' still ill be the player Twista slash be a P.I.M.P\nNow baby, do u?\n\n[Hook]", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}