{"songs": [{"title": "Jealousy Woes II", "album": "Infinite", "year": "1996-11-12", "lyrics": "[Intro: Sample]\nJealous!\nJealous!\nJealous!\nJealous!\nJealous!\nJealous!\nJealous!\nJealous!\n\n[Woman's voice: (Talking over the singing)]\nJealous?! What he mean \"jealous\"?\nKnow what I'm sayin'? He just mad ‘cause he all with them ugly hoes, know what I'm sayin'?\nGirls don't buy him no clothes\nHe bought that ho some clothes!\nHe don't buy me no clothes\nThat nigga ain't got no money, no vibe, no dick\nI mean, what do I got to be jealous fo'?\nHe ain't gonna make it nowhere\nHe ain't got no type of time\nHe has no career move, I mean…\n\n[Verse 1: Eminem]\nI come home every single day from workin' double shifts\nAnd stop along the way to pick you up a couple gifts\nI come inside and you pretend you miss me\nWhen you kiss me, then you diss me\nAnd we strenuously fight continuously\nAgain you frisk me, for numbers, tryin' to bust me\nIt must be only just because you never learned to trust me\nPlus we only squabble over irrelevant issues\nToo many tissues for my feelings you misuse\nI buy you jewelry, you make a fool of me\nI bring you diamond rings, you say I'm bad at timin' things\nSo what's a man to do\nWhen all I hand to you is handed back to me?\nYou act to be this gangsta bitch\nThat ain't what first attracted me\nI used to love your company\nNow you’re always pumpin' me for information\nAnd you tell your friends you plan on dumpin' me\nSo I'ma wait for your evacuation\n‘Cause every accusation\nMakes me wanna smack your face in\nSee, I've never been so sure, and you're just insecure\nSo my solution to your jealousy presents a cure\nI recommend you take your things and check 'em in\nLook at the nervous wreck I'm in\nI need my second wind—say what?!\n\n[Hook: Sample x8]\nJealo-!\nJealousy!\nJealousy!\n\n[Woman's Voice: (Talking over singing)]\nFuck you and what you going through! Fuck Eminem!\nHe just mad ‘cause I left that nigga for another man\nMe and Eminem don't need nothin' but minus money\nImmature, me? Nigga ain't got no dick\nNo swang in his thang, know what I'm sayin'?\nHe just mad ‘cause I'm gettin' it all night\nJealous of me, know what I'm sayin'?\nThat's what I'm talkin' about\nMotherfucker just tryin' to get this pussy\n\n[Verse 2: Eminem]\nI used to be a puppet and a sucker for your silent treatments\nI used to be intoxicated with your sweet scents\nUntil the day I started followin' your feetprints\nAnd tappin' in your phone conversations\nThrough the heat vents—it made complete sense\nThere's someone else you like\nSo I confronted you and asked you, \"Who was Mike?\"\nAnd you was like, (I need a new nigga)\n\"Someone rich that I could follow\nAnd you'll be over me by the time you see tomorrow.\"\nLeavin' me in sorrow, Brandy never felt so brokenhearted\nI fell apart when you departed, then the jokin' started\nI was an open target, you play comedian\nAnd I became the laughing stock\nBut now I'm on my feet again\nAnd so we meet again, you're actin' like an ex-wife\nAll in my sex life, I got a message from Phife\nIt goes, \"You didn't want me to see yo' hon\nDon't want me now, take the towel, wipe your brow!\"\nQuit tryin' to hunt me down!\nYou run me down and now your tryin' to apologize\nFor all the lies and everytime you made me ball my eyes\nBecause I got a bigger wallet size, you wanna swing it\nJealousy is in the house, y'all—fellas, sing it!\n\n[Hook: Sample x12]\nJealo-!\nJealousy!\nJealousy!", "image": "https://images.genius.com/a4f759aba2e16ec0dc9f29d1577cfede.1000x1000x1.jpg"}], "artist": "Eminem"}