{"songs": [{"title": "Take You There", "album": "Lost Files", "year": "2015-01-20", "lyrics": "[Verse One]\nI just wanna take you there\nLet me cut the chase she was 18\nPretty young, pretty new to the date scene\nBeen exposed to fake fiends\nBut she chose to stay clean\nMommy what's your name\nI know that you're tired trusting lames\nYou can trust me I'm with you\nWe together you ain't came with me I'm with you\nLet's converse I'm straight\nEven though you say conversate\nSee right now you a C\nLet me upgrade you to a B\nYou square I can make you cool\nYour boyfriend taking you back he old school\nNow what am I really suppose to do\nAttraction is pulling me so close to you\n\n[Hook] (Sample in background)\n[?]\nI just want to take you there\nBaby give me a call, how long would it take to break you off?\n(Break me off) Yeah break you off\n(Break me off) Yeah break you off\n\n[Verse 2]\nYou suppose to be free\nHe going take you to DC\nImma take you to BC, Central [?]\nDamn it could be easy\nHave you even been on a plane yet\nWar in yet figured out your own lane yet, baby all you got to do is say yes\nWe can do it in real life\nWe can be out of here tonight\nI'm loving all your features\nYour breath smell like peaches\nWhat kind of bubble gum you chewing?\nHow many sit ups a day do you do if you do 'em?\nThat stomach is looking right\nCall your man up and tell him to take a hike\n\n[Interlude]\nHello? Hello?\nAre you there?\n\n[Hook]\n\n[Verse 3]\nTake you where you never been\nYou with him you never win\nYou with me you never lose\nNow get rid of them tennis shoes\nI'll teach you what you never knew\nI'll put you up on a pedestal\nDon't think just listen if and when I come and take you there\nI don't care if your so young\nYou was twelve in '01\nYour momma will probably kill me\nBut your father got to feel me\nLook at you your gorgeous\nBut I think your not sure yet\nMature yet cause you ain't heard bonjour yet tearing up stores on tour yet\n\n[Hook]", "image": "https://images.genius.com/5de2ce42d7b7351d0a2104ea1e025b4d.500x500x1.jpg"}], "artist": "Royce da 5'9'’"}