{"songs": [{"title": "Field Negro", "album": null, "year": "2019-02-08", "lyrics": "[Verse 1]\nYou ain't been gettin’ this money all your life\nOh you forgot about the roaches and all the mice\nOut here livin' an alcoholic rapper artist life\nWhat happened to art is life?\nAll of you kids is in charter school\nAnd you startin' to do everything in private\nMaybe that’s from all of the charter flights\nMake sure whatever you're doing is not in the dark\nYou know this shit is bound to come out eventually\nUnderneath all the lights\nRob a man, kidnap him, take him for all his rights\nDegrade him all his life, rape his daughter, his wife\nNine months later, use the baby as piranha bait\nWe wasn't even allowed to pray, let alone read or write\nPeople like Cube opened them doors\nAnd politically correct negroes like you\nClose 'em to keep your ice\nClap for 'em, they make you feel like they love you there\nYour whole platform could swim with the fishes\nLike Huggy Bear\n\n[Interlude]\nYour Maybach and your house is like that important that you won't move at all. It's distractions, that you won't say anything at all in risk of losing something. Right. You won’t say anything on anyone’s behalf at this point?\n\n[Verse 2]\nYou ain't been gettin’ riches ya whole life\nOh, you done forgot? The oven door open\nOn the stove in the kitchen to heat up the house\n'Cause they done cut the heat off on ya home, right?\nOkay, now you thinkin' you livin' so far away\nJust ’cause you neighbors with Britney and K-Fed\nEvery artist in the game are phony\nFuckin' all the same thotties in the game since way back\nAnd all the same thots in the game been givin' the same top\nTo the same guys in the game like one of Sway hats\nThe plight of the miserable wasted talent\nOnly guys with the hits are the Tygas, Drakes and Khaleds, shit\nThis is what happens when your favorite artist never get challenged\nYour favorite fella from the NFL has been silenced\nMy dad said, \"Under no circumstance should a man\nConsidered a legend have nothing left on his deathbed\nAnd any black man not willin' to stand up for his own rights\nShould lose the use of his right and left leg\"\nThey say I couldn't do it, so I went out and did it\nThey said they gave it to me, so I ain't ask for more\nI stayed active every time a door slammed in my face\nStayed at the door, I stayed knocking, I stayed rockin'\nI did it my way without all the complainin'\nAnd all the whinin' all day like Kanye or Wale\nFor the validation of all the bloggers\nAnd all the same gay ass awards\nFuck y'all and all them gay ass awards\nWe are livin' inside the same hell\nAnd we all willin' to die to go the same heaven\nBut we are lyrically not on the same level\nI'm scribblin' my killings down and sendin' them out like chain letters\nI'm not here for the crown nor Tory Lanez cheddar\nI'm here for respect or else I'm willin' to take off the belt\nAnd whoop a young nigga's ass with it like James Evans\n\n[Interlude]\nA house negro look at you and say\n\"Man you crazy, what you mean separate?\nWhere is there a better house than this? Where can I wear better clothes than this?\"\nIt was that house negro\nIn those days he was called a house nigga\nAnd that's what we call him today, 'cause we still got some house niggers running around here\n\n[Verse 3]\nYou only been livin' a small part of your life all the way up\nOh you forgot about your home that you grew up in\nWhen you were starvin' with nothing, when it was stripes on all The canned goods in your closets and cupboards\nYou grew stripes and you developed the heart of a hustler\nMy grind Shawn Carter as fuck\nI go back in time, sell George Washington Carver a nut\nPlus, none of these artist can beat me\nI'm Truman and Christ on the Noah's Ark on the waters of Fiji\nI'm truly the type that'd push your wig farther than BC\nLeave your brains all over the street\nMy heart's on my sleeve, put my seed in the Garden of Eden\nAnd start a new species, please, you know my steez\nHow you got a team and you ain't got loyalty?\nHow is y'all the kings and you ain't got royalties?\nI been around homicides since Marky D\nKool Rock Ski, you disorderlies, you know my steez\n\n[Verse 4]\nChildren is dyin', women is cryin', we under attack, fool\nWhat a better time to be famous, black and impactful\nName somethin' better to come together as one to react to\nShit we still comin' back from a checkered past like lumber jack suits\nYou play for the NFL, I just wanna ask you\nIf you don't kneel with Kaep, it's simple math\nThey cannot run it past you\nNiggas innovate, people penetrate, exclamate\nOff our inner hate\nWe oblige, so they make the riches, we don't rise\nThey just keep us high\nProduct of slave privilege, cop Ferraris to race a nigga\nI do any job you can pay, if I can make a livin'\nVodka straight, a whole lotta pacin'\nJust so I can make a decision\nKeep a honorable spirit\nWith not a whole lot of faith to distribute\nThey took the scriptures away and replaced it\nAfter makin' they own racist revisions\nThey crazy, basically they create shit just to play shit\nTo take away shit to rig it\nI'm pretty sure they Maker is livid, they racist, they bigots\nWhat's Christian about that?\nThe fakeness is vivid, the paper is printed\nThey should wake up every day\nAnd pray to the nature of business\nFuck a Laker, I could never play for the Pistons\nAt the expense of creatin' division\nThe Wraith is exquisite, I'm 'bout that paper\nBut it's gon' prob'ly take me a minute\nI much rather be a atheist chasin' my faith through a prism\nAssumin' the information is real\nThen play for a racist with a racist agenda\nI hate you niggas, bow figures\nThe misappropriation of wisdom got you\nSlaves to your own alienism, to pay a few bills, house nigga\nI rather get hit with a Patriot missile\nThan to be out here with ya exhibiting patriotism\nThey say a broke' clock is right two times\nBut it's never accurate\nTruth time, okay\nIf some of us don't have time, some of us have time\nSome of us perform in the halftime\nSome of us boycottin' halftime\nSome of us standin' up, some of us sittin' down\nReparations will never get back to us\nThey'll forever just laugh at us\nI think I found a way for you niggas to face your truth\nGo ahead and try to trace your roots\nThat shit is rather miraculous\nThem niggas took away the message\nAnd mess with the message in it\nEmbellish it just to spin it, just to sell that shit back to us", "image": "https://images.genius.com/3d6e35e92937887c18e1a2bddff9a537.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}