{"songs": [{"title": "Who Not Me", "album": "The Red Light District", "year": "2004-12-07", "lyrics": "[Small World: repeat 4X]\nUhhuhh no way no how, get like blaow, blaow, blaow kapaow\n\n[Ludacris - over Small World]\nYeah, you ever hear somebody sayin somethin\nAnd you think they talking bout you, you not quite sho' knahmsayin\nBut it ain't no way they talking bout you\nIntroducing the new members of Disturbing Tha Peace\nSmall World - from Norfolk, Dolla Boi - from Playaz Circle\nHere we go what?\n\n[Hook: repeat 2X]\nWho the fuck you talking to?\nNot me, couldn't be me, nah not me\nWho the fuck you talking to?\nNot me, couldn't be me, nah not me\n\n[Small World]\n3, 2, 1 - what's begun, is the start\nBut bitch we be saying we \"we just getting started it since one\"\nY'all been monitoring, pondering bout it\nHow bout I pull it out and kapaowee, I'll heat 'em up as hot as Maui\nBig Small World, Norfolk is the gang, extended clip in the jeans\nPut 'em in a box like Bisquick\nI'm a laker wit clips, get 'em in the lake wit clips\nTruth is ya a clipper with clips ain't cha bitch\nI'm bout my loot and dollars, I'll shot you for looting dollars\nBut you lootless and dollarless, fuck it I shot for Luda n Dolla\nI crash parties, blast with proposed toast\nI'mma have a problem like Scrap, if you blabbin like show hosts\nMuffle your damn lips, or there'll be mixtures of blood and dandruff\nIf you don't get my damn drift\nCreep to ya grave and leak D.T. Piss\nThis yo' highness at his least tempered\nKeep it pimpin' and watch\n\n[Hook]\n\n[Dolla Boi]\nI been having a bad day, the same ol shit\nWe don't give a fuck about who you is\nThe same ol clique, and the same ol biz\nThe same ol flip , wit the same ol whip\nThe same 4-4, with the same ol clip\nHalf the bullets gone, the otha half you can get, bitch\nR.I.P. Rick James \"I'm rich beyotch!!\"\nYou talkin' to much, nigga you a snitch bitch\nAnd we don't do it like that\nWe do 3 quarter drops and we bring a brick back, black\nDon't act get ya whole trap splat, ack\nUnload 'em reload 'em, we back black\nAnd when dem gats letting off\nRed dots, loud noises like planes taking off\nDolla Boi I got the game in a cross, make me bang at cha boss\nFor dem things coming soft, nigga\n\n[Hook]\n\n[Ludacris]\nOh, oh, oh, oh\nNow if a bad bitch wants dick, then it's dick I give her\nLudacris nigga, I stand and deliver\nNever back down, won't shake nor shiver\nFuck with me and get found in the Chattahoochee river\nThis 7 inch shank, will put a stop to his ticker\nBut shotties to the body make him drop much quicker\nYeah I appear to be a nice lil' nigga\nFuck with anything I love, I'm a stone cold killer\nEating off of 'Sace, sleeping on chinchilla\n8 figga nigga, I'm a multi milla\nSee me in the street, it can't get no realer\nGiving back to my hood with a pocket full of scrilla\nMy neighbors say my house can't get no bigga\nI do good ass bidness, with a bad ass temper\nPlease tell ya bitch, stop playing with my zipper\nOr I'll \"brrrrr-stick her, ha ha-ha stick her!\"\n\n[Hook]", "image": "https://images.genius.com/57e6650f3864beef0e227e02f76d83b0.1000x1000x1.jpg"}], "artist": "Ludacris"}