{"songs": [{"title": "Stress Ya", "album": "The Last Kiss", "year": "2009-04-07", "lyrics": "[Intro/Interlude: female (Pharrell)]\nIf you want it, come get it (New York City must be)\nIf you want it, come get it\nIf you want it, come get it\nIf you want it, come get it (New York City must be)\n\n[Hook: Pharrell]\nYeah, you can dance if you want to\nBut you really don't have to dance\nSee you got your eyes on the hustlers, you just wanna touch us\nC'mon with the lump in your pants\nSee, I ain't gon' stress ya\nBut I know my glow got you under pressure\nYou already know that the flow is extra\nStand right here so the blocks can catch ya, listen\n\n[Jadakiss]\nC'mon, c'mon.. naw, uh-huh\nYou know, AH-HAH! Uh, yo\nIf you wan' take a picture with money then stand right here\nYou see all eyes is on the man right here\nUs hookin up is the plan I swear\nAnd you ain't gotta dance, you could stand right there\nNice hips plus she got an ass to lean on\nType of honey that you wanna flash the green on\nReal New Yorker, brilliant author\nThe work still on the same scale as Orca\nStill sellin the kush and lightin the sour\nStill in the hood gettin right with the powder\nSo it ain't no need in fightin the power\nCause the flicks'll be up on every site in an hour, c'mon\n\n[Hook]\n\n[Jadakiss]\nUh-uh, uh-huh, know, AH-HAH!\n\nUh, yo - J to the MWAH\nI'm one of the best in world ma, that's what they say on the blogs\nLook in the garage, half of the cars\nOff the bars, and the other half off the mall\nMy entourage is large, so hard\n'Kiss run the streets, my niggas run the yard\nWhoever disagree could bet they get scarred\nWe keep it so rugged but we still so suave\nJust seen your girl, 'bout to give me a massage\nHer friend wanna join, 'bout to make it a ménage\nLet the desert off for the sake of the mirage\nCause it all look good, until the Louis lands far, yeah\n\n[Hook]\n\n[Interlude - repeat 2X]\n\n[Jadakiss]\nUh-uh, uh-huh, you know, AH-HAH!\nUhh, yeah, yo - flow extra, dough extra\nThey recognize the glow no matter who he's next to\nRecognized your ho, then he probably sexed her\nAll my hood niggas gettin money, throw your sets up\nYou know what it is with the kid, put your bets up\nHoney wanna slide but I got her under pressure\nKeep tryin to tell her that I ain't tryin to stress her\nBut come stand right here so the blocks can catch ya; let's go\n\n[Hook]\n\n[Outro: Pharrell]\nNew York City must be...\nNew York City must be...\nNew York City must be...\nNew York City must be...", "image": "https://images.genius.com/74f6cb8e37420dc73fd4019537e3cbd1.953x953x1.jpg"}], "artist": "Jadakiss"}