{"songs": [{"title": "I’m Gone", "album": "Under Pressure (Deluxe Version)", "year": "2014-10-21", "lyrics": "[Verse 1]\nLiving life like this is so crazy, this world is amazing\nOne day you're on top and the next she having your baby\nLiving life like this I get down, uh, when they come around, uh\nI do my best to fall back and not, not make a sound\nFeel like my mind gone but I'm still here\nDon't fuck around cause they kill here\nThis music, it kill fear\nI use it, when I need to hear\nBeen there, done that\nDrop the shit, they gon' run it back\nSimple shit, man I'm done with that\nFake rap, take it back\nMy chain heavy, got a lot of money\nMy bitch bad, have fun with that\nI've been there and don't want it back\nIf I see the bitch I might run it back\n\n[Chorus]\nCause I'm gone, so long, I'm gone, so long\nI'm gone, so long, I'm gone, so long, I'm gone\nDrink, smoke, vibe, fuck, chill, drive, talk, think about it\nDrink, smoke, vibe, fuck, chill, drive, talk, think about it\n\n[Verse 2]\nSo what now? (So what now?)\nLet's get down—let's get drowned, on this vision\nMy division is the greatest that's around\nFeel the vibe (feel the vibe)\nThis is where I'ma be for as long as I'm alive\nI could vibe with this, fuck around and die for this\nBut would you ride for this? Better ride, no lie for this\nThey say \"what's your motivation?\"\nCutting these records like back in the basement\nBoy, fuck a vacation\nWe do this for love, not no validation\n\n[Pre-Chorus]\nLiving like this is so crazy, this world is amazing\nOne day you're on top and the next she having your baby\nLiving life like this I get down, uh, when they come around, uh\nI do my best to fall back and not, not make a sound\n\n[Chorus]\nI'm gone, so long, I'm gone, so long\nI'm gone, so long, I'm gone, so long, I'm gone\nDrink, smoke, vibe, fuck, chill, drive, talk, think about it\nDrink, smoke, vibe, fuck, chill, drive, talk, think about it\n\n[Verse 3]\nWanna get it like this\n(I think so) when I'm driving\n(I drink slow) when I'm vibing\n(You never know, know, know, know) (Lets go!)\nI got it, posted up at the crib with something exotic\nI don't smoke but she love to smoke\nAnd look good as fuck when she light it\nWhen she ride it, it's crazy, love when I get inside it\nBaby stop tryna hide it, if the feeling's there then abide it\nBaby girl, where you been? I don't know\nI feel like this is the moment, I mean it feel like it don't it?\nShit girl I know that you want it—but fuck all that\nTake the time to get down, stop all that running around\nI'm feeling you feeling me, know that you into me\nBaby girl let me get down, cause my mind gone\nThat's the type of shit that I'm on\nGrip the mic and I go (Whoo!)\nFuck around with this flow (I know)\n\n[Pre-Chorus]\nLiving like this is so crazy, this world is amazing\nOne day you're on top and the next she having your baby\nLiving life like this I get down, uh, when they come around, uh\nI do my best to fall back and not, not make a sound\n\n[Chorus]\nI'm gone, so long, I'm gone, so long\nI'm gone, so long, I'm gone, so long, I'm gone\nDrink, smoke, vibe, fuck, chill, drive, talk, think about it\nDrink, smoke, vibe, fuck, chill, drive, talk, think about it\n\n[Outro: Thalia]\nMaking a single before your album is like putting together a trailer for a movie you have yet to shoot", "image": "https://images.rapgenius.com/8b6fee06da3c7e10974f9c63779ffb87.1000x1000x1.jpg"}], "artist": "Logic"}