{"songs": [{"title": "It’s a Boy", "album": "The Ruler’s Back", "year": "1991-11-21", "lyrics": "[Slick Rick]\nIt's me at last, the Rickster, Def Jam's where I be\nAnd most agree it’s kinda amazing folks are born from where we pee at\nThough I definitely fiend it, baby no way, chills, clever mean it being\nGot to be careful (…be told), commercial ever seen it?\nWant a few hot ropes, some ask am I cheatin’, do I? Nope\nNot a dope, love the mother, also loves me too I hope\nSo I dig her a lot and although shorty honey break a nigga\nHow you figure, bein’ a big rap money makin’ nigga\nCute as a button, he tell ’bout the time we picked for cotton\nSo it ain’t forgotten, hope I don’t spoil the nigga rotten\nAlso, don’t discriminate white, he’ll be quite bright, if taught him right\nIf not he like ask heavenly father, help me raise my shorty right\nSo when I come home with the coil, I say “yo shorty run to royal”\nSeein’ as I’m loyal and livin’ on soil, it’s best when you have someone to spoil\nSo any toy, he wants he gets, yo kids ain’t worth it midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy\n\nPictured friends, milk and cookies, when you’re done with the boy’s game\nToy plane, Ricky Jr. being bundle of joy’s name\nAnd furthermore teach birds and bees\nSo won’t be a nerd and burst herds of, second and thirds of\nAnd “Dada” better be the first words of\nJust kiddin’, son’ll be [need] a one man girl, spend a lot on what I be wearin’\nBest of care, best that money can buy is what he’ll be wearin’\nWith these weathers around, protect him, they’ll say in a cage I kept him\nThough wage you kindergarten probably be another major step and\nLo and behold a star holdin’, ‘cause yo be loadin’ trips and sowin’\nYa knowin’, throwin’ a fancy home for him to grow in\n“He’s kinda pleasin’ to raise\"… so baby say. No thank you… ease in\nSneezin’, now what do I do when he cry for no reason?\nThough any toy, he want he get, yo kids it ain’t worth it, midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy, yo\n\nBaby mom, under wing, though if dress up, could string\nLine of cuties, though cling, don’t wanna mess up a good thing\nYou know how it is when guys that pay girls seem to hog us\nFiend and dog us, scheme for more guts\nGoin' into labor date, 18 of August\nIt’s that time tellin’ friends, congratulate’s yellin’\nGonna be six weeks premature, but thanks to God, he’s doin’ well\nAnd givin’ credit where it is due, while rap’s achievin’ let it\nAs for bills forget it, ’cause the way I rap, don’t even sweat it\nMy own when me and my hon son, don’t fuss, agree\nThough son, I still kinda wish I coulda been there when he was born at 3:01\nBygone be gone, there’s nowhere wrong and all\nYour son’s about and since I didn’t and this being the first\nYou know I had to write a rap about the incident\nAnd the rose is for the squeeze, I would’ve sent a few no women with the kin in it\nWish us luck world as we enter a new beginning\nAnd like I said, any toy, I’m tryin’ to tell ya that midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy", "image": "https://images.genius.com/9492e61c778d8d1c0b9cddf2393d4e25.500x500x1.jpg"}], "artist": "Slick Rick"}