{"songs": [{"title": "Who’s the Champion", "album": "The Great White Hype soundtrack", "year": null, "lyrics": "Intro: RZA and Ghostface, Raekwon () and somebody []\n\nWord. Man fuck that nigga\nFuck that crab, ass, bitch [Who the live niggas youknowhatI'msayin?]\n[You niggas know how to shoot joints] (Put down the gun son)\n[Elmira, Riker's Island, coming from Brownsville] (Put down the gun son)\nNiggas tried to front on my little sister (Put down the gun)\n[YouknowhatI'msayin we represent youknowhatI'msayin?]\n[YouknowhatI'msayin? Big Tony Rhome, peace to my man Tony Rhome]\nThey tried to, tried to front on this (Put down the gun son)\n[RZA respect youknowhatI'msayin? We keep it real]\nYeah, check it out y'all (put down the, put down the gun son)\n[Put your guns down, throw your hands up]\nIt's on like that y'all word up, Iron Man comes back\n[Represent, you niggas gotta shoot joints]\nYo check it\n\nVerse One: RZA\n\nPut away your heaters, throw up your dick beaters\nAccurate blows to his nose shut his eyes closed to a centimeter\nBitches on the fences wonderin what the fuck the suspense is\nI land heavy uppercuts in the corner of the park fences\nKnocked his mouthpiece front teeth got locked inside my knuckle\nHe grabbed the belt buckle, attempt to catch me with a couple\nOf low blows to the nuts, on ringside was as a giant du-els\nSend your Barb for this fuckin jew On a Wire\nHe couldn't chessbox that's when he reached for his ahhs\nBrother chopped me on the top of my knot, but he got stopped\nWhen a twelve ounce bottle of Bartyle and James had him startled\nA bitch threw it caught him in his head, at full throttle\nHe fell, the glass crashed, he wasn't saved by the bell\nThat was his ass black\nSo when it comes to physical combat\nWe can take it hand to hand or go beyond that\nDo you want my gat to make the contact?\nRetirin cats who lack the heart to fire back?\n[We take all crabs overboard]\n\nChorus: Raekwon\n\nPut down the gun son, son matter of fact, shoot the one on one\nHold it down, make sure the head, sure nuff don't hit the ground\nLampin on the handball courts, or the square, we can take it there\nSettle it son, who the champion?\n\n[It's like that, niggas want to front, one more time?\nI'mma show you like this. One on each side\nThis is it word up. We gonna lay you back\nWe gonna rest your back, you won't know how to act\nWhen it come to bigger, showin and provin\nNiggas styles is wack] Who the champion? Settle it son\n\nVerse Two: Ghostface Killer\n\nYo!\nI had to run up on this King I Divine, for his shines\nHe saw the stash and caught my mailbox for eighty dimes\nHe saw me stashin, like a pipe-link for mega fiends\nI held it down like the finger fly miraculous King\nPeep through the heavy small get the camoflouge\nStarks master in charge, pushin through every building, sippin egg nog\nNiggas know my status God body carry big batters\nFiends know me for my blue bags, besides smackin crabs\nAnd earnin mine, this bitch Sha cat, gotta get his back bent\nWhat the hell just made him fuck with my intelligent?\nBack to pollyin', I heard some noise we pack a two twelve\nThere go Lord Shamel, faggot made a sale\nHe's sellin my shit, I should slap fire out his ass\nSnap his bones in half and watch the stock market crash\nI walked up on him, he had the nerve to say Peace God\nAin't nuttin Peace God, you stole it now we out in the streets\nTake your shit off, nigga you soft, back up off\nYou's a shady nigga, I'm a sever fig you with a gloss\nI snuffed him, threw a crazy left and I cuffed him\nAllah don't like ugly so I held back from bustin him\nI passed the burn off, he caught me from the blind side\nTapped a nigga jaw, I shot my fifty-two style, and crazy raw\nI had my ice on, tapped a few times, he started leakin\nThe King with the deadarm, Shamel fell to his knees and\nHe started wheezin, losin his breath from smokin trees and\nI'm still breathin, bleedin because it's frontin season\nNow I got that project belt, international/national\nWorldwide, I let Shamel slide\n\nChorus", "image": "https://images.genius.com/1534220b1e638f8345e45190021be7bd.500x500x1.jpg"}], "artist": "RZA"}