{"songs": [{"title": "Call of Duty", "album": null, "year": null, "lyrics": "[Hook: Akon]\nThis is a renegade salute, yeah we on that\nAnd keep what we kill, yeah we on that\nWe never fightin’ we just cock and go click clack\nTurn that ass ‘round, bring it all back\nKnow you see me\nI know you see me\nI know you see me\n\n[Bridge: Akon]\nEverybody call me the top driver\nRun it down to the end of the drive line\nThis is a callout, callout, callout\nAre you ready for the massacre?\nSomebody throwing down, down, down, down\nSirens blaring, but they can’t help you now\nSirens, can’t help you now\n\n[Verse 1: Raekwon]\nMurder by numbers in Monaco\nMe all fresh to death, big white thing go kinda slow\nGot my elites in the suites, my stones is roughed up\nCamouflage pants, my gold cheek\nWhen we go, yo, we go together\nWhatever is said, it’s still combat boots on the door\nStill get a million a week, got the lions in the yard\nBarbeque and breadsticks and chic\nFly generals, international, rational raps\nWho kill like ten percent of these rats\nMy team thumpin’ in the crunches\nWe fucks with the hard, not anything else just hard\n\n[Hook: Akon]\n\n[Verse 2: Raekwon]\nTiger claw scar on his neck, rockin’ links\nMad Bull PTS riles and minks\nSoldiers and gorillas fall fast in the paint\nProtect the projects, intersections, and inks\nYou still prove gooses are we mooses?\nEars and eyes, mad jury on that blare like acoustics\nKill, kill, kill, kill, yeah more, while she's dying to feel\nSoldier ceremony, we gon' go with horses\nNobody dying tonight, cause I said so\nMore gold chariots, fly back, we fly home\nSit back blinded in the cabin, General Bang\nHundred medals on his chest, neck and stab him\n\n[Hook + Bridge: Akon]\n\n[Outro: Akon]\n(Revolutionary) What is it like to be helpless?\nWhen you're laying there hungry, yeah\nFeel the pain and you're half dead\nNot a game, no contest\nAnd no matter how strong you are\nThought that you could be\nYou listen to me (hey)\n\n[Hook: Akon]", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}