{"songs": [{"title": "Make it Hot (Unlisted Bonus Track)", "album": "Can’t Stay Away", "year": null, "lyrics": "[P. Diddy]\nYo $hort man, I was with this trick the other night\nShe was like, \"Hey Diddy - um, Diddy - why are you so motherfuckin fly?\"\nI had to tell the bitch I'm just about that paper beotch\n\n[singers]\nIf it's 'bout that money (make it hot)\nIf it's about that bullshit (make it stop)\nIf you got that paper, we can roll\nNo time for haters, gotta go\n\n[Too $hort] + (Diddy)\nI flew to L.A., just last week\nJumped in the limo, checked in the suite (yeah)\nMade a few calls, it's time to go (time to go)\nAnd bust a few rhymes at the studio (c'mon)\nNo I don't do it for the love of it\nI love it but I do it for the love I get (that's right)\nBig checks, you think the sex is next\nWhen I left the studio had to go do a show\nFor the ten, with the triple zeroes (yeah)\nThat's why I'm never flippin kilos\nFlew up to the Bay, then back to Georgia (yeah)\nHad to catch a flight to Tallahassee, Florida (c'mon)\nI did a show at the Kapalua (let's go)\n$hort Dawg, what'chu 'bout to do now? (what'chu 'bout to do baby)\nI'm gettin money, caught a flight to New York (c'mon)\nJust another day in the life of Too $hort\n\n[Hook: singers] + (Diddy)\nIf it's 'bout that money (make it hot)\nIf it's about that bullshit (make it stop)\nIf you got that paper, we can roll (we can roll)\nNo time for haters, gotta go (c'mon)\nWhen it's 'bout that mo-ney (make it hot)\nGotta keep it comin (it can't stop)\nNiggas hate us all day long (we can roll)\nCause we get our paper on and oh-nnnnn (gotta go)\n\n[P. Diddy]\nEverything I do is a world premier (world premier)\nI know you're not tryin to front girl c'mere (c'mere)\nI get up early in the morning work late at night (that's right)\nSo when you talk about me you say it right\nI get my pimp on, whenever I get on\nPop rock R&B or rap, it's a hit song (and you know this)\nI keep it movin no matter what your age (yeah)\nBitches screamin out \"Puff Daddy's on stage\" (Puff Daddy's on stage!)\nBreakin necks, cashin checks (uh-huh)\nWhen I'm not makin money I'm havin sex\nInternational, superstar (c'mon)\nPeople wanna know just who you are\nI'm that Lear jet ridin (yeah) mansion residin (yeah)\nIf I throw a party you'll be dancin all night and (that's right)\nLet's have some fun girl, it's okay (c'mon, it's okay)\nI work hard now it's time to play, come on\n\n[Hook] w/ variations and ad libs\n\n[Too Short] + (Diddy)\nI did a lot of work for the homies for the lo-lo (yeah)\nBut I ain't doin that kind of shit no mo' (no mo')\nAsk Puff, fuck all that retirement stuff (fuck all that shit)\nI worked too hard so the price went up\nI'm chargin fifty, for sixteen bars now (that's right)\nIf you want a whole song it's a hundred thou' (woo!)\nIs it worth it? (Is it worth it?) I ain't no crook\nA hundred thousand dollars might get you a hook (yeah)\nFrom this nigga right here, I know you know\nAnd you gotta pay extra for the video (extra)\nSo cut the check for the right amount (send the right amount)\nIf not, you can wire it to my account\nThe only other way is to pay me cash (yeah)\nAnd ain't nothin wrong with that\nKeep it fat, give me the scratch in big stacks (c'mon)\nCause you fuckin with a real mack, bitch get back (that's right)\nBack, bitch get back (bitch get back)\nBack, I said BEOTCH!  I said get yo' motherfuckin ass back\n(C'mon, you know you fuckin with some real players here bitch)\nThat's right (step back)\n\n[Hook] w/ variations and ad libs\n\n[Too $hort] + (Diddy)\n(Money over hoes) That's right\nSo if you want me to do a guest appearance on your next album\nJust remember one thang - it's gon' cost you man\nCause we gettin our money on\nThat's right, $hort Dawg in the house (yeah)\nP. Diddy in the house (yeah, yeah)\n$hort Records, Bad Boy (Bad Boy)\nYeah, that's right\n\n[female singer - repeat 2X]\nToo $hort, Too $hort, gotta make that money\nTwo-thousand watts, two-thousand watts\nGotta make that money, Bad Boy, Bad Boy\nGotta cash that money; gotta make that money money\nGotta take, gotta make, gotta cash that money money\n\n[Diddy]\nYeah, and we out", "image": "https://images.genius.com/31a42aa43e1b297422c8b89c0ea0a2c0.500x493x1.jpg"}], "artist": "Too $hort"}