{"songs": [{"title": "Words I Never Said (Remix)", "album": null, "year": null, "lyrics": "[Skylar Grey]\n\nIt’s so loud Inside my head\nWith words that I should have said!\nAs I drown in my regrets\nI can’t take back the words I never said\nI can’t take back the words I never said\n\n[Verse 1:Lupe Fiasco, Rilo]\n\n(I really think the war on terror is a bunch of bullshit)\nThat’s right Lupe people that don’t think that they’re just foolish\nIt don’t matter if you’re black white Christian maybe jewish\nI’m here to do something to your mind you think that school did\nNah. They’re just there to keep you\nCause in the future they might creep up on you and say they need you\nFor reasons thats so dark inside its not exactly see through\nFreedom is my calling card and I’m speaking for the people\nYeah\nI may be speaking bout the same thing\nSegregation makes the nation hostile where do you hang\nIn the mist of the war smoke or in the lies like your pope\nThe worlds unfair cause everybody's lazy\nEverybody's on there ass talking bout maybe\nWell maybe if you act on facts there may be crazy aftermaths\nIf you're looking for the answers I’m the teacher for you after class\nThink about the words that I say and don’t believe what the media plays\nStop thinking in radio waves\nThe future could be saved if you listen to your brain\nAnd don’t be know as just the same\n\n[Hook]\n\n[Verse 2: Lupe Fiasco, Rilo]\n\n(Now we can say it's not our fault, if we never heard it)\nBut think about the situation, is it really worth it?\nYou’re thinking bout the better, while everything is worsened\nYou’re thinking bout the change that you’re never really earning\nListen to the cries at night the souls of people burning\nDon’t worry bout letting out truth even if the gov is at your door\nWe could be resting in the lead just put the message on receive\nAnd don’t believe the fucking message on the teeeve\nWe take a step an then we leave which is why the gov is on your beef\nYou think that things are true cause you hear them from your peers\nBut did you know the cure for cancer been here many years?\nDoubt you do cause doctors tell you that were almost there\nNow tell me some thing does that even sound a little fair?\nYou pay your taxes and you think there’s no more loans to pay\nLittle did you know\n(They can take your home away)\n\n[Final Verse]\n\n(I think that all the silence is worse than all the violence)\nWe think that things are hard when we never even tried it\n(We scared of almost everything, afraid to even tell the truth)\nI’m only here to help you through I hope that I’m not failing you\nWe gotta make them scared of you and make it so they can't refuse\n(Consider this your bailing out, so take a breath, inhale a few\nMy screams is finally getting free, my thoughts is finally yelling through)", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}