{"songs": [{"title": "When I’m Nothing", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[Intro: DMX]\nUhh, uhh, uhh, c'mon!\nWoo!  Uh-huh\nYeah, more real life (grrrrrrrrrr)\nThat's how it is baby, you know it's real\nMore real life, you know it's real (grrrrrrrrrr)\nFrom the dog, y'know?\nYou know it's real, uh-huh\nYou know it's real (grrrrrrrrrr)\nShit is always real baby, forever\n\n[Verse 1: DMX]\nMy peoples say they got love for the dog, right?\nThey holla like \"Whattup dog?\" Alright\n'Cause no matter what streets in a dog's life\nAnd I'm the type of dog gon' go all night\nSome cats think that it's a game that we're playin' here\nYou keep thinkin' it's a joke, I ain't playin' here\nFuck around if you want, I leave billionaire\nDo what, go where?  Shit I'm stayin' here\nThis whole motherfuckin' rap shit is all mine (WHAT?!)\nJust thought I'd let you know one mo' time (uhh)\nShit, I ain't said nuttin' when it was yo' time\nNow, niggas is mad, 'cause Ain't No Sunshine\nAnd you cats won't like it when the rain hits (UHH!)\nThat's the nigga X on the same shit (uh!)\nAnd if you wanna see how fucked up the game gets?\nWatch what they do when you ain't shit\n\n[Chorus: Stephanie Mills]\nWhat you gonna do when I'm nothing?\nYou're crazy about my styyyyyyyyyle\nWhat you gonna do when I'm nothing?\nTell me nowwwwwwwwwww.. ohhhhh-ohhhhhh\n\n[Verse 2: DMX]\nUhh, uhh, uhh, uhh\nEvery cat I meet like, \"Show me love!\"\nEvery girl I meet like, \"I want a hug!\"\nShit I might be just tryin' to pick somethin' up\nCan I get an autograph -- man, what the fuck?!\nIs the love gon' be the same when\nWe start to realize that the game ends (uh-huh)\nEven me, will I have the same friends? (uhh)\nEven when I ain't got the same Benz (UHH)\nWhat about when the dough get low (woo!)\nShoulda peeped money from the get-go\nDisappeared, ain't that a bitch yo?\nNow you know, that's that bullshit yo\nCan't forget all them fake \"love you\" bitches (uh-HUH!)\nTake 'em to the room, wanna fuck you bitches (uh-HUH!)\nWalk through the mall wanna touch you bitches (uh-HUH!)\nListen!  I got a wife, I don't trust you bitches (c'mon!)\n\n[Chorus: Stephanie Mills]\nWhat you gonna do when I'm nothing?\nYou're crazy about my styyyyyyyyyle\nWhat you gonna do when I'm nothing?\nPlease don't have me acting wild\nWhat you gonna do when I'm nothing?\nTell me nowwwwwwwwwwwwwwww\nTell me now, tell me now (WHAT?!)\nTell me (WHAT?!) what you gonna tell me? (WHAT?!)\nTell me (uh) tell me (uh)\nWhat you gonna tell me?\n\n[Verse 3: DMX]\nHolla at the boy if you know the truth\nSee what I'm doin', I'm tryin' to show the youth\nTrust me I been through it so I got the proof\nGive 'em somethin' to eat that ain't gon' break a tooth\nAnd everybody knows how I get down (c'mon)\nShow the dog love when he hit town (c'mon)\nThey don't give a fuck who I'm with now (c'mon)\nV.I.P. don't give a fuck where I sit now (aight?!)\nAll this shit changed but it's still the same\nBut you gotta do it in order to play the game\nKeep shit brief when you say my name (f'real)\nGive me the love, nigga fuck the fame (f'real)\nWhen the shit is gone, where you gon' be? (hmmmmm)\nWhen I look no more, what you gon' see? (hmmmmm)\nShit, a muh'fucker lookin' hungry (aight?!)\nAnd even then, is you gon' love me?\n\n[Chorus: Stephanie Mills]\nWhat you gonna do when I'm nothing?\nYou're crazy about my styyyyyyyyyle\nWhat you gonna do when I'm nothing?\nTell me nowwwwwwwwwww.. ohhhhh-ohhhh\nWhat you gonna do when I'm nothing?\nYou're crazy about my styyyyyyyyyle\nWhat you gonna do when I'm nothing?\nTell me nowwwwwwwwwww.. ohhhhh-ohhhh\n\n[Stephanie and DMX ad lib to fade]", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}