{"songs": [{"title": "Representin’ (Remix)", "album": null, "year": null, "lyrics": "[Intro: Ludacris]\nI’m in my zone so leave me alone\nI’m in my zone so leave me alone\n\n[Verse 1: Ludacris]\nI represent like you\nNever thought I could’ve, never could imagine\nSit back and relax in the back, gotta act\nRemix this affirmative action\nYou gonna get this work\nYeah, we gonna smoke this purp\nCome about them shoes\nCome about them jeans\nAnd come about that shirt\nI only get better with time, girl\nPlay like I’m Psy, I’m a Virgo, that’s just my sign, girl\nYour friends is jealous and them bitches be like \"why girl?\"\n‘Cause if I hit it once that pussy it’ll always be mine, girl\n\n[Hook: R. Kelly]\nI made love to the original, but the remix\nSee, I just wanna fuck to the remix\nPop some bottles, take some shots to the remix\nUp in the club screaming \"DJ, play the remix\"\n\n[Verse 2: Fabolous]\nNow what I ever do was keep it true\nYou reppin' me, I’m reppin' you\nWe steppin’ through, we kept the flu\nSick Guiseppe shoes, cold pair of J's\nBetter not let us in unless y’all took your medicine\nI father niggas' sneaker game, you my step child\nPython on a snap back, R.I.P you reptiles\nCut you snake niggas off, and make my bitch a bag\nThey that slick hoes, too, now she’s switching bags\nShout out to us, we the representatives\nFunny we was killing ‘em when we went to LIV\nI’m the brand, she the logo\nSo when they talk about us, call that promo\n\n[Hook: R. Kelly]\n\n[Verse 3: R. Kelly]\nMove over, Kellz in the building\nAka. Rover, dawg’s in the building\nKeep them panties leaking from their legs to the floor\nSee, you are just a tenant, bitch, I’m the fucking landlord\nAfter I’m done I ain’t got no love for her\nBut the sex so good she be screaming ‘encore!’\nLuda, Kellz' remix going hardcore\nKeep fucking around, we gonna do a world tour\nMy money don’t sleep, 24-8\nLike I’m in a dream except I’m awake\nFaubourg for breakfast, yeah my life is great\nY’all niggas be pausing, and I don’t hesitate\nYo man, he’s mocking, I’m original, he a copy\nI’m Fonzie he’s Potsie, man Joe is sloppy\nMami called me Papi, better yet call me Rocky\n‘Cause I beat that pussy up like we fighting, hockey\n\n[Hook: R. Kelly]", "image": "https://images.genius.com/ca35594d702c65ed1ac05c3ea2f22951.800x800x1.jpg"}], "artist": "Ludacris"}