{"songs": [{"title": "Window Pain (Outro)", "album": "KOD", "year": "2018-04-20", "lyrics": "[Intro]\nOne night\nWhen me and my mom was about to go to bed\nAll the doors was locked\nThen when I had fell asleep\nMy mom had heard three gun shots\nIt was to my cousin, his name was Rod\nThe one that came to pick me up\nHe had been shot right through the face, right in the neck\nAnd he got shot right in the stomach\n\n[Chorus]\nI put my hand to the sky, I sing\nGrateful for the blessings you bring\nThank you for the ones I love\nForgive me for the times I was\nDown and confused, I know\nWhat I reap is what I will sow\nOnce again I find myself\nBack with you from my hell\nAll I ever wanted was to hear them bitches holler back\nGet some money plus respect and now look, I got all of that\nAll I wanna do is see my granny on the other side\nAll I wanna do is kill the man that made my momma cry\nAll I wanna do is touch a platinum plaque and celebrate\nAll I wanna do is keep my niggas out the yellow tape\nAll I wanna do is see my granny on the other side\nAll I wanna do is kill the man that made my momma cry\n\n[Verse]\nRight now I'm starin' out the window of my Range and contemplating, am I sane?\nHave I sacrificed for fame?\nMy occupation's on my brain\nThought that I could change it all if I had change\nBut the niggas that I came up with way back is still the same\nI be tryna give 'em game like Santa did when Christmas came\nThey be listenin' but it's clear to me they did not hear a thing\nIt go in one ear and out the other like a bullet out the muzzle of a pistol shot by brothers standin' point-blank range\nNiggas bang in the Ville, I always thought that shit was strange\nHow you claim blood or cuz when that was just a LA thing?\nI don't mean no disrespect towards your set, no, I'm just sayin'\nThat it seem like for acceptance niggas will do anything\nNiggas will rep any gang, niggas will bust any head\nNiggas will risk everything, point him out and then he dead\nShootin' up where his granny live, \"blaow, blaow!\", his granny duck\nHe don't give a fuck, he's on Henny and Xanny'd up\nBlowin' Tammy up, bitch, when you gon' give them panties up?\nHe gon' plant a seed, but best believe he ain't man enough\nJust because yo' dick can spray semen, it don't mean that you ready to let go of yo' childish ways\nThe results are deadly\nBecause that child will suffer and that's what can most affect me\nThe little girl I met this past summer said, \"Don't forget me\"\nI won't forget you, how could I with all you went through?\nA bullet hit yo' cousin in Temple while he was with you\nAnd while you was talkin', I was tearin' up, where's the tissue?\nIf you was my sister then I would kiss you and tell you that I'm sorry for the pain you had to live through\nI know I'm blessed because yo' stress is realer than anything I done been through\n\n[Chorus]\nI put my hand to the sky, I sing\nGrateful for the blessings you bring\nThank you for the ones I love\nForgive me for the times I was\nDown and confused, I know\nWhat I reap is what I will sow\nOnce again I find myself\nBack with you from my hell\nAll I ever wanted was to hear them bitches holler back\nGet some money plus respect and now look, I got all of that\nAll I wanna do is see my granny on the other side\nAll I wanna do is kill the man that made my momma cry\nAll I wanna do is touch a platinum plaque and celebrate\nAll I wanna do is keep my niggas out the yellow tape\nAll I wanna do is see my granny on the other side\nAll I wanna do is kill the man that made my momma cry\n\n[Outro]\nIt's not that big\nWell at least, um\nGod had saved him 'cause he still alive\nSo why do y'all think that bad stuff happen?\nLike why can't the world just be all nice things?\nBecause God is tryna, um\nWarn-warn us or teach us a lesson that we need to learn\nOr He's tryna warn us of He's comin' back to, um, see us and take us home and redo the world\nHe's comin' back to, um, have us be His children and for us to see Him for the first time so we can rejoice with Him and have our time\nAnd after we do that, He's gonna restart the world\nK.O.D\nChoose wisely!", "image": "https://images.genius.com/5cdf2147b92170e674f6809e259cc36f.440x440x1.jpg"}], "artist": "J. Cole"}