{"songs": [{"title": "Snoopy Track", "album": "Vol. 3… Life and Times of S. Carter", "year": "1999-12-28", "lyrics": "[Intro: Jay-Z]\nBounce\nUhhh, ha, uhhh, ha\nUhhh, uh-huh-uh-uhhh, uhh, uh-huh\nThis for my hustlers.. uh-huh\nAnd for the bitches.. yeah\n\n[Verse 1: Jay-Z]\nYo, yo\nThis is for my niggas down in Houston on candy paint\nAll my niggas in the Dirty South, Miami mayne\nAll my niggas in the A-T-L throwin' dem bows\nAll them thugs that send slugs through your clothes; holla at me!\nIt's for the black culture, Spanish chicks with the sweet chocha\nSpanish cats with the keys of coca\nAll the haters eat a dick, they wanna see you brok-er\nI hope the heat stroke ya, the misery is over\nAll my deep smokers, I hope the leaf choke ya\nHope you'll never be sober, I'ma toast to myself\nI hope the Cris' get me, spiralin' into a tizzy\nSo pissy, swervin' on the road dizzy\nMay God protect my soul, angels walk with me\nFirst do the flow sickly, niggas is so shifty\nThe fo'-fo' is like a force field, you won't get me\nI brought some folk with me, Brooklyn is loc'n with me\nWhat the fuck?\n\n[Chorus: Juvenile]\nYou know, we ride\nAll day, all night\nPop Cris', shoot dice\nFuck hoes, for life\nYou know, we ride\nAll day, all night\nPop Cris', shoot dice\nFuck hoes, for life\n\n[Verse 2: Jay-Z]\nThis is for my chicks that get dough for takin' off they clothes\nAll them money makin' honies that slide down the poles\nAll my educated chicks who grade is 4.0\nAll the baby mamas across the globe; ayo\nI like my women friends feminine\nI like my hoes on \"X\" like Eminem, shit!\nI like em bow-legged, never coke-headed\nWith a dough fetish, the drive to go get it\nI like they toes proper, I like they clothes Prada\nI like they shoes Gucci, I like new coochie\nI fucked a few groupies, in a few hoopties\nI got 'em Iceberg shit they thought I knew Snoopy\nI cop them Rocawear, my mamis dedicated\nThey never tell me no, the most they said is \"not here\"\nI got they ears studded, both wrists baguetted\nI got a main chick, a mistress, and a young bitch\nForget it, I'm the don\n\n[Chorus: Juvenile]\nYou know, we ride\nAll day, all night\nPop Cris', shoot dice\nFuck hoes, for life\nYou know, we ride\nAll day, all night\nPop Cris', shoot dice\nFuck hoes, for life\n\n[Verse 3: Jay-Z]\nWha-what?\nThis is for my dice shooters, cats doin' life\nBy the time I get this kite to ya, I hope you doin' alright\nWho got 'em platinum up? Who got the chicks in the truck?\nToo much to sit comfortably, they lappin' up\nWho shit is big pimpin'? See the flow different\nI drop heavy then I let the four-fifth flip 'em\nI keep rappers talkin' to kids, Jigga Sixth Sense'd 'em\nDon't mention my name and lames in the same sentence\nYou see I'm so thorough, take on your whole borough\nBe so careful I hear the whistle from the fo'-fo' barrel\nKeep the flow Hova; icy neck, cold shoulder\nWho click is closest to La Costra Nostra?\nIt's The Roc\n\n[Chorus: Juvenile]\nYou know, we ride\nAll day, all night\nPop Cris', shoot dice\nFuck hoes, for life\nYou know, we ride\nAll day, all night\nPop Cris', shoot dice\nFuck hoes, for life\nYou know, we ride\nAll day, all night\nPop Cris', shoot dice\nFuck hoes, for life", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg"}], "artist": "JAY-Z"}