{"songs": [{"title": "The War on Drugs is an Epic Fail", "album": null, "year": "2016-09-15", "lyrics": "In 1986, when I was coming of age, Ronald Reagan doubled down on the war on drugs, that had been started by Richard Nixon in 1971. Drugs were bad, fried your brain and drug dealers were monsters, sole reason neighborhoods and major cities were failing. Nobody wanted to talk about Reaganomics and the ending of social safety nets. The defunding of schools and the loss of jobs in cities across America.\n\nYoung men like me who hustled became the sole villains and drug addicts lacked moral fortitude. In the 1990's incarceration rates in the US blew up, today we imprison more people than any other country in the world; China, Russia, Iran, Cuba. All countries we consider autocratic and repressive, yeah more than them.\n\nJudges hands were tied by tough on crime laws, and they were forced to hand out mandatory life sentences for simple  possession and low level drugs sales. My home state of New York started this with Rockefeller laws, then the feds made distinction between people who sold powder cocaine and crack cocaine even though they were the same drug, only difference is how you take it, and even though white people used and sold crack more than Black people, somehow it was Black people who went to prison.\n\nThe media ignored actual data to this day, crack it's still talked about as Black problem. The NYPD raided our Brooklyn neighborhoods while Manhattan bankers openly used coke with impunity. The war on drugs exploded the US prison population disproportionately locking away Black and Latinos, our prison populations grew more than 900%. When the war on drugs began in 1971 our prison population was 200 thousand. Today it is over 2 million.\n\nLong after the crack era ended we continued our war on drugs. There were more than 1.5 million drug arrests in 2014, more than 80% were for possession only. Almost half were for marijuana. People are finally talking about treating addiction to harder drugs as a health crisis, but there is no compassionate language about drug dealers, unless of course we're talking about places like Colorado whose state economy got a huge boost by the above ground marijuana industry.\n\nA few states south in Louisiana they're still handing mandatory sentences for people who sell weed, despite a booming and celebrated 50 billion legal marijuana industry, most states still disproportionally hand out mandatory sentences to Black and Latinos with drug cases. If you're entrepreneurial living in one of the many states that are passing legalize laws you may still face barriers participating in the above ground economy. Venture capitalists migrate to these states to open multi billion dollar operations, but former felons can't open a dispensary. Lots of times those felonies were drug charges, caught by poor people who sold drugs for living but are now prohibited from participating in one of the fastest growing economies. Got it?\n\nIn states like New York where holding marijuana is no longer grounds for arrest, police issue possession citations in Black and Latino neighborhoods at a far higher rate than other neighborhoods. Kids in Crown Heights are constantly stopped and ticketed for trees, kids at dorms in Columbia where rates of marijuana use are equal or worse than those in the hood are never targeted or ticketed. Rates of drug use are as high as they were when Nixon declared this so-called war in 1971.\n\nForty-five years later it's time to rethink our policies and laws. The war on drugs is an epic fail.", "image": "https://images.genius.com/a2c27b9a59e330f8ab57275ccc9d0255.1000x716x1.png"}], "artist": "JAY-Z"}