{"songs": [{"title": "I’m Just Doing My Thing", "album": null, "year": null, "lyrics": "[Hook - Sample]\nI'm just doin' my job, I'm just doin' my job heee\nI'm just doin' my job, baby, I'm just doin' my job heee heee\n\n[Intro]\nThis beautiful right here\nThe ladies gon' appreciate this one\nThis a beautiful record right here\nThe Louis Vuitton Don\nWhat the call this one radio? GQ?\n\n[Verse 1]\nListen baby here's the reason I've been missing lately\nMaking sure my lil' misses out here living gravy\nGray Mercedez, car note 980 it's no prob she so mob\nAnd her brain is so crazy\n\"You a soldier, I feel you for that\" is what I told her\nOver the Motorola Rick Ross tatted on her shoulder\nClub cray tongue kissing in a daze Cris twisting up the haze\nGo to Space once the night is over\nFuck her fast even though I know she like it slower\nBreakfast spot go to Jerry's right around the corner\nValet? The V12 pull it on the corner\nI can't drive, I'm rolling still holding on the water\n\n[Hook]\nIt's real radio right here\n99 Jams, Power 96 show me some love man, show the boy love this Ross\nKnow what I'm saying cartel right here\nListen b, I'mma break it down I'mma be as clear as I can for you\n\n[Verse 2]\nCheck it\nThem other hoes are nothin' to lose sleep about\nYour pink thong? Pull 'em to the side and eat you out\nWe make love I know you tired of that fake thug\nTired of the lies and bullshit that he makes up\nHe tuggin' on you whisperin' in your ear he's caked up\nHas rims on his car but damn boo his brakes scrub\nHe fresh out look at me with his chest out\nThe car beam? Knocked his ass clean into the next house\nHe snitched on twenty niggas thought we'd never find out\nYou tryna be somebody else homie, time out\nThem cartel boys down to pull them 9s out\nFrom Boobie to Walk my dog gotta climb out\n\n[Hook]\nThis should knock in clubs\nComing from a real gangsta artist, you know\nRick Ross, Triple Cs\nYou so sexy girl\n\n[Verse 3]\nYou keep me in the mood\nOnce a nigga see you nude\nEat you like a plate of food\nHe move like them haters do\n(Oh they hatin' too?)\nShit I know that cale dude\nHit 'em with a stray or two\nMaybe take a day or two\nListen boo, the war's over we can chill now\nLet's move to ATL: buy a crib, put a mill' down\nCelebrate have Boozer bring them pills 'round\nBust a nut, pop a bottle, baby how you feel now?\n\n[Outro]\nI just want you to ride with me\nStay under my wing baby, I got you\nI'mma make your last name Ross\nIt's a beautiful thing\nSee what I'm saying\nLet's sit down and pop a bottle of purple hooter\nYou like to kiss?\nI like to kiss you feel me\nThis beautiful right here, Rick Ross\nCheck it", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}