{"songs": [{"title": "Tush", "album": null, "year": null, "lyrics": "[ Missy Elliott]\nThis that fire! Ghostface and Missy\n\n[Ghostface Killah]\nSomebody tell that girl that her ass too big\nI give it to her right and she let me live\nCan't eat that, 'cause there's no relationship\nI beat that, the next day you called in sick\nFrontin', not for nothin', I pop buttons\nOff Baby Phat, Levi's, J.Lo's, Guess and Gap\nCause it's like that, young lady, bet I make you shake\nLike the Puffy and Jay-Z's, Dre's and J.D.'s\nCome on, if not you, I'ma beat this song\nBut if you were bout it, our business wouldn't be here this long\nLet me break it down for you, all I wanted to know\nIf I could just feel it and touch it, and break it down into numbers and\nCome with me and just leave your friends\nCause we don't need no cock blocking\nTellin' you this without no option\nTell your friends \"Peace, look, I'm bouncin'\"\n\n[Chorus: Missy Elliott (Ghostface Killah)]\nTush, tush, tush\nWant to slide in the bush, bush, bush?\n(I'm on top, you like push, push, push\nKeep it low like shush, shush, shush)\nYou want to get up in my tush, tush, tush?\nYou could slide in the bush, bush, bush\n(I'm on top, you like push, push, push\nKeep it low like shush, shush, shush)\nYou want to get up in that tush, tush, tush?\nWant to slide in my bush, bush, bush\n(I'm on top, you like push, push, push\nKeep it low like shush, shush, shush)\n\n[Ghostface Killah]\nOh yeah, you jinglin' baby (well let me jump up on that ding-a-ling baby)\nOoh, gosh, you a nasty girl, sassy\nPicture me layin' you inside my classic pearls\nToes'll curl, giddy up, you go girl\nI'm about to, uh, do it slow girl\nOoh, you in control, it's in your world\nShe on, I think I like ol' girl\nTake it out, turn around\nCharlie horse, shit, threw me off balance\nWildin', all I wanted was to show you my talent\nTo let you know on how I rep in Staten Island\nThis is the reason I came to you\nSo we can connect it then kick it was the thing to do\nCause we don't need no representation\nDomination, got them waitin' patient\n\n[Ghostface Killah]\nNow this is the way y'all suppose to\nTo get down, y'all ain't right\nSomebody say \"Aha! Ghost is back!\"\n\n[Missy Elliott]\nPull back the curtain, let me work your sermon\nPlayboy don't hurt me like a virgin\nYou seem real determined to put a hurtin'\nBut if you ain't slurpin', then you better off jerkin'\nYou got a lot of nerve, to want to serve my curves\nMy 36D, 36 hips\nThe way I shoot the gift, I swallow coke bottles\nAnd you would swear it was Lil' Kim lips\nEh, I really like you baby\nDo you know how to wife this lady?\nGive me what I want, don't talk, don't touch\nUnless you got a bank account that make my face blush\nNow shush, in my bush\nAnd I can give you what you want, make a whoosh\nJust throw it, I'll show you how to push\nKinky sex, tie ropes around your wrist\nCome on\n\n[Chorus]\n[Missy Elliott]\nCome on\nCome on\nOh\nCome on!", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}