{"songs": [{"title": "We March as Millions", "album": null, "year": null, "lyrics": "\"It's much more than a march\nIt will be the beginning of a movement\nMillions more movement; let us begin\"\n\n\"Tell us what you hear\"\n\n[Nas]\nDear people of the globe\nI hope that you're in good health\nBy the time my voice hit you\nI hope it all is well with you\nMy mission is to bail with you\nTouch upon some real issues\nSenators, Government Officials\nSit at the conference and listen\nHave a Coke or mineral water and say I'm reminiscing\nGeorge L. Jackson, Malcolm X last wind when I'm rapping\nAmericans, Africans, Asians, Russians, and Arab men\nSend your clergymen to journey with Nas from Queens, projects\nI promise an unforgettable experience\nCompare me with, Amenhotep get in more debt\nHistory was stolen, get in my zone\nWhat makes the powers that be, less gangsta then Al Capone?\nThe Rosetta stone was stolen like Chicago was\nThink I'm a thug?, let's talk about some conquerors\nNapoleon, Sun Tzu, Genghis Khan\nHitler, Edi Amin, Attila the Hun\nLet's bring back to the cat that invented the gun\nFrom the Indians all the way to the Pentagon\nI'm sitting on Capitol Hill\nI'm composing this rhyme, guaranteed to make all of y'all feel\nThe beauty that was trapped under siege\nBelieve in yourself you'll be free, take it from me\n\n[Voice Samples]\n\"We will not surrender or we will not back down, we keep overacting\"\n[\"Throw up a fist for black power\" --Nas\n\"Tell us what you hear\"\n\"Why do we march? to protest Government policy\nWe march because it's time to fight back\nWe march for education\"\n\"Throw up a fist for black power\" [--Nas\n\"Tell us what you hear\"\n\"Why do we march? we march to save the soul of America\"\n\n[Nas]\nThe rejection of what's right could mean you in denial\nIt either breaks you or makes you becomes hostile\nI swallow many lies before tasting the truth\nIn the beginning there was darkness, beautiful you\nHow will life be without night?, no tranquility?\nNo way to get away and rest, no stability?\nI can't see the sky without the moon and the stars\nThe sunlight blocking everything, the king I'm in raw\nPeople worship the Madonna in the shrines in Spain's\nI'm proud to share the same blood type in veins\nThe holy mother -- the loneliest color remains\nCan't be tampering, diluted the chains\nThey try make you not want it, make you run from it\nThe wickedest men, want the ebony punished\nIt's so seductive, it's sensuous in my clutches\nHot as fire when Moses saw burning bushes\nSo abused and misused and mistreated\nNaked men wanna get drunk and get weed it\nPeople wild when she comes out pull out and party\nCatch her body, fornicate some start beef\nChain reaction cause it's in the air\nThe lost tribe scattered everywhere\nFrom the North thru West Hemisphere\nScientist and Archaeologist conceal the obvious\nThe dead, living and little children over time of this\nObsession, caressing, every essence of magnetism\nEvery organism when it come to it\nAll question about Resurrection and your connection with God\nIt's answered with the beast in your heart\n\n[Voice Samples]\n\"We will not surrender or we will not back down, we keep overacting\"\n\"Throw up a fist for black power\" [--Nas\n\"Tell us what you hear\"\n\"Why do we march? to protest Government policy\nWe march because it's time to fight back\nWe march for education\"\n\"Throw up a fist for black power\" [--Nas\n\"Tell us what you hear\"\n\"Why do we march? we march to save the soul of America\"", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}