{"songs": [{"title": "Hovi Baby", "album": "Y.H.N.I.C. (Hub City Threat: Minor of the Year)", "year": null, "lyrics": "[Intro]\nYeah\nYou're now rockin' with the best\nHub City's threat\nMinor of the year\nK. Dot\nOoh, it's about to get so ugly in here\nIt's about to get so ugly\nLike whoever's listening to this\nOh man I crack myself up\nYeah\nOh my God man, oh my God\nWe 'bout to shit on these faggots man\nCheck it\nYeah, K. Dot\n*Let me get that*\n\n[Verse]\nFirst niggas used to rapping, get my attention\nNow I don't even listen\nIt run through one ear and out the other\nAnd I don't buy niggas records for music\nI'm more interested in their album covers\nI'm a talented brotha\nPlus I move so quick it's like my brain came with a joystick\nMotherfuckers better listen when I spit\nI knock records out the park\nHomeboy I Ken Griffey a hitch, and I might Ken Griffey ya bitch\nBut won't buy her shit, not even a small bag of chips\nJust give her long pipe 'til it's scrapin' her hips\nLike a waitress, the way the broad ask for the tip\nIf you want, just ask for a clip\nI'll give ya those for free\nI won't charge a fee\nJust roll up on you, like cut off sleeves\nNobody can cut off the-\n-number one rap artist\nDamn, I am the hardest\nBlowin' through Nintendo cartridges\nTo Maybachin it, valet parkin' it\nNow people arguin'\nWho is better? Them or him\nHim referring to me\nThem referring to the industry\nHands down, Jay left, now give me the crown\nFuck later, I'm takin' it now\nFuck haters, I'm takin' 'em down\nWith the red beam, red beam, silencer, don't holler it muffle the sound\nBark like ten rottweilers straight from the pound\nStraight for the dollas, 745 [?] Impala, scrapin' the ground\nI suggest you follow, or not be smarter\nSeein' another broke tomorrow\nYou can tell the way I speak begins to stutter\nFirst it was hard for y'all to even makin' it harder\nAin't about money, then please don't bother\nY'all niggas funny, talkin' bout that you run shit\nWhen I'm lookin' at ya like \"Who are ya?\"\nY'all niggas is gas\nAnd what make that bad is y'all niggas is trash\nY'all don't wanna see me spaz\nOut, pull the gats out\nAnd see me blast, ouch\nYou better off coppin' a pen and a pad\nThan copyin' the last rhymes I had\nAnd spit 'em to your homeboys 'till they all say \"You wrote that?\"\nTell 'em lies or, give 'em the facts\nIt don't matter 'cause in a minute, imma be chargin' my raps\nA G for a bar, that's 3 16's, plus a 8 bar hook nigga, add up that\nI charge you a verse like Dre would charge you a track\nYour whole budget, hoes love it\nBut you hate it, 'cause I'm your girls favorite\nNigga, face it, you can't walk in my shoes nor change the sides tryna replace it\nAs far as rap, I spit in the Matrix\nPast reality, nigga actually, I wrote a rhyme where there was no gravity\nThat's a whole 'nother planet\nFor real holmes, I do damage\nBlow up ya city, even ya school campus\nRun in ya class while your doin' ya standards\nLet it blast\nOne gun subtractin' ya life, now that's the basics of math\n\n[Outro]\nOh my God man let me stop spazzin' out on these niggas, b\nThey have to call 911, I'm done\nDave, you feel me man? It's real\nK. Dot man, just havin' a lil fun up here man\nIt's real ugly, ya know?\nYeah, bang, bang, let's go", "image": "https://images.genius.com/1d86c80235f3ffef2492fec6dac85b33.500x500x1.jpg"}], "artist": "Kendrick Lamar"}