{"songs": [{"title": "Blood Red", "album": "Blood Red", "year": "2016-06-28", "lyrics": "[Intro]\nMan, this is it\nThis is what they’ve been waiting for baby\nThis is what they’ve been waiting for\nThey’ve been waiting for the dog to scratch\nThey’ve been waiting for the dog to scratch\nAlready got Grand Champ status\nTell me how they feel about this?\n\n[Verse 1]\nAll I see red, blood red\nFuck that nigga said? One dead\nGun to the head, didn’t run\nBut instead, wash my hands and face\nHis blood, it shed\nNever had it all, I was born demented\nFuck apologizing, if I said it, I meant it\nIf I don’t like you, fuck you\nNever pretendin’\nCrash blew up and burned – that’s how it ended\nUrban legend, I heard it mentioned\nDog is right at home in the dirty trenches\nMy birth’s intentions [?] was the first to sentence\nWhat’s life without parole for the worse offenses\nSenseless slaughters, kicked open the door\nWhy everybody gotta die?\nWhy our sons and daughters?\nWith orders, we are clear from the start\nFirst, turn off the lights\nAnd then murder whatever moves in the dark, nigga\n\n[Hook]\nBlood red!\nBlood red!\nIf they don’t know by now, they about to find out\n\nBlood red!\nBlood red!\nHow the dog get down, and what the dog is about\n\n[Verse 2]\nEven though I know it is the truth, you don’t mean it\nYou haven’t earned it, you haven’t seen it\nNightmares, all you can do is dream it\nYou run from it, and I end up in between it\nWhat was the first curse, turned into a blessing\nWith burners that shit was burned, turned into a weapon\nBuilt for war, bitch ass nigga\nThat shit I’m gonna spit will get you killed through the door\nFound ‘em on the floor - the fetal position\nThere is no 'or,' came here with leave ‘em intentions [?]\nThought shit was funny, like shit you was saying was ill\nUntil you made that left turn, and shit got real\nWhen it come to rap, you cats got it all wrong\nGot bars for days, but can’t make a song\nIf you did half of what you said when you was flapping your jaw\nPush dem bricks, the fuck yous rapping for? Nigga!\n\n[Hook]\nBlood red!\nBlood red!\nMan, if they don’t know by now, they about to find out\n\nBlood red!\nBlood red!\nHow the dog get down, and what the dog is about mothafucka!\n\nBlood red!\nBlood red!\nIf they don’t know by now, they about to find out\n\nBlood red!\nBlood red!\nHow the dog get down, and what dog is about\n\n[Outro]\nThey wasn’t, they not ready!\nThey not ready! [x 10]\nC’mon man\nMy plan\nIt is not a fucking game", "image": "https://images.genius.com/97a189f296e4eac61104a33f9d00d65d.1000x1000x1.jpg"}], "artist": "DMX"}