{"songs": [{"title": "Spazz Out", "album": "Fuck A Mixtape", "year": "2010-05-27", "lyrics": "[Verse]\n\nYou better fall back\nNigga gone with all that\nI'm a big dog, got no time for small cats\nAnd I been known most of you guys is all rap\nHiding behind rhymes, disguised in all black\nI'm in the endzone moving the chains winning the game\n9 of 10 clones saying my name to get in the game\nWait a minute homes, first of all let it be known\nI'm bout that business homes\nSo all that flexing and the lyin' you can kill it homes\nYou just a cub I'm a lion don't forget it homes\nListen I'm out your division homes\nMy name's written in stone on the throne that I'm sitting on\nLong term like in Great Britian homes\nSpitting strong, in a zone\nOn the microphone I'm sickest known\nEverybody's ego I be pissin' on\nGetting blown riding through the city on\nBig Chrome sitting under something that you thought I couldn't fit on anyway\nLet's say we cut to the chase and get straight to the knitty gritty homes\nThe way you bitch and moan like a broad you need titties on\nAnd I'm straight don't get me wrong\nShawty I ain't into dudes\nTalk about your music not about me in your interviews\nSeem like every time I'm rapping I'm offending dudes\nAnd I ain't even thought about you let alone mention\n\n[Outro]\nMLK, DJ Drama I just want these motherfuckers to know I don't need no goddamn mix-tape homes\nNigga I got 150 songs nigga\nI got 150 songs on deck my nigga\nI mean like on some real shit I'll give this shit to you if you want it\nIf you really, all you gotta say is Tip we miss you dog\nTip we wanna hear you dog\nThen I'll goddamn throw some shit out there homes\nBut don't goddamn come comparing me to no goddamn nigga\nWho done dropped 3 mix-tapes when I done dropped 7 albums nigga\nI don't wanna hear this shit nigga!\nFuck you saying! Nigga my son got better songs than you nigga!\nAye dig on some real shit next time I hear another motherfucker\nComparing my album to a motherfucking mix-tape\nI'm a walk up to you my nigga\nAnd I'm a slap you with a stack of 50s\nThink its a motherfucking game!!\nFuck a Mix-tape nigga!!!", "image": "https://images.genius.com/6f08c14dfef32114f3f4458805c96968.500x500x1.jpg"}], "artist": "T.I."}