{"songs": [{"title": "The Only Nigga", "album": null, "year": null, "lyrics": "[Intro]\nOh, lord, oh, lord\nPretty ass girl over there, come play on ma nappy hair! (*laughs*)\nDrizzy Drake, here we go, look\n\n[Verse 1]\nBitch, I'm gettin’ it how I live, I put that on my left rib\n25 with no kids but this dick you can babysit\n25 lighters in the sky, what life is a real nigga\n20 Al-Qaeda bomb when I do sight 'fore I kill niggas\nPassion my preference, Benjamin Franklin my medicine\nThe MVP let him in, I'ma fuck up his letterman\nJackets with pendants on them\nAnd I got plenty war story, politic never depended on ’em\nUncle Sam never did shit for me, momma made miracles\nChoppers drove me hysterical, cartoons and cereal\nPyramids on Imperial, that's the projects\nAnd I make that progress from a tedious process\nI'm a problem better yet a prospect, fuck that I'm a Loch Ness monster\nConquer, Compton, Hail King K-Dot, aka them casings of AK just sprayed your way uh, compensate for shooting for the stars muhafucka, click, brrt\nShooting up the charts, muhfucka\nSee, a rich nigga will buy anything that you sell 'em\nA broke nigga believe anything that you tell 'em\nI let smokers pump my gas, but I do that very seldom\nDrop your ass at the unemployment, the only way I help 'em\nThey call me a role model, I'm still a baby myself\nHungover from last night, got to speak at your school at 12\nHennessy with the Sprite had me bouncing like Rumpelstiltskin\nThey caught me rummaging through women, I’m laughing like Elliott Wilson ( laugh )\nPay me respect and pay me on my checks\nMy first 50 thousand collected paid off some street debts\nYou know killers that looked out for me back when I was hungry\nWe go back like Reebok classics and black and blue saucony\nI got a genuine clean slate, never you ask for my fucking rate\nNever I’m handing out favors, bitch, every show now is 200k\nAs I write down my new bucket list, I can look down on your fucking hate\nGet the fuck up when I'm in your presence, you listen when I fucking say\n\n[Outro]\n\"What the fuck you niggas want from me? The only nigga that I owe is God!\nHuh? Huh? Drizzy\nWhat the fuck these niggas want from me? The only nigga that I owe is God!\"", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}