{"songs": [{"title": "Psycho", "album": null, "year": "2007-11-29", "lyrics": "[Intro: Busta Rhymes:]\nSomebody about to be punished\nRest in peace to my nigga Izzy\nRest in peace to my nigga J Dilla\nRest in peace to my nigga J Dilla\nRest in peace to my nigga J Dilla\nLove Y'all niggas man\nWatch what i do when honoring y'all name\nStreets feel me!\n\n[Verse 1: Busta Rhymes]\nI'm nice with the lead peel your edges like slices of bread\nPrecise, become a poltergeist, stickin knives inside of your head\nWhat's the issue, on a roll, like a roll of toilet tissue(?)\nI continue to expose you niggas that's so superficial\nI script you your obituary then blow like a missile\nOnce i blow the whistle, motherfuck may the forces be with you\nCome with a style, im wildin', pile up my money so kosher\nThen call up the sofa fuckin' bitches in back of the rover\nThen bounce with the coca, bag up bitches outside of the Costa Rica area level, my features and carry my posters\n[pause]\nUnprecedented, i cemented, you changing your flow up\nWhile helping you grow up, niggas know you for sounding so tore up\nChallenging niggas, better hold on to your bannister niggas\nFuck around i'll stuff your body parts into cannisters niggas\nLike you don't know the half, i'll bust your motherfuckin ass\nBusta buss, cass, and papoose is fuckin psychopaths\n\n[Hook: Busta Rhymes]\nMaking Niggas Wanna Get Hype Yo I'm PSYCHO [x8]\n\n[Verse 2: Cassidy]\nMy nigga beside me with triggers and niggas get bodied\nI lock a strip and chop a brick like im Mr. Miyagi\nBut this ain't karate, i been sick since i pissed in a potty\nI probably been proper since my papa put dick in my mommy\nI'm a cannon man\nHoldin' the hammer man\nFor the loot niggas shoot niggas like a camera man\nSnappin' a picture, you get stuck like the back of a sticker\nI got bars like the factory manufacturing snickers\nAnd i do crimes for the bread like croutons\nWith two nines i be layin' clowns down like futon's\nWith the bullets in the rocket, my pocket's is full of cream\nI'm blowin' steam, keep the steel in my hands like wolverine\n[Busta: Congratulations on the -- Cass. Welcome home nigga!]\nPoppin' the metal, you niggas is not on my level\nI'm locking the kettle man, i'm hot like a pot and a kettle\nOn the mic i spaz, who get as hype as cass\nAnd my nigga busta, we some muthafucking psychopath's\n\n[Hook: Busta Rhymes]\nMaking Niggas Wanna Get Hype Yo I'm PSYCHO [x8]\n\n[Verse 3: Papoose]\nI'm an iceberg trapped in a fire i won't melt\nI'm a fetus that survived an abortion, i won't be killed\nI'm the heart of Brooklyn, New York, I'm Bedstuy\nI'm a christian woman's hand on the bible i won't lie\nI'm the code of silence in the Gotti crew\nI'm an empty mag right after a shootout, i just bodied you\nGot something sup? shotgun pump, shot at you\nLike kamakaze through, your baby mom's feel the wop cock back\nCause she was sittin' on my lap\nI stay with the oowop strap\nI put your baby daddy in a body bag\nWhen i squeeze and let the wop clap\nI Baghdad(Bag That) like Iraq\n[Papoose: Hold up lemme put my gun down. Busta Rhymes: Ayo i know they trying to figure out what you got going on Pap]\nThis is my era, you niggas is losers\nI'm the new era(error) like a mistake on your computer\nGot the infrared dot, bustin' you gullible suckers too\nPut a dot on your ass like www\n\n[Chorus:]\nMaking Niggas Wanna Get Hype Yo I'm PSYCHO [x8]", "image": "https://images.rapgenius.com/8fab0405e2acb09a835e79f614ec3916.500x500x1.jpg"}], "artist": "Busta Rhymes"}