{"songs": [{"title": "Im Dat Nigga", "album": "Who The F#*k Is B.o.B?", "year": null, "lyrics": "[Intro] [ x2 ]\nI'm that nigga X3\nAnd I'm clean, that machine\nSuper cool, super mean\n\n[Verse 1: T.I.]\nYou already know\nI'm the hottest nigga you heard in a long time\nIntroducing you to the hottest nigga you've heard in a long time\n\nMega pimp, super clean, the coolest in the universe\nNiggas hatin' on what he doin', just mad cause they ain't do it first\nHis name pop up when you hit \"playa\" on ya Google search\nBitches bow they heads and bend they knees, just like they do in church\nDrop dough into a purse, before you get into a skirt\nShe agree to do the work, before she get into the purp\n'Til my pine box drop down into the dirt\nI'mma be by far the hottest nigga known to the earth\nIn the air I fly can't compare, my swagger to another rapper don't you dare try\nAnyone wit a pair of eyes can look and see, no legacy, will ever be, next to me or nothin' near by\nThough I invite you all to try, ay, I'mma a fair guy\nJust approach with caution, be aware, cause I don't share my...throne\nMy crown I own, hottest flow on any song I'm on I'm gone nigga!\n\nB.o.B you up next baby\nGrand Hustle Niggaaaaa!\n\nIf I ain't the hottest nigga on the mutha fuckin universe, I guess I'll just have to do 'til he get here nigga!\n\n[Verse 2: B.o.B]\nHere I go\n\nI'm that nigga that you heard about through word of mouth\nThey probably said I change the music in the dirty south\nNow that the word is out\nThe timing is perfect now\nTo take all these hypocritical rumors and burn em down\nIf you observe the doubt you would see what they worried bout\nThey say I sound like Dre when I'm rapping my verses now\nHonestly, I could give a fuck what you blurtin' out\nPoint blank,I'm in the game...rockin' my jersey now\nSo just accept me or don't pay me no mind\nEither way you gonna be hearin' me all of the time\nWhether on Greg street, or 107.9\nOr on yo favorite rap blog, on yo rap website\nAnd if that ain't right, then show me straight to the judge\nJust like Bryan Nichols I ain't spittin', nothin' but slugs\nVenomous blood in my veins\nChemicals up in my brain\nYes I resemble a criminal\nB.o.Bizzle, you ain't fuckin' wit mane!\n\nAhhh!", "image": "https://images.genius.com/d8cefe97bbbe251a84c87f853a533f10.500x500x1.jpg"}], "artist": "B.o.B"}