{"songs": [{"title": "Time Flies", "album": "GO:OD AM ", "year": "2015-09-18", "lyrics": "[Intro: Lil B]\nTime flies, time flies\nAs we keep living and as we keep being positive\nAll we can do is hold onto these memories\nMac Miller, I love you\n\n[Verse 1: Mac Miller]\nAll of my homies used to get on my case like \"When you 'bout to kill 'em?\"\nSoon as I'm out of millions and my girl sprouts some children\nBut I've been murderin' the game, almost out of victims\nThis food for thought usually enough to feed a thousand pigeons\nI'm out here livin' if you wonder where I been though\nShit bro, would you give it all up for these nymphos?\nI been broke then got rich, what's inside your wallet?\nHalf man and half amazin', but that's just me bein' modest\nI'm an honest man\nMy mama told me never put it on the lotto and\nI work for everything I get that is my motto, fam\nSo when I die, these bitches still can fuck my hologram, goddamn\n\n[Hook: Mac Miller]\nAnd all that drama that you comin' with, you blowin' my high\nOn my way up to the function, gettin' dome in my ride\nI got 'em worried that my mind fried\nI'm goin' up before I skydive\nYou can see the way that time flies\nTime files, try to catch it\nTime flies\nTime flies, try to catch it\n\n[Interlude: Lil B]\nWatch as time go\nTime moves, time flows\nHow do we handle these things?\nI am time, we are time and we have control\nOne thing we need to remember\nIs that we are all in this together\n\n[Verse 2: Mac Miller]\nYou can't expect the unexpected, these dreams are manifested\nFrom my head into reality, they seems a bit excessive\nBut I don't stress it, two hands to count my blessings\nAll the times that I've been reckless with an ego big as Texas\nThinkin' \"I'm the man\", I never let these hoes inside the plan\nMy room for bullshit in the crib as small as a child's hands\nI fill the shoes and walk a path where only giants stand\nI am the fire man, shit I'm way too fly to land, yeah\nI'm smokin' weed all alone, on the road\nEven though I know they need me at home\nKeep my control from a city where it's freezin' and cold\nEach to their own, punches like this probably beat up Stallone\n\n[Hook: Mac Miller]\nAnd all that drama that you comin' with, you blowin' my high\nOn my way up to the function, gettin' dome in my ride\nI got 'em worried that my mind fried\nI'm goin' up before I skydive\nYou can see the way that time flies\nTime files, try to catch it\nTime flies\nTime flies, try to catch it\n\n[Outro: Lil B]\nOne day we will, we will find\nWe will conquer, conquer with love\nWhile time is on our side\nContinue to hold to those beautiful memories\nThey won't be here forever, but our spirit lives on\nLil B", "image": "https://images.genius.com/3fafe062032c4ec3d42f4b11c25a02a1.375x375x1.jpg"}], "artist": "Mac Miller"}