{"songs": [{"title": "We Will Not", "album": "Us or Else: Letter to the System", "year": "2016-08-05", "lyrics": "[Intro]\nUgh\nNo we will not\nUgh, no\n\n[Verse]\nNo we will not stand here in silence\nWhile they take the lives of our brothers and sisters and partnas\nWe will not turn a blind eye to the murder with no repercussions\nOh no, we will not\nWe will not live on our knees, we will die on our feet\nThis ain't no lie that I speak\nAll you youngin's out here in the streets only wanna shoot people who look like you\nYou can stay home, you too weak\nOh no, we will not go and repeat the mistakes of the past\nIgnorin' the snakes in the grass, payin' you cash\nStill we pray and we fast 'til one day that's your ass\nWe will not ask for no war\nNo-no-no-no-no-no, but we will be prepared for one\nHopin' not with a gun\nWith the unity, using the same shit you did to destroy me\nWe sick of the garbage you kickin' and teachin'\nAnd lynchin' us, lockin' us up for no reason\nAnd killin' us, no consequences, convictions, you serious?\nLyin' about what you show in the media\nAssassinate all the leaders who leadin' us\nLeave us with ones who misleadin' us\nThen go and reward all the ones who mistreat us\nAnd leave us in projects and give us these poisonous products\nOn top of narcotics to push to our sisters and brothers\nLike them ain't our sisters and brothers\nNo we will not be run amuck, led astray\nOr bamboozled, the buck'll be stoppin' today\nSee what happen when athletes'll no longer play for you\nTell them accountants to pray for you\nOn respect or just respect what that paper'll do\nLook up, it too late for you, droppin' you off\nTurnin' them profits to loss when we won't go shop in the mall\nUnited we all, stuck in this bullshit together\nShowin' these folk we just won't take whatever\nOr else they just roll up and shoot up whatever\nJust like they've been doin' forever\nThe niggas swear they hard be huffin' and puffin'\nBut ain't gon' do nothin', the enemy try 'em\nThey wait behind enemy lines\nWhy you tryna be so friendly now? Handle your business now\nAnd we won't fear nothin' but judgement from God\nStandin' there lookin' at me sayin' you ain't do nothin'\nI bless you when you ain't invested in nothin'\nJust kept up the cycle of death and destruction\nIgnornin' your neighbor won't help him but helpin' yourself\nJust like the devil himself, hmm\nPromote all that fornication\nAll that baby makin', ain't no baby raisin' for a generation\nNow they trapped in systems cause incarceration\nWas inevitable due to education\nSubstandard institution never cared\nJ's drop, buyin' every pair\nCrack rock, crip, blood, all the 80\nGDP and whatever else separate us\nHip-hop, king you finally made it, your time to take it\nPass Martin Luther, all that money and you still blew it\nDidn't save and you feel stupid, ITunes came and they bootleggin'\nWhat you get for bein' hard headed? God damn nigga\nMight as well gon' and go to hell nigga\nCause I tried as hard as I can nigga\nI know you only a man but God damn nigga\n\n[Outro: Malcolm X]\nThey don't scare negros today with no badge, or no white skin, or no white sheet, or no white anything else. They police the same way, they put their club upside your head and then turn around and accuse you of attacking them. Every case of police brutality against a negro follows the same pattern --- they attack you, bust you all upside your mouth and then take you to court and charge you with assault. What kind of democracy is that?", "image": "https://images.genius.com/bdb1074613750fd5653118c7f0dbad90.600x600x1.jpg"}], "artist": "T.I."}