{"songs": [{"title": "Buy Back the Block", "album": "Super Bowl Playlist", "year": "2016-11-17", "lyrics": "[Music Video Skit]\n\n[Intro]\nHey it's your girl Super Cindy reporting live from the corner of 183rd Street and 27th Avenue at Checkers, in Miami Gardens. We got Gucci Mane, 2 Chainz, and Rick Ross. And we're here for the buy back the block movement. Where we raise up the community and support and love us\n\n[Intro: Rick Ross]\nWe own the hood\nAnd we live by it, die by it then ya heard me\n\n[Verse 1: 2 Chainz]\nI got crib in Florida, and I don't even stay there\nBeen bought my mama a crib, bought baby mama a daycare\nI gotta ball for Peter, all of my boys illegal\nI used to sell the reefer, now I just sell Adidas\nBeen had the Rollie, been ate bologna\nJust closed on a Cali crib, round the corner from Kobe\nProperty, property, property, property, nigga I'm tryna invest\nTalking monopoly, I'm tryna encourage a nigga to run up a check\nNigga no treadmill, you niggas just stand still\nHeard you were talkin' trash, throw that shit in the landfill\nI'm 'bout the money, lil nigga\nBen Franklin my uncle, lil nigga\nI used to trap right in front of you nigga\nSellin' dope just like dunkin' to niggas uh\nThis is a windmill, I smell like 10 mil\nPut all my chains on, I cause a wind chill\nI hit up Renzel, went over details\nGot us some young niggas that'll stand on your windshield\n\n[Hook: Rick Ross]\nIt's time to buy back the block, buy back the block\nIt's time to buy back the block, buy back the block\nIt's time to buy back the hood, buy back the hood\nIt's time to buy back the hood, buy back the hood\nIt's time to buy back the hood, buy back the hood\nI'm 'bout to buy back the hood, buy back the hood\n\n[Verse 2: Gucci Mane]\nI sold 10 bricks a day but now I need 10 Chick-Fil-A's\nJust bought 2 studios 'cause I got so much shit to say\nI made 10 million dollars, man and I was on house arrest\nShe says her jaws hurt, she need to give her mouth a rest\nThese niggas fallin' off, only the strong survive\nThese suckers reachin' out, but ain't no need to try\nT-Tell 'em somethin' slick, slick enough to Slip-N-Slide\nAnd I know how to pitch, so I'ma get your bitch to drive\nAll the OG's I looked up to?, man they broke as shit\nThese lil niggas look up to me because I'm super rich\nI'm goin' live, I-I'm still alive\nGod thank you for my punishment, it made me wise\n\n[Hook: Rick Ross]\nIt's time to buy back the block, buy back the block\nIt's time to buy back the block, buy back the block\nIt's time to buy back the hood, buy back the hood\nIt's time to buy back the hood, buy back the hood\nIt's time to buy back the hood, buy back the hood\nI'm 'bout to buy back the hood, buy back the hood\n\n[Verse 3: Rick Ross]\nIt's time to clean up the ghetto, a dope boy wanna shine\nTime to buy back the block, talkin' one brick at a time\nI sold a few records, I bought me a Checkers\nWingstop well invested, so Taco Bell left for breakfast\nI seen a few M's, it's time to touch me that 100\nSo let's put up this money and let's go half on the Sonics\nYes I feed lemon pepper, angel wings with the feathers\nIf you feel like I feel, I pray you live Rich Forever\nOkay, let's buy back the block, I might buy me a Wendy's\nJust to pull up on skinnies every Tuesday and Wednesdays\nI might buy me 10 Denny's, I might buy Family Dollar\nCut it to 50 Cent, I got a job for your father\nI'm tryna help with the rent, I came up from the strength\nMy lil son? he a prince, it's time that we represent\n\n[Hook: Rick Ross]\nIt's time to buy back the block, buy back the block\nIt's time to buy back the block, buy back the block\nIt's time to buy back the hood, buy back the hood\nIt's time to buy back the hood, buy back the hood\nIt's time to buy back the hood, buy back the hood\nI'm 'bout to buy back the hood, buy back the hood\n\n[Interlude: Rick Ross]\nIt's all about your last name meaning something, you heard me? Start with you a duplex, work up to a house, maybe a small plaza, I'm looking for a mall. Anybody selling a mall holler at me, you heard me? Maybe get my mama a gas station, she like BP. Texaco holler at me, you heard me? It's the boss\n\n[Outro: Rick Ross]\nI'm 'bout to buy back the block, buy back the block\nIt's time to buy back the block, buy back the block\nI'm 'bout to buy back the city, buy back the city\nBuy back the city, buy back the city", "image": "https://images.genius.com/e7e6986a5d2f61a0c0416214c71a497c.600x600x1.jpg"}], "artist": "Rick Ross"}