{"songs": [{"title": "It Wasn’t Us (Clones Version)", "album": "The Neptunes Present... Clones", "year": "2003-08-19", "lyrics": "[Intro - Ludacris]\nWOO! Ah!\nDisturbin Tha Peace in this muh'fucker, mayne\nJust getting started\nLudacris, I-20, with the Neptunes\nGo a lil' somethin like this\n\n[Hook: Ludacris & (Girl)]\nThey wanna know why I hit like that\nSpit like that, shit like that\nMaybe cause I get like that\nKick like that, rip like that\nThey wanna know why I rhyme like that\nShine like that, glime like that\nCause the world is mine like that\n(Yours like that?) Mine like that\n\n[Verse 1: Ludacris]\nMaaan you could get your whole crew\nEven niggas that owe you, and paid you shit!\nYou could drink some cold brews\nAnd throw on them bold shoes, and jump in the whip!\nYou could come and find us, and be right behind us\nAnd insert the clips\nYou hear something go CLAK CLAK CLAK!\nSomebody went down! But it wasn't us\nYou could sell about 2 mill', get hooked wit a good deal\nAnd start stacking dough\nYou could get your mo-biles, ride 20 inch big wheels\nAnd collect some hoes\nYou could even start eating good, and smoking good\nBut you pressing your luck\nAnd you say what? Somebody went bankrupt?!\nBut it wasn't us\n\n[Hook]\n\n[Verse 2: Ludacris]\nYou could be going on worldwide tours\nAnd see your face on every magazine\nOr you could flip through channel after channel\nAnd see yourself on the TV screen\nYou could pay for expensive videos\nAnd have a whole lotta big booty hoes\nBut when that shit start coming to a close\nDamn! But it wasn't us\nYou could use your backup plan\nAnd even call up your backup man and start thinking quick!\nYou could call up the backup hoes\nAnd even call some to backup those, and tell 'em \"suck a dick!\"\nThen you tell 'em just to get on these\nOr you tell 'em just to pay their fees, or to pay them dues\nAnd if you catching them STDs, damn!\nBut it wasn't us\n\n[Hook]\n\n[Verse 3: Infamous 2-0]\nYou could bring your whole squad and your bodyguard\nFuck it, dog, you could bring ya block\nBut I got me a AK, and a couple of them SKs\nSo you all gettin' shot\nYou could sell them hard-hard, them E pills\nAnd every nigga wanna smoke on the dro\nAnd when the Fed's come and kick ya door, pick up ya ho\nI'm like \"Whoa!\" And it wasn't us\nYou could even flip a whole brick, wit ya whole click\nSo everybody riding out on the Sprees\nBut you got you a problem dude, I got the robbin' crews\nSo everybody gotta get on they knees\nYou could even make a chained dog, get a main broad\nEven let her stay inside of ya crib\nBut the bitch got no choice, she love my voice\nAnd now I put it way inside of her grills\nYou could even make a phone call to ya road dogs\n'Cause I'm the nigga that ya fear in the South\nThen you try to do a new tune, called the Neptunes\nBut Pharrell wasn't hearing ya out\nYou could even try to blame me, cause ya whole crew framed me\nBut I'm still gon' bust\nIf the Feds try to name me, hey, it ain't me, and uh\nAnd it wasn't us!\n\n[Hook x2]", "image": "https://images.genius.com/8bcc21a6b9f49f44b5c447a289abacdf.640x640x1.jpg"}], "artist": "Ludacris"}