{"songs": [{"title": "Top Cat", "album": "The Ruler’s Back", "year": null, "lyrics": "[Verse 1]\nEatin’ a bit and nap, human being make way spittin’\nAs I’m skippin’ through an alley in New York, a stray kitten\nDog chase couple of blocks, shucks, tough being a fox\nHe in a tux, some good samaritan’ll stuff me in a box\n“I’ll find you a home.” Why do you cry? Where went? Just like whine\n‘Cause ASPCA to me a kitten ain’t like right and\nConstable comes, wonder why? I heard say “unhand the fly kid”\nBecause the bitch looked like she needed a home more than I did\nWord, bit her off another like, not a committee, hit her off\nNot to mention, sweatin’ the kitty litter off\nHad to do this, ain’t no regular, see the loot is\nWith this rich white lady sayin’ “Ain’t he the cutest?”\nClerk said all deals are straight, so when the car wheels away\nAlthough the ho’ better know I want four meals a day\nThe rest is firm bein’ a trap as the hon adopt cat\n“Better be a good lil’ kitty”, hooker don’t pop crap\n‘Cause I’m Top Cat\n\n[Verse 2]\nLet me hug him for the millionth, and again, great the zillionth\nHuggin’ me so much, she almost suffocate the brilliant\nSad eyes, plus she had a bad pad, nice\nSaid I have to do my share of work, the hooker had mad mice\nWas like a fleet of them niggas, though it was kind of fun to be ill treatin’ them, clean the mess, must’ve thought I was gonna eat ‘em\nCat food, this ain’t none to me, see a rat, you come run\nOr like “hunt” to me, “you wanna get this shit from in front of me?”\nWord, Thanksgiving too? Please, now shout for somethin\"\n“Can a nigga get some air”, she wouldn’t let me out for nothin’\nI guess I could be called a brat and now a jolly ball of fat\nSo let me rub my head against her, so she think she all of that\nAnd every day of the week, sweatin’, works like a sinner, stay off\n“Would you lay off? I’m watchin’ Prince of Bel-Air, you’re in the way of”\nMouse race across the room, should’ve seen me stop trap\nYou’re still a hooker snap, didn’t I tell you don’t pop crap?\n‘Cause I’m Top Cat\n\n[Verse 3]\nMale come and the sex triggers, and his penis stiffer, bigger\nSaid “boy she sure be sleepin’ with a lot of different niggas”\nTen positions as he coaches, do it in the mood above reproaches\nI wish the bitch would clean her house, you wouldn’t have so many roaches\nBut still he buggin’ and he comin’, and the naughty with the hottie\nFall asleep, burglar come, “up shorty get the shottie!”\nTried meowin’, nothin’ stirred him\nThe ho’s meal blurred him\nPeed on a bitch, got up and chased me ’til she heard him\n“What was that?” Got her gun, she had a dozen, mad lot\nAnd for a over horny lady, definitely wasn’t a bad shot\nPolice came and all of that and now a hero hops, run to her\nSo I snuggle up under her, ’cause I’ve kind of grown fond of her\nWhen a mouse run across, should’ve seen me stop trap\nI thought the ho was gonna snap, she better not pop crap\nTo who? Top Cat", "image": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg"}], "artist": "Slick Rick"}