{"songs": [{"title": "What You Know About It", "album": "Catastrophic", "year": "2012-12-21", "lyrics": "Nigga, you know who the f*ck we is?\n(The Conglomerate...)\nF*ck boy, I'm a money hoe\nI truck a wealthy nigga 'fore you ever see my money low\nAlfredo, I got fettuccini, they be rappin'\nTalkin' all that money they never seen\nFrontin' like you got bank roll\nNigga, you don't make dough\nBirthday over, one slice left of cake, though\nThey be on that funny shit, we be on that money shit\nCatch 'em drinkin', pull up on that bar, give you a 20 clip\nRap life, trap life, black white, stash pipes\nBack streets maskin' up watchin' for the flashlights\nYour girl wanna suck me off, she ain't have to ask twice\nBig strong brother and I'm out like it's my last night\nCocaine cowboy, long island D-Boy\nBlow is raw and that thing gleamin' like Leroy\nBlack and yellow Smith & Wesson that's my bumble bee toy\nAnd they gon' reminisce over your ass, trouble T-Roy\nYeah! Yeah! When I let that thing go\nThe whole club sleepin' on the floor like it's hangover\nMonday is Juliette's, Tuesday is Green House\nWednesday and butter, I'm a pull out all this green\nAnd let it go!\nWhat you know about it?\nGet green, whip clean, what you know about it?\nPut them, put them hands up if you know about it\nDon't never see a broke motherf*cker 'round me\nWhat you know about it?\nGet green, whip clean, what you know about it?\nPut them, put them, put them hands up if you know about it\nYou ain't never seen a broke motherf*cker 'round me\nMad machete, Busta Rhymes, you ain't ready, boy\nF*ckin' somethin' up when it's comin' to that fetti, boy\nLil' lame niggas better get your parachute and jump\nGet up off my plane 'fore my niggas para-shoot-you-up\nThink I'm sayin' peace when I throw them f*ckin' deuces up?\nI'm only signalin' niggas to start hangin' them nooses up\nSomebody gonna die, break a branch just to beat you\nGo! Chop the body parts and let the pigs eat you\nHoles through every part of your body we can see through\nContinue blowin' the cannon, I wouldn't wanna be you\nI let it go like I'm sick and hear voices\nSpend money like a nigga copped a fleet of Rolls Royces\nPrepared to purchase everything while exploring the choices\nThen enjoy eatin' your food like I'm eatin' lobsters and oysters\nTime and time again I got 'em walkin' like a fiend walk\nI'm done speakin' to niggas, I'm a let the homie Doe talk\nBrought twenty thou out and I'm a blow it\nYour man pullin' fifteen hundred out just to show it\nIf shorty ain't drinkin' hard liquor we'll Moet\nThen it's to the Tele suite afterward so she can hoe it\nShe gon' swallow all of me, I'm a blow her brains out\nMy kids need a place to live, her mouth like a safe house\nLoud pack of kush and that Goose got me spaced out\nStandin' on the sofa fadin', sweatin' all my waves out (faded)\nIn my new Trews, slow bucks, long sleeve\nLookin' like I need to be posin' under palm trees\nAnd I'm quick to let my four squirt\nUnemployed gangster nigga, you don't want no work\nWe live by the hustler testament\nWe cop a brick and take it to the floor like we wrestling\nThrow it in the pot with the fish and we stretchin' it\nGo and hug the corner like we sexin' it, f*ck boy\nEighteen-wheeler jewelry game truck, boy\nShe ain't drop, don't be a hater, let her cook, boy\nMy chrome and black nina call her lady luck\nAnd any time you see her goin' down she gon' give it up\nLike, let it go!\nLet it go...", "image": "https://images.genius.com/b64a509fcfb92ec8935231089436682e.500x500x1.jpg"}], "artist": "Busta Rhymes"}