{"songs": [{"title": "My 1st Single", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro]\nOh! Yeah! So much for first single on this one\n\n[Verse 1]\nShady's the label, Aftermath is the stable\nThat the horses come out of—erra\nOf course we're about to stir up\nSome shit thick as Mrs. Buttersworth's syrup\nIt's the Mr. Picked-on-Christopher-Reeves-just-for-no-reason\nOther than to—just to tease him\n'Cause he was his biggest (*burp*) fan\nHe used to be Superman, now I'm pourin'\nLiquor on the curb in his name for him\n\"Eminem, you wait 'til we meet up again, fucker\nI'm kickin' your ass for everything you've ever said.\"\nIt goes one for the money, two for the fuckin' show\nReady, get set, let's go\nHere comes the buckin' bronco\nStompin' and stampedin' up the damn street like them buffalo\nSoldiers, I told ya I'm 'bout to blow, so look out below, Geronimo\nMotherfuckers, it's dominoes, I'm on a roll\nAround and around I go\nWhen will I stop? I don't know\nTryin' to pick up where The Eminem Show left off\nBut I know anything's possible\nThough I'm not gonna top what I sold\nI'm at the top of my game, that shit is not gonna change\nLong as I got Dr. Dre on my team I'll get away\nWith murder: I'm like O.J., he's like my Cochran today\nWe keep the Mark Fuhrman tapes\nIn a safe, locked 'em away (*slam*)\nBetter watch what you say\nJust when you thought you were safe\nThem fuckers got you on tape\nYou swear to God you was playin'\nWhether or not you was little Joshua\nGosh, I wish I could've told you to not do the same\n'Cause one day it could cost you your name\n\n[Chorus]\nAnd this was supposed to be my first single (*burp*)\nBut I just fucked that off so\nFuck it, let's all have fun, let's mingle (*burp*)\nSlap a bitch and smack a ho\nThis was supposed to be my catchy little jingle (*fart*)\nThat you hear on your radio\nBut shit's about to hit the shingle (*fart*)\nOh, oh-oh-oh, oh-oh-no, erra\nOh, ah, erra, oh, ah, erra\nOh, ah, erra, oh-oh-ah-ah\nOh, ah, erra, oh, ah, erra\nOh, ah, erra, poo-poo-ka-ka\n\n[Verse 2]\nEri-Eri-Erick swallowed some generic sleeping pills\nAnd woke up in bed next to his best friend Derrick, bare-naked\nJig-a-jig-ji-ji-Janean just turned 16 and used a fake ID\nTo sneak in V.I.P. to see R. Kelly\nHee-hee-hee-hee-hee-hee to be so young and naïve\nOh what I wouldn't give to live so Kim and carefree\nParis and Nicky's parents must be so tickled, they cherish\nEvery picture with their kids with hickeys all over their necks\nHickory-dickory Dirk Diggler, look at me work wizardry\nWith these words – am I a jerk or just jerk chicken?\nOr chiga-chigga-chig-chig-jer-chig-jer jerkin' your chain\nTwenty-two jerks in a jerk circle, or is it a circle jerk?\nWait a minute, what am I sayin'? Allow me to run it back\nAnd rewind it {blblblblblblblb} – wait, let me ask you again\nAm I just jerkin' your chain? Am I berserk or insane?\nOr am I just one of them damn amateurs workin' the dang\nCameras, filmin' one of them Paris Hilton homemade\nPornos, who keeps tiltin' the lens at an angle\nJigga-ji-just recently somebody just discovered\nBritney and Justin videotapes of 'em fuckin'\nWhen they was just Mouseketeers in the Mickey Mouse Club\nAnd dusted 'em and went straight to The Source with 'em\n'Cause they could've sworn someone said, \"Ni—\"\nAnd then tried to erase and record over it\nBut if you listen close enough to it you can hear the\n\"Ga-hu\" and then they come to\nFind out it was Justin sayin', \"I'm gon—nuh cum!\"\nAnd this was supposed to be...\n\n[Chorus]\n...my first single (*burp*)\nBut I just fucked that off so\nFuck it, let's all have fun, let's mingle (*burp*)\nSlap a bitch and smack a ho\nThis was supposed to be my catchy little jingle (*fart*)\nThat you hear on your radio\nBut shit's about to hit the shingle (*fart*)\nOh, oh-oh-oh, oh-oh-no, erra\nOh, ah, erra, oh, ah, erra\nOh, ah, erra, oh-oh-ah-ah\nOh, ah, erra, oh, ah, erra\nOh, ah, erra, poo-poo-ka-ka\n\n[Verse 3]\nAny opinions or somethin' you just wanna get off your chest\nAnd address it about my lyrics I'd love to hear it\nAll you gotta do is pick up the phone and just dial up this number\nIt's 1-800-I'M-A-DICK-SUCKER-I'D-LOVE-TO-SUCK-A-DICK\nAnd if someone picks up\nYou can talk all the shit you want about me\nJust type in your number back and follow it by the pound key\nAnd I'll be sure to get back as soon as there comes a day\nThat I fall out with Dre, wake up gay and make up with Ray (hey!)\nSo fuck a chicken, lick a chicken, suck a chicken, beat a chicken\nEat a chicken like it's a big cock, big-a-big-cock!\nOr suck a dick, and lick a dick, and eat a dick, and stick a dick in your mouth\nI'm done, you can fuck off, fuck-a-fuck-off!\n\n[Chorus]\nAnd this was supposed to be my first single (*burp*)\nBut I just fucked that off so\nFuck it, let's all have fun, let's mingle (*burp*)\nSlap a bitch and smack a ho\nThis was supposed to be my catchy little jingle (*fart*)\nThat you hear on your radio\nBut shit's about to hit the shingle (*fart*)\nOh, oh-oh-oh, oh-oh-no, erra\nOh, ah, erra, oh, ah, erra\nOh, ah, erra, oh-oh-ah-ah\nOh, ah, erra, oh, ah, erra\nOh, ah, erra, poo-poo-ka-ka (*burp*)", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}