{"songs": [{"title": "T.H.O.T.", "album": null, "year": "2014-02-13", "lyrics": "[Hook: Huddy]\nThat's your ho, I fucked your bitch\nHol' up, your face look mad as shit\nShe sucked my dick and you kissed her\nBoy, I nutted all on her lips\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nThat's on mamas!\n\n[Verse 1: Game]\nYou fucking with a thot, nigga\nI'm a real nigga, bitch, You fucking with a Pac nigga\nGraduated from the pills and them rocks, nigga\nMoney, power, respect, come through like the Lox, nigga\nFuck a bottle, buy the box, nigga\nBought a Audemar, we don't google, we buy the stock, nigga\nSame old boppers, leader of the new school\nSpraying on them lockers, no rain gon' stop us\nPut the swang on yoppers, flush on the bottom\nGold fangs on the top ones, Lucc game with the chopper\nAnd I'm known for cutting these hoes like I'm the bachelor\nThey stuck in the hood, I'm the spatula\nTold these bitches, expose these bitches for who they are\nYou a thot, yeah I really know these bitches\nDick is all I owe these bitches for being themselves\nShe a coach bag bitch but she follow Chanel\nThat's on mamas!\n\n[Hook: Huddy]\nThat's your ho, I fucked your bitch\nHol' up, your face look mad as shit\nShe sucked my dick and you kissed her\nBoy, I nutted all on her lips\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nThat's on mamas!\n\n[Verse 2: Problem]\nUhhh, I got riggidy-riggidy racks and them diggidy-dam\nThe piggidy-piggidy face of a riggidy clown\nBlack out, back out like a flimsy blouse\nFuck a track out, like racing outside, pussies chalked outline\nNiggas can't be outshined, out rhymed or out dimes\nI'm like Magic in his prime without HIV\n(Come on) It's stunting season\nIt's fuck niggas like gays but for the other reason\nMe and Lucky getting cuddy in them other reasons\nPeriod, the bitch bleed then I fucking bleed 'em\n(What?) You fucking with a thot, nigga!\nMy Compton niggas come with K's like dot, nigga\nReal when I talk, you can tell by my tone\nA few instagram likes, the bitch swear that she on!\nLive hoes from condos riding in Lambos, stunting pronto\nKnowing that shit Rondos\n\n[Hook: Huddy]\nThat's your ho, I fucked your bitch\nHol' up, your face look mad as shit\nShe sucked my dick and you kissed her\nBoy, I nutted all on her lips\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nThat's on mamas!\n\n[Verse 3: Bad Lucc]\nShe kinda thick, what's your measure?\nSay her name bone collector, that's on the set-ta\n354, I'mma a rep ride it real\nShe like the way I dress with them 501s on the chill\nOn our first two visits, nasty when I fuck her\nTold her keep me out the clinic, on mamas I'm 'bout that business\nBlowing money fast but I'm standing out them fences\nSuper pervert, I'm G. Levert to these bitches\nFeeling like that nigga, back when I was skinny\nBefore I was filling out them pictures and fucking with your sister\nMr grab diamond ware share of hoes\nAnd if my bitch didn't have a kid, I'd have a layer for hoes\nHella sick with this pimping, my mama taught me how to tell a chick from a chicken\nDon't be fucking with a Christian\nDiamond Lane banging, ain't hear it then get the trippin'\nI'm a king of these thots, nigga, listen\n\n[Hook: Huddy]\nThat's your ho, I fucked your bitch\nHol' up, your face look mad as shit\nShe sucked my dick and you kissed her\nBoy, I nutted all on her lips\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nThat's on mamas!\nThat's your ho, I fucked your bitch\nHol' up, your face look mad as shit\nShe sucked my dick and you kissed her\nBoy, I nutted all on her lips\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nCause you fucking with a thot, nigga\nYou fucking with a thot, nigga\nThat's on mamas\nThat's on mamas!", "image": "https://images.rapgenius.com/46d77ec7ecd08f7886a78132482ffc8f.600x600x1.jpg"}], "artist": "The Game"}