{"songs": [{"title": "If You Don’t Know Now You Know", "album": "Back on My B.S.", "year": null, "lyrics": "We're live in five, four, three, two, one!\n\nWelcome everybody, you are \"live in the den\"\nWith big tigger hangin' out today with one of my friends\n\nWhattup, okay if you ain't know it be one of the best of all time\nBusta bust for short, for some better know me bust' rhymes\n(what's good?) maintainin' (same here, just smashin')\n(how the fam?) they all good my nigga, thanks for askin'\nYou and yours?\n\nWe all blessed, things ain't too bad\nStill dealin' with last year's sudden loss of my dad\n(man, my condolences) thanks dawg, let's begin\nAin't seen you in a sec, busta what you been up to since then?\n\nStayin' healthy and keepin' it movin' while I just be showin'\nThese other niggas how to do it while I'm constantly growin'\nI've been learnin' a lot, and still earnin' a lot of money crazy\nDoin' my thing and securin' a win for all my babies\n\nAight, well it's clear in this new year you've been busy\nBut how you been dealin' with the drama of the loss of your man izzy?\n\nIt's been one of the most traumatic times and I'll never forget it\nI'm survivin', thus bein' a punchin' bag for those affected\nIt's somethin' that I accepted, it was hard to understand\nThe way things happen, but in the end I guess it's god's plan\n\nWord, heard you beefin' with five-oh, couple cases on rotation\nAnd on top of that, bust' rhymes is now on probation?\n\nYeah, and I thank judge stevens and we was happy to see\nThat he ain't send me up north cause I got a family to feed\n\nChanged your image up last year, cut the dreads down low\nAnd also, gave the appearance of some major muscles\nNow on the low streets been talkin' like it usually do\nBusta bust, help us out, the public needs to know\n\nJust for the record the reason a nigga cut off the dread\nI had to shed, tired of carryin' weight on my head\nSecondly, it's all good when niggas talk, well they need to back it up\nOnly needles I use is when I tat-tat-tat it up\n\nUhh, some people sayin' you changed, even your flipmode fam (uh-huh)\nI heard the word's came safe from rah digga and baby sham (right)\nSaid you (passed the courvoisier) to pick up a gun\nSaid you more concerned about bein' hard than havin' fun\n\nYo, wow tig', I see you takin' it there; you got your arsenal, huh?\nI think I know where you got that from, that vibe article bruh\nThe press'll turn your family against each other for 'fetti, to sell a book\nBesides we all talked already and we good\n\nWowwww, that's what's up, be clear it's goin down\nAnd if you wanna holla at bust call us up right now\nPhone lines is open, what y'all, wanna discuss?\nWhat's good caller, you \"live in the den\" with big tig' and bust\n(hey tig'!) what's good ma? (enjoyin' the show)\n(but there's somethin' about busta I've been dyin' to know)\nWell holla at him\n\nHey busta (what's good ma?)\nI've been a fan since way back when you dropped \"woo-hah\"\n(woo-hah!!) yeah, that was my joint\nEvery album since then always been on point\n(thank you) videos and big shows is hardcore\nSo why you think your albums haven't sold more?\n\nWell baby, the nature of the business is unstable\nEspecially when your project ain't properly promoted by your label\nE'ry album I put out gold or platinum, just a second\nCheck the hardware on my walls is major, just for the record\n\nRead about you in a book or two\nNow tell me bust, please discuss, were they all lies or some of it true?\n\nWell I read about you in a couple of books too son\nBut I don't even know, tell me which book you readin' from\n\nAight, next caller\n\nHey busta, heard about you on miss jones\n(why you bringin' up old shit? you need to leave that alone)\nSo I'm sayin', is it true what she said?\nDid you jump right out from between her legs and start fryin' eggs?\n\nI can't remember exactly but I used to ride to her hood\nAnd pick her up all hours a night, thought the pussy was good\n'bout fifteen years ago, shit\nI can't imagine she'd remember that a nigga made a mean egg sandwich\n\nI seen a couple websites try to put you on blast (uh-huh)\nWith your relationship with homegirl with the real fat ass\n\nWho? you talkin' 'bout deelishis? yeah her body is vicious\nShe like trouble; thus we only friends, y'all made us a couple\n\nHow do you deal with the gossip, rumors and lies\nAnd feelin' like each and every move you make is analyzed?\n\nYo, it's all good, you see the blessing is a gift and a curse\nTo be in a position I am, shit could be worse\n\nI know my time's runnin' short so let me get to this thought\nI'm sure you wanna thank your fans for all of their support\n\nAbsolutely, see y'all are why I shine like the sun\nBig up to all my peeps who been ridin' with me since day one\nIt's why I walk the streets with pride, you niggas know how I shit it\nIt's why I rep it thorough for all the fans who stay committed\n\nBusta, now you've been gettin' it in since way back when\nSo what you say to critics sayin' you can't do it again?\n\nSee I ain't gotta say shit to 'em, I'm off to somethin' else\nNigga check my rã©sumã©, bitch it speak for itself\nIt's why I always do what I do, and I big up my chest\nGod put his hands on me, you could see that I'm blessed\nAnd I'm grateful\n\nAight! it's time to go\nBut I thank y'all for tunin' on in to the \"live in the den\" show\n\nAnd if you don't know, now you know\nAnd if you don't know, now you know, nigga\n\nHolla busta [both men ad libbing]\n(yes, yes, yes) [ad libbing]\n(yes, yes, yes) [laughing]\nThat's what's up man, holla (ha ha ha, you crazy nigga)", "image": "https://images.genius.com/39d2d4f1bba15212af6b346af49c7ff2.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}