{"songs": [{"title": "Hustler’s Story", "album": "Duets: The Final Chapter", "year": "2005-12-20", "lyrics": "[Intro : Akon]\nAkon and B.I.G. yea\n\n[Verse 1 : The Notorious B.I.G.]\nNiggas talkin' it but ain't livin' it\nCristal pops I'm sippin' it, mob hats and lizard shit\n'Gator trunks bitch, rollin' blunts with the williest of the willy\nHeckler Koch, M-1's and nine millies\nStories like a motherfucker\nModel bitches wondering if I'm a fuck with her\nShe know I treats my bitches like Ivana\nDolce and Gabana drippin'\nBig Poppa never slippin'\nH-class diamonds shinin'\nDinner with the wifey winin', dinin'\nSmoking cigars in Bogotá\nWith Colombian niggas named Panama\nAnd Englique and shit\nGames we play life endin'\nBitches bending over with ease\nFor a pair of Moschino jeans\nAnd Donna Karan tank tops I got your bank stopped\nSingles on top\nBenjamins\nUnder the rest of 'em\nAdvancin'\nFrom duplex to mansion\nStashing keys hidin' G's overseas\nVCR's in my V's\nGame elevates, money I make\nGets your stocks and real estates, bitch\nJet skiing in the Caribbean, white sands\nDiscussing plans with my mans\nDark blue land, smoke tint chrome rims and system\nThat leaves your rear views tremblin'\nWhat you gonna do when poppa catch an attitude?\nDrop to your knees and show gratitude\nKiss my rings it's a Frank White thing I stay potent\nBitch is devoted, take my dick and deep throat it\n\n[Hook : Akon]\nEternal sunshine in this elevated world of mine\nLooking for this hour glass of time\nTrying to find my purpose on this grand design\nIs there anybody out there living?\n4-5-6 is on the streets, they shootin\nIs there any money out there for me?\nYou just listen to this husler's story\n\n[Verse 2: Big Gee]\nPicture me, a product of the zone three\nScared lost, don't know what I'm suppose to be\nShit cost, money never came to me\nWhen shit short, I suffered unshamelessly\nThe lord humble niggas 'specially if they act like\nThey too big for they draw when they stacks right\nThink I'm bullshittin'? A bunch of niggas back like\nRight back hungry, stacks gone, they forgot Christ\nI know a nigga sold his soul for a nickel rock\nI know some hoes for the dro you can hit the cock\nI know a nigga workin' 9-5\nBeen on 15 years, ain't got a car to drive\nI know some nigga wanna act hard, flicks pitch\nFake jack boys, can't rob, get killed\nGot kin folk backyard big whips\nEscart that lift my homeboy this year\n\n[Hook : Akon]\n\n[Interlude : Akon]\nAkon\n\n[Verse 3 : Akon]\nWhile B.I.G. sittin up with Englique\nI'm on the coastline politickin' wit Jose\nWe got the birds flyin' in the coop all day\nTryin' to find a new way to smugglin' pure yay'\nWe bout our business, ain't no small time thieves\nIf you ain't growin the 'caine then we ain't gon' meet\nSee I'm the one to call when things get deep\nAnd my Africans will put yo' main man to sleep, now\nAnd Mexico far from the block\nTryin' to figure out how many Glocks to a box, now\nSellin' arms as well as rocks in my socks\nIf you could show me the money, here's the keys to the lock, now\nHey, you know the streets is my territory\nAin't scared of nothin, let you fear it for me\nHey, whether win, lose or draw\nBelieve that death is waitin for all\n\n[Hook : Akon]\n\n[Verse 4 : Scarface]\nFace Mob in the buildin (Uh huh)\nNiggas is quick to chop rocks and hide hands\nMake a break for it, get away from it, that was the plan (but)\nSo the whole time, I been plottin' on his man\nCaught him slippin' and sleepin', I hit his ass wit the can, and\nHere's somethin' that you can't understand\nHow can one be so cold and snatch a nigga's soul? (Damn)\nI'm on some get back shit, there comes a time\nIn every man's mind when it's deeper than dollar signs\nI been on the grind, got homies doin' time\nBehind niggas actin like bitches and bitches droppin' dimes\nI'm duckin' indictments, pussies is wearing wires\nNiggas just ain't tellin', no, they know we let it slide\nBut nah, we gotta ride and him, he gotta die\nSo if you catch up to his ass before I catch him, give him mine\nThe rats one thing a real nigga here despise\nI'm a five K one killa, I set his ass on fire\n\n[Hook : Akon]", "image": "https://images.genius.com/09b1732dbce927085a1fca7538fc1bb3.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}