{"songs": [{"title": "Hop", "album": "It Ain’t Safe No More...", "year": "2002-11-26", "lyrics": "(group speaking in same language)\n\n[Intro: Busta Rhymes: (talking)]\nSee we, we about to take it where\nWhere it all started\nWe gonna take em' back\nBusta Rhymes now, Flipmode now\nMy nigga Fingaz now\nCheck it, yo\n\n[Verse 1: Busta Rhymes]\nUh huh, Busta Bus is back in this bitch, holding the spot\nPuttin all the pep in side yall step (Yeah My Nigga)\nSee how we comin be loadin the docks\nFloatin and simply stockin the goods that we makin you flop (Ay yo)\nSee now we thicker and we be makin you sicker\nStuck like a bumper sticker from how we be dropping it quicker\nFor all these niggas that be riding and whippin in their truck (Crash)\nAnd buyin another one neva givin a fuck then day want a buck start stelin yo shit neva given a fuck (What!)\nFlipmode (Yes) cause we knowin we comin to get it\nGather around all my niggas who that be already to set it (Set it)\nFuckin and just break them off, let the women just shake it off\nGot them bouncin to take it off for me, Check it!\nCause i've been double dutchin and dosey-do' in on music way before\nA lot of these new niggas could figure then pattend all on my flow\nPeep on how we coming to rip it and know we gonna wet ya\nAnd rep for my niggas cause I'm coming to get ya\nI said...\n\n[Hook: Busta Rhymes]\nGuess who's comin?bustas comin\nLets talk about dum tapps yall be gettin\n(Let's Go)\nNow!\nLet me see all the people with dem raggudy ass taps u need a fuckin rake\nLet me know you up in the spot (Ay yo I'm sayin)\nEverytime we be givin u be erasen um and given dum fake\n(lets talk about rick ross)he think he da boss but he funu learn he da cost\nSell his ass fo a penny then hell kno who da boss\n(back to hop man)This is to know when I'm comin I'm comin to make you wyle out in the\nPlace that makes you get up and wanna HOP! (Let's do it)\nGo head and HOP!, Go head and HOP!, Go head and HOP!\nWe past makin them bounce, Go head and HOP!\n(C'mon just do it) Go head and HOP baby!\n\n[Verse 2: Busta Rhymes]\nNow you know it we comin to kill you niggas for shizzle\nMakin these bitches wanna shake it and we just makin them wiggle\nCapitalizing off on the music that be we be keepin coming\nHave you niggas really spazing and blackend out in their stomach (Hey bebe)\nThere's no mistakin you know we makin you bounce\nTakin the unforsaken approach the way we be takin out\nScrapin these niggas and breakin their pockets to chase them out\nSuddenly call your bitches to see just how they just makin out\nFuck it, we kick the bucket and to continue to stake them out (Ha)\nAnd in back of the crib is where we will be makin out\nPuting some shit together make it so you could all attend\nWelcoming you and my nigga so we can break your pocket again (Oh Oh)\nNiggas flossin and tossin their drinks like they all in the place\nAnd leave the niggas the (?) until they catch one all up in their face (Huh)\nY'all know we'll spray y'all niggas and know we gonna wet ya\nAnd rep for my niggas cause we comin to get ya\nI said...\n\n[Hook]", "image": "https://images.genius.com/cc9251ac994bbe401044c52cb51d1e49.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}