{"songs": [{"title": "Hell Yeah (Steve Austin Theme)", "album": "The Best of Snoop Dogg", "year": "2000-03-21", "lyrics": "{*sound of glass shattering*}\n\n[Snoop] Yeah, ha ha, Snoop Dogg\n[W.C.] Dub C.. heh, yeah\n[Snoop] All up in here, bay-bay.. yeah\n[W.C.] Uh-huh\n[Snoop] Straight G thang, yeah\n\n[W.C.]\nCode of the night is droppin these thangs on your dome\nHittin up my enemies, mad doggin em with a heart full of stone\nBLAM BLAM! Kickin yo' door down, throwdown, dirty and low down\nIt's bout to go down, who ready for the showdown?\nWhich one of y'all wanna be the first to get tossed in the tussle\nBuckle, choked up by these muscles and, taste these knuckles\nLost I'm runnin em all, haters I'm gunnin em all\nTricks I done done em all then I ain't go no love for none of y'all\nI'm comin through like a Brougham, givin it up with both hands\nSlaughterin your whole fam, rippin up the program\nTotal chaos, deadly as snake eyes, so cain't\nNone of you bustaz hurt me - fool I'm a G with no mercy\n\n[Snoop Dogg]\nWhen I say, \"Hell\" - you say, \"Yeah\"\n(c'mon) Hell - yeah (c'mon) hell - YEAH\n(c'mon) Hell - YEAH! (everybody c'mon) hell - YEAH!\n(everybody-body) Hell - YEAH!\n(c'mon, c'mon) Hell - yeah (ha ha)\n\nChorus: Snoop Dogg\n\nIf you down with these hits say HELL YEAH\nIf you came to get busy say HELL YEAH\nIf you like what you see say HELL YEAH\nIf you down with me, say HELL YEAH\nIf you like what you see say HELL YEAH\nIf you came to get busy say HELL YEAH\nIf you down with 'Stone Cold' say HELL YEAH\nParty people in the house say HELL YEAH\n\n[W.C.]\nGettin my bail on, swell on, far from a rookie\nI SPIT in your face and look at ya dare ya to say somethin to me\nTemper tantrum, smash random, quick to put you in a casket\nThe fool that run up is that fool to get his ass kicked\nLudicrous you the ones, it's an open invitation\nThese ass-kickins I'm dishin they got no discrimination\nPatience, long gone, I'ma, chalkin em off\nWalkin up bombin on sight cause I'm through talkin to y'all\nHands up loc I'm lit up, fed up, ready to bust, shakin em up\nWettin em up, slangin these knuckles cameras I'm gettin em up\nRaised on the turf where we, slay for the turf\nAnd I'm the realest rider to walk the, face of this Earth\nStrapped you best to be, ain't no standin next to me\nCheckin me, thought I warned you cowards about testin me\nPressin me, see the game of pain, yo I'mma plug it\nI'm so rugged -- shhhh, I'm cold blooded\n\nChorus\n\n[W.C.]\nYeah, y'all know what time it is\nY'all know how it's goin down\nNo surrender no retreat no takedown\nBeanie Mac cookin up the track\nThat's right, Snoop Dogg and Dub-C ridin in the back\nMake sure y'all know what time it is\nHuh huh, yeah, we gon' make this happen\nFor everybody out there, the heat bangers, and headbangers\nCheck this out - what's crackin homey?\n\nChorus\n\n[Snoop]\nAll up in this be-i-itch!", "image": "https://images.genius.com/8777655cb8b70c1f3cf7cea574240050.220x219x1.jpg"}], "artist": "Snoop Dogg"}