{"songs": [{"title": "Here I Go Again", "album": "36 Seasons", "year": "2014-12-09", "lyrics": "[Verse 1: Ghostface Killah]\nYo, I've seen Raj\nHe been a friend for years\nNow your boy in blue, how he switched up gears\nHe said how I been?\nI got a ear full of bad news\nYour block is corrupt and it's time to choose\nWe got some niggas running drugs that can't be touched\nUnless you wanna' handle the dirt, it'll mean so much\nI said I got this, message received\nI'mma clean up the block like you wouldn't believe\nCall me Mr. Clean, aka Starkiano\nNine years later slid across the Verrazano\nClean sweep, apply pressure to the scum\nThis is my town, Stapleton is where I'm from\nThird shot slapped in the head with a juice box\nGrenade with no pin in his mouth, this is my block\nAnd Bamboo fucking with this is absurd\nI'mma handle my bee's wax, that's my word\n\n[Hook: Rell]\nCame up out the darkness, searching for light\nI know home is where my heart is\nAnd now nothing seems right\nI tried to make peace and cut my losses\nAnd carry on somehow\nBut I've come much too far, man\nToo late to turn back now, here I go again\nHere I go again\nHere I go again\nHere I go again\n\n[Spoken: AZ]\n9 joints, my nigga you’re home\nStreets is different\n\n[Verse 2: AZ]\nYeah, yeah, welcome home Starks\nRemember us at the jams in the parks?\nOlde Gold guzzlers, Wallabee Clarks\nYoung cold hustlers, obviously sharp\nVoom with the purpose to bloom, so in tune\nDialogue like Disciples in the circle of goons\nMy ace boon, then you got sent to the tombs\nAnd shit went left, had to pinch my flesh\nAnd figure some other scheme to get cream, reign supreme\nYou know everything ain't what it seem\nSo I switched up size, had to switch up lives\nNow I can fuck life and rip her thighs\nA badge and a gun that's legal, it's more lethal\nThan any local dealer that's evil leading peoples\nThe sequel, me and you both could split a loaf\nJust need you a little closer\nYou could squeeze that toast\nAnd knock off targets, starting with the hardest\nBy next year my nigga, we be the largest\nFelonies done with no charges\n\n[Hook]", "image": "https://images.genius.com/7db8c4d449c3f6720b24fadd977f64a9.800x480x1.jpg"}], "artist": "Ghostface Killah"}