{"songs": [{"title": "On Me", "album": null, "year": "2016-07-05", "lyrics": "[Intro]\nA thug's life don't matter. We don't give a shit about you damn thugs, your life don't matter. And you sons of bitches, you fixin' to find out how it don't matter cause you done pissed us off, you bunch of bastards\n\n[Pre-Hook: Gucci Mane]\nBig, big, big pistol me ('stol on Guc')\nYou lose your life, fuckin' right, try me and bleed (Burr)\nI put my first gat first, then sting, I don't think\nI get your head to the white, make your shit pink\nAll OG pink, don't fuck with me\n\n[Verse 1: Gucci Mane]\nI need a detox cause I've been smoking kush all week\nAnd if I piss some dirty urine then I'm up shit creek\nI'm major tourin' shows everyday, I gets no sleep\nMy money lanky, taller than a man 6 foot 3\nMy left pinky nine karat diamond cut so neat\nAnd if I told you what it cost, you would say \"golly\"\nI spend 50k a month and that's just on chains\nI got your girlfriend rolling blunts in the VIP\nI got a carbon 15 sitting on my front seat\nAnd plus my shoes'll eat your face like bon appetit\nThe feds looking at me, know they got they eyes on me\nI feel like 2Pac when he made All Eyez On Me\n\n[Hook: Gucci Mane]\nI keep the Glock on me\nStupid Glock on me\nI can't let 'em get the drop on me\nI keep a nine on me, stupid nine on me\nLord knows I got guap on me\nStupid rocks on me, crazy rocks on me\nI paid a million for this watch on me golly\nAnd my bricks so young, my birds gon' need ID\nI feel like 2Pac when he made All Eyez On Me\n\n[Verse 2: 2Pac]\nBitch you misdemeanor I'm raisin hell like felonies\nMr. Makaveli straight outta jail to sellin' these\nIntoxicated we duplicated but never faded\nNow that we made it my adversaries is player hatin'\nGot a Mercedes for these tricks, that thought I quit\nThen got a drop top Jag for these bitches that's on my dick\nGo to a club in a pack, I'm smokin' bud in the back\nI wait for niggas to trip, cause bitch I love to scrap\nNow mama raised me as a thug nigga, where the love niggas?\nI'm a millionaire started as a drug dealer\nI went from rocks to 'zines, writing raps and movies\nI went from trustin' these tricks now they all want to sue me\nSo fuck em' all\n\n[Hook: Gucci Mane]\nI keep the Glock on me\nStupid Glock on me\nI can't let 'em get the drop on me\nI keep a nine on me, stupid nine on me\nLord knows I got guap on me\nStupid rocks on me, crazy rocks on me\nI paid a million for this watch on me golly\nAnd my bricks so young, my birds gon' need ID\nWhat you know bout me? You ain't got nothin' on me\n\n[Verse 3: Gucci Mane]\nIt get so lonely at the top, I need some company\nMy swears so stupid that these hoes be holding doors for me\nShe wanna stay with me, know that I'ma faithfully\nI'm like a drug to her, she can't walk away from me\nNiggas don't play with me cause I keep AK's with me\nPolice survalliance I know they fuckin' taping me\nBut all they gonna see is diamond cars and currency\nI'm currently out the country chasin' currency\nI got some weed on me now and some ecstasy\n30 grams and a nine and a knife on me\nWatch your mouth bout me, dirty South I be\nDo your momma teach you don't talk when grown folks speak? (It's Gucci)", "image": "https://images.genius.com/b401299ce7bdcfab7a4d2bbbaf5de967.500x500x1.jpg"}], "artist": "Gucci Mane"}