{"songs": [{"title": "Outta Town Shit", "album": "More Fish", "year": "2006-12-12", "lyrics": "I'm six foot two and a half\nWith shoes on make it three even\nBeen shot but I'm still breathing\nSent niggas back to Pittsburgh\nWith they necks wrapped up no lie\nSee that's what happens when slugs fly\nDoves cry when a thug dies\nIt might rain if you're a love guy\nGlocks we tote 'em in belong pawn shops where we resold 'em\nAnd going in we let the fiends hold 'em\nFake aliases, no driver's license or socials\nBut we cold cheek shit, so many hammers left the clerk speechless\nOutdoors my niggas is dirty\nRollin' smoke in the back seat sippin' orange juice\nBumping Blackstreet, suede wallets, Wallabees\nPea soup Clarks, music blastin', laughin' with the whip in park\nBodies for lunch, they eat those\nOld school guns is like old albums, clean 'em and they keep goin'\n\n[Hook]\nHey man it's rough outside\nCrack heads is buyin' all night\nHandguns is necessary\nFuck around you might lose your life\nAnywhere in and outta town B\nThe same every hood it's so real\nThat you gotta be on your grizzly\nIf not then you might get pideeled\n\nLike one day right over a powerful dice game in Minnesota\nWe hit the mall up for kicks\nSlid, in other words bounce, tip the chauffeur\nTo get that cheddar cheese back we lost from earlier\nGet back the dices shaking, stretching my arm like Troy Aikman\nWhat's in the bank? Nigga what? Twelve grand bowl 'em\nNo little shit on the floor roll 'em\nThat's what I do (sounds of dice shaking)\nSix 'em girls, hit his kicks\nI'm a still show that motherfucker he fish\nPound cake, beat that bitch\nHoly smoke! I admire your roll\nTwo fours and a five, they all applause and he smiled\nBut confident me, yea I threw my twelve on the ground\nGrab the dice, blew on 'em\nPassed off the other thirty five thou, I'm doin' 'em\nNigga move shoot 'em, what's that? You roll a five?\nTwenty or better y'all, I'm taking all side bets! Everybody spread out!\nWatch the magic number that my pretty hand let out\nMy first roll was one two four, picked 'em up\nSomebody screamed out, \"Tony Starks headed for the dust off!\"\nI'm like hell no I'm headed for the gun store\nPunch you in your motherfuckin' face like Spongebob\nWatched his face when he aced, the place got quiet\nBowled like twenty forty times, my arm got tired\nCouldn't hit a point, not even a deuce\nTook a swig of my man's goose\nAnything just to give me a damn boost\nThen out came a wonderful six\nHoly shit! Stack that shit\nYo Trife Dies snatch that fuckin' cream quick\nThat was one one six, one sixteen point C\nAnd I don't care about no motherfuckin' Royce Green\nHe pulled out, he pointed at me, I pointed at him\nMy main man pointed at them\nThey pulled their guns out and pointed at him\nAnd crazy shells they was coming in\n\n[Hook]\nHey man it's rough outside\nCrack heads is buyin' all night\nHandguns is necessary\nFuck around you might lose your life\nAnywhere in and outta town B\nThe same every hood it's so real\nThat you gotta be on your grizzly\nIf not then you might get pideeled\n\n[Outro]\nThis just in, breaking news\nToday in Downtown Minnesota, a tragic shootout occurred at 5:23 pm\nAn alleged witness says things went haywire over a dice game\nTwo black males were shot in their buttocks\nLeaving one critically wounded\nTwo others were pronounced dead on the crime scene\nAt a nearby hospital, three New York men are recovering\nIn stable condition but are being held under police supervision at this time\nFor on the spot coverage\nTheodore TV, this is Dusty Williams signing off\nNow back to Tony Starks already in progress", "image": "https://images.genius.com/c666c55fe38ac486d5bf42862246cf28.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}