{"songs": [{"title": "Doomsday (Mister Jason Remix)", "album": "MF EP", "year": "2000-11-28", "lyrics": "MF DOOM - “Doomsday (Mister Jason Remix)”\n[Emcee(s): MF DOOM]\n[Producer(s): Mister Jason]\n[Scratches: Mister Jason]\n\n[Verse 1: MF DOOM]\nI used to cop a lot, but never copped no drop\nHold mics like ponytails: tight and bob a lot\nStop, stick around, come through and dig the sound\nOf the fly, brown, sickled, sicko psycho who throws his dick around\nBound to go three-plat, came to destroy rap\nIt’s an intricate plot of a b-boy strapped\nFemstat cats get kidnapped, then release\nA statement to the press, let the rest know who did that\nMetal Fist terrorists claim responsibility\nBroken household name usually said in hostility\nUm... what is MF?  You silly\nI’d like to take “Mens to the End” for two milli’\n“Doo-doo-doo-doo-doo!”  That’s an audio daily double\nRappers need to fall off just to save me the trouble. yo\nWatch your own back.  Came in and go out alone, black\nStay in the zone, turn H2O to Cognac\n\n[Hook: Samples with Scratches by Mister Jason]\n“On Doomsday” - Sample from MF DOOM - “Doomsday”\n“Operation: Doomsday”\n“MF?  You silly” - Sample from MF DOOM - “Doomsday”\n“Operation: Doomsday”\n\n[Verse 2: MF DOOM]\nI wrote this one in B.C.D.C. O-section\nIf you don’t believe me, go get bagged and check then\nCell number 17, up under the top bunk\nI say this not to be mean, wish bad luck or pop junk\nPop the trunk on C-Cipher Punk, leave him left scraped\nGod forbid, if ain’t no escape, blame MF tape\nDefinition: “Supervillain,” a killer who love children\nOne who is well-skilled in destruction as well as building\nWhile Sidney Sheldon teaches the trife to be trifer\nI’m trading science fiction with my man, the live lifer\nA pied piper holler a rhyme, a dollar and a dime\nDo his thing, ring around the white collar crime.  Get out\nMy face, asking ‘bout my case.  You need toothpaste\nRefresher mint, monkey-style nigga the Dentadent\nAnd dope fiends still in their teens, shook niggas turn\nWitness, real mens mind their own business\nThat’s the difference between sissy-pissy rappers that’s\nDouble Dutch, how come I hold the microphone double-clutch\nC.O.’s make rounds, never had ox found\nOn shakedown, lockdown, wet dreams of Fox’ Brown\n\n[Hook: Samples with Scratches by Mister Jason]\n“On Doomsday” - Sample from MF DOOM - “Doomsday”\n“Operation: Doomsday”\n“MF” - Sample from MF DOOM - “Doomsday”\n“Doom”\n“Operation: Doomsday”\n“MF” - Sample from MF DOOM - “Doomsday”\n“Doom”\n“Definition: ‘Supervillain’” - Sample from MF DOOM - “Doomsday”\n\n[Verse 3: MF DOOM]\nSome M-er F-ers don’t like how Sally walk\nI’ll tell y’all fools it’s hella cool how ladies from Cali talk\nNever let it interfere with the Yeti ghetto slang\nNicknames off nibbling tip of nipple: Metal Fang\nKnown amongst hoes for the bang-bang, known amongst\nFoes for flow without no talking orangutans\nOnly gin and Tang guzzled out a rusty tin\nCan.  Me and this mic is like yin and yang\nClang!  Crime don’t pay.  Listen, youth\nIt’s like me holding up the line at the kissing booth\nI took her back to the truck, she was uncouth\nSpitting all out the sunroof through her missing tooth\nBut then she has a sexy voice, sound like Jazzy Joyce\nSo I turnt it up faster than a speeding knife\nStrong enough to please a wife, able\nTo drop today’s math in the 48 keys of life\nCut the crap.  Far as rap, touch the mic\nAnd get the same shit a Arab will do to you for stealing\nWhat the Devil?  He on another level\nIt’s a word!  No, a name!  MF the Supervillain!\n\n[Outro: MF DOOM]\nDoomsday!", "image": "https://images.genius.com/1cb996b05bf93651b8cfa75da57a2a1a.805x805x1.jpg"}], "artist": "MF DOOM"}