{"songs": [{"title": "Intro", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "[Sample]\nThe sun don't shine it's hot here\nThe streets don't look the same but it's hot here\n\n[Press Conference]\nHey Montana! Yo Ghost, Hey Tony Starks! (Hey Tony.) Hey Tony Starks! Hey Ghostface!\n\nGHOSTFACE: Yo, yo, yo\n\nPERSON 1: Excuse me, yeah, Tony Starks, how long did it take you to complete this album? That's what we wanna know. That's what- that's what the people really wanna know\n\nGHOSTFACE: It's none of your fucking business, man, you heard? Let's move on with the next fucking question, man\n\n2: Yo Ghost! Ghost! Yeah this is Z-Dog! We see the cameras, we see the reporters, forget all that. (Uh-huh) What I'm trying to see is how are you gonna do it for the people on the streets?\n\nGHOSTFACE: I'ma do it how I been doing it. You know what I mean ain't nothing but a different label pa, you need to stay in school man, straight up, get that education...\n\n3: Yo Ghost, Ghost! This is Nina Chantele reppin the MIA. I wanna know how's the game changed since you revealed your face man?\n\nGHOSTFACE: The game got real, you know what I'm saying? But I'm back now, I'll crush all that bullshit. Next question\n\n4: What do you think about those fake-ass gangsters out there son?\n\nGHOSTFACE: Niggas is pussy man. Them niggas know my style, they can't fuck with me man. You know what I mean? It's Tone right here nigga. Word up\n\n5: Hey Ghostface! We wanna know why don't you roll with big bodyguards? You know, like the other guys do?\n\nGHOSTFACE: Cause I don't need them motherfuckers. God is my bodyguard, nigga. You know what time it is man, it's real\n\n6: Hey yo, Ghostface, look-a here. I had a fight over my Wallys (What up pop?), you know the blue and green ones? I mean my gear was stolen! You think you can spare a brother a pair?\n\nGHOSTFACE: Yeah you know what you do? Just meet me outside, meet me near the door when I leave out of here, I got you, baby\n\n7: Yo Ghost Ghost, one more question man. Me and the fans wanna know, what's up with you and Wu-Tang? Man what's really good?\n\nGHOSTFACE: Ain't nothing bro, we just in the grind right now, everybody getting their shit together, doing they solo projects, we gonna come back to smash the world\n\n8: Yo, Ghost man, I got a new insurance company out there, man called AFLAC!!! with the fucking duck!\n\nGHOSTFACE: I hear ya bro, stop eating that pork\n\n9: Fuck you, Toney! You robbed my brother in Expo! Punk bitch! I dare you to do it again!\n\nGHOSTFACE: Somebody get'er out of here. (Bitch let me go!) Somebody get her outta here...\n\n10: Nappy-hair weave bitch getcho ass up out of here! You got them tracks... you got them tracks off Amtrak!", "image": "https://images.genius.com/1563d407e670f05603a84947a6af2c41.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}