{"songs": [{"title": "Bitch", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: Eminem & Bizarre]\nWe got something for the bitches\nThese bitches always be all, giggling and shit\nBut they get mad when their favorite song don't come on in the club\nCatch an attitude and shit\nSo we got one for them, it goes like this\n\n[Verse 1: Eminem]\nWe wrote a song for the hoes\nYou like to hear it, here it goes\nA little something you probably won't hear on your radios\nSo when it comes on in the club it's one that everyone knows\nAnd if I'm talking too fast it just means you're listening too slow\nAnd if you listen a little faster maybe you'll catch up, bitch\nJu jah jah jah dah du ju jah, you just made me mess up, bitch\nBlibiri babiler blabber, it don't matter, I'm just blabbering\nLike you understand what I'm saying anyway\nI'm just traveling in one ear and I'm out the other\nYou're so fucking drunk all you hear is the beat b-b-beat\nI could be saying anything, just get your ass on the floor\nWear the same pants that you wore from the day before\nBaby and shake that ass like a whore\n\n[Hook: Eminem & Kon Artis]\nYeah, I'm talking to you, bitch\nGet up and dance, bitch\nWiggle that ass, bitch\nYeah that's it, bitch\nYeah, I called you a bitch, bitch\nWhat you going to do about it, bitch?\nSit there and cry like a little bitch, bitch\nGet up and dance, bitch\nWiggle that ass bitch\nYou little trash, bitch\nYeah, that's it\nYeah, I called you a trash, bitch\nNot trailer trash, switch\nTake the person you with and exchange partner, bitch\n\n[Verse 2: Swifty]\nTell me that it ain't no hanging and fuck calling home\nUntil you look at me, before you answer the phone\nWhen I flee, your ass can get naked and be as free\nAs you wanna be freak, but I'm taking the key with me\nYou ain't gonna get shit, so don't even ask\nDisrespect my wishes bitch I'll beat your ass\nWatch me coming home full, eating half of your doggy bag\nAnd I leave laughing, while you calling me on the rag\nI'm the type that might cut off the lights when I hit\nAnd before she cut them on, Kuniva already switched\nYour ass ain't even riding with Swift unless you're hoeing\nWhen I'm done, I'll throw you out and ask you where you going\n\n[Verse 3: Bizarre & Eminem]\nHo ain't the only thing you call a girl\nSlut, Tramp\nOh, how you doing, Sheryl\nEver since I was eight I been starting to hate\nI said fuck the hoes and started eating cheesecake\nScrambled eggs and steak, strawberries and grapes\nDamn that sounds great, hold on wait... Bizzy!\nOkay back to the bitches, wash the dishes after that\nGive me stitches, a fucking half Indian chick, sucked my dick\nThis time tomorrow, I won't remember shit\nGot respect for a player, got on snoop gators\nAnd they ain't Now and Laters, bitch\n\n[Hook: Eminem & Kon Artis]\nYeah, I'm talking to you, bitch\nGet up and dance, bitch\nWiggle that ass, bitch\nYeah that's it, bitch\nYeah, I called you a bitch, bitch\nWhat you going to do about it, bitch?\nSit there and cry like a little bitch, bitch\nGet up and dance, bitch\nWiggle that ass bitch\nYou little trash, bitch\nYeah, that's it\nYeah, I called you a trash, bitch\nNot trailer trash, switch\nTake the person you with and exchange partner, bitch\n\n[Verse 4 / Skit: Kon Artis, Kuniva & Dina Rae]\nHey baby, what's up with you?\nHey..\nAyo, your man here with you?\nNope\nNah, you single, I can tell\nYou came with them hoes, didn't you?\nHuh?\nNo, he meant friends girl, excuse him, it's the liquor\nHahahaha\nAyo, let's get this party cracking these bitches ain't got nigga's\nDamn, now you know he didn't mean that...\nCome on, you seen that...\nShe all whining and shit, get this bitch a Kleenex\nWhat did he say?\nNothing! He said you seem stressed\nNaw, you gots big breasts\nHuh?\nAnd you wearing your nice dress\nCause I was finna say..-\nOh, you wasn't finna say shit!\nExcuse me?!\nHe said Michael Jackson just got another face lift\nOh...\nDumb hoe!\nNigga?\nNoo... Gumbo! He wanna cook it for you tonight\nBitch, what up though\nJust fuck for a buck, do something strange for change\nOr make me holla for a dolla, just hop in the range\nShh, shit, shut up nigga, no, shut up\nMan, fuck both y'all niggas\nSee I was trying to be polite, stank ass trick\nOh, somebody is jacking off tonight\n\n[Verse 5: Proof]\nOh you a bitch but don't choke\nI say the same to my Momma\nI got Christina, Britney with me\nShit, we banging Madonna\nWatch her strip you on that ten bitch ain't got change for a dollar\nBlow your tongue and give this one the mouth you came with a condom\nQuick cum is the motto, so just swallow and breathe\nSwallow and breathe, now swallow these seeds\nI know you mocha lotti Mommies won't get down on your knees\nYou want some money honey damn you must be outta your weave\nHit the telly fuck her belly you ain't gotta go weak\nPlus you wanna be a model you need a lot of more sleep\nI'm a pimp bitch don't be shy, show me them big tits\nYour lipstick, I want it smeared all on my limp dick\nFor instance, busting nuts is only my interest\nSo princess, don't get your feelings hurt cause men just\nParty and bullshit till she gargle and swallow the dick\nI'm taking the train to spain, don't bother calling me, bitch\n\n[Hook: Eminem & Kon Artis]\nYeah, I'm talking to you, bitch\nGet up and dance, bitch\nWiggle that ass, bitch\nYeah that's it, bitch\nYeah, I called you a bitch, bitch\nWhat you going to do about it, bitch?\nSit there and cry like a little bitch, bitch\nGet up and dance, bitch\nWiggle that ass bitch\nYou little trash, bitch\nYeah, that's it\nYeah, I called you a trash, bitch\nNot trailer trash, switch\nTake the person you with and exchange partner, bitch\n\n[Outro: Kon Artis & Eminem]\nHahah!\nYeah you heard me bitch, did I stu-stu-stutter stupid?\nYou ain't listein to the words of this song anyway\nAll you do is listen to the beats with your dumbass, bitch!\nDancing, trying to get a nigga money in the club, haha, with your stupid manipular self\nWe was talking bout you DODO\nYou, you dumb bitch! YOU! Haha\nThe one that want a drink and dont want to pay for it\nSpend all your money you make all week on that dress\nAnd I spill a drink on it, acting like I'm drunk when I'm not\nI'm just tryna fuck! Haha!\nI'm just tryna fuck, bitch!\nHahah!\nWooo! D-Twizzy, yeah!\nBitch! Bitch! Bitch!", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}