{"songs": [{"title": "Testify", "album": "HNDRXX", "year": "2017-02-24", "lyrics": "[Intro]\nSo I'm the bad guy, huh, so you supposed to be the good girl\nHuh, okay\nSuper\nEither way it go, either way it go (Either way it go, nigga, ball, ball)\n\n[Chorus]\nSo you wanna fall for the bad guy?\nSo you wanna fall, gettin' mad high?\nConfess your love for me, testify\nAnytime I'm with you, gotta testify\nAnything we go through is a test of times\nCan you be the one who love me all the time?\nWe not doing good, you can see the signs\nCan you do the crime like it's Bonnie and Clyde?\n\n[Verse 1]\nI'm giving you my testimony line for line\nI'm giving you the best of me, it's wrong or right\nSomebody tell the kids they need to calm it down\nI wanna hear your heart pump pound for pound\nShow me everything I need to see on my blind side\nShow me you gon' be there for the love of a real boy\nI just wanna be there for my dogs, they need me\nI just wanna be there for the game, that's easy\nCrumble up some herb, we ain't gettin' no Z-Zs\nConnoisseurs of purp, gotta give 'em a repeat\nTurbo, sixty seconds in a Porsche on a one way\nAmigos down in Texas, we gon' get us some grande\nCherish every minute, every second we vibe, baby\nI wanna be confident when I say you my lady\nI wanna be arrogant when I say you mine, baby\nI know I embarrass you, I typically violate it\n\n[Chorus]\nSo you wanna fall for the bad guy?\nSo you wanna fall, gettin' mad high?\nConfess your love for me, testify\nAnytime I'm with you, gotta testify\nAnything we go through is a test of times\nCan you be the one who love me all the time?\nWe not doing good, you can see the signs\nCan you do the crime like it's Bonnie and Clyde?\n\n[Verse 2]\nA lil' turbulence got you mad curious\nI could've been, but I made a jugg again\nParking lot dealership, I'm in to win\nWe can't fake the flaws, we can't do pretend\nCan you keep it solid and don't ever bend?\nWe gon' need colossal, we gon' need colossal\nHold me down, down, down like a real shotta\nWe conversin' back and forth like we real partners\nSpiritually, we bonded through the turmoil\nI try my best to treasure, give a little more\nI know you need my time, 'cause there's gwala comin'\nI know you seen the wave comin' and you start runnin'\nDon't you be afraid, I'ma guard you with my life\nYou listen to these blogs, they gon' tell you I ain’t right\nListen to your heart and we gon' ride for life\nShorty on the squad, she gon' ride for life\n\n[Chorus]\nSo you wanna fall for the bad guy?\nSo you wanna fall, gettin' mad high?\nConfess your love for me, testify\nAnytime I'm with you, gotta testify\nAnything we go through is a test of times\nCan you be the one who love me all the time?\nWe not doing good, you can see the signs\nCan you do the crime like it's Bonnie and Clyde?\n\n[Outro]\nConfess your love for me, testify\nConfess your love for me, testify", "image": "https://images.genius.com/afbe3491636038318be7bfa343473fd1.1000x1000x1.jpg"}], "artist": "Future"}