{"songs": [{"title": "Apple Pie", "album": "Rodeo (Deluxe Edition)", "year": "2015-09-04", "lyrics": "[Intro: Travis Scott]\nShe say your bad ass always had a thing for sweets\nGuess that's why I'm so hot on the street\nWon't you and your friends come eat with me\nAnd let me show you how to whip that recipe\nShe say your bad ass always had a thing for sweets\nGuess that's why I'm so hot on the street\nWon't you come over and eat with me\nAnd let me show you how to whip-whip-whip-whip that recipe\n\n[Verse 1: Travis Scott]\nI don't want your apple pie, mama\nYeah, I ain't tryna dap up niggas blockin' me\nYeah, made it out the spot, straight to Quintana\nAnd I'm still that nigga with diamonds on my blocka\nI say when they come at me I bet they have some backup\nI bet I take your bitch, she take that dick straight up the stasher\nKeep an ounce of garlic just to keep away the Draculas\nI just seek out to find my home, why can't they just leave me 'lone\n\n[Chorus: Travis Scott]\n'Cause I don't want your apple pie, no no mama\nI don't want your apple pie, no, yeah\nI don't want your apple pie, mama\nI don't want your apple pie no more\nI need my own pepper pepper, please, pepper, pepper seeds\nNeed my own reme-remedy, my own legacy\nYeah I don't want your apple pie, mama\nI need my own pepper please\nMy own legacy, my own recipe\n\n[Verse 2: Travis Scott]\nI came to get it nominated\nFrom a spot that y'all seen Bun B blow up (Ooh)\nI hate to break your heart, I bet I'll make the mark\nThat y'all see a legacy go up (Ooh)\nGoyard done break your pockets\nBoy, I'm out in Paris lettin' all these beats go up (Ooh)\nI make in one appearance\nWhat these niggas hatin' makin' in four seasons (Ooh)\nH-Town, know we gon' stunt\nI'm for real and your Rollie tick (Ooh)\nLook bitch, this the Rodeo\nBut I ain't goin' out for your bullshit (Ooh)\nAnd I don't want your apple pie, mama (Ooh)\nI don't wanna dap up niggas blockin' me (Ooh)\nI am everything except a rapper\nShit, I got at least 25 lighters on my dresser, aw, yeah (Ooh)\n\n[Bridge: Travis Scott]\nRoxanne tonight\nRoxanne tonight (Yup, yup)\nRoxanne tonight (Yup, yup, yup)\nRoxanne tonight (Yup, yup, yup)\nRoxanne tonight (Yup, yup, yup)\nRoxanne tonight (Yup, yup, yup)\n\n[Outro: T.I.]\nQue será, será, so the story goes\nOn and on and back and forth, the evolution's absolute\nTours and shows and groupie whores\nWouldn't hesitate if he had to shoot\nThough he'd rather not\nForever been the elephant in the room\nThat everyone can't wait to run and tell about\nThe head to the body of the belligerent militant group\nThat sponsors the revolution that will not be televised\nDecide to cross those lil' guys, you've obviously been ill-advised\nYet and still, the question that arises to the mind\nWill he make it? Was it worth it?\nDid he win? Will he survive? T he Rodeo", "image": "https://images.genius.com/937ebfe41ce59f14c6ecff9976182911.600x600x1.jpg"}], "artist": "Travis Scott"}