{"songs": [{"title": "On Business People and Corporations", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2013-02-23", "lyrics": "How y'all feelin' tonight? Thank y'all for coming out to this impromptu type important performance, let me just say that right quick. I love the energy in this city - this is one of my all-time towns y'all know I stay out here. But I came here for the creativity more than anything, because creativity fuels everything\n\nI hate business people. People get on the phone with me and tell me ya know like, 'What kind of business can you do, though? What type of business are you doing? What's the numbers? How much did you sell? What's the radio spins? How much shampoo can you sell with your face on it and shit?\n\nRemind me again why we in this shit\nCan you remind me again why we in this shit?\n\nRemind me again why we in this shit (3x)\nI know it's for more than to just get rich\nSince when was making music about getting rich?\nSince when was making art about getting rich?\nAnd I know it's easy for me to say cause\nHaving money's not anything and not having it is\n\nRemind me again why we in this shit\nRemind me again why the Grammys couldn't suck my dick\n\nRemind me again who's the original Superfly -\nAnd I got love for Hov but I ain't fuckin' with that \"Suit and Tie.\"\n\nRemind me again\nRemind me again why we in this shit -\nEvery nigga tryin' get rich\nEvery rapper tryin' get rich\nAnd every rapper rap about fuckin' somebody else... bitch\n\nRemind me why we in this shit -\nAnd why the Grammys can suck my dick, suck my big, black dick\n\nAnd every motherfuckin' sponsor, shit\nThey try to put their logos all over the concerts and shit\nFor a meet-and-greet, and you gotta meet the execs and their daughter\nAnd they'll show you what they just bought her\n\nRemind again why we in this shit -\nReal niggas don't live too long in this shit. (x5)\nThey say either you comin' on too strong in this shit -\nThey always talkin' 'bout what I'm doing wrong in this shit\nWell I COULD GIVE A FUCK ABOUT ANYTHING, DICK\nI COULD GIVE A FUCK ABOUT ANYTHING DICK!\nRemind me why we in this shit -\nI lost my motherfuckin' mama\nSo I could give a fuck about your comments\nI promise\nCause we all gonna die one day\nBUT I'MMA LIVE MY LIFE MY WAY!\n\nRemind me why we in this shit? Please? can I sell a drink for you please?\nSo you can help me put on a better show, Please? Corporations?\nCan you please support me? I swear I'm a nice nigga now. I swear I'll put the pink polo back on. I swear to you. Please. Just for three million dollars. I need it so bad. I need a new pool in my back yard. So I tell all my fans that your shit is cool. And if they believe in me they should also believe in you. Did you get the check yet? I have to call a business manager - did the corporations send the check yet? What's my public rating right now? Are people liking me again? Enough to get money from the corporations - is it OK now? They forgot about the whole Beyonce thing right? Okay cool. Is it OK now?\n\nRemind me why we in this shit -\n\nNigga I'mma make my music from my heart, and I live and I die by\nEverything that I say and everything that I do\nAnd everything that I make is what I believe to be true\nAnd if that shit don't make sense and sound like nonsense\nI don't give a fuck - cause that was my stream of conscience\nAnd that's the way I felt at that time\nAnd feelings was the only facts\nAnd Racism and materialism is killing blacks\nAnd one more thing, if I can ask -\nOne more thing if I can ask -\nCause in this life our life just moves too fast\nAnd time is something you will never get back\nWhat's your quality of life?\nWhat's your quality of life?\nAnd that's why I mean it when I say I hope you have a good time tonight\nI hope you have a good time tonight...\n\nLONDON! It's Louise Wilson's birthday tonight - an inspiration, not the lead instrument I'm the lead instrument. Happy birthday to Louise who taught Alexander McQueen... and Kanye West, even though she doesn't want me to put that on my resume. But I just feel sometimes like there is no good ideas and no real ideas and nothing sincere left. And everything's been so homogenized. And it's all Big Business, and there's no creativity. When really we have the ability to have a union Utopia if we just help each other, if we just use our resources and stop trying to compete against each other and\nBeat each other and\nEat each other\nAnd maybe come together and try to teach each other and\nReach each other and\nMaybe try to come together and love each other\nLove each other and\nLove one another, man\nThe way you love your mother, man\nThe way you should love her, man\n\nY'already understand\nCause this is our shit\nAnd this is our clique\nAin't nobody fresher than my motherfuckin' clique\nI said ain't nobody fresher than MY MOTHERFUCKIN' CLIQUE!", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}