{"songs": [{"title": "Underdog", "album": null, "year": null, "lyrics": "[Hook: Sly]\n\nAt first they groove for the underdog\nTill, you win the brawl\nNow, it's you they call\nPROOF! They gots to be the proof for the underdog\nTill, you prove them wrong\nNow, you gots to fall\nThey gots to be the proof [go down x8]\nYou gots to be the proof [go down x8]\nThey gots to be the proof\n\n[Verse 1: Dr. Dre]\n\nNiggas is so gangsta, niggas is thugs\nNiggas'll spend their whole life peddling drugs\nSlanging dope in hopes of one day bein able\nTo own their own label and give the game up\nSome niggas came up, some just didn't\nThat's just the way it is, if it ain't meant it just isn't\nSome niggas'll get money and pay niggas to back em'\nSo they can act up, feel comfortable, and rap tough\nAnd that's as backwards, cuz them niggas just gone keep coming back\nAnd that's when extortion happens\nYou struggle to get free, I know how this shit be\nYou deal with anything to live legitimately\nBut you gone find if you do get in this industry\nIt's best to be business me than against me\nNiggas get behind mics and ain't even MC's\nNiggas get on MTV just to diss me\n\n[Hook: Sly]\n\n[Verse 2: Obie Trice]\n\nThey say why don't we increase the peace\nThe only peace increased is that which deletes your peeps\nCuz iggaz run mouths but they don't run streets\nTill that 4 5 will cease the speech\nYeah it's a shame how the beef'll creep\nCould've readched the peep, now you're left with a horrible leak\nI'm try to be bleak with my speech as possible\nJust in case a nigga trying to throw me an obstacle\nI put you in a hospital, that's how I get at you\nLet the doc op on you, he don't rid you?\nYou back on the streets? I send another hit at you\nThis is not a hypocritical issue\nI will critical condition your tissue\nGive a fuck if all ten of them with you\nI throw an extra ten of them missiles\nTurn gangstas into gentlemen\n\n[Hook: Sly]", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}