{"songs": [{"title": "We Run This (Promo Only clean edit)", "album": null, "year": null, "lyrics": "My style can't be duplicated or recycled\nThis chick is a sick individual\nSick tape, volume 2!\nBelieve it! Oh! Oh!\nLet me switch up the game\n\nI drink that cognac yeah, step back cuz I might put it on ya\nI go deep so deep, til you sleep, count sheep wake ya up from fucking all week\nYou don't want me to show ya how freak bitch act when I ain't soba\nOne of em, tore up, sho nuff. I ain't scared to take it off, tell em' free to take it off\nTipsy and it feel good, black dudes got big woods. Into it, I do it, I did it\nIf you really, really want it then nigga stop frontin\nHey, boy you know I'm your type, 5'2 and wear my jeans real tight\nMy curves, they swerve, so superb, my word is my word and I came to serve\n\nChorus: We run this, we run this, we run this, ugh! ugh! oh!\nIt don't matter where you from, it's where you at and if you came to freak-a-leak better bring your hat snicka!\nEast coast, west coast, down south, represent your coast\nYeah we run it, yeah we run it, y'all don't want it cuz my coast run it\nOh! We run this shit, we run this shit!\n\nWanna pull my hair, break my back?\nPut it right money might sit in your lap back to back I can't even keep track\nIt's a fact the freaks love to get slapped\nSuck my toes and in the back rub\nI don't come to do it, I just wanna be touched\nLook at how y'all makin me blush, some enough to go around so groupie don't push\nWanna run that tush in the bush\nDon't my diamonds look real good? and they shine so hard that he glittas, so many karots they look like crittas\nAnd we can do it all night, take a flashlight to see up in my windpipe. I like to keep a nigga hype\nI wanna know can you handle my mic\n\n(Chorus)\nAny hustla's in the party y'all? Hell ya!\nIf you's a pimp let me see ya party on, Hell ya!\nOh, strippas take yo clothes off, Hell ya!\nY'all superstars y'all don't need no bodyguards, Hell ya!\n\nNigga I bow guard, alotta rappers fake way to hard\nPull up to the club in a rental car\nWhere the freaks at, freaks at da bar where da hard drinks are\nDon't start! If you don't want beef don't take it that far, wit a superstar\nI got my foot on the clutch, see me bounce my butt, misdemeanor too much and I don't give a fuck!\n\nWe run this, we run this, we run this. ugh! ugh! oh!\nIt don't matter where you from, it's where you at and if you came to freak-a-leak better bring your hat snicka!\nWe run this, we run this, we run this. ugh! ugh! oh!\nRepresent your coast and act like ya know, know how to act fore' you step your two feet in the door!", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}