{"songs": [{"title": "Understanding", "album": "Original Demo Tape", "year": null, "lyrics": "[Intro: AZ]\nYea, yea, check it out\nI see today's mathematics as being understanding, you know?\nUnderstanding is having the ability to see things clearly\nFor what they are not what they present theyself to be\nIt completes the cipher, you know what I'm saying?\nIt's also symbolic to the black child which is the best part\nAyo, son, represent\n\n[Verse 1: Nas]\nNow I'm the average nigga in the street life God\nI try to beat trife odds, ride my L.E through the night fog and park\nIt's Buddha to be sparked, it's consistent\nThe beast smells the el because it travels long distance\nCruising in his Chrysler, pursuing niggas in my cipher\nStart wildin' like insane asylum on Rikers Island\nVerbal assassin, I murder freestylin'\nOne two for the gun crew, three drinking Cristal n\nI play the side cause the words of man kill\nProverbs, buck out my grill, real as Ill Will, peep the steel\nNobody move nobody die, why must I be high?\nBusting in trife bitches, touchin' mic switches\nIt's like a hot spoon of heroin, a Don like Perignon\nFemales love the guns I be wearing\nPlant my seeds to live infinite, indeed in my sentences\nI flow demandin', that's understandin'\n\n[Verse 2: Nas]\n850 Tempo but rugged like a Pinto\nChop shop hip-hop, burn the block intro\nHigh priests release voodoo, déjà vu and this taboo\nIllmatic shit and what have you\nChef cocaine cook, no brain got the proper diction\nMy competition bleeds words and weed blurs my vision\nI'm freezing in time, stop the rhyme\nI'm sober in stolen Range Rover much crime\nI, stick up America, Nas in your area\nDisrupt the sound barrier, clowns get pounds of terror\nA full whip for more clips then Clint has in his era\nDirty Harry, cold black the uncanny, of Kojak\nA Beretta sticking up trucks carrying amaretto\nClever to entice 'em, herbs I'm micin' while I'm pricin'\nNiggas like they're slaves, best behave I'm the nice one\nNas, broken down for Nasir, means protection\nPop Dukes, resurrection international hoes, I'm sexin'\nOr you'll be fucking one section, question?\nDoes a lonely mic give me an erection?, yes, son\nOn a float like the Jetsons futuristic rappin' mystic\nBust it, try and diss while my finger is on the iron biscuit\nI rhyme terrific sparklin' like the diamond district\nIt's understanding", "image": "https://images.genius.com/3d5180486c5864bcc94ba79789630f59.268x268x1.jpg"}], "artist": "Nas"}