{"songs": [{"title": "Success Freestyle", "album": null, "year": null, "lyrics": "[Intro]\nI got these niggas Keno. Bar Exam 2 baby\nLet that bitch breathe\n(Armz)\n\n[Verse One]\nI used to give a fuck\nNow I could give a fuck less\nWhat do I think of success? It sucks\nTo much sex\nMy life is a fuck fest\nAnd I ain't blew up yet\nYet\nLet that bitch breathe!\nI used to give a shit\nNow I could give a shit mo'\nCause I could pull a bitch mo'\nSpit Cris, get a clique Christmas, trick doe\nWent from livin' piss po' to livin' like I'm Rich Po\nThe clip explodes\nExtended clip looks like it floats\nIt sparks, get smart before it smokes\nGet close and get you a slit throat\nA long kiss\nYou get you a mistletoe\nOn it's toe tag\nTouch you fags quick as Chris Stokes\nPause\nI'm bout doe to my outro\nSo your ass gonna bounce that check your mouth wrote\nHa, like you need Beef\nI do you like I do these beats\nThen instigate it like I'm QDIII\nI've been the greatest, I'm just seein' what's good\nI put you in a fucked up spot\nLike front seat in the beamer with Suge\nUh\n\"I wish a nigga would\"\n\nLet that bitch breathe\n\n[Verse Two]\nNow peep this\nIt's like I need three chicks\nOne Cup to freak this\nReach this level of speakin'\nOr eat shit\nShit\nI'll shit on y'all niggas\nVeezy tell 'em\n\"Man, y'all ain't got shit on my nigga\" (Whow!)\nI need a whole new world to fit my big shoes in\nAnd you can have an accident while I'm out with my bitch cruisin'\nSlip and bump your head on the bullet\nYour clique's losin'\nI'll give you +99 Problems+ but I ain't Rick Rubin\nIt's Nickel you bluffin'\nYou in a pickle, kickin' the bucket\nI'm pullin' strings like I'm liftin' a puppet\nAss buster\nAnd I Remain Raw, you can ask Busta\nAsk Ras, \"Is 5'9\" a bad mother\nFucker?\"\nAs far as beef, put it all to sleep\nTil I'm at peace like I'm the soul of Chad Butler\nR.I.P\nNigga, your fans love ya\nAs far as I am concerned, you was the last of ya\nBack to my guns\nGet clapped by my guns\nYou act like you want it until they ringin' as loud as a bad muffler\nYou celebrity raps niggas is mishaps\nYou wack\nI'd rather hear Hugh Heff's bitch rap\nOr Shar\nI know what you thinkin'\n\"He's dissin' Bizarre.\"\nYou over thinkin' it bitch, get in the car\nThat's my nigga\nWe'll run a trizzy on you then play you to the left\nLike when Jimmy Hendrix flipped the guitar\nOwww\nRide with me, who live as me?\nWhat nigga you know will look him right in his eyes and squeeze?\nObie\nLet that bitch breathe", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}