{"songs": [{"title": "They Want Me Back In", "album": "VI - Return of the Real", "year": null, "lyrics": "[Ice-T]\nYeah, Shit is going down again!\nThis motherfuckers want me back in! Fuck!\n[Method Man: Word up, our niggas is strapped, ready for war!] 4x\nGet out the H-K!\nFuck!\n\nNiggas talking crazy cause they say, that I\nKill one of they motherfuckers\nSucker ass busters\nDid or did not?\nI got more drama with the niggas from the other side\nCall my nigga Rich in his ride\n\n[Big Rich]\nYo Ice, fuck them niggas\nI got a truck full of 38, some bullet shields\nIce, we can send this niggas all to Hell\nI never like them niggas from the get go\nWe used to break em at craps\nAnd fuck all they motherfuckin hoes!\n\n[Ice-T]\nMade another car-hit\n30 Killers on the hip\nReady to rock, packin, Magnums and Glocks\nMad connections who trips the question\nNiggas on the way to play with the laser ray\n\n[Big Rich]\nNigga you got two strikes and I got two strikes\nWe can't afford to leave no fuckin witness tonight\nBut if this is what they want is like Christmas to me\nIt's been a long time since the Big Rich caught a body\n\n[Ice-T]\nFuck it, I Like the way you think my man\nI pack 20 motherfuckers in an Astro Van\nWe pass the crib about 12:30, dirty\nNigga be ready to roll, I know you heard me!\n\n[Big Rich]\nNigga it's on, so don't trip I'm down\nI got to sawed off shawty and I'm ready to clown\nBlast the nigga in his Face, kill his fuckin whore\nIce, you done did this kind of shit with me before!\n\n[Method Man: Word up, our niggas is strapped, ready for war!] 8x\nThey want me back in!\nNiggas want me back in!\nThey want me back in!\nDamn!\n\n[Ice-T]\nNiggas wanne ill, but my niggas get iller\nStreets full of hardcore stone-face Killers\nOne Love my nigga Big Rich puff bud\nI don't get high, I wanne see some niggas die!\n\n[Big Rich]\nYo, some niggas hit the corner with the lights of Ice\nThat shit don't look nuthin nice\nBut if this niggas wanne rollin my Hood\nYo then fuck it\nBrake out the hardware boys\nBlow up the fuckin buck it\n\n[Ice-T]\nNiggas pulled out but my crew is ready\nReturn the fire\nRock the punks steady\nWhen the shootin stop, car look like confetti\nWent my ass home jump back in the bed G\n\n[Big Rich]\nFuck why they wanna fuck with us\nWhen they know my posse is crazy and they down to bust\nBig Rich take no shit from these busta ass tricks\nCheck a punk ass nigga like we check a bitch\n\n[Ice-T]\nI got no love for no nigga flippin, trippin on my fam\nGot damn, I make L.A. hot as Vietnam\nBut ill niggas should be left alone\nPlease excuse me, while I rest my dome!\n\n[Method Man: Word up, our niggas is strapped, ready for war!] 8x\nThey want me back in\nNiggas want me back in\nThey want me back in\nWhy......niggas want me back in?", "image": "https://images.genius.com/8794c719c37c748d62c37145c9babe1a.700x700x1.jpg"}], "artist": "Ice-T"}