{"songs": [{"title": "Look Around Me", "album": "Along Came Joyner", "year": "2015-04-05", "lyrics": "[Intro]\nMan I wish these hoes could see me now, things changed\nI remember when I used to beg for change\n\n[Verse 1]\nI done came a long way from the block where these birds got their hands out\nRemember lil me? Guess what, motherfucker? I'm the man now\nShe used to hang up on a nigga when I called, that was year 'round\nNow the same bitch wanna give me good brains with her hair down\nAnd that's funny, and my ex wanna call me, saying that she wanna have me\nTalking 'bout \"When we getting married?\"\nBitch you need to find another pappy, and haters don't look too happy\nSwear it's my fault, you done turned me to a monster\nFly ass truck, I'm a Tonka, and I ain't really into the drama\nI'd rather get paid, period, no comma\nMind your damn business, homie what you saying?\nI done came up, fuck is you talking 'bout? I'm just working\nFuck is you thinking? I got some hurt for the niggas\nI got some pork for the bacon, if it ain't bones that I'm breaking\nAnd I was born on probation, they pulled me over to take me\nInside the border, they drained me and cut me open and gave me\nSome fuckin' potion I'm craving, dammit, look what you made me\nI'm just going\n\n[Hook]\nLook what I became from where they found me\nI think you should take a look around me\nI hear people saying things about me\nI think you should take a look around me (x3)\nI hear people saying things about me\nBut I think you should take a look around me\n\n[Bridge]\nMan I wish these hoes could see me now, things changed\nI remember when I used to beg for change, that was way back\nNow I sit and wait while these niggas plotting payback\nSuccess is on the way\n\n[Verse 2]\nUhh, I done came a long way from the stoop where the fiends got their hands out\nRemember lil old me? Guess what, motherfucker? I'm the man now\nHe used to run his mouth 'bout me all around the hood, it was man down\nAnd now the same nigga want a fucking autograph, he a fan now\nAnd that's funny, now my ex girl calling saying that she tryna see us\nTalking 'bout \"Where we gonna meet up?\"\nBitch you need to find another re-up, and haters wanna see me get beat up\nYeah it's my fault, it done turned me to a psycho\nAss so fat she need lipo, and I ain't really into the titles\nRather get insurance on the pussy, no Geico\nMind your own business, homie what you saying?\nI done came up, fuck is you talking 'bout? I'm just working\nFuck is you wishing, I got some dirt for the pigeons\nI got some work for the business so write my words on the ceiling\nI hope I'm hurting your feelings, they pulled me over, I went in\nInside the border to check in, they cut me open and gave me\nSome fuckin' potion or medicine, dammit look what you made me\nI'm just going\n\n[Hook]\nLook what I became from where they found me\nI think you should take a look around me\nI hear people saying things about me\nI think you should take a look around me (x3)\nI hear people saying things about me\nBut I think you should take a look around me\n\n[Verse 3]\nI used to get mad when the hoes ain't flock\nI used to get bullied by the whole damn block\nRunning from the boys, hope I don't get caught\nNiggas had guns, hope I don't get shot\nLord, oh Lord can you answer my prayer?\nBeautiful dreams and these weird nightmares\nStandin in blood with a pair of Nike Airs\nI'm just tryna get a buzz, I'm the real light year\nHo point me to the door, I'm catching my breath\nBlood on my blood, and flesh on my flesh\nMy heart might stop but I'll stretch you out, yes\nMachiavelli and Pac, resurrecting my death\nAnd I'm back as a hologram, Jesus must be inside of him\nWhat you riding in? Wanna talk about ice and Beamers?\nGet your shit broke like Ike and Tina\nI was born on the seventeenth day\nAlong came Joyner, in Heaven we pray\nBorn by the pussy I'll die by the pussy\nThat just means that I could never be gay\nTake a look around me, me, you floss too much\nAnd talk about how you just a boss too much\nI swear I love winning cause I lost too much\nI wanted Drake on the hook but he cost too much\nFuck I look like lying then? I'm a pyro's pirate\nSet the hood on fire, hit the hydrants\nGuess I'm just a product of my environment\nAnd that's word, flashbacks to my teacher in class\nTelling me she hope that I don't finish high school\nAll I know is I came a long way\nAnd I'll be God damned if I ever stop soon\n\n[Hook]\nLook what I became from where they found me\nI think you should take a look around me\nI hear people saying things about me\nI think you should take a look around me (x3)\nI hear people saying things about me\nBut I think you should take a look around me", "image": "https://images.genius.com/e0f1ef72a727167faed7990bf3663ea4.800x800x1.jpg"}], "artist": "Joyner Lucas"}