{"songs": [{"title": "It’s the R", "album": "The Master", "year": "1999-11-30", "lyrics": "[Verse 1]\nIt's Mr. Lowkey you need to go see\nThe host by far a mostly O.T\nWith a brand new show but you know how the flow be\nCause when I swerve, you observe it closely\nIf you smoke trees, smoke more than an OZ\nMix any kind of dope with me, you OD\nYou get the CD, LP, C-O-D\nPoetry cause you to fully load the V\nDrop place to place be crazy over me\nEven different nationalities, overseas\nHowever do a don't emcee, you know me\n(My name is Rakim Allah) G-O-D\nShe know she D-O-E, so show me\nEven with no jewelry she call me Goldie\nLike a Jacuzzi she overheat an OG\nLike sushi swimmin' in a open sea (I'm comin')\n\n[Instrumental Scratches]\n\"The R\"\n\"Rakim is on the mic\"\n\"I'm the R, the A, to the K-I-M\"\n\"The most popular demand and rap classic\"\n\"If I wasn't then why would I say I am?\"\n\n[Verse 2]\nShe said it's the same since I came and rained, it's still hard\nYou can stimulate the brain, feel the God\nIt's hard to go against the grain, it's real large\nDrive'em insane leave dames in silk bras\nPlus real cups spill, spill that bars\nWhat's the deal? Kids with Hennessy grills, they feel charged\nAnd you know what time it is? It's still Ra's\nWhen I do a show real far they steal cars\nStages of battle field reveal your scars\nTrain hard, cause this is a game with ill squads\nPlay with pain and gain a couple of yards\nAnd if you know the deal, you can deal the cards\nAnd appeal to broads with jobs and OV-E-OD's\nBody parts like buns of steel and spa's\nThen we can kick the blahzay blah, smoke a cigar\nWhile I get ma-na-massage\nI'm comin'\n\n[Instrumental Scratches]\n\"The R\"\n\"Rakim is on the mic\"\n\"I'm the R, the A, to the K-I-M\"\n\"The most popular demand and rap classic\"\n\"If I wasn't then why would I say I am?\"\n\n[Verse 3]\nFrom the inner city to the suburbs, the street poet\nThe most jiggiest kid with words, and peeps know it\nThey've read about it and heard, plus TV show it\nSo how do I reserve my swerve? I low pro it\nNow there eager to know just how deep the flow get\nI don't know yet, sometime the flow be so wet\nSpit a tech that will effect quicker than Moet\nOr high as anything you smoke yet, go ahead roll it\nAny microphone I hold, my heat blow it\nMy M.O. is make more dough till I can't fold it\nAnything I see or touch, I wanna own it\nDrop a jewel in baby girl ear, now she my co-ed\nI re-load and she keep the candy coated\nAnd when she know she can't control it\nShe tell me she about to blow at any moment\nWell go ahead baby I can't hold it (I'm comin')\n\n[Instrumental Scratches]\n\"The R\"\n\"Rakim is on the mic\"\n\"I'm the R, the A, to the K-I-M\"\n\"The most popular demand and rap classic\"\n\"If I wasn't then why would I say I am?\"", "image": "https://images.genius.com/ed0fa8170b1ec37192ad4e270a004891.500x500x1.jpg"}], "artist": "Rakim"}