{"songs": [{"title": "Marcus’ Gospel", "album": "No Shame", "year": "2017-11-24", "lyrics": "[Verse 1: Hopsin]\nI done lost myself again\nI done lost myself in sin\nI've been burned by selfish men\nI've been died but held it in\nI do not want hell to win\nLife's cold, I done felt the wind\nCould it be any clearer?\nWhen I look in the mirror\nI just see a jackass with a tail to pin\nMe and my family ain't close\nSo I got some fame and went ghost\nI am not paintin' a hoax\nYou can hear the pain in my flows\nThey say that life has it's ups and downs\nBut why do I stay in the lows?\nI don't like Marcus, I don't like Hopsin\nI am ashamed of them both\nYou see, all that I have is my money\nI had no idea that this was coming\nI fell into the stereotype of a rapper\nI'm how they package a dummy\nThis is my reality I embrace\nI look back and I can see my mistakes\nI just wish that I could rewind the days\nI honestly don't want to be out of place\nI guess we gotta face\nAll these issues like this as a human sometimes\nYes, I am losin' my mind\nIf you ever come to that conclusion, it's fine\nDon't ignore all of the proof and the signs\nI made my bed, I'ma lay in it\nThe thought is as soothin' as wine\nNow all I need is a suit and a tie, I tried\n\n[Chorus: Michael Speaks]\nIn my lowest times\nI have failed to see\nSunny days are waiting\nI'm in need of some company\nGod, please help this pain\n'Cause I don't wanna ever see\nThis lonely road again\n(This lonely road again)\n\n[Verse 2: Hopsin]\nTake it away, I want the peace, I want the happiness\nI took a blindfolded shot, it was accurate\nBut in my heart I know I never asked for this\nSee, this life I'm in, it seem miraculous\nWho knew I'd break a few bones when I tackled it?\nIt's been years and I still can't adapt to it\nI cannot predict what my next chapter is\nThere's a hearse speedin' fast in the ashes and\nI feel like I lay flat in the back of it\nThere's no love in my eyes, so look up in the sky\nBring me back like you did Lazarus\nI can hear the devil whispering, \"Come play!\"\nInjecting me softly with numb pain\nMy fingers are covered in blood stains\nIt's torturing not seeing my son Zade\nBut one day, that will all change\nWhen the fog strays, it's a lost page\nThat had blown away into the hallways\nIn the land where the wild dogs play\nWhen you're confined into a small space\nYou will know that that's enough to cause rage\nI'ma kick until the fuckin' walls break\nI don't know what made me walk straight\nInto this fire, my soul is burnin' quick\nI've been told this isn't permanent\nGrowin' up, my father made a lot of mistakes\nI do not know why I didn't learn from his\nCan you direct me to where the furnace is?\nI need to do away with pain that's lurkin' and\nMaybe figure out what my new purpose is\nAll these bad vibes are so discouragin'\n\n[Chorus: Michael Speaks]\nIn my lowest times\nI have failed to see\nSunny days are waiting\nI'm in need of some company\nGod, please help this pain\n'Cause I don't wanna ever see\nThis lonely road again\n(This lonely road again)\nIn my lowest times\nI have failed to see\nSunny days are waiting\nI'm in need of some company\nGod, please help this pain\n'Cause I don't wanna ever see\nThis lonely road again\n(This lonely road again)", "image": "https://images.genius.com/538c208e6d573914c37ce0417736d005.1000x1000x1.jpg"}], "artist": "Hopsin"}