{"songs": [{"title": "Kick, Push", "album": "Lupe Fiasco’s Food & Liquor (Advance/Pre-Release Leak)", "year": "2006-04-18", "lyrics": "[Produced By: Soundtrakk]\n\n[Intro]\nUgh! (Woo!)\nWhat up, y'all? Yeah\n(Soundtrakk, what's poppin', baby?)\nWoo! (Ugh)\nIf y'all ain't know\nI go by the name of Lupe Fiasco\n(Kick, push, coast)\nRepresenting that First and Fifteenth, yeah, uh\nAnd this one right here\nI dedicate this one right here (Uproxx...)\nTo all my homies out there grinding\nYou know what I'm saying? Legally and illegally, haha\nYou know what I'm talking about? (Woo!)\nSo, check it out, uh\n\n[Verse 1]\nFirst got it when he was six, didn't know any tricks\nMatter of fact, first time he got on it, he slipped\nLanded on his hip and busted his lip\nFor a week he had to talk with a lisp, like thisss... (Ugh)\nNow we can end the story right here\nBut shorty didn't quit, it was something in the air (Ugh)\nYeah, he said it was something so appealing\nHe couldn't fight the feeling, something about it\nHe knew he couldn't doubt it, couldn't understand it\nBranded, since the first kickflip he landed, ugh (Woo)\nLabeled a misfit, a bandit\nKa-kunk, ka-kunk, ka-kunk; his neighbors couldn't stand it\nSo, he was banished to the park\nStarted in the morning, wouldn't stop 'til after dark, yeah\nWhen they said \"It's getting late in here\nSo I'm sorry, young man, there's no skating here\"\n\n[Hook]\nAnd so he kick, push, kick, push\nKick, push, kick, push; coast...\nAnd away he rolled\nJust a rebel to the world with no place to go\nAnd so he kick, push, kick, push\nKick, push, kick, push; coast...\nSo come and skate with me\nJust a rebel looking for a place to be\n\n[Bridge]\nSo let's kick... (Ugh)\nAnd push (Y-yeah, y-yeah-yeah)\nAnd coast\nUh, uh, uh (Y-yeah, y-yeah-yeah)\n\n[Verse 2]\nMy man got a little older, became a better roller\nYeah, no helmet, hell bent on killing himself\nIs what his mama said, but he was feeling himself\nGot a little more swagger in his style\nMet his girlfriend, she was clapping in the crowd\nLove is what-what was happening to him now, ugh!\nHe said \"I would marry you\nBut I'm engaged to these aerials and varials\nAnd I don't think this board is strong enough to carry two\"\nShe said \"Bow!\nI weigh a hundred and twenty pounds\" (Woo!)\n\"Now, let me make one thing clear\nI don't need to ride yours, I got mine right here\"\nSo she took him to a spot he didn't know about\nSome odd-end apartment parking lot\nShe said \"I don't normally take dates in here\"\nSecurity came and said \"I'm sorry, there's no skating here\"\n\n[Hook]\nAnd so they kick, push, kick, push\nKick, push, kick, push; coast...\nAnd away they roll\nJust lovers intertwined with no place to go\nAnd so they kick, push, kick, push\nKick, push, kick, push; coast...\nSo come and skate with me\nJust a rebel looking for a place to be\n\n[Bridge]\nSo let's kick (Ugh, ugh)\nAnd push, yeah, yeah (Woo, woo)\nAnd coast... (Yeah, ugh!)\n(Haha, swanky)\nYeah, yeah!\n\n[Verse 3]\nBefore he knew, he had a crew that wasn't no punk\nIn they Spitfire shirts and SB dunks\nThey would push 'til they couldn't skate no more\nOffice building lobbies wasn't safe no more\nAnd it wasn't like they wasn't getting chased no more\nJust the freedom was better than breathing, they said (They said...)\nAn escape route they used to escape out\nWhen things got crazy, they needed to break out\nThey'd head... to any place with stairs\nAny good grinds, the world was theirs, ugh!\nAnd their four wheels would take them there\nUntil the cops came and said, \"There's no skating here\"\n\n[Hook]\nAnd so they kick, push, kick, push\nKick, push, kick, push; coast...\nAnd away they rolled\nJust rebels without a cause with no place to go\nAnd so they kick, push, kick, push\nKick, push, kick, push; coast...\nSo come roll with me\nJust a rebel looking for a place to be\n\n[Bridge]\nSo let's kick (Ugh, ugh)\nAnd push, yeah, yeah (Woo, woo)\nAnd coast...\nAh-ha, swanky (Mm, mm)", "image": "https://images.rapgenius.com/7zstyoc9hz66oblcvudpzgh5.300x300x1.jpg"}], "artist": "Lupe Fiasco"}