{"songs": [{"title": "Shark Niggas (Biters) - Raekwon", "album": null, "year": null, "lyrics": "Niggas is fuckin crazy... knowhatI'msayin?\nHell yeah man\nWord... you know how niggas be bitin and shit\nNiggas be bitin mad styles n shit from niggas man\nYeah, no doubt\nThat's what I be hatin man, I can't stand a fuckin bitin ass nigga\nWanna use your lines all ahead of time\nWord\nBefore you even get a chance, to shine on your own shit\nTrue, nah niggas be killing me though Son because\nYaknow, they be take be comin with your words and shit\nThey hear you say one word then here they come with the word\nTryin to flip it and bounce it on some bullshit\nYeah, yeah\nNot sounding like first of all and shit\nYeah\nYaknowhatI'msayin? Boom, but then you got niggas Son on the real\nYaknowhatI'msayin? Niggas niggas niggas niggas is bitin off your\nAlbum cover and shit\nYeah!\nWhoa bad enough they biting lines like niggas killed me\nYeah\nWhen they came with some Nas, niggas bit offa Nas shit!\nKnowhatI'msayin?\n*chuckling*\nWord niggas niggas niggas niggas caught his little album cover move\nAnd then they got wise to that shit\nYeah\nI'm like damn what the fuck man?\nIt's like these happy-go-lucky niggas man when they get on man\nThey wanna pop a little, a little champagne\nWord like I said\nYouknowhatI'msayin? Every few, every time you see em\nYouknowhatI'msayin? Like, front on don't fuck with me\nYeah man\nYou gonna play that role play it though\nYo man, it's like this man, niggas man\nNiggas know not to fuck around with this shit\nI don't give a fuck how nasty they are\nNah son, let me tell these niggas somethin God\nI don't want niggas soundin like me... on no album!\nYouknowhatI'msayin? For real cause I'ma approach a nigga man\nFor real man, I don't want nobody sounding like me man, for real Son\nNo doubt\nBad enough nigga, I don't want nobody sound like nobody from my Clan\nMan keep it real, get your own shit man, and be original\nWord up\nThat's all man\nAnd you'll be a better man\nAnd you gonna come out on your own\nWord up\nWhatever how you gonna take it man, fuck it\nWord up", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}