{"songs": [{"title": "Can’t Wait", "album": "Dare Iz a Darkside", "year": "1994-11-22", "lyrics": "[Radio Intro: Dave Rockin' Reel & Roz Noble]\nPossibly a lot of rain this afternoon, with thunderstorms, highs in the mid-80s and lows about 75 degrees\nIt's 11:30 AM on WFDS—We're From the Darkside Radio\nThis is Dave Rockin' Reel, as we take a caller\nCaller, you're on the air\nYeah yeah yeah, and this Roz from Newark and I wanna hear that tune \"Can't Wait\" by Redman—that tune the bomb, yo!\nYou got it, coming from The Darkside Radio, this is \"Can't Wait\"\n\n[Intro: Redman]\nWhooooooo! Yo yo yo, comin' to you live\nSmokin' mad Phillies with my niggas from the Hoodaville section\nAnd all my niggas from the Weequahic section, word is bond\nSomebody said Jamaica Queens in this motherfucker\nI don't give a fuck! We gon' set it off like this\nJersey in the fuckin hid-ouse, for your mid-outh\n\n[Verse 1: Redman]\nI'm like rah rah, like I had cerebral palsy\nMy flows be's wet like all you girls' drawers be\nCrack the Phills, spread the buddha then the hiddash\nRoll it up and then ask, \"Who chipped in for the ten bag?\"\nEt cetera, I roll my blunts with two textures\nPick up fifty bags and then I smoke all the extras\nIt's the truth, like vodk' one-eighty proof\nDon't drop your drawers, I'll fuck through your daisy dukes (True!)\nPut your fingers up in the air if you're high (High)\nI walk by (by) so eff a drive (by)\nI swing up in it, batting average is half as\nGood as Reggie Jackson's, that's why you talk backwards\nAnd, uh, chumps be on some Bogart shit like Humphrey\nYou couldn't beat me if you ran with 21 Jump Street\nOr 90210, fuck it, yo\nIn the movies I'm the nigga puffin' buddha in the back row\n\n[Sampled Chorus: Mary Jane Girls & (Big Daddy Kane)]\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\n\n[Verse 2: Redman]\nI'm just a smoky boy, I'm from the Land of the Lost\nYou can't see me, like Charlie Angels' boss, I'm often\nCoolin 'round the blid-docks, I rock 'round the clid-dock\nMy glid-dock cocked, from here to 16th and Lenox\nAsk Roger Thomas if I'm gettin scopic\nI was milk like two tits, now I'm butter like Blue Bonnet\nNow who got the funk? (We got the funk!)\nAy ay, ayo well I got the weed! (We got the blunts!)\nI never sniffed, I used to puff woolas in a jam\nBack in '88, when it was twenties to the gram\nBrizzail, you couldn't feel me in Braille, hell\nI write my names on walls in smoke spots when I'm buyin' L\nThe fly guy with the Force like Luke Sky'\nDown for a menage e' trois bitch if you're fly\nThe Funkadelic, been rockin' mics since the fourth grade\nI Terminate like X and I Terminate like Schwarzeneg'\nDum-de-dum, rock like Buju Banton\nSoup like wonton, funk by the tons, \"D-Rums, Please!\"\nMy whole crew's making cheese\nTonight's the night, baby, so suck up on these, and it's on\n\n[Sampled Chorus: Mary Jane Girls & (Big Daddy Kane)]\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\nI can't wait to get it on\n(Check it out, y'all)\nI can't wait to get it on\n(You don't stop, keep on)\n\n[Verse 3: Redman]\nI said I, catch the A-train, to the left\nSmoke the choc', I set shit off like Boba Fett\nBig up to all my niggas in the housing projects\nI'm runnin' up in ya, continue to split your guts\nGrab the rail, if you get scared of my lines when I rock well\nGot Whit's like Pernell, shit's \"The Bomb\" like Akinyel'\nRickety rocket, mind deep as the Loch Ness\nWaste niggas like toxic, wet like galoshes\nCan I handle my biz? (Yes, you can!)\nI cause chaos, and bring a lot of Def to Jams\nYes I can, now act stupid I'll pop the trunk, cla-clunk\nNow give me a ba-bump, ba-bump\nOh cool, smooth like two \"Blue Suede Shoes\"\nY'all faggots slept on my Huffman and Koos\nWord to Dan, Tan, Pillow, and Cool B\nSwitchin' speeds like Bruce Lee ridin' a Fuji in a movie\nI drop it on the one—fuck the two, three\nFunky like a box of coochies on loose leaf\n\n[Outro: Redman]\nYo yo, I said, \"Switchin' up speeds like Bruce Lee ridin' a Fuji in a movie.\"\nHeh, I be sayin' some shit!\nNow, if you didn't get it—\nLaugh now—and then figure the shit out when you get home!\nHahahaha!", "image": "https://images.genius.com/24ee760416ab5b50e5f030d3cfce67f2.600x600x1.jpg"}], "artist": "Redman"}