{"songs": [{"title": "Aw, Here It Goes (Mashup)", "album": null, "year": "2012-06-21", "lyrics": "[Verse 1: Coolio]\nEverybody out there go run and tell\nYour homeboys and home girls it's time for Kenan and Kel\nThey keep you laughing in the afternoon\nSo, don't touch that dial or leave the room\n'Coz they're always into something\nIt's fun and you don't wanna miss it\nIt's double K, like 2 the good radius\nKenan and Kel or should I say Kel and Kenan\nBut you gotta watch Kenan 'coz\nKenan be scheming\nWith a plan or a plot\nTo make it to the top\nBut they kinda in the middle\n'Coz they're always gettin' caught\nThis ain't the Hardy Boys or a Nancy Drew mystery\nIt's just Kenan and Kel in your vicinity\nLike Seigfried and Roy, Abbott and Costello\nMagic and Kareem, or Penn and Teller\nSomebody's in trouble\nAww here goes\nOn Nick, Ni, Nick, Nick, Ni, Nick, Nick, Nick\n\n[Verse 2: Snoop Dogg]\nTop Dogg, bite 'em all, yeah, I'm burnin' it up\nD-P-G-C, you should be turnin' it up\nC-P-T, L-B-C, yeah, we hookin' back up\nAnd when they bang this in the club, baby, you got to get up\nCuss homies, thug homies, yeah, they givin' it up\nLowlife, yo' life, boy we livin' it up\nTakin' chances while we dancin' in the party fo' sho'\nSlip my girl a 44 and she crip in the back do'\nChick is lookin' at me strange, but you know I don't care\nStep up in this motha, just a-swangin' my hair\nTrick quit talkin', crip-walk if you down with the set\nTake a bullet with some grip and take this smoke on this jet\nOut o' town, put it down for the Father of Rap\nAnd if you happen to get cracked, trick shut your trap\nCome back, get back, that's the part of success\nIf you believe in the S, you'll be relievin' your stress\n\n[Verse 3: Sugarhill Gang (Wonder Mike & Big Bank Hank)]\n[Hook: Wonder Mike]\nI said a hip hop the hippie the hippie\nTo the hip hip hop and you don't stop\nThe rock it to the bang bang boogie\nSay up jump the boogie to the rhythm of the boogie, the beat\nNow, what you hear is not a test, I'm rapping to the beat\nAnd me, the groove, and my friends are gonna try to move your feet\nSee I am Wonder Mike and I'd like to say \"hello\"\nTo the black, to the white, the red and the brown, the purple and yellow\nBut first, I gotta bang bang the boogie to the boogie\nSay up jump the boogie to the bang bang boogie\nLet's rock, you don't stop\nRock the rhythm that'll make your body rock\nWell so far you've heard my voice, but I brought two friends along\nAnd next on the mic is my man Hank; come on, Hank, sing that song\nCheck it out, I'm the C-A-S-AN, the O-V-A and the rest is F-L-Y\nYou see, I go by the code of the doctor of the mix and these reasons I'll tell you why\nYou see I'm six foot one and I'm tons of fun and I dress to a tee\nYou see I got more clothes than Muhammad Ali and I dress so viciously\nI got bodyguards, I got two big cars, that definitely ain't the whack\nI got a Lincoln continental and a sunroof Cadillac\nSo after school, I take a dip in the pool, which is really on the wall\nI got a color TV so I can see the Knicks play basketball\n\n[Verse 4: 2Pac]\nI see no changes, wake up in the morning and I ask myself\nIs life worth livin'? Should I blast myself?\nI'm tired of bein' poor and, even worse, I'm black\nMy stomach hurts so I'm lookin' for a purse to snatch\nCops give a damn about a negro\nPull the trigger, kill a nigga, he's a hero\n\"Give the crack to the kids, who the hell cares?\nOne less hungry mouth on the welfare!\"\n\n[Verse 5: Xzibit]\nGettin' my label off the ground like David Blaine\nSo now, what you know bout me?\nI'm a self-made man from poverty\nYeah, now I own a lot of property\nI pimp rides, lifestyles an' companies, so, yo\nNow let me spit you the facts\nI used to hustle the corner but I ain't bringin' you that\nNaw, I'm like swingin' a bat\nRun at yo' kneecaps for comin' out ya face like that\nBaby girl, touchin' my chain\nNow let me tell you who I ain't\nYou can't run no games\nI'm gangsta, baby, ain't nuttin' changed\nCan you feel the speakers jumpin'?\nOther guys surroundin' but they don't say nuthin'\nMuggin' in the club like they wanna do somethin'\nFeelin' kinda rowdy, huh? Hey, now, hey, now\nAll the girls mean muggin'\n'Cause it musta seem what the girl pulled up in\nIn the club like they wanna do somethin'\nFeelin' kinda rowdy, huh? Hey, now, hey, now\nCan you feel the speakers jumpin'?\nFeelin' kinda rowdy, huh? Hey, now, hey, now\nAll the girls mean muggin'\nFeelin' kinda rowdy, huh? Hey, now, hey, now\nCan you feel the speakers jumpin'?\nOther guys surroundin' but they don't say nuthin'\nMuggin' in the club like they wanna do somethin'\nFeelin' kinda rowdy, huh? Hey, now, hey, now\nAll the girls mean muggin'\n'Cause it musta seem what the girl pulled up in\nIn the club like they wanna do somethin'\nFeelin' kinda rowdy, huh? Hey, now, hey, now\nLet's ride on out, let's ride on out\nX to the Z, Timbo, [Incomprehensible]\nWest Coast, East Coast, Philly\n\n[Verse: 6]\nEverybody out there go run and tell\nYour homeboys and home girls it's time for Kenan and Kel\nThey keep you laughing in the afternoon\nSo, don't touch that dial or leave the room\n'Coz they're always into something\nIt's fun and you don't wanna miss it\nIt's double K, like 2 the good radius\nKenan and Kel or should I say Kel and Kenan\nBut you gotta watch Kenan 'coz\nKenan be scheming\nWith a plan or a plot\nTo make it to the top\nBut they kinda in the middle\n'Coz they're always gettin' caught\nThis ain't the Hardy Boys or a Nancy Drew mystery\nIt's just Kenan and Kel in your vicinity\nLike Seigfried and Roy, Abbott and Costello\nMagic and Kareem, or Penn and Teller\nSomebody's in trouble\nAww here goes\nOn Nick, Ni, Nick, Nick, Ni, Nick, Nick, Nick", "image": "https://i.genius.com/fb75f230bc39bad30a2c222cb4d08f2269111f2f?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DqNoG7t3xPmE"}], "artist": "Coolio"}