{"songs": [{"title": "Auditorium", "album": "The Ecstatic", "year": "2009-06-09", "lyrics": "[Intro: Mos Def]\nPeace\nPeace, peace, peace, peace, peace, peace\nPower\nUh\nMadlib-erator\nDef operator\nRock the data\nAmazin' flavor\n\n[Verse 1: Mos Def]\nThe way I feel, sometimes it's too hard to sit still\nThings are so passionate, times are so real\nSometimes I try and chill, mellow down, blowin' smoke\nSmile on my face but it's really no joke\nYou feel it in the street, the people breathe without hope\nThey goin' through the motion, they dimmin' down the focus\nThe focus get cleared then the light turn sharp\nAnd the eyes go teary, the mind grow weary\nI speak it so clearly sometimes y'all don't hear me\nI push it past the bass, know nations gotta feel me\nI feel it in my bones, black I'm so wide awake\nThat I hardly ever sleep, my flow forever deep\nAnd it's volumes or scriptures when I breathe on a beat\nMy presence speak volumes before I say a word\nI'm everywhere: penthouse, pavement and curb\nCradle to the grave, tall cathedral or a cell\nUniversal ghetto life, holla black you know it well\nQuiet storm, vital form, pen pushed it right across\nMind is a vital force, high level right across\nSoul is the lion's roar, voice is the siren\nI swing round, ring out, and bring down the tyrant\nShocked a small act could knock a giant lopsided\nThe world is so dangerous, there's no need for fightin'\nSuckas trying to hide like the struggle won't find 'em\nThen the sun bust through the clouds to clearly remind him\nEverywhere penthouse pavement and curb\nCradle to the grave, tall cathedral or a cell\nUniversal ghetto life, holla black you know it well\n\n[Hook]\nWhat it is, you know, they know\nWhat it is, we know, y'all know\nWhat it is, Ecstatic, here it is\nWhat it is, you know, we know\nWhat it is, they know, y'all know\nWhat it is, you don't know? Here it is\n\n[Interlude: Mos Def]\nEcstatic! (En punto)\nPeace, power\nFantastic\nSo original\nAnd always on time and rockin ya mind (Ruler!)\n\n[Verse 2: Slick Rick]\nSit and come relax, riddle of the mac\nIt's the patch, I'm a soldier in the middle of Iraq\nWell, say, about noonish, comin' out the whip\nAnd lookin at me curious, a young Iraqi kid\nCarrying laundry, \"What's wrong G? Hungry?\"\n\"No, gimme my oil or get [fuck] out my country\"\nAnd in Arabian barkin' other stuff (\"Jihad!\")\n'Til his moms come grab him and they walk off in a rush\nDistrust, feeling like I've pissed upon wound\nI'm like, \"Surely hope that we can fix our differences soon!\" (Bye!)\nBuying apples I'm breakin' on, \"You take everything\nWhy not just take the damn food, black bastard?\"\nLike I don't understand it, on another planet\n15-months of this stuff, how I'm gonna manage?\nAnd increasing the sentiment, gentlemen\nGetting down on their middle eastern instruments\nRealized trapped in this crap\nWalk over kicked one of my fabulous raps (\"La-Di-Da-Di\")\nArab jaw drop, they well wish, they glad rap\nNow the kid considered like an Elvis of Baghdad\n\n[Sample]\nOmar: Men have two faces: one that laughs and one that cries\nAli: They sent you?\nOmar: Yeah, so? Here\n\n[Hook]\nWhat it is, you know, they know\nWhat it is, we know, y'all know\nWhat it is, Ecstatic, there it is\nWhat it is, you know, we know\nWhat it is, they know, y'all know\nWhat it is, you don't know? Here it is\nWhat it is, you know, we know\nWhat it is, they know, y'all know\nWhat it is, you know, here it is", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}], "artist": "Yasiin Bey"}