{"songs": [{"title": "The Way I Be Pimpin’ (Xxplosive Part 2)", "album": "Build and Destroy", "year": null, "lyrics": "* hidden bonus track; written by Royce for Dr. Dre\n\n[Hook: Royce Da 5'9\"]\nI might make it look easy, that's just the way I be pimpin'\nMakin my money, that's just the way I be pimpin'\nThey wouldn't leave me, that's just the way I be pimpin'\nYou might not believe me, that's just the way I be pimpin'\n\n[Verse 1: Dr. Dre]\nI'm livin a motion picture, me and my niggas\nIn sixteen bars we'll make the big screen ours\nWhat is this? Everybody's jiggy now, is the hustle that good\nIn everybody's city now, or do they act good?\nI pimp on the street, I pimp in my sleep\nAnd when I snore it sounds like I'm sayin, \"Where's my money?\"\nI ain't playin, I'm out there like, \"Where's my honeys?\"\nYou gotta be a pimp to understand just how I'm layin\nFuck a Lex Bubble; I'm rich, and after this\nI'mma be rich all over again, except double\nSee you ain't so hard; if you ain't burnin rubber\nIn somethin with numbers after the dot, you ain't no star\nMe and my whole crew, done either shot a nigga or been shot\nAnd if you check us out, ain't no scars\nHint - steppin to me is suicide\nAnd that basically means that you could die, true superfly\n\n[Hook]\n\n[Verse 2: Dr. Dre]\nMy life's in the fast lane, that's when I knew I had game\nClass came, I had hoes but didn't know they last name\nIn school, when you niggas was tradin clothes\nMe and my niggas was tradin hoes like what they fadin fo'\nCarry my books you ho, I had 'em slavin yo\nI get skulled then I played the ho like, \"Way to go\"\nPatrollin the halls holdin a black mac-11\nUnder the black leather, platforms, a hat with a feather\nI was so naughty, drivin a gold Audi\nAll we did was throw parties and show up, with Gold Gotti\nHandsome, and some, I'm the one you ran from\nCause you could only be the man in the shit that I was banned from\nMake this shit seem easy, fiends need me\nMake the most conceited chick in this bitch seem sleazy\nPleased at what I'm doin\nAnd to all y'all pimp niggas, pimp on, and I'll see y'all at the reunion\n\n[Hook]", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}