{"songs": [{"title": "Classic", "album": "Dreams Worth More Than Money", "year": "2015-06-29", "lyrics": "[Produced by Bangladesh]\n\n[Intro: Swizz Beatz]\nWoo! It’s hot outside man\nMeek Millys coming daddy\n\n[Verse 1: Meek Mill]\nHundred for the walkthrough, I'm not who you talk to\nDrive by and wet you up, nigga thats a carpool\nSpitting all this hot shit, every single bar cool\nDiamonds in the rollie face, animated cartoon\nCall me Meek Milly, I don't play that shit\nGot me on my nappy braids before the Maybach clique\nRiding in the wheels of fortune, Pat Sajak shit\nAnd all I rock is Balmain like I made that shit\nI’ve been, front row fashion week looking like I'm in the show\nSitting in the foreign, leather softer than a dinner roll\nMake a movie on your bitch, tell her friend to get a role\nYou thought she was innocent, we laughing like she been a ho\nJumpin' out them Benzos, meet yo bitch in the friend zone\nShe told you I was friendzoned, what? I'm in the endzone\nTouchdown with a 2 point conversion, give her that dick long\nShe busting like the clip long, Uber to send your bitch home nigga\n\n[Interlude: Swizz Beatz]\nIt's hot outside, it's Meek Milly season\n\n[Chorus: Swizz Beatz]\nI got a fever bitch\nHot outside, I got a fever bitch\nFeeling sick, I got a fever bitch\nIn these Philly streets situations is\nPolice ain’t respecting the youth and\nThe youth ain't respecting the truth and\nThe Glock 9 is on me in the booth and\nAll I talk is that real shit the truth and\n\n[Verse 2: Meek Mill]\nThe money turned your bitch into a gold digger\nThe money got me feeling like the old Jigga\nAnd Jigga even told me you a cold nigga\nThey ain’t believe me I was broke but I showed niggas\nAnd I told niggas that I would expose niggas\nWent to buy a pair of sneaks, landed at the Royce dealer\nBrand new paper tag, haters never made me mad\nYou can ask your baby momma, I’m flyer than her baby dad\nLooking at my neck, what that cost? Hundred-eighty cash\nLooking at my bitch, she remind me of a Stacey Dash\nWe was selling rock before Kareem Biggs, Damon Dash\nOh you think you fly with your lil' Dream Chasin’ ass?\nWe don’t chase bitches, we chase money and that D'ussé\nCause when you get money, the hoes do whatever you say\nRiding in a drop head, Phantom with the toupee\nAnd if you’re just hearing this, then it’s probably too late\n\n[Chorus: Swizz Beatz]\nI got a fever bitch\nHot outside, I got a fever bitch\nFeeling sick, I got a fever bitch\nIn these Philly streets situations is\nPolice ain’t respecting the youth and\nThe youth ain't respecting the truth and\nThe Glock 9 on me in the booth and\nAll I talk is that real shit the truth and\n\n[Outro: Swizz Beatz]\nMeek Milly, Mack Milly\nGet smacked silly, come to Philly\nCome see it live in direct\nYou know, God dammit!", "image": "https://images.genius.com/1a5cda77113ea2b18bfbec0f3ffbaf69.1000x1000x1.jpg"}], "artist": "Meek Mill"}