{"songs": [{"title": "Ms. Fat Booty - (best of decade I version)", "album": null, "year": null, "lyrics": "I know I can't afford to stop\nFor one moment, that it's too soon to forget\n\nMan, duke I was in love with this girl, duke\nI was tore up dog, I'm telling you man\nShit is wild man, for real\nIt's, she's from, let me tell you about her\n\nIn she came with the same type game\nThe type of girl giving out the fake cell phone and name\nBig fame, she like cats with big things\nJewels chipped, money clip, phone flip, the six range\nI seen her on the Ave, spotted her more than once\nAss so fat that you could see it from the front\nShe spot me like paparazzi, shot me a glance\nIn that catwoman stance with the fat booty pants, hot damn!\nWhat's your name love, where you came from?\nNeck and wrist laced up, very little make-up\nThe swims at the Reebok gym tone your frame up\nIs sugar and spice the only thing that you made of?\nI tried to play it low key, but couldn't keep it down\nAsked her to dance and she was like, \"Yo, I'm leaving now\"\nAn hour later, sounds from Jamaica\nShe sipping Cris straight up, shaking, winding her waist up\nScene 2: my fam throwing the jam\nFareed is on the stand, big things is in the plans\nThe brother Big Mu makes space for me to move\n\"Ayo, this my man Mos, baby, let me introduce\"\nI turned around (Say word!) it was the same pretty bird\nWho I had priorly observed trying to play me for the herb\nShocked as hell she couldn't get it together\nI just played along and pretended I never met her\nHow you feeling? \"Oh, I'm fine\" My name is Mos \"I'm Sharice\"\nI heard so much good about you, it's nice to finally meet\nWe moved to the booth reserved for crew especially\nAnd honey love ended up sitting directly next to me\nI'm type polite but now I'm looking at her skeptically\nCause baby girl got all the right weaponry\nDesigner fabric, shoes and accessories\nChinky eyes, sweet voice is fucking with me mentally\nWe conversated, made her laugh, yeah, you know me bro\nEven though I know the steelo, she wild sweet, yo\nI'm 'bout to murk, I say peace to the family\nShe hop up like, \"How you gon' leave before you dance with me?\"\n\nShe blew my whole head with that duke, I was like, word?\nI played it low though, I was like, yeah, aight, come on then, let's go\nNiggas was mad, niggas was so sick, I tell ya\nYo, honey was so blazing she was just\nYo, she looked like Jayne Kennedy, word bond, to my mother man\nShe was that ill man, she take me to the dance floor\nAnd she start whispering to me and shit\n\n\"Yo, let me apologize for the other night\nI know it wasn't right, but baby you know what it's like\nSome brothers don't be coming right, I understand, I'm feeling you\nBesides, can I have a dance ain't really that original\"\nWe laughed about it, traced her arms across my shoulder blades\nThey playing Lovers Rock, I got the folded fingers on her waist\nHeating my blood up like the Arizona summer\nSong finished then she whispered, \"Honey, let's exchange numbers\"\nScene 3: weeks of dating late night conversation\nIn the crib heart racing, trying to be cool and patient\nShe touched on my eyelids, the room fell silent\nShe walked away smiling, singing Gregory Isaacs\nLike, \"If I don't, if I don't have you\"\nShowing me her tan line and her tattoo\nPlaying Sade, Sweetest Taboo\nBurning candles, all my other plans got cancelled\nMan I smashed it like a Idaho potato\nShe call me at my J.O., come now, I can't say no\nGinseng tree trunks, rocking the P-funk\nCocking her knees up, champion lover not ease up\nThree months, she call I feel I'm running a fever\nSix months, I'm telling her I desperately need her\nNine months, flu-like symptoms when shorty not around\nI need more than to knock it down, I'm really trying to lock it down\nMidnight we hook up and go at it\nBurn a stoge and let her know, sweetheart I got to have it\nShe telling me commitment is something she can't manage\nWake up the next morning, she gone like it was magic\nAhh, damn it, my shit is on Harrison Ford frantic\nMy 911's unanswered by my fly Taurus enchantress\nNext week, Mu hit me up, I saw Sharice at the Kittie club\nWith some banging ass Asian playing lay it down and lick me up\nWhat!?", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}