{"songs": [{"title": "IV. Sweatpants", "album": "Because the Internet", "year": "2013-06-09", "lyrics": "[Verse 1: Childish Gambino & Problem]\nWatching haters wonder why Gambino got the game locked (Yeah?)\nHalf-Thai thickie, all she wanna do is Bangkok (Yeah?)\nGot her hair done, French braids, now she A$AP\nBino so insensitive, she askin' “Why you say that?!”\nI'm chillin' (Yeah), real nigga feelin'\nRich kid, asshole paint me as a villain (Ma!)\nStill spitting that cash flow, DJ Khaled\nI got a penthouse on both coasts, pH balance\nReal nigga, I rep those\nWhy though? 'Cause I said so\nHip deep in that Pepto, I got five on her like Ben Folds\nI got more tail than that PetCo (What)\nYou faker than some Sweet'N Low (Why?)\nYeah, you got some silverware\nBut really are you eating though? (Yeah)\nAre you eating though? Nigga, are you eating though?\nBreakfast, lunch, and dinner's for beginners, you ain't even know\nNever catching cases, why they faces look so E-M-O?\nWatch a hater hate me, wanna play me like a piano\nMy architect know Japanese (Yeah?)\nYour girl, she jockin' these (Yeah?)\nNo hands like soccer teams and y'all fuck boys like Socrates\nYou niggas ain't coppin' these, niggas ain't lookin' like me (Nah)\nNah, I ain't checkin' I.D. (Nah), but I bounce 'em with no problem\nTell 'em, Problem (Problem!)\n\n[Bridge: Childish Gambino & Problem]\nI'm winnin', yeah, yeah, I'm winnin' (What?)\nI'm winnin', yeah, yeah, I'm winnin' (What?)\nI'm winnin', yeah, yeah, I'm winnin' (What?)\nRich kid, asshole, paint me as a villain\n\n[Hook: Problem]\nWhat?!\nDon't be mad cause I'm doing me better than you doing you\nDon't be mad cause I'm doing me better than you doing you\nDon't be mad cause I'm doing me better than you doing you\nBetter than you doing you, fuck it, what you gon' do? (What?!)\n\n[Verse 2: Childish Gambino]\nDifferent color, my passport\nInstagram my stack load\nHashtag my day wear, and your girl drank my day care\nAnd I'm born rich, life ain't fair – It's silver spoon coon, ho\nAin't nobody sicker in my Fisker, “vroom-vroom,” ho\nAin't nobody—\n(Fiskers don't make noise when they start up, just so you know)\nTop of the holy totem\nR-r-r-rich forever, a million was not the quota\nMy father owned half the MoMA and did it with no diploma\nYear off, got no rules, trippin' off of them toadstools\nMore green than my Whole Foods\nAnd I'm too fly, Jeff Goldblum\nGot a glass house in the Palisades, that A-K-A\nWhite hood, white hood, O-KKK\nFurniture custom, you shop at IKEA\nShow Maserati, you whippin' a Kia\nSpendin' this money, it's longer than Nia\nLive like a Coppola, me and Sofia\nWakin' up broke, man, wouldn't wanna be ya\nFriends with the dopeman, help a nigga re-up\nBring a girlfriend, man, trouble when I see her\n“Err-eh-err-eh”, onomatopoeia\nOhh, I got my cool on! (Tailor-made!)\nI'm winnin' so they had to dump the Gatorade (Gatorade)\nAnd I don't give a fuck about my family name!\n\n[Hook: Problem]\nWhat?\nDon't be mad cause I'm doing me better than you doing you\nDon't be mad cause I'm doing me better than you doing you\nDon't be mad cause I'm doing me better than you doing you\nBetter than you doing you, fuck it, what you gon' do? (What?!)", "image": "https://images.genius.com/b8c1f5981bc77ffd06580a1f2e693cf3.300x300x1.jpg"}], "artist": "Childish Gambino"}