{"songs": [{"title": "Don’t Play", "album": "Days Before Rodeo", "year": "2014-05-06", "lyrics": "[Intro: Matty Healy]\nDrink slow to feed the nose, you know he likes to get blown\nHas he got enough money to spend?\nLeave? No! He's to and fro, he doesn't like it when the girls go\nHas he got enough money to spend?\n\n[Chorus: Travis Scott]\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playin' with these niggas\nStraight up\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playing with these niggas\nI ain't playin' with these niggas (Oh no)\nI ain't playin' with, I ain't playin' with these niggas\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playin' with these niggas\n\n[Verse 1: Travis Scott]\nKnow I need my dollars\nKnow a nigga need my commas (Straight up)\nShe was down when I dropped out of college\nDown, she was down when I rode Impalas\nPlayed with her pussy in the Jeep\nYeah, she was down with the foreplay drivin' (Oh no)\nJumped in the car when she hit my digits\nDon't want nothin', just to pull up at the projects\nEasy to me my nigga\nVilla with a scene, youngin' always seen with a killer\nHand-stitched by my dealer\nDealing with a seam you ain't seen, what you mean Margiela?\nShe even got the 'scripts for the cough\nIn the H gotta hit Johnny for the frost, swerved off\nAin't it been a minute since they seen a weird nigga\nFrom the corner put it on for the south? (Straight up)\nOn my momma, know a nigga be coasting\nGo, nigga, go nigga grab my bottles\nGo, nigga, go nigga grab my chronic (Let go)\nKeep ya head up in the air my nigga\nNiggas gon' be billionaires my nigga (Straight up)\nFuck how much time that shit might take\nNiggas ain't playin' with 'em!\n(Playin' with 'em, playin' with 'em, playin' with 'em!)\n\n[Chorus: Travis Scott & Big Sean]\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playin' with these niggas (Straight up!)\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playing with these niggas\nFor sure (Oh no)\nI ain't playin' with these niggas\nLa Flame, you know I got you nigga you my brother\nI ain't playin' with, I ain't playin' with these niggas\nOn god!\nI ain't playin' with these niggas\nB.I.G Sean Don, my aura gold, you know it\nI ain't playin' with, I ain't playin' with these niggas\n\n[Verse 2: Big Sean]\nBitch don't you play me, don't you try me\nI need the exact amount\nLook at my face, ho, eye-to-eye me\nI'm a boss, make sure you and your homies dress up, tight attire\nWhen you see me, ho, or I'll take that white tee and tie-dye dye it\nI mean, goddamn, nigga!\nYou forgot where I came from? I'm from where you ain't from\nWhere you can't come, where it ain't none\nWhere these bitches is bitches and they ain't nuns\nWhere they hate from\nBut as soon as you blow they act like they been down since day one\nWhere there's fuckin' tank guns\nBut niggas never join the army, like it ain't one\nIf I ain't got it then I'm huntin'\nI'm either countin' or I'm cummin'\nSwear I just done bought that mansion\nTreat that shit like it's a dungeon\nUp at 5 AM still workin', but I treat it like it's 1\nI'm never actin' like I got it\nBitch, I'm actin' like I won it on these niggas!\n\n[Chorus: Travis Scott]\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playin' with these niggas (Straight up)\nI ain't playin' with these niggas (That Detroit nigga)\nI ain't playin' with, I ain't playing with these niggas (Oh no)\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playin' with these niggas\nI ain't playin' with these niggas (Straight up)\nI ain't playin' with, I ain't playin' with these niggas\nDetroit\n\n[Outro]\nI ain't playin' with these niggas\nI ain't playin' with these niggas\nI ain't playin' with, I ain't playin' with these niggas", "image": "https://images.rapgenius.com/5029915f34f605b051e8e9d93dfd3888.500x500x1.jpg"}], "artist": "Travis Scott"}