{"songs": [{"title": "My Homie", "album": "Habits & Contradictions", "year": "2012-01-14", "lyrics": "[Intro]\nMmm, mmm, yo yo\nYo yo, yo yo yo yo, uh-uh\nWait my whole life, to do this motherfucker up\nYo yo yo yo, weed and Courvoisier and shit\nYo yo, yo, uh-huh\nNigga been waiting to get a Alchemist beat\nSince I bought \"1st Infantry\" and shit, hehehe\nYo yo yo yo\n\n[Chorus]\nWhat's a real nigga addiction? Money, weed and bitches\nHanging with snitches, shit, it wasn't my intention\n\n[Verse 1]\nI didn't know I knew him for years\nWho would think his gums were soft?\nTo all my niggas I would die for\nLoad my pistol up go out and war for\nSpend my last you keep your half we all poor\nNo way to go ill walk you through my front door\nMy ninjas do the same see when we was younger\nYou were my mane\nNigga I wouldn't figure you would be on that stand\nPutting my life up in you hands, pointing your finger like \"Damn!\"\nFor really though? We was just sling Oxy\nLike a year ago, you knew my sister tho\nAuntie, cousins and my uncle Joe\nCuz, you hit my 'dro, see my nigga you's a ho\nRemember those Cheerios? Ninja Turtles\nOn my grandma's floor, I'm like for sure (Donatello)\nCatch you on the rebound you bound to dr-izz-ound\nGrave lounge where you sit down\nWhat goes around comes ar-izz-ound\nThe sky is up and hell is low\nKeep your mouth shut, bet he won't tell no more\n\n[Chorus]\nWhat's a real nigga addiction? Money, weed and bitches\nHanging with snitches, shit, it wasn't my intention\nBitch-ass nigga (fuck yo' ass comin from?)\nFo' sho'\nWhat's a real nigga addiction? Money, weed and bitches\nHanging with snitches, shit, it wasn't my intention\nBitch-ass nigga (who the fuck you on the phone with?)\nAww shit\n\n[Verse 2]\nStarted around the bottom, ended up at the top\nHeard you was in some trouble, I unretired my Glock\nDid what I did who woulda knew you was the cops\nTalking all on the phone, to your homies about plots\nGot me up in the box\nThought that you was my nigga\nYa got your scentence reduced\nCause you told em that I pulled the trigger\nAnd I was looking out for you\nTried to show him just how we do\nPut all my shit aside now I'm through\nFigured that I would keep it crippy\nThis what this real nigga get me\nLocked up for like a century\nWhile you get chances of a Bentley\nFuck my old bitches while I beat my dick plenty\nMy shooting finger itchy\nBut I hope somebody get him, but probably not\nShit I ain't sweating it, cuz got me hot, better get his ass popped\nCan't get over how we was tough as leather\nMan, we did everything together, fucked our first bitches\nAnd earned our first cheddar, robbed the first nigga\nWas down for whatever and I'll blast 'til forever\nIf we had too, but it's all cool\n\n[Chorus]\nWhat's a real nigga addiction? Money, weed and bitches\nHanging with snitches, shit, it wasn't my intention\nBitch-ass nigga (fuck yo' ass comin from?)\nFo' sho'\nWhat's a real nigga addiction? Money, weed and bitches\nHanging with snitches, shit, it wasn't my intention\nBitch-ass nigga (who the fuck you on the phone with?)\nAwwwwww shit\n\n[Outro]\nStarted around the bottom\nStarted around the bottom, ended up at the top\nStarted around the bottom, ended up at the top\nDon't let these niggas know your plots\nWha-word, wha-word, word... Q!", "image": "https://images.genius.com/41740fc8a4f359c7d4a16721d87de950.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}