{"songs": [{"title": "Usual Suspects (Part 2)", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "* bonus track, continues on track #17 at 12:55\n\n[Mic Geronimo]\nYEAH! Yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nC'mon, c'mon hah hah, M.G\nKnow the G, hah hah, know the face\nHah hah, know the name nigga, hah\nC'mon, yeah, yeah\n\nNow who could do it like the M-I-C, y'all niggas ain't about this life\nRunnin up inside of the crib to cut your lights\nMy A.R. likes the thug life, drugs and gun fights\nWhite on whites, menage and dykes, and nice ice\nWhite wraps for these niggas who scrap and gun clap\nStick up kids, leavin y'all with two in the back\nOnce you bitch-made niggas started doin the rap\nSeven figure shit really started ruinin rap\nTake it back to hood shit bulletproof and biscuits\nChips all for hustle and grams go from bricks\nAnd whips for templates, we switch while we movin all of this weight\n'til we screamin all of us hate\n\n[Hook: Mic Geronimo]\nYou see shit's still real\nNothin ever change cause we still in the field\nNiggas try to front but the game's too real\nWe don't give a fuck bout the way you feel\nSo fuck what you feel and shit's still real\nNothin ever change cause we still in the field\nNiggas try to front but the game's too real\nWe don't give a fuck bout the way you feel\nSo fuck what you feel, yeah\n\n[Big Stan]\nY'all niggas better get the guns\nFuck the pep talk, I don't wanna hear it\nWhen it's on it's on, talkin I don't feel it\nThat's the fake shit, argue and just make shit hot\nAnd with my short fuse I'm always quick to make shit pop\nNigga respect this, catch me on the block and with gloves\nI'm ambidextrous, sold with the Glock and the snub\nBut I ain't reckless, with me it's always one big dot\nThen one big shot, and one kid drops\nHead shot, closed lid over one big box\nAnd a preacher left prayin over one big plot\nNever a mess, now I wanna conquer the world\nAnd I'mma do it, wanna know how? Fuckin with Earl\nHe's the one that took me in to raise the dog from a pup\nWith his guidance, help create a beast from a mutt\nJust released from the cut goin straight for the neck\nB.S., Bloodline, what the fuck you expect nigga?\n\n[Hook]\n\n[DMX - overlapping Hook]\nUhh, WHAT?! Uhh\nUhh, uhh, uhh\n\n[DMX]\nIt's time to take out the garbage, y'all niggas want the hard shit\nI got shit that'll start shit, rip apart shit and disregard shit\nThought it wasn't real no more, just because I got a deal\nWhat you think, I ain't gon' steal no more?\n\"Usual Suspects\" once again - thus begins\nThe bullshit we both went through form trusted friends\nBustin him from where? (It's time to peel)\nFuck what you heard baby! Shit's still real\nY'all niggas think your shit don't stink, cause it don't think\nHit a motherfuckin iceberg your ship won't sink\nBitch don't blink, cause I'mma hit you with somethin\nI'mma hit you for frontin, I'mma hit you for nuttin? You buggin\nI'm lovin it - the obstacles that I go through\nIt keeps me real, don't make me have to show you\nFuck you cause I don't know you, and listen dog\nIf I gots to blow you, you know where you goin to\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}