{"songs": [{"title": "I’m Talking to You", "album": "Year Of The Dragon", "year": "2012-08-21", "lyrics": "[Intro]\nLadies and gentlemen, are you ready?\nYea\nAre you ready to make some noise?\nPut your hands together\nI want everybody in here to stand up on your feet\nTurn my music up\nTo make some noise\nTo make some noise\nTo make some noise\nI want everybody in here to stand up on your feet\nAye, where’s Spliff at?\nThere’s about to be a problem now nigga\n\n[Verse 1]\nOnce I captured the soul of the street it’s so hard for me to let go\nRespect down at the techno, hear the stadium echo\nNow it’s reaching a vile when the weakness is silent\nPutting the fear of God in ‘em while I’m shifting the climate\nThe gladiator presence, everything about me giant\nThis the year of the dragon with a heart of a lion\nGot ‘em throwin’ their swag up, how I come to provide it\nNow we makin’ ‘em riot till we makin’ ‘em try it\nYou can never deny it, how I came to prescribe it\nThen bangin’ with the ship like Earth and Jupiter collided\nThen I came, I’m remindin’ em, of how the spark ignited ‘em\nAnd conquered continents the size of Asia times five of ‘em\nAnd while I ride for them, you think it’s loud to them?\nI give pride to them and get it rough with them\nI hate the street that with you, it smell like earth burn\nI captivate ‘em with my first words, everybody\n\n[Hook]\n(Shout, shout, I’m talking to you)\nTo make some noise\nTo make some noise\nTo make some noise\nTo make some noise\n\n[Verse 2]\n(Holla!) back to applyin’ the pressure\nBother your corner stretcher, hot like a lot of pepper\nMost of you niggas off, cotton and polyester\nYou know how I know all, legend like Robert Nesta\nYou know I’m out to get you, take all the robs count\nAnd power to the Billies, couple cigar lounge\nSee how I make it pop? Knockin’ them all down\nWatchin’ them all drown, this how the love sound\nYour swag off, you know you really need to look around\nAnd try to find it nigga, searchin’ the lost sound\nBut I welcome the hate, my mother prayin’ for me\nGot too much money to count, my niggas winnin’ for me\nLet me appraise you closely\nThey can’t believe the way we busted up like it’s not the problem is we just playin’ homie\nAnd when we in the spot, there won’t be no delayin’\nOnly to collect another trophy, now the haters say it for me\n\n[Hook]\n\n(Shout, shout, I’m talking to you)", "image": "https://images.genius.com/c45e2fd5ac84651b718230013703e247.500x496x1.jpg"}], "artist": "Busta Rhymes"}