{"songs": [{"title": "Coming Up $hort", "album": "Cocktails", "year": "1995-01-24", "lyrics": "INTRO\n(Bitch!)\nBitches keep comin up $hort\nFuckin with Too $hort, Too $hort\n(Bitch!)\nToo $hort, Too $hort\nREPEAT\n\nNow fuck around and get a five finger hand plant\nStraight across your face\nTo make sure all you bitches understand it\nThat I'm a pimp-mack-player-ass nigga\nNot a gentleman\nAin't gonna be no sucker-ass swindlin\nI know ya starving bitch what you gone eat?\nJust because I picked you up I guess you waitin on me\nIt ain't goin be that, you shoulda ate or brought'cha ass a plate\nCos on this date we just fuckin till it's late\nI ain't Romeo, Prince Charming or a knight in shining armour\nI'm only out to fuck a bitch, fuck tryin to charm her\nI treat a fine ass bitch like dirt\nNo money in her purse, a fuck is all it's worth\nLookin hella good in the club like a ho\nBitch, you need to go find a nigga to buy some mo' drinks\nAt the bar, fill you up with Long Islands\nWhile I be all in your face tryin to fuck smilin\nCos Short Dawg'll never cater to you hoes\nAnd if you ain't fuckin I say \"Later\" to you hoes\nSo if you bitches gotta plot\nYou better get gonna get shot fuckin with Short Dawg\n\nBitches keep comin up $hort\nFuckin with Too $hort, Too $hort\n(Bitch!)\nREPEAT\n\nBitches be like rabbits wantin' diamonds and carats\nSee my car, see my house, and they think I'ma share it\nI ain't never been a mark bitch, you too bossy\nWanna drive my car closed-up, that's when you lost me\nI tell a bitch real quick, I ain't no Tootsie Roll\nAll you good fo' is some head and some pussy, ho!\nAnd if the pussy and the head tight, we fuckin' twice\nCos Short Dawg ain't nuttin nice\nBitch jumped in the car, asks me where we goin?\nI'm Shorty the Pimp bitch, you goin hoin'\nFucked in the car with my pants and my jacket on\nRaised up out the pussy, now I'm in the traffic\nNow pussy still wet, got my dick in her hand\nLickin all around it, rollin through the flat lands\nStickin' to my script, never pussy-whipped\nSeein' niggas with them bitches I done tossed and pimped\nI use to break hoes for Scrilla when I was down now\nI'm makin bank rolls for real-a and rockin town bitches\nLivin large for a night, turn back into pumpkins\nWhen I'm through fuckin', bitches leavin' with nothin'\n\nBitches keep comin up $hort\nFuckin with Too $hort, Too $hort\n(Bitch!)\nToo-Too $hort, Too $hort(Hoes can't fuck with me)\n(Bitch!)Too $hort\nNow break it down to the beat one time!\nOl' School. Tell ya lil' somethin about Shorty\n\nI'm the East Oakland player, lovers are mooshy\nI fuck a different ho a day and leave rubbers in pussy\nBitches keep lookin for some Too $hort nut\nSqueezin on a rubber tryin ta pull it off and make it bust\nBitch might lose her mind if I raw-dick her\nGet pregnant, move her in and make Ma and Pa richer\nNo more player, no Shorty the Pimp\nI get paid, give her the check and get forty percent\nAll the homies talkin bad, head down, walkin sad\nGot the broad livin with me, baby sayin \"Dad!\"\nSex played out and ol'Shorty's bored, getting fat!\nThen my bitch turn into a rat\nI could try to mack again but the bitches won't want me\n'Cause I'm all washed up, broke, fat and funky\nShort Dawg is through, people call me Todd Shaw\nAll the rappers who was fake on the mic, got raw\nUgly hoes playin hard-to-get, sold all my cars\nNow I ride the bus and shit\nI had a '94 Lexus, Rolexes\nI sold it all, now I can't afford breakfast\nI lost everything I worked to be\nNever thought I'd be a trick, payin hoes to serve me\nShit! Snap back came out of my dream\nShit can really happen if you know what I mean?\nBut fuck a wife biatch, stay away\nDon't wanna own a pussy, keep the babies on lay-away\nBitch thought I raw dicked, said it was mine\nShe didn't know I fucked her with a dildo the whole time\nStar-struck bitch seein dollar signs, she think the wad is fine\nPlayin games so I taught her mine\nTryin to play a player, got caught in a trap\nLearnt a lesson from the game that I taught in my rap\n\nBitches keep comin up $hort\nFuckin with Too $hort, Too $hort\n(Bitch!)\nREPEAT", "image": "https://images.genius.com/4879adf970510dea7fa29b937a49bd43.593x593x1.jpg"}], "artist": "Too $hort"}