{"songs": [{"title": "Geechi Liberace", "album": "Black Dollar", "year": "2015-09-03", "lyrics": "[Intro]\nGeechi Liberace, rings on every finger\nIn the south with the AC set at 69 at all times\n\n[Verse 1]\n(Woo)\nI fell asleep with the Rollie on (Tell 'em, dawg)\nA young Michael Corleone\nCustom made suits and designer shoes (Oh)\nTakes two hours to go through my shoes (Boss)\nEx-slave, proud field nigga\nNext Trayvon Martin, Emmett Till nigga\nMy nappy hair, who say that life is fair (Oh)\nMy family mean the world although I'm never there (Weird)\nThese days nothing makes sense\nSad, seeing all these Gs on this fake shit (Shit)\nText a nigga phone, avoiding my calls (What?)\nOnly thing you got is your word and your balls (Hah)\nGet up on my level you say you a boss\nEverybody seen it we know that you're soft (Boss)\nHeard you went and got a lawyer, you niggas is lost (Is lost)\nIf they say I'm not the biggest? You tell them they false (Hahahaha)\nI'm out in Vegas and I'm tricking off (Oh)\nOut in L.A. Freeway Ricky Ross (Racks)\nTestified on over 40 dudes (What?)\nI seen the documents, I'm who he wanna sue (Woo)\nHe testifies for a state allowance (Bank)\nThen does a blog like your favorite coward (Fuck)\nDown to roll, I might enroll and graduate from Howard (Hah)\nI love to roll and marinate just enjoy the sour (Hahaha)\nOr another hooligan at U of M (Whoo)\nBitches on the honor roll? I need me two of them (Whoo)\nWhen it comes to chicks I need a few of them (Whoo)\nHad a set of twins, now I got me two of them (Whoo)\n\n[Hook]\nSit the marbles statues on the glass floors\nGlass slippers, no cracks for the Task Force\nEvery mil' I count, my Momma screaming, \"Yes Lord!\"\nGeechi ring on every finger at the chessboard\n\n[Verse 2]\nI fell asleep half naked\nI woke up to a sexy Jamaican (Ahh)\nPenthouse suite 59th floor (Oh)\nThe other 58 were totally vacant (Woo)\nTrue wealth, in seek of this true wealth (True wealth)\nTrue wealth, in seek of this true wealth (True wealth)\nI once made love to a princess\nFor security reasons let's call her Empress (Haha)\nI'm well groomed ready for the throne (I got you baby)\nI learned that petty wars can take a toll\nHoly Ghost reading through the book of Job (Lord)\nOverdose, pleading for my pot of gold (Pleade)\nSmoking dope, hoping that I don't explode (Hah)\nTry to open up my mind, I got a hundred hoes\nBrain, all I want is the brain\nI'ma give my son the game, tell him, \"Stay away from fame\"\nI'm just tryna be a better boy (Real talk)\nEvery year they say I'm selling more (Hah)\nLook at the bitches that you settle for (My nigga)\nThis the yacht club, leave them on the paddle board (Whoo)\nTrue G, Geechi Liberace (Uh)\nIn the three piece, suede black Versace (What?)\nWe could take over the world (Say it again, my nigga)\nWe could take over the world\n\n[Hook]\nSit the marbles statues on the glass floors\nGlass slippers, no cracks for the Task Force\nEvery mil' I count, my Momma screaming, \"Yes Lord!\"\nGeechi ring on every finger at the chessboard", "image": "https://images.genius.com/be2a0055a8996220ec3bf561583cd405.800x800x1.jpg"}], "artist": "Rick Ross"}