{"songs": [{"title": "Ignorant Shit Freestyle", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Intro]\nGreen Lantern drop that shit\nYeah, my nigga Green (Green Lantern)\nWe ain't gonna change the beat on this one at all cause\nI'm gonna flow it all the way through. Gotta have one or two of those\nThis is Bar Exam 2 by the way. We gonna kick back\nThis is for my nigga Keno. (Shout to Keno)\n\n[Verse One]\nThere's got to be\nNobody hot as me\nFlow outta this world like Odyssey\nThat's why your girl ridin' me\nAt the cottage\nFor the summer, she like me\nCause I operate with numbers like the lottery\nDick in the dook chute\nWhat you know about sodomy\nI do what I want with her body\nI'm a commodity\nLast Real Nigga Alive\n2Pac's prodigy\nTake it even past conceited\nI mock modesty\nI'm major\nBitch it ain't trickin' if you gettin' it\nThat's why niggas don't be trippin' when I pays her\nMy whole clique just like me\nWe roll in circles in packs\nThey call us the Life Savers\nShe behave, I put her beside nice neighbors\nLet her ride to the top of that high rise\nAnd that dark fader\nI call it that\nCause the second you steppin' with the weapon\nIt's gonna light up like it's light saber\nThe car creeps invisible through the dark streets\nWith the lights off because it's dark with dark feet\nI call a cab at any Miami heart beat\nMy bitch drawin' my bath like she a art-ist\nI'm a kingpin, son\nI don't bark at puppies I ain't Queen Pen's son\nThe second one of y'all rap niggas start talkin' bout y'all boxin' me\nBet it's gonna be ding then done\nSwingin'\nOnly my ink pen runs\nNever been chased\nBeen A-1 from day one (yes)\nI don't know who the fuck you is\nBut I'll show you what the fuck this is\nI fuck with the same type of niggas that fucked with Big\nNiggas that'll throw them over the bridge\nRight after they fuck your kids\nNiggas get all surprised when 5'9\" responds to 'em\nI'm like naw, I ain't gonna do the Saigon to 'em\nI leave the slappin' to him\nI do 'em more like Ben Wallace\nAlonzo Mourning and put the arm to 'em\nForget the arguin'\nCause once the contract is intact\nIt's a wrap\nNow the Mobb is signed to 'em\nBut fuck beef nigga\nLife is short\nIt don't stop till they take you off that life support\nBasically\nBeefin' with me, your life is shorter\nThe definition of a Christ supporter\nI come down like the wrath of the hand that made you\nIn the flesh of his flesh\nAnd the blood of his blood, I bathe you\nThe flows amazin'\nI closed the deal for show\nMy respect for your soul I'll trade you\nBut you probably already don' gave it to Satan\nCause how the fuck you doin' sold out stadiums?\nTo God, you as big as a baby bug\nDoin' all them crazy drugs\nYou gon be hotter on the day you judged\nY'all niggas peakin' out your careers like EQs\nDeep down in your ears you're hearin' he's true\nBut you won't let it out, you weak\nYou refuse\nSo I'm gonna stay deep in the field like cleat shoes\nIf I done reached out to a dude to do a song\nAnd it ain't happen\nI give him dap and I move on\nIt ain't nothin' personal nigga\nThis is a business\nThis is the shit that we do to put our kids in cribs with\nNigga I'm a 80's baby\nFiend, foamin' at the mouth like rabies baby\nWhy you knockin' a G?\nThe only threesome you seen's on your TV\nSomebody with a release right outside the top of the key\nI'm right back in 'em\nThe truth's in these eyes\nSo you can believe I\nLike that denim\nI still say Shady's the greatest\nBut some people believe\nI'm the only one around who can put the light back in him\nBut I don't like that\nGospel's Hostile like Kweli\nAnd I ain't stoppin' till y'all niggas starve like Somalians", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}