{"songs": [{"title": "Sex With Society", "album": null, "year": "2011-06-03", "lyrics": "[Intro]\nThis, this, this\nShould be played at high volume\nPreferably in a residential\n\nLife’s a bitch, life’s a bitch\nBut I’mma keep the pussy wet (Yep)\nI’mma keep the pussy wet (Yep)\nI’mma keep the pussy wet (Yep)\nI’mma keep the pussy wet (Yep)\nMy dick hard, her pussy wet\n\n[Verse 1 - Kendrick Lamar]\nAnd I’m born with my dick in the earth\nYou can tell me how much am I worth\nI’mma die with my heart on my sleeve\nMany die on their hands and their knees\nAnd I’m takin’ whatever I need\nAnd I’m raping the government fees\nAnd you’re wasting your time\nAnd I’m speaking my mind on whatever I think\nAnd I think that I’m Richard Pryor\nWith priors of 32 fiends\nAnd that means that I hear for higher\nTell me why are you starin’ at me?\nMatta fact, man, your eyes is wired\nYou inspired by Kendrick the king\nMaybe it’s ’cause I’m living my dream\nMan, I sing what I’m living about\nAnd the words that come out of my mouth\nThey requires a random routine\nOf being organic granite\nThen my access is granted\nTo represent the shit that I conceive\nAnd I guarantee that I’mma bring\nMy mind, body, soul\nAnd I sold all these records off bein’ myself\nAnd I wish you can do the same thing, man\nIt’s easier than a stripper\nOr tyin’ a baby shoestring, you stringing along\nAnd really why you writing a song?\nYour passion for music is never in sync\nNo secret societies guided me to the world of unseen\nAnd they tell me life is a bitch, who gives a shit?\nYou'll get relief\n\nI’mma keep the pussy wet (Yep)\nI’mma keep the pussy wet (Yep)\nMy dick hard, her pussy wet\nI'mma keep the pussy wet (Yep)\n\n(Hi, ho!) I came\n(Bye, ho!) I went\n(Hi, ho!) I came\n(Bye, ho!) I went\n(Hi, ho!) I came\n(Bye, ho!) I went\n(Bitch-bitch-bitch-bitch-bitch-bitch-bitch-bitch-bitch, bitch, bitch, bitch)\n\n[Verse 2 - Kendrick Lamar]\nAnd I see that you envy of me\nEnemigos don’t prosper\nBetter yet, they do die eventually\nIf I’m at the event you will leave\n‘Cause you know and I know that\nI go ham even if Muslims is seen\nIn my rearview I’m near you\nBut I don’t hear you, can you at least breathe?\nWith an oxygen mask, and\nThe masses keep saying I’m speaking for them\nAnd if you can imagine my madness\nThen you can see where I’ve been\nAnd the places the Louis has been\nAnd I swear I been doing this when\nYou was in pajamas, watching B-Barney and Friends\nAnd you couldn’t harm me even with ten\nWeapons of your choice riding in\nArmy tanks, you shot blanks\nAnd I shot back, make your duplex bend\nWhat the fuck you think? If I don’t think\nThen I’m right back where the city sin\nWhat the fuck you drink?\nThinking I can’t write these raps in the Lions’ Den\nWhen I hear that you lyin’, then?\nIt’s murder she wrote, ain’t no hope\nYou go downhill, man, where’s your slope?\nGet thrown downhill tied to a rope\nTell the world to put intervals\nMan, I swear this the anecdote\nAnd they tell me that life is a bitch\nWho gives a shit when you know?\n\n[Hook]\n\nAnd I see that you envy of me\nDon’t prosper, better yet, they do die eventually\nCause you know and I know that I go ham even if Muslims is seen\nIn my rearview I’m near you\nBut I don't hear you, can you at least breathe?\n\n(Hi, ho!)\n(Bye, ho!)", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}