{"songs": [{"title": "Biscuits", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "[Intro: Ghostface Killah]\nYo... who the fuck brought me this chocolate shit, man?\nI said a banana nutrament, man\nYa'll heard what the fuck I said... I gave you the...\nI wrote it on the fuckin' paper, man!\nY'all muthafuckas always fuckin' around and forgettin' something and shit\nSmart dumb niggas and shit, runnin' around here and shit\nY'all niggas need to wisen up, man, yo..\nGet off that special ed shit though, man...\n\n[Ghostface Killah]\nI said Big O, hydro-face, pass me the sazon, it's on\nThere go son, tap out the hash bone\nHalf moon, he rock, three's fourth quarter length\nNo jewels, no rocks, it's not worth the spotlight\nHis gun tool, was a half a hill\nThat's a six digit slip behind five sticks, eatin' steel, fuck him\nWe gon' -- we gon' get our money\nIf he front, they gon' read about the rocks in his tummy\nMouth was red, socks was bloody, fuck all the talkin'\nSafety off and shit, crept up, \"What up money? Freeze!\"\nDon't move, turn around, act like James Brown\nAnd get down! Get slapped with the pi-dound\nWasn't you the same clown? Uptown, yappin'\nI keep big Shirley on my side, so What's Happenin'?\nTry eatin' these shells, they non-fattening\nAfter you digest that, I'mma stomp you bastards\nSo take that.. blaow, blaow! Ghost, he still breathing\nBlaow, blaow! Anything after that it don't matter\nYour homies and your close relatives\nEven them nosy ass pigs'll get splattered\nIt's the T-H-E-O-D-O-R-E, send me to Iraq I come back with don heat\nTeeth, less than a week, they be callin' me\nChief of Defense, cuz I sure do cook when it's beef\n\n[Hook: Ghostface Killah]\nYo, what up? Meet, these, O.G.'s, po' thieves and\nBaller' shit, long biscuits\nFuck around, take all your shit\nCall your bluff, y'all faggots don't want no beef\nGrind your teeth, and just, roll with it, don't risk it\nFuck around, and be a statistic\n\n[Trife]\nYo, yo, niggas ask why I use my Glock\nCuz it's 2003, muthafucka, I refuse to box\nI'm true to block, strip you for your shoes and socks\nRemove your watch, yo I'mma have to lose your top\nI'm from a place where junkheads and zombies dwell\nAnd niggas keep they heat blazin' like Bonzi Wells\nDon't ever talk to a nigga like I'm one of your kids\nCuz I'll cock back the mac and pop one in your ribs\nSo homeboy, keep runnin' your jibs, I'mma run in your crib\nPistol whip you right in front of your wiz\nMy nigga, that's how it is, I get it, just how I live\nCuz me without a gun, is like Queens without the bridge\nClassic cut, this is how a O.G. live\nLamp in village, and still get heard with no spins\nThis is Trife Diesel, New York's backbone, back home\nBlack blown, it's Theodore, nigga, fuck your wack stones\n\n[Hook 2X]\n\n[Outro: Ghostface Killah]\nThat's right, it's real!\nIt's that muthafuckin' Theodore Unit\nNahwhatimean? Staten Island, live shit, y'all\nStraight up and down, nothin' but that cutthroat shit\nBlowin' niggas back home, you know what I mean?\nI don't give a fuck... we could take it there\nWhatever, hits? We got 'em, nigga!\nYeah, now I'mma strangle the game!\nNo doubt, it's real right now, muthafucka\nY'all niggas done done it, fuck y'all yeah\nI'mma get the fuck outta this booth", "image": "https://images.genius.com/1563d407e670f05603a84947a6af2c41.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}