{"songs": [{"title": "Somebody Else", "album": "Something Else", "year": "2013-07-30", "lyrics": "[Intro]\nTech: Wow that was like \"DWAMN\" baby, you know?\nWoman: Mmmm, not for me\nTech: Damn, like that?\nWoman: I don't know what that was, but uhhh...\nTech: You make me wish I was fucking somebody else\nSo I could do you right you know I mean?\nWoman: What!?\n\n[Hook: Tech N9ne & Krizz Kaliko]\nYou make me wish I was fucking somebody else\nSo I can do you right (Do you, Do you right)\nI'm working through the night (I'm working through the night)\n'Til the morning light\nThen you want me to go inside\n\n[Verse 1: Tech N9ne]\nI be gone, I never got time\nTo be throwin' every woman that N9ne\nBut that's all that be on my mind\nI be spending all my time, pursuing that rhyme\nI be always on my grind\nBut when my lady wanna get it from behind\nGotta be breaking that backwards and be shaking the sack\nIt'll be quick in the crack getting it laid from no slacking\nLike Hell yeah! C'mon!\nShe's scared like I got a gun on\nLooking at me like a nigga done wrong\nGonna moan and I hope that it ain't anyone home\nI'm 'bout to knock it out the box bitch\nGonna make it blow a shock and\nRock it, bop it, bout to pop it\nI'mma never ever stop it, akee-kee-kee!\nCause I ain't had none in weeks, I'm geeked\nScorpio a freak-a-leak\nI go deep than peek\nDo it in the back of my Mercedes, ooh\nYou make me spray baby goo\nPremature, aww damn girl look what you made me do!\n\n[Hook] (2X)\n\n[Verse 2: Krizz Kaliko]\nIf I had a side piece, I could dump her something\nSomebody else is wrong to jump in, always think I'm up to something\nGirl I'm only tryna function\nYou can't hear nothing when I'm talkin' and you sayin' something\nPut it in lame and same that your brain just to explain\nI can't stain when your gums is bumpin'\nYou keep on thinkin' I'm creepin'\nWhenever I'm leavin' we beefin' and I ain't done nothing wrong\nMy phone used to blow up on the reggie\nCalmed it down a few you do the fool\nStill actin' edgy\nBut I got something to calm you\nWhen you be up at night\nHow's 'bout you play the plumbing?\nAnd I come lay the pipe (Okay!)\nAlways talkin' 'bout something wrong\nBut I fix it real quick, didn't I?\nAlways singing that same old song\nThat there's another chick that I'm with - get rid of her!\nPuttin' it down like I'm 'posed to do it\nMy phone ain't 'posed to view it\nSomething to say and I bet you spew it\nIt's like this everyday when we go through it\nThan it's back to lovin' like we used to\nWe cool for a minute\nKali baby see right through ya\nIt's a fiendish plot to make ya scream and stop\nWhether I cheat or not\nI wish I was loving somebody else\nSo you can either leave or not (Okay!)\n\n[Hook] (2X)\n\n[Outro: Krizz Kaliko]\nHey, you really make me wanna do\nThe things that I ain't 'posed to do\nWish I was lovin' on somebody else\nDon't want nobody else, baby but you\nYou really make me wanna do\nThe things that I win't 'posed to do\nMake me wish I was lovin' on somebody else\nDon't want nobody else, baby but you\nYou really make me wanna do\nThe things that I ain't 'posed to do\nAnd I wish i was lovin' on somebody else\nDon't want nobody else, baby but you", "image": "https://images.genius.com/9d1e1c938850d53aa216f2bec0e2ef9c.1000x1000x1.jpg"}], "artist": "Tech N9ne"}