{"songs": [{"title": "Ya Killin’ Me", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro: Tech N9ne]\nNigga you came lame, tryin' to obtain fame\nMaking a damn thing but Strange bringin' you samhain's rain\nPut on blame game, when you in it lame, you can't tame\nAnd bane mane with fags that's gonna bring insane pain\n\n[Hook: Tech N9ne] (2X)\n(It's so easy) God sent me here to punish you\n(Believe me) I'm the wrong one to run into\n(I'm breezy) They tell me ain't nobody cold as you\nBut you, you? Ya killin' me\n\n[Verse 1: Pill]\nYou thought you was nice, but I got news for you, sorta kinda\nBut Pill twice as nice as Rice with the 49ers\nCan't bring a horror houses, you softer than Dora pouches\nSmoke a Joker quicker than Batman and torture spouses\nCan't believe that you can't believe that you ain't as clean and cold as this\nDrank so we might crank the speed but after we leave you get frozen up, with the lights on\nYou think that you tight cause you got all that ice on?\nThis the right song cause I finish beginners as soon as they turn my mic on, yep\nBut I’ll tell you this, fuck it, I’ll package and mail you this\nNow open this letter, you hope it's lil' fellow\nThey told me to tap you and tell you quick, bitch!\nThis a mixture of a pistol and some liquor\nWrap your mouth around this barrel, guaranteed you drunk quicker, damn!\nOn some Smokey shit, it's friday with the coldest bitch\nPoke a bitch shoulder then showed her the door and told her \"dip\"\nOh my bad, I didn't know that was your bottom bitch\nI do the shit easy like after eatin' some cottage cheese, damn!\n\n[Hook] (2X)\n\n[Verse 2: Tech N9ne]\nI feel this shit, I bust to my meal ticket\nI'm up and I ill spit it, I fucks with the Pill nigglets\nI'm real digits, be walkin' not ville live it\nEven though that my scrill vicious\nI'm painted up and still wicked\nFuck, my pen just took a big shit\nI don’t give a fuck cause I'm gonna rip this\nEverybody that call me devil is gonna get a plague\nOn their families, damnit, he's in the motherfucking red\nTech is sick of people's lack of acknowledgement\nHe was ripping before wack niggas got a cent\nTo the weak ones that stack up your dollars\nWell, bustin' nuts is where I'm at cause I gotta vent\nThis industry can truly suck a booty\nThis rap is how I snap and hack a loogie, sucker sue me\nGot straps right in the back, I pack a tooley for ya newbies\nI crack your niggas hats for acting tooty fucking fruity\nLaughing at you wannabes, I'mma hang nooses\nFor dudes that's useless, nigga that's fucking (Strange Music!)\nWe bang to the boogie, don't sleep on this\nStoppin' 'em, a nigga tryin' to eat with a beast\nWanna creep up on it but the beef gon' get\nWhen you rapping niggas never speak on shit!\n\n[Hook] (2X)", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}