{"songs": [{"title": "Fine China (Remix)", "album": null, "year": null, "lyrics": "[Verse 1: Chris Brown]\nBaby, does he do it for you?\nWhen he's finished, does he step back and adore you?\nI just gotta know, cause your time is money\nAnd I won't let him waste it, ooh no no\nBaby, just go with it\nCause when you're with me, I can't explain it, it's just different\nWe can take it slow or act like you're my girl let's skip the basics, woah oh\n\n[Bridge: Chris Brown]\nHe's so replaceable\nYou're worth the chase, you put it on\n\n[Hook: Chris Brown]\nIt's alright, I'm not dangerous\nWhen you're mine, I'll be generous\nYou're irreplaceable\nA collectible, just like fine china\n\n[Verse 2: Chris Brown]\nFavorite, you're my favorite\nIt's like all the girls around me don't have faces\nAnd the saying goes\nLife is just a game but I'm not playing, woah oh\n\n[Bridge: Chris Brown]\n\n[Hook 2x: Chris Brown]\n\n[Verse 3: Common]\nDefined by your fineness\nFrom behind I watch you, you timeless\nCome sit next to your highness\nGet your nails done in different climates\nIndian hair, that's from China\nStay open all night, you my diner\nYou a definition of a rider\nOur sex is on house arrest, I stay inside ya\nWe could be best friends, me, you and diamonds\nClimax and keep climbing, I hand you refinement\nLike an assignment and watch you work that shit\nWe spend time and money cause you worth that shit\nYou could be dirty or Princess Diana\nCause you know the streets of Paris to Atlanta\nGlamour with a panoramic view for me to scan her\nI love this sister like I'm Tony Montana\nSchool her with grammar\nGet her mind in a golden state like Hammer\nShine bright like a gamma, ray with the things that I say\nMake her want to love, honor and obey\nI could be your Thriller, you could be my Ola Ray\nYou my fine china girl, I never throw away\n\n[Hook: Chris Brown]\n\n[Verse 4: Chris Brown]\nTook me awhile to find, your love\nAin't no amount of time, in this world\nSave me a lot of time, and just love me\nDearly baby, feel it in your soul\nAre you ready?\nI know your heart been telling you, you belong to me\n\n[Hook: Chris Brown]", "image": "https://images.genius.com/334bd07941665eb5b381fb51bced319d.1000x1000x1.jpg"}], "artist": "Common"}