{"songs": [{"title": "It’s Dark And Hell Is Hot", "album": null, "year": "1998-05-12", "lyrics": "Yo I'm sayin, these Ruff Ryder Niggas\nDog\nI heard these niggas is for real\nDog. That's my man and them\nBut I heard these Niggas is like suppose to be lockin down the industry on some Shit, on some power shit\nDog that's my mans and them\nEh\nSo what I'm doin'\nRight, right\nMy mans and them is doin, because\nRight\nThat's my mans and them, ya know\nI feel ya\nNow ya feel me?\nI feel ya\nSo you know when you fuckin with me\nRight, right\nYou fuckin wit\nOh oh, what are ya doin now?\n\nTold y'all niggas\nYa just don't listen\nWhy must you be hard headed\nTried to explain, but ya didn't hear me though\nYa know, grrrrrr\n\nUh\nOne two one two, come through run through\nGun who, oh you don't know what the gun do\nSome do, those that know are real quiet\nLet me think you wanna try it, fuck around and start a riot\nNiggas gonna buy it, regardless because I'm the hardest rap artist and I'ma start this\nShit up foreal, get up and feel, my words\nI make herbs split up and squeal\nIll is all I've been hearin lately\nNiggas hate me, wanna duck tape me and make me put their brains on the wall, when I brawl\nToo late for that 911 call\nNiggas stay beefin but a lot of them bluffin\nBut not me because I'ma nigga that can get out of them cuffs\nYou think a lot of them tough\nNot just for frotin\nWhen I hit them niggas like 'What you want?' the battle turns into a hunt\nWith the dog right behind niggas chasin em down\nWe all knew that you was pussy but I'm tastin it now\nAnd never give a dog blood because raw blood\nI have a dog like one bitin whatever\nAll up in ya gut\nGive it to them raw like that and ain't no love I do em all like that\nFour right up in they back\nClak Clak\nClose your eyes baby, it's over\nForget it, happened in front off your buildin but nobody knows who did it\nWhat\nWhere my dogs at?\nWhat what\nWhere my dogs at?\nUh\nWhere my dogs at?\nWhat what\nWhere my dogs at?\nUh\nWhere my dogs at?\nWhat what\nWhere my dogs at?\nUh\nWhere my dogs at?\nWhat what\n\nNiggas is pussy\nKeep me runnin from the werewolf, owww\nHowling at the moon on the roof\nEh, ah, no, get em\nTen niggas on him, hope God's with him\nGive me the bat, let me split him\nI'll have em where the pillow and the casket won't fit him\nOnly reason I did him, he wouldn't fight back\nTrieed to strike back\nLeft him like that, layin up with the white hat\nGettin right back at ya when I snatch ya up out the grave, nuthin but bones and ashes\nHittin niggas with gashes to the head\nStraight to the white meat but the street stay red\nBut this girl gave me head for free\nCause they see, who I'ma be by like 2003\nThat Nigga D took it there\nHe thought it was a joke\nHe went through like 20 G's and thought that\nI was broke, stupid\nThat's what you get for thinkin and eventually found that's what you get for stinkin\nBlowin up the spot when you rot plus if it gets hot they know you dipped\nFor four squared blocks\nHit em with the ox to the grill\nEh, ah, kill nigga kill\nYet still they don't know I'ma rob who\nThat dog DMX is a muthafuckin problem\nAight", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}