{"songs": [{"title": "Take From Me", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro]\n\"You're going to be okay kid, you're going to be... okay\"\n\n[Chorus: Claret Jai]\nIs everything not enough?\nWhat more can I give up?\nIs there anyone that I can trust?\nI give you my all and you still take from me\n\n[Verse 1: Royce da 5’9”]\nUh, always been the type of dude that'd feed my clique\nI know that without the fans, I ain't shit\nBut y'all better read my lips, I don't spit raps this ill\nFor you to just hack and steal and leak my shit, so peep my drift\nI hope y'all don't think y'all helping me out\nWith that shit, that shit stressing me out\nNickel nine is blowin' up; Christmas time\nYou should hang my album on top of your fireplace\n'Cause around that time, my stockin's goin' up\nFeels like a victory bittersweet, 'cause the bigger I get\nThe bigger the wedge between the relationship\nOf me and my bigger bro, hear what I said?\nFeels like the shit was wished on me\nEverything I do for the nigga, and the nigga know\nI would do anything for him, but the nigga refuse to quit\nJust straight shittin' on me\nKeepin' your distance? Probably best\nIf you don't wanna fuck with me\nBut you know me probably best, fuck pity, you want that?\nYou know it's Laila Ali's chest: tough titty\nThe problem's you got a problem, you think that I'm already set\nSo I'mma look down on you?\nJust be proud of me, you already got my respect\nI ain't tryin' to say something I'd regret\nSo I'mma just stop chasin' the pain\nAnd let you deal with the fact that we don't get along\n'Cause I got a big face in the game\nSometimes I feel like fuck my life\nI fuck with a few niggas that I know\nIf my chick was a Shady ho\nNiggas wouldn't think twice 'fore they fuck my wife\nGuess that's the difference in friends and associates\nI done been broke, I done been through the motions\nI don't pay no attention to birds\nI use my scope and I tend to the vultures\nNo one ever blows up your phone just to talk\nI don't make money just to loan it to y'all\nTell a nigga that then you wildin' is like dialin'\nAnd then talking to a hole in the wall\nPlease look at these expenses, these niggas expensive\nIf I gotta lend you money every time I see you\nJust to be your friend, bitch, I don't really need your friendship\n\n[Chorus: Claret Jai]\nIs everything not enough?\nWhat more can I give up?\nIs there anyone that I can trust?\nI give you my all and you still take from me\nI give and I give and you take and you take\nAnd you just walk away without nothing to say\nYou just take from me, ay, ay\nYou just take from me, ay, ay\n\n[Verse 2: Eminem]\nI live in a bubble, I struggle with the fame\nTrouble as the pain grows double, give a fuck what you say\nWhen my music you take so subtle, just to give it away\nTo people who don't even appreciate flows, mothafucka\nI'm livid today, 'cause I break my back to give you my art\nYou steal my thoughts, it's like drivin' a spike through my heart\nYou might not think it's that big of a deal\nTo steal from me, but music's all I got\nAside from my daughters, not to sound like a martyr\nBut it's getting harder than I thought\nTo not just go crazy, trapped in this house\nI'm about to just snap\nAm I not deserving of what I got, did I not work for it?\nPut it all in every record I record, well then\nPlease tell me why on this Earth, Lord's it keep happening?\nI keep rappin', but I wonder sometimes, is it worth all the bullshit?\n'Cause it feels like a down there ain’t no gettin' up from\nBut I won't let it get me down, I won't succumb\nI'm anything but glum, so fuck 'em\nThey'll appreciate me when I'm gone, they'll say it was ill, right?\nThe way I killed mics? But the way I feel right now\nIt just feels like I'm so done with this shit that I may as well wipe\nI have nothing else to give you, nothing left to contribute\nFarewell, I bid you, but before I go, my last gift to you\nLadies and gentlemen, Slaughterhouse, I give you\n\n[Chorus: Claret Jai]\nIs everything not enough?\nWhat more can I give up?\nIs there anyone that I can trust?\nI give you my all and you still take from me\nI give and I give and you take and you take\nAnd you just walk away without nothing to say\nYou just take from me, ay, ay\nYou just take from me, ay, ay", "image": "https://images.genius.com/e46d8c5b81dd5cfba852666c93111bef.1000x1000x1.jpg"}], "artist": "Bad Meets Evil"}