{"songs": [{"title": "Pockets Stay Fat", "album": "Laugh Now, Cry Later", "year": "2006-06-06", "lyrics": "\"I like my pockets fat not flat\"\n\"I like my pockets fat not flat\"\n\"I like my pockets fat not flat\"\n\"I like my pockets fat not flat\"\n\"I like my pockets fat not flat\" \"So get back\n\"I like my pockets fat not flat\" \"So get back\n\"I like my pockets fat not flat\" \"So get back\n\"I like my pockets fat not flat\" \"So get back\n\nMy pockets stay fat, and they always like that\nNot only in pocket but in my bank\nThere's stacks and stacks of dough\nSome get mad cause they can't understand\nThat I'm 23 years old, I'm in command\nI'm down with DITC, that's \"Diggin' in the Crates\"\nI'm staying fat, cause what comes around goes around\nBrothers always shout\n\"Good lookin' out Show\" Yeah, without a doubt\nBut don't try and take advantage\nI'll just leave you alone instead of putting that ass in bandages\nSigning off is Show B-I-Z\nAnd next up is A.G., he likes his pockets F-A-T\n\n\"I like my pockets fat not flat\"\n\"I like my pockets fat not flat\n\"I like my pockets fat not flat\n\"I like my pockets fat not flat\n\nCheck it out yo, A.G. is living fat\nIn the mental, in other words?\nAnd I'm a top-notch competitor\nCarrying dough like a treasurer\nGetting pussy, oh that's regular\nBut the sex I never take\nAnd you know that's a fact, black\nSo if she says no, that means no, and that's that\nNo matter how cute or how desperate\n()\nYeah, she gotta see the exit\nBut I'm not mad I didn't hit it\nI just dial seven digits and some skins that's with it\nYou gotta be smart and keep a down low in the projects\nWatch your step and take it easy\nOr act like Stevie Wonder because you know you can't see me\nDon't sniff no coke, but I might drink a brew\nOr maybe two (Andre the Giant, not you)\nYeah, wrecking MCs with just my demo\nAnd pulling all the cuties with no problemo\nStep back, get your sticks and your bats\nKnow you step up because my pockets are fat\n\n\"I like my pockets fat not flat\n\"I like my pockets fat not flat\n\"I like my pockets fat not flat\n\"I like my pockets fat not flat\n\nI'm not trying to be a bum with a 40\nThat's not my style, I gotta work hard like Naughty\nBy Nature, you should understand\nTo get yours in this land, you gotta work for yours, black man\nYou think it's easy because I rap?\nSo don't ask me for a dollar motherfucker, you ain't handicapped\nAnd if you was, you'd still have the chance\nLook how I flip \"ain't this a bitch\" now I'm making you dance\nYeah it's Show B-I-Z from your neighbor H-double-O-D, I R-A-P\nCause I wanna stay fat\nTo keep clothes on my back and you know I never slack\nFor all the bums that said I forgot where I came from\nEating crumbs on the corner in the slums\nI'm hungry enough to grow fangs\nHere's a dollar, go to the store\nBut give me back my fucking change\nI'm trying to make a million dollars, some shit I never saw before\nSo save that bullshit for later\nSo when I'm large, hoes give me head on an escalator\nYeah, I like to flow, I'm Show B-I-Z\nA.K.A. Mr. F-A-T", "image": "https://images.genius.com/c4141aa982e145b56c3c52c3fbd1c258.1000x1000x1.jpg"}], "artist": "Ice Cube"}