{"songs": [{"title": "The Rose That Grew From Concrete", "album": "The Rose That Grew From Concrete Vol. 1", "year": "2000-11-21", "lyrics": "* Poems written by Shakur as ~ interpreted by other artists\n\n[Intro: 2Pac]\nYou try to plant somethin in the conrete, y'knowhatImean?\nIf it GROW, and the and the rose petal got all kind of\nScratches and marks, you not gon' say, \"Damn, look at\nAll the scratches and marks on the rose that grew from concrete\"\nYou gon' be like, \"Damn! A rose grew from the concrete?!\"\nSame thing with me, y'knahmean? I grew out of all of this\nInstead of sayin, \"Damn, he did this, he did this,\"\nJust be like, \"DAMN! He grew out of that? He came out of that?\"\nThat's what they should say, y'knowhatImean?\nAll the trouble to survive and make good out of the dirty, nasty\nY'knowhahatImean unbelievable lifestyle they gave me\nI'm just tryin to make somethin..\n\n[Refrain 1: Nikki Giovanni]\nWhen no one even cared\nThe rose it grew from concrete\nKeepin all these dreams\nProvin nature's laws wrong\nIt learned how to walk without havin feet\nIt came from concrete\n\n[Verse 2: Spoken part]\nDid you hear about the rose that grew from a crack in the concrete?\nProvin nature's laws wrong it learned how to walk without havin feet\nFunny it seems but, by keepin its dreams\nIt, learned to breathe FRESH air\nLong live the rose that grew from concrete\nWhen no one else even cared\nNo one else even cared..\nThe rose that grew from concrete\n\n[Verse 3: Spoken part]\nDid you hear..\nDid you hear about the rose that grew from a crack in the concrete?\nProvin nature's laws wrong\nIt learned to walk without having feet\nFunny it seems but by keeping its dreams\nIt learned to breathe FRESH air\nLong live the rose that grew from concrete\nWhen no one else, even cared\n\n[Refrain 2: Nikki Giovanni]\nKeepin all these dreams\nProvin nature's laws wrong\nIt learned how to walk without havin feet (to breathe the fresh air)\nIt came from concrete (to breathe the fresh air)\n(to breathe the fresh air, to breathe the fresh air)\n\n[Outro: 2Pac]\nYou see you wouldn't ask why the rose that grew from the concrete\nHad damaged petals. On the contrary, we would all celebrate its\nTenacity. We would all love it's will to reach the sun\nWell, we are the roses - this is the concrete - and these are\nMy damaged petals. Don't ask me why, thank God nigga, ask me how!\nHahahaha..", "image": "https://images.genius.com/866e68770deafd17a70d2918c7819b81.817x1000x1.jpg"}], "artist": "2Pac"}