{"songs": [{"title": "Tragic Endings", "album": "Revival", "year": "2017-12-15", "lyrics": "[Verse 1: Skylar Grey]\nI'm stumbling, I can’t see straight\nAnd it's my fault I got this way\nI got my hands on something great\nAnd found a way to mess it up\nI did my best, I tried to change\nBut it's just in my DNA\nI got my hands on something great\nAnd found a way to fuck it up again\n\n[Refrain: Skylar Grey]\nNow I’m the one thing you couldn't hate more\nBut you're the one thing that I would die for\n\n[Verse 2: Eminem]\nAll my life, I was told, I was never nothing special\nI don't need to be reminded of it every other second\n'Specially when all my self-esteem's\nAlready shot to hell, I'm falling helplessly\nI'm embarrased, I don’t want no one else to see\n’Cause I feel like I'm a piece of shit every time she yells at me\nSelfishly addicted, definitely doesn’t help that she\nMakes me feel like I've died and gone to heaven\nBut makes life a living hell for me\nShe does that thing with her lip, now she's melting me\nI'm putty in her palms, I’m wrapped around her finger\nA yo-yo on a string, she lets me sit there and just dangle\nUntil something better comes along\nAnd she'll just drop me like a hot potato\nI look like I'm in pain, but I'm okay though\n'Cause I know she loves me—my friends, what do they know?\n\n[Chorus: Skylar Grey]\nIt's like I'm drowning at sea\nHoping that you reach for me\nI know you're there, but I can't see\n'Cause I'm so drunk off tragic endings\nI'm dying to breathe\nAnd all you do is strangle me\nSuch a beautiful relief\n'Cause I'm so drunk off tragic endings\n(Drunk off tragic endings)\n\n[Verse 3: Eminem]\nIn my moments of weakness\nI openly admit the shit I wouldn't normally\nI'm extremely self-conscious and enormously\nInsecure and she uses it to torture when she torments me\nIt only turns to ammunition for her in this war, when she\nGets goin' she don't stop, when I'm up she's like a downer\nWhen I found her it was love at first encounter\nBut, somehow she musta took the carton of eggs off the counter\nCracked them and placed all the shells on the ground for\nMe to walk on when I'm around her\nBut there's just something about her\nThat makes me not able to function without her\nHow can I get out of it when I don't know how to?\nI'm a doubter, I'm a pessimist, make a believer out of me\nAnd show me the way now or stay the fuck out of my cloud of rain\n'Cause I'm going straight down the drain, I'm drowning\n\n[Chorus: Skylar Grey]\nIt's like I'm drowning at sea\nHoping that you reach for me\nI know you're there, but I can't see\n'Cause I'm so drunk off tragic endings\nI'm dying to breathe\nAnd all you do is strangle me\nSuch a beautiful relief\n'Cause I'm so drunk off tragic endings\n(Drunk off tragic endings)\n\n[Refrain: Skylar Grey]\nNow I'm the one thing you couldn't hate more\nBut you're the one thing that I would die for\n\n[Verse 4: Eminem]\nIt took a while for me to get it, but I think I've figured it out\nShe don't want me, she just don't wanna see me with someone else\nThe idea of seeing me happy destroys her in itself\nTo see me falling to pieces brings her joy and brings her health\nBut it annoys her to see me get the strength to say, \"Screw her!\"\nI threw up on myself, I'm dumb sick, I'm addicted to her\nShe's tryna block the door, so here's how I do her\nSince I'm manure, she's a sewer\nAnd this time this piece of shit's running through her\nI can see the light, now I'm running to it\nWhat the fuck? Shoulda knew it!\nWho would think she'd actually have the balls to do it?\nAs soon as I hopped in it, she doused the car with lighter fluid\nShe's standing there with a rag, 'bout to put the lighter to it\nLit the fucking thing on fire, then she threw it\n\n[Chorus: Skylar Grey]\nIt's like I'm drowning at sea\nHoping that you reach for me\nI know you're there, but I can't see\n'Cause I'm so drunk off tragic endings\nI'm dying to breathe\nAnd all you do is strangle me\nSuch a beautiful relief\n'Cause I'm so drunk off tragic endings\n(Drunk off tragic endings)", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}