{"songs": [{"title": "She Couldn’t Make it on Her Own", "album": "I Am the West", "year": "2010-08-31", "lyrics": "[Hook:]\nShe had to get a pimp she couldn't make it on her own\nShe had to get a pimp she couldn't make it on her own\nShe had to get a pimp she couldn't make it on her own\nShe had to get a pimp she couldn't make it on her own\n\n[Verse 1: OMG]\nCalifornia Air\nChain all blue like it's running out of air\nI keep a bad bitch with a fat derriere\nAnd you know that ho fresher than a new pair\nRetro elevens on the pedal!\nI'm taking this to the next level\nCompetition best invest up in a Chevelle\nAnd if you niggas still wanna make a deal with the devil\nI can help you meet him, introduce you to my barrel (to my barrel)\nAll you artists walking 'round wit'cha wack raps (wack raps)\nAnd getting fucked by the game - Kat Stacks (Kat Stacks)\nAnd any nigga thinking he can make it happen\nI'll be outside of Staples with the bitches and the Phantom\nMothafucka!\n\n[Hook]\n\n[Verse 2: Doughboy]\nPull up on them bitches, stepping out on thirty inches\nIn my L.A. Dodger fitted with some Louie V stitching\nNiggas wanna catch me slipping yeah they praying and they wishing\nCause a nigga clocking dough - and I'm fucking all they bitches\n(Yo you fucking all they bitches?) Yeah I'm fucking all they bitches\nAnd it's money over bitches and I'm preaching my religion\nCause this game that I'm living 'bout as cold as my wrist is\nIf you know my pops then you know I'm 'bout the business\nSmoke big trees, Christmas\nChain super sick, syphilis\nMy flow retarded nigga gifted\nThis game's a bitch, watch me pimp it\n\n[Hook]\n\n[Ice Cube]\nIf you don't kick it with me who you gon' kick it with?\nIce Cube is the shit, who you been speaking with?\nThey been lying to you if they told you different\nI got a different cool type of temperament\nWest Coast style baby on some California shit\nThey mighta told you that, I was hard on a bitch\nYou know how it go, some bitches think they slick\nLook at me and think they 'bout to get rich\nUh-oh, danger\nYou are a stranger\nWho am I, I am The Lone Ranger\nTonto tell 'em, I'll run yo' fucking ass through the ranger\nIt goes\n\n[Hook]\n\n[Outro]\nWhat about me\nWhat about me\nWhat about me", "image": "https://images.genius.com/f1c6e4522c58b032c43433a2345b1bb1.1000x1000x1.jpg"}], "artist": "Ice Cube"}