{"songs": [{"title": "Kings Never Die", "album": "Southpaw (Music From And Inspired by the Motion Picture)", "year": "2015-07-10", "lyrics": "[Produced by The New Royales]\n\n[Chorus: Gwen Stefani]\nHere to stay\nEven when I'm gone\nWhen I close my eyes\nThrough the passage of time\nKings never die\n\n[Verse 1: Eminem]\nI can hear the drummer drummin'\nAnd the trumpets, someone's tryna summon someone\nI know something's comin'\nBut I'm runnin' from it, to be standing at the summit\nAnd plummet, how come it wasn't what I thought it was?\nWas it too good to be true?\nHave nothin', get it all but too much of it\nThen lose it again, did I swallow hallucinogens?\n‘Cause if not, where the hell did it go?\n‘Cause here I sit in Lucifer’s den by the dutch oven\nJust choosing to sin, even if it means I'm sellin' my soul\nJust to be the undisputed again\nDo whatever I gotta do just to win\n‘Cause I got this motherfuckin' cloud over my head\nCrown around it, thorns on it\nCracks in it, bet you morons didn't think I'd be back, did ya?\nHow 'bout that? I’m somehow now back to the underdog\nBut no matter how loud that I bark\nThis sport is somethin' I never bow-out at\nI complain about the game, I shout and I pout, it's a love-hate\nBut I found out that I can move a mountain of doubt\nEven when you bitches are countin' me out\nAnd I appear to be down for the count\nOnly time I ever been out and about\nIs drivin' around town with my fuckin' whereabouts in a doubt\n‘Cause I been lost tryna think of what I did to get here\nBut I'm not a quitter; gotta get up, give it all I got or give up\nSpit on, shit on, stepped on, but kept goin'\nI'm tryna be headstrong\nBut it feels like I slept on my neck wrong\n‘Cause you're moving onto the next, but is your respect gone?\n‘Cause someone told me that…\n\n[Chorus: Gwen Stefani]\nKings never die\n\n[Verse 2: Eminem]\nDon't give me that sob story, liar, don't preach to the choir\nYou ain't never even had to reach in the fire to dig deep\nNobody ever handed me shit in life, not even a flyer\nWouldn't even take shit into consideration\nObliterate anyone in the way\nI think I see why a lot of rappers get on these features\nAnd try to show out on a track with me\nBut it'd actually have to be\nA fuckin' blow-out to get me to retire\nTell these new artists that kings never die\nI know shit has changed in this age, fuck a Twitter page\nDid it just say I've been upstaged?\nWhy am I online? It's driving me crazy\nI'm ridin' shotgun tryna get a gauge\nOn what's hot, but I'm not one to conform\nBut as days pass in this shit\nAnd opinions sway, I can hear 'em say\nIf I stay passionate maybe I can stage a miraculous\nComeback, as if I went away\nBut detractors just say so much for the renegade\nSomeone's gonna make me blow my composure\nHere I go again, center stage, and I feel like I'm in a cage\nThey so want a champion to fall\nIt's no wonder why I laugh at 'em\n‘Cause why can't we win 'em all?\nSo fuck what these cynics say!\nIt just goes to show that when my back's against the wall\nAnd I'm under attack again, that I'll act as if I'm 'posed ta\nWith this pent-up rage, ‘cause all these plaques in my office\nOn the floor stacked against the door\nAre they just metaphors for the odds of me comin' back again?\n‘Cause all the accomplishments, accolades, awards\nAnd trophies just don't mean jack anymore\nIf I'm here today and gone tomorrow, and I'm not gonna be…\n\n[Chorus: Gwen Stefani]\nHere to stay\nEven when I'm gone\nWhen I close my eyes\nThrough the passage of time\nKings never die\n\n[Verse 3: Eminem]\nI want it, I'm comin' to get it\nSo you son of a bitches don't duck\nYou’re gonna get Riddick Bowe’d\nCritics'll end up in critical\nThink your shit is dope, all you're gonna get is smoked\nAnd I ain't stopping 'til I'm on top again\nAll alone and on a throne, like a token of respect\nOr a homage poem, or an ode I've been owed\nTossed in the air by my own arm\nAnd launched so hard it broke my collarbone\nAnd when it's my time to go\nI'm still not leaving, stop for no one, I don't know\nBut I've been told, an obstacle that blocks your road, ya\nKnock it over, time to go for the pot of gold, ‘cause…\n\n[Bridge: Eminem]\nThey say kings never die\nJust ask Jam Master Jay\nThey just grow wings and they fly\nSo, hands up, reach for the sky!\nTry to hold on and prolong these moments\n‘Cause in a blink of an eye\nThey'll be over\n\n[Verse 4: Eminem]\nSo you're tryna secure your legacy like Shakur\nAnd ensure nobody's ever gonna be what you were\nSo before you're leavin' this Earth\nYou want people to feel the fury of a pure evil cerebral, berserk\nDeacon of words, syllable genius at work\nPlus, I'm thinkin' that they're mistakin' my kindness for weakness; kill 'em with meanness\nI went from powdered milk and Farina\nTo flippin' burgers on the grill for some peanuts\nAt Gilbert's to arenas, call me Gilbert Arenas\nStill appeal to the dreamers\nI made it to the silverscreen\nBut Rocky's still what the theme is\nKhalil on the beat, ‘cause makin' the beat\nAin’t the same feelin' to me as killin' the beat is\nOr fulfillin' to me is what fillin' a seat is\nIt's that sound-bombing, Thirstin Howl\nCommon, underground, Diamond D, Outsidaz\nStomach growl, throbbin' hunger, out-rhymin' everyone\nGod, just give me one shot, I swear that I won't let you down\nI'ma be around forever-and-a-day, even in the ground\nYou ain't never ever gonna hear 'em say I ain't…\n\n[Chorus: Gwen Stefani]\nHere to stay\nEven when I'm gone\nWhen I close my eyes\nThrough the passage of time\nKings never die\n\n[Outro: Gwen Stefani]\nKings never die", "image": "https://images.rapgenius.com/467c2779b78b07674035a8aedd73db9b.992x1000x1.jpg"}], "artist": "Eminem"}