{"songs": [{"title": "I Know You Got a Man", "album": "Battle of the Sexes", "year": "2010-03-08", "lyrics": "[Hook: Flo Rida & (Ester Dean)]\nI know you got a man, man, man\nBut tell me what your man, man, man\nGotta do with me, me, me (uh-oh, uh-oh-oh)\nGotta do with me, me, me (uh-oh, uh-oh-oh)\n(I know you got a girl, girl, girl)\n(But tell me what your girl, girl, girl)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)\n\n[Verse 1: Ludacris]\nHahaha, listen\nI know you got a man but your man ain't Luda (Luda)\nSo please don't let him fool ya\nCause the nigga don't really know how to do ya\nWho's your daddy rollin all up in the Caddy\nSunroof top with the diamond in the back? (back)\nComin to get some of the bomb in the sack\nLike a bomb in Iraq, I'mma come and attack\nEvery inch, of yo' body after the af-terparty\nAnd then on to the hotel lobby ridin me like a Ducati\nFaster than a, Bugatti I'm like, whoa kemosabe\nGood golly shawty a freak, well she been practicin Pilates (woo!)\nI'm probably just trippin, tongue sk-skippin like the track, broke\nBut if she think I'm frontin just wait 'til she see my backstroke (hah!)\nI'll be yo' side piece, but what's our future plans?\nCause I be on ya like DAAAAMN!\n\n[Hook: Flo Rida & (Ester Dean)]\nI know you got a man, man, man\nBut tell me what your man, man, man\nGotta do with me, me, me (uh-oh, uh-oh-oh)\nGotta do with me, me, me (uh-oh, uh-oh-oh)\n(I know you got a girl, girl, girl)\n(But tell me what your girl, girl, girl)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)\n\n[Verse 2: Flo Rida]\nHey, okay okay\nSo that's yo' mans and dem, damn I ain't tellin you to cancel him\nDamn d-do yo' thang, look shawty I gotta respect yo' antonym\nDamn d-dere yo' boyfriend, I just wanna be yo' toy friend\nYo' other other man, not yo' l-l-lover man, a undercover man\nHow many rubberbands it would take for you lil' mama to be apart of my plan?\nWhat do you need in advance? I can see both of us showin in France\nI got the back of yo' thong in my hand, Louis Vuitton, no more Donna Karan\nCouple of stacks, s-so what is you sayin? Like Denzel Washington, \"My man\"\nI don't wanna hear no mo'-mo' 'bout him, what he gotta do with me?\nYou a grown-ass woman, I'm a grown-ass man\nSo we both know a lot about the birds and the bees\nHold up shawty let's conversate, conjugate, constipate\nGet stuck on each other, you comin up out of yo' lingerie\nHey, I know you got a man\n\n[Hook: Flo Rida & (Ester Dean)]\nI know you got a man, man, man\nBut tell me what your man, man, man\nGotta do with me, me, me (uh-oh, uh-oh-oh)\nGotta do with me, me, me (uh-oh, uh-oh-oh)\n(I know you got a girl, girl, girl)\n(But tell me what your girl, girl, girl)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)\n\n[Verse 3: Ludacris]\nNot a, not a, not a damn thang\nHe wouldn't know what to do if he tried and I ain't hatin\nYou need some room to breathe and I could be yo' ventilation\nYou need a lil' love and just a lil' stimulation\nA hug, a lil' kiss and then a lil' penetration\nGive it to you like you never had it befo'\nAnd you ain't never gonna think about his ass again\nLips, hips, eyes, thighs, yeah I'm gonna have to give that ass a ten\nAnd they can get a five, even though one of 'em kinda fine\nBut ain't none of 'em got nothin on you, you\nSo let's go somewhere to dine and sip some expensive wine\nLater on tell me what we gon' do, do\nWe gon' bump and we gon' grind, so good it should be a crime\nAnd next time tell yo' friends to come too, too (woo!)\n\n[Hook: Flo Rida & (Ester Dean)]\nI know you got a man, man, man\nBut tell me what your man, man, man\nGotta do with me, me, me (uh-oh, uh-oh-oh)\nGotta do with me, me, me (uh-oh, uh-oh-oh)\n(I know you got a girl, girl, girl)\n(But tell me what your girl, girl, girl)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)\n(Gotta do with me, me, me - uh-oh, uh-oh-oh)", "image": "https://images.genius.com/05b5494c6b36a8d257cb2950d2d8896c.640x640x1.jpg"}], "artist": "Ludacris"}