{"songs": [{"title": "Traffic In the Sky", "album": "K.I.D.S", "year": "2010-03-13", "lyrics": "[Verse 1]\nRecently it seem like everywhere we go\nThe drinks stay cold when we coolin', coolin'\nAnd being broke starts to get a little old\nMy money had to get some fine tunin'\nTonight might be the night I make it\nSo let's live it up and don't regret it at all (No)\nAll these faces, different places\nPeople hit me up but I'm forgettin' to call (Haha!)\nGet away to California where the weather getting colder\nMy honey's by the pool with umbrellas and mimosas\nChillin' at the beach house, lounging on the sofa\nRidin' with a chauffeur, on my way to blow up\nStoner, roll up, fishin', champagne sippin'\nFive-star chef stay cookin' in the kitchen (Haha!)\nBut makin' only the good shit (What?)\nSee the way I'm living they like \"Oh my goodness\"\n\n[Chorus]\nI tell 'em I'm fine (Hey, hey)\nI ain't got a damn thing on my mind (Hey, hey)\nAnd baby all we got is time (Hey, hey)\nLet's just watch the clouds go by (Heh)\nAh, ah, ah, ah\n\n[Verse 2]\nAnd there ain't no need to panic\nGirl, we can lay up on this hammock\nNo need to pose here, everything candid\nLivin' in the moment, feeling so splendid\nBottles on me, you can put it on the debit (Uh-huh)\nI'm just trying to have fun tonight\nSo everybody wang chung tonight (Haha!)\nGirl, you can fall in love tonight\n'Cause trust me, I'ma fuck you right\nGot my Louis shades on, ain't no damn thing wrong (Nah)\nFill enough cups 'til the bottle all gone\nWe just coolin', coolin' (What?), feel the breeze\nIt's time to get you something you can sing off key\nLike, \"La, la, la, la, la, la, la\" (La, la, la, la, la, la, la, la, la)\nUh, I'll be puffing that la, la, la, la, la, la, la (Hehe, yeah)\n\n[Chorus]\nI tell 'em I'm fine\nI ain't got a damn thing on my mind\nAnd baby, all we got is time (Hey)\nLet's just watch the clouds go by\nAh, ah, ah, ah\n\n[Outro]\nYeah, haha, that's that smooth shit, Jerm! That pimp shit dude! Oh yeah. Thumbs up, haha!", "image": "https://images.genius.com/b7b181331518245aabbe770526a08ae1.275x275x1.jpg"}], "artist": "Mac Miller"}