{"songs": [{"title": "Reddit AMA", "album": null, "year": "2014-06-03", "lyrics": "Q: How much can you bench press?\n\nA: The most was 405 but i started looking like the security lol i had to slim down\n\nQ: What was your favourite TV show as a kid?\n\nA: The benny hill show. he was an idiot. really funny\nAnd dukes of hazzard cause of the girl with the short shorts\n\nQ: Does everyone sing \"go shorty, its your birthday\" on your birthday like my friends have done to me every year since you released In Da Club in 2003 :D\n\nA: They do sing it to me. every day is someone's birthday that song won't go away\n\nQ: Iggy azalea's booty real or no?!!!\n\nA: Next time i see her ima squeeze it and find out for you ok. I will report back to you shortly lol\n\nQ: 2 quarters or 5 dimes?\n\nA: 2 quarters keep it simple\n\nQ: Whats your favourite video game?\n\nA: Blood on the Sand. i dont think it has anything to do with me being in it. also NBA Live 2014\n\nQ: Biggest regret of your career? How long are you planning to make music?\n\nA: Ill prolly make music longer than im suppose to. like a fighter who doesnt know when to retire lol i just love doing it\n\nQ: Fif what is Power about and why should I watch it?\n\nA: You should watch it because I say watch it. I'll never steer you wrong\n\nQ: Hey man, what made you want to accept Bitcoin payment for your new album?\n\nA: Stay with times. technology is what's changing the business gotta get with it. I take money no matter if its coins or dollars\n\nQ: Hey 50, just a couple questions\n- From the recent G-Unit reunion are there any chances of The Game being involved? Also what was it like to preform with -everyone again?\n- Hows the relationship with Em, any new projects you guys are working on?\n- You've always been very business minded in your career is there any advice you would give someone who wants to start their own brand or company?\n\nA: - not a chance. feels good to be back on stage with them again. couple of them gotta get in shape again they get tired lol\n- I am gonna go to his show see him soon in london\n- because of the internet do it independently. you have access to things we didn't. i had to hustle bootlegers. chief keef is in his grandma living room doing it\n\nQ: I want to get rich but I have reservations about dying, what should I do? Also what's your favorite most expensive food/least expensive food?\n\nA: Focus on gettin rich you gonna die anyway. lets live good. thats what Animal ambition is about, prosperity\nPhilippe chow, the shit is expensive for no reason\n\nQ: Yo $0.50 . . . what happened on that pitch?\n\nA: I have a skeletal muscle injury on my left shoulder from excessive masturbation so take it easy lol\n\nQ: Your album, Get Rich or Die Tryin' was the first cd I can remember buying with my own money. Still is one of my favorite all time CDs. My question is about your tattoo removal. Were there any tattoos you knew you were going to miss? Is tattoo removal really as painful as people say it is? Is it more like a scar now or is it a clean removal? Thanks for doing this AMA\n\nA: Tattoo removal is extremely painful. i do not advise it. its like signing up to be burnt\nTopical cream docs give you dont work lol\n\nQ: Hey Mr. Jackson, what is your favorite sushi roll?\n\nA: California roll. im a fake sushi eater lol its all vegetables. the only thing i would eat raw is a woman lol anything else is a no go\n\nQ: Does it go \"my chrome cost more than the crib yo momma raised you in?\" or is it \"my cross cost more...?\"\n\nA: My cross\n\nQ: How exactly do you party on your birthday?\n\nA: I do it BIG! this one will have a fight live on ESPN, have special guest performances, a pool party then another party, then again a party then a firework a BBQ Ima live broadcast all that on my hang with\n\nQ: When u made Get Rich or Die Tryin, did u think at the time it would have the impact that it does today?\n\nA: No i didn't. I was praying for it do to well. It surpassed my expectations. I hope animal ambition does the same\n\nQ: What has been the nicest car you've owned?\n\nA: The 100 EX rolls royce\n\nQ: Hey Mr. Cent\nI need to know if there is any truth behind Aziz's Grapefruit story. Can you shed some light on that?\n\nA: My grandma used to get me grapefruit juice as a kid. he's a comedian. Ima have his ass whoop if he keeps saying that lol\n\nQ: What's your favorite brand of Root beer?\n\nA: I dont drink root beer unless its the only cold can available. i drink ginger ale\n\nQ: Hey 50, what would you say is your favorite book and why?\nThanks\n\nA: The 50th law. because you can't be afraid of bein successful you gotta have enough in you to be as successful as you want to be\n\nQ: Yo 50! do you still have the slowbuck chain from SummerJam?\nAlso, i think Animal Ambition is your best work since Massacre. really good job with that. thanks for being 50\n\nA: I dont know why people keep talking about this. i was busy performing. it was so many people on stage lol\n\nQ: Thanks for doing this! What's the first thing you bought after you \"made it big\"?\n\nA: My grandmother a car. it was important to me because she took care of me when i couldn't take care of myself", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}