{"songs": [{"title": "Amazing Amy", "album": "Sorry 4 The Wait 2", "year": "2015-01-24", "lyrics": "[Intro]\nWhoa, I'm in love with that ho bro\n(Migo!)\nWe Got London on da Track\n\n[Verse 1: Lil Wayne (Quavo)]\nShe crazy as fuck (Crazy) but she sexy (bad) as fuck (She bad)\nAnd she just hit me up, she text me \"let's fuck\" (Smash)\nI'm just waking up but fuck it I'm up (I'm up)\nOoh! I'm on my way (where?)\nGet out my way (Move), bump-bump-bump-bump (Move)\nI'm Norman Bates and this bitch ain't normal, our kids gon be nuts (Not the babies!)\nBut when I had the yay\nAnd the police would come she wouldn't give me up (Nah)\nShe knew what not to say\nAnd when they would leave, she gave me heads up\nLord I feel like Plies (I'm feeling like), that's my lil' baby (Baby)\nBut that bitch so crazy (Crazy)\nThat bitch gon kill me, and then she'll be famous, that'll be crazy\nAmazing Amy, amazing Amy, my bitch so crazy\nBut that's my bitch though, I must be crazier, she must be schizo\nFuck it, I love her, fuck it, I love her, don't fuck with my lover\nBoy I'll put you under\nHer last nigga shunned her, she ride me like Honda\nAmazing Amy, amazing Amy, that bitch so crazy\nThat bitch gon' kill me, then she'll be famous\nThat's what's amazing (Damn)\nBut I'm in love with that ho though\nEven though she loco\nThat pussy got me bozo\nI'm in love with that ho bro\nAmazing Amy, amazing Amy, my bitch so crazy\nThat bitch gon' kill me, then she'll be famous\nThat's so amazing\n\n[Chorus: Lil Wayne]\nShe's so amazing\nLord I feel like Plies, that's my lil' baby\nThat bitch gon kill me, that'll be crazy\nBut that's what's amazing, that's my lil' baby\nThat bitch so crazy, amazing Amy\n(Just wait on it, just wait on it)\nAnd this that Sorry 4 The Wait, Amy\n(Just wait on it, just wait on it, just wait on it)\nAnd I'm so sorry for the wait, Amy...\n\n[Verse 2: Quavo]\nQuavo!\nShe told me wait on it\nI told her you gon have to put a date on it (Go)\nYou already let Tunechi skate on it\nMy hook in the water, lil' mama, she bait on it\nDamn, I mean she bite on it (Grrr)\nKawasaki she can ride on it (Ride)\nShe too good for me like some vitamins\nShe swallowed the dick like a Heineken (Nasty)\nI love her she came with a frying pan\nHer mama black, her daddy from Japan\nSo amazing she deserve a Birkin bag\nShe so crazy she gonna take all of my cash\nShe in love with my money and I am so crazy\nI'm gonna keep spending blue hunnids and for the jabronis\nWaiting for Migos and Wayne to fall off\nNigga you can wait on it\n\n[Verse 3: Offset]\nOffset!\nChoppa like Tony watch how I do my opponent\nWait on my moment I beat it I own it\nKeep that thang on me you won't catch me lonely\nShe wanna suck and fuck and put it on me\nShe plotting on me trynna get some money (Cash)\nHad to cut her cause the millions coming (Cut, yeah)\nRun off with the work, started trappin dummies\nCaucasian, Black and Asian you amazing\nWe poppin' them seals we not in the Navy\nWe won't take a deal cause we got the paper (Nah)\nThat people hate it, we still nominated\nYoung Rich Niggas yeah we graduated\nI got bitches in the kitchen cookin' Sarah Palin\nSmoking up the gas bag you can smell the fragrance (Gas)\nGot me buying handbags, man this bitch is crazy (Uh, crazy)\n\n[Verse 4: Takeoff]\nTakeoff! Takeoff!\nAmazing Amy\nAmy wanna have my baby\n(Nah) she been patiently waiting\nWaitin' for me to get famous (Waitin' for)\nWant me to buy her Mercedes\nI thumb through the check then I looked at her crazy\nI'm focused on the M&M's\nYou want Benjamin Franklins you gotta have patience\nI pull up in the coupe and its disabled\nI'm drinking on maple these bitches watching me on cable (Actavis)\nNigga's trynna copy but they can't be the creator\nI'm a legend, feel like Will Smith, can you be my Jada?\nAnd I'm in the Oakland, Audi looking like a Raider\nWhen the Migos in your city we pack out your stadium\nIn the kitchen with the Dominican's I'm creating em'\nTrappin and dabbin', pull up at your bando with Wayne & them!\n\n[Chorus: Lil Wayne]\nShe's so amazing\nLord I feel like Plies, that's my lil' baby\nThat bitch gon kill me, that'll be crazy\nBut that's what's amazing, that's my lil' baby\nThat bitch so crazy, amazing Amy\n(Just wait on it, just wait on it)\nAnd this that Sorry 4 The Wait, Amy\n(Just wait on it, just wait on it, just wait on it)\nAnd I'm so sorry for the wait, Amy...\n\n[Outro: Quavo]\nAmazing, amazing, ohh kill me! Crazy!\nAmazing Amy! Oh! Oh!", "image": "https://images.genius.com/f95630c8a112152715baa0ba8d7febca.900x900x1.png"}], "artist": "Lil Wayne"}