{"songs": [{"title": "Killers", "album": "The Glorification of Gangster", "year": "2011-03-15", "lyrics": "[Verse 1]\nMomma, I just killed a man\nMy body still trembling, can you feel my hand?\nDon’t shed no tears, it won’t be long before they find out it was me, Momma\nThis may be the last time you see me free, Ma, don't spend it crying\nYou did your best, me, I was blessed, know you were stressed trying\nTo keep me out the streets, me, ducking police\nTrying not to make a peep to wake you up out your sleep\nA drunk and high fool\nSkipping class, flunking high school\nI know you taught me better, somehow I never learned\nSaid I was playing with fire, somehow I never burned\nYou tried to set me straight, somehow I never permed\nYou tried to show me right, but somehow I never turned\nLost in a cloud of marijuana, are you 'shamed of me?\nDry your face, Mommy, you're not to blame for me\nSee, I’m a man, I gotta take whatever came for me\nAt times I wonder ’bout my father, would it change for me if he was around?\nWould I still be running 'round with the lowlifes?\nBum ass niggas no jobs, no life\nSeen them niggas kill for no price\nI watched his life flash before his eyes like a strobe light\nI pulled the trigger, Momma\nTryna be hard, I ain't mean to kill the nigga, Momma\nBut what’s done is done\nI’m on the run, I live my life like a movie now it’s way too realer\nWho would've thought your baby boy would've grew up to be a killer?\n\n[Chorus]\nYeah, now I’m a killer\nGuess I’m a killer\nThey got me in here with the killers\nYeah, I mean the killers\n\n[Interlude: Richard Pryor]\n\"I mean—murderers! Do you hear me? Real live murderers!\nI thought black people killed people by accident!\nNah, these motherfuckers was murderers.\"\n\n[Verse 2]\nYeah\nYeah, I wonder what's in store for me, lately been stressing\nPray for blessings, hope that there’s more for me than just a simple life\nNiggas that I used to hoop with is doing triple life\nGave up the jump shot, worked on the gunshot\nWho woulda thought? I used to block this nigga's lay-ups\nNow he’s in a cell layed up, I wish you well, stay up\nLike insomniacs, this life can make a\nNigga fold like a laundry mat, I sip this cognac, though\nTo ease my brain from all this pain and so that I react slow\nIn this fast world, slow niggas, fast girls\nHo's give up ass while these ho niggas hold triggers\nBlast on ‘em, hold up that old checker flag for ‘em\nChalk lines by the do not park sign, it’s deep\nAll these cold hearted niggas holding heat\nI’d rather blast before they steal a nigga\nTell ‘em now boy, don’t make me turn into a killer, nigga\n\n[Chorus]\nYeah, into a killer\nDon’t make me turn into a killer\nYeah, to a killer, yeah yeah\n\n[Interlude: Richard Pryor]\n\"Triple life... How do you do triple life?\nThat mean if he die and come back... He gotta go to penitentiary!\nRight there, he said \"Fuck kindergarten. Get your little ass on in the penitentiary, motherfucker. You know what you did last time.\"\n\n[Verse 3]\nTo those who had love for me in the past\nWho woulda ever thought that time would fly by so fast\nI remember back in class we used to make believe\nLike it was draft day, swore that we would make the league and be rich\nSaturday morning had to rake the leaves, aw shit\nWatch how they pile up, seem like a mile up\nI washed the blisters on my hands and then I'd dial up\nMy best friend, skating rink is where we headed at night\nAnd if a nigga disrespect, oh yes, we ready to fight\nIn retrospect that shit seem petty, at the time the shit was heavy\n'Cause life was all about your name\nYou had to scrap with any nigga that would call you lame\nAshamed no doubt, so many niggas got their brains blowed out\nSnatch a niggas chain and he got his name wrote out\nIn obituaries, another body in a cemetery\nAnother young nigga in the penitentiary\nAnd he don’t give a fuck: no missionary\nRap visionary, paint a picture, nigga: Pictionary\nTell you what it is, I’m a dictionary\nI knew a nigga threw his dick in e'ry chick in e'ry\nCity that he went to, went hard like the rent due\n'Til he met the wrong bitch, man, just came\nHome ex-convict, and he stay on with that Thriller\nShit, fucking around with them killers\n\n[Outro]\nYeah, with them killers\nFucking around with them killers\nSay I’m a killer", "image": "https://images.genius.com/da371aff4b2f0665b50a2f25d8719491.700x700x1.jpg"}], "artist": "J. Cole"}