{"songs": [{"title": "Session One", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Intro: Eminem]\nLadies and gentlemen, make some noise!\nYou ready to get this shit started or what?\nAight, well I brought some friends with me too\n\n[Verse 1: Eminem]\nNow I ain't back just for the sake of just saying I'm back\nI could relax but I'd rather stack ammo on tracks\nCouple Xanax, light a couple wax candles then black\nOut and relapse 'til I yack Jack Daniels and 'gnac\nBurp bubbles, attitude's immaturin'\nDouble shot of Bacardi, party, vision is blurrin'\nWhoa-oh, I can't see shit, my words get to slurrin'\nUh-oh! You can call me R. Kelly now, you're in\nTrouble! What's occurring befo', after, and during the show\nHas no bearing on the bad news I'm bearing, whoa\nWhat is it, wordplay? No, I'm pushing you out the do'\nSo suck my dick on the couch if you wanna cushion the blow\nNow stomp your fucking feet 'til you get to squishing a ho\nIt's pandemonium, standing o when you see him, oh\nDamn baby you look good, you're giving me wood\nYou should pull over like a sweatshirt with a hood\nIt's neck work, get her polly on, you and me both\nBreak bread while I'm copping over this game to pinch a loaf\nNow homie who's your favorite pain in the ass?\nWho claims to be spitting the same flames as me? I'm Kanye when he crashed\nIn other words I got the hood on smash like I stepped on the gas\nDestroyed the front end\nDeployed the damn airbags from the dash\nWent through 'em and laughed\nCame back an hour after the accident\nAnd bit a goddamn Jawbreaker in half!\nSo stop faking the funk and start shaking your ass\nSlaughterhouse in the house with the Caucasian of rap\nAnd Just Blaze on the track, what's the fuck's more amazing than that?\nSlut, answer me that, Royce where you at?\n\n[Verse 2: Royce da 5’9”]\nI'm right here Fire Marshall, verbal pair of pliers I pry apart you\nLump on your head designed by a bar stool\nDesigned by a cartoon\nBefore I need to be hired, Jimmy I'll fire Marshall\nThe 9 tucked against the lining\nI pull it out and flip your partner upside-down\nLike y'all are a couple 69ing\nIt's like Rick James is shooting up your house, nigga!\n{rapid gunfire} FUCK YO' COUCH NIGGA!\nYou're screaming, \"Fuck the world!\" with your middle finger up\nWhile I'm over here shoving my dick in a hole in the mud\nMy bitch know I'm perfectly fit for murder\nBecause I murdered her, so you can call me\nNickel to O.J. to Glove\nI got a Posse of Insane Clowns\nBlow your brains on your opposite ear\nAnd ask you how your brain sounds\nBad, Evil, we go Alfred E. Neumann mad cerebral\nYou on your last burrito!\n(What that mean Nickel?) It's a wrap if you eating\nGet a beat then terrorize that bitch like I'm Middle Eastern\nSlaughterhouse on FIRE, nobody touching that\nGood day and good night, Ortiz, yo, where the FUCK you at?\n\n[Verse 3: Joell Ortiz]\nI'm right here in my Nike Airs, Buzz Light-years\nAhead of my mic peers, quite scary to look at a nightmare\nWhere my book at? I write fear in the heart of you tight squares\nI harbor the art of my nice wear\nIt's type weird 'cause that made me hotter than my dear\nUncle Al's breath after polishing off his ninth beer\nHomie chill, listen, I swear\nI'm God, I give tracks a Holy-feel, and they bite ears\nI'm right here, why wouldn't I be?\nJust waiting to be hooked to IV as Mumm-Ra's\nWell, when you look at my pee\nAnd this joint no exception, so just point a direction\nAnd record the pig's oink when I rip his intestine\nThis isn't just an infection\nThis won't go away with penicillin injections\nMillions of questions arose\nAfter they did an inspection, what I exhibit\nSeems to be non-contagious yet anybody can get it\nAw shiddit, I did it again, when I liddift this pen\nI emitted this phlegm, this time it's alongside Edimminem\nSo tell a friend to tell a friend write a disgusting hook\nJump in shark water and swim, yo where the fuck is Crook?\n\n[Verse 4: Crooked I]\nI'm right here letting the shotty pop, quick as a karate chop\nGet your body shot, get your top chopped, like a lollipop\nCall it Maserati drop, in the body shop\nGet your mommy knocked\nAnd your Uncle Tommy molli-wopped\nI take your life to the ninth inning\nA knife in the gunfight, I love it, me and my knife winning\nI laugh when you fall, the shit'll be funny\nI'll buy my bitch a new ass and watch her sit on my money\nMan, all the bitches holla - they wanna drop my britches\nThen jaw on my dick and swallow, leave drawers in this Impala\nI ball like Iguodala\nI bear more arms than 6 koalas\nAs soon as I draw, get sent to Allah\nBilinguist don, I kill with the tongue, I'm Atilla the Hun\nI'm Genghis Khan, I'm a genius spawn\nI pillage your village for fun, an egregious con\nA syllable gun, real as they come, Long Beach Saddam!\nSlaughterhouse equals swine flu, are South flying\nWe do it to try to do without tryin\n(Slaughterhouse!) 'Cause to it's us it's so easy\nWhere's Jumpoff Joe Beezy?", "image": "https://images.genius.com/7b93181ae4ed594c902bf7e4e2149ca7.1000x1000x1.jpg"}], "artist": "Eminem"}