{"songs": [{"title": "Take The World With Me", "album": null, "year": "1998-01-01", "lyrics": "[Intro: Pacewon]\nSome Outsidaz shit\nI started hearing laughter in my head\nSomebody laughing at me\nAlways laughing at me\nI’m ‘bout to go crazy\nSo I started to set it on niggas, nah mean?\nPacewon!\n\n[Bridge: Pacewon]\nI’m high like Redman, tripping with a tab of acid\nIn my headband (‘Bout to lose my mind)\nThe name’s Pacewon, I’ll kick that ass quickly\nWhen I die I’ma try to take the whole world with me (Me!)\nRaw rhymes, penetrate the kidney\nWhen I die I’ma try to take the whole world with me\n(I got plans to lock it down) Take it with me\nTake it with me, the whole world with me\n\n[Verse 1: Pacewon]\nYeah, I be hitting you with rude shit\nI be rolling like crews with new whips, call it stupid\nBut I mastered the fantastic ghetto bastard\nRaw rap style to kick that ass with\nRough as Brillo, nympho spreading like info\nMore than the Jacksons got kinfolk\nYour crew not strong, they stink like your mother feet\nWhen she walk in shoes with no socks on\nLight as popcorn, me! Disciplining fresh MCs\nThat you’d be scared to rock for\n\n[Chorus: Pacewon]\n(Who dat?) I’m low down and I’m shifty\nWhen I die I’ma try to take the whole worth with me\n(Me!) Most MCs get slapped ‘cause they sissy\nWhen I die I’ma try to take the whole worth with me\nTake the world, take it with me\nTake it with me, set it!\n\n[Interlude: Eminem]\nYeah! Eminem!\nDirty Dozen! Yeah!\n\n[Verse 2: Eminem (Pacewon)]\nI’m in the sound-proof booth without a roof\nDrunk off 180-proof vodka with Dr. Ruth (What!)\nWe in the vocal room inhaling Magic Markers\nSitting in the dark lighting our blunts with sparklers\nWe got my man Pacewon behind the boards\nCause we tied the engineer up with output cords (Outsidaz, what!)\nBizarre’s in the lobby with the Beatles, smoking bowls\nPoking holes in his veins with dirty needles\nWe get all doped up from popping uppers\nAnd run a train on Foxy Brown without rubbers (Uh, uh-huh, yeah)\nSmoking homegrown drugs, that’s why you can barely tell\nWhat the fuck we’re saying, like Bone-Thugs (Uh!)\nHitting blunts ’til my lungs contort, smoke\nThen take one more short toke before I snort coke (What!)\nShit, I been doing lines all day (What!)\nMy mind’s all clay from smelling Pine-Sol spray (What!)\nWhat! No, hold up, hold up, hold up (Hold up!)\nSmoking laced weed wrapped up in a fruit Roll-Up\nMy lungs are all swole-up and ‘bout to bust open\nI’m just hoping I don’t die from snorting crushed Motrin\n\n[Chorus 2: Eminem (Pacewon)]\nI need drugs, somebody fix me\nWhen I die, I’ma try to take the whole world with me (Me!)\nTwelve blunts, plus I’m bringing your girl with me\nWhen I die, I’ma try to take the whole world with me\nI’m not coming back, so don’t send no one to get me\nWhen I die, I’ma try to take the whole world with me (Gimme dat)\nFuck that, give me all my shit free\nWhen I die, I’ma try to take the whole world with me\n\n[Verse 3: Bizarre (Pacewon)]\nWack MCs, there’s a new sheriff in town\nPut your guns down or die with a ill frown\nThe Outsidaz doing uppers and downers (Uh-huh, yeah)\nClowners, even masters scared to hang around us (Ugh!)\nI’m a slob that don’t have a job (What!)\nPeek through your windows, steal the good from your mom (Ma!)\nWe the starters, y’all niggas hit the benches\nSmacking more hoes than Joe Jackson at feminine convention\nCop some mushrooms, I just can’t see\nPull me out the bathroom, I’m ‘bout to OD (D!)\nNasty, dirty, some say I’m filthy\nEvery time I drop the rap, Outs be like… (Ill, B!)\nBrain’s too high, have no fear\nEat the pussy of a girl with burning gonorrhea\nI made a box with a thugger on DD\nOur crew’s more stupid on wax than Cowdy from Lion King\nWho’s the big guy high off chocolate kai\nIf you disrespect me, you’ll lyrically die (Die!)\n\n[Chorus 3: Bizarre (Pacewon)]\nSomebody hide me, somebody get me\nWhen I die, I take the whole world with me (Me!)\nI’m ‘bout to do your girl named Cindy\nWhen I die, I take the whole world with me (Lockin' it down!)\nYou bomb my set, I give her Good-N-Plenty\nWhen I die, I take the whole world with me\nYou know my flow is so ill\nMCs on the microphone and get verbally killed (Killed!)\n\n[Outro: Pacewon]\nAll y’all niggas’ll get killed\nFucking with the Dirty D\nPacewon up in this motherfucker\nAll motherfuckers better act like they know\nYou MC, I don’t give a fuck where you from\nClose to me or far from me\nI’ma see your wack ass\nPacewon! Pacewon!", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}