{"songs": [{"title": "One Last Cigarette", "album": "Till Death Do Us Part", "year": "2004-03-23", "lyrics": "(Fuck you motherfucker!  Untie me from this chair man\nYou better untie me from this chair nigga\nYou know who the fuck I am, I will have you killed nigga!\nYou better untie me motherfucker, fuck y'all motherfuckers man!\nDo you know who the fuck I am?)\n\n{*beat drowns out the voice as a Cypress Hill member speaks*}\n\nRight {*duct tape being unrolled*}\nSho' you right\nYou want a cigarette nigga?\n\n[B-Real]\nYou was a good kid, your parents musta loved you\nThey got you out of trouble no matter how big the bubble\nThey gave you everything, nah you never needed nothin'\nWe used to get high, 'member we was weeded cousin\nWe used to go to clubs, blaze it up and act crazy\nWhat made you turn around, was it drugs or your lady?\nWe had good times, committin' hood crimes\nWe drew lines but you never understood mine\nYou don't go fuckin' homies, just like my momma told me\nI held my hood up boldly, you were a fuckin' phony\nI guess it manifested when I got the call early\nThey said you bunkered down in the hood with ol' girly\nShe had your back covered, but that didn't matter did it?\nI know you're livin', but you put your fuckin' self in it\nDon't try to make a move, nigga don't go fuckin' 'dere\nI know you're hurtin' cause you're tied up to the fuckin' chair\nYou never loved your family, you robbed that mall gladly\nThey tried to love you sadly, you let 'em down badly\nJust call me Death's angel, but we were never strangers\nYou 'bout to get mangled, that's truer than Kurt Angle\nNow it's time to pay, any last words to say?\nI know your mind strays, son I think you need to pray\nDon't even need to tell you, you were a smart nigga\nSave your teardrops, yo don't even start nigga\nYou shoulda thought of that long ago before you fucked me\nYou dodged me long enough, homey now you been lucky\nBut now it's pay the piper, no fuckin' traps or snipers\nJust the gas and lighter, caught up in the web of spiders\nBut now you get devoured, burnin' in the flames you coward\nThis is the very hour, I send your family flowers\nI'm sure they all will miss you, but they will be good without you\nThey'll reminisce and light a candle as they talk about you\n\n[Cypress Hill]\nRelax... no no it's okay\nLet me give you a light {*muffled: \"Oh SHIT!\"*}\n\n{*flames roaring, a voice screaming*}\n\nThat's my favorite fucking song..\n\n{*in the background, \"Pigs\" by Cypress Hill plays*}\n\n[B-Real]\nThis pig harassed the whole neighborhood\nWell this pig worked at the station\nThis pig he killed my Homeboy\nSo the fuckin pig, went on a vacation\nThis pig he is the chief\nGot a brother pig, Captain O'Malley\nHe's got a son that's a pig too\nHe's collectin pay-offs from a dark alley\nThis pig's known as a narco..\n\n{*music fades*}", "image": "https://images.genius.com/bbdbef4d71e94241d00e6cf766f68925.640x640x1.jpg"}], "artist": "Cypress Hill"}