{"songs": [{"title": "Successful", "album": "So Far Gone", "year": "2009-02-13", "lyrics": "[Intro: Trey Songz]\nThe money (Money), cars (Cars)\nThe clothes (Clothes), the hoes\nI suppose\nYeah\n\n[Chorus: Trey Songz]\nI want the money (Money), money and the cars\nCars and the clothes (Clothes), the hoes\nI suppose\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\n\n[Verse 1: Drake]\nDrizzy\nAw yeah, Trey, I fuckin' feel ya\nThey be starin' at the money like it's unfamiliar\nI get it, I live it, to me there's nothin' realer\nJust enough to solve your problems, too much'll kill ya\nAnd when I leave, I always come right back here\nThe young spitter that everybody in rap fear\nA lot of y'all are still soundin' like last year\nThe game need change and I'm the motherfuckin' cashier\nNickels for my thoughts, dimes in my bed\nQuarters of the kush shape the lines in my head\nTake my verses too serious, you'll hate me\n'Cause I'm the one to paint a vivid picture, no HD\nYeah, I want it all, that's why I strive for it\nDiss me, you'll never hear a reply for it\nAny award show or party, I get fly for it\nI know that it's comin', I just hope that I'm alive for it\n\n[Chorus: Trey Songz]\nI want the money (Money), money and the cars\nCars and the clothes (Clothes), the hoes\nI suppose\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\n\n[Verse 2: Drake]\nYeah, I want things to go my way\nBut as of late, a lot of shit been goin' sideways\nAnd my mother tried to run away from home\nBut I left something in the car and so I caught her in the driveway\nAnd she cried to me, so I cried too\nAnd my stomach was soakin' wet, she only 5'2\"\nAnd 40, that was all before I showed up\nAnd brought a thousand dollars worth of drinks and got poured up\nDamn, my reality just set in\nAnd even when the Phantom's leased, them hoes wanna get in\nI do a lot of things hopin' I never have to fit in\nSo tryna keep up with my progress, it's like a dead-end\nMy girl love me, but fuck it, my heart beats slow\nAnd right now the tour bus is lookin' like a freak show\nAnd life change for us every single week, so\nIt's good, but I know this ain't the peak though 'cause I want the:\n\n[Chorus: Trey Songz]\nI want the money (Money), money and the cars\nCars and the clothes (Clothes), the hoes\nI suppose\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\n\n[Interlude]\nAlright well, um, alright. We... we'll fuckin' figure it out. You know what you—you know what you're doin' with it, you know, makin' it to the top. All the way to the top. Yeah, you do it for the money, and not the honey, you know what I'm sayin'? You know what I'm sayin'?\n\n[Verse 3: Drake]\nWise words from a decent man\nBack when I was trying to put a ring on Alisha hand\nThis lost boy got fly without Peter Pan\nAnd my delivery just got me buzzin' like the pizza man\nIn-person I am everything and more\nI'm everywhere these other niggas never been before\nBut inside I'm treadin' water, steady tryna swim to shore\nI'm on a shopping spree to get whatever is in store\nYeah, just call me \"Shoppin' Bag Drizzy\"\nOr call me Mr. \"Damn, he ain't coppin' that, is he?\"\nAnd fans of the freshman is about to get iffy\nWhile this youngin that you doubted is about to get busy\nI'ma kill it, I promise, that's how I know you're mad\nI've always treated my city like some shoulder pads\nThe big homie, use a flash if you must\nAnd I swear I ain't askin' for much, all I want is the...\n\n[Chorus: Trey Songz & Drake]\nYeah, I want the money (Money), money and the cars\nCars and the clothes (Clothes), the hoes\nI suppose\nI just wanna be (Yeah), I just wanna be successful (That's all I want, man)\nI just wanna be, I just wanna be successful (You gotta tell 'em, Trey)\nI just wanna be, I just wanna be successful\n\n[Interlude: Drake]\nYeah, it's like I, it's like I know what I gotta say\nI just don't know... how to say it... to you\n\n[Verse 4: Lil Wayne]\nUh, pardon the swag, but bitch, it's Car-tey\nLong bread, I don't eat shortcake, how come I can't\nMiss a woman like I can't miss court dates\nCheese, but she's not in this portrait\nAnd yeah, life's fine, but I don't portray\nI'm on the other side, but it is a short gate\nI don't want the glow, I want the glo-ray\nAnd I'ma fuck the world, but this is just foreplay\nTired of hearin' bullshit, bring on the cow shit\nHaven't met a smell that's stinkier than our shit\nAnd that's word to Toronto\nSo high up, I got birds in the condo\nHa, ain't that a female dog?\nAsk her who I am to her, and she yell, \"God\"\nWeezy Baby, I go re-al hard\nNo further details, boy", "image": "https://images.genius.com/e6d16557db79cb89041b46da0197960a.600x600x1.jpg"}], "artist": "Drake"}