{"songs": [{"title": "Baby Baby", "album": "The Infamous Archives", "year": "2007-03-13", "lyrics": "[Samples]\n\"Shot fired\"\n\"Give it up\"\n\"That's right, everythin' B\"\n\"You gotta\" - \"Give it up\"\n\"Yea, well\"\n\"It looks like they gon' fight too\"\n\"It's serious\"\n\"Give it up\"\n\"Yo hold up dawg\"\n\"Everythin' B\"\n\"Give it up\"\n\n[Prodigy]\nAyo it's 52 states and we hittin' all of them\nParty e'yday, hotels suites and shop\nThey eatin' food like Kings, Barbarians rather\nWe corner stray Vultures cause we all savage\nGoin' Apes on the chicks, we did the girls foul\nBut they likely gon' bananas on the stage\nWit madd bottles or the Henny rock, the crowds gon' crazy\nAyo there's million fifty-two dimes, you can't hit all of 'em\nJust get you a nice ass boo and you'll be on dunn\nBut y'all niggas so thirsty 'til that Virus bite you on your ass is dirt\nI seen people die Aids my Pops is one of them\nI seen people get clipped with shots that were sprayed\nAnd that hell fire blaze, cause people wanna throw all their weight\nOnly the Creator know what took place\n\n[Hook: Prodigy]\nAy baby? Ga'head make me rip baby\nMadd bullets in your shit baby\nPlus you get stomped in baby, babe-babe-baby-baby\nSay baby? Get your mind off me baby\nKeep your mind on your ring baby\nAnd bets stay where you be baby, babe-babe-baby-baby\n\n[Prodigy]\nWhy I need madd guns? When my nine worth fine, my AR's plus\nThey talkin' 'bout vestin' up, nigga come how you want\nI got some for you fucks, I don't black out\nI pull conscious murder, I'm perfectly insane and fully aware I'm hurtin'\nSumtin'\nIt could pop off 24-7, it's nobody safe, its no one for help\nYou gotta go through your own things\nHandle your shit; make your own gun ring\nMe? - You better send nines, I'mma shoot the first .4-5 Mary J Blige\nR&B niggas, they singin' the blues cause we more uppin' them niggas baby\nYou fuckin' wit the wrong set of dudes\nBut my songs speak for itself, the choices is on you\n\n[Hook: Prodigy]\n\n[Samples]\n\"Eh-huh\"\n\"Eh-huh\"\n\"Give it up\"\n\"Eh-huh\"\n\"Eh-huh\"\n\"Give it up\"\n\"Eh-huh\"\n\"Eh-huh\"\n\"Give it up\"\n\"Eh-huh\"\n\"It looks like they gon' fight too\"\n\"It's serious\"\n\"Give it up\"\n\"Eh-huh\"\n\"Eh-huh\"\n\"Give it up\"", "image": "https://images.genius.com/cb51383ec91030d5e17e2b134d0e8477.1000x1000x1.jpg"}], "artist": "Mobb Deep"}