{"songs": [{"title": "Here Comes Tecca Nina", "album": "Absolute Power", "year": "2002-09-24", "lyrics": "[Intro: Krizz Kaliko]\nMessage marked urgent\nHey, hey, hey\nWhat's sizzlin' everybody\nNorth side, south side, east and west\nI'd like to welcome everybody to Absolute Power baby\nThis is Big Krizz Kaliko recordin' from Kansas City, Missouri\n'Bout to world premiere another one of those other ones\nFrom that psycho y'all know and love, my nigga\nTech N9ne!\n\n[Verse 1: Tech N9ne]\nI be bustin' (bustin')\nParents be fussin' and cussin'\n'Cause all I talk about is silicone and muffins (muffins)\nSo if you didn't come to hear some strips clubs hits\nThen get the hell on 'cause I'm gettin' my mail on, I'm hustlin'\nI'm talkin' about foes and I'm talkin' about fans and kitties\nI'm talkin' about hoes and I'm talkin' about Kansas City\nThat's where I dwell with- with my- my Vills\nAnd I- I- I will pop hot rocks for real\nVenomous, when it gets hot\nThe Tech straight killin' hatas, when it gets rock\nThe sex rates ten, I made her sit on this jock\nSpits quick game innovator\nChick generator, quick trip James Lemonader\nThis is the beginnin' of blingin' and houses and women\nWelcomin' angels and demons on couches and sinnin'\nI'm alive and well, the demise will bring ghost stories\nWhen I rise in hell them alive will still vote for me\n\n[Hook]\nWatch out 'cause here comes Tecca Nina\nRoll out 'cause here comes Tecca Nina\nDrop down 'cause here comes Tecca Nina\n(You are now rocking with the best, Tech N9ne!)\nHere comes Tecca Nina\nHere comes Tecca Nina\nWatch out 'cause here comes Tecca Nina\nRoll out 'cause here comes Tecca Nina\nDrop down 'cause here comes Tecca Nina\n(You are now rocking with the best, Tech N9ne!)\nHere comes Tecca Nina\nHere comes Tecca Nina\n\n[Verse 2: Tech N9ne]\nBanzai, baby every one's high\nSmokin' and drinkin' and poppin' so hurry come fly\n'Cause I got plenty rolls, and I got plenty dough\nAnd we got plenty hoes, we roll on 24s\nWhat it is? What it was? What it shall be?\nWhat the blizz? Where the ale? Where the belve?\nCaribou Lou is 151 and Malibu Rum and pineapple\nSo what's this weakness you tryna sell me?\nI represent the Rogue Dog Villain niggas\nBetta repent, the foes all feelin' triggas\nYou got me bent, we rolls all peelin' skrilla\nRoll call Villian killas, froze y'all fill in millas\nThis be the best time, to bust ya best rhyme\nYou bring ya best rhyme, I'm on yo next line\nAnd when I flex mine, I see respect signs\nCall the request line, and just say Tech N9ne!\n\n[Hook]\nWatch out 'cause here comes Tecca Nina\nRoll out 'cause here comes Tecca Nina\nDrop down 'cause here comes Tecca Nina\n(You are now rocking with the best, Tech N9ne!)\nHere comes Tecca Nina\nHere comes Tecca Nina\nWatch out 'cause here comes Tecca Nina\nRoll out 'cause here comes Tecca Nina\nDrop down 'cause here comes Tecca Nina\n(You are now rocking with the best, Tech N9ne!)\nHere comes Tecca Nina\nHere comes Tecca Nina\n\n[Verse 3: Tech N9ne]\nThey call me Tecca Nina, that be my nick name\nI often wreck arenas, most of 'em chicks man\nSpoil us with checks and Visa, that's how we spit game\nHavin' her bless the weiner, I love to get brain\nFour chicks in the back of the truck\nBackin' it up, suckin' on tongues, laughin' it up\nGassin' at Kutt, bustin' her bun, slappin' it up\nQuick wrappin' it up, get thrust with no funds then passin' the butt\nAbsolute when I shoot the shit\nJuice the chicks with flows that you used to get\nTake 'em to Adam's house, gon' ride 'em out\nOr take 'em down to Wes' get breastes up in ya face\nAnd scat 'em out\nMake room for the crew with beats that thump\nI got the sickness horny chicks mighty mine be\nStraight doom for the crew that skeet like chumps\nI bring 'em six-six triple eight forty-six ninety nine three\n\n[Hook]\nWatch out 'cause here comes Tecca Nina\nRoll out 'cause here comes Tecca Nina\nDrop down 'cause here comes Tecca Nina\n(You are now rocking with the best, Tech N9ne!)\nHere comes Tecca Nina\nHere comes Tecca Nina\nWatch out 'cause here comes Tecca Nina\nRoll out 'cause here comes Tecca Nina\nDrop down 'cause here comes Tecca Nina\n(You are now rocking with the best, Tech N9ne!)\nHere comes Tecca Nina\nHere comes Tecca Nina", "image": "https://images.genius.com/ea1b18b9f2a531bddd610223719d1371.600x600x1.jpg"}], "artist": "Tech N9ne"}