{"songs": [{"title": "Don’t Shoot", "album": "Along Came Joyner", "year": "2015-04-05", "lyrics": "Dear America\n\n[Verse 1]\nBy the system I was raised\nSame system that enslaved us and took us all away\nSame same system I was trained to put my hands across my heart and pledge allegiance to the grave\nThe same system that made me sing the national anthem\nWhile the fucking flag hanged\nThe same system that'll claim innocent lives\nBarack ain't made shit change\nNigga fuck this shit, I won't budge!\nShit, I won't budge\nThey say Rosa Parks was sitting on the wrong bus\nAnd now that Malcolm X is gone, I guess it's on us\nFuck a cop, they gon' kill us then they charge us\nThey gon' charge us\nPull that fucking badge out and say it's all love\nBut I got six warning shots to my heart, lungs, face, neck, cough blood\nNow they say we all thugs\nI guess we all thugs\nEver since the Watts Riots, motherfuckers wanna try us\nEverything was all quiet til they crossed us\nAl Sharpton keep on talking, nigga do something!\nNigga prove something\nSo much drama, I just got the fucking goosebumps\nWord down to Ferguson, they murderin' the youth young\nWhat the fuck is new, son\nThis shit gon' make me lose some'n\n\n[Hook]\nThis a war we won't back down\nFuck this country, we ain't treated fair\nI should burn the fucking flag down\nYeah, I should burn the fucking flag down\nBut your victims lash out, they have no clue\nBut if I protest, a nigga'll put me in a stretcher\nGun me down with my hands up screamin' \"DON'T SHOOT!\"\nMotherfucker, don't shoot!\n\n[Verse 2]\nBy the system I was raised\nSame system that just killed Mike Brown the other day\nSame system that just slayed Sean Bell, Trayvon, Eric Garner, what a shame!\nThe same system that gon' lie just to cover up the crime, quick to send us to the grave\nThe same system that'll claim innocent lives\nBarack ain't made shit change\nNigga, fuck this shit, I won't budge!\nShit, I won't budge\nThey say Emmitt Till whistled at the wrong slut\nAnd now that Martin Luther gone, I guess it's on us\nFuck the cops, they gon' kill us then they charge us\nThey gon' charge us\nPull that fucking badge out, leave a nigga passed out\nCLAP PLOW twenty shots to my heart, lungs, face, neck, cough blood\nAll they do is cross us\nLiving in the projects, and we all thugs\nNow they searchin' through my pockets\nWanna treat me like a hostage\nTryna get inside my conscious like a broad does\nIf they catch me lookin' wrong, I'm a rebel though\nIf I got my hoodie on, I'm a criminal\nIf I got my hands up, that means I probably got a weapon\nIf they kill me, then I guess that means that it was an exception\n\n[Hook]\nThis a war we won't back down\nAnd tell the government to kiss my ass\nI should burn the fucking flag down\nYeah, I should burn the fucking flag down\nWe were forced to surrender, they have no clue\nBut if I protest, a nigga'll put me in a stretcher\nGun me down with my hands up screamin' \"DON'T SHOOT!\"\nMotherfucker, don't shoot!", "image": "https://images.genius.com/e0f1ef72a727167faed7990bf3663ea4.800x800x1.jpg"}], "artist": "Joyner Lucas"}