{"songs": [{"title": "We Know", "album": "The Beautiful Struggle", "year": "2004-09-28", "lyrics": "[Intro: Talib Kweli]\nHey Y'all\nI feel good right? (mmm...hmmm...)\nYeah, ok, uhh..\nNow what that make me talk about?\nLove, love, love, love...(echoes)\nYeah, that's what the world need, ha\nYo, that's what your girl need\nAll right, we gon' put it down like this\nI'll tell you about myself\n\n[Verse 1: Talib Kweli]\nMy name is Kweli and I love to spit it homie\nI rap about love and life, ladies get to know me\nIf you feelin' lonely, I can be your one and only\nI put it out in the world, so people show me... love (echoes)\nYeah, I always get it back\nThis ain't no pimp game here, that's a different track\nWe talkin' this and that, we need to get with this\nI keep it realer than most, this is our business\n\n[Hook: Faith Evans]\nWhat we gotta do to make them see\nWe got a good thing going on\nWanna tell the world if they don't know\nThat what we have is real\nWanna shout it from the mountains baby\nThat I love you, but if they don't hear me\nI know, you know, we know\n\n[Verse 2: Talib Kweli]\nYo, hey baby look like you need a break tonight\nLet me make it right, baby won't you stay the night\nI got a lot of love as you know you're my favorite right?\nHey my lady, what we gon' make tonight (our love...)\nThat's the dream, but I never sleep\nAcross the crowded room, our eyes forever meet\nBut without doubt and gloom, cuz we can never be\nThat's why I got to go, cuz you're my impossible love\nYou're the horizon I can see but never ride off into\nI write my lyrics to you, you the perfect instrumental\nI sound better than the cat who rappin' to you now\nThat's between me and you, what happened to us now?\nGot you hopin' for the glorious\nWaitin' for that victorious feelin' wanted by all of us\nKneelin' and praying that the lord in us will help us love ourselves\nSo much that the confidence attract to someone else\n\n[Hook]\n\n[Verse 3: Talib Kweli]\nYo, Rockin' Los Angeles, House of Blues in Sunset\nPerformin' like an orgasm, my girl ain't even cum yet\nSeen her by the side of the stage givin' me energy\nPotentially, wife material connectin' mentally\nI felt like heaven sent for me, you're meant for me\nThe doubters and the haters had to acknowledge eventually\nYou was a non-believer too if memory serves\nAnd a heart that gives shit, tryin' to play your boy for the her\nThe harder that I run to you, the farther you become\nIt's like my heart was part of some movie that hadn't yet begun\nThis woman moves me and I'm a mountain of a man\nYou pull me in like the waves do the grain of sand (love, love, love...)\nYeah, I love the way you bring it to me\nI wrote a song for you, I love to hear you to sing it for me\nAnd let the melody carry me through the jealousy\nAnd we can cruise like Tom and Penelope\n\n[Hook x2]", "image": "https://images.genius.com/621202e462c9992659e0beea9b8fe5f9.320x317x1.jpg"}], "artist": "Talib Kweli"}