{"songs": [{"title": "God Is Cleaning Out My Closet (Religious Remix)", "album": "Straight from the Lab", "year": "2003-11-07", "lyrics": "[Intro: Groove Coverage]\nGod is a girl!\n\n[Verse 1: Eminem]\nYo, yo, yo, yo\nHave you ever been hated or discriminated against?\nI've been protested and demonstrated against\nPicket signs for my wicked rhymes, look at the times\nSick as the mind of the [motherfuckin'] kid that's behind\nAll this commotion, emotions run deep as oceans, explodin'\nTempers flarin' from parents, just blow 'em off and keep goin'\nNot takin' nothin' from no one, give 'em hell long as I'm breathin'\nKeep kickin' ass in the morning and takin' names in the evenin'\nLeave 'em with a taste as sour as vinegar in they mouth\nSee, they can trigger me, but they'll never figure me out\nLook at me now! I bet you're probably sick of me now\nAin't you, Mama? I'ma make you look so ridiculous now!\nLook so ridiculous now, look so ridiculous now\nLook so ridiculous now, make you look so ridiculous now\nNow, now, now, now, now, now...\n\n[Verse 2: Groove Coverage]\nRemembering me, discover and see\nAll over the world, she's known as a girl\nTo those who are free, their minds shall be keep\nForgotten as the past, 'cause history will last\n\n[Chorus: Groove Coverage]\nGod is a girl, wherever you are\nDo you believe it? Can you receive it?\nGod is a girl, whatever you say\nDo you believe it? Can you receive it?\nGod is a girl, however you live\nDo you believe it? Can you receive it?\nGod is a girl, she's only a girl\nDo you believe it? Can you receive it?\n\n[Verse 3: Eminem]\nHis palms are sweaty, knees weak, arms are heavy\nThere's vomit on his sweater already: Mom's spaghetti\nHe's nervous, but on the surface he looks calm and ready\nTo drop bombs, but he keeps on forgetting\nWhat he wrote down, the whole crowd goes so loud\nHe opens his mouth, but the words won't come out\nHe's choking, how? Everybody's joking now\nThe clock's run out, time's up, over—blaow!\nSnap back to reality, there goes gravity\nThere goes Rabbit, he choked, he's so mad but he won't\nGive up that easy, no, he won't have it, he knows\nHis whole back's to these ropes, it don't matter, he's dope\nHe knows that but he's broke, he's so stagnant, he knows\nWhen he goes back to this mobile home, that's when it's\nBack to the lab again, yo!\n\n[Interlude: Eminem]\nOne shot, or one opportunity\nTo seize everything you ever wanted, in one moment\n\n[Verse 4: Eminem]\nI got some skeletons in my closet\nAnd I don't know if no one knows it\nSo before they throw me inside my coffin and close it\nI'ma expose it; I'll take you back to '73\nBefore I ever had a multi-platinum-selling CD\nI was a baby, maybe I was just a couple of months\nMy [faggot] father must have had his panties up in a bunch\n‘Cause he split, I wonder if he even kissed me goodbye\nNo, I don't, on second thought, I just [fuckin'] wished he would die\nI look at Hailie, and I couldn't picture leavin' her side\nEven if I hated Kim, I'd grit my teeth and I'd try\nTo make it work with her at least for Hailie's sake\nI maybe made some mistakes\nBut I'm only human, but I'm man enough to face 'em today\nWhat I did was stupid, no doubt it was dumb\nBut the smartest [shit] I did was take the bullets out of that gun\n‘Cause I'da [killed him, shit], I woulda shot Kim and him both\nIt's my life, I'd like to welcome y'all to The Eminem Show\n\n[Chorus: Groove Coverage]\nGod is a girl, wherever you are\nDo you believe it? Can you receive it?\nGod is a girl, whatever you say\nDo you believe it? Can you receive it?\nGod is a girl, however you live\nDo you believe it? Can you receive it?\nGod is a girl, she's only a girl\nDo you believe it? Can you receive it?\n\n[Verse 5: Eminem]\nNo more games, I'ma change what you call rage\nTear this motherfuckin' roof off like two dogs caged\nI was playin' in the beginning, the mood all changed\nI've been chewed up and spit out and booed off stage\nBut I kept rhymin' and stepped right in the next cypher\nBest believe somebody's payin' the Pied Piper\nAll the pain inside amplified by the\nFact that I can't get by with my nine-to-\nFive and I can't provide the right type of life for my family\n'Cause man, these goddamn food stamps don't buy diapers\nAnd there's no movie, there's no Mekhi Phifer, this is my life\nAnd these times are so hard, and it's gettin' even harder\nTryna feed and water my seed, plus teeter-totter\nCaught up between bein' a father and a prima donna\nBaby mama drama, screamin' on her, too much for me to wanna\nStay in one spot, another day of monotony's\nGotten me to the point I'm like a snail, I've got\nTo formulate a plot or end up in jail or shot\nSuccess is my only motherfuckin' option—failure's not\nMom, I love you, but this trailer's got\nTo go; I cannot grow old in Salem's Lot\nSo here I go, it's my shot: feet, fail me not\nThis may be the only opportunity that I got\n\n[Outro: Groove Coverage]\nGod is a girl!", "image": "https://images.genius.com/8dd03ebbf724e2b4d4bafbddf8c3c2f1.1000x1000x1.png"}], "artist": "Eminem"}