{"songs": [{"title": "Train food", "album": "SKINS", "year": "2018-12-07", "lyrics": "[Chorus]\nI remember I had walked home that day\nContent with all my misery\nTold myself it'd get better, no clue what there was next for me\nRemember there was people, walkin', talkin' in the distance\nI was dressed for winter weather\nBut the summer rays were kissing me, I—\nI was lost\n\n[Verse 1]\nSo I took a different path\nIn the distance he awaited me\nHad no weapon, I'm guessin' his hands were just enough for me\nWas no question, I'm guessin' he laughed just at the sight of me\nI was lost\n\n[Chorus]\nI remember I had walked home that day\nContent with all my misery\nTold myself it'd get better, no clue what there was next for me\nRemember there was people, walkin', talkin' in the distance\nI was dressed for winter weather\nBut the summer rays were kissing me, I—\nI was lost\n\n[Verse 2]\nAnd there he was, his presence was alarming\nAs he approached, was casual, we talked 'bout self-harming\nHe told me, \"Kid, you shouldn't be walkin' on your own\"\nHe smiled and laughed, and pat my back\nHe asked, \"How far are you from home?\"\nI said, \"Maybe 30 minutes\"\nHis frequency distorted quick, I seen it in his image\nI should've run right fucking there, a—\n\n[Instrumental Interlude]\n\n[Verse 3]\nYou ever woke up on a train track, with no motherfuckin' clothes on?\nDeath before your eyes, you prayin' to God, but ain't no response\nTryna scream for hope, just a shoulder that you can lean on\nBut ain't nobody comin', so you scream on and scream on and scream on\nWhile this evil fuck laugh at you\nTrain getting closer, you still surprised that he battered you\nTears falling harder and harder, minutes get minuscule\nCould've had a son or a daughter, now what you finna do?\nYou finna die here on this train track\n'Cause clearly after death, ain't no way you can find your way back\nThinking 'bout your previous memories, going way back\nAll them fucking dreams 'bout a diamond chain and a Maybach\nNow your time finally up\nAsk yourself this final question, is you going down or up?\nRecollectin' all the moments that you never gave a fuck\nNow it's here, death has now arrived, time's finally up", "image": "https://images.genius.com/73cc940e45f93f3af1dc1af076f965cd.1000x1000x1.jpg"}], "artist": "XXXTENTACION"}