{"songs": [{"title": "Rubberband Man (remix)", "album": null, "year": null, "lyrics": "[Intro - T.I.]\nIs that T.I. over there? is that him?\nIs that you? Rubber Band Man\nBoyyyyyy..... is that T.I.? Whoooo..\nHey, hey, hey, hey, hey, hey\nHey, hey, hey, hey, hey, hey\nRemix Playa, yeah, y'all already know what it is man\nT.I.P, came from the south, Rubber Band man boyyyyy...\nConnected with my folk from the West Mack\nMy folk from the Chi' Twista\nAnd T Double D, from the bottom\n\n[Hook - T.I.]\nRubber Band man, wild as the Taliban\nNine in my right, forty-five in my other hand\nI'm in trouble man, always in trouble man\nWorth a couple hundred grand\nChevy's all colors man, who I'm isss...?\n\n[Verse One - T.I.]\nI'm young pimpin', way out of ya vision\nDon't set your sights on my position, I'm way out ya division\nI was grindin' while you was tryin' to figure out your division\nI'm sittin' on the block and watchin' hustlas makin' and killin'\nUntil I, jumped in the game without my uncle's permission\nMakin', solvin' my family's wishes through whatever conditions\nI'm workin' trappin' servin' kitchens with intentions to get in\nMy mittens under cover millions workin' off of comission\nEveryday I'm on a mission with heavy haters so listen\nDivide it, flip it, weigh and ship it, 'til you cook it and sniff it\nWhen I talk, G's listen they can see\nI been livin' the same, life that I'm spittin'\nI ain't frontin' and trippin'\nI came, out of the trap I ain't come here to visit\nI named the album Trap Muzik 'cause I'm being specific\nTo my niggas still investin' in caine\nI'm wearin' rubber bands just out of respect for the game\n\n[Verse Two - Mack 10]\nI got that wizerk, dawg i got them birdies that don't chizerp\nWater ex pills sticky green and the purple sizerp\nAnd no matter where I'm at, is west coast or up front\nI'm low key I can't stunt and move a hundred bricks a month\nIn the east they like my swagger, them broads be up on me\nIn the south they love me, cause I'm down and dirty homie\nAnd if you get it how you live as a gangsta then stand up\nMack10 a 'D boy', so my cash is rubberbanned up\n\n[Hook - T.I.]\nRubber Band man, wild as the Taliban\nNine in my right, forty-five in my other hand\nI'm in trouble man, always in trouble man\nWorth a couple hundred grand\nChevy's all colors man, who I'm isss...?\nRubber Band man, wild as the Taliban\nNine in my right, forty-five in my other hand\nI'm in trouble man, always in trouble man\nWorth a couple hundred grand\nChevy's all colors man, who I'm isss...?\n\n[Verse Three - Trick Daddy]\nI represent for the Tre-o-five\nDown with the rubberband man, y'all call him young T.I\nSee I been an O.G., far from O.D.'n and this is\nT double D don't even call me Maurice, now listen\nMy description is tall, dark, skinny, and ill-mannered\nA hood negro with a little bit of spanish be like\nSay yo papi, I got, yayo papi if\nYour price is right come on down and y'all copy\nWatch me, I'm gettin' money like it's 1984\nGot so much cash Bill Gates could kiss my ass (yeah)\nI'm such a player they call me Juan Pierre\nBeen ballin' since my younger years like ya boy Cabrera\n\n[Verse Four - Twista]\nI'm a windy city man\nThe one that take sip and run it to the brain\nLove to get it crunk in the south where\nMy cousins from, and shawty shake that thang\nTake the hipno' to the dome, smokin\nWhen im rollin, wood on chrome\nThump if it ain't Kamikaze or\nTrap Muzik then i dont put it on\nWhen im on the court call my pacman\nYell out that i got that dro', watchin for that po'\nYou can get that Jag for a hundred but\nIm givin out the ounces for fo', let a nigga kno'\nCall me the rain man from the place\nWhere they gang bang\nWhere them thangs bang, and the brains hang\nWhere we gotta main-tain\nCan I cutt and hit it girl, come on let me get it get it girl\nI love the girls from New Orleans, to ATL\nTo St. Louis, and the \"the Windy City\"girls\nBlow fire man, when that hoe slide down\nThe pole like a fireman\n\n[Hook - Twista]\nI'm the Slow Jam man, rollin' wit' the rubber band man\nDesert Eagle in my right, with a Three Fifty-seven off in my other hand\n(Who I'm isss..) I'm in trouble man, always in trouble man\nWorth a couple hundred grand\nChevy's all colors man, who I'm isss..?\n\n[Hook Until Fade - T.I.]", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}