{"songs": [{"title": "One Four Love Pt. 2", "album": null, "year": null, "lyrics": "[Shyheim]\nThe precinct is crooked, my man got grabbed up\nHad cracks on him worth about a bullet\nThey just took it, asked him questions like, \"Where's the guns?\"\nThey tried to cheat him to tell them where was Un\nThe God ten deep in a red fifteen passenger\nGuns out when they jumped out, pointed at us\nHere comes, what they call a procedure\nSlammin us against a gate, cuffin us before they beat us\n\n[Channel Live]\nIt's like they can't trust us, they wanna bust us\nAnd crush us, they sayin f' us, there's no peace, no just-us\nThey claim to protect us, they serve and they wreck us\nNever respect us, arrest us and always stress us\n\nTo see the Devil die is my purpose of to live up\nSelf-determinance is the must, I practice Kool G jog-a-leos\nFree your mind and yo *bitch* is sure to follow\nAnd free will come to lock it down, look out for tips thats hollow\n\n[Wise Intelligent (of Poor Righteous Teachers)]\nIt's P.I.T. supreno\nMix it down, dedicated to Steve Feliciano\nDirectored that steam and gouge Danno\nF' the five-oh pronto, cuz I know\nFirst head to take the white and burst lead\nNever did but might have to do it\nLies twenty-five, hollow shots in a pro-active unit\n7-A, M-J, stop the BS movement, that's how we do it\nMobilize the people, conscious *niggas* get to it\n\n[Chorus: Mos Def (of Black Star)]\nMy people unite and let's all get down\nWe got to have one love, peace and understandin\nOne God, one love, one life\nOne aim, one voice, one fight\n\n[Chorus 2: Mos Def]\nMy people unite, hop up and do a right\nWe got to have one love, peace and understandin\nOne God, one love, one life\nOne aim, one voice, one fight\nMy people unite, hop up and do a right (echoes)\nKeep it tight y'all, do it right y'all\n\n[Cappadonna]\nYo, forget police brutality, I worked for a salary\nAnd did time for a crime I didn't commit\nThey tried to beat me in my head, make a brotha submit\nHit me in the face with sticks, lockin me down for bein around\nStill remember, never surrender into the beast\nThe man, peace for Diallo\nMy reality is to fight back police brutality\n\n[Crunch Lo (of Othorized F.A.M.)]\nMr. Officer got my trapped in a dark corridor\nLong hallway, they in luck with the gunplay\nSwing knight sticks, run thicker than Bloods and Crips\nHarass mad cats and it don't make sense\nRoll around in dark tints, fiendin to match finger prints\nSearch me down everyday and you still ain't content\n\n[Rock (of Heltah Skeltah)]\nOh-oh-oh-oh\nCalm your nerves down, bop your heads too high\nLet 'em know Rock, stop wonderin why you keep gettin knocked\nCuz you a part time dealer, prob'ly a part time pops\nNot a part time killer, but them dudes is full time cops\nMake a hustle stupid, you half *ass* black acts\nStack, use your head for than a hat rack, Jack\nStart runnin your life instead of runnin the streets\nRunnin your mouth, oh yeah, stop runnin from beasts\n\n[Chorus x4]", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}