{"songs": [{"title": "Cootie Cootie Coo", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "[Chorus: E-40 + some girl]\n[E-40] I need some cootie cootie coo!\n[girl] I need a player just like you\n[E-40] I need some cootie cootie coo!\n[girl] I need a hustler just like you\n[E-40] I need some cootie cootie coo!\n[girl] I need a gangster just like you\n[E-40] I need some cootie cootie coo!\n[girl] I need a baller just like you\n\n[E-40]\nDem your friends over there? Nah! Who you with then, nobody?\nThat's what I figured\nSittin at the bar, pervin all by yourself\nGettin nice and liquored\nYou said - truuue, I'm havin problems with my dawg\nAnd I said - oooh, my broad just left me for a broad\nWe in the same boat foxy lady lil' momma pretty woman\nI'm beginnin to think we got somethin in common\nConfirmation, verification, lack of communication in our relationship\nDrama (drama) just picture me and you gettin our freak on in the sauna (sauna)\nStress free without no rubbers or no condoms (condoms)\nThat's the real, treatin each other, crustaceans, {?} or Benihana's\nNo more 7/11, time for real chimichongas\nSheeeit, f'real f'real, we'll change the program up so quick\n\n[Chorus]\n\n[Too $hort]\nI see her choosin, it won't take me long\nI got too much game, so I cain't be wrong\nAin't no safety zone, for a bitch when I'm around\nI lead her anywhere and go pimp her by the town\nI'm Too $hort baby that's what I do\nYou wanna play all the broads, but I do too\nYou know the rules of the game, take my hoe, ain't no shame\nCause I can do the same thang\nYou wanna sleep wit her, be sneaky and try to creep wit her\nShe take his cash and he let her\nNot knowin, I was gon' get it all\nYou love the way we players ball\n\n[Chorus]\n\n[Too $hort]\nShe like them paid niggas, let 'em have they way wit it\nShe like them baller niggas yaeh you know we all hit it\nShe like them real G's who treat her like she's filthy\nShe like to keep the square even though she still be fuckin\nWith that other nigga, that's what she likes\nNiggas packin pistols\n\n[E-40]\nNiggas ridin bikes\nRated PG if you keep on the lights\nYou ain't gotta work hard, you his wife\nFight in clubs and I'm lookin at the price\nNails and toes, get some done\nNot his kid but he calls him son\nI don't know what you did but you got him sprung\nNever me doe (me doe) I'm hard as a diamond\nThat ain't me hoe (me hoe) I'm a hustler\nBe timin to the utmost (utmost) shinin and grindin\nWith my kinfolk (kinfolk) collectin and stackin my loot\nSteppin with soldiers and trues, pimpin and panderin hoes\nStrikin a player pose (strikin a player pose)\n\n[Chorus] - 1/2\n\n[Outro]\nThat's what she is\nA funky, once a month bleedin, dirty down BITCH\nThat what she is, you know what I'm sayin?\nLike you call me a pimp\nSomebody somebody would take that offensively\nA square would, you know what I'm sayin?\nOr some, some brothers get mad cause you say nigga\nRight? Well the bitch, to her\nAt least to, to my hoes, that's more of a, a pet name", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}