{"songs": [{"title": "Play for Keeps", "album": "Strange Clouds", "year": "2012-05-01", "lyrics": "[Hook]\nHow much must I repeat? We only play for keeps\nNo time-outs, no free throws, no refs, no penalties\nNo handouts, no pit stops, no cheat codes, no sleep\nBut the drinks are on us, if you with it then pull up a seat\n\n[Verse 1]\nWhen you’re roaming through the jungle talk is nothing, talk is cheap\nTime is money, money is power, power corrupts eventually, damn\nSo what are the options? What are the choices left for me?\nWhat other rule is left to break? I guess my fate is a quest for me\nMan I’m a dog that ain’t got no leash\nMan got a crib, it ain’t got no lease\nMan got a flow that ain't got no brain\nBut I still get brain, no hands no teeth, uh\nNowadays, niggas are killas on the beat\nBut where I was raised all of the killas was down the street\nBetter do your research\nFeeling like I fell out of the sky and landed feet first\nMy squad go hard, my squad go concrete, watch my team work\nHell yea, you can tell that the boy finna eat cause I took my seat first\n3 course meal, full entrée, refills and I want my dessert\nSo why not make a toast? Tomorrow could always be worse\nNow keep them bottles coming by the kiloliter\nAnd get that Ana off your chest, try to keep a clean shirt\nI’m so Grand Hustle, you ain’t even in my league sir\nWhat’s up with these nerds?\nThey be out here, gettin’ their salads tossed, gettin’ their leaves turned\nThe game just ain’t what it used to be, the quality is blurred\nBut a dying breed survives and a dynasty emerged\nSo put it in the air if you entirely concur\nShe call me hippie cause I live without any concern\nUp on this green earth, I’m on them green herbs\nYeah yeah, yeah, I stay in them trees like the Keeblers\nAnd they say that I look higher in person\nAs a kid I played in the yard, but now I’m astro turfing\nI lived the actual version of the fantasies they utter\nMade up stories of threesomes, they must just be seeing double\nRun for cover, here comes trouble\nMy heart is going cold so I gotta sleep with warmer covers\nPolar bear pimpin’, solar flare spittin’\nSomebody tell ‘em that this is professional stuntin’, don’t attempt it\nSociety is twisted, they tryna take us under\nSo when you see them folks, don’t forget to warn a brother\nI made it out alive but still the battle is a struggle\nVeni, vidi, vici, I came, I saw, I conquered\nThey mad cause I murdered the game\nAnd their name wasn’t in the will\nYou see, most of these haters are mad rappers who just still waiting on a deal\nAnd they jealous of my success cause my shoes cost more than a bill\nBut I’ll never sit down at another table unless I’m invited to the meal\nTo some it’s like conquering mountains, to me it’s like stepping on hills\nRemember the images in your mirror can be bigger than they appear\nAnd the truth can be hard to swallow, depends on the size of the pill\nAnd by the looks it’s about the time that you had your prescription filled\nMy life, full length feature presentation\nThere are no intermissions, no time for commercial breaking\nA fighter in his prime, a legend in the making\nThere’s no debating when you let your numbers make the statement\n\n[Hook]", "image": "https://images.genius.com/5a3389828b8e82878033f8e842711c94.540x540x1.jpg"}], "artist": "B.o.B"}