{"songs": [{"title": "Wake and Bake", "album": "Strangeulation Vol. II", "year": "2015-11-20", "lyrics": "[Intro: Gianni Ca$h]\nUh-huh, okay, light it!\n\n[Verse 1: Tech N9ne]\nWake up in the morning, hit the porch and puff a doobie\nWake and baking got me coughing up a lugie\nMake a quick mimosa, now I'm feeling kinda groovy\nGot to find that chick that got the biggest booty\nBut she got to have the facial features of Karrueche\nEasy sex, she got the diamonds in the coochie\nGet me girls to gift to guys to grip and give them Gucci\nLiving lavish, looking loving lot of Luchi\nGot to give a shout out to my other mother Ruby\nThat's because she's always been an angel to me\nPlus I wanna give one to my O.G. brother Scoobie\nPacked a punch that'd make a sucka nigga woozy\nLoving leaf and liquor ever since I was a juvie\nNow I need another, no, I'm not a newbie\nSmoking reefer with the darker nigga from the Luniz\nPiece of hotter head is stuck off in her booties\n\n[Pre-Hook: Tech N9ne]\nGot them vape toys\nThat creates joy\nSuch a great choice\nWake and bake, boy\n\n[Hook: Krizz Kaliko]\n(Wake and bake!)\nWhen I get up, I gotta keep the lit up, my nigga!\n(Wake and bake!)\nPuffiing on the loud, we gon' make the clouds bigger!\n(Wake and bake!)\nGotta get up, I gotta keep the lit up, my nigga!\n(Wake and bake!)\nOh no, no, no, no, can't sleep! I got the \"ooh\" weed, ah!\n\n[Verse 2: Bernz]\nOpen up my eyes and eat some roaches for my breakfast\nDon't know where I am 'cause lately I been living reckless\nDig 'em out the ashtray, smoke 'em 'till I'm breathless\nSoaking up the high and try to focus on my next shit\nToking on that lion 'till I spot other dimensions\nFuck a GPS, my dude too high to get reception\nI been on a mission, just to get us all that necklace\nHitting every city with the motherfucking vengeance\nMaybe it's in excess, maybe it's expected\nMaybe you can blame it on material possessions\nWhen I'm getting high it's when I tell you my direction\nBut if it's up to me I'd rather lie and give y'all guessing\nEvery single morning I'm just smoking on my blessings\nMix a little coffee with my cannabis and exit\nI know it's infectious, a spiritual connection\nI get when I wake up and turn into the smoking session\n\n[Pre-Hook: Tech N9ne]\nGot them vape toys\nThat creates joy\nSuch a great choice\nWake and bake, boy\n\n[Hook: Krizz Kaliko]\n(Wake and bake!)\nWhen I get up, I gotta keep the lit up, my nigga!\n(Wake and bake!)\nPuffing on the loud, we gon' make the clouds bigger!\n(Wake and bake!)\nWhen I get up, I gotta keep the lit up, my nigga!\n(Wake and bake!)\nOh no, no, no, don't sleep! I got the \"ooh\" weed!\n\n[Verse 3: Wrekonize]\nWaking up, I'm baking blunts, I'm going, somebody stop me\nI fly my definitions higher than Hitachi\nLast night I was drinking, got my thinking kinda choppy\nMy girl came over knocking, calling out for papi\nFly as Nicaragua and dressed in Louie and Versace\nI bent her over and I fried her like hibachi\nFeeling high and cocky, balling out like Bocci\nShe brought a friend who had a tight end, Jeremy Shockey\nMatter fact, the volcano was loaded up and locky\nVaporized the weed and dropping treats like we were Rocky\nAll the brothers bringing over trees was kinda sloppy\nBut ¡Mayday!'s packing pens that's got your friends acting like zombies\nNakatomi Nazis, die and hard to proxy\nBut fuck a middleman, you know that Joanie only Chachi's\nRappers's butts are pressing us to snooze, bitch, watch me\nWake and bake and take it to the face like paparazzi\n\n[Pre-Hook: Tech N9ne]\nGot them vape toys\nThat creates joy\nSuch a great choice\nWake and bake, boy\n\n[Hook: Krizz Kaliko]\n(Wake and bake!)\nWhen I get up, I gotta keep the lit up, my nigga!\n(Wake and bake!)\nPuffing on the loud, we gon' make the clouds bigger!\n(Wake and bake!)\nI said I gotta get up, I gotta keep the lit up, my nigga!\n(Wake and bake!)\nOh no, no, no, no, don't see! I got the \"oh\" weed, my nigga!", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}