{"songs": [{"title": "On Politics", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2013-10-28", "lyrics": "[On tour merchandise featuring the Confederate flag imagery]\n\nReact how you want. Any energy you got is good energy. You know, the Confederate flag represented slavery. That’s my abstract take on what I know about it.\n\nSo I made the song “New Slaves.” So I took the Confederate flag and made it my flag. It’s my flag now, now whatchu gonna do?\n\n[...]\n\nIt looks cool. I like at maybe 800 images a day. You know, I’ve been working on clothing seriously for the past 11 years.\n\nIt’s colorless also. It’s super, like, hood and super white-boy-approved at the same time. And that’s really what my style’s always been, because I lived in the suburbs, where, you know, I was known as the Black kid, and I lived in the hood where I was known as the kid who spent his summers in the suburbs.\n\nMy dad was a military brat, and he would be around white people back then when it was like, racism was really popular and people would be racist against him, and he’d get around Black people and they’d kinda discriminate against him because they’d say he acted ‘white’ or talked ‘white.’ So there are times when I’ll talk and you’ll hear some of that white--or what people call ‘white’--the suburb voice come through and it’s times you’ll hear some of that Chicago come through. I’m influenced by all those things.\n\nI lived in China when I was in fifth grade with my mother, she’s an English professor, and she taught high-level English. And it was my hint at being a celebrity because they hadn’t seen Black people on TV, so people would stare at me all the time.\n\n[...]\n\nThere will never be another Backstreet Boys, Not in this day and age. It’s gonna be artists like Lorde, singer songwriters, that are gonna come up. This is Instagram, this is the information highway. And I talk to these heads, you know, these older dudes that run companies, and it’s hilarious to me! I only listen to people who are younger than me! These are the only people with ideas. You cannot give me any advice! You can help me. You can support Donda. You can cut a check. But I have the ideas! No one older than me has a better idea than me because I’m the only 36 year old me! I’m the most relevant voice on the planet Earth, at age 36, post being the most hated. So don’t try to tell me anything! Help me! Help me, help other people.\n\n[Do you talk to corporations like that? They don’t like being uncomfortable.]\n\nWe are uncomfortable. 500 kids are dying in Chicago a year. We are uncomfortable. Just because we’re being a gated community doesn’t mean that things are comfortable.\n\nThe thing is, we have the resources on this planet to have a human utopia, to have respect for each other, mankind. We have that. But we’re too concerned about getting the next Hollywood film on Netflix. We have the resources. There’s new billionaires everyday. You apply the right type of thinkers, like the Elon Musks, the people with the real ideas.\n\nLike, politics is dead. It’s over with. These kids need some type of real truth.", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}