{"songs": [{"title": "Seat Down Low", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nYea, it's me and T man\nT.I.... dot com, bitch\nT.I.P., fuck wit ya boy\nHey, that is my brother, ladies and gentlemen\nT.I. and he is the king, bitch, don't get that shit twisted\nAnd me, I am the best rapper alive, ladies and gentlemen, hello\nThis is Da Drought 3\nAnd it's been a minute since I rapped on a Mannie Fresh beat\nBut uh, I guess I'll go ahead and show these niggas\nWhat to do with one of the beats, mane... listen\n\n[Verse]\nI like my seat down low and my window slightly cracked\nRidin' with a bad ho, with her girlfriend in the back\nI like to get real high and I never look back\nAnd you don't wanna try me, and don't I look strapped?\nI come from the hardest city, ain't nobody fuckin' with it\nGot a black-and-gold soul, with a fresh New Orleans fitted\nAnd a collared polo and a pair of Bally Bucks\nYoung Money, motherfucker, know you worried 'bout us\nCash Money, motherfucker, CMR I trust\nNever had my jaw broken, but his jaw I bust\nAnd I probably got your girlfriend on my bus\nWhat happens on my bus, stays on my bus\nAnd that white widow weed out the jar is a must\nIf you give me a cigar, then a cigar I'll bust\nPut that white widow weed in the cigar and puff\nLook ma, I'm tryna make a porno, starring us\nWell not just us, a couple foreign sluts\nYeah, we make this some ménage à troisin', y'all in?\nI be with Jim Jones and we be ballin', ballin'\nYeah, baby, we ballin', like Rawlins and Spalding\nPint of DJ Screw and that Hawaiian\nI am leanin' like a 3 legged lion, climbing\nRight to the top of the motherfuckin' mountain.. counting\nI'm gonna need me an accountant to count it\nMannie got this fuckin' beat poundin', it's poundin'\nBut it was just lost, until I found it, I found it\nStole it like a scoundrel, Hollygrove hound it\nPut this bitch to sleep, fuckin' right, I night-gowned it\nNiggas talkin cheap, tell them niggas, \"Pipe down, bitch!\"\nBloods in the building, now everybody soundless\nBeatin' up this track like a muthafuckin' round-fist\nBlind, deaf, or crazy, I'mma spit like a long kiss\nI am just a Martian, ain't nobody else on this planet\nI know, see I live by my only\nSay, where my cheese, nigga? Where my macaroni?\nBaby, I get up in dat ass, and act a donkey\nCandy on candy, nigga grippin' the grain\nSee, I'm the only fire that can live in the rain\nI am so so New Orleans, like 1825 Tulane\n\n[Outro]\nHahaha.... see, you gotta be from New Orleans\nTo know what the fuck I'm talkin bout\nAnd if you don't... fuck you\nI say what I want, and I don't want nothin'\nCause I got everything, bitch", "image": "https://images.genius.com/82588434bc5c5032b1e49dee6403c736.1000x1000x1.jpg"}], "artist": "Lil Wayne"}