{"songs": [{"title": "Pantie Raid Pt. II", "album": "The Secc$ Tap.e Pt. II ", "year": "2014-02-08", "lyrics": "[Hook]\nAge ain't nothing but a digit\nIf you with it, with it\nHit my line we could kick it\n\n[Verse 1]\nOkay you're obviously brainwashed\nOur time ain't the same watch\nWaiting by your grandfather clock like that shit gon' stop for us\nExpand your ocular\nPush the grandaddy proper, uh\nWhatever you do just please don't drop the stuff\nIs it awkward love or is it proper lust?\nI'm not whats just poppin' though I'm what's popular\nI love it when you scream big poppa bear please stop\nYou know my animal style\nApex on top that latex gon' pop safe sex ain't a option\nThey be sitting on your chin like it's up for adoption\nGive a fuck who watching\nGuess who knocking the boots\nA foul doctrine\nExactly what got me so into you\nDon't tell your boo\nYou let that rap nigga in your gut\nIf he knew you like I knew you\nThen he know you give it up\nYou know that vanilla thin lust with the chocolate chunk\nSomething like a strawberry and bury it up\n\n[Hook]\n\n[Verse 2]\nYo open up what's for lunch?\nShe said 47 flavors of that shit come rushing up\nGot your blood flowing a pump lets quarrel for the nut\nI got the woodstock\nHow much wood can a wood thot suck\nWhat if the thot could guarantee she would\nAnd that's a tad bit explicit\nIf its implicit lift the clitoris lip and kiss it\nListen to me, bust it for me magnificently\nSo devilish you magnify the Christian in me\nUnexpected positions when we switching between\nWhen its over you see the inner magician in me\nAbra ka dagger and gag her\nAin't tricking if you got it, but she was tricking when I had her though\nWoke up early cause I had to go\nEarly bird want the early worm\nYo I swear she so nasty yo\nShe like them nuts to taste pistachio\nAlways tell me papi don't let go you fantastico\n\n[Hook]", "image": "https://images.rapgenius.com/3bc6d2a5937b005559eb0b18efaa64f7.500x500x1.jpg"}], "artist": "Joey Bada$$"}