{"songs": [{"title": "She Don’t Know My Name", "album": "Suit", "year": "2004-09-13", "lyrics": "[Ron Isley]\nHOOO! Hooooooo\nWell well well.. yeahhhh\n\n[Hook: R. Isley]\nThere's this girl, AND, I see her every day\nBut she don't know me (she don't know my name)\nAnd it ain't all that strange to me\nCause I know hers, AND, it won't be long\n'til she's convinced that I'm her man\nThe one that's gon' take her away\n\n[Nelly]\nYo, yo, yo\nHey yo it's three in the mornin and the party's still goin\nBass still knockin, +Pimp Juice+ still flowin\n'Tics in the back, you can smell the chronic blowin\nI got girls all around, I got my Hef' game goin\nBaby girl right but her partner got ass\nBaby girl left but her partner got ass\nShe got 'em stuffed in them boy shorts covered up with lil' hearts\nHer partner got 'em laced, cut right below the waist\nYou can tell they got taste by they ensemble\nOne like to salsa, the other the mambo\nWhy settle for one when I can have the combo?\nWhy do Cancún when I can go to Cabo?\nThey like to work out, and I ain't talkin Tae Bo\nThey like fast cars, I ain't talkin Volvos\nThey both are the devil but they like it diablo\nDon't worry got it covered just listen to Ronald\n\n[Hook]\n\n[Snoop Dogg]\nHmm, she say them suckers agitate her, told her I'm a regulator\nMan I wanna lay down witcha, maybe we can do it later\nI ain't got no time to waste, another move I got to make\nCold thang, she ain't even know my nizzame (damn)\nI didn't even have to say it, baby wanna stop and play it\nRewind that, pop and grind that\nYou'll find that, a woman like yourself can't keep cumin by yourself\nGet in where you fit in, now enjoy yourself\nCute brightskin brownskin take me to the mountain\nGet you wet like a fountain\nThen get your counselin, have a seat have a drink have a toke\nIt's a +Doggy Dogg World+, you can have whatever you want\n... or whatever you need, all you got to do it follow my lead\nTake my hand, and roll with me\nAnd live it up, with a D-O-double-G, lavishly\n\n[Hook]\n\n[Ron Isley]\nHey girl, what's yo' fantasy?\nCan I take you home? I want you here with me\nOoh girl you blow my mind, I want to be yo' freak\nLet me take you there, to that ecstasy, hoo\nOooooooooooh ba-by, ba-by\nGotta get you home with me tonight\nOh oh oh oh ohhhhhhhh, what's your name?\nWhat's your name? Gotta get you home with me tonight dear\n\n[Hook] w/ ad libs\n\n[R. Isley ad libs to fade]", "image": "https://images.genius.com/feab51577febd001d2d1ca3c23574a2d.1000x1000x1.jpg"}], "artist": "Nelly"}