{"songs": [{"title": "Fame", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "[DMX]\nUh-huh (Y'KNOW?)\n..\nARF!\nUhh..\n\nTake it for what it's worth, my birth was a blessing\nSent to live and die, on earth as a lesson\nWe each have a star, all we have to do is find it\nOnce you do, everyone who sees it will be blinded (WHAT?)\nThey'll tell you that you're bright, and say you have a future\nWhen you turn your back, same cats'll try to shoot ya\nNiggas ain't shit, I can live on both sides of the fence\nForget what you do, when you talk, see what you really meant (aight?)\nThat's what I thought, them niggas was bluffin (uh)\nThey talk all day but say, nothin (uh)\nIt gets so dark (what?) the pain's so intense\nSince this first rain it's like it's rained ever since (WHAT?)\nNever got paid for a rhyme but I flow (whoo)\nNever got a plate on time but I grow (whoo)\nLive your life, STAY on the line but I go (UHH)\nWent from doin crime to bein kind cause I know\n\nChorus: DMX (repeat 2X)\n\nI'm gon' live forever, I'm never gon' die\nOnly thing I fear is that I'm never gon' fly\nCarry my weight but I'm never gon' cry\nShit I tell y'all niggas straight cause I'm never gon' lie\n\n[DMX]\nWhat is about who I am that makes me unforgettable (HMM)\nWhat it is about what I've done that makes it so incredible (uhh)\n\"More money, more problems\" -- well the fame was worse (uh-huh)\nI reached out for love and what came back was thirst (WHAT?)\nBlessed with the curse (uh) niggas don't hear me\nNiggas don't hear me, Y'ALL NIGGAZ, don't hear me (uh)\nWhat'd I just say? \"Niggas don't hear you!\" See that?\nYou gots to FEEL ME to catch what I'm sayin, BELIEVE THAT (UHH!)\nBut leave that, alone (WHAT?)\nWe gon' make a nigga wanna be at, your home (WHAT?)\nOh you kinda quiet with the heat at, your dome (UHH!)\nIf the dog got he's gonna bring back a bone\nCause we got the chrome (C'MON!)\nThis is what I live for, or die for\nI'm the nigga with the high score, you try for\nWhat you niggas wanna lie for? It changes nothin\nI'm true for cats, yet some strangers bluffin\n\nChorus\n\n[DMX]\nNow if I take what he gave me and I, use it right (uh-huh)\nIn other words if I listen and, use the light (uh-huh)\nThen what I say will remain here, after I'm gone\nStill here, on the strength of a song, I live on (HMM)\nNo second-guessin on what I stood for, I was good for\nStoppin niggas from killin each other in the hood war (UHH)\nComin through showin love, throwin up (UHH)\nThem cats not throwin love, you know whassup (WHAT?)\nDark Man baby, that's my name\nAnd I gots to be the realest nigga (UHH) up in this game\nCause ain't no shame, they don't make em like, this no more\nReal to the core, big heart but built for war\nI stand for what I believe in\nEven if what I believe in stops me from breathin\nRelatives grievin, but I ain't went nowhere\nListen to the song (C'MON) I'm right there\n\nChorus", "image": "https://images.genius.com/57efb548310ed90e73d9200fd01a3e59.630x630x1.jpg"}], "artist": "DMX"}