{"songs": [{"title": "Rah!", "album": null, "year": null, "lyrics": "[Verse 1: Lil Wayne]\nBang, guess who checked in the game\nSmoke in the air like LeBron James\nRunning this shit like he Ron Dayne\nPull out my dick and just pee on flames\nShe on Wayne, but she ain’t what I be on\nI’m beyond, I pee on you peons for eons\nI’m in my prime like Deion\nI’mma shine like neon\nI’m a Lion like Leon\nBut I’m ’bout to go off, cause that is all I know of\nI don’t have to show y’all, I’d rather show off\nYeah, Travis on the Drums\nTravis on the beat\nWayne got the smoke and Game got the heat\nWeezy F I’m an F’ing star\nHaha, get it? I’m an FN star\nHa, and it’s the Rock you bastards\nIf I’m the rockstar, will rock you bastards\n\n[Nicki Minaj]\nYo, now all these bitches wanna try and be my bestie\nBut I take a left and leave them hanging like a testi\nTrash talk to em then I put em in a hefty\nRunning down the court I'm dunkin on em Lisa Leslie\nIt’s going down, basement, friday the 13th guess who’s playing Jason\nTuck yourself in you better hold on to your teddy\nIt’s nightmare on Elm street and guess who’s playing Freddy\n(My chick bad)\nChef cooking for me, they say my shoe game crazy\nThe mental Asylum looking for me\nYou a rookie to me\nI’m in dat wam bam purple Lam’ damn bitch you been a fan\n\n[Rick Ross]\n2Pac in Juice, Radames on the loose\n10 chains 'round my neck, haters wish it was a noose\nLong Maybach and I wish it was a coupe\nKush out the jar, car smellin’ like duke\nQuarter milli on the seat, yeah I know I’m a goof\nDesigner underwear, she knows I’m a Gucc'\nGot the wide body, I’m a fat mother fucker\nIn Swahili I’m screaming “stack mother fucker”\nYa homie won’t stop until I decide to\nUntil then I’m making rollies for the homies to ride to\nSmokes on the folds, folks wanna know\nBitch I’mma boss, best foot's on the blow\nKeep the hat pulled over, Big P on the front\nTravis on the drums, big weed on the blunt\nBeing Savage where I’m from, Girls menage from the jump\nDon’t trap me like a punk, Travis handing me the pumps, so\n\n[Game]\nBoom, guess who stepped in the room\nDressed in black diamonds like a fucking monsoon\nBack from the dead but they never found my killer\nSo I jumped up out this grave like Michael Jackson in thriller\nIller than most emcee’s cause I be killin’ ‘em\nMost emcee’s turn into ghost emcee’s\nYeah, give a drummer some\nIf 32 seville when that all black Hummer run\nFace off, Nicholas Cage with a gauge\nI’m famous for killin’ rappers, my style, grenade\nCook shit like Rae, the chef Raekwon\nThe beats are filet mignon without the A1\nWho walk like a pitbull, You? who bitch please\nI ate your favourite rapper’s heart out with a 16\nDidn’t hit the switch on something with fiends\nMake money with Ruff Ryders, homie, that's Swizz Cheese!", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}