{"songs": [{"title": "Because the internet Screenplay - Part 5", "album": "because the internet Screenplay", "year": null, "lyrics": "RAP GENIUS NOTE: This is Part 5 of the script, read Parts 1-4 if you have not already\n*******[PLAY SONG \"PINK TOES\" AT THIS POINT]*******\n\n[VISUAL]\nThis is the part where they kinda fall in love a little bit. But I feel like anything we put here wouldn't do justice to what really happens when a person you meet ends up in your life out of nowhere. But know that it's exactly how you expect it to be, but also more. It's a big inside joke that you can't mess up and only one other person in the world gets\n\nIt's not a very pretty or perfect love, or even necessarily a romantic love. It doesn't look cool.  It's more like two helpless things in the wild, and one says \"I'll protect you\", and both parties know it's a lie because there's no way either of them can protect the other from anything. That lie is the best way to describe this love. That feeling of not having to say \"I'm scared\", because you share the exact feelings without having words over or under complicate it, that's worth more than protection. It's a connection. The less alone. This is all we look for on earth\n\nThe Boy and Naomi hang a lot. They spend the night and make breakfast sometimes. He buys stuff for her. She makes him stuff. They watch cartoons together. They're always saying things, giving opinions, feeling interesting. They both have a purpose. It's a great time. Time passes\n\nThe Boy starts moving small amounts of weed out the mansion, but starts selling more to keep up, along with stuff that isn't weed. He started growing crop in the nursery. The electricity bill would be high, but he stopped living in the mansion. He started renting another place to stay and keep the business separate\n\nTo be honest it was getting a little out of hand, as Naomi predicted. The Boy is not a good dealer. A lot of people think you have to be cold and calculated, which he was to an extent. But you also have to know people. How they act/react. But it was still kinda fun up to this point\n\nThen:\n\nINT. RENTAL HOME - DAY\n\nThe Boy is washing dishes as Naomi stands next to him. They just had lunch\n\n       NAOMI: Howbout'sm China, IL?\n\n       THE BOY: Can't\n\n       NAOMI: Can't why?\n\n       THE BOY: I got a run to do\n\n       NAOMI: Oh\n\nSilence\n\n       NAOMI (CONT'D): I thought you were having other guys do that now\n\n       THE BOY: I am. Fam can't do this one\n\n       NAOMI: If you're putting up the money you shouldn't be making the run\n\n       THE BOY: I don't really trust anyone else to do it\n\n       NAOMI: You don't really trust anyone\n\n       THE BOY: I trust you\n\n       NAOMI: You shouldn't\n\nThe Boy stops. She got em\n\n       THE BOY: You're right\n\n       NAOMI: I don't want to be right. I wanna help you\n\n       THE BOY (said dumb): \"I don't wanna be right\"\n\nShe doesn't laugh. He hopes she's LOLing inside. Cellphone vibrates on the counter across from them. The Boy goes over and reads the text\n\n       THE BOY (CONT'D): I gotta go\n\n       NAOMI: Alright\n\n       THE BOY: You okay?\n\n       NAOMI: I'm fine\n\n       THE BOY: Is that a fake \"I'm fine\"\n\n       NAOMI: No. It's what \"I'm fine\" always means\n\nNothing real is ever \"fine\". Remember this\n\n       THE BOY: I'll be back\n\nHe walks out. They don't see each other anymore\n\nEXT. I-10 - DAY\n\nThe Boy is driving down the highway listening to \"Danny Glover\" by Young Thug\n\nEXT. MANSION - DAY\n\nThe car parks in the driveway. There are three cars already there. When he pulls up, he's playing \"Made in America\" by JAY Z and Kanye. When it goes off, he continues singing his version while walking up\n\n       THE BOY: Sweet Cream Havarti/ Sweet Mozzarella/ Sweet Cheez-its. They're made in America/ Sweet Bowl of Cheez-its/ Ohhhhh-oohhhhh-\n\nFour dudes are standing waiting at the front door\n\nSomething is wrong\n\nThe Boy stops singing and stands there in front of the dudes. They look at him\nAlone\n\nThey all pull out 45s\n\n****[PLAY SONG \"EARTH: THE OLDEST COMPUTER\" AT THIS POINT]****\n\nINT. MANSION - DAY\n\nThey all walk in\n\n       DUDE 1: Where the packs?\n\n       THE BOY: In that closet\n\n       DUDE 1: Sit over there\n\n[VISUAL]\nThe Boy sits in the living room. Maybe he could run out the back? Where though?\n\nThey're at the top of a mountain. If someone heard a shot in this neighborhood, they'd call the police immediately. Unfortunately, there isn't a police department in the Palisades. He'd be waiting for the Santa Monica department, which would take a minute\n\nThe feeling The Boy had now was shockingly similar to the feeling he got at his own parties. People he didn't know or like casually walking through his home and him having to pretend everything is \"fine\", or that they don't have all the power\n\nMaybe he could text Fam\n\n       DUDE 1 (CONT'D): Give me your phone\n\nThe Boy hands him his phone. Fuck\n\nTwo dudes stand guard at the front and back exits. One dude packs the bricks from\nThe closet in a trash bag. Dude 1 (seems to be the leader) is looking through The Boy's phone\n\nIt didn't feel like the day The Boy was going to die. Not to say The Boy didn't feel like he was going to die, he was certain he was going to die today. But he didn't feel like today felt like a/the last day/night. Like a Wednesday that keeps feeling like a Friday. But the more he thought about it, if the last day felt like the last day, the world would be a different place. The order we have everyday would vanish if you were guaranteed a warning. People wouldn't live like they do\n\nThey wouldn't care what you thought. It'd be anarchy. Or a utopia. Depending on who you ask\n\nDude 1 puts The Boy's phone in his pocket. The Boy doesn't know if that's a good thing or a bad thing. Dude 1 and Dude 2 start talking. It's obvious they're discussing The Boy's fate\n\nIf I was the director, the one who made this moment, the one who saw this moment millennia before, the one who coded this world and allowed this to happen, I'd have Thundercat's \"We'll Die\" playing as The Boy looks around at his once castle\n\n...try to do your best\n\nOh! It's like Tony Montana. But resigned and, frankly, more realistic, cause it's boring. Everybody dies. Most of them are boring\n\nAll the dudes walk out except Dude 2. He stays. Dude 1 still has his phone as he walks out. The Boy realizes this action is bad\n\n       DUDE 2: Toss me your wallet\n\nThis is bad. The Boy tosses the wallet. Dude 2 looks through it\n\n       THE BOY: Can I drown?\n\nDude 2 looks up\n\n       THE BOY (CONT'D): I just want to die how I want\n\nThere's a pool out there. You're supposed to get this wave of euphoria when you drown. Supposed to be good\n\nDude 2 stares\n\n       THE BOY (CONT'D): I could just float there. They'd find me\n\nDude 2 starts to walks over...\n\n(Does it change anything when you're aware of your last thoughts?)\n\nDude 2 sits next to him\n\n       DUDE 2: We've been watching you for a while. You're very sloppy\n\nHe's a cop. This nigga's a cop\n\n       DUDE 2 (CONT'D): I'm just gonna stay here with you for a minute. My guys are picking up those guys up the street\n\n       THE BOY: Oh\n\nSilence\n\n       THE BOY (CONT'D): I'm going to jail?\n\n       DUDE 2: Yep\n\nThe Boy looks to the pool in the backyard and sees his own body floating lifeless\n\n[VISUAL]\n\nEyes wide, bubbles clinging to his face. Orange, yellow, and brown leaves float above him. His left shoe floating far ahead, probably from struggling at some point. Next to the pool, Naomi and Steve stand over him. Neither is crying or really seem too upset.  They just look on as if the movie they were watching took an abrupt turn and they're mildly interested rather than satisfied\nIt looks peaceful. Fitting. He'd like to go out like that\n\n\n...what's that sound?\n\n\nTires SCREECH outside. Dude 2 stands up. There's a small crash outside. Yelling\n\n       VOICE: FREEZE!\n\nGUNSHOTS\n\nThe Boy and Dude 2 look at each other\n\nDude 1 kicks open the door. He starts firing. Dude 2 falls. A mist of red puff spurts from his chest. He's screaming\n\nDude 1 turns to The Boy and sho\n\n\n\n\n...(breath).....(breath).............(breath)..\nSilence\n*****[PLAY SONG \"LIFE: THE BIGGEST TROLL\" AT THIS POINT]*****\n\n[VISUAL]\n\nTHE END", "image": "https://images.genius.com/85529bbeef5d1dc890a832d5d3953daa.600x600x1.jpg"}], "artist": "Childish Gambino"}