{"songs": [{"title": "Forecast", "album": "Immobilarity", "year": "1999-11-16", "lyrics": "[Intro]\nTurn me up (feel me like) let me get a feeling of who love me\nAnd who I love (that's what it's all about though)\nYou understand?\nFirst you got to know how to move (the forecast calls for...)\nThen you got to know how to make moves (straight up)\nAll y'all\nIt's eternal (what?)\n(We getting on the ninety five?) Yea I like that word\n(Yo) we bringing it from here (don't drive too close to the ?heava? nigga)\nUnderstand? (Come on) let's go let's go let's go\nYea that's right (right)\nWhat up? So what is it called? (you know what its called kid)\nYo (how much I, how much I implement my thoughts to you?)\n\n[Verse 1]\nYo, hey yo shout out New York, Philadelphia my sword talk\nPraises due, the block favors you\nNew Jers with the guerillas with the most sexiest birds\nVehicles and shit shout out your word\nFox premier, my niggas in Connecticut yea\nUpstate, Albany got love here\nRochester all the way down to stretcher\nYou large, Long Island niggas definitely paint a picture\nChicago peace, Maryland take cheese\nBaltimore lock it all down yo lets increase\nBoston stay flossing, my eye like Steve Austin\nSeeing how y'all bought Rae fortune\nTexas yo, how many Lexuses y'all goin' flow?\nY'all niggas doing it is love yo\nMiami and North Carolina like family yea\nSpoil a nigga like kids with cotton candy\nYo VA. all the money makers generate\nShorty driving around still making ten a day\nL.A. yep it's real when they tell me\nYep I know it's ill cause police tried to kill me\nN.O. and let's politic and make dido\nD.C. I hope y'all feel me when I ble-do\nATL., Tennessee ring bells\nOut in Ohio bumping twenty inch wheels\nYea San Francisco, Vegas, Illinois, Dallas\nMinneapolis cats rap with us\nMichigan yea Rollie Derm burn\nPhoenix, Sacramento really car, bitches on the air\nPortland, Buffalo, Toronto\nStay Brolic in the Giants like the Denver Broncos\nYo South Carolina bring the drama\nStill in all like the way she ball\nYea, she yelling she my baby mama\nJapan coma\nLondon, Germany, China holla, Africa my brother\nRussia light a dutch up\nIndiana where they all throw scramblers and they cut ya'\nJamaica yep Bahamas\nAnd we honor everything, homage, looking Guyanese in Ghana\nDetroit saying go head do your thing boy\nPuerto Rico come on through Raekwon my boy!\nLouisiana and Canada\nSt. Louis, Florida you're on what? Candid Camera\nHe like master in Nebraska\nFleeing in white mink on god G-ing in Alaska\nLaid up Brazil play real\nGot like fifty K in a briefcase Rae'll chill\nWhat? You know the plan\nLaying up in Amsterdam\nBlowing nine grand betting a white man\n\n[Outro]\nOooooo tell me it's me you want baby\nGot to tell me\nWhy don't you tell me girl?\nTell me its me you want baby...\nOoooo.....\nAaaaaaa....\nHa ha ha ha...", "image": "https://images.genius.com/d8508796401925d32124cc47a45641d8.500x500x1.jpg"}], "artist": "Raekwon"}