{"songs": [{"title": "Faster Blade", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro: Raekwon]\nKnow what im sayin? You on the corners and shit. Ya know?\nJust gotta be on something. Hands down shit. YaknowhatImean?\nJust keepin ya eyes and ears open at all times\nWhile we rhyme and shine. For my dedicated niggas\nWho love this shit. We doin this like this. Word up\nWhat's the phenomenon? Carry on Don. Tranquilizin\n\n[Verse: Raekwon]\nAy yo, movin' on these niggas like they old soul, bro\nYou know how we go, we go shift 'em out like pelico\nFine, proteges off top connectin' like a buildin'\nFour dollar whylin' niggas buildin', savin' the children\nCome on now, check out the view like a oceanfront\nSlow motion in cunt, takin' what we want\nYou know a kid asiatic, holdin' power like a Craftmatic\nYou like your fish fried or battered, that day he ratted\nCheck out the movies from Guyana, just eatin' in Atlanta\nMakin' some power moves out of Savannah\nYeah, rock them niggas like jewelry\nArabics movin' blow like aerobics\nThat's when his nose itch, yeah\nThat means it's all in effect\nI'm hittin' you, I'm hittin' Buddha\nIsland Bermuda, send that twenty-shot Ruger\nContinue to slam and mend you like a venue\nGet all up in you, oh yeah your friend too, respect Wu\nYeah, keep the faggot niggas watery\nRhyme for rich niggas who supported me, shorty pussy extorted me\nSo it's a science now, RZA, cuttin' they pockets like scissors\nCindafella found him a Wally slipper\nSplashin' ends in the glass Benz in Nevada\nFlashin' gems, eight-and-a-half Timb state robber\nAll my life been on some foul shit besides kidnap a child shit\nGet on some foul and proud shit\nCheatin' many Koreans bein' all that I can be an'\nPut down on thirty keys an' get to fleein'\nLight up a tree an'\nDon't be breezin' like a blow dryer\nYo, you's a liar like Jeremiah gamin' on the flyer\nYo, Barbarian niggas is carryin'\nThug drug marryin', hittin' Marion off at the Clarion\nAll my Spanish niggas love us\nWe movin' like Russia, bone crusher\nAt the flick, stick the usher\nBroke niggas, spot 'em like Cascade\nIn the street masquerade\nFaster Blade", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}