{"songs": [{"title": "Baby C’mon", "album": "Return to the 36 Chambers: The Dirty Version", "year": "1995-03-28", "lyrics": "[Intro: Ol' Dirty Bastard]\nYo, are you taping baby?\nBaby are you taping?\nOhh yeahhahhahheeyahhhyahhhhohhhyahhhh\nBaby baby c'mon, baby c'mon, baby c'mon\nWhat the fuck anybody wanna do?\nRight motherfucking now!\nAhhahhahhhah\n\n[Verse 1: Ol' Dirty Bastard]\nI'm the god who's ahead of the lords\nDirty Bastard from the Wu-Tang squad\nCan I get raw? Yes, I get Dirty to the floor\nRhymes, hitting on your mind, you could never ignore\nHip-Hop to me is like a place to be\nMy specialty from me to you is MC\nSay what you wanna say, baby say\nI flip the microphone-ah, any day\nI'm mad swift because I got that gift of gab\nNiggas get mad, your ass never had\nThis talent that I got will riz-zock the spot\nMCs, you got paid a lot\nYou ever notice a black man damn mostly slams\nWhen it come to the money, yo it ain't funny\nIt's what you gotta do what you got to do\n\n[Bridge: Ol' Dirty Bastard]\nC'mon, can I get a Wu-Tang\nWu, Tang, Wu, Tang, Wu, Tang, Wu, Tang\nWu, Tang, Wu, Tang, Wu, Tang, it's on your brain\n\n[Verse 2: Ol' Dirty Bastard]\nI get riggy diggy raw when it's time to get\nOn the dance floor shotgun kill the shit\nBlaow, then you won't step to me\nThinking is he really raw as he said he'd be\nIf I wasn't really raw, standing here on the floor\nYou'd be like, \"Booooo! He ain't hardcore!\"\nNiggas play like they live but won't survive\nJumpin up and down ticklin that jive when you ticklin gab\nI'm an average man, G-O-D fan\nLet it be known who's the champ, Wu-Tang Clan!\nIt's coming through and WU, boy it's bad too!\nThrow your hands in the air, if you don't care\nWHO, the Ol Dirty Bastard be\nOh me on my, you be hoppin on my shit just like a fly\nBZZZZT, all around\nThe dirtiest stinkin sound down to the ground\nWhat, what, what you wanna do?\nWhat you wanna do when I'm coming for you?\nI'm gonna give it to ya, bayyybah, bayybah\nBayybahhhahahahahahahahahahah...", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}