{"songs": [{"title": "Call it Gangster", "album": "What’s My Favorite Word?", "year": null, "lyrics": "[Petey Pablo]\nI was so glad, when they said unto me\nLet us go into the house, of the gangsters\n\n[Chorus: Petey Pablo]\nIf you don't call this gangster, I don't know what a gangster is\nIf you don't call this gangster, you don't know what gangster is\nSaid it's one thing to be real, but real ain't all a gangster is\nIf you don't call this gangster, you don't know what gangster is\nI know\n\n[Petey Pablo]\nI was so glad...\n\nI only smoke with the folks that came in when I came in\nI don't smoke with bitches cause I don't know where they mouth been\nDawg I'm a celebrity, I got fans, I don't need friends\nI don't need security, cause they ain't checked me when I came in\nAll that you impressed with, is what I already did\nThe life you choose to emulate, that's the life I live\nDream house, dream car, quarter past that\nThat money that you makin, was my champagne tab\nDawg, that's yo' girl?  Be cool, relax\nI just need her tonight, call the phone, you can get her back\nYou gon' ball then ball, you gon' mack then mack\nYour mouth sayin one thang, but your action don't say that\nYou told me all aboutcha, and I ain't even asked\nLook at ya, nervous, jittery, can't stare me in the eyes can ya?\nReal recognize real, you can't deceive a gangster\nShort Dawg, Petey Pab', what was y'all thankin?\n\n[Chorus]\n\n[Too $hort]\nI know you wanna live the good life\nNew car, new house, what it look like?\nYou'll never see it, tryin to be somethin that you're not\nYou runnin to the car cause you don't wanna get shot\nBut at the bar you was hard\nAin't even no straps in your car, you better call the law\nThey got guns, you got a cell phone\nDo some gangster shit, and get the hell on\n... You talked all that shit\nBut a bunch of ass-whuppins, that's all y'all get\nActin tough in the club\nYou found out you was fuckin with some thugs; put them hands on ya\nSo fast you ain't know what happened\nOutside seen 'em ridin in a fo' do' cabin\nTryin to kill you, this shit is real fool\nYou won't survive in the streets if you don't know the rules\n\n[Chorus]\n\n[Dolla Will]\nUhh; Black Continental, suicide golds\nGators hit the flo', I ain't payin at the do'\nWhile you fly outside, waitin for the guest list\nAnd to get frisked, it's niggas like me creepin with heat\nThat'll burn ya crisp\nI'm at some work, you would open your mouth to kiss\nWhy you at the bar, roused off Cris'\nNo longer courageless, grabbin hoes by the wrist\nChose one, mix wasn't hit, so you wet her clothes\nAnd said BITCH - put it on thick, like Lonzo in \"Training Day\"\nNot knowin she with a clique, that's aimin at your face\nSoon as they get word, hope your friends don't desert\nAnd valet got your Benz parked next to the curb\nYou ain't a gangster, L7\nQuick to bail out, like a nigga in jail stressin\nA lesson to be learnt, bout what a gangster is\nNot only do we roll deep, so do a gangsteress\n\n[Chorus]", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}