{"songs": [{"title": "Evil World", "album": "The Devil’s Night Mixtape", "year": "2015-10-30", "lyrics": "[Intro: Bizarre]\nThis is a evil world, hahahahaha\nAnd right now\nI've got nothing to be happy about\n\n[Verse 1: Bizarre]\nMy bitch is from Texas\nI eat brains for breakfast\nDon't be asking no questions\nYou'll be dead in a second\nThe Adderall phase, callin' all Jays\nGoing both ways, killing all gays\nPsycho killer, known drug dealer\nBe-be quiet, or get shot nigga\nRun in your house, rape your spouse\nKill everybody, save the mouse\nIt's hard to talk, it's hard to talk\nGun in your mouth, gun in your mouth\nDamn, I miss my mamma\nShe looked like Michelle Obama\nI'm Norman Bates, 38, hit the ground, levitate\nShe getting raped, only 8, she love the taste of chocolate cake\nDon't be asking no questions, I got an erection\nLove and affection, I got an obsession\nAss for breakfast, she got a C-section\n\n[Verse 2: Swifty McVay]\nDon't ask no questions, just enjoy the session\nI was raised with a hell of a lot of issues, nigga\nAnd I'ma take it out on anybody, I don't give a\nFuck where you live at\nI could walk around your neighborhood with a strap\nHollering, \"where that bitch at?\"\nWith a bullet impact, push a nigga wig back\nI'm a insane nigga with a sick pass\nI could fuck up your present, it ain’t no future in frontin'\nYou know you ain’t a threat, light as a feather\nI could go to jail, get my ass out, beat a nigga down on a tether\nLightning strikes, I bring bad weather whenever I'm in the zone\nI'ma reign forever\nAnd they ain't ever gonna mistake me for a nigga\nThat would back down, I invented vendettas\nLeaving evidence from the shelves (I did it)\nHis dome looking like he caught a bad case of testis\nIf you want a medal I'ma slap this metal\nLeave him open like animals in the jungle\nEatin' the flesh, this beast from the west out of Seven Mile\nNiggas out of town know better\nIf you want to visit better pick up the hitter\nAnd dial the seven digits, ever spoke to a killer?\nYou fucking with the realest, the one who ever did it\nI'm pointing horizontal, you shooting at the ceiling\n\n[Verse 3: Kuniva]\nCeiling! Nigga, we back in the building\nGet your wife, grab your money and your children\nWe don't give a fuck if you were sitting on a couple of millions\nWe'll pop you like a everyday civilian\nAin't nothing sweet this way nigga\nWe're grown men, we don't play nigga\nYou thinking about some metaphors\nMy nigga been dead 9 years\nStill I think about him everyday nigga\nThis ain't purple pills\nBitch we ain't smiling\nWe ain't had an album out in 11 years\nRunyan Ave ready to start back wildin'\nShow us your favorite rapper's head\nWe will sever his\nPick a side, I'm ready to go to war\nWe just came back from selling out a tour\nGet our name right or get it on the floor\nWritten in your own blood\nThen we smear it on the door\nLife is Biblical, nigga worried about being lyrical\nForgot how to actually be a real individual\nTo be able to walk in a room\nAnd stare a man in the face\nAnd put fear in his heart without a pistol\nMy phone stop ringing like it use to\nShit is back to what I'm use to\nNow I can go back to having me holidays in peace\nAnd riding out all alone with my deuce deuce, bang!", "image": "https://images.rapgenius.com/b808972d9e30fbc09e746e78eee846aa.620x620x1.jpg"}], "artist": "D12"}