{"songs": [{"title": "Lick the Balls", "album": "The Great Adventures of Slick Rick", "year": null, "lyrics": "[Verse 1]\nExcuse me, I'm trying to earn a mere buck or two\nA solemn rapper come in -- and who the fuck are you?\nAround this part of town with diamonds and your girl in fur\n\"I'm trying to enter in this rap contest you're having sir\"\nYou're kinda late \"Flat tire\" Well that do occur\nWell alright, pay me now, and you'll be after her\n\"I hope I don't mess up, or run out of breath, or even break\"\nDon't worry hun you're hitting 'em harder than a fucking brick\n\"But what do you think Van?\" Please, no one can serve us\n\"Wish me luck dear, I'm scared and I'm nervous\"\nSo who stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!\n\n[Verse 2]\nNow every time I write dope raps they come kicking it\nNow you know the title of this, so start licking it\nLips kicking it, hey bitch, there is a brick in it\nSo when you think you're prepared, I keep sticking it\nNow here they come with a spike to fight, take it light\nNow who the one you're trying to be like with all your might\nAnd anyone that attempted to remove me out the race\nBest give me space before I fly in their fucking face\nNow raise that vocal, play that role around your local hoods\nDon't worry about a thing cause Ricky Rick is bringing home the goods\nWho stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!\n\n[Verse 3]\nNow everything that come out your mouth, sound like it's out of spite\nI'm back on a mission and this time I'm gonna anchor right\nThat's right, ads help, he's improving it\n\"Thank gosh Rick! We love the way you're moving it\"\nWho's hitting rough in eighty-eight I bet your momma knows\nBack slap you all down like y'all were dominoes\nStun em all, come on y'all, give me a taste of life\nAct trife, I'll let my dog go fuck ya wife\nSo be my friend and don't pretend you will not be forgiven\nYou're cleaning house up to the master, that's how we both are living\nSo who will stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!\n\n[Verse 4]\nGo Vance Wright! Go Rick! Look at the style we bring\nHow come you cannot write a rap that will erase the king\nThe girls you worship are some tramps and want to see me slam\nShit on mother fuckers and I tell them who the fuck I am\nMy name is Rick, but now you know who's ruling it\nPump the world and the DJ put the fuel in it\nCome ride the dick and if you wanna know what is the word\nWho write the baddest raps you and your boys have ever heard\nI eat you up and give your girl a bowl of Puppy Chow\nYou understand alright? Hello! I'm trying to tell you now\nWho stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!", "image": "https://images.genius.com/09b48445ade4e1b5e75781bcfa6eb3c6.924x924x1.jpg"}], "artist": "Slick Rick"}