{"songs": [{"title": "Perfect", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "{*Charlie Wilson croons in the background*}\n\n[Snoop Dogg]\nBeautiful.. perfect.. flawless.. debonaire\n\n[Hook: Charlie Wilson]\nWhere'd you get that silky skin?\nAnd the colors those eyes come in?\nDoes the light come from within?\nGod made you, did he make the friend?\nWings are under all your clothes\nWorth more than your weight in gold\nWhere did God put down your mold\nOr were you only made for show?\nGirl you're perrr-feeeect - when God made you\nI wonder if he kept the mold, or are you just for show?\nGirl you're perrr-feeeect - when I see you\nIt takes my mind to cloud nine, girl you're so fine, yeah - hey\n\n[Snoop Dogg]\nLovable, and yeah you're pursuable\nEverything is beautiful, even down to your cuticles\nIt ain't about me, it's all about you\nYou make me do what you want me to\nYeah, it's just like that\nHere go my number baby girl why don't you get right back\nYou're a, perfect dime, I'm workin mine\nJust the thought of me and you I mean it's blowin my mind\nCain't explain it doe, but if I'm wit'chu\nI can't remain a ho, or stay in the flow\nIt's a shame to know, I maintain the flow\nBaby girl me and you is unexplainable\nMm, yeah - we need to get into actin\nCain't you see this is a natural attraction\nA lot of maxin and relaxin\nC'mon baby girl, give a player some action, I'm askin\n\n[Hook]\n\n[Snoop Dogg]\nIf you would, if I could\nYou make the bad boy in me go good\nTell a lie? No I tell the truth\nBaby boo on the real you know you hundred proof\nMm, I can't even believe that\nYou livin the single life, damn I need that\nI hate to see a queen without a king\nIf I had you I'd get you e'rything\nCoast to coast, L.A. to Chicago\nSee my baby go wherever I go\nCosta Rica, Obregato\nIf I get you I hit the lotto\nLoco shoppin, get what you want to\nSky's the limit, so go on and spend it\nI said it cause I meant it\nSo go and give me your love and get in it to win it\nHit it\n\n[Hook]\n\n[Snoop Dogg]\nMm, I know you dig my rappin\nI see you smilin so I might get some action\nYeah, so let's get it crackin\nIt won't be no rerun, hey hey hey what's happenin'?\nIt won't be no type of scrappin\nMe and you, this is everlastin\nI hate to sound sarcastic\nBut we'll make a classic, it'll be fantastic\nWe need to get into actin\nCain't you see this is a natural attraction\nA lot of maxin and relaxin\nC'mon baby girl give a player some action, I'm askin\n\n[Hook]\n\n[Snoop Dogg] {*Charlie Wilson ad libs*}\nMm, the perfect girl, livin in the perfect world\nLike I said, I hate to see a queen without a king\nI'm available, let's make it happen\nYeah, the dime or the dub, how you love that?\nHa ha ha\nYeah, 'Beautiful Part 2' - thought you knew", "image": "https://images.genius.com/22daab0632e506300bab596c589dcfb2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}