{"songs": [{"title": "Initiated [Nu Mixx] (Best Buy Bonus Track)", "album": "Nu Mixx Klazzics Vol. 2 (Mixtape)", "year": null, "lyrics": "[Intro]\nYeah\nWest side\nBiatch\nSee ya\nHahahahaha\nWooo!\nReal niggas in the building\nHahah\nPac, what up baby?\n(Yeah, nigga, yeah, nigga!)\nHow you feelin', nigga?\n\n[Verse 1: 2Pac]\nNow take a look inside my mind\nThat pen' time made me wise but still I rise\n'Cause my ambitions as a ridah like landmines\nLyrics turn niggas into smithereens\nMusic so lethal, turn coliseums to murder scenes\nI'm Makaveli the Don is what they tell me, I'm armed\nI'm droppin' niggas like bombs\nGet in that ass like a thong\nPicture a felon in ya presence\nTakin' bustas back to the essence\nTellin' my people peep my lethal message\nVisions of me gettin' money got me in mash mode\nMurderous motive for niggas stoppin' my cash flow\nYou can't fight it nigga, let go\nWitness the sound, made ya bitch ass bow down to Death Row\nMama, these niggas got me fightin' these 3 Strikes\nShowin' up in court, fuck what you thought it's three nights\nI put the game down first put my niggas up on it\nNow we America's Most Wanted\nFeel me\n\n[Hook: 2Pac]\nBitches is wild, niggas is lame\nI hung around with real niggas got exposed to the game\nMuthafuckas actin' crazy bustin' me in the jaw\nInitiated as an Outlaw (Outlaw)\nBitches is wild, niggas is lame\nI hung around with real niggas got exposed to the game\nMuthafuckas actin' crazy bustin' me in the jaw\nInitiated as an Outlaw\n\n[Verse 2: Steele]\nTake a look inside my block where we beef with the peep cop\nBop when the beat drop\nCock when the streets hot\nShell-shocked we out to tote lead\nRemember the teachers when we and 'Pac broke bread\nHe said One Nation is what this nation most fear\nNow I swear most these rappers ain't ready for warfare\nWe Outlaw since birth, that's why the lost fear\nNow betcha all every verse gon' have a mall scared\n\n[Verse 3: Tek]\nIt's hella mean the don, you find it in the Quran\nYou catch me in the trap gettin' my grind on\nI produce from the line where the hustlers made\nSeein' visions on my money yeah my name was Krazed\nAnd this way I'd carry from state to state\nThis here is the man that my mama made\nYou can read Montana, see that a it's ya boy\nRaised in the game, initiated as an Outlaw\n\n[Hook: 2Pac]\nBitches is wild, niggas is lame\nI hung around with real niggas, got exposed to the game\nMuthafuckas actin' crazy bustin' me in the jaw\nInitiated as an Outlaw (Outlaw)\nBitches is wild, niggas is lame\nI hung around with real niggas got exposed to the game\nMuthafuckas actin' crazy bustin' me in the jaw\nInitiated as an Outlaw\n\nVerse 4: [[?]]\nTake a look inside my brain!\nDippin' through the rain and into range bumpin' Dr. Strange\nMy Glock aim is impeccable\nWhat scared to do or sketch to do\nA couple of body bags to catch hella flu\nCold with the fortune oh I'm scortchin'\nGot that FEDS lookin' at me like \"that boy toastin'\"\nNo, but I be on the road to Boston\nHustle man like Martin and I'm Tracy Morgan\nSo I get that money right, get the paper can right I\nThe only one to pay to connect mic\nB me rst believe that vest be\nSo postin' my chest\nI can't breathe in the city of thieves, I rest please\nCan't tell me nothin', my gun bustin' with ease\nNo prob, so far I gotta crowbar, rough pic\nFroze and now I'm initiated as a Outlaw\n\n[Hook: 2Pac]\nBitches is wild, niggas is lame\nI hung around with real niggas got exposed to the game (real niggas)\nMuthafuckas actin' crazy bustin' me in the jaw\nInitiated as an Outlaw (Outlaw)\nBitches is wild, niggas is lame (uha)\nI hung around with real niggas got exposed to the game (that's right)\nMuthafuckas actin' crazy bustin' me in the jaw (yeah)\nInitiated as an Outlaw hahahha\n\n[Outro: Buckshot]\nNever forget baby\nWe Outlawz since birth (birth)\nSince E.D.I. what up\nKastro, what up (yeah)\nKadafi, what up uha\nStormy, what up (initiated as an outlaw)\nFatal, what up (yeah)\nBoot Camp in the buildin' baby, Black Smif-N-Wessun (yeah)\nWe riiide, riide\nInitiated as an outlaw (riide), initiated as an outlaw (initiated as an outlaw)\nGreene millennium now baby yeah\nAyo roll up that haze (initiated as an outlaw)\nPass that henny\nUnless to give right\nUh Outlaw!! (initiated as an outlaw)\n\n[Hook: 2Pac]\nBitches is wild, niggas is lame\nI hung around with real niggas got exposed to the game\nMuthafuckas actin' crazy bustin' me in the jaw\nInitiated as an Outlaw (Outlaw)\nBitches is wild, niggas is lame\nI hung around with real niggas got exposed to the game..", "image": "https://images.genius.com/3df7ac2293876c8e607489cd6238694a.220x220x1.jpg"}], "artist": "2Pac"}