{"songs": [{"title": "White Linen Affair (Toney Awards)", "album": "The Big Doe Rehab", "year": "2007-12-04", "lyrics": "{*skit plays for first minute or so of track*}\n\n[Ghostface Killah]\nCongratulations, we have refreshments and glass bracelets\nAvian water's ya choice, put ice\nI'm missing a g-note, fixed price\nBut the only thing fixed, is the holes that we put in the dice\nRocks is okay, my voice is extraordinaire\nThe man that scrapped with lions, hiberated with polar bears\nHope I don't play with baking soda in my older years\nMantles'll sit up like hill, I'd have to fold my beard\nCheck one, two, Sonny, tell Bob to dim the lights up\nYou see the studs, I want the red strobe to hit it right\nStones are screaming, hot lattes, the rosees\nMy robes is a murder statement, you fucking with rode rage\nLadies and gentlemen, boys and girls\nChildren of all ages, I pack metal like braces\nSnap of the fingers, bitches fighting over my paper\nY'all need to chill, sit the fuck down and fix ya makeup\nGhost is ya host, so allow me, hand me ya coats\nBentley Farnsworth, will check them proudly\nWe got D-Block, Wu-Tang, Jay-Z and Nas\nAlso performing 50 Cent, Terror Squad\nFrom the top, we have the great Luda, Jeezy and Wayne\nT.I., Rick Ross, Rich Boy, Snoop and The Game\nAnd for my ladies, we have, Ne-Yo with Usher\nY'all have a seat, we be right back, mothafucka...\n\n[Interlude: Shawn Wigs]\nCome on, this commercial break's almost over\nOutKast, M.J.G., you're at Talib's table\nFab, U.G.K., table seven, let's go, come on\nYo, Beans, Toney said \"Good looking on that haze\"\nCommercial, come on, let's go, guys...\nComing back in, five, four, three, two, one...\n\n[Ghostface Killah]\nYeah, check out my band playing, Rhythm Roots Allstars\nThey play for DipSet, E-40, Lil' Jon, Jennifer Hudson and Norah Jones\nMary J. Blige, with her shades on, I could tell by her stones\nOn the left, we have Lenny Kravitz, Puffy, Pharrell, Bus\nKeith Murray, Redman, hitting that double Dutch\nWhat an event, peace to Denzel\nGive this man a round of applause, he do it so well {*applause*}\n\n[Interlude: Ghostface Killah (Shawn Wigs)]\nLadies and gents, ladies and gents...\nAlright, alright, have a seat, have a seat...\nWithout further adiou, he needs no introduction\nHe is my co-host... Shawn Ripple!\n(Alright, is this thing on? Eh, eh, sweetheart, come here\nGot a hundred dollar bill tattooed on my cock\nHeard you like to... blow money... hahaha)\n\n[Shawn Wigs]\nIt was amazing, I seen Robin Thicke and Robin Leech\nRobin Givens, Robin Williams and Meryl Streep\nA real award show, there's Kanye West\nPamela Anderson, and she brought both of them breasts\nParis Hilton and Lindsay, holding down Britney's skirt\nNo more free looks, you gotta put in work\nTo get a glimpse, seen Don Juan with all of his pimps\nAnd they hoes on they side, sipping they four-fives\nAnd Billy Dean...\n\n[Ghostface Killah]\nExcuse me, have you seen Alicia Keys?\nTell her the limo's outside, she's bouncing with me\nThe Don, y'all rappers don't steal my ash trays\nMy coat hangers is diamonded out like my last gates\nSuperhead, gave the low scoop to Halle\nShe said, before Whitney, she was fucking with Bobby\nMos Def, The Roots, Common and Nelly\nIce Cube, Dr. Dre, Three 6 Maf', yo, and she fucked O.J... word?", "image": "https://images.genius.com/f1bbc70540da138c70debc041f381d0f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}