{"songs": [{"title": "Freak Show", "album": "Catastrophic", "year": "2012-12-21", "lyrics": "All a nigga want is some wired service\nAll a nigga want is some wired service\n\nYea, suck it\nYea, suck it\nYea, I got a stack for the freak show\nWhat?\nI got a stack for the freak show\nYea, suck a nigga dick ho\nYea, suck a nigga dick ho\nYea, I got a stack for the freak show\nWhat?\nI got a stack for the freak show\n\n(Verse)\nOkay I’m ridin through your city blowin Diddy’s of that icky, got that\nKing Tut collection to be with me\nSee my chain all gold and my thing all cold\nOn the highway to that money, boy your lane’s all closed\nI’ll be ridin in that Ghost, play safe Casper\nBlow a loud pack and I’mma swag on Lassiter\nHigher than the stars, spaces shuttles for a car\nLet it pop red hot confirm all with these bars\nPink Friday, I’m Nicki Minaj with these bras\nI ain’t babysittin bitches but like Charles I’m in charge\nGrave dig em all, 6 feet deep throat\nWith her tongue out like she’s Jordan fire from the free throw\n\nBitch, suck a nigga duck ho\nBitch, suck a nigga duck ho\nI got a stack for the freak show\nI got a stack for the freak show\n\nAll a nigga want is some wired service\nAll a nigga want is some wired service\n\n(Verse)\nSo we sloppy second, nigga coochie kinda gooshied up\nThat’s what happens after niggas done torn the pussy up\nPussy in my face, want me taste your lil cookie, what?\nGotta put in work, hope you ready for this bully fuck\nI respect it shorty, on that surgery of Nip & Tuck\nWrap over your lips around that dick, got ahead and sip this up\nGo to shorty thinkin she ain’t trickin and she click and clock\nYea you know the goal, digging a hole until my dick is stuck\nOkay I’m windin on my style, give me the goody shorty\nIf you ain’t ready to do me then bash with your rookie eyes\nOn second thought I’m bout to go fuck with your friend until the party here\nCuz I noticed it got some kind of booty rash\n\nYea, suck a nigga dick ho\nYea, suck a nigga dick ho\nYea, I got a stack for the freak show\nWhat?\nI got a stack for the freak show\nYea, suck a nigga dick ho\nYea, suck a nigga dick ho\nYea, I got a stack for the freak show\nWhat?\nI got a stack for the freak show\n\nAll a nigga want is some wired service\nAll a nigga want is some wired service\n\n(Verse)\nI ain’t perfect but these bitches think otherwise\nA side piece, ain’t even lookin at no other guys\nInto the suite with 2 bags and she left for 4\n2 in her hands and 2 under her eyes\nWe was up all night and I was going in\nBeat it up so low she wish she brought a friend\nSo she could take a break\nYo, I don’t even take these bitches on a dinner date\nMight send a tweet, follow on Instagram\nNext day she in my ride and she goin HAM\nDamn, it’s crazy\nGonna make it ready, run so fast it’s amazing\n\nYea, suck a nigga dick ho\nYea, suck a nigga dick ho\nYea, I got a stack for the freak show\nWhat?\nI got a stack for the freak show\nYea, suck a nigga dick ho\nYea, suck a nigga dick ho\nYea, I got a stack for the freak show\nWhat?\nI got a stack for the freak show\n\nAll a nigga want is some wired service\nAll a nigga want is some wired service", "image": "https://images.genius.com/b64a509fcfb92ec8935231089436682e.500x500x1.jpg"}], "artist": "Busta Rhymes"}