{"songs": [{"title": "Attendance", "album": "The Sneak Attack", "year": null, "lyrics": "[KRS-One]\nWho was the first to flash the heat on the cover?\nWho was the first crew to go against another?\nWho was the first to go acapella on a video replay?\nWho was the first to lose a DJ?\nWho was the first to teach at Yale?\nWho was the first to hit that hip-hop reggae, on the nail?\nWho was the first to say Stop the Violence\nAnd teach that real bad boys move in silence?\nYou're soon to see the mindbendin rhyme weapon\nGet more busy than two-two-three-double-nine-seven\nAll these rappers, swear they the best\nI know whatchu thinkin about, \"Where's KRS?\"\nEighty percent of these rappers fake they {shit}\nThe other twenty percent they goin upstate and {shit}\nThere's no way out except knowledge and wisdom\nI got it so I spit 'em you ain't got it you gotta get 'em\nWho was the first to produce mix and write\nAt the same time up in the club rockin the mic?\nWho was the first to have a DJ and a side man?\nThe first to say what is hip-hop? \"I AM!\"\nWho was the first to produce gangster {shit}?\nPut out, gangster hits with a gangster click?\nNot no prankster {shit}, Steady B, Mad Lion\nJust-Ice, Shabba Ranks and {shit}\nMy Channel is Live, my only battle is Jive\nMC to MC, you won't survive\nYou'll be censored cause my Crew is 2 Live\nI ascend like Christ and watch you die\n\n[Hook: repeat 2X]\nBreakers (HERE!) MC's (HERE!)\nWriters (HERE!) Beat-boxers (HERE!)\nDJ's (HERE!) Hip-Hop (HERE!)\nHip-Hop (RIGHT HERE!) Hip-Hop (RIGHT HERE!)\n\n[KRS-One]\nI'm like Noah, I'm takin 'em, two by two\nI took, them and them and I'll take, you and you\nI took, them and them and I'll take, you and you\nBe I'm right or be I'm wrong\nYou'll see I'm tight with this mic, you should be like, \"B I'm gone\"\nBut you still in my face Neo, I'm not your girl\nAll that ice and thug life, that's not my world\nI'm the teacher, but you still can't see\nCause while you respect 2Pac, 2Pac respected me\nAnother thing; don't ever show me another ring\nRemember you Rudy Ray Moore, I'm Martin Luther King\nEverything you bring sounds horrendous\nYou need repentance, 'fore I take attendance\n\n[Hook]\n\n{*KRS-One hums a melody for a bit*}\n\n[Hook]", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}