{"songs": [{"title": "Smile Back", "album": "Blue Slide Park", "year": "2011-09-23", "lyrics": "[Chorus]\nI just be like fuck you, what you need?\nYou can't get nothin' from me\nYou was talkin' shit, now I'm somebody you would love to be\nI'ma do my thing until the day the reaper come for me\nYou can keep on grillin', I'ma smile back, smile back\n\n[Verse 1: Mac Miller]\nTell them haters, call your army, bring your tanks\nI'm a big boy with a big boy bank\nSelf-employed, independent, once you start, don't take no breaks\nWork until I get it, I bet it's gon' take a second\nBut once I start up my engine, I'm gone, too fast to catch him\nI'm Lennon mixed up with UGK, maybe try that purple drink\nWhat I'm on is strong, yours weaker than seven days\nSweeter than creme brulee, presidential head of state\nDopest mothafucka since before I hit the seventh grade\nElevate, Buddha shit, cooler than what coolest is\nSlick without no lubricant, bullshit, you just full of it\nStupid bitch, keep on hatin', I'ma keep on doin' it\nSpend a day as me, boy you couldn't get the shoes to fit\n\n[Chorus]\nI just be like fuck you, what you need?\nYou can't get nothin' from me\nYou was talkin' shit, now I'm somebody you would love to be\nI'ma do my thing until the day the reaper come for me\nYou can keep on grillin', I'ma smile back, smile back\nI just be like fuck you, what you need?\nYou can't get nothin' from me\nYou was talkin' shit, now I'm somebody you would love to be\nI'ma do my thing until the day the reaper come for me\nYou can keep on grillin', I'ma smile back, smile back\n\n[Verse 2: Mac Miller]\nThey used to tell me I was fake, they would hate, now they on my dick\nMost Dope is my family, have respect for my conglomerate\nRollie on my wrist, I ain't rich, but I'm still coppin' shit\nJerm is on the beat, he got that heat, hold up, drop it quick\nAnd bring it back\nI could change the world with just a single track\nUnderage table in the back, smokin', drinkin' yak\nPittsburgh, let me show the world just where my city at\nOn the map, illest city out, I guess that's just a fact\nI'ma live in Rome, drink Patron and have a ball\nAfter all, only get one life, so there's no time to stall\nI'ma do it, stupid dudes with all exclusive shit to move with\nJust a few kids tryna bullshit, still my boys I straight up grew with\n\n[Chorus]\nI just be like fuck you, what you need?\nYou can't get nothin' from me\nYou was talkin' shit, now I'm somebody you would love to be\nI'ma do my thing until the day the reaper come for me\nYou can keep on grillin', I'ma smile back, smile back\nI just be like fuck you, what you need?\nYou can't get nothin' from me\nYou was talkin' shit, now I'm somebody you would love to be\nI'ma do my thing until the day the reaper come for me\nYou can keep on grillin', I'ma smile back, smile back", "image": "https://images.genius.com/83b5cf07c39eb95618f6cf76b5552b11.375x375x1.jpg"}], "artist": "Mac Miller"}