{"songs": [{"title": "Going Bad", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro 1: Tech N9ne]\nThis is the trip! The best part I, really, really like!\nYeah, I'm proud to be a part of this number!\nUsed to be good, now I'm going bad..\nYo.. Like this!\n\n[Intro 2: Tech N9ne]\nEverything was 'posed to be all Jesus\nEverything was 'posed to be all Jesus\nBut it seems like everything is all Satan\nBut it seems like everything is all Satan\nEverything was 'posed to be all Jesus\nEverything was 'posed to be all Jesus\nBut it seems like everything is all Satan\nBut it seems like everything is all Satan\n\n[Verse 1: Tech N9ne]\nIn the new millennium you can't play with nobody's mind, man\nDeliberately messing up a good thing or holding up a grind and\nYou already knowing life's a big fight against time, man\nCrime minds really shine, who's dying is the kind man\nWhen some of us, find that life ain't beautiful, we switch to pharmaceuticals\nYour nine to five ain't suitable, for the cuticles\nI'm going bad, currently I keep ending up with even less than I had\nRecord company is dealing me something sad\nHow do you expect a man to sit and wait with three kids\nFor you to figure out what Tech S-I-N-G-L-E is?\nGoing bad, I feel like I just might act a fool when I see 'em\nGot a nigga, feeling petty looking forward to per diem\nI got some issues, most of these record execs are soft as tissues\nDefecate on they self when they here some \"I'm gon' get yous\"\nUnderstand this; when a Rogue sat, you trying to hold back his dough sack\nAnd try to bozack and he go cock the 4-4 back, you chose that\nSo cut these ties and I'll rise, let's compromise\nOr else I'll hop a plane with my guys\nQDIII said, \"It ain't all good, when you sign with a record label\nWho ain't had a hot soundtrack ever since Boyz N Da Hood\"\n\n[Bridge: Tech N9ne]\nI'm going\nBad\nNo luck, I'm going\nBad, bad, bad\nSo rough I'm going\nBad, bad, bad\nNo church, I'm going\nBad, bad, bad\nDisperse I'm going\nBad\nFeel me out now\n\n[Hook: Charmelle]\nThis life I live ain't extra\nNo angels to stand next to\nTo live a life that's better\nI'll sacrifice whatever\nThis life I live ain't extra\nNo angels to stand next to\nTo live a life that's better\nI'll sacrifice whatever\n\n[Interlude: LeCoya LeJuene]\nNo one wants to see an angel in this world in these days\nTo them I am the epitome of evil\nA found soul looking to save the lost\nTo them I am death and of not wanting an evil man\n\n[Verse 2: Tech N9ne]\nFor living expenses they gave me like thirty-five G's\nPicture me in a hospital shot up with thirty IV's\nThat's what I really needed when I found out this drama trauma\nInstead of moving I should've kept all that and continued to stay with my girl's momma\nGutter living got me tripping I'm smoking bud daily\nGutter living got me tripping, I'm going blood crazy\nGutter living got me tripping, I'm struggling like a bad actor\nGutter living got me sounding like The Madd Rapper\nThe bad influence, the bad apple, the bad seed (That's me, yes)\nThe bad people, the bad karma, the bad breed\nMushroom tripping, brain's a mushroom cloud\nFinding groupies tugging on my zipper while I'm hanging on to my vows\nDemons surround me in triple stage darkness and taunt me\nThey know I'm the good guy going bad so they want me\nAll my family remembers way back in the day I was good but they doubt now\nDisperse, I'm going bad, feel me out now\n\n[Hook: Charmelle]\nThis life I live ain't extra\nNo angels to stand next to\nTo live a life that's better\nI'll sacrifice whatever\nThis life I live ain't extra\nNo angels to stand next to\nTo live a life that's better\nI'll sacrifice whatever\n\n[Interlude: LeCoya LeJuene]\nTo say going bad to most ha\nNever been good just getting worst\nThoughts to destroy and to tear things apart\nThoughts to praise, adore and to love\nThe trick is what voice is telling you what\n\n[Verse 3: Tech N9ne]\nMind state of a pirate, I'm irate\nUsed to be cool 'til some straight fool lit the pilot\nWill I be that mid-town bound in the middle of a riot\nOr at a warehouse shipping platinum, and I'm shaking hands with Violet\nNo love for the bane, false foes in the game\nThe Qwest wreck was a shame, twas a journey full of pain\nBut Tech N9ne will remain hella brave and untame so make way\nFor the reign I'm bringing Highland and Wayne\nNo thanks to Qwest they on the receiving end of the gun\nI cursed you, for every time I climb you're getting fired one by one\nBut taking Juan with me 'cause he knows the true meaning of a modern day hippie\nWho creates jewels off mushrooms and bombs sticky\nHog Stylin', Mid West Side and Newday and King Tech and Sway\nThese are the people keeping me alive to this day (Much love)\nQD said \"You can't make rell with a label\nWho let Tipper Gore talk shit and made 'em take Ice T's cop killer off the shelves\"\n\n[Bridge: Tech N9ne]\nI'm going\nBad\nNo luck, I'm going\nBad, bad, bad\nSo rough I'm going\nBad, bad, bad\nNo church, I'm going\nBad, bad, bad\nDisperse I'm going\nBad\nFeel me out now\n\n[Hook: Charmelle]\nThis life I live ain't extra\nNo angels to stand next to\nTo live a life that's better\nI'll sacrifice whatever\nThis life I live ain't extra\nNo angels to stand next to\nTo live a life that's better\nI'll sacrifice whatever\n\n[Outro: LeCoya LeJuene]\nRight now I can't distinguish which voice I'm listening to\nAm I evil? Or just another lost soul going bad?\nOr just been bad and getting worst?", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}