{"songs": [{"title": "You Could Be Blind", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[Hook 2x]\nYou could be blind\nBut you gon' see it when you need to see it\nYou gon' be fine\nCause you gon' be here when you need to be here\nOne of a kind\nFirst free your mind, and then you'll free your spirit\nGo where I go, dog in my life\n\n[Verse 1]\nNow if you start with dirt, then you start with hurt\nYou start with \"Oh, you ain't got?\"\nWell here, take my shirt\nStart with work, blood and tears over the years\nGoin' through whatever we go through, we stickin' it out here\nPups turn into dogs, tadpoles into frogs\nI'm just eatin' what's in front of me, ain't thinking about yours\nBut I'mma keep my paws on what's mine\nBeg 'til I find\nStrapped 'til I'm blind\nA nigga that whatever I do, still gon' be able to spit this\nI'm wit' this, cause this is mine, you scared shitless\nRap niggas can't fuck with the dog\nNever, could be twenty below outside\nI'm built for the weather\nIt could be hotter than lava, I wouldn't bother to sweat\nSome of you niggas, form a following, but you startin' to forget\nI paid my dues, not only did you not wear\nBut you would really love it\nIf you could meet that cat that made my shoes\nC'mon!\n\n[Hook 2x]\n\n[Verse 2]\nNow see, what I do is peep shit, keep shit low\nKeep paying attention to what you trying to show me\nLivin', but you never know, we livin'\nDon't give me what you don't owe me\nDon't tell me that you love me\nDon't talk shit, don't kill me slowly\nCause a dog like me, is an only\nMeaning, hit another like you, truth hurts, but I can't be phony\nYou always looking for bad, look at you mad\nBut you won't be satisfied 'til it took what you had\n(Aight) I'm a thoro nigga, I keep my word\nAnd anybody that's ever met me, got love for me\nSo I keep a heard\nAnd that shit y'all niggas told me got me fucked up in the head\nWent from, \"Yo, that's my dog\"\nTo, \"Yeah, that nigga dead\"\nWhat the fuck is all this?\nNews to me\nDog it's like shit ain't what it used to be\nSee some niggas choose to be on the other side of the fence\nKeep riding with this, get fried in the mix\nC'mon!\n\n[Hook 2x]\n\n[Verse 3]\nNow if it ain't that, then don't say that\nCause I don't play that, y'all play that\nBut the poke ain't black, damn, why you say that?\nI thought that...what?\nNevermind, I just thought it\nWe supposed to keep it real\nI destroy what I was taught\nMisery, love, company\nNow you niggas talikin' 'bout jumpin' me, pumpin' me\nFull of slugs, blood, stud with the love\nDamn, I just gave, what a real, nigga does\nDon't listen to the buzz, don't get caught up in the hype\nYou'll lose everything that you worked for\nTrying to take a nigga's stripes\nLive life through life, and so on and so on\nThat's when the grow on, man, get your flow on\nYou niggas gettin' too old for this kid shit\nOn the real, we all done did shit to get shit\nSnake shit, right is right, wrong is wrong\nMuh'fucker, listen to this song\nYou see what shit I'm on\nC'mon!\n\n[Hook 4x]", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}