{"songs": [{"title": "Case Closed", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "[Dr.Trevis]\nHah\n(huh, hah, hah, hah, HAHHAH, hah)\nNineteen ninety-six\n(hah, come on!) Coming with the sickedest motherfuckers\nIn the perimeter\n(huh, whooo! nineteen) You hit em with a newwwww\n(ninety-six, nine six) tree, dick be fly, in your ass\n(Dick! Di-dick, check)\n\n[Verse 1: Redman]\nAmazing grace how sweet the sound is of the fo' pound\nTo blast all these sound men that got the po' sound\nYippee-ki-yay, motherfuckers here's the show down\nBut since we're broke now with dope sounds now here we go now\nCheck the motion while I be puffin the potent\nBlow spots and urban networks with other experts\nPlus this thing between my ear thinks clear\nAnd the only thing it fears is the man upstairs\nSo fuck your bulletproof gear\nIf I decide to get your ass you better believe it's more than a blast\n(boo-ya) More like rough paragraphs out Alcatraz\nAnd ash, your staff, let the grime our your ass\nEverybody's hustling with sons toting guns\nWhere Reggie Noble's from we stick nuns that got funds\nBomb niggas like they did in Oklahoma\nFreez, you're froze, Def Squad UHH, case closed\n\n[Rockwilder]\nI be the, sneaky, second dimension, seeping through your sector\nHave nectar, leaking out you wack rhyme stressers\nExtra deez disease leave rashes on rappers\nMakin MC's so feel the breeze of the Grandmaster\nPacked with swift solid style structure\nSimonizing MC's with the degree of street ruckus\nAiyyo who got guns? I split precise, spleen splitter\nReturn my physical presence to the borough of the hard hitters\nI devour, night sun shower, minutes last hour, weak man's last power\nBody, the six four mind shotty\nThe one you handle, second dimension mind vandal\nLacerating your retina for tryin to see this\nAs I'm flowin through the prism of the X-3-D\nSee at forty belows I freak flows that burn your nose\nWhen you inhale the verbal blows, case closed\n\n[Hook: Redman & (Crossbreed)]\nAiyyo, why the fuck you tryin to get funky on me nigga?\n(Aiyyo, why the fuck you tryin to get funky on me nigga?)\nYo, don't you know, who I am motherfucker?\nRedman's the name fool\n(That's my nigga!)\nWhy the fuck you tryin to get funky on me nigga?\n(Aiyyo, why the fuck you tryin to get funky on me nigga?)\nYo, don't you know, who they are motherfucker?\n(Crossbreed's the crew fool)\nThem my niggas!\n\n[Verse Three: Napalm]\nThings ain't easy, cuz we be, strugglin day to day\nA bunch of stressed black men with not really much to say\nTwistin up some brown paper that we struggle just to get\nAll the deaf dumb and blind become mentally equipped\nAs I extend my pen to wreak havoc on paper\nI execute and burn MC's like Absolut with no chaser\nStrong as chemical the general with props\nPast wreckin mics, I make the Earth shatter like the 7th sign\nMy drama bring about a new aura\nI'm sending a plague through your town like God did Sodom and Gomorrah\nThe deepest, my vocals actions got you speechless\nMake gangsta niggas wanna go home and talk to Jesus\nNo man alive could figure we, beating rappers literally\nX-3-D get up on this three dimensional trilogy\nGot no love for foes, no respect for grimy hoes\nNuff said, X-3-D blowing up, case closed", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}