{"songs": [{"title": "Real Niggaz", "album": "In My Lifetime, Vol. 1", "year": "1997-11-04", "lyrics": "[Chorus: Jay-Z]\nReal niggas do real things\nHanging with the honeys is the song I sing\nReal niggas do real things\nOn the road to riches and diamond rings\nReal niggas do real things\nBustin' my toast off the roof, drinkin' 90 proof 'til spring\nReal niggas do real things, check\n\n[Verse 1: Jay-Z]\nWe started out makin', small time bacon\nTwo little niggas bakin', talkin' 'bout whippin' cakes\nGet clothin' and big cheddar, hopin it gets better\nWe had no knowledge of this shit we just was with whatever\nIn front of your building clockin', thought I was makin' a killin'\nRight in front of your children, eight-ball in my side pocket\nThey was corrupt too, disrespectin' the fiends I used to\nLook up to, take it or leave it, fuck you\nIn different parts of the planet, Oakland to New York\nI'm hollerin' Lifetimes, he hollerin' Life's Too $hort\nParallel lives and jew-els held high\nThe Range or the rove, get exchanged, for your soul\nYou know how the game goes, slang to get cheese\nAnd speak in Chinese, everybody gains the same dough\nGet your shit scarred fuckin' with my sick squad\nFrom Marcy, to the Bay y'all, we get large, bee-eeyee-otch\n\n[Chorus: Jay-Z]\nOn the road to riches and diamond rings\nReal niggas do real things\nHangin' with the honies is the song I sing\nReal niggas do real things\nOn the road to riches and diamond rings\nReal niggas do real things\nBustin' my toast off the roof, drinkin' 90 proof 'til spring\nReal niggas do real things\n\n[Verse 2: Too $hort]\nSo now you own a record label, I got one too\nWe on a roll now, can't nobody stop our crew\nYou can treat us like convicts, you know we got records\nOn the shelf and on the charts the double decker\nThe fat donkey house down the block, belongs to me\nYou criticize the way I walk, you wanna see my bankbook?\nI'm not a crook, I flipped the script and changed my ways\nSo I can get paid, everyday\nI see the same old shit, I see in the streets\nI know you think I'm sellin' keys but I only sell beats\nDopefiend music, it's drug related\nYou can buy it on the corner, get a radio and play it\nIt always sounds better when you turn it up loud\nRap music let these motherfuckers know what we about\nI know these gay ass record labels keep fuckin' niggas\nIt's just like in the streets mane, how much you get?\n\n[Chorus: Jay-Z]\nOn the road to riches and diamond rings\nReal niggas do real things\nHangin' with the honies is the song I sing\nReal niggas do real things\nOn the road to riches and diamond rings\nReal niggas do real things\nBustin' my toast off the roof, drinkin' 90 proof 'til spring\nReal niggas do real things\n\n[Verse 3: Too $hort (Jay-Z)]\nThat's right, I been a hustler for a long time\nAlways got the right beats, never sayin' wrong rhymes\nI started off with nothin' ended up with everything\nNow we sip Hennessy in first class on every plane\nAsk Jay-Z, he know what I'm sayin'\nAlways see me at the bank and yes I'm goin' again\nThere ain't no dollar amount, that can make me happy\nFine women, a big house, a truck and a Caddy (that's right)\n\n[Verse 4: Jay-Z]\nNow peep, how sweet, niggas lives can get\nPut beef aside, the East and Westside connect\n$hort Dawg, and Jigga with the, fo'-fo' flow\nI got love for y'all motherfuckers y'all just don't know\nI know y'all got a thing for them rag six-fo's\nI like the five speed drops pop the clutch then go\nIf you're ballin', keep ballin', if you jealous, stop\nI want Biggie to rest in peace, as well as 'Pac\nHow real is that?\n\n[Chorus: Jay-Z]\nOn the road to riches and diamond rings\nReal niggas do real things\nHangin' with the honies is the song I sing\nReal niggas do real things\nOn the road to riches and diamond rings\nReal niggas do real things\nBustin' my toast off the roof, drinkin' 90 proof 'til spring\nReal niggas do real things, check\n\n[Outro: Too $hort & Jay-Z]\nBeyotch! $hort Dawg's in the house\nJigga\nMuch love\n$hort Dawg, get your money mane\nAll the way from the West coast\nUhh, how real is that", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg"}], "artist": "JAY-Z"}