{"songs": [{"title": "Chips On Pistons", "album": "Independent’s Day", "year": "2005-06-28", "lyrics": "[Intro skit for first 43 seconds]\n\n[Royce Da 5'9\" & (Blade Icewood)]\nYeah, yeah\nWhen the rubber band pops from the top of them stacks\nMami drop them tops 'fore them dollars go back\nIn my pocket or the trunk of the black Impala\nWhere the pump just sit for them punks who trip\nBut besides that, life's good - yeah\nThis my nigga Blade right here (you could call me Icewood)\n\n[Ingrid Smalls + (Royce Da 5'9\")]\nIcewood? (Icewood) I could\nGo home witchu baby if the pipe good\n\n[Royce Da 5'9\"]\nWe get a whole lot of scrilla, fo'-fives is wit us\nWhole flight can fill us, Globetrotter nigga\nWhen you see a plus sign in front of like twelve numbers\nOn your cell that's me calling to tell you\nThat I ain't at home (yeah)\nI'm witnessing the midnight sun in Finland with the big robe on\nWith six different funds\nKronas, Pesos, Euros, the list goes on\nWe send henchmen to wet ya\nIn between trips to the Philippines with strippers wit us\nBet chips on Pistons, gassed off Sheed (yeah)\nYelling pass the ball to Rip and Billups, mami\n\n[Chorus: Jay Black]\nIf you got love for me, then do your little dance for me\nTurn that ass around, (turn around) and keep doing what you dooooo\nIf you got a thang for me, then do your thang for me\nTurn that ass around, (turn around) cause you've got it coming\n\n[Blade Icewood + (Ingrid Smalls)]\nTurn that ass 'round, ma you know I'm a clown\nThrow a little money 'round, do my dance to the sounds\nWorth a whole lotta cash, so you know I got the pound on me\nYeah dance for my homie (damn what's the nigga name?)\nFive-Nine (Five-Nine)\n\n[Royce Da 5'9\"]\nPimp game got it going from the first line\nChain plenty hang time, yeah\n\n[Blade Icewood]\nG-4 plane flying, '05 Range driving\nIf the deal ain't least ten mil' I ain't signing\nHeard she can make it do the \"Nolia Clap\"\nIt's Mr. Blade Icewood the new king of rap\nI got these shots for you haters (c'mon)\nTell the waiters bring the shots, use the liquor to motivate her\nTo hop up in the whip, before she leave the lot\nGot my dick between her lips; hand between her hips\nOn some freaky shit, yeah ain't know I did it like that\nShe thought it was all rap 'til she screaming on her back\nPlaya, we send henchmen to wet ya\nIn between trips to the Philippines with strippers wit us\nBet chips on Pistons, gassed off Sheed\nYelling pass the ball to Rip and Billups, mami\n\n[Chorus]\n\n[Royce Da 5'9\"]\nYeah, we hit makers with acres\nWe hit Vegas with chips major, we can't just\nBall like the usual team, we stay whyling\nUp the challenge, fuck it, tear up the palace\nFuck with, nothing but them trucks with, halogen lights\nDid bad in his life, them cuts and calluses\nIn the G-4, in a suit, eating soufflc\nIn the seat big get your coupe, nigga go play\n\n[Blade Icewood]\nHey come over here!\nWell you can have it your way, blow cabbage all day\nIce, everywhere, bought it from all yay\nThis ain't no spaceship, gave the Rover a facelift\nLift the fifth to my lips while she moving her hips\nYeahhh - side to side, I decide\nWhen the time is right for us to slide\nWe ain't moving at the mansion yet, the panty's wet\nThat's how you feel off a pill, why you panicking?\nGo away!\n\n[Chorus]", "image": "https://images.genius.com/5296587baa4eefd1b2b1ef7daff66f78.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}