{"songs": [{"title": "Grab the Mic", "album": "ScHoolboy Turned Hustla", "year": "2008-07-29", "lyrics": "[Intro: ScHoolboy Q, DJ Ill Will]\nYeah\nGED, oh boy\nCan't be reconciling\nIll Will exclusive\n\n[Chorus 1: ScHoolboy Q]\nWe got that front, back, side to side\nLean with it, rock with it, burner might pop with it\nIllest in the game, GED with the flame (Q)\n\n[Verse 1: ScHoolboy Q]\nFirst off, let me get this shit cleared\nAny nigga talk, prolly get his shit smeared\nBack in the trunk, next to the pumps\nHad you floating in the ocean, now you trashed by the dumps\nNifty fifty gang, I was raised in the slumps\nPockets so fat like it's raised by the Klumps\nAny nigga that want it, get it, he can get fitted from long range\nNo game, nigga we bring the pain\nScHoolboy and one letter, you know the name\nKill what? If he doubt it, you know the game\nReload, cock back and let it bang\nPill round, no leash, I'm never tamed\nBeen around the world, whole world know I got cream\nNo lie, I'm the best at this rap thing\nNo pen and I still make the trench scream\nShitting on the mic and wipe my ass with the pop scream\nWho Q? Yeah, he the rap king\nBig Mac? Yeah, she the rap queen\nHate thongs? Yeah, I know they beat me\nAnd my nigga Top gon' be the reason why you a crack fiend\nGod damn, fuck I need to rap for\nOrder anything and I still make the trap go\n\n[Pre-Chorus: ScHoolboy Q, Tyga]\nFront, back, side to side\nLean with it (Hahhh)\n\n[Chorus 2: BMac the Queen]\nWe got that front, back, side to side\nLean with it, rock with it\nBurn the mic, pop with it\n\n[Verse 2: BMac the Queen]\nI'm the queen of the game\nYou already know my name\nHaters gotta love it 'cause my swag is super high\nSuper dope, super fresh, and the way I dress is super fly\nBut I ain't really come here to talk about that\nI'm just trying to show these all niggas that I can rap\nSpit a little crack on the track, fall back\nIf you didn't know the name, now you know it's B-Mac\nHit him from the H to the double O, D\nYou ain't from the hood if you ain't heard about me\nPocket full of cheese, Six Fours on these\nSo please, you don't really want beef with the Queen\nGot a couple thugs on the payroll\nSpraying when I say so, lay low\nYou don't want problems, plus I got a car and a crib I don't pay for\nCased close, you don't really want no drama chill\nI'm loved in the hood 'cause I keeps it real\nLoved in the burbs 'cause my crib's on a hill\nAnd I ain't even say that I'm rich, if a trick wanna trip\nThen the cap get peeled quick\nI be on that real shit\nAnd I know I got that ill spit\nWorked about a meal tick\nCan't nobody do it like I do, ya dig?\n\n[Chorus 3: Tyga]\nFront, back, side to side\nStick this in your Ipod, I promise this you'll like\nBeyond your fly, take the mic\n\n[Verse 3: Tyga]\nLean with it, rock with it\nYou say I'm not with it\nTake a man, he pop with it\nLet's see you album, pop, get 'em\nNo introduction, fuckin' his sister with seduction\nCouple of familiar Russians, rushing to touch it\nAll my busters loving this club, bitch Usher\nOh sure, sex brosure\nChick get skeeted in your Kitty Couture\nOh you on tour? So you perform?\nHow about you let me fuck you, straight form\nNext morn', leave in a cab\nCar, sir, this is the pad\nHow can they argue?\nI'm marketable in a market that you're marching into\nCrazy Compton, Dina Carson, I be roaming\nCouple of homies\nMoney I'm moaning, we spend it like nothing\n'Cause music be keeping it coming\nYoung Money, younger with money\nSkin tag, my life is so lovely\nI'm not worried about nothing\nForgetting every dollar I'm getting\n\n[Chorus 4: Reginae Carter]\nI get 'em front, back, side-to-side\nLean with me, ride with me\nLow lying, Tyga put me on so\n\n[Verse 4: Reginae Carter]\nBear with me, here I come\nI be the broad, not to be broad with\nYou act her Liz, but I know you harmless\nGD not the squad to play hard with\nIf you planning to, I'm Hannibal, like where's your carcass\nYou be talking rank, kiss it, let me sergeant\nYou be talking Spanish, consider me Martian\nYou be talking names, consider me Carmine\nWhoever say they better than Gronk, tell them forfeit\nThey don't want it with me like Sam-I-Am\nThey don't want it with the tea like green eggs and ham\nWould you like it on the plane?\nWould you like it on the train?\nWould you like it on a boat?\nFreaks like the deep throat\nHaters like to get choked\nYou ain't getting every dollar, get broke\nIf you ain't poppin' this off, get low\nThis shit right here wet, get soaked\nI push you from the front back, get dome\nThey spit, crackers spit low\nGod MC, call me Loc\nGot all the fans like hold my notes\nTake one hit at a time, don't overdose\nOne dime though, don't overload\n(Oh my god)", "image": "https://images.genius.com/72de999ec4144de78b4aca2000e5694f.500x500x1.jpg"}], "artist": "ScHoolboy Q"}