{"songs": [{"title": "Hobo Hoeing", "album": "Married to the Game", "year": "2003-10-21", "lyrics": "[Too $hort]\nDaaaamn!\nCan't believe these hoes out here givin away the pussy for the low-low\nShit!  Bitches fuckin everythang, everybody, everyday\nDamn girl!  Better get you some management\n\nAll this time you been trickin for the low-low?\nYou coulda been gettin rich, you just don't know\nGirl you worked all night for that chump change?\nLet them ballers write you off as a fun thang?\nTake my hand - I got a quick plan\nI know you dream about marryin a rich man\nSee his wife in the Benz with the cute babies?\nThe hype'll make your friends and you crazy\nCause you know about his two ladies\nBut he ain't fuckin wit'chu baby\nCome holla at your Uncle $hort\nI'll have you playin these niggas like a sport (HA HA!)\n\n[Hook]\nAll this time you play around, you love to love me lay you down\nIf you'd like to suck a dick, I bet you'd like to fuck a trick\nAll you ladies in the place, I'd love to let you have a taste\nI'll put my dick up in yo' face - why you hobo ho?\n\n[Too $hort]\nMy name is Too $hort, I'm known for pimpin women\nAnd last night, I did it again\nNew money, new bitches\nWhy they actin crazy, who is it?\nI never heard of Too $hort - then you must be a square\nFuck around and get slapped when you fucks with a player\nReal women get much respect\nGolddiggers and groupies, don't fuck with it\nI'd rather get a real ho\nPut the bitch to work and get some real dough\nI don't wanna spend a night for cash\nWhat'chu been doin all day wit your triflin ass? (Bitch!)\n\n[Hook]\n\n[Too $hort]\nI made too many songs, to name the tracks\nNot enough walls, to hang the plaques\nSay hater, what you aimin at?\nYou ain't no G, you can't be claimin that\nYour girl said she had to find a trick\nCause she don't like you, OR your tiny dick\nI don't really care, what she's sayin\nAs long as this song, is what she's playin\nI know she better slow that roll\nI ain't said a word and yo' ho just chose\nYou know I gotta take her from you\nAnd after today, you couldn't make her want you (HA HA HA)\n\n[Hook]\n\n[New Hook]\nI just don't know what bitches see, why all these hoes want chicken feed\nAin't none of these hoes worth 50 cents, so break these ladies all you pimps\nNever have this much fun anywhere, to go back home I just don't care\nMe leave this game no I don't dare - why you hobo ho?\n\n[Too $hort ]\nYou fuckin with me, I'm fuckin wit'chu\nYou fuckin with me, I'm fuckin wit'chu\nYou fuckin with me, I'm fuckin wit'chu\nYou fuckin with me, bitch I'm fuckin wit'chu\nYou fuckin with me, I'm fuckin wit'chu\nYou fuckin with me, you know I'm fuckin wit'chu\nYou fuckin with me, I'm fuckin wit'chu\nYou fuckin with me, bitch I'm fuckin wit'chu too\nFo' sho'!!", "image": "https://images.genius.com/ed8e96dec66a7ff4b3234c0368a7f843.1000x1000x1.jpg"}], "artist": "Too $hort"}