{"songs": [{"title": "Cowboy", "album": "Wolf", "year": "2013-04-01", "lyrics": "[Verse 1]\nKnock-knock, mothafuck it's me, Mr. Clusterfuck\nWhat, when, where, how, like who gives a fuck\nGolf Wang M-O-B, mopping niggas ante up\nAin't been this fucking sick since brain cancer ate my Granny up\nRest in peace or lie in it, life ain't got no light in it\nDarker than that closet that nigga Frankie was hiding in\nOpen it, dope in it, Bobby where's my fucking pipe?\nDress my little dick as Ike, twenty says I hit your wife\nThis is life, truthfully I just want to fly some kites\nGrab Salem and Slater and go around, riding bikes\nGet some ice cream, Golf Wang Roscoe's for the night\nTo skate around and do annoying shit that older peeps despise\nNigga fuck it though, going hard as riga mo\nGot a nigga dollars and a couple cracker kids at shows\nCracked a couple kids in the head with this cast\nHad a blast out Europe, had a Swedish bitch licking toes\nThat's how it goes, designing clothes\nCats on everything, cats on everything\nYou think all this money will make a happy me?\nBut I'm 'bout as lonely as crackers that supermodels eat\nEverybody's sparking but me, and I keep coughing\nCan't keep calm in this spot's hot box and I'm getting nauseous\nHop in the car, ride to Saugus, and head straight to the office\nPissed off at Jasper because that's some faggot shit called \"Pink Dolphin\"\nI roll here on a mean unicorn\nGreen hat, Vans, Golf top is the team uniform\nDowning that Capri Sun, tighten my bandana up\nSomething like a lez, I'm forgetting my damn manners cause\n\n[Hook]\nI am the cowboy on my own trip\nAnd I am the cowboy on my own trip\nAnd I am the cowboy on my own trip\nAnd I am the cowboy\n\n[Verse 2]\nWhen you're alone thoughts start coming in\nPunching in that dark lock box and they start rummaging\nShit you've got to battle with, wishing they could skedaddle\nBut it makes your shadow say none, fun and grab the gun again\nI needed to get out of the house\nSo I hit the Dead Sams, and we went biking it out\nIn a black hoodie, with an Arizona and a bag of Skittles\nJust to see what all that fucking hype is about\nNow everytime you see a roach you think of me, ay?\nCause everytime I see one I think what his parents would say\nIn court saying I ate him, I wasn't present that day\nI was with Whitney smoking, sitting at the dock of the bay\n\n[Hook]\nI am the cowboy on my own trip\nAnd I am the cowboy on my own trip\nAnd I am the cowboy on my own trip\nAnd I am the cowboy\n\n[Verse 3]\nDo you know how weird it is knowing I make a bunch of cheese\nWhile my friends can't afford little pizzas from Little Caesars\nAnd their whole goal is to roll up and smoke bowls\nSo I don't feel bad when they not eating\n(But you still treating us, you punk bitch)\nWolf Haley got more methods than Pinkman\nI'm never civil, fuck Lincoln, 'Preme out the bag it's no wrinkles\nI'm okie dokie and loopy and booboo nana and caca\nIf you think I'm fucking koo-koo, try talking to my shrink then\n\n[Skit: Tyler, The Creator as Dr. TC, Sam, and Wolf]\n\"Hey...\"\n\"Bitch.\"\n\"I'm right here.\"\n\"Yo, who's that..?\"\n\"That's Salem, that's my girlfriend. You stay the fuck away from her alright?\"\n\n[Hook]\nI am the cowboy on my own trip\nAnd I am the cowboy on my own trip\nAnd I am the cowboy on my own trip\nAnd I am the cowboy", "image": "https://images.genius.com/dde81a162bfe7b81092c8630cdf16d70.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}