{"songs": [{"title": "Outro", "album": "Anarchy", "year": "2000-06-20", "lyrics": "Yeah When I step in the spot, motherfuckers say \"who that?\"\nBig Bun B, but you already knew that\nLive from the state where they chop it and screw that\nYou hatin' on the trill OG, where they do that? (for real!)\nMotherfuckers need to get off the dick, man\nFall the fuck back like a bike with no kickstand\nGet out my mix man, just go' get you stuck\nDeeper in the quicksand, with no easy fix, man (damn!)\nNo tricks, man, those is for kids\nCushion, my cigar, and hoes in the crib\nDrank, and the twenty ounce froze in the fridge\nYou fuckin' with DA so you know what it is\nI'm sittin' on the fours that clack\nComin' down candy in the golden 'Lac\nWe gettin' to the money like it's Goldman Sachs\nAnd we do it for the pimps that are holding back let's go!\n\nLook who crept in with automatic weapons\nReppin' QB till the death of him\nThat nigga that inspired lyrical tyrants like Kanye West and Em'\nTrack record goes back to \"The Essence\"\nSmack adolescents who ask who the best is\nI'm nasty like gas from a fat man, attested\nI pass it, you gaspin' for breath and you die fast\nBut I'm like a gastric bypass\nBunch of Nas African actors seemed to get typecast in the same role\nSince sixteen I ain't grow a day old yet my brain grow\nCocaine white Range Rov'\nTats on my body like an art exhibit\nI did real good for a project nigga\nWas once a Bacardi sipper, now it's Chandon\nFat blunts in the car with strippers\nGuns in compartments hidden\nI was real young, little youth, a novice nigga\nBlessings, bowed down, respected\nChowed down now my food's digested\nPow pow, with my shooters are Techs\nBust louder than the noise I just spit\nLet's get one thing straight that my crown ain't for testin' testin'\nChop heads off like King Henry the eighth, guillotine to ya neck, bitch!\nI'm a king in this thing, don't be dumb\nBeen in this shit since ninety one\nNiggas can't fuck with the style I use\nYour fate is sealed, no Heidi Klum\nCalm now, was a wylin' dude, studied cowards that made power moves\nWatched Wild Planet seen lions devour food\nYou can say that's how I move\nA monster nigga, and I don't really like doing songs with niggas\nThere go my nigga Wayne, let them niggas hate\nI love my nigga Drake say \"we ain't got time to respond to niggas\"\n\nI'm a villain, I'm a villain, all that happens in the street\nPoverty and desperation made me everything I be\nI'm a shotta, when I pop up with them poppers burn ya block up\nCall the judges, call the coppers, we takin' over Gotham\nWord to Poppa\nBlood gang, five! It's that Blood gang, five\nBut green is the bottom line\nI run this town, I ain't gon' lie\nThey run they mouth, they ain't gon' fight\nThey actin' like they ain't gon' die\nUntil I let them llamas fly\nFlatbush to Bed-do-or-die\nFrom Watts to Larry Hoover Chi\nPoverty and heroine, it's no place for a juvenile\nPut greed in our heart, it's the green that we want\nCash Money is the company and Weezy the boss!\n\nThey say I'm underrated, but un-compete-with-able\nUnderstandable, being that my rating levels are unreachable\nAnything said other than that should be silenced, unspeakable!\nAnd the thought of you being nicer than me, unfeasible!\nThey ask is what I do ever gonna stop, this shit will never end\nThat's when you hear a car crash in the vocal booth got 'em sayin'\n\"There he goes again!\"\nSee now they nominated a nigga to come and flatten everything\nNow let me dominate it, nigga run\nAnd they be knowin' that I be blackin' on everything\nAnd make it complicated like a nigga constipated with a gun\nI gotta make it what they want and wake 'em when I come and shake 'em\nAnd bake 'em and take 'em to another place\nAin't no fakin', ain't no kind of mistakin' how I be breakin' up\nEverything and be creating a s-s-s-situation when I'm done (Damn!)\nYou see I spit National Treasure, discography rich\nAnd I done killed more cats than curiosity, snitch!\nMost of you niggas sorry and owe apologies, quick\nWhat the fuck you niggas still hangin' around here for\nYou apostrophe bitch?\nOK, now enough of that, see now I'm out the door\nTunechi, thanks for giving us a whole 'nother classic\nWith Tha Carter IV", "image": "https://images.genius.com/c03e10c88fa343cd2e7c18112c468983.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}