{"songs": [{"title": "Rain All Day", "album": "The Meth Lab", "year": "2015-08-21", "lyrics": "(Verse 1 – Method Man)\nHey. I swear I never change\nIf I’m with you in the sunshine, I’m with when it rains\nI’ll never switch, I’m still the same\nGet caught up in the mix, I never snitch or give up game\nI’m no squealer\nPolice be trying to pick the killers brain\nNot familiar, that’s why some brothers go against the grain\nI’m La Familia, I’m hands on\nBut that don’t mean the name I’m tryna fill ya\nMy hands strong, i ain’t trying to take your chain\nI’m trying to kill ya\nOrangutan, you monkeys tryna\nHang like you’re gorillas\nI give you Wu-Tang slash gilla\nThe object in the mirror, Mac Miller\nMy method is the illest slash illa\nI’m trying to get the guap, cash scrilla\nBut whitey only see a crack dealer\nMichael Jack thriller, this is not The Walking Dead\nRapper think he’s Chalky White\nHe get the white chalk instead\nMeth Lab, killing everything that’s in the way\nUntil the son say\n\n(Bridge)\nThe Meth Lab dudes don’t play\n\n(Verse 2 – Hanz On)\nHad these dude thinkin’ damn, when it rains, it pours\nNews flash, Meth back, whole Staten with him\nCouldn’t come to terms, how they playing with this rap\nDon’t be understanding all the substance that it lacks\nGorilla out the traps, bout to flip\nTen years gone probably saw him in the flicks\nRed tails Belly, motherfucker, was the shit\nRap coalition, meth lab, get em lit\nYo it’s crazy how these nigga’s try and do it like we did it\nCareful if you copy end up money on your fitted\nSide line critics\nHate the bully with the Wesson’s\nI swear to god in heaven, don’t get caught without your weapon\nCaught without your weapons, it get ugly in a second\nSidearms hover like we bought ‘em from The Jetson’s\nMeth lab, vocab, kill ‘em where they lay\nGot ‘em sittin’ sayin’\n\n(Bridge)\nThe Meth Lab dudes don’t play\n\n(Verse 3 – Dro Pesci)\nI’m used to the rain, I don’t see the sun too much\nNocturnal hustler grinding, holding them drugs too much\nBench press my pen, on my fresh pad\nJust left the crack house, I’m headed to Meth’s lab. The tech jab\nCowards in their face when they scheming I bet cash\nFrown up on their face leave ‘em bleeding, who want’s what?\nThat’s my attitude all day, You snooze, you lose, that’s why I’m making moves all day\nThe tool gonna spray\nI suggest you stay in your lane\nStaten niggas ain’t playing, you get banged for your chain\nI bang with a gang, a poppin mind bangin up thangs\nAccurate aim, well-trained, angle and range\nDismantle your frame, microphones blown into the flames\nPesci the name, Professional, perfecting the game\nI’m wrecking these lanes\nSharpshooter killing all day\nHad these haters say\n\n(Bridge)\nThe Meth Lab dudes don’t play", "image": "https://images.genius.com/fafd5b6184e352f00d35852ac8b31946.1000x1000x1.jpg"}], "artist": "Method Man"}