{"songs": [{"title": "What About Me", "album": "Tha Carter V", "year": "2018-09-28", "lyrics": "[Intro: Lil Wayne]\nIf you saw me, would you understand\nThat I can't stand you with another man?\nI see you happy where your life is at\nI see you smile, I can't live with that\n\n[Chorus: Lil Wayne]\n'Cause what about me? Yeah\nI stayed up all night for you\nGirl, girl, what about me? Yeah\nI shut down my life for you\nNow you run around with him, and him, and him\nHow you do that?\nHow you act like I never held you every night?\nAnd now you never call back, please\nGirl, girl, what about me?\n\n[Verse 1: Lil Wayne]\nOh, tell me, do you ever think about it?\nThose lonely nights when you 'bout lost it (Oh)\nThe only time that you would call\nWas just to tell me it's my fault (Oh)\nI let you cry, I let you worry\nI let you yell, I let you hurt me (Oh)\nI gave you everything you needed\nNow you gone, gone, gone\nTell me, how you do that to me? Yeah\n\n[Chorus: Lil Wayne]\nGirl, what about me? Yeah\nI stayed up all night for you (Yeah)\nGirl, girl, what about me? Yeah (Girl, what about me?)\nI shut down my life for you (I shut down my life)\nNow you run around with him, and him, and him\nHow you do that? (Oh)\nHow you act like I never held you every night?\nNow you never call back, please (Please)\nGirl, girl, what about me?\n\n[Refrain: Lil Wayne]\nOh, girl, girl, girl, what about me? Me?\n\n[Verse 2: Sosamann]\nDo you think about me\nWhen I'm flying OT, I be up in them streets\nYou tellin' me that you gon' leave\nHittin' my phone with the beep (Boom!)\nKnock it out, baby, creep\nOh, 'cause I just wanna see you smile\nDid none of them tears ain't for you, baby\nAnd they ain't matchin' yo style\nI'm kickin' it flav with yo sauce\nI'm counting them lovers\nI'm thinking bout you, and all of the things that we used to do\nAnd all of this you went through\nGirl, I don't want you with no other dude, yeah\n\n[Chorus: Lil Wayne & Sosamann]\nGirl, what about me? Yeah (Girl, what about me?) (Oh)\nI stayed up all night for you (I stayed up all night) (Oh)\nGirl, girl, what about me? (What about me, girl? Yeah, what about me, girl?)\nI shut down my life for you (I shut down my life)\nNow you run around with him, and him, and him\nHow you do that? (How, girl?)\nHow you act like I never held you every night?\nAnd now you never call back, please (Please)\nGirl, girl, what about me? Me? (Yeah, what about me?)\nOh-ho-oh", "image": "https://images.genius.com/9e2d71d269b2971975d5d9ca36deb943.1000x1000x1.jpg"}], "artist": "Lil Wayne"}