{"songs": [{"title": "Ye vs. the People (starring TI as the People)", "album": null, "year": "2018-04-27", "lyrics": "[Intro: Four Tops]\nOh, oh, oh, oh\nOh, oh, oh, oh\nI had for us\nYou turned my dreams into dust\nI watch a phone that I had for us\nYou turned my dreams into dust\n\n[Verse: Kanye West & T.I.]\nI know Obama was heaven-sent\nBut ever since Trump won, it proved that I could be president\nYeah, you can, at what cost though?\nDon't that go against the teachings that Ye taught for?\nYo, Tip, I hear your side and everybody talk though\nBut ain't goin' against the grain everything I fought for?\nProlly so, Ye, but where you tryna go with this?\nIt's some shit you just don't align with and don't go against\nYou just readin' the headlines, you don't see the fine print\nYou on some choosin'-side shit, I'm on some unified shit\nIt's bigger than your selfish agenda\nIf your election ain't gon' stop police from murderin' niggas\nThen shit…\nBruh, I never ever stopped fightin' for the people\nActually, wearin' the hat'll show people that we equal\nYou gotta see the vantage point of the people\nWhat makes you feel equal makes them feel evil\nSee that's the problem with this damn nation\nAll Blacks gotta be Democrats, man\nWe ain't made it off the plantation\nFuck who you choose as your political party\nYou representin' dudes just seem crude and cold-hearted\nWith blatant disregard for the people who put you in position\nDon't you feel an obligation to them?\nI feel a obligation to show people new ideas\nAnd if you wanna hear 'em, there go two right here\nMake America Great Again had a negative perception\nI took it, wore it, rocked it, gave it a new direction\nAdded empathy, care and love and affection\nAnd y'all simply questionin' my methods\nWhat you willin' to lose for the point to be proved?\nThis shit is stubborn, selfish, bullheaded, even for you\nYou wore a dusty-ass hat to represent the same views\nAs white supremacy, man, we expect better from you\nAll them times you sounded crazy, we defended you, homie\nNot just to be let down when we depend on you, homie\nThat's why it's important to know what direction you're goin' now\n'Cause everything that you built can be destroyed and torn down\nYou think I ain't concerned about how I affect the past?\nI mean, that hat stayed in my closet like 'bout a year and a half\nThen one day I was like, \"Fuck it, I'ma do me.\"\nI was in the sunken place and then I found the new me\nNot worried about some image that I gotta keep up\nLot of people agree with me, but they're too scared to speak up\nThe greater good of the people is first\nHave you considered all the damage and the people you hurt?\nYou had a bad idea and you're makin' it worse\nThis shit's just as bad as Catholic preachers rapin' in church\nY'all been leadin' with hate, see I just approach it different\nLike a gang truce, the first Blood to shake the Crip's hand\nI know everybody emotional\nIs it better if I rap about crack? Huh? 'Cause it's cultural?\nOr how about I'ma shoot you? Or fuck your bitch?\nOr how about all this Gucci, 'cause I'm fuckin' rich?\nYou'll deal with God for the lack of respect\nStartin' to make it seem like Donnie cut you a check\nNow you toyin' with hot lava, better be careful with that\nWhat's it mean to gain the world if you ain't standin' for shit?\nOkay I gotta say it, Ye, you sound high as a bigot\nYeah, genocide and slavery, we should just try and forget\nAnd all that free thought shit, find a better defense\nBut if Ye just stuck in his way, he can leave it at that\nFuck it\n\n[Outro: Kanye West]\nAlright, Tip, we could be rappin' about this all day, man\nWhy don't we just cut the beat off and let the people talk?", "image": "https://images.genius.com/45216c2c9146eda839b32c37915cfa76.1000x1000x1.png"}], "artist": "Kanye West"}