{"songs": [{"title": "Rhymes Galore", "album": "When Disaster Strikes...", "year": "1997-09-16", "lyrics": "[Intro]\nRhymes galore, rhymes galore\nRhymes galore, rhymes galore, rhymes galore\nRhymes galore, rhymes galore\nThis for the motherfuckers out there on some real hip hop shit\n\n[Verse]\nYo, yo yo, mayday mayday, mayday mayday\nWalk barefoot on niggas like Kunta Kinte\n(So, what you say?)\nWhat is you doin' when you walkin' this way\nI burn you like I'm smokin' a chalice with El Da Sensei\n\nI be designin' fashion like Mark Buchanan\nYes I keep it slammin'\nShit just be bangin'\nJust like a loose cannon (blaow!)\n\nYou better park, niggas\nI spark niggas, like sharp niggas\nI stay up rippin' shit apart, niggas\nFloat over water like Noah's Ark, niggas\nCover yo' face, and don't get caught up in the scene when it get dark, niggas (uhh?)\n\nExcuse me Mrs!\nSure to hit you with the fitness\nGive you niggas the sickest\nJumpin' Jehovah Witness\nBeamin' in on niggas plottin' and schemin'\nAnd steady dreamin'\nOn how they gon' do they double-teamin'\n\nFuck the bullshit!\n\nMy nigga it be best you know 'bout it\nBefore you get secret indicted\nMake me slap a nigga lopsided\nHold up, son listen it be so beautiful\nWhen we catch you\nLike a nigga sold us too much pharmaceuticals\n\nCome and get it quick!\n\nWhen Busta Rhymes be up in the place\nThose who don't like it, go get the dick I'll give you a taste!\nAiyyo you need to just focus on my earth tremblin' rhymes\nThat got me fillin' in by the million\nFuck-a yo' opinion!\nDominatin' like Kings Dominion\nLeanin' on niggas like we on motorcycles pop-a-wheeliein'\n\nAiyyo, number one roman numeral\nCompleting the executional shit as usual\nI ain't scared of ya!\nTakin' all of yo' paraphernalia\nThat's my word on Mrs Mahalia\nI hope you know yo' best bet\nIs to get the fuck out of my area\nBefore I rip you from out yo' interior\n\nAnd I hope you know you got to keep a corny nigga smothered\nGrab the gat off the cupboard\nYou never know when shit is safe so keep yo' face covered!\nWhile I be scorchin' it\nA lot of niggas be lookin' for alternates\nAnd still just lose they life that's so unfortunate\n\nTrailblazin' me, since my mother started raisin' me\nHit you with the powerful shit that sometimes amazes me\nI create junkies just like \"12 Monkeys\"\nSpreadin' right throughout yo' block\nCatchin suspects who thinkin' they so lucky\n\nLoud and clear for those who cannot properly hear\nFrequency so loud, shatter, couple ampere in yo' chandelier\nNow when I'm in the place, give me my space\nNothin left for me to do, my niggas blew up the place\nWhat the fuck\n\n[Outro]\nI got rhymes galore, rhymes galore\nY'all, I got rhymes galore, rhymes galore\nMy Flipmode niggas got rhymes galore, rhymes galore\nBusta Rhymes got rhymes galore, rhymes galore\nAiyyo yo, we got rhymes galore\nYo we got rhymes galore, rhymes galore\nRhymes galore, rhymes galore, rhymes galore\nMe and my Squad got rhymes galore!\n\nFuck that", "image": "https://images.genius.com/c81a637e4015a2a4f63a6790ebd3ee6f.1000x1000x1.png"}], "artist": "Busta Rhymes"}