{"songs": [{"title": "Blows to the Temple", "album": "Can I Borrow a Dollar?", "year": "1992-10-06", "lyrics": "Check it\nWe can go, toe to toe, with the blows to the temple (NOT)\nNot the Temple of Doom, so make room\nFor the Unamerican Caravan (who you down with?)\nThe B-Boys, Immenslope, Twilite Tone, Derrick and then some\nI don't get rid of some faces\nWhile marks be lookin hard, and they be beggin bases\nThey have too many cases, and now they got courage\nSorta like Goldilocks, tryin to take Pop's porridge\nBut I got, the story straight\nPlus the name, I got rep, don't dare sleep\nSlept and got, crept\nAn AC/DC spider went up the wall we mount\nNow came down the Common the Common Sense, and now the spider out\n(BOOM) A blackout, power failure\nI ain't the Burger King, but I got a whale of blows\nUppercuts jabs hits and hey niggas\nCause I'm weird they call me Lemonhead, but I'm a Jawbreaker\nAnd I break a Bean, but I'm not from Boston\nI'm stronger, and faster, than Steve Austin\nCommon'll keep the camera movin -- I'm kinda fast!\nI'm from a town called FRESH OFF A NIGGAZ ASS\nAnd I'm about to go on like Stephanie Mills\nYOU MUST be poppin pills, tryin to step to me\nCause to the left of me, WE got the U-A-C (whattup)\nAnd comin up to the right of me, WE got the U-A-C (come on)\nAnd in back of me, yo WE got the U-A-C\nAnd in front of me (BAW!) is a dead man G!\nWe hit em hard!\n\n..\n\nKick it\nA duck tried to buck, but the vic got vicked\nSo I picked him, he's another victim of a circumstance\nHe did a dance like Ali (SAY WHAT?)\nBut he floated like a waterfly and stung like a C\nYa see, I ain't out here, tryin to be a bully\nNor am I pretendin to be a two-shoes goodie\n(WORD IS BOND) that I got big balls homes\nAnd if a player try to press me, I gotta break the zone\nHere to stage a, OOH SHIT, up in the sky\nYou better watch out, I'm tellin you why\nCommon Sense is breaking, marks down, ah-follow-me-now\nYo Common Sense is breaking, marks down\nUhh, check it, check it, check it\nI huff and I puff and I blow (WHAT?)\nThe motherfuckin house down, I guess you didn't know!\nHomeskillet, WHERE YA BEEN? Are you the boy in the plastic bubble?\nOoh you in trouble!\nA tisket a tasket, you're gonna get your ass kicked\nYou better know what's in my jacket, fuck the basket\nOh, God damn CHILD, I mean it's drastic\nYou end up on a stretched cause I stretch you like Plastikman\nFuck with me (\"you end up the in the cas-ket\")\nYou flow ass pussy nigga, sucker duck bastard\n(Yo Common calm down, you gots to calm down!)\nThis Grape tried to step to me, with his arms down\nLesson number one - when you're ready to throw\nNever step up talkin - that's like tryin to pitch, but you're balkin\nAnd I'mma steal first, not the base, but your face\nYou can call me Pencil Petey cause the marks I ERASE\nIn case of emergency, it's urgent see, that you see a doctor\nYou tried to Gamble, but I'm the Proctor\nI knock that ass, bringin it down and then slash\nTried to play me with a skit, but now you got a gash\nYou character, for ya inherit a, neck brace\nMakin ya thousand deaths times worser than a Screwface\nBut they call me Screwneck and I do wreck shit\nSo next time he push up in the jam, BOY YOU BETTER EXIT\n\nLate Show in the house\nU-A-C in the house\n7-D in the house\nR-T-A in the house\nTrue B-Boys in the house\nDem Dere Dyslexics in the house\nAnd we gonna fuckin blow the house down\nCheck it, hit em with a\n\nBlood clot boy, you get bucked, tryin to fuck with the\nMario, Super Super Brothers like Mario\nHere the Common, sucker clucks (what we do?)\nMission upon the loves, gettin kisses, and hugs\nBut then we runnin to a scrub that tried to bug\nHe's out to get some what they call em stunts because we bunt\n(WHAT?) But I don't bug, I just slide her, and hit her\nSome be rumpy chump, with the chat chat chitter\nYo we did her but I betcha know I'm better on it\nNow you got a 100 percent beef, it's just a beatdown\n(UH UH AHH!) Too late to try to be down\nBrother your best bet, is to cover your eyes, like Dee Brown\n(Cause it's a bum bum bum, bum-rush)\nAnd if I ask who popped shit, the Caravan gotta bus\nSing it (\"on that defense\")\nBut our bumrush is well done, not medium rare\nIt's rare to see, an enemy within play\nTrue indeed a lot of shit, is over he say she say\nMe say, Warriors come out and play\nAnd I'mma tear shit up and leave it like the day, after\nAnd after we go around, and you hit the ground\nThen you know I'm down with the Blows to the Temple\n\n* shout outs *", "image": "https://images.genius.com/e3b1b8cdac9f386a42441991d28a760b.624x624x1.jpg"}], "artist": "Common"}