{"songs": [{"title": "Weezy Baby", "album": "Tha Carter II", "year": "2005-12-06", "lyrics": "[Intro: Lil Wayne]\nYeah\nMy girl get in at 1:15 am (Yeah)\nThe guitar's cryin' right now\nJust a couple things goin' on in my life, you know?\nTch...\n\n[Verse 1: Lil Wayne]\nBrim leaning (Yeah), cup tilted (Yeah)\nBlunt flickin', get money, fuck bitches (Ha!)\nYoung Weezy (Ow!), young pimpin' (OW!), she love it (Yeah)\nI keep goin', she keep cummin', what you know 'bout it? (Nothing!)\nSo 'bout it (Yeah), like Master P (Ooh)\nBut no coward (Uh-uh)\nNo, I am no Howard the Duck, duck! (Bow!)\nLead showers (Yeah), black flowers (Yeah)\nBlack dresses (Yeah), two hours (Yeah)\nClosed casket, ugh (Awh!)\nMy dough tactics is so crafty (Yes!)\nNo laughter (Ugh)\nI do that after I get the dough, bastards (Stupid)\nI get the dough faster (Yes), what if I flow faster? (Damn!)\nLike, oh, Nancy the four's plastic, automatic, I'm (OW!)\nMore drastic, you're no-names compared to me (Yeah)\nWho are you? Where are ya?\nI can't see, you're air to me (Nothing!)\nYou're not there to me (Nothing!)\nI ain't fuckin with you bitch niggas (Ha!)\nI'm fucking your sis nigga, it's Weezy! (Yeah!)\n\n[Hook: Nikki & Lil Wayne]\nIf you gon' call him Weezy\nYeah, yeah, y-yeah, that's, that's me\nThen you must say the baby\nAh! Ugh, g-geah, g-geah, g-geah\nBitch, please say the baby\nIf you don't say the baby\nAh, ah, ah, ah, if you don't say the baby\nThen just don't say it at all\nShut the fuck up, shut the fuck up, bitch!\n\n[Verse 2: Lil Wayne]\nYeah! Yeah, I'm slick as an old mack, I'm (Yeah!)\nSick as a Prozac (Yeah), and the Carter 1 was the (Ha!)\nDick for you hoes trap, and (Ah!) this is Tha Carter 2 and (Yeah!)\nThis is the bozack, ah (Oh!), diggin you hoes back (Bitch!)\nQuick if I blow back, got it, gone, Rabbit (Oh!)\nFast, my daddy Rabbit's at home, what up, pa? (What up?)\nWhat up, Pac? (What up?) What up, Pun? (What up?)\nWhat up, Big? (What up?) What up, Soulja? (What up?)\nAs the streets get colder, I get chillier (Yeah!)\nWhat up, Left Eye? (What up?) What up, Aaliyah? (What up?)\nTech-9 close by, touch 'em up (Yeah)\nI shoot niggas in the mouth, boy, pucker up (Mwah!)\nSweet succotash (Ah), gee, golly, what the fuck? (Ow!)\nWhere the hell all these new pussy rappers come from? (Huh?)\nI chew 'em up like bubble gum, yum yum (Hehe)\nYoung Weezy so troublesome, what-what! (Ow!)\n\n[Hook: Nikki & Lil Wayne]\nIf you gon' call him Weezy\nThat's, uh-uh, uh-b-baby, that's me! Ugh\nThen you must say the baby\nUgh, g-geah, I said gon' do me a favor\nAnd please say the baby\nIf you don't say the baby\nUgh, geah, ugh, but-but if you don't say the baby\nThen just don't say it at all\nShut the fuck up, uh-shut the fuck up, bitch!\n\n[Verse 3: Lil Wayne]\nI ain't talking fast, you just listening too slow (Yeah)\nI'm, gettin them Benjamins, can serve like the Wimbledon (Yeah)\nIf I'm in any predicament, nervous? Never that\nGot a gat to knock whoever back, back! Very flat (Yes!)\nChest, caved in, mess on the pavement\nSplat, cherry wax, rrraaahhh! Bury that (Ha!)\nRats, scary cat (Ha!), rrraaattt! Carry that (Ha!)\nHollygrove triggerman, guns in a knapsack (Boop-boop-boop!)\nYeah! Area code, five-zero-four (Yeah)\nI am Nino fucking Brown and this is The Carter, ho! (Oh)\nThis is a quarter stick, this in ya garter, ho\nLeave out the back and go straight to the corner-store (Heh!)\nReturn with the cake, come with all my dough (Yeah!)\nIf not they find you in a lake in the morning, ho (Ohh!)\nWeezy Baby, please say the \"Baby\" (Ayy, ayy, ayy)\nIf not, don't you motherfucking say it at all, ow! (bitch!)\n\n[Hook: Nikki & Lil Wayne]\nIf you gon' call him Weezy\nYeah, uh-babe, uh uh, uh-b-baby, that's me!\nThen you must say the baby\nG-geah, g-geah, g-geah, g-geah\nUh-do, up-ah, say the baby!\nIf you don't say the baby\nUgh, yeah, yeah, yeah, y-yeah\nIf you don't say the baby\nThen just don't say it at all\nShut the, uh-shut the fuck up\nUh-shut the fuck up, bitch!\n\n[Outro: Lil Wayne]\nIt's real pimping, ugh\nIt's real pimping going on, right, bitch!\nYeah, yeah, yeah, yeah\nYou could be my bitch\nAh, uh-ah ah ah-ah\nIt's real pimping, real pimping, ow!", "image": "https://images.genius.com/98c56aa11e01a9c25b7485cc3a25c78f.300x300x1.jpg"}], "artist": "Lil Wayne"}