{"songs": [{"title": "Freedom", "album": "Jesus Piece", "year": "2012-12-11", "lyrics": "[Verse 1: Game]\nHoldin' my daughter in the booth\nHer momma out there somewhere in that Bentley trynna find a roof\nPoof, I wave my wand and here comes Kendrick\nNiggas say the west ain't winnin', I'm just tryin' to find the proof\nSpeakin' of Proof, I'm 'bout to roll one with Snoop\nBlow the smoke out to your memory and toast to Eminem\nCause he, gave me the shit that I needed on Documentary\nKeep it real with myself, I got murdered like John Kennedy\nBut that was cool cause I was just there for the energy\nWatchin' Bizarre pop pills while 2Pac in my hennessy\nFirst time in Detroit, had to rock the Grant Hills\nCause I threw up my dukes when California was at a stand still\nBut hope ain't lost cause Dr. Dre the man still\nHad faith in me, knew I had heat like an anvil\nRan through entire crews, put their remains in a landfill\nAnd I ain't lost the hunger, I'm eatin' out the can still\n\nYeah, wherever Hov and Nas at in the world right now\nI know they listenin' like\nThis young nigga be killin' this shit\nHip-hop is life's Cîroc I'm 'bout to drop a pill in this shit\nLet's go, esco bars nigga, like Nas nigga\nThe flow is Rakim with the Birdman cars nigga\nHold on I gotta take Birdman's call nigga\n\n[Break]\nStunna, whattup blood?\n\"Whattup blood? What's poppin' my nigga?\nLook, I know this the last one after this it's straight Cash Money, my nigga\nSo, it's YMCMB, wild life my nigga, let's get it poppin'\"\nRich Gang\nAll the time one hunnit\nSoo Woo\n\n[Verse 2: Game]\nNew coupe, remove roof\nI'm from where niggas'll do your bitch and bitch niggas'll do you\nInevitably we take celebrity bitches and run a chu-chu\nWe puttin' on magnums, taggin' that wagon, some of these birds kookoo\nAnd murder is what I do to\nThese Just Blazes, Kanyes, shit on Swizz, I handle my biz\nThe whole world know what I do to Dre's shit\nNiggas know I'm classic, I ain't even gotta say shit\nFrank Ocean more of a man than you niggas, get up off that gay shit\nFuck copyin' styles, niggas be tracin'\nWhether it's me, the movie, or Jadakiss, niggas just can't fuck with Jayceon\nLet's go\n\n[Chorus: Elijah Blake]\nLaa, da da da dup da ah\nThought you love me before\nI'm glad to kill it some more\nEvery hood needs an anthem\nLaa, da da da dup da ah\nWinning comes with a price\nNo matter how hard you try\nCan't buy freedom\nWe're far from being free\nYea we're far from being free\nWe're far from free\n\n[Verse 3: Game]\nWanna welcome everybody to Jesus Piece\nAfter my album fades, my competition will lyrically be deceased\nNiggas saying I'm underrated\nLike a younger Jay with heat, but not the ones the Thunder play with\nSo Los Angeles King is sort of an understatement\nLet me find a gun to play with, I leave you niggas under pavement\nTell 'em they rent's due, pay up or get cement shoes\nAll this dope be around, you act like I ain't lean on that fence too\nBut now you up here and bitches and cars is what I'm into\nYou wanna send me to God, I wear 45 in that French shoe\nI fuck with Wale, Ross, and my nigga French too\nAnd me and Face just slashed the last beat up like a ginsu\nMy album like a 'Rari, a lot of dope features\nGlad you bought it, now sit back and just blow reefer\nI know the concept behind it is gon' reach ya\nNow turn this motherfucker up and blow speakers\n\nLadies and gentleman\nI would like to introduce to you\nAn incredible gentleman\nHe goes by the name Elijah Blake\nLet's go\n\n[Chorus: Elijah Blake]\nLaa, da da da dup da ah\nThought you love me before\nI'm glad to kill it some more\nEvery hood needs an anthem\nLaa, da da da dup da ah\nWinning comes with a price\nNo matter how hard you try\nCan't buy freedom\nWe're far from being free\nYea we're far from being free\nWe're far from free\n\n[Outro: Game]\nAnd last but definitely not least\nI wanna send a special shout out, to my nigga James Harden\nAnother Los Angeles nigga carrying rockets\nBallin' on you bitches\n\n[Skit: Kevin Hart]\nAy man, look\nYou done rocked with my nigga Game\nFirst of all Game, shouts out to you\nYou put your foot in this album's ass\nHere's the thing man\nThis is your public service announcement for free\nThis is from me, to you, and everybody who listens to this album\nAt the end of the day, man, you can't be judged\nIf you a man to God, then be a man to God\nIf you a nigga from the streets, god damnit, be a nigga from the fucking streets\nAt the end of the day, you are who you are\nGod made you for a reason, man\nNow I'm not saying go kill nobody\nI ain't saying go smack ya lady in the face\nWhat I'm saying is, be who you think you are, man\nDon't mix that shit up\nAt the end of the day, look\nAm I perfect? No\nDo I want to be perfect? No\nDoes God know I'm not perfect?\nWell that's a fucking question mark, cause here's the thing man\nCuz I'm praying at the wrong times of the day\nThat's weird, and I'll talk to you about that later\nBut man bottom line what I'm saying is this dude\nBe you do you, can't nobody judge you but you\nAnd at the end of the day if you doing hat you supposed to\nThen fuck it man!\nYou got one life! Live it!\nWith that being said\nPray for me", "image": "https://images.genius.com/dd068b5a01b261090f4744693ea09c67.1000x1000x1.jpg"}], "artist": "The Game"}