{"songs": [{"title": "Smackdown (Back Down Royce)", "album": "D12 Limited Edition Mixtape", "year": null, "lyrics": "[Intro: Kon Artis]\nHaha, yea, Mr. Porter (D-Twizee)\nThat's right muthafuckas we back, say it (D-Twizee)\nYou know we came to fuck the game up right? Come on (D-Twizee)\nSay it again, who? (D-Twizee)\n\n[Verse 1: Kon Artis]\nI'm sick of niggas all loud, with they half ass talk\nLike we some hoes or something, like our heat don't spark\nWe ain't Royce mufucka, we don't speak in vain\nWe don't act like we street, we do not say names\nWe don't ask Em to book us in the door to get a deal\nAnd then turn our back on him when he need his boys for real\nYou done got dropped by everybody I know\nGoon Sqwad, AWOL, and a couple of hoes SO\nThat's neither here nor there dawg\nHis first video was shot up in NY y'all\nIs this nigga the king of Detroit\nOr the king of gettin' his ass whipped and left by his boys?\n(I heard his crew was hot) is you serious dawg?\nD-Elite? I ain't even gonna speak on y'all\nY'all ain't worth it, half of your boys wear turbans\nAnd Cha Cha's a toss up nigga, keep on burping\nI wanna see that lil' nigga Tre one up\nI fight him with one arm, tell Peter put the gun up\nI don't need it, I'm swift on my feet\nWith women orthopedics, tell Kino to stop pagin' me\nWhen I'm in meetings, you like Ja Rule\nTakin' ecstasy and speakin' out the side of your neck nigga\nYou need to retract statements he made you reject\nJIGGAAAAAAAAAAAAAAAAA hahahaha\n\n[Hook: Bizarre]\nYou act like you from the D but you from OP\nYou ain't hard you need to put that ass and\nCRACK DOWN\nI know you wish you was Jay-Z, 50\nD-Twizee, bitch but you ain't so\nBACK DOWN\n\n[Kon Artis]\nYo Eminem has got him a deal\nHow can he write now?\nI ain't seen D12 mess around\nThat's Ryan Montgomery, thinkin' out loud\nWith rhinestones in his doo rag, you tough dawg (WOW)\n\n[Verse 2: Bizarre & Swifty McVay]\nSo what? Your father taught you how to box (get him)\nYou didn't say that shit when Goon Sqwad hit the spot\n(nigga left yo' ass nigga)\nD-Elite y'all niggas ain't tough guys\nEX Gov I beat yo' ass with some bean pies (you know it, I know it)\nSo what if Journalist is your cousin?\nWho gives a fuck? Bitch my employment Dirty Dozen (WHAT?)\nOr Runyan Ave will put 2 in your face (BOW!)\nQuick to catch a case, don't make me have to run up in Sutton place\nIs it our fault you a fake LL?\nD12 (D12!) the reason your lil' record won't sell (7 thousand copies nigga)\nMarshall made your hook, gave you a million in cash\nGoddamn! Don't you want me get wall street tatted on his ass?\nKing of Detroit, aww so sweet\nThat city heat with your ass beat in the middle of the street (FUCK THAT)\n\nHahaha....and they threw your chain back at you nigga! (TAKE THAT SHIT BACK NIGGA)\nRemember all your battles? Hahaha, I know you don't, but your brother do!\nD-Twizee!\n\n[Ad-libs: Swifty McVay]\nI ain't even gotta say shit on this track nigga\nYou ain't the king of Detroit, you a ho' ass nigga\nYou from Oak park nigga, fuck you, fuck the D-Elite\nFuck little ass Tre!\nBo Little, nigga, all y'all muthafuckas\nYouknowhatImsayin? Y'all can't fade us\nAnd you mad 'cause we made you\nYou ain't make us, we D12 nigga\nUntil we die! Nigga, you ain't from Detroit\nSo you a muthafuckin' lie! What?\nD-Twizee!\n\n[Hook: Bizarre]\nYou act like you from the D but you from OP\nYou ain't hard you need to put that ass and\nCRACK DOWN\nI know you wish you was Jay-Z, 50\nD-Twizee, bitch but you ain't so\nBACK DOWN\n\n[Bizarre]\nHaha...don't fuck with us nigga...haha", "image": "https://images.genius.com/a9a6c306e6ebd80f4136c1c7407750f9.587x600x1.jpg"}], "artist": "D12"}