{"songs": [{"title": "I’m Back (remix)", "album": null, "year": null, "lyrics": "[Intro ? Kurupt]\nOne timers are ignored and suckers are banged on (bitch!)\nBusters get popped in they mouth for nothing (bitch!)\nYeah, it's Kurupt Young Gotti, Against the Grain. Holocaust 92's started!\nAnd y'all bitch ass niggas gotta beat it. Just to let y'all know nigga... I'm Back!\nKeepin' it real gangsta'd up... and bitches get banged on too... bitch\n\n[Chorus X3 ? Kurupt]\nI'm Back!\nWhere ya at? Back home\nWhere ya headed? To the hood\nWhat you up to? No good, motherfucker!\n\n[Verse 1 ? Kurupt]\nLlac's ain't never scraped like it\nHopped up jumped and ran away like it\nWrapped up in rope and yellow tape like it\nNever was collected, never was respected\nNever was ejected, just up and left it\nSocked niggas decrepit, nigga I'm Back!\nMini 14's selected nigga, I'm Back!\nSelect your selections nigga, I'm Back!\nMark up the sections nigga, I'm Back!\nNapalm and auto, hell in Acapulco\nFuck international, I'm Death Row loco\nWith a trigger man and a Death Row logo again\nAnd all permits are passed to go loco again\nI can spritz, I can skitz and I spits like vipers\nGotti's a sniper, nigga I spits like gatlings\nWith a new Commander-in-Chief that appointed me Captain\n\n[Chorus]\n\n[Verse 2 ? Kurupt]\nA walking semi-auto, Ricardo the Great\nGoing bananas, bonkers as baboons and apes\nI love the homies; just tell me whether the homies love me?\nPositioning myself to a higher degree\nRemember me? Calico Jerome, motherfucker\nTeflon took the tone, motherfucker\nC'mon lift your face, chest up, and your chin\nHold it steady, tell the homies, hold up\nDon't slap them cos I'ma be the first one to throw bombs at em\nAnd I'ma be the first one to throw a chrome in em\nAnd I'ma be the first one to thunderdome with em\nNigga, this is Kurupt Young Gotti in case you don't know me\nThis ain't for the homies this is for my enemies only!\n\n[Chorus X3]\n[Interlude ? Kurupt adlibs]\n\n[Verse 3]\nI'm in Vegas with Vegas, motherfucker\nGangstaz smashing through Vegas motherfuckers\nLet me show you something that you never seen before\nGangsta'd up on the eastcoast with chucks on the floor, motherfucker\nYeah motherfucker, shut the fuck up let's go heads motherfucker\nOh you think the shit here is a game\nLike the fire and torch when I spit the flame\nLike the angle you're at ain't really your aim\nLike when you see the mist this definitely ain't your aim\nLike, I'm really sposed to interact with lames?\nYoung Gotti Against the Grain, motherfucker\n\n[Chorus X3]\n[Outro - Kurupt]\nAnd all you bitches, eat a dick. See me on the streets, ya dig?\n(Young Gotti'll tell 'em)\nYou hoes, you hoes, you bitches...\nIt's Kurupt! Young Gotti, motherfuckers, Young Gotti\nAnd y'all know who I'm talking to, I'ma see y'all...\nI'ma see y'all at the next awards show, punks!", "image": "https://images.genius.com/e051ff42cc180d489d4e1b4e3e2906cd.333x333x1.jpg"}], "artist": "Kurupt"}