{"songs": [{"title": "Everything I Am", "album": "Graduation", "year": "2007-09-11", "lyrics": "[Produced by Kanye West]\n\n[Chorus]\nDamn, here we go again\nCommon passed on this beat, I made it to a jam\nNow everything I'm not made me everything I am\nDamn, here we go again\nPeople talking shit, but when the shit hit the fan\nEverything I'm not made me everything I am\n\n[Verse 1]\nI'll never be picture-perfect Beyoncé\nBe light as Al B or black as Chauncey\nRemember him from Blackstreet? He was black as the street was\nI'll never be laid back as this beat was\nI never could see why people'll reach a\nFake-ass facade that they couldn't keep up\nYou see how I creeped up?\nYou see how I played a big role in Chicago like Queen Latifah?\nI'll never rock a mink coat in the winter time like Killa Cam\nOr rock some mink boots in the summertime like will.i.am\nLet me know if you feel it, man\n'Cause everything I'm not made me everything I am\n\n[Chorus] (DJ Premier scratches)\nDamn, here we go again\nEverybody saying what's not for him\nBut everything I'm not made me everything I am\nDamn, here we go again\nPeople talking shit, but when the shit hit the fan\nEverything I'm not made me everything I am\n\n[Verse 2]\nAnd I'm back to tear it up\nHaters start your engines, I hear 'em gearing up\nPeople talk so much shit about me at barbershops\nThey forget to get their hair cut\nOkay, fair enough, the streets is flaring up\n'Cause they want gun talk, or I don't wear enough\nBaggy clothes, Reeboks, or A-di-dos\nCan I add that he do spaz out at his shows\nSo say goodbye to the NAACP Award\nGoodbye to the India Arie Award\nThey'd rather give me the N-nigga Please Award\nBut I'll just take the I Got a Lot of Cheese Award\n\n[Chorus]\nDamn, here we go again\nBum-tu-bum-bum-bum\nBut everything I'm not made me everything I am\nDamn, here we go again\nPeople talking shit, but when the shit hit the fan\nEverything I'm not made me everything I am\n\n[Verse 3]\nI know people wouldn't usually rap this\nBut I got the facts to back this\nJust last year, Chicago had over 600 caskets\nMan, killing's some wack shit\nOh, I forgot, 'cept for when niggas is rappin'\nDo you know what it feel like when people is passin'?\nHe got changed over his chains a block off Ashland\nI need to talk to somebody, pastor\nThe church want tithe, so I can't afford to pay\nPink slip on my door, 'cause I can't afford to stay\nMy fifteen seconds up, but I got more to say\nThat's enough Mr. West, please, no more today\n\n[Chorus]\nDamn, here we go again\nEverybody saying what's not for him\nBut everything I'm not made me everything I am\nDamn, here we go again\nPeople talking shit, but when the shit hit the fan\nEverything I'm not made me everything I am", "image": "https://images.genius.com/680d4985b1fccdf554ab887abb63a453.1000x1000x1.jpg"}], "artist": "Kanye West"}