{"songs": [{"title": "Gettin’ Money (’96 Demo)", "album": null, "year": "1996-01-01", "lyrics": "[Intro]\nUh, uh\n'96 catalog\nUh, check it\nGet money, uh\n\n[Verse 1]\nHow you figure that your team can affect my cream?\nGold and platinum plaques since I stepped on the scene\nKnow what I mean? Peep the scene, Jacuzzi full of women\nShe hitting me and him and him, much love like Wimbledon\nWhile niggas screaming 'killer', I'm overseas in my villa\nWith my masseuse, nothin' illa\nFrank switch the plan, cop the Lexus Land\nC-Gutta, Roc-a-fella 400's and better\nLil' Cease push threes with fives in his eyes\nKnocking 'Not Gon Cry' by Mary Blige\nI die for my niggas packing steel, chickenheads with sex appeal\nReveal sexual acts up in Capone's Ac'\nThe chocolate dimes watch the M.A.F.I.A. shine\nGirls, bring your own, can't touch a dime of mine!\n\n[Interlude]\nKnow what I'm saying? Know what I'm saying dog?\nKnow what I'm saying dog?\nNiggas, niggas, niggas on the beat\nThey don't even be knowing like, how we be rolling\nYou know what I'm saying? Like\nWe be like a big roller, group on you know what I'm saying?\nThe bananas is gone! The bananas is missing, dog!\n\n[Verse 2]\nA lime to a lemon, my D.C. women\nBringing in coke and heroin to condos with elevators in them\nVehicles with televisions in them\nWatch their entourage turn yours to just mirages\nDisappearing acts, strictly 9's and MAC's\nKillers be serial, Copperfield material\nMy dreams is vivid, work hard to live it\nAny place I visit, I got land there\nHow can niggas stand there and say I sound like them? Hello\nPush wigs back and push 6 coupes that's yellow\nBust clips that extend from hand to elbow\nSpray up your Day's Inn, any telly you're in\nCrack bagging, sick of bragging of how my mink be dragging\nDesert E's street sweepers inside the Beamer wagon\nI rely on Bed-Stuy to shut it down if I die\nPut that on my diamond bezel, you're fucking with the Devil\n\n[Outro]\nYou know you're fucking with the devil right?\nStraight up dog\nNigga talking all that bullshit, nigga trying to sell some motherfucking records\nNigga's a pussy, man. Straight up, man, he's a fake", "image": "https://images.genius.com/07593edeaa3e0e4b82717937e48c7375.600x600x1.jpg"}], "artist": "The Notorious B.I.G."}