{"songs": [{"title": "In Between Us", "album": "The Fix", "year": "2002-08-06", "lyrics": "[Verse 1: Nas]\nCircumstances are like my first fight I lost\nIt was swinging, my arms bugging, adrenaline pumping\nOh shit, this little nigga's thugging\nI mean, I was thirteen, I was nursing a knot on my face\nBut chose another time and a place\nThat I would avenge my last fight cuz the same shit\nAin't gonna happen that just happened last night\nKnuckle game changed quicker than lightning\nHit 'em or slice 'em\nEither stick 'em or blast pipes, it's the fastlife\nI try to give another nigga advice, shoot dice\nDo plenty of shit cause this life, how many you get?\nHow many niggas do you know get two?\nBesides a nigga who snitch to skip a life-bid, be one a' your crew\nI don't respect killers, I respect O.G. knowledge\nCodes of the streets got new rules, but no guidance\nLessons, detrimental to a young disciple\nFocus, take care of your brothers, niggas do as I do\nKeep your enemies close, where they can see you\nIt's not your enemy who get you\nIt's always your own people (x5)\n\n[Hook: Tanya Herron]\nMass confusion, in my head\nKilling me, driving me mad\nGot me wondering, can I trust my friends?\nCuz they stick me in my back every chance they get\nAm I paranoid? and if that's the case\nIs it curable? Can you help me find my place?\nI can't handle this, I'm losing it\nWith a loose grip I'm hanging on to emptiness\nHelp your brother, save him from the\nEvil demons in between us, came between us\n\n[Verse 2: Scarface]\nI know you hate me, don't you\nI bet you sit and wish my time never came\nYou probably rather see me die in the game\nYou probably rather see me die in a plane\nWell ya'll see me up on top of my dough\nI get my money shit changed\nAnd niggas start looking at me different than this\nAnd downplay the real nigga shit to get with a bitch\nBut I'mma tell a motherfucker like this\nYou only good as what you come up against\nNigga you get what you get\nSure the grass is greener on the other side of the fence\nBut any attempts and you gonna need the guy in the trench\nI'ma starter while you riding the bench\nYou saying you a player, well I'm the one designing your prints\nSomething to go by, to let these niggas know I\nDon't believe in letting shit slide, nigga gonna die\nBest friends since high school seniors\nWith a homeboys demeanor\nBut let the bullshit come between us\n\n[Hook: Tanya Herron]\nMass confusion, in my head\nKilling me, driving me mad\nGot me wondering, can I trust my friends?\nCuz they stick me in my back every chance they get\nAm I paranoid? and if that's the case\nIs it curable? Can you help me find my place?\nI can't handle this, I'm losing it\nWith a loose grip I'm hanging on to emptiness\nHelp your brother, save him from the\nEvil demons in between us, came between us\n\n[Outro: Scarface]\nAy this um...\nThis song right here dedicated to the homie Curtis Davis\nWe love you home, Big Mello, RIP\nFacemob for life", "image": "https://images.genius.com/5eb25741266e087e51cc814bb4a051e9.600x600x1.jpg"}], "artist": "Scarface"}