{"songs": [{"title": "Pimpin’ Ain’t Easy (Godfather Theme)", "album": null, "year": null, "lyrics": "[Godfather]\nCome get on the HOOOOOOOE Train!\nPimpin ain't easy\nPimps up\nHoes down\n\n[Slick Rick]\nWell I'm a pimp y'all, out here protecting\n1972, 42nd, mad (?), lot of cops gather\nCause my pink Rolls-Royce known to stop traffic\nAt the curb, looking close to regal\nMy hoes, pure dimes, now approach the vehicle\nWhat you call this?  Quite appalled with\n\"Must've been a slow night,\" 20 grand, that's all bitch?\nTook the cash and just about to dally\nWhen Peaches, beat down, ran from out an alley\nDelayed, more beef now placed upon a player\n300 pound pervert don't wanna pay her\nPimp my hoes, strolling, I don't like that\nHold my pink fur derby, I'll be right back\n\n[Slick Rick and Dana Dane]\nDana Dane, Slick Rick, lords of wrecking\nWe the biggest pimps from Hunt's Point to 42nd\nWhen it comes to (uhh) we the Captain Kirks of\nWhere you think we getting all the jewels from\nJerkoff?\nFor suresy, for sheezy, believe me\n\n[Godfather]\nMan, Pimpin ain't Easy\n\n[Dana Dane]\nCheck it\n\n[Slick Rick]\n18 hour day, money getting racked up\nEven if we got to Krazy Glue a chick, ooh she back up\n\n[Dana Dane]\nYou can squeeze it, hoes pick my doo doo when they sniff it\nJuice is Breakfast at Tiffany's terrific\nMy baby blue Eldorado coupe is just the sickest\nMy stable boast the most exotic bitches (come here hoe)\nA make a quarter roll of hoes bubble like Cristal\n3 grand a night each, three ways I fish out\nHoes better have my scratch\nWord to Slick Rick's diamond covered eye patch\nI scoop my cash out the air, white lineyed out\nOut comes a dime, red dress, bottom shimmeyed out\nAskin if I'm the great one, like there's any doubt\nShe want to split her gorilla pimp Jimmy house\nI spit iceberg cold, and plenty pound\nRun, your funny soft stories they don't get me roused\nYou wanna ride in the train?  Put some (?) out\nHere's a quiz, baby girl, are you in or out? (I'm in!)\n\n[Slick Rick and Dana Dane]\nDana Dane, Slick Rick, lords of wrecking\nWe the biggest pimps from Hunt's Point to 42nd\nWhen it comes to (uhh) we the Captain Kirks of\nWhere you think we getting all the jewels from jerk-off?\nFor sheezy, for sheezy, believe me\n\n[Godfather]\nMan, Pimpin ain't Easy\n\n[Slick Rick]\nCheck it, 18 hour day, money getting racked up\nEven if we got to Krazy Glue a chick, ooh she back up\n\nWell rest from sleep my test to (?) each\nPort Authority trying to scoop fresh, not (?)\nNow hoping, I'm the only one that's open\nThis bright hot shorty with ponytail approaching\nSo I move in on her hot drawers\nI'm like hey baby, my name's Sweet Daddy, what's yours?\nI spun a 360, impose on\nNow she in the palace alone with no clothes on\nAnd my flagpole blazing in the trimmer\nSay about 2, 3 days of this dilemma\nNow got lots to do, say to the prostitute\n\"You love me?  Prove to Sweet Daddy how much you do\"\nNow noticing the chick look puzzled\nTill I dialed her up like she was a Heidy Fleiss model\nHigh heels, make up, then I inspect the chick\nAnd fling her outside to suck a Wallstreet executive\n\n[Slick Rick and Dana Dane]\nDana Dane, Slick Rick, lords of wrecking\nWe the biggest pimps from Hunt's Point to 42nd\nWhen it comes to (uhh) we the Captain Kirks of\nWhere you think we getting all the jewels from jerk-off?\nFor sheezy, for sheezy, believe me\n\n[Godfather, Slick Rick, and Dana Dane]\nMan, Pimpin ain't Easy\n\n[Slick Rick]\nCheck it, 18 hour day, money getting racked up\nEven if we got to Krazy Glue a chick, ooh she back up", "image": "https://images.genius.com/c919a00200647c646c275a32d9d66956.750x750x1.jpg"}], "artist": "Slick Rick"}