{"songs": [{"title": "Zeze (Freestyle)", "album": null, "year": "2018-11-21", "lyrics": "[Intro]\nAhh, shit\nJoyner!\n\n[Verse]\nYo, nigga's saying, \"What a great battle\"\nBut you about to see a fucking snake rattle\nBoy, you just a pony with a pink saddle\nI'm truly sorry that you stuck inside of Drake's shadow\nWhen are you gon' overcome? (Huh)\nWhen are you gon' level up?\nWhen are you gon' grow another foot? (Huh)\nWhen are you gon' show us that you number one? (When)\nAnd everything that you accomplished in some years about to take me just a couple months\nDon't you think I'm bluffing neither\nI thought you were tougher, eager (Damn)\nHow you almost signed to Justin Bieber?\nYou look like a fuckin' beaver (Haha)\nTen years in the game but yo' ass still sittin' on the fucking bleachers\nBoy, you just another diva (Just another diva)\nHeard yo' grandmama kicked you out the house screaming\n\"Tory, we don't fucking need you\"\nWhy yo' daddy up and leave you? (Why)\nI guess this is how they fucking treat you\nAnd you my puppet, you my Cousin Skeeter\nThis ain't what you wanted, they been waiting for it\nI'm Joyner Lucas, what the fuck you niggas take me for\n(What the fuck)\nI pull up in a Demon but I kill Satan for it\nIf you want attention Tory you gon' have to pay me for it\nAll these hoes love me but you sucker niggas hate me for it\nYou roll up on me, catch a shot at ya Mercedes door\nThe bullets fly, you recline like a La-Z-Boy\nAll you do is cry, you a child, you my baby boy\nYou call yourself Tory after The Notorious Big (Yeah)\nBiggie turning in his grave when he hear yo' shit\nDon't ever think that you could ever come compare yo' shit\nLittle girls and kids only ones who feel yo' shit\nI skipped the plaques on my way to a Grammy\nAll your records soft and sweet, niggas think that you candy\nYour niggas really convinced you that you think you can scare me\nAnd you got identity issues, niggas think you a tranny, really? (Damn)\nTory tell us why you always gotta lie in your rhymes (Why)\nI know keeping up with lies can get tiring sometimes\nYou not a G and deep down you wanna hide sometimes\nStaring at the sunshine and start crying sometimes\nYour real name is Daystar, you been dying to shine\nAnd when you sing you kinda sound like you dying sometimes\nYou make the type of tracks that had me feelin' silent inside\nNobody take you serious, put all the violence aside\nOkay, let's talk about your plagiarism that you hate to mention (Yeah)\nOr talk about the hate you giving to the greats you dissing\n(Let's talk about it)\nAnd that writer who wrote yo' shit still ain't get paid on that \"Don't Die\" record\nYou should probably go pay the nigga (Yeah, man)\nAnd how the fuck you talk about Kendrick when he a legend (Huh)\nThen go bite the nigga style on your record right at the ending\nOn \"4AM Flex\" 2 minutes and 50 seconds\nSound exactly like \"The Art of Peer Pressure\", go take a listen\nYou inspired by the niggas you name dropped\nCatch fire in the rain, no umbrella to shelter you and no rain drops\nWhen I seen you on Flex, I gave props\nBut then we found out you stole Don Q shit from the train stop\nYou thought you were fly 'til the plane drop\nUgly motherfucker tryna stunt in a tank top\nIt's no wonder why they used to feed yo' ass with a slingshot\nYou my son, this the last time I'll give you a Ring Pop\nSit down, you on punishment\nAnd don't get up until you see me\nAnd don't even think about touching that TV\nNo more video games, no more phone, no more 3D\nNo more radio or boombox for your weak ass CD\nMatter of fact, give me your chains back and everything I bought you\nYou a disgrace to this family and everything I taught you\nI hate to say it son but you make me sick\nI should'a knew you weren't shit when you came out with a baby dick\nIt's no wonder why you pay for pussy\nTory you think you slick\nAll you do is lounge around the house all day like a lazy prick\nShit, highly disappointed in you son, I need some answers\nHow come you couldn't follow in my steps and be a dancer?\nOr maybe write a book like me or be somebody's grandpa\nInstead you wanna be a fucking rapper with some hair plugs\nNo more rapping, give me your pen and paper\nNo more lying to the people on how you the biggest gangster\nNow hurry up and get your juicy out the refrigerator\nYou going to bed at eight o'clock and not a minute later\nNo, I don't wanna hear it\nNo, let this be a lesson\nClose your mouth and go into your room like I suggested\nI'm a get real Joe Jackson in a second\nMatter of fact, give me your toys, I'm adding that to the collection\nI just did a show and got it lit ya little nigga\nAnd my freestyles killing your originals nigga\nCouldn't name a bitch I couldn't get ya little nigga\nYou a rebound, even Scottie Pippen know nigga\nYou ain't from Toronto, put that on the Bible\nI put six hollows in your Ferragamo\nNigga, you from Brampton, go spin the bottle\nBitch I'm from New England, me and Brady in the El Dorado\nNow come get on my level, I'm hard as metal\nI bomb the ghetto, I brought the shovel\nI bury all of you little ninja turtles\nYou Donatello, you soft as jello\nYou must be gone off that Amaretto\nIt's hard to tell 'cause you soft as pillows\nYou fucking midget, I call you Willow\nI throw you out a fucking car window\nI step all over your Margielas, you caught feelings\nYo' heart spinning, my bars illing\nI'm Bob Dylan, I'm John Lennon, I'm authentic\nYour bars running no off limits\nDon't talk business, don't talk, listen\nI'm off this so you fuck this you fuck! Nigga\n\n[Outro]\nWhat, nigga\nFuck out my face nigga\nAyy nigga look\nWe gonna get one in, pause\nLet's not, let's not do this back and forth shit no more\nI, I think we know what's up, you know\nHa ha ha, Joyner", "image": "https://images.genius.com/976c7be19e7972701c291d45000dd10f.768x768x1.jpg"}], "artist": "Joyner Lucas"}