{"songs": [{"title": "Glocko Pop", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Woman over vocoder]\nDigital Electronics!\n\n[Intro - RZA (Jammie Sommers)]\nSo we gon' check the 25th caller\nCaller? (Hello?)\nCaller, you're on the air (Yeah, hello?)\nYou're on the air, sweetheart\n(Hello, yeah, I'd like to make a request\nYeah, I wanna hear somethin Digital)\nOh yeah?\n(That means somethin that's gonna keep me up and turn\nMe on)\nWell, I got this new joint, the Glocko Pop\n(Glocko Pop?)\nYeah, Glocko Pop\n(Oh, I love that song!\nOh my God!)\nHere it is, just for you, sugar\n\n[RZA]\nBobby Digital back on the set\nWatch girl's pussies get wet wet wet wet wet\nDrip drip drip drip, drop drop drop drop\nHip-hop you just can't stop stop stop stop\nWatch my Glock Glock Glock Glock Glock\nIt goes pop pop pop pop pop\nMy Glocko pop pop pop\nMy Glockoes pop pop pop\nHis rugged go pop pop pop pop\nYou stomp the fuck off yo' block\nMy Glockoes pop pop pop\nMy Glocko pop pop pop (x4)\nYou stomp the fuck off yo' block\nMy Glocko pop pop pop\n\nBob Digi-tech live in effect, you just didn't expect\nOne man to come along and bring a new song\nAnd break your barrier down, you can't carry the sound\nBuckwild juvenile from Shaolin Island, what? What?\nWho wants to get violent? Remain silent\n\nMy Glocko pop pop pop\nMy Glocko pop pop pop\nHis Glocko pop pop pop\nHis Glocko pop pop pop\nMy son go pop pop pop\nMy gun go pop pop pop\nHis Glocko pop pop pop\nOne love, go pop pop pop\nHis love go pop pop pop\n\n[Method Man (Masta Killa)]\nYo.. who wanna play the hero? Your chances are slim\nLess than zero, Shaolin laboratory friend\nThat's the shit though, came to satisfy but can't get no\nSound pasified from the get-go, Cuban neckties for you Kiko\nOnly carry mines for protection, the hoods like the Wild West I reckon\nHold up a second, lost my breathe and\nTake it from the top Introducin'! (Mr. Method)\nRunnin in your session\nWith nothin but my words as my weapon\nAnd twenty-eight years of aggression\nDo it for my people when I take it back\nLike I'm repo-man, agent double-oh negro\nKnow who I am? No, I don't give a damn\nEvil, flash a Crooked I like I'm Deebo\nGets down and dirty like your moms pots and pans\nFrom a small town, drink ya down like Shazaam!\nThis is how ya Enter the Wu-Tang Clan (Yeah)\n36 Chambers, you're pu-tang man (Word)\nBrothers with a mic make a true slang fan(Yeah)\nBrother with a gun make the loot change hands (Word)\nThat's how it is, you could ask RZ-A\nThrough rain, hail or snow I deliver\n\n[Interlude - Jammie Sommers]\nDJ, that music just turns me on\n\n[Masta Killa]\nThe marvelous bone crushin assassin appears to be\nBlind in glasses\nDaredevil bang head with shovel\nIron skin, Tony Starks, liquid metal\nThe rebel in the evenin, shadows sweapens, vanishin\nThe book of instruction, fuckin with the Wu-Tang Production\nIs lord to all who come and see, my art too deadly to teach\nRead my death touch, ascended grief between each point\nSlendid, hand Swingin Sword recommended\nSlice through the bone intended\nTry to sketch the classes, reflection of perfection\nMic-phone swing like numb stick to scar\nMohammed Ali, mic MC, Shakwan walk the dead sea\nDead sea, Digi..\n\n[Streetlife]\nYo, yo.. yo..\nMy mind keeps playin tricks, I'm caught up in The Matrix\nDigital mode, your flows is all wasted\nYou smoke weed with seeds, I crush mines and lace it\nTwo tokes a pass, kid it's all basic\nI know you lust, so relax and be patient\nAs soon as I spark the stem, ya all taste it\nNumber one on the charts, it's time to erase it\nReplace it, you was wack from the start, face it\n\n[Interlude - Jammie Sommers]\nDJ, that music just turns me on\n\n[RZA]\nMy Glocko pop pop pop\nHis love go pop pop pop\nMy Glocko pop pop pop (x5)\nYou stomp the fuck off yo' block\nMy Glocko pop pop pop\nHis Glocko pop pop..\n\n[Outro - Jammie Sommers]\nDJ, that music just turns me on", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}