{"songs": [{"title": "Some People Hate", "album": "The Blueprint 2: The Gift & The Curse", "year": "2002-11-12", "lyrics": "[Intro: Refrain]\nThat old fashioned word\nIt's a word called love\nCalled looooove\nCalled looo-oooo-oooo-oooo-oooo-ove\n\n[Intro: Jay-Z]\nOh, this must be the way the nigga Pac felt when he made\nMe Against the World, All Eyez on Me\nY'all niggas got me feelin' like all eyes on me, me against the world\nMmm, y'all got me on my shit\nThought niggas would appreciate what I did to this game\nBeing that I'm flesh of your flesh, blood of your blood\nCome from the same hood you come from\nWe share basically the same stories\nThought niggas would appreciate what I came and did\nSince ninety-six, every year\nSomething must be seriously wrong with the world\nI know y'all ain't hating\n\n[Chorus: Jay-Z & (sample)]\n(Some people hate) Don't tell me niggas is hating\n(Some people hate) Uhh, nah, you know what I think?\n(Some people hate) I think...\n(I think they've lost their minds) Think y'all lost your mind\nY'all got me on my shit\n\n[Verse 1: Jay-Z]\nRaw, rough and rugged, when addressing the mass public\nMy attitude is fuck it 'cause motherfuckers love it\nGot a chip on my shoulder the size of the Golden Nugget in Vegas\nAnd fuck being famous, I came to get the butters\nI came from the gutter, my success in this game\nIs sort of like Pro-jectic Justice\nA payment for brushes with police officers\nA peace offering from the Gods for the streets I was tossed in\nTil I'm deceased in a coffin\nI'ma be a beast on these beats releasing early and often\nPlease, your disdain for the brothers ain't gon change the numbers\nIt's the strengthening of chain among us\nPlease we ain't afraid of none of ya's; who want it with us?\nAin't nuttin changed since the ninety-six summer, c'mon\n\n[Chorus: Jay-Z & (sample)]\n(Some people hate) Yeah\n(Some people hate) Uh, uh, uh\n(Some people hate) Yeah! You know what I think?\n(I think they've lost their minds) They say success breeds envy\n\n[Verse 2: Jay-Z]\nI guess it's just the penalty of leadership\nI guess I'm what niggas wanna be and shit\nOr niggas just bored wanna be in shit\n'Fore they get to rappin', start believing it, think they Ali and shit\nI roll with the punches so I survive\nI bob and weave, move my feet from side to side\nI'm back, stronger than ever, surprise, surprise\nThey try to take me out the game but I's alive\nIt's like a old Negro spiritual, but I mastered Tobey\nWith a splash of Monster Kody, shoot faster than Kobe, nigga\nYou bastards know me, the one and only\nBig homie from the Roc, I think you pastors lonely\nYou need Jesus in your life\nIt's either that or y'all gon' make me\nPut the double Desert Eagles in your life, nigga\n\n[Chorus: Jay-Z & (sample)]\n(Some people hate)\n(I know nigga's ain't hating man, let me find out)\n(Some people hate) Jealousy is a weak emotion, man\n(Some people kill their brothers)\nC'mon man, be stronger than that.. you know what I think?\n(I think they've lost their minds) You'll be alright though\n\n[Verse 3: Jay-Z]\nAu contraire, nigga, I am here 'cause I earned this shit\nBy riding out when niggas had learners' permit\nWe bring then knives out or we let them burners spit\nI bring them pies out if niggas wanna burn the strip\nBring your rides out, bring your buggy eyes out\nTurn your six, I laid back in the Maybach\nNigga this the payback, I know you bitch niggas from way back\nNiggas wanna clown, but the pound, it don't play that\nGet yourself found drowned where the lake at\nRun up on 'em notoriously, take that, take that\nAnd then we coming where your wake at\nEight maniac cats strapped with gats, you can hate that\nFace facts, fake rap cats\nCan't take back what I took back to the Brook, look\n\n[Outro: Sample]\nSome people hate\nSome people hate\nSome people kill their brothers\nI think they've lost their minds\nAnd I'm hung up.. ohh..", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg"}], "artist": "JAY-Z"}