{"songs": [{"title": "Sacrifices", "album": "More Life", "year": "2017-03-18", "lyrics": "[Verse 1:  Drake]\nWrote this shit, January 21\nBaby girl, I had to run, I'll be back a couple months\nKendall turned 21, was up the street with 21\nThey could see me online, but they won't see me on the ones\nI got Dubai plates in the California state\nI got her waitin' at my place, I got no baby on the way\nI'm talkin' Baby like Stunna, I'm talkin' Baby like Face\nLost millions in the past, I'm talkin' maybe like eight\nCouple niggas from the city\nWishin' on a star, could they be like Drake\nSorry, no, not today, you gotta find your own way\nBig dog from the 6, I'm talkin' Dogg like Nate\nMy shit be raw out the gate, I don't need another take\n40 got house on the lake, I ain't know we had a lake\nShe complainin' how I'm late, I ain't know it was a date\nNiggas see me in person\nFirst thing they say is, \"I know you need a break.\"\nHell naw, I feel great, ready now, why wait?\nLike a kiss from a rose I could be the one to seal your whole fate\nSo be careful what you think, think about what you gon' say\nGotta deal with people straight, I got my 23's laced\nIt's a marathon, not a sprint, but I still gotta win the race, yeah\n\n[Chorus: Drake]\nAnd I'm convinced\nI made sacrifices, I been ballin' ever since\nWe seein' so many blessings, shit don't make no sense\nSomeone watchin' over us, so shout goes out to Him\nYeah, I'm convinced\nI made sacrifices, I been ballin' ever since\nYeah, I did some wrong, I had no choice in my defense\nSomeone watchin' over us, so shout goes out to—\n\n[Verse 2: 2 Chainz]\n2 Chainz, I'm a real one\nFew shows, that's a mil run\nWhen she bust it down\nI said, \"Thanks for givin' to me,\" like a pilgrim\nCold world'll be chillin'\nEarmuffs on the children\nUsed to trap out the Hilton\nGot wood on the Cartiers: that's a face full of splinters\nCount a bankroll for dinner\nThis the wrong place to enter\nPhone sex for breakfast, all kinda women text us\nMet her at the Super Bowl\nTold her I stayed down the street from Texas\nA-Town, I stay down, yeah it's all in the wrist\nThis one here out the fence\nTrap jumpin' like the Carter, mean it jumpin' like Vince\nMoved on from the election\nIntroduced her to the plug\nCan't believe they tried to take the connection\nOoh, girl, you a blessin', fine ass, be finessin'\nYeah I love my fans but I don't wanna take pictures in the restroom\nDrench God with the 6 God\nPoint guard and the two guard\n\"Pretty Girls Like Trap Music\" so I woke up with my wood hard\n\n[Chorus: Drake]\nAnd I'm convinced\nI made sacrifices, I been ballin' ever since\nWe seein' so many blessings, shit don't make no sense\nSomeone watchin' over us, so shout goes out to Him\nYeah, I'm convinced\nI made sacrifices, I been ballin' ever since\nYeah, I did some wrong, I had no choice in my defense\nSomeone watchin' over us, so shout goes out to—\n\n[Verse 3: Young Thug]\nI was stealin' from a bitch (slime)\nBack when I was 21 (facts)\nMy favorite gun was a SIG (nine)\n20 in the clip, head one (no cockin')\nGrowin' up, I was a running back\nYou never made me ran once (goddamn)\nI got shot, sweat started runnin'\nThat shit was red like Hunt (ketchup)\nI'm kickin', pimpin' like I punt (beat it)\nBut don't you think shit's sweet?\nI'm talkin' sweet, deer meat (ooh)\nI'm talkin' suite like he sleep (like he sleep)\nWe ain't doin' too much talkin' (nah)\nI'm talmbout talkin' like a speech (election)\nLike the President, I kill 'em neat (scammers)\nI’m talkin' neat like freak\nI'm talkin' neat like fleek\nI'm talkin' neat like a geek (yeah!)\nYou come with beef, I eat a B\nI'm talkin' B’s, spellin' bee (sheesh)\nDouble R, that's a Rolls\nPaint it yellow like it's dairy\nI'm talkin' Rose like Derrick\nI'm talkin' rolls like a belly (woo)\nLike a new car, I got two keys\nTryna score the bucket like a Chevy seat (Chevy seat)\nThen I heard they been pullin' all week (all week)\nI'ma use your name like, \"Who is he?\"\nYou get it? Haha!\nI said I'ma use a name like, \"Who is he?\"\nGot some gold on, leprechaun, sheesh\nDeep sleep short for deceased\nBig bezel on the Patty (woo)\nI’m talkin' PADI—I meant Patek\nDon't try to take it, I got guns\nI'm talkin' guns, not pellets\nI watch the game from the floor (floor seats)\nI'm talkin' wood, first mattress\nI'm talkin' wood, pants down (pants down)\nI'm talkin' woods like them clowns (you get it?)\nI got my mink off a monkey\nI'm talkin' monkey like Jumanji (hrr)\nAll your diamonds partly sunny\nI'm talkin' sunny like D, Sunny (Sunny Delight)\nMy diamonds wet, it cost me money\nI'm talkin' wet like it's runnin' (sink)\nI'm talkin' wet like Katrina (New Orleans)\nI'm talkin' wet like Dasani, huh\n\n[Chorus: Drake]\nAnd I'm convinced\nI made sacrifices, I been ballin' ever since\nWe seein' so many blessings, shit don't make no sense\nSomeone watchin' over us, so shout goes out to Him\nYeah, I'm convinced\nI made sacrifices, I been ballin' ever since\nYeah, I did some wrong, I had no choice in my defense\nSomeone watchin' over us, so shout goes out to—", "image": "https://images.genius.com/4672f8523e0fbf7f7848185256e946f4.1000x1000x1.jpg"}], "artist": "Drake"}