{"songs": [{"title": "Roses", "album": "Late Registration", "year": "2005-08-30", "lyrics": "[Produced by Kanye West and Jon Brion]\n\n[Verse 1: Kanye West]\nI know it's past visiting hours\nBut can I please give her these flowers?\nThe doctor don't wanna take procedures\nHe claim her heart can't take the anaesthesia\nIt'll send her body into a seizure\nThat lil' thing by the hospital bed, it'll stop beepin\nHey, chick, I'm at a loss for words\nWhat do you say at this time? Remember when I was 9?\nTell her everything gon' be fine, but I be lyin'\nHer family cryin', they want her to live, and she tryin'\nI'm arguin' like what kind of doctor can we fly in\nYou know the best medicine go to people that's paid\nIf Magic Johnson got a cure for AIDS\nAnd all the broke motherfuckers passed away\nYou telling me if my grandma's in the NBA\nRight now she'd be okay? But since she\nWas just a secretary, worked for the church for 35 years\nThings 'sposed to stop right here\nMy grandfather tryin' to pull it together, he's strong\nThat's where I get my confidence from\nI asked the nurse \"Did you do the research?\"\nShe asked me, \"Can you sign some t-shirts?\"\nBitch, is you smokin reefer?\nYou don't see that we hurt? But still\n\n[Hook: Bill Withers & Tony Williams]\nI smile, when Rosie comes to see me\nAnd I can't wait for a sunny day (seeing it through your eyes)\nCan't wait for the clouds to break\n\n[Verse 2: Kanye West]\nThey outside of the emergency room, room\nYou can feel my heartbeat, beat, beat\nIf she gon' pull through, we gon' find out soon\nBut right now she asleep, sleep, sleep\nMy momma say they say she could pass away any day\nHey chick, what these doctors know anyway?\nLet me see the X-rays, I ain't no expert, I'm just hurt\nCousin Kim took off of work\nPlus my Aunt Shirley, Aunt Beverly, Aunt Clay and Aunt Jean\nSo many Aunties we could have an Auntie Team\nFeel like Amerie, it's just \"One Thing\"\nWhen they said that she made it you see they eyes gleam\nI think we at a all-time high\nTo get there, we run, we fly, we drive\n'Cause with my family we know where home is\nAnd so instead of sending flowers, we the roses\n\n[Hook: Bill Withers & Tony Williams]\nI smile, when Rosie comes to see me\nAnd I can't wait for a sunny day (seeing it through your eyes)\nCan't wait for the clouds to break\n\n[Break: Bill Withers]\nOh, Rosie brings the sunshine, oh\n\n[Hook: Bill Withers & Tony Williams]\nI smile, when Rosie comes to see me\nAnd I can't wait for a sunny day (seeing it through your eyes)\nCan't wait for the clouds to break\n\n[Hook: Bill Withers & Patti LaBelle]\nI, smile, when Rosie come to see me\nAnd I'm sad, when Rosie goes away\nOh Rosie brings the sunshine (say)\n\n[Outro: Patti LaBelle]\nCan't wait, I can't wait, no\nCan't wait, I can't wait, no\nCan't wait, I, can't wait\nNo, can't wait, for, for a sunny day\nMomma can't wait, for the clouds to break\nMm mmm mm mm-mm mm-mm\nOh oh oh oh no no, say\nTellin' you the truth now\nSaid I can't wait, uh-uh\nI won't wait, no", "image": "https://images.genius.com/20be4a5ccc57daf3577b7e0d12f092f8.1000x1000x1.jpg"}], "artist": "Kanye West"}