{"songs": [{"title": "Grab My Gun", "album": null, "year": null, "lyrics": "[Hook:]\nGrab the 9,2 clips and run a muck!\nSo I grab my gun\nA fist-full of bullets,a chest full of teflon\nNowhere to run,so I grab my gun!\n\n[Biggie]\nI'm sticking ice picks on the tip of your dick\nGive your testicles a swift kick ain't that some shit\nAm I hard-hardcore harder than the Plymouth\nIt ain't no myth. It's a nigga with a spliff\nAnd a chrome four-fifth pressed on yo back\nSo what you want nigga?\nHow you wanna act?\nI'm uncivilized cause I love to see niggas die\nBrains all leaking out on the street\nAnd the pastor preaching: he was a good man\nPlayed the bad man when the burner was in his hand\nNow he's singing sad songs with Elvis\nThree to the head, 'bout six cross the pelvis\nYou fuck with the high die you die\nYou're the same motherfucker\nIf you look up in the sky\nI want some old nex shit\nSuplex shit\nHardcore sex shit\n\n\n[Hook:]\nGrab the 9, 2 clips and run a muck!\nSo I grab my gun\nA fist-full of bullets,a chest full of teflon\nNowhere to run,so I grab my gun!\n\n[Biggie]\nA repetitive loop all I need to display\nSolo is the proof I put it to you boy\nHope you got the scoop\nBiggie Smalls the rap genius\nI keep the Glock by the penis\nThe cleanest cut fuck sluts\nWith the big humongous butts\nI used to rub a butt\nMy style is Gucci like the hookers pussy\nAnd it don't take a lot of back talk\nTo push me into flamin 'em\nLike that little nigga Damien\nGlock 19 to my motherfucking cranium\nGang-thight gun toting motherfucker\nNiggas in they brains thought biggie was a sucker\nI tricked 'em, I gave 'em work then I sticked 'em\nI stripped 'em, cause niggas dont want the friction\nTold you before how I bring the drama\nSlaying Larry Johnson and his grand mama!\n\n[Hook:]\nGrab the 9,2 clips and run a muck!\nSo I grab my gun\nA fist-full of bullets,a chest full of teflon\nNowhere to run,so I grab my gun!\n\n[Biggie]\nFuck around and feel the fury of a high nigga when I get busy, throw ya hands in the sky nigga I got the illest of the ill mentality\nNiggas be grabbing me, knowing that they rather be stabbing me\nAll up in my back, try'na  take my track\nWhen I used to sell crack I ain't had problems like that\nStreet rules, watch your pockets and your jewels\nA nigga front throw a gat to the fool next one to move is getting blasted\nStreets to a flows from the ill ghetto bastard\nAs I release Master piece it's like indecent\nStuck to your ass like tissue when you're wiping fast\nMC's have a hard time believin'\nI'm marked with death hard to kill like Steven\nWith Jacob I'm leavin' the black man's motto: \"You got a better chance playing lotto\"\n\n[Hook:]\nGrab the 9,2 clips and run a muck!\nSo I grab my gun\nA fist-full of bullets, a chest full of teflon\nNowhere to run, so I grab my gun!", "image": "https://images.genius.com/accf2df97375292b16f399ff6ec71e6e.500x500x1.png"}], "artist": "The Notorious B.I.G."}