{"songs": [{"title": "Hold Dis Blaow!", "album": "Red Gone Wild: Thee Album", "year": null, "lyrics": "Red's Gone Wild {*gun cocks*}\n\n[Ad libs for next 14 seconds]\n\n[Redman]\nYo, I'm hot, global warming ridin' on two-six\nI ain't thug nigga I don't, bullet-proof shit\nGilla nigga, and we abide by the blueprint\nWe ain't all loud, holla and whoopin'\nBlah blah blah, a whole lot of nuttin\nYou know the loud ones, they do a whole lot of duckin\nI stay on the grind, my hustle real heavy\nAnd even for that cake I'll fuck Lil' Debbie\nSoldier boy, murder land's like Baltimore\nRoll on stage, more deeper than a Commodore\nGet shut down! Yeah, knock your mans off\nWouldn't trade places if you {?} or Randolph\nShorty shorty, give me that body\nStart a riot 'til security on the walkie\nReggie Noble '07, keep all sort of hoes yellin\nNine-fo'-three-eleven, get it or fo'get it!\n\n[Hook]\nYou could hold dis BLAOW! Real street (real street)\nReal street niggas ain't havin that shit\nYou could hold dis BLAOW! Real street (real street)\nReal street niggas ain't havin that shit\nYou could hold dis BLAOW! Real street (real street)\nReal street niggas ain't havin that shit\nYou could hold dis BLAOW! And niggas is, nig'\nAnd niggas is gettin smoked G, believe me\nYou could hold dis BLAOW!\n\n[Redman]\nGilla House foundation (yeah)\nGilla House foundation (aww yeah)\nGilla House foundation (thorough niggas - no, NO!)\nGilla House foundation (monkey niggas)\n\nYo, Gilla nigga, era, fuck you, pay me\nBoogie Down like Bronx, high at the skate key\nIt's like Janet, \"What Have You Done for Me, Lately?\"\nNuttin, I blew up, you try to inflate me\nDawg, in my dutch, a whole lot of bud\nEnd up in Jersey now, a whole lot of blood\nSo when you get here show a whole lot of love\nOr leave shot up, robbed and thrown out a truck\nI don't condone, I got kids to relate to\n\"Redman Gone Wild\" - hear the new debut\nFox 5 a nigga, boy that's great news\nNow I'm back in the, hood like Grey Goose\nWho gon' stop me? I'm razor sharp\nWith Gilla niggas frontline, and Jay the boss\nY'all chicken ass niggas blood made of broth\nBut I'm barbershop talk, L.A. and New York\nSo all you West Coast niggas, get that money\nCause these Brick City dudes get that money\nIt's gonna be, one pussy that'll act funny\n(\"Yo I'm gon' get this nigga, leave the Cadillac runnin\")\nYo, Uptown got haze, Miami got crippy{?}\nI'm fucked up, I slipped my own self a mickie\nDoin dirty, I'm triple-X/\"XXX\" like Vin Dies'\nWho you know can, pump weed out of Wendy's\nShorty shorty, give me that body\nStart a riot 'til security on the walkie\nReggie Noble '07, keep all sort of hoes yellin\nNine-fo'-three-eleven, get it or fo'get it!\n\n[Hook] w/ ad libs\n\n[Outro]\nGilla Gilla Gilla Gilla\nYeah, Gilla niggas\n(Gilla Gilla Gilla Gilla)\nThorough niggas\nMonkey niggas {*BLAM*}", "image": "https://images.genius.com/65aa1591ac947b9397141766462ac089.465x465x1.jpg"}], "artist": "Redman"}