{"songs": [{"title": "XO", "album": "DROGAS WAVE", "year": "2018-09-21", "lyrics": "[Intro: Troi Irons]\nYou and me, I'm curious to see\nCould we be everything you need?\nYou don't have to go, go, go\nWe can be alone, alone, together in this\n\n[Verse 1: Lupe Fiasco]\nYeah, uh, yeah\nShe just walks, and talks to the noise in her heads\nSafe in the middle but destroys at the edge\nBurns up the nest and poisons the eggs\nWhen the sound hits the ground, the tone seems to beg\nFor the dark, wanna dart but it's too hard to march\nWhen your heart's nailed down to the \"start, on your mark\"\nThen a spark but she parked, too caught up in the blitz\nTo risk ripping them apart\nSo she wanna stay, on a high tonight to survive\nThe eyes pry wide down the manor\nOpening the face to be go washed and awash in the glow\nOf the faraway souls of downtown Atlanta\nMy report, a million similar souls signaling\nHoping to be a synonym for now\nPut in a pill again when it drowns, when the night comes 'round\nAnd the sky opens up and the lights come, down\n\n[Pre-Chrorus: Troi Irons]\nFluorescent, iridescent\nAre you gonna take it all away?\nFluorescent, luminescent\nAre you gonna take it all away?\n\n[Chorus: Troi Irons]\nYou and me, ecstasy (X-XO)\nYou and me, ecstasy (XO)\n'Round and 'round, we can't slow down\nCome too far, we can't stop now (X-X-XO)\nYou and me, ecstasy (X-XO)\nYou and me, ecstasy (XO)\n'Round and 'round, we can't slow down\nGone too far, we can't stop now (X-X-XO)\n\n[Verse 2: Lupe Fiasco]\nUhh, she just runs, and comes to the back of the beginning\nWhich once was the happiness of winning\nThe killing contrived the inner vibe, tried to fill her in size\nBut didn't survive the attack of other feelings\nCracking at the seals, life-hacking it, backing it\nSomething real as the key to the ease of the bees in the ceilings\nFauceting all the things down from the dark clouds\nThe valve house, canals, the foul, the undependents 'til it breaks\nThe surge, tsunamis down advantages\nKnocking down establishments, washing out the catalyst of fate\nWeight filling the room, moon, the moon\nAnd the wanderlust stuck in downtown Los Angeles\n(A report!) A billion similar souls signaling\nHoping to be a synonym for now\nPut in a pill again when it drowns when the night comes 'round\nAnd the sky opens up and the lights come, down\n\n[Pre-Chorus: Troi Irons]\nFluorescent, iridescent\nAre you gonna take it all away\nFluorescent, luminescent\nAre you gonna take it all away\n\n[Chorus: Troi Irons]\nYou and me, ecstasy (X-XO)\nYou and me, ecstasy (XO)\n'Round and 'round, we can't slow down\nGone too far, we can't stop now (X-X-XO)\n\n[Post-Chorus: Troi Irons]\nThey're right where I stay\nSurround us\nIn the revend night babe\nThey found us\nFluorescent, iridescent\nAre you gonna take it all away?\nFluorescent, luminescent\nAre you gonna take it all away?\n\n[Verse 3: Lupe Fiasco]\nUhh, they combed Earth to seek out a soul to research\nIdentify the atoms united to make it work\nThen wreck it, re-order, re-organize and perfect it\nThen let it, forget it, then stepping into the method\nLet it shed its aesthetics into ascetic\nState of ethics vetted to better his new genetics\nMedics, headed where warfare's kinetic\nThe square's self aware and dares to self edit\nAnd pregnant, batters, data no longer matters\nPlatters shatters scatters the fragments all on fanatics\nDamage, managed to still be able to feel\nSome of the long lost magic of downtown Damascus\nInfinity, similar souls signaling\nHoping to be a synonym for now\nPut in a pill again when it drowns when the night comes 'round\nAnd the sky opens up and the lights come, down\n\n[Chorus: Troi Irons]\nYou and me, ecstasy (X-XO)\nYou and me, ecstasy (XO)\n'Round and 'round, we can't slow down\nGone too far, we can't stop now (X-X-XO)\nYou and me, ecstasy (X-XO)\nYou and me, ecstasy (XO)\n'Round and 'round, we can't slow down\nGone too far, we can't stop now (X-X-XO)", "image": "https://images.genius.com/86aa1a0cb9e9a473ce83eb531fa78079.500x500x1.jpg"}], "artist": "Lupe Fiasco"}