{"songs": [{"title": "Rich Porter", "album": "Dreamchasers 3", "year": "2013-09-29", "lyrics": "[Chorus: Meek Mill]\nFeelin' like I'm Richard Porter, I'm really ballin'\nBad bitches got 'em calling, they really calling\nMy Rollie flooded like New Orleans, just like New Orleans\nAin't talking money, what you talking? Nigga what you talking?\nMy bitch probably wouldn't speak if you ain't talkin' money\nDon't even talk to me if you ain't talkin' money\nAin't shit in life for free so we were talkin' money\nYou hear that sound? I think it's Benji, he talkin' to me\n\n[Verse 1: Meek Mill]\nThey got me feeling like Rich Porter, I got them hoes\nSelling work we got them bricks, and got the most\nIf he ain't test it I don't trust em', he prolly told\nDimed out your homies, seen them statements, he got exposed\nThese niggas ratting and you fucking with these pussy niggas\nI put these hoes up on the jet and bring that pussy with us\nI bring that new thing through yo' block, I see you looking nigga\n36 up in the pot like what you cooking nigga?\nFish scale, I love the hustle, I'm 'bout my paper\nAnd I'm fly as Alpo before he drop a statement\nI knew I started getting money when I got them haters\nBoy won't you go and kill yourself and just do God a favor\n\n[Chorus: Meek Mill]\nFeelin' like I'm Richard Porter, I'm really ballin'\nBad bitches got 'em calling, they really calling\nMy Rollie flooded like New Orleans, just like New Orleans\nAin't talking money, what you talking? Nigga what you talking?\nMy bitch probably wouldn't speak if you ain't talkin' money\nDon't even talk to me if you ain't talkin' money\nAin't shit in life for free so we were talkin' money\nYou hear that sound? I think it's Benji, he talkin' to me\n\n[Verse 2: Rick Ross]\nDon't you see a nigga ballin' like I'm Rayful Edmond?? (No snitching)\nMy DC shooter Fat Trel hold up that Mac-Eleven (Dem Bitches)\nNail me to the cross I swear I'll never testify (Never)\nNever will, that Maybach murder got em' petrified\nI'm hard to kill, I'm counting cake up with my finest bitch\nTake off her makeup and she still look like a finalist\nTop models, pop bottles, catch you bitches slipping\nDo em' dirty that top dollar make a major difference\nI bought another Phantom, cash count that at the dealer\nIt took an hour, fast money for us young niggas\nCan't run around, marble statues in the front and back (Boss)\nWith no regard for the law, cause all I want is stacks\nSo fuck 'em all\n\n[Chorus: Meek Mill]\nFeelin' like I'm Richard Porter, I'm really ballin'\nBad bitches got 'em calling, they really calling\nMy Rollie flooded like New Orleans, just like New Orleans\nAin't talking money, what you talking? Nigga what you talking?\nMy bitch probably wouldn't speak if you ain't talkin' money\nDon't even talk to me if you ain't talkin' money\nAin't shit in life for free so we were talkin' money\nYou hear that sound? I think it's Benji, he talkin' to me", "image": "https://images.genius.com/9f7555483900d17e5492cc73d0fff0df.600x590x1.png"}], "artist": "Meek Mill"}