{"songs": [{"title": "Maybach Music 2.5", "album": null, "year": null, "lyrics": "[Intro: DJ Khaled]\nMaybach Music\nMaybach Music 2 Remix\nLet me warn you now\nMaybach Music 3\nTeflon Don coming soon\nWe the Best\n\n[Hook: T-Pain]\nHey! Realest shit I ever wrote, chilling in my Maybach\nWhatever I send out, homie I'mma make back\nHey! Can you believe that? (whoooooa)\nYou gotta see it, hey!\nI don't plan on going broke, put that on my Maybach\nCause I'm in it to win now, niggas can't take that\nListen to my Maybach music, to my Maybach music\n\n[Pre-Verse: Pusha T]\nRoss, what up?\nIt's your neighborhood Pusha\nRe-Up Gang Records, one half of the Clipse\nA.K.A one half of the best duo ever\nHaha, check it out\n\n[Verse 1: Pusha T]\nYou can’t see my eyes in these evidence noirs\nSix seventy-five, the frames by Lou Vuitton\nReality bites as the curtain is drawn\nThen it’s off to Neverland with t-shirt and don\nI was at the six deuce, waiting for the Maybach\nCooking up two in a cue, just so I can make back\nLooking for my fortune in a pot, Pat Sajak\nNow I’m in the back seat, beach chair, laid back\nPlay cloths brought a million to my door\nYeah that baby’s mine, every rapper’s beggin' for her\nLife as I know it is penthouses and pitfalls\nMore jealous drivers and fed time, collect calls\nThey took the family in '09, let’s slow grind\nWhen the time is given we’ll unveil the gold mine\nTill the casket drops, it’s show time!\n\n[Hook: T-Pain]\nHey! Realest shit I ever wrote, chilling in my Maybach\nWhatever I send out, homie I'mma make back\nHey! Can you believe that? (whoooooa)\nYou gotta see it, hey!\nI don't plan on going broke, put that on my Maybach\nCause I'm in it to win now, niggas can't take that\nListen to my Maybach music, to my Maybach music\n\n[Pre-Verse: Rick Ross]\nCan I talk?\n\n[Verse 2: Rick Ross]\nHoes gettin' arrested, foes get molested\nDough still invested, my dope pause pregnant\nThe black one is Oprah, call my blue Habo\nI crack slice Oprah, bulletproof the car door\nShoes called loafers, chrome forgiatos\nI do it like Oprah - give away auto\nSend them like Sosa, heavenly father\nI'm in her like an ulcer, swimming out in Cabo\nShortie caught the train, or she at the cabbie\nNow she on the plain, flying out to my cabin\nMy game so elaborate, texture, fabric, soda, the dresses\nShe's the best in the pageant\nPassion of Christ, my fashion is ice\nEveryday I'm hustling, pass me the dice\n..Nice\n\n[Hook: T-Pain]", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}