{"songs": [{"title": "Marshall Mathers", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Intro]\nYou know, I just don't get it\nLast year I was nobody, this year I'm selling records\nNow everybody wants to come around\nLike I owe 'em somethin'\nThe fuck you want from me, 10 million dollars?\nGet the fuck outta here\n\n[Hook 1]\nYou see, I'm just Marshall Mathers (Marshall Mathers)\nI'm just a regular guy\nI don't know why all the fuss about me (Fuss about me)\nNobody ever gave a fuck before\nAll they did was doubt me (Did was doubt me)\nNow everybody wanna run their mouth\nAnd try to take shots at me (Take shots at me)\n\n[Verse 1]\nYo, you might see me joggin', you might see me walkin'\nYou might see me walkin' a dead Rottweiler dog\nWith its head chopped off in the park with a spiked collar\nHollerin' at him 'cause the son of a bitch won't quit barkin'\nOr leanin' out a window with a cocked shotgun\nDrivin' up the block in the car that they shot Pac in\nLooking for Big's killers, dressin' ridiculous\nBlue and red, like I don't see what the big deal is\nDouble barrel 12-gauge bigger than Chris Wallace\nPissed off 'cause Biggie and Pac just missed all this\nWatchin' all these cheap imitations get rich off 'em\nAnd get dollars that shoulda been theirs like they switched wallets\nAnd amidst all this Crist' poppin' and wrist watches\nI just sit back and just watch and just get nauseous\nAnd walk around with an empty bottle of Remy Martin\nStartin' shit like some 26 year old skinny Cartman (Goddamn it!)\nAn anti-Backstreet and Ricky Martin\nWhose instinct's to kill *NSYNC, don't get me started\nThese fuckin' brats can't sing and Britney's garbage\nWhat's this bitch, retarded? Give me back my 16 dollars!\nAll I see is sissies in magazines smilin'\nWhatever happened to wilin' out and being violent?\nWhatever happened to catchin'\nA good old-fashioned passionate ass-whoopin'\nAnd gettin' your shoes, coat and your hat tooken\n\n[Bridge]\nNew Kids on the Block suck a lot of dick\nBoy/girl groups make me sick\nAnd I can't wait 'til I catch all you faggots in public\nI'ma love it (Hahaha)\n\n[Verse 2]\nVanilla Ice don't like me (Uh-uh)\nHe said some shit in Vibe to spite me (Yo)\nThen went and dyed his hair just like me (Haha)\nA bunch of little kids wanna swear just like me\nAnd run around screamin' \"I don't care, just bite me!\" (Na-na)\nI think I was put here to annoy the world\nAnd destroy your little four year old boy or girl\nPlus I was put here to put fear in faggots who spray Faygo Root Beer\nAnd call themselves clowns ‘cause they look queer\nFaggy 2 Dope and Silent Gay\nClaimin' Detroit, when y'all live 20 miles away (Fuckin' punks)\nAnd I don't wrestle, I'll knock you fuckin' faggots the fuck out\nAsk 'em about the club they was at when they snuck out\nAfter they ducked out the back when they saw us and bugged out\nDucked down and got paintballs shot at they truck — blaow!\nLook at y'all runnin' your mouth again\nWhen you ain't seen a fuckin' mile road south of 10\nAnd I don't need help from D12 to beat up two females\nIn make-up who may try to scratch me with Lee Nails\n\"Slim Anus\"? You damn right, slim anus\nI don't get fucked in mine like you two little flamin' faggots\n\n[Hook 2]\n'Cause I'm just Marshall Mathers (Marshall Mathers)\nI'm not a wrestler guy\nI'll knock you out if you talk about me (You talk about me)\nCome and see me on the streets alone\nIf you assholes doubt me (Assholes doubt me)\nAnd if you wanna run your mouth\nThen come take your best shot at me (Best shot at me)\n\n[Verse 3]\nIs it because you love me that y'all expect so much of me?\nYou little groupie bitch, get off me, go fuck Puffy\nNow because of this blonde mop that's on top\nOf this fucked up head that I've got, I've gone pop?\nThe underground just spunned around and did a 360\nNow these kids diss me and act like some big sissies\n\"Oh, he just did some shit with Missy\nSo now he thinks he's too big to do some shit with MC Get-Bizzy\"\nMy fuckin' bitch mom's suin' for 10 million\nShe must want a dollar for every pill I've been stealin'\nShit, where the fuck you think I picked up the habit?\nAll I had to do was go in her room and lift up her mattress\nWhich is it, bitch: Mrs. Briggs or Ms. Mathers?\nIt doesn't matter, [your attorney Fred Gibson’s a] faggot\nTalkin' about I fabricated my past\nHe's just aggravated I won't ejaculate in his ass (Ugh!)\nSo tell me, what the hell is a fella to do?\nFor every million I make, another relative sues\nFamily fightin' and fussin' over who wants to invite me to supper\nAll of a sudden I got 90-some cousins (Hey it's me!)\nA half-brother and sister who never seen me\nOr even bothered to call me until they saw me on TV\nNow everybody's so happy and proud\nI'm finally allowed to step foot in my girlfriend's house (Hey!)\nAnd then to top it off I walked to the news stand\nTo buy this cheap-ass little magazine with a food stamp\nSkipped to the last page, flipped right fast\nAnd what do I see? A picture of my big white ass\nOkay, let me give you motherfuckers some help\nUh, here, \"XXL! XXL!\"\nNow your magazine shouldn't have so much trouble to sell\nAw, fuck it, I'll even buy a couple myself\n\n[Hook 1]\n'Cause I'm just Marshall Mathers (Marshall Mathers)\nI'm just a regular guy\nI don't know why all the fuss about me (Fuss about me)\nNobody ever gave a fuck before\nAll they did was doubt me (Did was doubt me)\nNow everybody wanna run their mouth\nAnd try to take shots at me (Take shots at me)\nBecause I'm just Marshall Mathers (Marshall Mathers)\nI'm just a regular guy\nI don't know why all the fuss about me (Fuss about me)\nNobody ever gave a fuck before\nAll they did was doubt me (Did was doubt me)\nNow everybody wanna run their mouth\nAnd try to take shots at me (Take shots at me)", "image": "https://images.genius.com/e7f2305258d668431f8e250a41f3459f.1000x1000x1.png"}], "artist": "Eminem"}