{"songs": [{"title": "Behind the Walls Remix", "album": null, "year": null, "lyrics": "[Kurupt]\nMike Dean hook me up with that remix homie\n\n[Kurupt] + (Shyne)\nBurn so crooked (crooked)   (Eastcoast)\nThe poet likes to spit (spit)  (My Nigga)(Gangsta Mix)\nKareem, that's my dog    (Gangsta Mix)\nLife, Behind the Walls   (Gangsta Mix)\nLivin' life, behind the walls   (Brooklyn)\nYeah, welcome to Oz niggas, surprise niggas..\n\n[Kurupt]\nKurupt and Daz, grips on a handle, two to the mandible\nFo's and E's, bustas and G's\nPound and Shyne, hammer quick this for me one more\nUp and Down, In and Out\nSpinning Out, spinning in and out\nI seen niggas like you that usually get blasted\nCameras to remove you, lies over caskets\nOpen season, rhyme a reason\nCrimetime, primetime, D-I-C\nYoung Gagstra, step in and dump on the hostages\nSmoke like sausages, niggas covering their heads like ostraches\nOstrasice, swallow like mausages..\nCO so crooked (crooked)\nCome equipped when the shank sticks\n\n[Chorus One: Kurupt - Nate Dogg]\n(Its Gonna be Alright) Yeah, that's my dogg\nLife, Behind the Walls\nLivin Life Behind the Walls\nSuckers - (yall can't sleep tonight) welcome to Oz niggas; surprise niggas\n\n[Chorus Two: Nate Dogg]\nWest coast representin for all my doggs (Eastcoast)\nOne love to my doggs behind the walls  (Gangsta Mix)\nNate Dogg and I'm tight for all of y'all  (Gangsta Mix)\nStand strong, stand tall, and never fall (Gangsta Mix)\nWest coast representin for all my doggs (Gangsta Mix)\nOne love to my doggs behind the walls  (Eastcoast, Brooklyn)\nNate Dogg and I'm tight for all of y'all (Vietnam, Brooklyn)\nStand strong, stand tall, and never fall  (Vietnam)\n\n[Shyne]\nRhyme through the city on dubs and fo's\nTrunk full of cash, gangsta roll\nKurupt and nate from the ny state\nIs the nigga shyne fo, hold up wait\nIt ain't where u from, is where your gat at\nKeep mine on my lap, windows black\nTough is hard, white is soft, monominus ship\nLike im lovin this shit, guerilla nigga in the flesh\nKilla nigga, hittin ur vest\nI had bullets goin in and out yall\nSlap yall', make yo mouth fall\nBlood is a bloodsport, hittin that porsche\nHead that port, where u known that horse\nIs the OG, niggas know me\nFuck the police, ain't no peace\nRevenge is a bitch, can't wait to fuck\n\n[Kurupt]\nMurderous Mr. Ketley my homie\n\n[Chorus] - Repeat\n\n[Nate Dogg]\nWell I've arrived at my new home - cell three (huh)\nI looked around and what did I see?  (Nate)\nOne of them clowns one of my enemies  (Mike)\nGotta stay down so I make me some weed   (Dean)\nIt's goin down in the mornin on me  (Kurupt)\nSoon as they say \"Hey line up,\" let's leave  (Me.)\nRight now the nigga just as safe as can be  (Daz)\nBut when we hit the kitchen maaan sleep  (Shyne)\nNate Dogg and I'm tight for all of y'all\nWhen you wanna make a hit, give me a call\nWest coast representin for all my doggs\nOne love to my doggs Behind the Walls\nNate Dogg and I'm tight for all of y'all\nStand strong, stand tall, and never fall  (Sip this nigga)\nWest coast representin for all my doggs\nOne love to my doggs Behind the Walls\n\n[Kurupt]\nI'm like you wanna bang nigga, with yo bangin head\nYou wanna hang like a G fool, hangin head\nWhere all the gangstas at, rollin through homie\nFleetwoods cadillacs straight gangsta mash\nBefo I got stuck, I was cool as fuck\nOn the streets nigga, like I ain't give a fuck\nI had Daz by my side, my lil' bro\nAnd this is how we do it nigga, already to dump\nI got a bitch, shes known for eatin a dick\nI never gave a fuck nigga, never gave a shit\nIts me and Mike Dean, doin what the fuck we wanna do\nWith M-16's niggas clearin the scene\nThis is the gangsta lean, and the gangsta vibe\nKeep it gangstafied, nigga do or die\nYeah I roll with them niggas cause its ride or die\nAnd I always get high, nigga living my life (bitch niggaaa)\n\n[Chorus] - Repeat 2X\n\n[Kurupt over Chorus Two]\nYeah!  West Coast!\nNate Dogg!  Kurupt!\nRoll!  Yeah!\nBehind the Walls!\n\n[Kurupt]\nYeah, so crooked, c'mon, come equiped when the shank sticks\nYeah, that's my dogg, (Dogg Pound)\nLife behind the walls (it's like that)\nSpending life behind the walls (Welcome to Oz)", "image": "https://images.genius.com/e051ff42cc180d489d4e1b4e3e2906cd.333x333x1.jpg"}], "artist": "Kurupt"}