{"songs": [{"title": "Eminem Freestyles on Tim Westwood | 2009", "album": null, "year": "2009-05-27", "lyrics": "[Intro: Eminem, Mr. Porter & Tim Westwood]\nYo blast me off, Tim\nWhere's that boom?\nBlast me off, son\nRight now, we're doin' this for Beijing, baby, understand how it's goin' down\nBlastin' off right now, son\nReal big. Real legendary up in the game. Drippin' in swagger juice. We ready to go in this?\nYeah, yeah, yeah\nAre we swaggered up?\nSwaggered up, yeah\nLet's do it, baby. Radio 1, Westwood [?] about to go down. Eminem. Kon, baby. Alchemist. We're doin' it like this. Let's go, baby\nYeah, yeah, yeah\nA'ight, a'ight, look\n\n[Plays \"Respect My Conglomerate\" by Busta Rhymes]\n\n[Verse 1: Eminem]\nI wasn't born mean, I was pushed to treachery\nI walk the streets lookin' for some puss to fetch me\nI'm like a veggie, brain is turned to mush, I'm edgy\nEdgy enough to give Reggie Bush a wedgie\nIf he don't gimme Kim, things could get messy\nSo pass that ass to me, let me squish the left cheek\nAnd press against the right one 'til it's smushed against me\nAnd leave a dead body in the woods, the MC\nWith the Christopher Reeve's beef\nWe started out on the wrong foot\nOr should I say fake leg made outta wood\nI shouldn't, yes I should\nRidin' through the hood, I'm chillin' with Westwood\nI'm quite mellow, a white fellow\nMy pee is bright yellow, I like Jell-O\nI'm like, \"Hello\" to a cute little dyke on the mic\nI'm kinda like Iron Mike 'cause I bite earlobes\n\n[Verse 2: Mr. Porter]\nWell, I must must say, well, um\nI'm just not gay, but I must must say, um, well, look\nSee I'm the first one to class and the last to leave\nI mean the first one to leave outta class, believe\nThat I'm a mailbox pimp in my heart 'til I die\nEven after I'm all gone and my ashes fried\nWent from an ashy guy, class clown as high\nTo a grown ass man stackin' motherfuckin' paper\nRunyon Ave.'s the clique, D12's the game\nWe've been spittin' this shit since we was little bébés\nGaga goo goo nana, nani do do never\nWord to my homie Em, I'm just too too clever\nA 4-5 shot and leave a nigga's face lop-sided\nThe kick from the barrel make you think I'm cock-eyed\nWhen I bust it out off in the crowd, niggas start divin'\nGreg Louganis went over the bar, I ain't lyin'\nHot Iron lethals, not defyin' a soldier\nRunyon Ave. soldier equals death when it's over\nIt's none colder than niggas to understand the struggle\nApply the street-muscle we've been hard to hustle\nWe've been hard to hustle, we've been hard to muscle\nApply the street hustle, we've been hard to hustle\n\n[Verse 3: Eminem]\nAight, aight\nMe and Westwood blastin' off, jackin' off\nIn a pair of acid washed bumpin' Asher Roth\nCruisin Gratiot 'til I damn near crash the car\nTryna smash 'em off in the dash, hit the overpass, went off\nOver the bridge into oncoming traffic\nCaused a massive forty-two car pile-up, not a scratch at all\nHopped up holdin' an axe and saw\nJason mask is off when my face is plastered in tabasco sauce\nSpittin' flames, kickin' fire out your ass, you little bastard\nYou can pass it on, I'm battery acid, dawg\nYou don't wanna get my ass ticked off\nI'm harder than playin' basketball when I'm goin' through crack withdrawal\nDick so big it's like elastic\nI tie it in a knot and it looks like Mr. Fantastic\nCrossed the path of Plastic Man with a drastic force\nAnd went spastic, put my penis on classic sports\n\n[Verse 4: Mr. Porter]\nLook, I shoot straight off the hip\nTrey-eight off the grip\nSee, I ain't fo' that shit\nI got a fist print fo' yo' lip\nLookin' shit is swole up\nLike the stomach on a fat pregnant bitch\nAnd it's evident\nThat I'm gettin' chips like the president\nThen a lot of woos\nKeep the tools for the haters left\nNiggas ain't fadin' 'em\nSeel a crack, do a trim\nGot a lot of dough but you know I ain't trickin' on 'em\nGet some head spinnin' on 'em\nKeep the head spinnin' on 'em\nSee, I ain't diggin' on 'em\nKeep the head hidden from 'em\nYou know how it go, no dough trickin' on 'em\nShe just wanna pop, see what she can get from her\nBut she don't know my name, I'm 'bout the game, I'm pickin' on her\nWrist so cold and my left hand's numb as summer\nI rip a hole 'til she don't want you gettin' on her\nShe makes you wonder if the women even want ya\nMr. Porter, keep a hungry [?]\nLearned it from my daddy, I teach it to my daughter\nYa oughta know the quota of my whole workout\nI float like Noah and don't worry about the rover bounce, yeah\n\n[Plays \"Microphone\" by Slaughterhouse]\n\n[Verse 5: Eminem]\nOnce again it's the sinister, cynical, minister Shady\nKryptonite to Superman, he's a dentist to Amy\nAdminister of the pain, just finished, huffin' the paint\nAnd muffled the fumes like it was nothing because it ain't\nAnything in his way, his enemies he just slays\nHis venom he spray, reaches like beams of energy rays\nMenacin' stares, he glares makin' the hairs\nAll on the back of your neck stand\nLike Dracula yep\nSpectacular rep, he's a tarantula, gargantuan\nYah, Angela so I command you to start dancin'\nPart Manson, part Hannibal, part mechanical shark\nThrowin' animal parts at Scarlett Johansson\nEnter my gas chamber, ya gangsta, my ass\nHe's got his fangs to your neck, he's set to strangle ya ass, hater\nYou're facin' a task greater, he's chasin' your ass\nHe's got his face in a mask, your blood stains on his glass table\n\n[Verse 6: Mr. Porter]\nI'm so obnoxious, open hand slap nigga, you with me?\nSee, you couldn't, you went off cryin' like Cuba Gooding\nI swan dive in your bitch pussy, I call her puddin'\nShe love us [?], I love the bitch cookin'\nScrap that, you niggas weak as Chuck Nevitt\nI fuck bucket [?] Jesus swing reckless\nEntrepo-po head honcho, hope you're ready 'fore I pop his ass\nNigga, kickin' through your door\nYou send goons to do your work\nI send goons to mommas in church, I've been a problem since birth\nGot a middle finger up her skirt\nI don't ask a bitch on a date, I ask her can I fuck her first\nSee y'all with this Runyon shit\nI made something out of nothing, I'm a hustler, bitch\nI keep a nine tucked burnin' up beside of my hip\nGotta make a hit for any nigga for fifty thousand chips, bitch\n\n[Verse 7: Eminem]\nI'm checkin' the exposure, a full dose of me exposin'\nMyself locked inside of a cozy hotel posin'\nWith or without clothing, next to the decomposin'\nBodies erodin' while I'm dozin' off overdosin'\nWindows opening-shutting, doors opening-closing\nI think there's a ghost, too much hydrocodone and codeine\nI was only supposed to swallow a half, I took the whole thing\nI'm not jokin', I think I just snorted my nose ring\nI need a drink, I'm standin' over the sink frozen\nMyself, self-loathing, 'cause I'm on a brink, mostly\nI don't wanna think this will make everything rosey\nBeverly sings, scream while I'm severin' three toesies\nTotally frozen while I close in, I'm yodellin'\nRosey, won't you come out to play\nAin’t no sense, wastin' time, cuttin' and pastin' headlines\nIn the papers makin' shrines of my crimes and capers\nMy words are whirlwinds, I murder my girlfriends\nGo to Europe and put neurofens in my syrup and stirred 'em\nYou never heard him like this, so don't encourage him\nThe neurosurgeon, coke mirrors, and lyrics worse than\nThe kinda person to get Katie Couric to cursin'\nEighty spirits of ladies 'cause Shady murdered the virgins\nCrazy turn of events and then he emerged\nTook over the world and reeled in all the children\nLured 'em into the building and killed 'em\nBuried 'em in the mulch and mildew and he will\nDo what he feels and still can spin\nStraw into gold like Rumpelstiltskin\nCotton to silk, Motrin to Tylenol - three pills, the Real Slim\nShady's entered the building\nThere's nothing but crumbled leaves and\nTumbleweeds up in this bitch, Mildrid\nHe's ill wit it, he still shouldn't be healed\nThere's no one as sick as he, MC's\nWill get fricasseed on the grill then\n\n[Plays \"Chonkyfire\" by OutKast]\n\n[Verse 8: Eminem]\nYou wanna start with the hook first\nYou wanna start with the...oh\nI have no idea what I'm doin', I have no idea what I'm doin', but\nEverybody get up, sit up Christopher\nThey're miserable without you, Superman is a-\nLive and he's flowin' like the Mystic River\nGirl, don't act like you've never been kissed before\nOne, two, three, four, five, six, this uh\nRhyme is about to hit you right in the kisser\nHow did anybody ever find me? I disa-\n-ppeared, I was hidin' in Freeway's beard, just a\nHop, skip and a jump from my skin gushin'\nNails into my face that I been pushin'\nHellraiser, my face is my pin cushion\nIt's like when I'm on the mic I can squish a\nSucker like a vise grip, my pen put you\nIn the slaughterhouse 'cause your style's been butchered\nI'll spin chainsaw, take off like the blades on, my brains on\nHyperdrive, someone put the brakes on\n\n[Chorus: Eminem & Mr. Porter]\nHere's a smidgen, a midget to get your digits, Bridget\nDon't try to fidget with it, ribbit ribbit\nI got you slippin' on my swag juice, my swag juice\nI got you slippin' on my swag juice, my swag juice\nNow here's a smidgen, a midget to get your digits Bridget\nDon't try to fidget with it, ribbit ribbit\nI got you slippin' on my swag juice, my swag juice\nI got you slippin' on my swag juice\n\n[Verse 9: Mr. Porter]\nI got it figured out now, nigga, see\nM—my mind's right, money right, can't nobody stoppin' how I get it\nIn hindsight I never should'a left where  I was livin'\nI probably wouldn't be gettin' pressed by all these women\nBut then again I wouldn't 'a met the ones that I was diggin'\nSo now I like to look and talk a lot like\nShe like Lil Kim and Kim and Serena Williams\nJust like my [?] I'm a regular Charles Dickens\nBitch, called me talkin' 'bout she pregnant\nShe [?] so I Mannie Fresh'd that ho and left baby\nI won't never trust her, no, shit\nEven if she specialize in mouth massagin' my testicles\nI never trust her, a ho, I, even on the first date\nShe's basically gettin' her mouth raped\nThen turn around and ask me for a kiss, \"No, bitch, I'm straight\"\nI've never really been concerned with how my own dick taste\n\n[Pre-Chorus: Mr. Porter & Eminem]\nI think I'm about slip on my swag juice\nI think I'm about to slip on your swag juice\nOh no! No, no, don't slip on your swag juice!\nYeah, yeah, I think I'm 'bout to slip on my swag juice\n\n[Chorus: Eminem & Mr. Porter]\nSo here's a smidge and a midget to get your digits, Bridget\nDon't try to figit with it, ribbit ribbit\nI got you slippin' on my swag juice, my swag juice\nI got you slippin' on my swag juice\nAlright\n\n[Verse 10: Eminem]\nSlim is in the house, simmer down there sister\nBound to get you dizzy 'cause he gets as busy as a\nBee baby you could throw a Frisbee in a blizzard\nHe'll catch it in his teeth, what is he? He's a wizard\nStandin' in the disco with a disco biscuit\nAnd I'm pretty sure it isn't Bisquick, is it?\nNow baby don't forget to bring your lipstick witcha\nI want the kiss 'fore I blow this bitch to smitha-\nReens, get the guillotines, this is a situ-\nAtion that's critical as Dre spins his, uh\nTurn tables and he cuts the record like a scissor\nChecka-chicky-checka-chicky-checka-checka-chicka\nWe'll wreck it in a second, tell me what the heck is sicker\nWait a minute, I just dropped my necklace in the liquor\nNow baby just to make a little breakfast and it's six o-\nClock in the morning unless you want to get some dessert\n\n[Chorus: Eminem & Mr. Porter]\nHere's a smidge and a midget to get your Bridgets, digit\nDon't try to fidget with it, ribbit ribbit\nI got you slippin' on my swag juice, my swag juice\nI got you slippin' on my swag juice, my swag juice\nI said, here's a smidge and a midget to get your digits, Bridget\nDon't try to fidget with it, ribbit ribbit\nI got you slippin' on my swag juice, my swag juice\nI got you slippin' on my swag, my swag juice\n\n[Outro: Eminem]\nYeah, ayo, just so everybody knows, that was a hook we made on the way to the radio station and we were trying to get it right;\nSo we may have fucked it up a couple times or whatever;\nBut, this is what we were trying to like work out before we came here. Especially for Westwood, man! 'Specially for you, homie!", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}