{"songs": [{"title": "Twisted", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro: Tech N9ne & Roger Troutman]\nSit back, listen to Tech N9ne\nI don't know, it's just some shit I wrote, you know what I'm sayin'? (You know you twisted, mentally insane)\nUh, I really don't know what I'm saying\nShit, it's the first thing that came to my head (Twisted)\nMan, it's crazy shit that I can't really explain\nAnd it goes like this\n\n[Verse 1: Tech N9ne]\nI gets, mo' trips than a little bit\nI smoked, mo' dips than a little bit\nI'm not that regular, when stepping, I can't wait 'til I can fly\nAway from my competitor, yah, Satana can die\nMy psychosis hopeless, focus, notice\nMy metamorphosis, folks is broke and jokeless\nPicture me in a syringe inserted in an overexerted felon\nAntidote having 'em runnin' eternally across the hell and\nDwamn, losin' my sanity livin' up in Les Miserables\nFuck bitter broads, this shit is gonna have us stacking if there is a God\nI'ma take the X away from generation, place it at the end of S.E\nFor the duration upon the level\nTell the devil to what? Skip a human\nI' ma tell him, \"Behold pale horses like us\"\nShame on a nigga when he feelin'\nHella down for a '99 killin'\nAin't giving a fuck I'm putting Nair in your leave in hair conditioner\nNow you Hari Krishna\nTo my listeners: In this rhyme you will find\nPsychotic scriptures saying it's somethin' disrupting my mind\n\n[Bridge: Roger Troutman]\nTech N9ne your mind is fine\nThere's just not anyone like you\nThe whole wide world don't matter no\nThey can't flow like you\nI must make you understand\n\n[Hook: Roger Troutman & Tech N9ne]\nMy thoughts are twisted (So mixed up)\nMy thoughts are twisted (So mixed up)\nMy thoughts are twisted (So mixed up)\nBut I get mixed up (So mixed up)\n\n[Verse 2: Tech N9ne]\nA, I'm lifted, B, I'm twisted\nC, I'm sick and sadistic, A, B and C\nSomething's I do I just can't stand\nUp in my bathroom I sex six women\nMentally, just me and me-\nMe and my faithful right hand man\nTie up a Muslim and shoot him with liquid pork on Ramadan\nWith force, I'll make a Christian read their kids The Necronomicon on Christmas\nDon't trip on this lyrical syphilis\nI flip this so the yonks will catch vapors like mentho-lyptus\nI'll feed a dominatrix patient pain pills\nGive Wu haters permanent fang grills\nTrick the artist formerly known and give him the same slave deal\nI'll lift a couple of Dr. Dre's reels\nSell em' to Snoop and No Limit Soldiers just so I can see how paid feels\nHazy Shade of decayed hookers with grave shields\nWhere AIDS fills the carcass\nBet a milli on it Tecca N9na be the darkest\nHeartless, I spark from the gut\nSo what the fuck?\nI'm trying to contain the insane, but what?\n\n[Hook: Roger Troutman & Tech N9ne]\nBut I get messed up (So mixed up)\nMy thoughts are twisted (So mixed up)\nMy thoughts are twisted (So mixed up)\nMy thoughts are twisted (So mixed up)\nBut I get mixed up (So mixed up)\n\n[Verse 3: Tech N9ne]\nWelcome to my asylum, it's hectic, they call me dyslexic\nRogue infested, more vicious than Cujo\nFraudulent tested, the punks arrested got the neck slit exit\nI'm twisted, I know Hollywood backwards says \"doowylloh\"\nForce feed me a sumo for about nine weeks playing Club Nuevo 'til he's blue, though\nThen stuff him in the front seat of a Yugo\nBody filled with beef and toaster strudel\nLet up the break and watch him race to the intersection; now he's through, though - ya estuvo\nI slide with a gang of twisted individuals\nSomebody better be looking for the criminal tendencies\nNever will they get us in the penitentiaries, killa\nMillimeter nine rip vinyl, I know\nMix flow like Korean Albino\nWino once breeded an elephant with a rhino\nCalled it \"The Helifino\"\nThrow Chuck Manson off in a pit of militant Jews banging hella opera\nThe real meaning of Helter Skelter is when they skin that forehead swastika\nAm I twisted? Am I twisted?\nI'm twisted, better keep your distance\nMama gotta call the psychiatrics for mental assistance\n\n[Bridge: Roger Troutman]\nTech N9ne your mind is fine\nThere's just not anyone like you\nThe whole wide world don't matter no\nThey can't flow like you\nI must make you understand\n\n[Hook: Roger Troutman & Tech N9ne]\nMy thoughts are twisted (So mixed up)\nMy thoughts are twisted (So mixed up)\nMy thoughts are twisted (So mixed up)\nBut I get mixed up (So mixed up)", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}