{"songs": [{"title": "Casablanca", "album": "Immobilarity", "year": "1999-11-16", "lyrics": "[Intro]\nStop touching the fucking door man\nYou so fucking paranoid man\nWhat's the matter with you man?\nIt's like a nigga could write for hours\nAnd get real theatrical wit' this\nUnderstand? Telling you kid\nI got stripes when it comes to this right here\nY'all know my repertoire\nIt's dangerous, and the cats I roll with is dangerous\nAnd they ain't your regular average cats\nHere we go\n\n[Verse]\nA-yo; It's all elegance\nHe spoke third power style high intelligence\nA young man handle the game like Merrill Lynch\n3 A.M. breathing, leaning in gates\nI mean creaming\nSelling these cakes in slabs like Land O' Lakes\nFiends beaming, steaming\nAssociated with names and demons\nAll apparent reasons\nWe live here the gate blew in a year\nSort of like time share where crime, sport it like I shine yeah\nRainbow dough was the M.O\nSo many flavors yo\nBuy your neighbor off underwater vault\nThen I met him, Colombian name Flako\nHad the whole block locked selling tons in Morocco\nWristwatch Vacheron Constantin - nigga dead up\nSniff the rawest mist mixed wit 7up\nHad a black wiz spoke German\nHigher learning burning\nAsk Vernon got a bed set bought a black jet\nBitch large percentage on her rich motor lodge\nLost her arm, shot with a AK up in the south\nParamedics rocked her\nSaid she had connections out Anartica\nBarrels of juices from Florida\nCan't forget live dusthead centerfoldin\nOut in Club Med butt ass laying like she dead\nWise guys fell for her ambiance\nPull it together, black renaissance Queen Elizabeth aunt\nCrazy swift Cristal murderer\nGuzzle the shit like she dying kid\nShowing off her diamond\nFlashbacks now it's me and him again\nLast word I caught\n'Put your money in we could have the shit bumping\nThat's federalo music\nI caught the glimpse from the bitch\nWhen she winched yeah Santa a grinch\nShe blinked twitched her nose then froze\nCheck your Rolls by the blow\nIt's time to roll nigga let's go\nI thought about it broke the money down\nWhat's the total count it, no count it over\nIn the mix day going slower\nNope not time to motor\nHe estimated over me\nNot being a crook, count it over\nYo only on the strength of my man\nWe ain't hit him with the strong hand\nGun him down leave him out in flatlands\nHe backhand smacked her\nThrew her on the table jacked her\nI broke out in laughter fifteen minutes after\nPolice knocked on the door\nLooked out the window of my room\nAs your, nigga yeah that's yours\nHe opened up the door this nigga wilding\nHis bitch is in shock\nStart smiling and speaking on Valen\nYo wisen up bitch this from the rich\nImmobilize the game get your name right\nEnvelope came hype\nRegards from the mayor you hype\nFuck right, lets fuck this money up\nAnd get large and blow outta sight\n\n[Chorus] (x2)\nWise niggas wake up, dead niggas lose\nWho you gon' choose - me or him? - you a fool\nPay attention, fuck around meet the tension\nSee you in the next dimension, y'all niggas didn't listen\n\n[Outro]\nWise niggas wake up, dead niggas lose\n... you a fool\nPay attention, fuck around meet the tension\nSee you in the next dimension, y'all niggas didn't listen\nWise niggas wake up", "image": "https://images.genius.com/d8508796401925d32124cc47a45641d8.500x500x1.jpg"}], "artist": "Raekwon"}