{"songs": [{"title": "Die Slow", "album": "The Pac & Biggie You Never Heard (Bootleg)", "year": null, "lyrics": "[Intro]\nJay Z, come out to play\nHey yo Assassin, gimme one of them tracks I can just ride on motherfuckers\nWith\nMobb deep.\nNiggas talkin' bout we can't rap? Niggas must nota' never heard no motherfuckin'\nTrack off a death row nigga\nDEATH ROW, WESTSIDE\nLet's get it on, daylight or fuckin' nightbreak\nMOB\nGo into these niggas, to the motherfuckin' death\n\n[Verse 1: 2Pac]\nCome hell or high water, down to slaughter opposers\nJust another lost soul, stuck, callin' Jehovah\nOutlaw 'til it's over, brandish my strap, back like a cobra\nI stay drunk ‘cause I'm a mad man whenever sober\nOn a one-man mission, my ambition's to hold up\nThe rap game, while I pluck holes in niggas like donuts\nAnd still down to die for all my soldiers like hillbillies\nThey don't fear me, so we feud, bringin' war to the city\nWith each breath, death before dishonor\nNever let you swallow me, no apologies, Your Honor\nA general in war, I'm the first to bomb\nWith a squad of trusted killers, quick to move shit, heavily armed\nI'm similar to Saddam, sometimes I question who's sane\nLike fiends frantic for that last vein, stuck in the game\nI hit the scene like sandstorms, then transform, watch me\nI take the figure of 30 niggas who all got me\nWhile bitches wonderin' who shot me\nNo love, keep a grudge, shootin' slugs like Muammar Gaddafi\nMurder my friends, build a new posse\nWe takin' shots at paparazzi, go and fly now, nigga, like Rocky\nYou got a lot of nerve to play me, another gay rapper\nBustin' caps at Jay Z and still avoid capture\nWhile y'all caught up in the rapture, still after me\nI'm in Jamaica sippin' daquiris, no doubt\nWe used to havin' nothin' then grabbin' somethin' and bustin'\nWanted to be the thug nigga that my old man wasn't\nI can't tour, fear of catchin' cases, litigation\nNiggas player-hatin', got me crooked in all 50 states\nI'm screamin' \"Death Row!\", throw my Westside, ain't no thing\nWe was raised off driveby's. brought up to bang\nWe claim mob. MOB. if you be specific\nWe control. ALL cash from the Atlantic, Pacific\nAnd get this. I'm hard to kill\nWhile I build with this live spot\nFather. how the hell did I SURVIVE. these five shots?!\nLive it up or give it up\nAnd like DEMONS. late night. hear 'em screamin'\nWE GOIN' ALL OUT!\n\n[Verse 2: Yaki Kadafi]\nWith money clutchin', bail, come murder man, po's rushin'\nCap tilted to the side, on the lean out the ride bustin'\nOutlaws enforce the secrets of war, but won't abuse it\nBurnt, bury my burners with my dead buddies when I use it\nGive a fuck about later. shots warm through the equator\nDeath to you traitors, shots bitin' through your bones like alligator\nPayin' my dues. lookin' for miscellaneous infamous crews\nOld ladies sing the blues. leave them smokin' from they shoes\n\n[Verse 3: E.D.I. Mean]\nNow with my every wakin' moment\nI'm on a quest to be better, yeah\nPosition myself to prosper state, prepared for whatever\nBut at times, I slip slightly, shit I ain't afraid to admit it\nTo gone, off that Novocaine, like in too hard to live it\nAnd I'm just a smidgen past my teenage years. into adulthood\nNow I ride with G's finally, knowin' myself good\nAnd it felt good, when I was young but playtime's over\nEDI here take this gun nigga it's over\n\n[Verse 3: Kastro]\nI piss cold blood, shit hot liquor out my liver\nSmoke like a tail pipe, and write when I'm bitter\nAll my life I been considered a downright, dirty nigga\nFrom when daddy knocked mama' s twat popped the last drop from the litter\nTell me give the world hell\nBut in hell I give 'em mo'\nAnd I bail outta jail\nScreamin' fuck the Po' Po'\nWhen I run to take that enough, from a simple fuck\nTo multimillion dollar luck\n\n[Verse 4: Napolean]\nPlus I think it's time to grab all pistols, wave them shits in the air\nCelebrate Outlaw livin' nigga, I wouldn't be here\nTo you death is losin', and to me this shit's a family reunion\nAnd to hell wit a peace treaty, never call it, cause it wouldn't feed me\nMy wallet. be as empty as the day I got started\nTwelve shots in my pocket, left my niggas departed\nIt's a shame that these snake vultures niggas coldhearted\nIn a dirty world where only God know yo death and can call it\n\n[Verse 5: Young Noble]\nWe thugged out, low cut, Outlawz rush and royal flush\nBomb first kickin' dust. out in Cali, but I ain't in it so much\nMake 'em pay state to state, NJ to CA\nThem cowards felt the weight, and turned feminine like Michel'le\nNiggas change they whole style when the outlawz comin'\nA million miles and thuggin'\nYoung Noble.I keep 'em buzzin'\nWhile the rapture. capture this fuckin' style that I master\nBringin' terminal disaster. HIT YOU UP when I pass nigga\n\n[Hook: 2Pac]\nUS, THE FIRST TO BUST, WHO DO WE TRUST? OUT FOR MOBB DEEP AND JAY Z, DEAD IN\nTHE DUST\nI TOLD YOU PUNKS THAT I WAS AFTER BIGGIE YOU GOT INVOLVED, NOW WE BOUT TO\nBUST ON ALL Y'ALL, GOIN' ALL OUT\nUS, THE FIRST TO BUST, WHO DO WE TRUST? OUT FOR MOBB DEEP AND JAY Z, DEAD IN\nTHE DUST\nI TOLD YOU PUNKS THAT I WAS AFTER BIGGIE, YOU GOT INVOLVED, NOW WE BOUT TO\nBUST ON ALL Y'ALL, GOIN' ALL OUT\nUS, THE FIRST TO BUST, WHO DO WE TRUST? OUT FOR MOBB DEEP AND JAY Z, DEAD IN\nTHE DUST\nI TOLD YOU PUNKS THAT I WAS AFTER PIGGIE YOU GOT INVOLVED, NOW WE BOUT TO\nBUST ON ALL Y'ALL, WESTSIDE, GOIN' ALL OUT\n\n[Outro]\nJay Z (WESTSIDE), haha boy you at yo funeral, punk motherfucker\n(OUTLAW, DEATHROW, MAKAVELI THA DON OUTLAWZ THE CRIMINAL)\n(DESPERADO'S, WESTSIDE THUG LIVIN')\nBig dick-sucking lips\nHow you goin be Hawaiian Sophie one year and be tough-ass mobs the next year?\n(DIE, DIE SLOW)\nNigga my memory ain't bad you up out the business\n(DIE, DIE SLOW)\nBANG, you dead\n(DIE, DIE SLOW)\n(Haha mobb deep, you lil young ass juvenile delinquent)\n(DIE, DIE SLOW)\nBANG BANG, you dead\n(DIE, DIE SLOW)\nBiggie, BANG, you dead\n(DIE, DIE SLOW)\nPuffy, BANG, you dead\n(DIE, DIE, DIE SLOW)\nYou out the game. No need to explain; get outta here\nDIE, DIE, DIE SLOW\nDIE, DIE, DIE SLOW\nMmh, DIE, DIE SLOW\nMY LABEL: THE VICTORIOUS, UNTOUCHABLE DEATH ROW!", "image": "https://images.genius.com/d2c45ba5a5360d934b6c8f30e1fea115.168x168x1.jpg"}], "artist": "2Pac"}