{"songs": [{"title": "N.I.G.G.A.", "album": null, "year": null, "lyrics": "[Intro] (2Pac)\nNiggas! (Yeah!) (Uh)\nNiggas!\n\n[Verse: 2Pac]\nWho's afraid of the punk police?\nNiggas run the streets, no justice no peace\nFuck the law, rather draw than do time\nDon't fuck with mine, cross the line, my two nines\nGo baya baya when I shoot 'em\nKorean mothafuckers was crooked\nSo niggas had to burn and loot 'em\nNow the streets ain't safe at night\nMy Niggas! Straight take his life\nSo don't sleep when my Jeep creep up, how we hit 'em\nEmpty the clip, then dip cuz we did 'em\nLickin' of shots for Latasha that's proper\nLove for my niggas but a Glock for the coppers\nSo what the fuck you wanna do now\nI packed a .9 last year, in '99 I'm packin' 2 now\nAnd even if they pull their triggers\nThey can shoot one man\nBut nothings gonna stop the plan of true niggas\n\n[Chorus (2Pac)]\nNiggas! (Yeah niggas, you can't fuck with us)\nNiggas! (Cuz bein' a nigga means you love niggas)\nNiggas!\n(Jada!, ey yo)\n\n[Verse: Jadakiss]\nMy dimes make the fiends go to sleep, so they call 'em bedrocks\nNiggas is like photographers, all they take is head shots\nYour last words'll be, \"damn what's all these red dots?\"\nNiggas nowawadays, they worry me, my bars is therapy\nAs long as you usin' them thouroughly\nMuah til the day that they bury me\nMy niggas is stronger and tighter now than they probably will ever be\nAnd i'm a product of the '70's\nThe hood got niggas on punishment, that's why they never leave\nIf I ain't eatin' with you, i'm probably beefin' with you\nIf no money ain't involved ain't no need for me speakin' with you\nI know you got a gun but i'm hopin' you keep it with you\nCuz unfortunately, i'm one of them rappers that keep a pistol and\nYou know what the llama do, Shady/Aftermath\nRuff Ryders, D-Block, and of course Amaru\nLotta people honor you\nProbably cuz of the way you used to bring the drama to\nWhoever you wanted to\nYou a leader when you can get a leader to follow you\nBut anyway, life goes on\nSo i'll see you when I art in heaven like our fathers do\n\n[Chorus (2Pac)]\nNiggas! (Yeah niggas, you can't fuck with us)\nNiggas! (Yeah niggas, cuz bein' a nigga means you love niggas)\nNiggas!\nNiggas! (Nigga!, you can't fuck with us)\n[Fades out]", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}