{"songs": [{"title": "Jungle", "album": "I Came From Nothing", "year": "2011-06-08", "lyrics": "[Verse 1]\nI ball in multiple ways, which means I'm athletic\nYou been hustling for ten years, which means you bad at it\nIf a million was nine feet, you wouldn't grab at it\nBut a cracker got five thousand, you would snag at it\nYou niggas stupid dumb, which makes me stupid smart\nAnd they be waiting one play while I be playing my part\nMy diamonds ricochet, them diamonds looking dark\nI be in the crowd with my fans, I have a groupie heart\nBitch I be going in, but I ain't naked though\nAnd I be flexed up, I own the beau tux', yo!\nThem niggas wifing them, we be on the next hoes\nAnd I kick the super shit, but Boots leg broke\nYeah! And this beat crazy\nBut I've been fucking beats, that's how I got two babies\nYay, shouts out to real lil' Haiti\nWhat are babies born with rabies, ugh\n\n[Hook: ???]\nCleveland Ave is a concrete jungle (It is)\nIt's a jungle (It is)\nIt's a jungle (It is)\nNiggas from the ave don't fumble\nThey can't fumble (Yeah)\nThey won't fumble\nCleveland Ave is a concrete jungle (It is)\nIt's a jungle (It is)\nIt's a jungle (It is)\nNiggas from the ave don't fumble\nThey can't fumble (Yeah)\nThey won't fumble\n\n[Verse 2: Young Thug]\nWhat's the beefing about? And niggas say they shooting?\nShit, they snuck and shot me, what's the sneaking about?\nWhat's the cheating about? Or they eating what 'bout\nShit, I don't sneak, I don't cheat, I just see and hop out\nThen I start gunnin'\nThen they start runnin'\nAnd I start runnin'\nYou know how that go\nWhere I'm from, niggas might buy a deuce or four\nAnd then later, I'm kicking the door\nBig Jumbo fo' sho'\nYeah! Shouts out to the ROC crew\nUnfunk I got us, I mean I got you\nYou like a new pair of shoes, I gotta cop you\nAnd when you get home, I swear they ain't gonna stop you\nFrom doing nothing, shouts out to 2011\nShouts out to all 11 of the kids\nAnd when I talk to my momma, I still sit on her like a kid\nAnd if you have them racks, my ho will sit on you like a wig\nYa dig?", "image": "https://images.genius.com/ac0b77a35fdb3726c0ed9766d648c354.500x500x1.jpg"}], "artist": "Young Thug"}