{"songs": [{"title": "Lifted", "album": "Grow Season", "year": null, "lyrics": "[Hook]\nCause I'm lifted\nCause I'm lifted\nFor a zone paid a whole 550\nCause I'm lifted\nCause I'm lifted\nI don't want what you want, I smoke Swishers\nI get lifted\nI get lifted\nDon't got none you ain't gonna smoke with me\nCause I'm lifted\nCause I'm lifted\nSniff so strong that you boys can't miss me\n\n[Verse 1]\nYou ain't heard of me I keep the weed up in the air\nCome up to my crib you'll see weed everywhere\n3 boxes in homie I ain't stopping there\nAlways paid attention though but now they stop and stare\nI'm fresh to the death dressed like a million bucks\nEyes Chinese smelling like a million blunts\n4 zips up in the speakers of my trunk\nFuck the club owners I'm a chief when I want\nHaters talk shit\nAin't going to do shit to me\nShorty on my dick cause my piff smell fruity\nDon't want me blowing smoke in your face bitch sue me\nAte them other niggas\nThis how Pittsburgh do it\nKeep a swisher moving\nIf don't nobody know\nYou going to find out why they call me Mr. Blow it by the O\nI'm smoking on stage\nRoll a blunt up at a show\nWhile my niggas getting paid\nThrowing money on the floor\nSeen a bad bitch ain't got fronted on before\nBut I'm Warner Brothers now\nSo I stunt on every ho\nDo a nigga do it bigger?\nWhy don't you go on and let me know?\nTake your time\nI'm a roll one\nA cigarillo what I like called Ray\nSmoke one sweet hanging high all day\nEyes all blazed\nYa'll about\nWait a minute\nStill ain't found that answer to the line I was saying\nThat marijuana got my shit dry and all red\nReally not the guy to try what y'all plant\nMight break you off\nBut no I'm not staying\nThe game play to win I'm all in like when\nHeard a lot of talk but you ain't saying nothing\nMiddle of the floor I'm a shake these guts and\nFill my Swisher with a light green substance\nEvery time you see me man I'm blazing something\n\n[Hook]\n\n[Verse 2]\nSmoking on exclusive so don't ask if you can hit it\nSmell that is great don't even ask me where I get it\nAnd what I pay for is way past you niggas limit\nSmoke in the day\nWhat's that bad shit you flipping?\nCrack another swisher\nRoll it while I'm driving\nSpraying blunt block case the Po-Po up behind me\nIf I got some chronic\nKnow it's going to be diamond\nIf I got a bitch know she going to be diamond\nHenny to the throat\nTurn to smoke in my body\nHeard that T-Pain, now she want to be my shorty\n90 on the tank and the jeans 340\nNever stop rolling\nI'm a smoke til I'm retarded\n\n[Hook]", "image": "https://images.genius.com/b0673dfc8e451f01ab36cb28e28673e6.500x498x1.jpg"}], "artist": "Wiz Khalifa"}