{"songs": [{"title": "Mission Statement", "album": "No Genre Pt. 2", "year": "2014-07-09", "lyrics": "[Intro (Sampled): Franklin D. Roosevelt]\n\"Let me assert my firm belief that the only thing that we have to fear is... fear itself\"\n\n[Ad-Libs]\nKutt The Check, oh\nKutt The Check, Bobby!\n\n[Verse 1]\nLadies and gentlemen\nGentlemen, consider this moment the Genesis\nThis is the part where you flip the fuck out as you feel the adrenaline\nI'm only here to give, I'm only here to give you the experience\nOh what an experience, they probably should've prescribed me with Ritalin\nBut fuck it, rumor has it A.D.H.D wasn't real, it was just an experiment\nAll of these years I was taught to be ignorant\nTryin' to figure out why I'm so different\nModern day life is set up like a pyramid\nI was sleep, man I woke from the ignorance\nWake up now, tryna' sell me a membership\nShittin' on niggas so much that I'm hemorrhaging\nYour bitch at my concert auditioning\nShe wants me to buy her some booty shots\nBut I can't fix a flat, I'm not Michelin\nMy mind's overflowing with images\nSo many thoughts I can never remember them\nBut I never forget to go straight to the source\nI learned to cut out all the middle men\nI got no patience for your basics\nTime is dwindling, you just ain't interesting\nNo strangers inside of the organization\nThat shit is strictly prohibited\nThe music industry is sickening\nBut no one will ever admit this shit\nThese niggas ain't making the numbers they make\nAnd shit, half of these niggas pretending\n\n[Break]\nYo, fuck a hater, fuck a genre\nNo genre\nYou can't box it in\nThey try to box me in but they couldn't box me in\nThey try to describe me but they just still can't describe me to this day\nYou'll never be able to describe me\nNo genre, no genre, no genre\nThe label\n\n[Verse 2]\nWhy do I bother (why do I bother\nSpending time gathering thoughts up to prove I go a little bit harder\nI'm like Jesus on the microphone\nI make vodka from water (shots, shots, shots)\nKinda' like Jimmy Carter, just a little bit darker\nThe rap game just got a little bit smaller\nI just lay down the facts\nSo lay down and stay down or stay off my sack\nNiggas say I ain't dope, need to lay off the crack\nBustin' like a motherfuckin' AR with lasers\nDrop a fuckin' bomb on the radar like Adolf was back\nI blow a state straight off the map\nHundred round ricochet, when them stray rounds come back\nGot to go and get this paper, I can't hang out to chat\nWhere the, where the, where the players at?\nBring the paper back\nRunning through the racks like a motherfuckin' pyromaniac\nI need a lady that ain't a basic rat, with a crazy gat\nWith a decent booty hanging out her back\nGive that thing a smack like a angry black (pow)\nBut before I smash gotta' wear a safety hat\nBobby where the mac? Bobby where the mac?\nMan Eastside got the flow, had to bring it back\nNow motherfuckers acting conscious and shit\nJust cause you're dressed like a hippie\nAttending the Coachella concert and shit\nDon't make you no different than me\nCause I happen to like making money and shit\nI'm just being honest, I never make promises\nI just pay homage and shit\nNo Genre you bitch\nBandz", "image": "https://images.genius.com/07af9b12b2956baf31b88d2ae47697d2.500x500x1.jpg"}], "artist": "B.o.B"}