{"songs": [{"title": "The Juks", "album": "Bulletproof Wallets", "year": "2001-11-13", "lyrics": "[Intro: Superb]\nYo roll, yo' roll\nMy roll, my roll\nAiyo Maurice go to the store for me son\nMy roll, tell that bitch Keisha come here\nTell that bitch Keisha come here man\n(Two dutches, hollar, hollar)\nNiggas rollin' for money over there dunn\n(It's on a breathin', it's slice on\nI want that honey's bracelet)\nGettin' it over there\n\n[Ghostface Killah]\nAiyo what's in it? Three M's in the bank\nShoot it, oh you gotta stop?\nSix bitches, to the top\nA four and better, beat the five\nI looked him in his eyes, grabbed the dice\nSon I'll five 'em better twice for ya fuckin' life\nMoney feed good, all downs is a bet\nMeanin', any money on the ground is a bet\nOpen up the pool, get a dicin' room\nAight bitches, shoes, Pampers, girls need a nice room\nThat's a six, I told you that bitch ain't claustrophic\nIf you ass-bettin', you just bet yo' ass\nNah, I got the money, I even got one wit' me\nAnd 'Von bring it too, he on his way to come get me\nHe just hit me, he'll be here in fifteen\nWith them two things, grey Benz and maroon seats\nI got a quarter-mil in each of my fur sleeves\nThe rest is in my long johns, boots and jeans\nCome in the buildin', before I pay I wanna see a three\nCome in the buildin', nigga\n\n[Hook: Superb]\nPop your collar (do whatever you do best)\nJust pop your collar (up the ladder to the hill of success)\n\n[Superb]\nAiyo, aiyo, aiyo, he had three down and bet three M's\nSo you know what happened to him\nHe got three rounds, we all ex-dealers\nEx-killers, Wu gon' ride to the death for the skrilla\nI hold my own and rep my niggas\nAlways oil my guns and inspect my triggas\nSometimes I call my lawyer just to check my figures\nHe told me not to worry, all cheques is clearin'\nSo fuck my rhymes, I got the best appearance\nAnd I survive through project experiences\nYou wanna roll dice or roll and ride?\nNo matter, you gon' get holes inside\nSee you fuckin' with Theodore Dieni\nYou fuckin' with a metaphor King Pin\nYou fuckin' with him? Wu-Tang\nWu, you fuckin' with them?\nDun, you wanna gun to make you slim?\nSo I'mma pop my collar, get my dollars\nPop all parlors and fuck with money scholars?\nMatter of fact I'm gonna fuck with rockweilers\n\n[Hook: Superb]\nPop your collar (do whatever you do best)\nGet your dollar (New York, up the ladder to the hill of success)\nPop or holla (you know what we gonna do)\nJust pop your collar (New York, say no more, New York, say no more..)\n\n[Trife]\nLet off the Jackey Don, rollin' the dice with a happy arm\nEverything good, money on wood\nBank stoppers, I send them home broke\nHave them all in they stash, bettin' they own coat\nI takes it all, fifty and better, you make the call\nWatch you break your all, big sixes cuz I'm a nigga who don't like to fall\nHigh roller, see how my dice kiss\nPush you pay me, and if I roll trips you pay me twice bitch\nI rocks, believe it or not\nCome broke to a dice game, step off and leave with a knot\nHead cracks is all you see when I'm hot\nWhat's in the pop? A 100 g's to the bank to the man, who got it stopped\nMy hand is like a gun, feel the heat when it's cocked\n4-5-6 your heart drop, way deep in your socks\nYou wanna walk, book your ass down the street with a bop\nThe drinks is on you tonight, for my peeps in the spot\n\n[Hook: Superb]\nPop your collar (do whatever you do best, yo)\nGet your dollar (up the ladder to the hill of success)\nPop your collar (you know what we gonna do)\nJust pop your collar (pop us, do us)", "image": "https://images.genius.com/f4093661813b3ac25f7c044e4b1e305d.899x899x1.jpg"}], "artist": "Ghostface Killah"}