{"songs": [{"title": "Year 2000", "album": "Black and White - Music From and Inspired By the Motion Picture ", "year": null, "lyrics": "I wanna speak to you motherfuckers for a minute\nYeah, what's happenin? Yeah thanks for the lighter\nAnybody smoke here? Yeah, aight\nThat's uh that's more for me you punk motherfuckers\nLook, check it, look\n\n[Verse 1: Xzibit]\nEverybody here was born to hustle\nIt's a very thin line between the boss and the muscle\nWe foot soldiers, face first in the trenches\nOnly time I'm on my back is fuckin these hoes and weight benches\nYeah, Hell's Kitchen, raw tension\nNever cryin and bitchin or settlin for less, heh\nMetal in your chest, take a final breath\nRevolutionary, it's X-Man the mercenary, heh\nCarry a .44 Desert Eagle\nFeeding the people, even if it ain't legal\nLowridin in the Regal or the Cadillac\nMoney stacked probably give your ass a heart attack\nPurchased your last CD, I want my money back\nIt's either that or I'mma see you in the street\nSurvival of the first to draw the heaters and the cannons\nI'm guaranteed to be the last man standing\n\n[Hook: Xzibit] 2X\nCrack a bottle for your hard time\nIt's dedicated to my soldiers on the front line\nThis one's for all of us\nThinkin bout your casualties\nLearn from mistakes, protect your family\nCause it's the year 2000\n\n[Verse 2: Xzibit]\nEverybody wannabe king, fuck everything\nAll this shit is bout to me mine, I hear it all the time\nLive your life for the day\nEasier to burn than paper-mache\nStarted with Dre, graduate to radio play\nI still ain't satisfied, bout to blast off worldwide\nGet in line check the politics\nEver wonder why only certain motherfuckers get rich?\nAin't this a bitch, barely can eat, barely can pee\nI dedicate my life to the street\nIt's not for you if your stomach is weak\nRelax with dead bodies covered with sheets\nThat's the only time I really find peace\nHavin violent stand-offs with the police\nNorth Hollywood beef, grindin my teeth\nHave you stuck and stunned in disbelief\nNew breed I'm the bad seed\nSmokin weed 'til my motherfuckin eyes bleed\nDedicated to the niggas that despise us\nSo ain't nobody 'sposed to be here besides us\nCatch a flatline\n\n[Hook: Xzibit] 2X\nCrack a bottle for your hard time\nIt's dedicated to my soldiers on the front line\nThis one's for all of us\nThinkin bout your casualties\nLearn from mistakes, protect your family\nCause it's the year 2000\n\n[Interlude: Xzibit]\nBroadcastin live from Planet Los Angeles, right?\nHuh, it's X to the Z Xzibit\nWhat? New millenium\n\n[Verse 3: Xzibit]\nI was one that never begged for nothin\nMe and my homies build penitentiary huffin\nRunnin your mouth like a bitch cause you all on my dick\nWhat is he Dogg Pound now? Is he still with Tha Liks?\nIs he rich? Is Xzibit a Crip?\nThis is business stay the fuck out of my family shit, heh\nA grown man, the back of my hand is what you receive\nThe X-Files make you believe\nYou check the Soundscan and do the math\nMe and my staff run a worldwide warpath\nA bloodbath make Xzibit have a good laugh\nIt's goin down, hit the ground like a plane crash\nYou lil' fags ain't prepared for the X-Man, scared and desperate\nYoung and restless, there is no guest list\nMove to the back of the line, yo it's my time\nPrime time only where the beats and the rhyme shine\n\n[Hook: Xzibit] 2X\nCrack a bottle for your hard time\nIt's dedicated to my soldiers on the front line\nThis one's for all of us\nThinkin bout your casualties\nLearn from mistakes, protect your family\nCause it's the year 2000", "image": "https://images.genius.com/9ec052a6e8aae68c987a188623de67f9.975x1000x1.jpg"}], "artist": "Xzibit"}