{"songs": [{"title": "Wouldn’t Leave", "album": "ye", "year": "2018-06-01", "lyrics": "[Chorus: PARTYNEXTDOOR & Kanye West]\nI don't feel that she's mine enough\nGod, I feel I couldn't have you windin' up\nButterfly in my wrist\nYou make pretty women out of my skin\nAnd I don't feel like\nAnd I know you wouldn't leave\n\n[Verse 1: Kanye West]\nThey say, \"Build your own\"—I said, \"How, Sway?\"\nI said, \"Slavery a choice\"—they said, \"How, Ye?\"\nJust imagine if they caught me on a wild day\nNow I'm on fifty blogs gettin' fifty calls\nMy wife callin', screamin', say we 'bout to lose it all\nHad to calm her down 'cause she couldn't breathe\nTold her she could leave me now, but she wouldn't leave\n\n[Refrain: Kanye West]\nAnd I know you wouldn't leave\n\n[Bridge: Jeremih]\nAnd I sometimes wish\nWe doin' such things\nWe could wait longer than this\nYes, you know you're one of these\nWe can run through with the top chopped, yeah\nAnd the sundress down, ooh\n\n[Refrain: Kanye West]\nAnd I know you wouldn't...\n\n[Verse 2: Kanye West]\nOh, don't bring that up, that's gon' get me sentimental\nYou know I'm sensitive, I got a gentle mental\nEvery time somethin' happen they want me sent to mental\nWe had an incident, but I cover incidentals\nYou want me workin' on my messagin'\nWhen I'm thinkin' like George Jetson\nBut soundin' like George Jefferson\nThen they questionin' my methods then\nIf you tweakin' out on my texts again\nThen I don't get reception here\nI got the mind state to take us past the stratosphere\nI use the same attitude that done got us here\nI live for now, I don't know what happen after here\nI live for now, I don't know what happen after here\nPlus, what was meant to be was meant to be\nEven if, publicly, I lack the empathy\nI ain't finna talk about it, 'nother four centuries\nOne and one is two, but me and you, that's infinity\n\n[Refrain: Kanye West]\nAnd I know you wouldn't...\n\n[Chorus: Choir, PARTYNEXTDOOR & Ty Dolla $ign]\nI don't feel like she's mine enough\nGod, I feel I couldn't have you windin' up (Why?)\nButterfly in my wrist\nYou make pretty women out of my skin (Out of my skin)\nAnd I don't feel like (Uhh)\nAnd I know you wouldn't leave (Love me or hate me)\n\n[Outro: Kanye West & Ty Dolla $ign]\nFor any guy that ever fucked up (Love me or hate me)\nEver embarrassed they girl (Love me or hate me)\nEver embarrassed they wife (Gone when you miss me)\nShe told you not to do that shit (Ohh)\nShe told you you's gon' fuck the money up\nBut you ain't wanna listen, did you?\nKeep that same energy\nKeep that same energy\nKeep that same energy\nNow you testin' her loyalty\nThis what they mean when they say\n\"For better or for worse\", huh?\nFor every down female that stuck with they dude\nThrough the best times, through the worst times\nThis for you\n\n[Refrain: Kanye West]\nAnd I know you wouldn't leave", "image": "https://images.genius.com/ce52bec054f3d772071d0c309970e616.1000x1000x1.jpg"}], "artist": "Kanye West"}