{"songs": [{"title": "Memories of Home", "album": "Let Love", "year": "2019-08-30", "lyrics": "[Verse 1: Common]\nMy first memory, my birthday on a party bus\nPops wasn't there but that wasn't obvious\nIn Mom's arms, in God we trust\nBlack Mama love, everything marvelous\nI didn't know what I was missin', part of a system\nPops is gone, Uncle in prison\nInside wishin' for men to teach me 'bout girls and religion\nMade my own rendition of grindin' and kissin'\nWeekend calls to my Dad I'd listen\nStill I felt distant, distant like love\nThere's only so far that words could really hug\nDidn't wanna be a thug, older niggas I banged with\nI learned a lot from them cuts in the basement\nThe smell of blunts laced with a little bit of spice\nWise, high niggas, giving me advice\nWe go out and start fights, scuff up our Nikes\nCome back to talk crap and shoot a little dice\nThis is a slice of life and memories\nSittin' in my mind vividly, often they visit me\n\n[Chorus: BJ the Chicago Kid]\nOh baby\nDa-da-da, da-da-da, da-da-da, da-da-da (Oh, oh)\nI'm just tryna find a way to understand (I'm tryna understand)\nOh, oh, oh, oh\nHow do I rewind the tape and live in it? (Ooh-ooh, ooh-ooh, oh-oh, oh-oh)\nStayin' out late and playin' in Wonderland (Ooh-ooh, oh-oh-oh)\nIs it in God's plan?\nI'm just tryna find my way to understand it\n\n[Verse 2: Common]\nMetaphors can't explain how far I came\nA young man at work, I made my own lane\nSteered away from pain, relied on drive\nThere's a old saying, \"Don't cry, survive\"\nAs I kept building there were cranes in the sky\nCertain memories my brain would deny\nA tear laid in my eye, I was afraid to reply\nTo the hurt that was callin', it came from the sky\nAn older play cousin, of course I trust him\nBut he was touchin' where he wasn't supposed to be touchin'\nWhat's a kid supposed to do?\nWhen they goin' through, what I was goin' through\nDon't know who to go to\nYou want to tell somebody\nIn many ways, I failed somebody\nThat somebody was me\nNow I'm talking to little Rasheed\nIncarcerated heart, man, you gotta be free\nI felt it, when I told my man I would help with\nThings he was dealin' with I really hadn't dealt with\nEmotions meltin', I began to release it\nThings you can't change, you could come to peace with\nAt least get it better for the children of forever\nI read the Lord's letter, I forgive our debtors\nThey don't talk about it, maybe sharing their story\nMemories of home, shared pain and glory\n\n[Chorus: BJ the Chicago Kid]\nOh baby\nDa-da-da, da-da-da, da-da-da, da-da-da (Oh, oh)\nI'm just tryna find a way to understand (I'm tryna understand)\nOh, oh, oh, oh\nHow do I rewind the tape and live in it? (Ooh-ooh, ooh-ooh, oh-oh, oh-oh)\nStayin' out late and playin' in Wonderland (Ooh-ooh, oh-oh-oh)\nIs it God's plan?\nI'm just tryna find my way to understand it\n\n[Outro: BJ the Chicago Kid]\nSaid I'm tryna understand, understand, understand, understand\nAyy-hey, oh-oh, oh", "image": "https://images.genius.com/edcca611de8a88a9ff0e0173cc02f5a7.1000x1000x1.png"}], "artist": "Common"}