{"songs": [{"title": "Indian Girl - An Adult Story", "album": "The Great Adventures of Slick Rick", "year": "1989-11-01", "lyrics": "(Singing)\nDavy, Davy Crockett, King of the Wild Frontier, yeah\nDavy, Davy Crockett, King of the Wild Frontier\n\nWell he's in Indian Town and what spots his eye?\nA nice looking Indian and honey looked fly\nHe had to talk because he just couldn't hack it\nShe wore some moccasins and plus a tough leather jacket\nHe trotted over and invented a line\nHe said \"Excuse me, um, do you happen to have the time?\"\nAll was on his mind was sex, sex, sex\nSo she said, \"Why do ask? You got your own Timex\"\nTo poor old Dave that line was cold blooded\nIt seemed like her ego was way over flooded\nShe started to laugh and then she started to say\n\"I'm sorry some times I do get carried away\nI didn't mean to like ill treat you\nMy name is Running Rabbit and I'm glad to meet you\"\nHe said \"I'm Dave, with crazy clout\"\n\"Oh you're the one the girls keep talking about\nYeah, you must be, because you look like a winner\nCome to my house, we'll discuss it over dinner\"\n\n(Singing)\nDavy, Davy Crockett, King of the Wild Frontier\n\nWell, he met her father, Big Chief Beretti\nHe said \"What's for dinner?\" \"Soup and spaghetti\"\nThe dinner was rotten and he swore he's gonna puke it\nHe never would have took it if he'd known that he had cooked it\nLater on they was chilling in the bedroom\nSitting at the window looking at the Moon\nNothing was being said so he swore she was hot\nHe said \"Are you in the mood?\" She said \"No I'm not\"\nFrom what he believes and from what he gets\nWhen a girl says no, he really thinks she means yes\nSo, he started touching her and coming out strong\nWhispering sweet nothings and singing a song\nHe said: (singing) \"I'm in the mood for love\nSimply because you're near me\nFunny but when you're near me\nI'm in the mood, don't mean to be rude\nBut I'm in the mood for love\"\nAnd the she said \"Oh Dave, you've got my poor back hurting\nI want you, first close the curtain\"\nHe closed the curtain and also the doors\nThe next thing you knew it was off with those drawers\n\n\"Take it easy Davy, you're hurting me. Stop\"\n\nWell, he was playing with her tits, they were soft not lumpy\nAnd then he cracked the legs like Humpty-Dumpty\nHe's fucking, sucking, also finger popping\nHe had no intention of stopping\nCrazy fun, he did not want to leave\nHis head was between her tits and he could barely breathe\nHe had to toss, turn, turn, toss\nMeanwhile he was riding her with crazy force\nShe was burning hot, she said \"Stop, stop.\"\nHe said, \"Are you talking sex or what?\"\nI guess she didn't realize what she started\nNext thing you knew she was acting retarded\nShe said to him strangely and kind of merry\n\"Stop now, or I'll be unable to marry\"\nHe didn't take her warning\nHe rode her till the morning\nHe rode that ass till the pussy started yawning\n(Yawning sounds)\nHe said \"What? Wait\" His dick went weak\nIt said \"Dave, pussies ain't supposed to speak\"\nHe took all his clothes he wanted to leave this place\nBut first he wanted to see the vagina face to face\nHe opened it up, with his bare two thumbs\nHe seen crabs with spears and Indian drums!\n\nThey's going:\nHeya hiya heya hey, hey\nHeya hiya heya hey\nHeya hey, heya hey\nHeya hiya heya hey\nHeya hiya heya hey", "image": "https://images.genius.com/09b48445ade4e1b5e75781bcfa6eb3c6.924x924x1.jpg"}], "artist": "Slick Rick"}