{"songs": [{"title": "Why (Remix)", "album": null, "year": null, "lyrics": "[Intro: Anthony Hamilton]\nAll that I'm given\nIt's this pain that I'm living (The Remix, The Remix)\nThey got me in the system\nWhy they gotta do me like that?\n\n[Verse 1: Styles P]\nWhy is garbage music sellin' a lot?\nWhy is the music industry state of mind real far from Hip Hop?\nWhy vote republican if you black?\nWhy build more jails, less schools cause we under attack?\nWhy keep the four pound in the air?\nThe revolution will not be televised if around here\nWhy keep my right fist in the sky?\nI let them know that \"We Gonna Make It\", don't plan our demise\nWhy you gotta teach your kids on your own?\nCause when you get in the zone, they bringing you in, you both getting cloned\nWhy we still gotta pray to Allah?\nIt's Hip Hop, this the New World Order and they playin' us hard\nWhy rappers getting protection?\nWhy the country ain't flipped when they jerked the votes the last election?\nWhy die for all my beliefs?\nI gotta look at my kids I rather smile then cry when he's sleep\nThat's why\n\n[Chorus: Anthony Hamilton]\nWhy\nWhy they got me strugglin', why?\nAll the brothers locked behind bars\nChained up in the system going crazy\nI better leave my pistol on, why?\n\n[Verse 1: Common]\nWhy do they say I changed for a girl?\nWhy you worried bout my clothes if my flow gonna change the world?\nWhy you wait 'till you 30 then try to be hard?\nWhy I gotta have religion if I believe in God?\nWhy is Bush acting like he trying to get Osama?\nWhy don't we impeach him and elect Obama?\nWhy ain't Rick James remembered for classic hits?\nWhy do we remember it for smackin a *bitch*?\nWhy did Ricky Williams retire, they mad in Miami\nWhy did Justin sell Janet out and go to the Grammy's?\nWhy you kill on every song, why you frown at the screen?\nSo many thrones, why we argue who is the King?\nWhy it's over for gangsta, why it's over for bling?\nWhy they hype Britney up, they know she can't sing?\nWhy a whip and a chain the black american dream?\nWhy I know it in my heart it remains unseen?\nWhy?\n\n[Chorus: Anthony Hamilton]\nWhy\nWhy they got me strugglin', why?\nAll the brothers locked behind bars\nChained up in the system going crazy\nI better leave my pistol on, why?\n\n[Interlude: Nas]\nEy ‘Kiss, they wanna hide from the truth\nYour comrade Nas right here with you. Let’s go\n\n[Verse 3: Nas]\nRegistered voter not blood of a panther, why is the question\nWhat is the answer, got a suggestion, here's an example\nWon't we build our own airline, states, and highways?\nFly to Africa, do some trades with Zimbabwe\nWhy did Malcolm's mission die with the man?\nWhy we ain't pick it up where he left it and carry out his plan?\nWhy the merger try to exclude L.A. Reid?\nHe brought you Usher, OutKast top-selling CD's\nWhy do half America got AIDS?\nWhy do schools care about your son's braids more than they care for his grades?\nWhy they hate our white t-shirts and hats turned backwards?\nAnd why is Jesus Christ never played by black actors?\nAnd why there ain't a MC that can touch me nor budge me?\nAnd why is Nas the best thing in rap since Chuck D?\nAnd why this record ain't sell 5 mill yet?\nJada's as real as it get put my money where my mouth is\nLet's do something bout this\n\n[Chorus: Anthony Hamilton]\nWhy\nWhy they got me strugglin', why?\nAll the brothers locked behind bars\nChained up in the system going crazy\nI better leave my pistol on, why?\n\n[Verse 4: Jadakiss]\nUh, yeah, yo, by thugs I'm surrounded\nTell me why is it the money motivates me but the love keeps me grounded? (I don't know)\nWhy my cases ain't get thrown out?\nWhy team USA keep gettin' blown out?\nWhy the Democratic party ain't gettin' with me?\nWhy they still hangin' black bodies in Mississippi?\nYea, why did governor McGreevey get caught with a lizard?\nWhy they take away Shyne's phone calls and visits?\nWhy I been hot for 7 years?\nWhy the new M5 come with 7 gears?\nPlease tell me why y'all keep makin' that trash?\nWhy they reinstating the draft, why is it so much hatin' you have?\nAnd why sell records and keep workin'?\nWhy we go on stage with the bread with the feet workin'?\nIt's real, why when a love one die you miss them?\nWhy it took for me to make \"Why\" for y'all to listen?\n\n[Chorus: Anthony Hamilton]\nWhy\nWhy they got me strugglin', why?\nAll the brothers locked behind bars\nChained up in the system going crazy\nI better leave my pistol on, why?", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}