{"songs": [{"title": "Let Me Be Your Angel", "album": null, "year": null, "lyrics": "Let me be your angel, let me be the one...\nLet me be\nLet me be\nLet me be\nYou believe in\n\nIt started of dark, mostly night\nWouldn't dare let my darkness bring someone light\nI gladly go through it all for the purpose of a lesson\nThat will hopefully turn out to be a blessing\nNo second guessing\nLet me be an example of how strong this love is\nAnd to never put anything above his, 'cause what if\nIt wasn't unconditional, then what whould we do\nIf he did how we do\nWe know we wouldn't supose to do the things\nThat we did but we did 'em\nAnd if that wasn't bad enough then we hit 'em\nBut you saw it all, So we only ly to ourselfes\nHelp us, save us from hell\nLet me be!\n\nLet me be your angel, let me be the one for you\nLet me be your angel, let me be the one... (let me be, let me be, let me see!)\nYou believe in\n\nI ask a lot of questions, 'cause I need a lot of answers\nSometimes I think I need to ask the questions faster\nSurrounded by confusion, am I winning or losing?\nIs it because the lifestyle that I'm choosing?\nUps and downs, Right from wrongs\nGoods from bads, Rob out the ghetto all the good I had\n\nStill I grab, opportunity and ran with it\nAnd a brother still can't get it, man quit it\nAll lives have already been written\nThere's no need for asking'\nDon't mess with the fruit thats forbidden\nWe know god loves us, but don't test faith\nBecause woulda coulda shoulda are all to late!\n\nLet me be your angel, let me be the one for you\nLet me be your angel, let me be the one...\nYou believe in\n\nSo many nights I felt alone\nWithout a friend I want to call on\nUnlike the rain would never end\nUntill you came and found a friend\nAnd through my ups and my downs\nI have someone to stick around\nYour the reason I keep believing!\n\nLet me be your angel, let me be the one for you\nLet me be your angel, let me be the one...\nYou believe in\nLet me be your angel, let me be the one for you\nLet me be your angel, let me be the one...\nYou believe in\n\nI wanna be, I wanna be ur angel...", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}