{"songs": [{"title": "Flesh", "album": "Layers", "year": "2016-04-15", "lyrics": "[Intro: Lincoln]\nBaby! Baby!\nDamn, slow down a little bit\nI just wanna get to know you baby\nYou know what I'm saying?\nI don't wanna bite you, it's all chicken except for the bone\nShit, I'm just\nHey, I'm getting a little money out here\nI just wanna spread the wealth\nYou know what I'm saying?\nI got, I got money, I got credit cards, I got PayPal cards\nWhat ever you want to do, we could do EBT\nYou need groceries?\nShit baby, what you looking at?\nWhat the fuck you see over there?\nA Unicorn?\n\n[Verse 1]\nNiggas sweat bitches\nWhile bitches sweat the chill nigga in the sweats\nIf you don't get no respect\nIt really don't matter, you could be Louis Vuitton'd up\nYou might as well have on Von Dutch and Tommy Hilfiger with a debt\nI don't do dirt, I don't call scenes\nI send niggas through to leave a mess\n\n[Hook]\nI'm a real nigga in the flesh\nI will find a bitch in distress\nI will make her feel so alive\nThen beat her with the dick to death\nReal nigga in the flesh\nIf shit ain't right between us\nWe will leave a nigga left\nReal nigga in the flesh\n\n[Verse 2]\nI despise rapping niggas\nY'all niggas fly private, I come sky jack you niggas\nYou disrespect me, I'll get on board with three Ks out\nAnd go to your PJ's pilot\nTell him I need those jet's keys like I'm DJ Khaled\nSeems like every artist out there snorting coke and smoking base\nI just opened up the briefcase and dumped out the contents\nTo close up an open case\nIf my soul shall rise then I'ma lift the hood up like Tray Martin\nI'm a clapper, they targets\nThey trappers, I'm a convict slash escape artist\n\n[Hook]\nReal nigga in the flesh\nFinding bitches in distress\nMake 'em feel so alive\nThen beat 'em with the dick to death, yes\nReal nigga in the flesh\nIf shit ain't right between us\nWe will leave a nigga left\nReal nigga in the flesh\n\n[Verse 3]\nI'm p-o-p, you d-u-d\nYou bark up this tree, I'll make you turn over three new leafs\nYou live right by the code or get left like three two three\nI'm A Tribe Called Quest, I'm the new G\nOut here going dumber than Tweedledee\nAll these youngins wanna redo me, like these movies\n'Cause I'm so Pablo Escobar-esque\nElephant in the room, never out my element\nOh, always on my P's and Q's like RSTUV, ah!\nNever tell your intel to a gent who's intelligent\n'Cause he'll tell a friend who then shall attempt\nTo turn bullets into shells and spin, and turn humans into skeletons, grrah\n\n[Hook]\nI'm a real nigga in the flesh\nFinding bitches in distress\nMake 'em feel so alive\nThen beat 'em with the dick to death, yes\nReal nigga in the flesh\nIf shit ain't right between us\nWe will leave a nigga left\nReal nigga in the flesh, yes\n\n[Verse 4]\nI'm breaking now 'cause I'm dating goddesses\nThe haters tried but couldn't feed me salt\n'Cause I seasoned all them, now I'm raking dollars in\nSay goodbye, I'm finna take you outta here\nYou can't deny it, I'm the H in igher\nHere the four door Porsche or whatever vehicle\nA nigga like Lincoln couldn't survive without made it out and over four scores and seven years ago\nI know time flies by, yours tick-tick-tick\nMines went-went-went-went like eleven layers ago\nMy flow so heaven sent\nWhen I go to heaven, I'ma go \"Heaven here you go\"\nI'ma go tell God, \"I know I promised that I'd never steal your flow,\" I lied\nAin't nothing like side pussy on my dick\nWord to the motherfucking DJ Quik\nBunch of girls wanna have a bunch of relations\nEven when a nigga wanna be they friend\nI learned that faithful women need they men\nThey don't really wanna leave they men\nThey just don't wanna get a phone call\nFrom another chick saying where he done been\nIf your bitch 'bout to leave better ask yourself questions\nLike \"fight for her? Why?\"\nYou better step up and fight for her like you're fighting for Hawaii\nOr you motherfucking B.J Penn\nI'm a real nigga in the flesh\nMy wife almost left me but she ain't do it\nI don't like the way \"ex-wife\" sound, that don't got a ring to it", "image": "https://images.genius.com/533ac062d389201c4e7eb9a973709ea4.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}