{"songs": [{"title": "Bitch Suck Dick", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Intro: Jasper Dolphin]\nOh, shit (Swag)\nThree icy ass niggas from Odd Future doin' some crazy shit (Bitch)\nBy the way, we do punch bitches, huh\n\n[Verse 1: Jasper Dolphin]\nI'm swagging bitch (Swag), I'm iced out (Iced out)\nOh, you mad, bitch? (Bitch) 'Cause I'm laying on the couch (Woo)\nSmoke a blunt, fuck a bitch in the butt, I'm bossing (Bow, bow)\nDon't give a fuck, I never roll Slauson\nI'm fly bitch, I should poke you in your eye bitch\nGot the burner bitch, bow, bow (Bow)\nYou dead bitch, I'm hot as fuck\nI ain't never cold, but I'm icy bitch (Woo)\n\n[Chorus: Jasper Dolphin]\nMy bitch suck dick like she suck dick\nMy bitch suck dick like she suck dick (Bow, bow, bow)\nMy bitch suck dick like (What) she suck dick\nMy bitch suck dick like she suck dick (Bow, bow)\n\n[Verse 2: Tyler, The Creator]\nGot the bops in the house, socking bitches in they mouth (Bitch)\nSee my neck? Iced the fuck out (I'm getting money, nigga)\nShe at the fucking mall, 40 bitches on my nutsack\nI pulled up on a mothafuckin' unicorn (I'm getting ponies, nigga)\nWolf Gang, nigga\nScream that 'till they motherfucking show me death\nGolf Wang, nigga\nFree Earl, better show some motherfucking respect\nAll this ice around my neck, all this ice around my dick\nGun to her head, make your bitch massage my shoulders\n\n[Chorus: Jasper Dolphin]\nMy bitch suck dick like she suck dick\nMy bitch suck dick like she suck dick (Bow, bow, bow)\nMy bitch suck dick like (What) she suck dick\nMy bitch suck dick like she suck dick (Bow, bow)\n\n[Verse 3: Travis Taco]\nShut up, bitch (Shut up, bitch), suck my dick (Suck my nuts)\nYou fucking bop (Bitch), you better swallow it\nI got a chain with a fuckin' platinum plaque on it\nIs that a hundred dollar bill? I'll shit on it\nI bought a fucking whale, cause I'm ballin' (Ow)\nYour bitch work for me, she my dick washer\nSwag on my dick, 30 thousand million, nigga\n\n[Chorus: Jasper Dolphin]\nMy bitch suck dick like she suck dick\nMy bitch suck dick like she suck dick\nMy bitch suck dick like she suck dick (Goddamn)\n\n[Verse 4: Jasper Dolphin]\nYou bopping, bitch, (Question mark) you like this dick?\nWe all know why, cause you's a boppin' bitch (Bow, bow, bow)\nI got the burner, I pop you in your lip (Bow, bow)\nZoom-zoom, yeah, I'm going fast, bitch\nI'm loud as fuck (I'm loud as fuck), I'm ignorant (Ignorant)\nPunch a bitch in her mouth just for talkin' shit\nYou lurking, bitch? Well, I see that shit\nOnce again, I gotta punch a bitch in her shit\nI'm icy, bitch, don't look at my wrist (At my wrist)\nBecause if you do (If you do), I might blind you bitch (Bitch)\nMount Everest ain't fucking with my fucking wrist\nFuck global warming, this the Ice Age, bitch (Bitch suck dick)\n\n[Outro: Tyler, the Creator and Jasper Dolphin, Tyler, the Creator, Jasper Dolphin]\nSwag, swag, punch a bitch\nSwag, swag, punch a bitch\nSwag, swag, punch a bitch\nSwag, swag, punch a bitch\nSwag, swag, punch a bitch\nSwag, swag, punch a bitch\nSwag, swag, punch a bitch\nSwag, swag, punch a bitch\nYo, yo, Jasper, Taco, y'all my niggas, man\nI love y'all niggas, I'm sorry\n[Gunshot]\nOw! What the fuck?!", "image": "https://images.rapgenius.com/7e984c11ac758b56311fb2e1a8ccf49c.683x683x1.png"}], "artist": "Tyler, The Creator"}