{"songs": [{"title": "W.T.P.", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Intro]\nYeah! Oh! Get up (Where my trash at?)\nI said, get up\nYou know what happens when I'm around, man\nWoo! Let's go\nBetter watch out now 'cause here we come\nAnd we ain’t stoppin' until we see the morning sun\nSo give us room to do our thing\n'Cause we ain’t come to hurt no one\nSo everybody come and get up on the floor now\nAnd grab someone\n\n[Verse 1]\nMan, first of all; I’m a boss\nI just want to get that across\nMan, even my dentist hates when I floss\nPull up to the club in a Pinto like it’s a Porsche\nGarbage bag for one of the windows, spray-painted doors\nWith the flames on ‘em, Michigan plates, and my name's on ‘em\nBaby, Shady’s here, come and get him if you dames want him\nBut he ain’t stupid so quit tryna run them games on him\nHe's immune to Cupid, why you tryna put your claims on him?\n'Cause you won’t do to me what you did to the last man\nNow climb in back, try not to kick over the gas can\nThere’s a half a gallon in it, that could be our last chance\nWe have of just gettin' home, now can I get that lap dance?\nShe’s got a tattoo of me right above her ass, man\nIn the streets of Warren, Michigan, we call ‘em tramp stamps\nThat means she belongs to me, time to put the damn clamps down\nAnd show this hussy who’s the man now get amped, dance\n\n[Chorus]\nNow you can do this on your own\nBut everyone knows that no one likes to be alone\nSo get on the floor and grab somebody\nAin't nothin' but a white trash party (white trash party)\nSo let’s have us a little bash\nAnd if anyone asks, it ain’t no one but us trash\nYou don’t know, you better ask somebody\n'Cause we’re having a white trash party (white trash party)\n\n[Verse 2]\nPull a fifth of Bacardi from out of my underwear\nAnd walk around the party without a care\nLike a body without a head\nLookin' like a zombie from Night of the Living Dead\nAnd tomorrow I'll probably still be too high to get out of bed\n'Til I feel like I been hit with the sharp part of the hammer\nI'm mixin' Hennessy and Fanta with Pepto and Mylanta\nI shoot the gift like I’m hollering \"Die Santa\"\nMissed the tree and hit Rudolph and two innocent bystanders\nSo quit tryna play the wall like you Paul\nAnd get on the floor when the beat drops and stop stallin'\nThey call me the Stephon Marbury of rap, darlin'\n'Cause as soon as they throw on some R. Kelly, I start ballin'\nMakin' it rain for the ladies in the minis\nBut I’m not throwin' ones, fives, tens, or even twenties\nI’m throwin' quarters, nickels, dimes, pennies up at skinnies\nMan, I do this for them bunnies up at Denny’s\nFrom the North, East, and West\nBut when it comes to them trailers in them South parks\nMuffle it, 'cause, homie, that hood’s tighter than Kenny’s\nSo, ladies, if your belly button’s not an innie, then I’m outtie\nNow hop in my minivan, let's get rowdy\nCome on\n\n[Chorus]\nNow you can do this on your own\nBut everyone knows that no one likes to be alone\nSo get on the floor and grab somebody\nAin't nothin' but a white trash party (white trash party)\nSo let’s have us a little bash\nAnd if anyone asks, it ain’t no one but us trash\nYou don’t know, you better ask somebody\n'Cause we’re having a white trash party (white trash party)\n\n[Bridge]\nNow whether you’re black, white, or purple\nIf you’re misunderstood\nBut you don’t give a fuck, you ain’t doin' shit that you should\nLong as you know you’re up to evil and you’re no damn good\nGet on the floor, man, and rep your hood\n\n[Verse 3]\nNow honey, don’t let them pricks trip\nWe should make a quick dip\nAnd go do some doughnuts in the hospital parking lot\n'Cause, girl—I got a sick whip\nKick the back window outta my Gremlin\nPut two milk crates in the trunk, rip out the stick shift\nAnd make a five-seater, I’ll be damned if I feed a chick\nIt ain’t like me to split a piece of dry pita\nI be the S-L-to-the-I-M to the S-H-A-D-Y\nAnd I don’t need a tank top to be a wife beater\nI’ll rip a tree out the ground and flip it upside down\n'Fore I turn over a new leaf, clown\nI’ll tell you now, I’m so raw, I still need to unthaw\nYou feel me, y'all? I shut the club down like Drake in the mall\nBut baby, a body like that’s against the law\nYou the baddest little chain with the blades I ever saw\nColeslaw containers, empty straw wrappers and all\nYou got more junk in your trunk than I do in my car\nNow get up\n\n[Chorus]\nNow you can do this on your own\nBut everyone knows that no one likes to be alone\nSo get on the floor and grab somebody\nAin't nothin' but a white trash party\nSo let’s have us a little bash\nAnd if anyone asks, it ain’t no one but us trash\nYou don’t know, you better ask somebody\n'Cause we’re having a white trash party (white trash party)", "image": "https://images.genius.com/7b93181ae4ed594c902bf7e4e2149ca7.1000x1000x1.jpg"}], "artist": "Eminem"}