{"songs": [{"title": "Us", "album": "Death Certificate", "year": "1991-10-29", "lyrics": "[Verse 1]\nCould you tell me who unleashed our animal instinct?\nAnd the white man sittin' there tickled pink\nLaughin' at us on the avenue\nBustin' caps at each other after havin' brew\nWe can't enjoy ourselves\nToo busy jealous... at each other's wealth\nComin' up is just in me\nBut the Black community is full of envy\nToo much back-stabbin'\nWhile I look out the window I see all the Japs grabbin'\nEvery vacant lot in my neighborhood\nBuild a store, and sell their goods\nTo the county recips\nYou know, us po niggas; nappy hair and big lips?\nFour or five babies on your crotch\nAnd you expect Uncle Sam to help us out?\nWe ain't nothin' but porchmonkeys\nTo the average bigot, redneck honky\nYou say comin' up is a must\nBut before we can come up, take a look at US\n\n[Verse 2]\nAnd all y'all dope-dealers...\nYou're as bad as the po-lice- cause ya kill us\nYou got rich when you started slangin' dope\nBut you ain't built us a supermarket\nSo when can spend our money with the blacks\nToo busy buyin' gold an' Cadillacs\nThat's what ya doin' with the money that ya raisin'\nExploitin' us like the Caucasians did\nFor 400 years - I got 400 tears- for 400 peers\nDied last year from gang-related crimes\nThat's why I got gang-related rhymes\nBut when I do a show ta kick some facts\nUs Blacks don't know how ta act\nSometimes I believe the hype, man\nWe mess it up ourselves and blame the white man\nBut don't point the finger you jiggaboo\nTake a look at yourself ya dumb nigga you\nPretty soon hip-hop won't be so nice\nNo Ice Cube, just Vanilla Ice\nAnd yall sit and scream and cuss\nBut there's no one ta blame- but US\n\n[Verse 3]\nUS ... will always sing the blues\nCause all we care about is hairstyles and tennis shoes\nAnd if ya step on mine ya pushed a button\n\"Cause I'll beat you down like it ain't nothin'\"\nJust like a beast\nBut I'm the first nigga ta holler out {PEACE, BLACK MAN}\nI beat my wife and children to a pulp\nWhen I get drunk and smoke dope\nGot a bad heart condition\nStill eat hog-mogs an' chitlin's\nBet my money on the dice and the horses\nJobless, so I'm a hope for the armed forces\nGo to church but they tease us\nWit' a picture of a blue-eyed Jesus\nThey used to call me Negro\nAfter all this time I'm still bustin' up the chiffarobe\nNo respect and ignored\nAnd I'm havin' more babies than I really can afford\nIn jail cause I can't pay the mother\nHeld back in life because of my color\nNow this is just a little summary\nOf US, but yall think it's dumb of me\nTo hold a mirror to ya face, but trust\nNobody gives a fuck about...", "image": "https://images.genius.com/7301e3d51725334b49684b6b5b424feb.500x500x1.jpg"}], "artist": "Ice Cube"}