{"songs": [{"title": "Ova Here (Remix)", "album": "The Mix Tape", "year": null, "lyrics": "[KRS-One: speaking live]\nFirst of all, I don't know WHO, y'all saw on this stage before me (aight)\nI don't know WHO, y'all gonna see on this stage after me (true)\nBut THIS, is REAL.. HIP.. HOP!  Worrrrrd UP!\nI'm gonna find out tonight, where the real hip-hop\n\n[Intro] + (live response)\nThe real hip hop is (ova here!!!!)\nThe real hip hop is (ova here!!!!)\nThe real hip hop is (ova here!!!!)\nReal hip hop is (ova here!!!!)\n\n[Interlude]\nBla-blaow! Bla-blaow!\nClear 'em out, clear 'em out - word!\n{*scratching: \"Aww yeah!\", \"The real hip-hop, is ova here\"*}\n{*scratching: \"KRS, come get up in they asses\"*}\n\n[Verse One]\nYou ain't Fo'Reel and you ain't Universal\nYour whole style sounds like a infomercial\nYou ignoramus, I'm the baddest with the mic apparatus\nChallengin the God of rap is madness, I'll snatch your status\nWith these elders lookin at Billboard you could stop them\nBut I got enough albums to make my OWN top ten!\nYou limited, like the spread of traffic\nYou bite my style off the radio\nSo when you speak in fact I hear the static\nYou better Chillout like Chuck, I kick like three Norrises\nOne of my sixteen bar rhymes is eight of your choruses\nOf course it is, ridiculous\nWatch out, I be in the club inconspicuous\nGotcha, on your, hands and knees\nAin't it about time for some real MC's?\n\n[Hook] + (live response)\nThe real hip hop is (ova here!!!!)\nThe real hip hop is (ova here!!!!)\nReal hip hop is (ova here!!!!)\nReal hip hop is (ova here!!!!)\n\n[KRS-One]\nYo yo, Beatminerz, turn up the track a little bit\nGonna do this right now\n\n[Verse Two]\nRemix it, don't re-fix it\nFirst brigade, second brigade - all swords lifted\nFormation, classified information\nCode red rhyme style accurate articulation\nDon't test my foreign relation\nThe cats in Brixton, Birmingham and London just waitin\nGot my cats in France like ill\nEven Africa's laughin at'cha right along with Brazil\nThe West Indies?  Jus' wan fi kill\nGot Canada mad at'cha, Germany heard of me, they seen the skill\nHip-Hop is more than a thrill to us\nA dollar bill to us, believe you will trust in that\nCause if you bust at me, on TV, CD\nInternet trust that, I WILL BUST BACK\nI turn down heat real quick, when I spit\nYou need the medicine what I speak is so sick\nThen again these veteran be better than many men\nForever we hit 'em again better than ANY trend they could ever say\nIn any season, hot warm cold or freezin\nWhen it comes to MCin, we believe in rhymin for a different reason\nNo frontin, my rhyme style tells you somethin\nThey rhyme style tells you who they freakin\nBut you was already told - what does it profit a man\nTo gain the whole world and lose his soul?", "image": "https://images.genius.com/32bf9790e346029d7cf0897f83ab18fa.1000x1000x1.jpg"}], "artist": "KRS-One"}