{"songs": [{"title": "White Soft Porn", "album": "Purp & Patron: The Hangover", "year": "2011-01-31", "lyrics": "[Intro: Radio Announcer]\nWe gonna get into this next jam of the week right here. It's called White Soft Porn. You know what I'm talkin' about. I'm the infamous Turbo ?, you dig? And this is WSP radio, where even if you got sloppy walls, you still gettin' balls in your jaws\n\n[Verse 1: Game]\nWalk in the liquor store like where the patrón, I need a whole case\nThrowin' that Britney take out the Ghostface\nYou know that white girl go both ways\nAnd you know what I mean if you ever sold yay\nWe can take it from the top like San Jose\nOr the bottom of the yacht in St. Tropez\nSo, pop the rosé, ok, ok\nShe got a white bronco, call her OJ\nShe like slow man, she my snow flake\nDon't smoke chronic, but she can sniff the whole eighth\nHer Columbian. Like Scarface\nAnd we ain't gotta fuck. She all face\nShe from the valley, somewhere in Cali\nMy homie Snoop used to fuck with her sister Sally\nI pulled over in the alley\nShe shift my gears and whispered in my ear\n\n[Hook: Mars]\nI wanna do it to you. (We ain't gotta fuck)\nI'm talkin' white soft porn\nSo let me blow your mind. (We ain't gotta fuck)\nI'm talkin' white soft porn\n\n[Verse 2: Asher Roth]\nYea, Ay, Uh\nDon't be intimidated\nWhen I put it on you, baby, you be liberated\nAy, We gettin' innovative\nThis new position that I'm thinkin', let me demonstrate it\nAy, Ain't gotta fornicate\nAnd your performance is important when you use your face\nAy, She never used to be this way\nShe was a les 'til I went ahead and screwed her straight\nAy, undo your bra with one hand\nIf anything is gonna care it on and cum can\nCum again, invite 'em if you have any fun friends\nI love it when it's girl upon girl with one man\nAy, put your butt on my mustache, fuck that\nWon't eat unless your shavin' the muff back, puff pass\nRub 'em from the front to the butt crack\nShe love it when I play with my tongue, I'm just sayin'\n\n[Hook: Mars]\n\n[Verse 3: Tyga]\nNow, now, let's get acquainted\nShots of Cîroc how you let up like Vegas\nSL painted\nTop back drop take a photo half-naked\nDon't be lazy\nWe on that, everyday a wet dream, baby\nSex on the beach by the leather on the seats\nLookin' for some head, I don't really gotta think\nShe said you know where I be, Roosevelt suite\nHaha. Sunset women like the best\nWalkin' at the light like I can change your life\nYea, yea, I rarely see the same girl twice\nLet me get her number then I'm fuckin' tonight\nTell her call her friend then we fuckin' tonight\nShe left that nigga, watch, I'mma do it right\nAin't nothin' to these dollar bills in my high fashion\nChampagne glasses pourin' on they asses\nSo many girls, I ain't never gotta act. Just say\n\n[Hook: Mars]", "image": "https://images.genius.com/9cb20d1b358d4aa81552492ba838d34f.750x750x1.jpg"}], "artist": "The Game"}