{"songs": [{"title": "Twerk It (Remix)", "album": null, "year": "2013-06-28", "lyrics": "[Verse 1: Busta Rhymes]\nBig man, when mi talk, hear weh yuh fi do?\nShut your mouth, listen close, weh we come fi do?\nShut it down, legal shot, blow torch a bun\nEnough excitement, see them frightened, watch them boys run\nCome here gal, weh yuh a do, hmmm whata gwaan?\nDun wid dat, dutty wine, Tony Matterhorn?\nBass a lick yuh, make it clap, go on go take it off\nSet the trap, don’t fight you know your skin soft\nSitting on it, go on go fuck it ’til yuh broke it out\nSo exotic, while you suck it watch we fuck it up\nSo weh have it, batty big watch how mi love it up\nBend ova and spread and mek mi stick it in and bun it up\n\n[Chorus]\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwer-twer-twer-twer-twer-twer-twer\nTwer-twer-twer-twer-twer-twer-twer\n(Twerk it, twerk it, twerk it)\n\n[Verse 2: Busta Rhymes]\nI seh mi finish wid yuh, pull up yuh pants, gwaan go get yuh friend\nDance dun, come outside, fuck inna di benz\nGyal come, enjoy di ride, watch di wey mi stick yuh\nWelcome! (YUH DUN KNOW!!!!) Tek di dick yuh friend a wait fi yuh\nHold on deh, yuh man vex? Vegetate di bwoy\nShoot what? See, my gun will evaporate dat boi\nLeggo dat, see how it sound QUANGGGGGGGGG!!!!!!!!\nLevel dat, down to da ground, PANGGGGGGGGGG!!!!!!!\nNuff a dat, yuh dun know, best a di best\nPretty gyal, whole heap a batty and whole heap a breast\nPhysical, how yuh a drop it no one could attest\nDigital, we Instagram it ’til dem gyal a rest\n\n[Chorus]\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwer-twer-twer-twer-twer-twer-twer\nTwer-twer-twer-twer-twer-twer-twer\n(Twerk it, twerk it, twerk it)\n\n[Verse 3: Nicki Minaj]\nDutty gyal! When yuh see mi, 'ere weh yuh fi do\nBow down, big chain, and it heavy too!\nRespect. How dem gwan like we nuh pave way?\nQueen yah, London rate we di same way!\nCome 'ere boy! Bow cat, oh, true yuh rich?\nWeh yuh wallet? Yeh, yuh 'ave it? Mmm, gi we it!\nKartel. Beenie Man. Bounty Killa too!\nRoll di weed, buss ah dutch, all rizzla too!\nBruk it out! Flip. Land pon ya head gyal!\nBrooklyn. When we shoot, Net gyal!\nTrinidad, and nuh James mi ah chat 'bout\nPussy hole! Gyal ah bitter, but weh dat bout?!\n\n[Chorus]\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwer-twer-twer-twer-twer-twer-twer\nTwer-twer-twer-twer-twer-twer-twer\n(Twerk it, twerk it, twerk it)\n\n[Verse 4: Busta Rhymes]\nAnd mi seh walk like a champion, swing like a stallion\nWid di two big medallion, good, yuh perfect\nShow dem di action, bad gyal concoction\nCool now, relax mon, eh em, yuh nervous\nSkin out and dun di place, spin ’round and show yuh face\nOpen, and close yuh case, or chuck, and work it\nMi seh hold on deh tek time, gyal wine yuh waistline\nFollow di bassline, right now, stir it\n‘Round like, a bowl of soup, ’round like a hula hoop\n‘Round like yuh batty cute and do it, on purpose\nWine like a yard woman, grind like yuh numba one\nJump up, and wave yuh hand mi tink, she know\n\n[Chorus]\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwerk it, twerk it, twerk it, twerk it\nTwer-twer-twer-twer-twer-twer-twer\nTwer-twer-twer-twer-twer-twer-twer\n(Twerk it, twerk it, twerk it)", "image": "https://images.genius.com/f7981672982782dab70d5701403e6a5b.500x496x1.jpg"}], "artist": "Busta Rhymes"}