{"songs": [{"title": "Legend", "album": "The Devil’s Night Mixtape", "year": "2015-10-30", "lyrics": "[Verse 1: Bizarre]\nI ride for D12, fuck all y'all niggas\nHand on the trigger, I'm from Lansing, Grand River\nYeah I'm off a pill, drunk in the party\nPump in the trunk, I take a nigga Cartis\nYeah I'm with the shit, yeah I'm bout the action\nI can make it happen, I ain't just rappin'\nI'm a real nigga, niggas gotta feel\n[Buffs?] on my face, I'll probably get killed\n4 in the morning, at the casino\nDirty white bitch, now I'm headed to Reno\nMan I be tripping, man I be whilin'\nKeep a mean mug, I ain't never smilin'\nJust popped a Xan, gone off a Perc\nOff in the studio, time to get to work\nI be fucking hoes, I be nailing groupies\nHoliday Inn, off in a Jacuzzi\n\n[Hook: King Gordy]\nTake a long walk inside my shoes\nI'll bet your legs give out on ya\nWhat happens when you got everything to lose\nJust by standing out on your own corner?\nYour fans love you, they watch all your interviews\nThey're so into you\nThey want you to be a legend now\n\n[Verse 2: Kuniva]\nWe put in mellow, we don't wanna let them guns go\nThese lil niggas be wolfing off at they gums though\nWith all that tough talk, I'm so far removed from it\nI'll just send some homies down your block to take a cruise on it\nLeave your face looking like a case of, \"Who done it?\"\nThrow a few hundred on the floor, looking like, \"Who want it?\" (I'll take that)\nHeat your block up, Arizona, we'll Tuc-son it\nA play grinning through Bubonic that's true phonics (Real talk)\nDon't act too brolic, 22s polished\nWe are too solid, turning beef into fruit salad\nSo stick to rappin', you ain't bout the clappin'\nWhen we pull up, you be wishing for shit not to happen\nYou be throwing soggy punches, you are not for scrappin'\nThey gon' find you in the bando, and it's not from trappin' (Damn!)\nYou only roll with tough guys, you are not one\nJust because you went to Walmart and bought a shotgun (Fuck outta here!)\n\n[Hook: King Gordy]\nTake a long walk inside my shoes\nI'll bet your legs give out on ya\nWhat happens when you got everything to lose\nJust by standing out on your own corner?\nYour fans love you, they watch all your interviews\nThey're so into you\nThey want you to be a legend now\n\n[Verse 3: Swifty McVay]\nThey love you when you hot, then hate you when you not\nThey turn into something different after drinking concoctions\nSoon as you start monopolizing, they end up plottin'\nThey forgot, I'm much smarter than that, and it ain't a option\nTo stab a knife in my back\nI've been accustomed to amputate associates in a millisec, fuck respect\nWhat is that? That title is wack, cause Dirty Dozen's\nThe only fellas I'm ever into acting with\nI can't walk the streets without niggas babblin'\nMarshall that and Marshall this\n\"Where Porter at?\" We all gettin' chips\nWe all rappin', we still giving daps and hugs\nCrackin' jokes, reminiscing on Proof and Bugz (RIP)\nWe don't give a fuck, bout the haters outside the family\nDon't get involved or try to give dap to me, word to Big Sean\nI'm a Detroiter that's ducking and dodging pawns\nI throw you haters inside the pot holes in my lawn, bitch\n\n[Hook: King Gordy]\nTake a long walk inside my shoes\nI'll bet your legs give out on ya\nWhat happens when you got everything to lose\nJust by standing out on your own corner?\nYour fans love you, they watch all your interviews\nThey're so into you\nThey want you to be a legend now", "image": "https://images.genius.com/66678b06c44c6843cfd77955e8887e02.500x500x1.jpg"}], "artist": "D12"}