{"songs": [{"title": "D12 World", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: Bizarre]\nD-Twizzie back in this bitch!\n\"Eminem's buddies\"\nBuddy this, nigga\n\n[Hook]\nWelcome to D12 world!\nWhere you can get anything from sex, X, to girls\nWelcome to D12 World!\nProstitutes and guns, so fuck the real world\n\n[Bizarre]\nFuck the silly shit, I pull a mac milli quick\nWhen D12 rock his summer it's over with\nAll these bitches and all these hoes\nWhat the fuck you looking at me for? (You, nigga!)\nOh yeah, you like my chain\nWant to get your skinny ass up in the Range\nI like my bitches raspy and nasty\nI like a fat and nasty bitch named Ashley\n\n[Swift]\nI slide you dope without no procrastination\nAnd you can watch me fuck up your imagination\nI'm always getting drunk, and I fiend to smack hoes\nI mean it, I leave them screaming like pterodactyls\nThis is our world\n\n[Kuniva]\nWe'd love to smack you\nHot lead flying with debris and schrapnel\nRipping you to shreds, fucking up your tattoo\nBreak into your crib, take your records and plaques too\n\n[Kon Artis]\nD12 is, that's who! Got you limping\nStill popping something purple with a bottle of gin, bitch!\nI fuck up your kinship, I lie in this shit\nPeep, I stole your mom's jeep and crashed into my street\n\n[Proof]\nCrazy deranged, of course we Shady's gang\nOf course we wear clothes with holes and blood stains\nNo doubt, we shoot badges, born with ski masks\nChew on shroom, rainbows, and pee acid\n\n[Hook]\nWelcome to D12 World!\nWhere you can get anything from sex, X, to girls\nWelcome to D12 World!\nProstitutes and guns, so fuck the real world\nWelcome to D12 World!\n(Kon Artis Singing)\nWelcome to D12 World!\nAaaaahhhhh!!!\n\n[Kuniva]\nNiggas be talking shit, but they laying slump now\nI graduated from techs, I grip a pump now\nI used to be nice, but nice don't cut it\nNow I open they wig, if they don't uppen my budget, bitch!\n\n[Bizarre]\nThem D12 niggas, they be quick to blast\nI'll take my shower cap off, and whup your ass\nStepping to us, you can't be the smartest\nCause you'll get dropped like an Aftermath artist\n\n[Swift]\nThey catch me mingling by a bitch with class\nWhen she turn I'll be sprinkling some shit in her glass\nWhat part of this you can't understand?\nI'll emmilliate a man, worse then making a band\n(Kuniva: Don't be mistaking that man)\n(Kon Artis: He'll invite you over)\nReal fast, and pass your ass a glass of Ebola\n\n[Kon Artis]\nI've been doing this for a minute\nAnd I'm starting to see my little brother Caleb\nLook more like a star then me\nThat's why I just started working out\nMan, this shit ain't working out\n\n[Hook]", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}