{"songs": [{"title": "187 On A Hook (Remix)", "album": null, "year": null, "lyrics": "[Chorus: C-Bo] (2X)\nWest side, it's 187 on a motherfucking hook\nNiggas out of bounds should have shook\nWe bangin' by the book\nGot shot in the neck tryin' to get away\nAnd to a vigi it ain't nothin' but gun play\n\n[Verse 1: 2Pac]\nHEEY!\nGot some static for some niggas on the other side of town\nLet my little cousin K roll, he's a rider now\nWhat they want from us motherfuckin' thug niggas?\nUsed to love niggas, now I plug niggas\nAnd slug niggas, am I wrong?\nNiggas makin' songs, tryin' to get with us\nMust be gone on stress weed, in the West we trust\nTo the chest I BUST! Then we ride 'til the sun come\nShinin' back to brighten up the sky, how many die?\nHeard the Fugees was tryin' to do me - look bitch!\nI cut your face, this ain't no motherfuckin' movie\nTHEN! We watch the other two die slow\nCastrated entertainin' at my motherfuckin' sideshow\nBAM! Set my plan in mo', time to exterminate my foes\nI can't stand you hoes, uhh\nNow label this my fuckin' trick shot\nMy lyrics runnin' all you cowards out of hip-hop\nWhen we ride - on our enemies\n\n[Verse 2: Tech N9ne]\nNigga to catch this nigga, I'm ready to peel one\nInstead of the shoulders I gotta distort a nigga's grill some\nVigilante and villains and Regime niggas come with steel guns\nGet ready to sleep 'cause you tripped when you fucked with a villain\nWhich one of y'all motherfuckers said fuck Tech N9ne\nShady Pacino turned C-ho when I clutched that N9ne\nMe and my nigga C-Bo Yuk mezzole not only bust that rhyme\nWe can do it illegal so the evil'll give a fuck next time\nNigga don't you ever spit my name\nAnd thinking that shit's the same\nTwo-thou' we switched the game and spit the flame (Wah)\n\"Allah hu akbar\" - is what I say before I buck you\nMotherfuck busters like Vell Bakardy yeah nigga had enough ya'll\nGet ready to suffer - kneel down\nNigga, Tech N9ne Killer Klown\nNigga, six feet underground is where you're found\nNigga, 40-Water would never did a song wit you if he knew the song\nWas about me never make a million\nNext time say my name say my name like Destiny's Children - bitch\n\n[Chorus: C-Bo] (2X)\n\n[Verse 3: 2Pac]\nCome take a journey through my mind's eye\nYou crossed the game, don't explain\nNigga, time to die, say goodbye\nWatch my eyes - when I pull the trigger\nSo right before you die you bow before a bigger nigga\nNow dry your eyes, you was heartless on your hits\nNiggas love to scream peace after they start some shit - pay attention\nHere's a word to those that robbed me\nI murder you then I, run a train on Mobb Deep!\nDon't fuck with me!\nNigga you're barely livin', don't you got sickle cell?\nSee me have a seizure on stage, you ain't feelin' well, hell\nHow many niggas wanna be involved?\nSee I was only talkin' to Biggie\nBut I'll kill all'a y'all, then ball\nThen tell Da Brat to keep her mouth closed\nFuck around and get tossed up, by the fuckin' Outlawz\nBefore I leave, make sure everybody heard\nKnow I meant, every motherfuckin' word\nWhen we ride on our enemies\n\n[Verse 4: C-Bo]\nBuck these niggas, I'm a killer screamin' Regime\nDeep navis with heat like the A-Team\nAnd when my K scream, it's causin' nothin' but murder\nBucking these niggas makin' hate me\nYeah, nigga, we don't give a fuck, nigga we thug lords\nConnected from Tech N9ne and touched for the thug war\nWho got love for these niggas with no love\nAt all give a fuck guns clutched\nOnly left a ball I know you heard of me - wanna murder me\n'Cause I'm the nigga that cooked the bird (?) in the kitchen\nMoms itchin' had the whole gang unwrappin' chickens\nNigga and we was headed for the jack strapped\nWith a fat gat, all my niggas down to rat-tat-tat-tat\nWest coast bad boys we was yellin'\nNow West Coast Mafia Regime and thug zellin' Nigga\n\n[Chorus: C-Bo] (2X)", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}