{"songs": [{"title": "Wicked", "album": "The Predator", "year": "1992-11-03", "lyrics": "[Intro: Don Jagwarr]\nNow dis one dedicated to de man dem call MacGyver (bo!)\nAnd all double-oh-seven James Bond spy man is from de area (gunshot, gunshot)\nMaximum respect to de man dem call Ice Cube (bo! bo!)\nHim nah bust no deuce-deuce, no trey-eight, but four-four (GET WICKED!)\n\n[Verse 1]\nOne, two, three and I come with the wicked\nStyle, and you know that I'm from, the wicked\nCrew, act like you knew\nCause I got everybody jumpin' to the voodoo, kick it\nWicked rhymes, picket signs\nWhile me and the Mob gotta trunk fulla nines\nPlay ya and I'll slay ya\nI got the mayor by the hair\nReady to BUCK BUCK BUCK and it's a must\nTo DUCK DUCK DUCK before I bust\nLookin for the one that did it\nBut like En Vogue, no you're never gonna get it\nCos I'm the one with the fat mad skills\nAnd I won't choke like the Buffalo Bills\nSittin' at the pad just chillin'\nCause Larry Parker just got two million, oh what a feelin'\nSo shake that nigga and pass me the pill\nAnd I'll slam dunk ya like Shaquille O'Neal\nLike it, dig it, maybe\nAnd watch that test tube baby, kick it\nCause I get wicked\n\n[Hook: Don Jagwarr]\nYou know dem wicked, Ice Cube and Torture Chamber sound\nYes dem wicked, him pick up de mic and buss up de ground\nYes dem wicked, all of dem gyal with de sound\nMy name is Don Jagwarr and Ice Cube we run de town (wicked!)\n\n(\"Look at the way I kick it, I'm wicked\")\nBo! Wicked! Bo! Wicked man! (Bo!)\n(\"Look at the way I kick it, I'm wicked\")\nBo! (\"Wicked!\")! Bo! (\"Wicked man!\") (bo!)\n\n[Verse 2]\nDon't say nuttin, just listen\nGot me a plan to break Tyson outta prison\nCome my way and get served\nStill got a deuce that'll bunny hop the curb\nNappy head, nappy chest, nappy chin\nNever seen with a happy grin\nShow the fat frown cause I'm down, take a look around\nAll you see is big black boots steppin\nUse my steel toe as a weapon\nKick ya and flip ya, now they want to\nLabel this nigga' tape with the sticker\nDiggin' out girls that's \"nicety\"\nPlus I gotta body count like Ice-T.\nFrom here to New York, I get skins and ain't talkin bout pork\nSwine, pig, dig, listen to the flow of a so-called neg-\n-ro, who didn't know I was funky as Wilson Pickett\nDig it cause I get wicked\n\n[Hook]\n\n[Verse 3]\nPeople wanna know how come\nI got a gat and I'm lookin out the window like Malcolm\nReady to bring that noise\nKinda trigger happy like the Geto Boys\nApril 29th brought power to the people\nAnd we might just see a sequel\nCause police got equal hate\nA chazzer's a pig that don't fly straight\nThrough with Daryl Gates but is Willie Williams\nDown with the pilgrims?\nJust a super slave\nWe'll have to break his ass up like Super Dave\nI'm wicked enough to board this\nCause now it's on to the fullest\nGorilla straight from the mist\nBut I don't miss when it comes to uh this\nBring the yellow tape\nThe white cape, cause I'm so straight\nThrough with the picket signs, take this job and stick it, Bigot, cause I get wicked\n\n[Hook/Outro: Don Jagwarr]\nYes dem wicked, dem wicked, jus pick up de mic\nYes dem wicked, dem wicked, jus put down de gun\nYes dem wicked, dem wicked, cuz we run de town\nDem wicked, dem wicked, cuz we run de town\nYes dem wicked, gwaan!\n\nBack wha, seen, den de one dem call Ice Cube\nInternational superstar don gorgon style (bo!)\nWay back in Brooklyn, inside of Los Angeles, South Central style\nTorture chambers, (bo!) dem run the country (maximum respect!)\nAnd my name is Don Jagwarr, we are the top celebrity seen\n\nBecause we wicked, we wicked, we pick up de mics\nYes we wicked, we wicked, we put down de guns\nYes dem wicked, dem wicked, but we run de town\n(wicked man!)", "image": "https://images.genius.com/12530e0ac3cef6640bf6cdf647d97bd0.640x632x1.jpg"}], "artist": "Ice Cube"}