{"songs": [{"title": "Rap Game", "album": "8 Mile: Music from and Inspired by the Motion Picture", "year": "2002-10-29", "lyrics": "[Intro: Bizarre]\nThe rap game, hip hop 101\nThe hardest 9-to-5 you'll ever have\nYou can't learn this shit in no history book\nYou ready to rap, motherfucker?\nYou ready to sell your soul?\nHa-ha-ha-ha, the rap game, motherfucker!\n\n[Verse 1: Swift]\nI'm a disrupted nigga, you made me crazy\nYou should've slayed me as a baby, behavin' shadier\nThan Wes Craven and you ain't even gotta pay me\nI take pleasure of layin' a nigga down daily\nYou face me, drunk or sober, you’ll faint fast\nI'm never fucked up to where I can't whoop yo' ass\nYour neck'll get snapped with bare hands; fuck music\nIs he rappin'? It's cool, but fools, just don't confuse it\nWhat happens: these dudes get rude, then I lose it\nI'm scandalous, I'll blow your two kids off the atlas\nWith a gat that's bigger than Godzilla's back, nigga\nYou are not realer, in fact, you'll feel the effects\nOf a crack dealer, y'all presidents sends me smack\nAnd got a MAC-10 with it, so I ain't gotta rap\nBut I'm thankful for that, don't mistaken me, black\nOr you'll be stankin' in the back of a fuckin' Cadillac\n\n[Verse 2: Eminem]\nI'ma get snuffed, ‘cause I ain't said enough to pipe down\nI'll pipe down when the White House gets wiped out\nWhen I see that little Cheney dyke get sniped out\nLights out, bitch, adiós, goodnight *gunshot* (Ah!)\nNow put that in your little pipe and bite down\nThink for a minute, ‘cause the hype just died down\nThat I won't go up in the Oval Office right now\nAnd flip whatever ain't tied down upside down\nI'm all for America; fuck the government\nTell that C. Delores Tucker slut to suck a dick\nMotherfucker ducked, what the fuck? Son of a bitch\nTake away my gun, I'm gonna tuck some other shit\nCan't tell me shit about the tricks of this trade\nSwitchblade with a little switch to switch blades\nAnd switch from a six to a sixteen-inch blade\nShit's like a samurai sword; a sensei\nShit just don't change to this day\nI'm this way, still tell that ut-slay itch-bay\nUck-say my ick-day, 'scuse my ig-pay atin-lay\nBut uck-fay you ig-pay (50!)\n\n[Hook: 50 Cent]\nThis rap game, this rap game (Yeah)\nI ain't sellin' my soul for this rap game\nAnd I ain't diggin' no hole for this rap game\nMan, I'm tellin' you: no, it ain't happenin'\nThis rap game, this rap game\nI ain't sellin' my soul for this rap game\nI ain't diggin' no hole for this rap game\nThis rap game, this rap game\n\n[Verse 3: Kon Artis]\nI bet you'd rather me drink and drown in my own inequity\nBut fuck that! I'ma rap 'til y'all all get sick of me\nAnd clutch my nut sack and spit all who pick at me\nA pitt and rott mix, fuck the dogs you sic on me\nI'm sayin' you motherfuckers don't know us, quit playin'\nIf I'm broke, then I'm breakin' up in the place where you layin'\nYou know, same shit every nigga done in his life\nI look at this, why speak on what I want when I write?\nSo why should I ever fear another man\nIf he bleed like I bleed, take a piss and he stand?\nOkay, you win, you can say we can't rap\nBut no Source never made me not buy an album when they say it was wack\n\n[Verse 4: Kuniva]\nI walk in that party and just start bustin'\nRight after I hear the last verse of \"Self Destruction\"\nThis liquor makes me wanna blast the chrome\nTo let you know the time without Morris Day and Jerome (Nigga)\nI'm low down and shifty, quickly call Swifty\nTo do a drive-by on the tenth speed with 50\nYou're feelin' lucky? Squeeze, I catch you outside of\nChuck E. Cheese with your seed, you be an unlucky G\nMy lifestyle is unstable: a partyin' addict\nThey said, \"No fighting in the club\" – so I brought me a 'matic\nCoughin' the static, I jump niggas; call me a rabbit\nPoppin' the tablet and guns that saw you in half with\n\n[Bridge: 50 Cent]\nBelieve me, we run this rap shit, fo' sheezy\nMake makin' millions look easy\nEverywhere you turn, you see me\nYou hear me, believe me\nBefore you see my pistol in 3D\nNo time to call a peace treaty\nDial 911, ‘cause you need the\nPolice to help you believe me\n\n[Verse 5: Proof]\nI snatch the chalk from the sidewalk and piss on the curb\nThis is absurd, these street niggas twistin' my words\nWe finally could say goodbye to Hollywood\n'Cause Proof and Shyne, man, shit, nothing in common\nThe nastiest band with gats in each hand\nWe never bow down to be a flash in the pan\nNo remorse; fuck your stature, dog!\nNothing to do with hands when I clap at y'all\nPut your jaw on the ground with the four and the pound\nThen I'm gone outta town 'fore the law come around\nSo we can battle with raps, we can battle with gats\nMatter of fact we can battle for plaques\n\n[Interlude: 50 Cent]\nThis rap game\n\n[Verse 6: Bizarre]\nI'm too fuckin' retarded\nI don't give a fuck about my dick\nThat's why I'm datin' Lorena Bobbitt\nMy crew had an argument, who was the largest\nNow they all is dead and I roll as a solo artist\nPlus I made the beats and wrote all the raps\nWell, I really didn't, but I did according to this contract\nI was thrown in the snow with nowhere to go\nFreezin' 20 below, forced to join Bel Biv Devoe\nMy little girl, she shouldn't listen to these lyrics\nThat's why I glued her headphones to her ear\nTo make sure she hear it\nIf rap don't work, I'm startin' a group with Garth Brooks\nHahahaha, 50, sing the hook!\n\n[Hook: 50 Cent]\nThis rap game, this rap game (Yeah)\nI ain't sellin' my soul for this rap game\nAnd I ain't diggin' no hole for this rap game\nMan, I'm tellin' you: no, it ain't happenin'\nThis rap game, this rap game\nI ain't sellin' my soul for this rap game\nI ain't diggin' no hole for this rap game\nThis rap game, this rap game\n\n[Outro: 50 Cent]\nYeah, yeah, yeah", "image": "https://images.genius.com/e4a1bd93e045b909843de21d49a9bb97.1000x1000x1.jpg"}], "artist": "D12"}