{"songs": [{"title": "Warm It Up", "album": "Bobby Tarantino II", "year": "2018-03-09", "lyrics": "[Intro]\nYou—you, you\nYou—you, you, you, you, you\nYou, you—you\nYou—you, you, you, you, you\nYou—you, you, you, you, you\nYou, you—you\nYou—you, you, you, you, you\nWarm it up, warm it up\nWarm it up, warm it up, warm it up\nWarm it up, warm it up\nWarm it up, warm it up, warm it up\n\n[Verse 1: Young Sinatra]\nIt's that Young Sinatra shit, yeah, that's that Young Sinatra shit\nShut the fuck up and listen whenever Young Sinatra spit\nYeah, your girl fine as hell but she a Young Sinatra chick\nHey Bobby, how can you tell? She on the Young Sinatra dick\nAll these rappers wack as fuck, make the Young Sinatra sick\nRattPack be the squad, that's that Young Sinatra clique\nGoddamn, said this the Young Sinatra clique, goddamn!\nListen, yeah—I’m visualizing the realism of life in actuality\nStep to me, fatality; yeah, this shit is my galaxy\nI am who the baddest be, I'd rather be at the academy\nKillers, I'm be glad to be me, magnify the shit like bifocal\nMotherfuckers talk on the internet, but in person they never vocal\nCome to the hood and fuck you up if you prefer to be local\nI'm loco from Noho to Soho\nGettin' cheese like a photo, you know, ho\nI'm blessed like Sunday, flyer than a runway\nLil' Bobby never second-guessed that he gon' make it one day\nOne–way or another, my brother, word to your mother\nThey should give me a badge 'cause I'm always under covers\nGoddamn! I'm a miraculous man!\nYou know I get, I get it, I get it, I get it\nThe Young Sinatra spit it, rewind it, and rip it\nI could murder your whole album with a 30-second snippet\nPass the Mary Jane like I'm runnin' a train with Peter Parker\nOn tour, I have more sex in the city than Sarah Jessica Parker\nThe deeper and deeper I go, it get darker\nThey say they want the old me, they want the Young Sinatra back\nThe one that murder it, rip it up, no, never givin' up 'round the almanac\nYeah, I'm all of that, fall back, like September again\nBaskin' these rappers so hard they won't remember again\nWhen it comes to hip-hop, bitch, I'm indigenous to this\nIt's apparent I'm bearin' down like a parent\nWhen the beef is at stake, I'm Mastro's\nMy god-level lyricism surpass flows, I'm much more than fast flows\nMoney, talk, cash knows, greatest of levels–I've passed those\n\n[Chorus: Bobby Tarantino]\nFuck that rap shit, this that trap shit (Bobby!)\nThis world is my contraption (Bobby!)\nI was born and raised in the trap, son (Bobby!)\nTalk shit, get kidnapped, son (Bobby!)\nI don't really know why I rap, son (ay!)\nMoney in the bank, yeah, I got some (ay!)\nCouple sports cars, yeah, I bought some (ay!)\nLogic never flex, Bobby get it done! (ay!)\nYeah, y'all don't really know where I come from (come now)\nTalkin' that shit, I'ma come for 'em (what's good?)\nTell me what you really know about me right now\nAnything I want, I get it somehow\n\n[Verse 2: Young Sinatra]\nFuck that trap shit, this that rap shit\nGive me the head like John the Baptist\nReady to rip it, I hope in the captives\nGreatest alive like I'm Cassius\nI put 'em all in they caskets, they can't seem to get past it\nI'm a bastard that mastered the flow\nAnd none of y'all ready for the massacre, though\nFuck with Logic? Yeah, that's a no\nMatter of fact, it's not impossible, just highly improbable\nLike, saying the police isn't robbable\nBut I'm liable to walk up in the station in blue-face\nLike, \"Fuck the police!\"—Blue lives ain't a race\nFuck whoever said this rap shit was never a race\nThis shit a marathon\nMurder you motherfuckers and carry on\nClaimin' that you really 'bout this shit\nYou got your Jim Carrey on—\nLiar Liar; I might crucify ya\nNumber one till I die, will never retire\nI am the Messiah, I am the god of this shit\nThis is how we do it—yeah, I started this shit\nYes, I started this shit like–\n\n[Chorus: Bobby Tarantino]\nFuck that rap shit, this that trap shit (Bobby!)\nThis world is my contraption (Bobby!)\nI was born and raised in the trap, son (Bobby!)\nTalk shit, get kidnapped, son (Bobby!)\nI don't really know why I rap, son (ay!)\nMoney in the bank, yeah, I got some (ay!)\nCouple sports cars, yeah, I bought some (ay!)\nLogic never flex, Bobby get it done! (ay!)\nYeah, y'all don't really know where I come from (come now)\nTalkin' that shit, I'ma come for 'em (what's good?)\nTell me what you really know about me right now\nAnything I want, I get it somehow\n\n[Outro]\nYou—you, you\nYou—you, you, you, you, you\nYou, you—you\nYou—you, you, you, you, you\nYou—you, you, you, you, you\nYou, you—you\nYou—you, you, you, you, you", "image": "https://images.genius.com/2d421963ae73ffc51d48c6f69cb23ef1.1000x1000x1.jpg"}], "artist": "Logic"}