{"songs": [{"title": "Nellyville", "album": "Nellyville", "year": "2002-06-25", "lyrics": "[Nelly]\nWelcome to Nellyville, where all newborns get a half-a-mill'\nSons, get sedan DeVilles, soon as they can reach the wheel\nAnd daughters, get diamonds the size of their age - I'm talkin'\nOne year get one carat, two years get two carats\nThree years get three carats, and so on into marriage\nNobody livin average, everybody jang-a-lang\nNobody livin savage, e'rybody got change\nEven the paperboy deliver out the back of a Range\nIt's not a game, it's a beautiful thang\nImagine blocks and blocks of no cocaine, blocks with no gunplay\nAin't nobody shot, so ain't no news that day\nAin't nobody snitchin, they refuse to say\nEvery month - we take a vote on what the weather should be\nAnd if we vote it rains - know how wet we want it to be\nAnd if we vote it snow - know how deep we want it to get\nBut the sun gon' shine 99 percent, in Nellyville\n\n[Hook]\nThere's no.. way.. I.. I could explaiiiiin..\nThe way I feel right now\nThere's no.. way.. I.. I could explaiiiiin..\nThe way I feel about livin in Nellyville\n\n[Nelly]\nI got that good at e'ry gas station, pull on up\nGive me a half a ounce of that shit, fill it up\nWe got straws for the bottles, outlaw the cups\nAnd we gon' make it happen, ain't no need for no luck\nAin't no lotteries, no pick 3's or pick 2's\nKeep the money in your family, gamble amongst your crew\nCause the dice gon' do what the dice gon' do\nAnd if you take a life, you gon' lose yours too\nAin't no trials, it's automatic, you drop 'em right where it happen\nYou do unto others if you don't want it don't do the cappin\nThink that's cool? 40 acres and a mule\nFuck that! Nellyville - 40 acres and a pool\nSix bedrooms, full bath with a jacuzz'\nSix-car garage, pavement smooth\nBoth front and back deck 'nough room to land a jet\nAnd you ain't reached the city, that's just the projects\n\n[Hook]\n\n[Nelly] Everybody, uh, now everybody say\n\n[Interlude]\nWell I want to go, please let me go\nI need to go - down to Nellyville\nI need to see, what I can see\nWon't you and me - go to Nellyville\nI want to go, so bad\nI just want to go and look\nWon't you please take me on in\nI just know I gotta be there\n\n[Nelly]\nNo unexpectancy, like teenage pregnancy\nAnd physical mental attraction your only ecstasy\nYour own destiny, create your own recipe\nIf you ain't livin accordin to dirty then you stressin me\n\"And who are you?\" Who me? I'm the mayor\nAnd any problems you got, I live up thurr\n\"Where's that?\" The house on the hill, welcome mat of fur\nWhen you pass by that thang, be polite and don't sturr\n\n[Hook]\n\n[Outro]\nYeah\nThere's no.. way.. yeah\nThere's no.. way.. yeah\nThere's no.. way.. yeah\nThere's no.. way..", "image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg"}], "artist": "Nelly"}