{"songs": [{"title": "Yzark", "album": "I Miss the Hip Hop Shop", "year": null, "lyrics": "So crazy, so crazy, so crazy, you are so crazy {X4}\n\n[Verse 1]\nAight dawg, you in vibe with a hog\nThat'll spit a bar like a brick of raw\nBitch you off your poor tricks, war with natural ability\nTo put both hands up on the Statue of Liberty\nI'm smackin' the enemy with accurate agility\nAttack your facility then it's back on my killin' spree\nJigga and Nelly is cool, it's the wack ones that's killin' me\nWhile Clinton got head I was in the sack with old Hillary\nThe fact I'm an ill MC strapped with artillery\nGot your family at your funeral clappin' with misery\nIt could happen to him or me, rather the other way\nBaretta bust his face, pillow over the widow watch her suffocate\nDoody, you rather tough today\nCalm down muh'fucker, you rather rough today\nFuck the dumbness, run this rap shit, clap with the steel\nDump the gun quick, punk lips come back with his grill {*BLAM*}\nHalf the times rapin' Florida Evans\nKick the door off a church, went in and slaughtered the reverend\nIt's a quarter to seven\nIf I kill you by eight they should have you in the morgue by eleven\nSend him to hell when I spot a MC\nThen I battle him through a sance cause they was hotter than me\nYou should not bother with P (why?)\nCause I'll make a scrub-ass motherfucker disappear like Father MC, what?\n\n[Hook]\nSo crazy, so crazy, so crazy, you are so crazy {X4}\nDon't care about your parents, don't care about your wife\nDon't care about your kids, don't care about your life\nDon't care about your schools, don't care about your jails\nDon't care about your sins, don't care about hell\nDon't care about your parents, don't care about your wife!\nDon't care about your kids, don't care about your life!\nDon't care about your schools, don't care about your jails!\nDon't care about your sins, don't care about HELL! (so crazy)\n\n[Verse 2]\nYour record would be dope if it had some violence in it\n{*gunshots*} (He got a GUN!) Now let's listen\nImagine a pit on two feet with buck teeth\nSpit flames at rabbit nicknames then I bust heat - that's me!\nThe limelight in this lifetime we ain't sharin'\nGot the eye of the tiger starin' in a square ring\nOne punch and the further you float, the hurdle the ropes\nSlap Jesus five then I ride to murder the Pope\nEvery word is for dope, don't say you heard it befo'\nOnce off of that, and get your lip services broke\nI preferred it was wrote, D-12 has spoke\nThat The Source magazine give the unworthiest quotes\nI serve you with notes, snares, bass kicks and hi-hats\nPunchlines, skills, and Proof with mind raps\nI'm a Venus flytrap with a bazooka and shit stains\nHuntin' for flies, doin' lines with Rick James\nI ain't scared of Suge or Death Row\nAsk Bush which is more dangerous, a airplane or a pretzel?\nYou're reachin' for toast, put three in your coat\nFor bein' too close like you speakin' to ghosts, and I'm fleein' the coast\nWhen the gat clicks you see blackness\nIn the darkness your carcass is next to catfish\nThis is real insanity\nSo fuck that pilot that crashed Aaliyah, we gon' kill your whole family\n\n[Hook]", "image": "https://images.genius.com/d8f208c3ea47250c484492346287c1bf.571x571x1.jpg"}], "artist": "Proof"}