{"songs": [{"title": "You Gotta Lotta That", "album": "Laugh Now, Cry Later", "year": "2006-06-06", "lyrics": "[Ice Cube]\nHey... you wit' da ass (you wit' da ass), you wit' da ass (you wit' da ass)\nC'mere... wassup?\nWhat's your name girl? Who you come wit'?\nI'm wit' Snoop Dogg.. and my whole click\n\n[Hook: Snoop Dogg] - repeat 2X\nA nigga need a shot of that.. and I know where they got it at\nDamn girl, you gotta lotta that\nWon't you let a real nigga go and holla back?\n\n[Ice Cube]\nLook at you girl, light brown, ass round\nFeel like a nigga chasin down a rebound\nIt's bouncin like a basketball, if you got no ass at all\nSorry girl but you won't make the casting call\nSkinny bitches need to find that nutritionist\nShit that make yo' ass so thick and delicious\nIs it the food or is it the water?\nThat make your daughter wanna show what Momma taught her\nC'mere.. let me whisper in yo' ear (wassup)\nTell ya all that bullshit that you wanna hear (let's fuck)\nYou prolly hate my fuckin guts in a year\nBut right about now, you like a nigga's style huh?\nHow I talk, how I smell, how I smile\nHow I think, how I fuck, how I growl\nFuck wit' me, ya get ya meat and ya vegetables\nFuck wit' him, ya get a fuckin metrosexual\nYou want a man stronger than you\nNot a motherfucker in the mirror longer than you\nBreak a nail and his punk ass lookin for glue\nYou want a nigga wit' a hard dick lookin at you (lookin at you)\n\n[Hook] - repeat 2X\n\n[Snoop Dogg]\nYou came up in there lookin all cute and stuff\nYou and yo' homegirl, a pimp couldn't get enough\nYou talk that shit like you weren't up in there just to fuck\nWell guess what? Now bitch you wit' us!\nYeah have a sip, go take a puff\nGo and spend another blunt, naw roll it up!\nWhat yo' name? A nigga love how you came\nYou just in need of some game\nAnd I got that good thang, yeah it's a Westside hood thing\nLet ya party over day and hit ya wit' that ding-a-ling\nI got that good shit, lollipop (lollipop)\nAnd once I get up in ya, I make ya body rock (body rock)\nA thick little bad bitch, walk wit' a switch\nNow all you need now is some gangster dick\nIt's the Big Bow Wizzow, you know I'm on the pusszow\nDoggystizyle, that make ya kitty kat meow (meow!)\nDick deep, freak-a-leek, fuck some sleep\nAnd don't tell me that I'm... \"innnn too deep\"\nOkay (okay).. alright (alright).. Westside baby girl, we do it all night\n(fo' sho)\n\n[Hook] - repeat 2X\n\n[Ice Cube]\nDo ya thing girl, fuck what they lookin at\nShake it for me mami, work that pussycat\nDo ya thing girl, fuck what they lookin at\nShake it for me mami, work that pussycat\nPut it on me girl, what the fuck you scared of?\nWe just in the club, actin like we making love\nI know you full of liquor, put it on my zipper\nDrop it down now and throw it on a nigga\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/c4141aa982e145b56c3c52c3fbd1c258.1000x1000x1.jpg"}], "artist": "Ice Cube"}