{"songs": [{"title": "Swag Juice (Chonkyfire Freestyle)", "album": null, "year": null, "lyrics": "[Intro]\nI have no idea what I'm doing\nI have no idea what I'm doing, but\n\n[Verse 1: Eminem]\nEverybody get up, sit up Christopher\nThey're miserable without you, Superman is a-\n-live and he's flowing like the Mystic River\nGirl dont act like you never been kissed before\nOne, two, three, four, five, six, this a\nRhyme is about to hit you right in the kisser\nHow did anybody ever find me, I disap-\n-peared I was hiding in Freeway's beard, just a\nHop skip and a jump from my skin, gushing\nNails into my face that I been pushing\nHellraiser, my face is my pincushion\nIt's like when I'm on the mic, I can squish a\nSucker like a vice-grip, my pen put ya\nIn the slaughterhouse cause ya styles been butchered\nI'll spin chainsaw, take off like the blades on\nMy brain's on hyperdrive someone put the brakes on\n\n[Hook]\nHere's a smidgen admitted to get your digits, Bridget\nDon't try to fidget with it, err ribbit, ribbit\nI got ya slippin on my swag juice, my swag juice\nI got ya slippin on my swag juice, my swag juice\n\n[Verse 2: Mr. Porter]\nI got it figure out now nigga\nSee, my minds on my money right here\nAnd no one stopping how getting it\nIn hindsight, I never should have left where I was living\nAnd probably wouldn't be getting pressed by all these women\nAnd then again, I wouldn’t rap the ones I was diggin'\nSo annihilate the looking, and talking alot about the hood; Kim'n, Kim'n\nUh, so, Serena Williams, just like my dad talks about more Charles Dick'n\nThis girl talkin' how she pregrent, she crazy, so later I crushed that ho, and left baby\nAnd never trust her, no shit! Even she specialize in mouth massaging on my testicles\nAnd I never trust her, a whole lot, even on the first date, she basically get her mouth rimmed\nAnd turn around and ask me for a kiss, no bitch I’m straight\nAnd I never really get concerned how my own dick tastes\nI think I’m about to slip on my swag juice\nI think I’m about to slip on your swag juice\n(Oh, no! No! Don’t slip on your swag juice)\nYe, ye! I think I’m about to slip on my swag juice\n\n[Hook]\n\n[Verse 3: Eminem]\nSlim is in the house, simmer down there sister\nBound to get you dizzy cause he gets as busy as a\nBee, baby you can throw a frizbee in a blizzard\nHe'll catch it in his teeth, what is he? He's a wizard\nStanding in the disco with a disco biscuit\nAnd I'm pretty sure it isn't Bisquick, is it?\nNow baby don't forget to bring your lipstick with ya\nI want a kiss 'fore I blow this bitch to smithe-\n-reens, get the guillotines, this is a situ-\n-ation that's critical as Dre spins his, uh\nTurntables and he cuts a record like a scissor\nCheka chicka, checka chicka, cheka-cheka chicka\nWho wreck it in a second tell me what the heck is sicker\nWait a minute, I just dropped my necklace in the liquor\nNow baby just to make a little breakfast and it's six o-\n-clock in the morning 'less you want to get some dessert\n\n[Hook]", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}