{"songs": [{"title": "Don’t Gotta Go Home", "album": "Grand Champ", "year": "2003-09-16", "lyrics": "[Intro: DMX] + (Monica)\nGRRRRRRRRRRR.. yeah\nI mean we all men, we all men\nWe know how the shit go.. love one, fuck another\nI mean, it is what it is, it is what it is\nI mean, we knew what it was, when we became a part of it (yeahh)\nAin't no sense whinin about it now, feel me?\nIt's like..\n\n[Monica] + (DMX)\nThere's something on your mind (WHAT!)\nI can see right through you\nI know your girl been treatin you wrong (YEA!)\nBut she ain't no good for you\nWhy do you hold it inside (UHH!)\nBoy you should let me know\nI just want to make you right\nWanna be the one you could cry on\n\n[DMX]\nBaby, it's like I love my wife\nBut we goin through things and I ain't goin home tonight\nYou got time for a nigga, or is he still with you?\nWanna meet at the same spot, or should I come and get you?\nAight, I'll be there in 10, be in the front\nI been gettin what I need so I'mma give you what you want\nOne-on-one, cause you know how to talk to Dog\nYou walk the dog and understand New York is hard, baby\n\n[Hook: Monica and DMX]\n[M] So you, you ain't gotta go home tonight\n[M] You can stay right here with me\n[D] Uhh.. I ain't goin nowhere\n[D] When you wake up I'm gon' be right there\n[M] Don't you worry 'bout a thing\n[D] I ain't worried about SHIT!\n[M] You're here with me\n[D] Look, it's like I love my wife\n[D] But we goin through things and I ain't goin home tonight, AIGHT?\n\n[Monica] + (DMX)\nIt's kinda strange, that when you call (mmm)\nShe's never home\nNow you're there all alone\nAnd, you deserve so much more baby (WHAT!)\nI can treat you better than she can (WHAT!)\nIt doesn't make sense\nTo keep on loving, and keep on trusting\nWhen, in return all you get is nothing\n\n[DMX]\nDamn, you got me fucked up and I'm feelin it more\nNever had a mis-tress dis-tressed before\nOh come on ma, like it ain't that deep\nLike ain't no love there, like I don't hate that I gotta creep\nWe go to sleep in each others arms (YEA!)\nAnd I feel like this is where I belong\nIf lovin you is right then I ain't wrong\nThis is the same ol' song, wife and fam\nGotta be a father and husband but I'm still yo' man, baby\n\n[Hook]\n\n[Monica] + (DMX)\nThis situation's getting critical (uh-huh!)\nI watch so many tears fall (uh-huh!)\nI know she's not what you want (uh-huh!)\nSo why you keep on holding on? (GRRRRR)\nWhen I'm right here (WHAT!)\nAll you need to do is call (WHAT!)\nDon't be afraid (YEA!)\nCause she won't know at, ALLLLLLLLL\n\n[Hook] - repeat 2X w/ ad libs", "image": "https://images.genius.com/e730418bfaada4fc845d1179160af643.999x999x1.jpg"}], "artist": "DMX"}