{"songs": [{"title": "SLR 3 (Round of Applause)", "album": null, "year": "2017-12-10", "lyrics": "[Chorus]\nWelcome everybody, SLR 3\nMoment of silence for them, round of applause for me\n\n[Verse 1]\nI pause to put a round in the palms of thieves\nAnd then clap for 'em, bring it back to 'em\nSoundtrakk I bring my back to 'em\nCause they ain't ready for the front, fax to 'em\nLike my nigga Mickey Factz to 'em\nAye Mickey what the wicky-wicky wack doin'?\nThey ain't from us but they're claiming they're Columbus\nTheir raps come off flat cause they ain't in circumference\nThey ain't in the cypher of some lifers\nThem niggas probation, soon to be leavin' Rikers\nThey ain't see us as the circle of my peers\nSir cool but he ain't spheres\nThat means he ain't fierce as this\nSailboat wouldn't survive in the ocean of my tears\nBring it back to the peekhole, that's the circle of my peers\nThe back is what I said\nReady for the front, I rap it out the back of my head\nKnow it like the back of my hand\nCowboy, you calf like the back of my leg, you ain't seein' what I said\nThat's cause it's comin' out the back of my dreads\nYou ain't see it, gotta watch what I say\nWash a nigga away or dock a nigga pay\nI bring it back to the piers\nAnd if you ready for that, you've just received the deadliest catch\nThat you've seen in years\nMatch, and if you think I'm playin'\nBack when you were sayin' \"What in the world was that?\"\nWhen I was sayin' 'bout the world\nI was talkin' 'bout when the fuckin' world was flat\n\n[Chorus]\nWelcome everybody, SLR 3\nMoment of silence for them, round of applause for me\n\n[Verse 2]\nSo what we got here? Some Top Ramen talkin' 'bout some top tier\nSome top rhymin' to some boxed ears\nSuch a waste of my timin', that's why I'm not here\nThis recite is just a sight of the\nThe real me is out droppin' crop circles all over Iowa\nYou're witnessin' a one man cypher-a\nOne hand's a gun, the other hand's a silencer\nIf I cock the thumb, you gotta take a hike to the\nHitch, cock, psychotic, did you get that plot?\nIf you ain't get the words then just make a little bird\nSo you can hear what the fist don't stop, this shit don't stop\nLet you debate whether it's birds tellin' or motellin'\nThose fingernail shells come out my pistol top\nI wear a Rollie so my wrist don't watch\nCause he don't like to see it, ain't that a bitch?\nThe same wrist I shoot the three with, game winnin' remix\nRevisit the ship, upon which niggas seasick\nFloatin' on the water out the eyes that I see with\nBurnin' on the fire out the eyes that I see with\nSo as we heat seekin' the seen heater sea-seein'\nBut fuck it, it's too far off the deep end\nI don't need a reason, I ain't talkin' to 'em\nI just CC'd 'em Tetsuo season\n\n[Outro]\nSLR 3, Round of Applause\nSilencer on my hand so my rounds won't sound at all\nNow how that sound to y'all?\nMaybe how dog whistles sound to dogs\nTetsuo season\nAlbum comin' out, super soon\nThat's right, so I'm gon' ride this wave\nAnd niggas poppin' shit, it ain't got nothin' to do with me\nAnd just capitalize off all the free press\nBecause my publicist charges a lot to do the same shit\nAs these niggas doin' it for free\nAnd I can just rap, because really\nShit don't mean nothin' to me\nI can rap all day, pop shit all day\nAnd you niggas just soak it up\nBelieve it, if I stop, still gets headlines even though my Twitter locked\nAnd ain't that a bitch?", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}