{"songs": [{"title": "Paychecks", "album": null, "year": null, "lyrics": "(featuring Trife)\n\n\"It's alright ----- yyyyeaaaaaaaaah!\" - sample\n\n[Ghostface Killah]\nHold up, got's to boost those tray ups\nThink I'm playin' pa, reach and get glazed up\nFace all sprayed up, on the floor\nLeft side of your cheek, go ahead and pick that face up\nOf course I'mma fuck with y'all niggas, y'all pussy\nYa'll niggas know how Pretty Tony get down\nMade the potion '98, fuck an album, when I need cream\nIt's on, nigga, faggots, better check out their accountants\nWhen I hung around broke niggas and broke bitches\nYou know what that means, it equals no riches and\nI can't have that, I got a lot of wizards\nThey spoiled, told 'em they have to move drizzers\nWhatever they say, is none of their business\nI do what I do, to get that spinach\nWhether it's kill 'em, spray 'em, play 'em all on the streets\nI wouldn't saute 'em, Ghost and Kay Slay 'em\n\n[Chorus 2X: Ghostface Killah]\nThis kid about his papers, paychecks\nThinkin' you can pay me now, any bear feelings, just say it\nGo 'head brother, just as fast as you front\nIt be an honor just to lay you down\n\n[Trife]\nAiyo, aiyo\nThe first check I ever got\nSon I spent it up top, blowin' a cop ---\nI had 2 Cent, plus my car fare home\nIt wasn't even Broadway until I got those stones\nI was sixteen, shit, I barely knew what a gram was\nStudied Scarface, so I knew what the plan was\nTo get that cream, and serve them fiends\nAround the same time my nigga Buck converged with Beans\nTwo way team, posted up on the benches\nWit a maggot for a stash that I kept hid under the black fences\nJakes shootin' through the middle, like Kerry Kittles\nI was baggin' up small hittin' fiends, with very little\nThough they switched nickels on niggas, and pointed out bitches\nIn the precinct got the stichin', so they hit 'em off with something decent\nAvoid the sweeping, them boys is beastin'\nOn point, but I'm kinda paranoid when they creepin'\n\n[Ghostface Killah]\nFaggot ass niggas, when I ride get the fuck out the way\nWhen I see jewels, all I know is take\nI'm like a seed at a birthday party, all I want is cake\nIn other words, papes, sellin' herbs and tapes\nMovin' birds and weight, through suburban states\nGod damn it, I told y'all niggas\nThis is a Theodore stickup\nWake ya bitch up, watch the fifth pick up!\n\n[Chorus 2X]\n[Outro: Ghostface Killah]\nYeah, you heard what the bitch said\nWhen we wasn't makin' too much muthafuckin' cream and shit\nWe was beatin' the shit outta niggas\nTakin' their little Summer Youth shit\nBuyin' beer and weed and shit\nShakin' niggas upside down on some cartoon shit\nChange fall all out of their pockets and shit\nYellin' and tellin' the cops, fuck y'all niggas!\nThis is Theodore! Bitch!", "image": "https://images.genius.com/227de22e535416c2ec2a6f012f37c9ef.620x400x1.jpg"}], "artist": "Ghostface Killah"}