{"songs": [{"title": "Muthafucka Can U Buy That", "album": "1.21 Gigawatts: Back To the First Time", "year": null, "lyrics": "[Intro]\nThat's thirty five thousand dollars cash money\nNo, that's thirty five thousand plus one right?\nThe one I gave you?\nNo, you gave me six though right?\nI had one and it was thirty five thousand plus one plus six makes seven\nThirty five thousand dollars and seven right?\nMothafucka can you buy that?\n\n[Hook]\n(Mothafucka can you buy that? Buy that? Buy that?) I could buy that\n(Mothafucka can you buy that? Buy that? Buy that?) I could buy that\n(Mothafucka can you buy that? Buy that? Buy that?) I could buy that\nAwww, here this nigga Luda go again talking 'bout how much money he got and shit!\n\n[Verse 1: Ludacris]\nLuda! oh no, don't try that\nTwenty million dollar crib motherfucker I could buy that\nYou can see me in a fly 'lac\nMaserati's, Lamborghini's or a mutherfuckin' Maybach\nLay back making pay stacks\nConjure on the rocks, don't chase that\nBuss all in your bitch face, and like Puff, tell her take that, take that!\nChampagne by the boatload\nKeep a bottle of a Veuve Clicquot in a choke hold\nI'm rough I choke hoes, cockin' a magnum like 44′s\nGet it? I'm loco! I know people mob like no does\nAll night with the door closed\nWomen jumpin' on my stick like pogo's\nHigher, my rubbers all rotate like tires\nI fuck the bitch before I fuck you\nDamn right I'm tired!\nI'm filthy rich, bitch, go spend some mula\nI went to the dealership and the Ferrari dude was like errr Luda?\n\n[Hook]\nMuthafucka can you buy that? (buy that, buy that) [x5]\nI could buy that!\nMuthafucka can you buy that? (buy that, buy that)\nI could buy that!\nMuthafucka can you buy that? (buy that, buy that)\nBig Bank take Little bank nigga, I could buy that\nMuthafucka can you buy that? (buy that, buy that)\nYour money is my money\nI can buy that!\n\n[Verse 2: Luadcris]\nI can buy that shit\nNo nigga can even deny that shit\nPull up at the light with a hottie in a Bugatti\nAnd whatever you driving you better hide that shit\nOh, fuck your life, kill yourself nigga\nGo buy a casket, and bill yourself nigga!\nYou can find me freaking a Puerto Rican\nOr down in Panama with the stamina of an athlete\nOverlooking the women in Guatemala, Tahiti\nThey in bikini's I'm running them like a track meet\nBloaw! Ready, set go, I'm so outrageous\nYo' money is tied up, bitch my money is the dominatrix\nYo' money's funny, my money's mean\nYo' money's scummy, my money's clean\nYo' money is... stupid\nMy money is \"get over here, finish him. hadouken\"\n\n[Hook]", "image": "https://images.genius.com/5482bdd9a892ee8a85e236881855cbce.320x320x1.jpg"}], "artist": "Ludacris"}