{"songs": [{"title": "Outty 5000", "album": "Fahrenheit 1/15 Part II: Revenge of the Nerds", "year": "2006-01-01", "lyrics": "[Intro: Revenge of the Nerds sample]\nAre all nerds as good as you?\nYes\n\n[Verse 1: Lupe Fiasco]\nLook look! Gander gander\nIt's the young boy from the Lambda Lambdas\nThe Land of Lincoln, the Grand Theft Auto: Chicago\nWarn all the mics that he's hardcore\nAnd he's thinking, rose bearers to the area\nSpotlights, dancers dancers\nPro Tools come in, answer answer\nHis flow is like the Klu Klux versus the Panthers\nHaHaaaaa!\n\n[Verse 2: Lupe Fiasco]\nHit the track like a heart attack, cancer cancer\nBoogie Man on the mic and a band of Santas\nAnd the Easter Bunny is the backup dancer\nThey fainting in the stands, gotta fan the fans-uh\nPanties on the stage and the pampers of grandmas\nCause they love the way that I pamper the grammar\nMoon Man, strutting down the ramp of the lander\nWas nuts with the cane, Planters Planters\nAdjust my frames, tamper tamper\nI'm real, they Seinfeld\nThey ain't talking 'bout nothing, George Castanza\nLouder louder, grander grander\n'Cuff a friend, we tell it to 'em like Miranda\nThe game's in danger, panda panda\nSend orders to the reporters, tell 'em pan the cameras\nYou might get killed if you don't listen enough\nWell I guess I'm dead cause I ain't listen to Puff\nHaHaaaaa!\n\n[Verse 3: Lupe Fiasco]\nBest believe our system it sucks\nAnd a person like me don't believe in assistin' in such\nNah, I be rippin' 'em up\nBut for every pond there is different ducks\nI believe if you participate at a lower level you can get a lot more things done\nLike working with the alderman, but I ain't alterin' this song\nTo be a political statement\nLet's take it back to the basement\nTo the encore of the sold out tour\nThe \"More, more!\"s and the standing ovations\nThey be standing with more patience than the county on a Friday\nI did it my way, thank them\n\n[Outro: Lupe Fiasco]", "image": "https://images.genius.com/dbe43b56e43c0bf22c2ad2f2bce13dd0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}