{"songs": [{"title": "War & Peace", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17", "lyrics": "Ice Cube the great!!\n\n\"He has indicated to us that he has sufficient.. firepower..\nTo.. blow up the Bradley vehicle..\nAnd in fact his words were\n'We are ready for war.. let's get it on'\"\n\n[Ice Cube]\nWar.. \"War, and peace\"\nSing it!\n\n[Chorus]\nWar and peace... (Sing it!)\nWar and peace, forever!\nWar and peace, together.. always!\n\n[Verse One: Ice Cube]\nI'm at the highest peak, still glad the meak is understandin me\nArtillery, thoughts of killin me is just a fantasy\nThe man in me is ready for war, like Holyfield/Tyson IV\nA gang against you niggas on the shore\nEither or, your whole family is on the floor\nWindows breakin all around em, you can't climb this mountain\nI'm at the fountain, with my troops\nI start screamin at em like Patton, we gattin at you fools!\n\n[Chorus]\nWar and peace... (Sing it!)\nWar and peace, forever!\nWar and peace, together.. always!\n\n[Verse Two: Ice Cube]\nNegotiate... strategy is the key!\nI hope they ain't... exclusively after me!\nCause if they are... we gots to be who we be!\nAnd make a star... out of a head enemy!\nThe papers said... that he died tragically!\nThey found his head... with no legs and bo-dy!\nWe made a pledge... to the Dub-S-C!\nBloodshed... if they got no love for peace!\nSing it!\n\n[Chorus]\nWar and peace... (Sing it!)\nWar and peace, forever!\nWar and peace, together.. always!\n\n[Verse Three: Ice Cube]\nI'd rather break bread than uhh, break your head\nBreak your legs, have em broken, I ain't no joke\nDon't provoke, the gun smoke from the highest Loc\nEternal peace, for my peoples and my folks\nMy crips and my bloods, criminals and my thugs\nJust show a nigga love when I'm rollin on them dubs\nJust, give a nigga hugs, we can ride on this piece\nWestside for Life but still down with the East\nSing it!\n\n[Chorus]\nWar and peace... (Sing it!)\nWar and peace, forever!\nWar and peace, together.. always!\nWar and peace... (Sing it!)\nWar and peace, forever!\nWar and peace, together.. always!\n\nAfter the haters attempt to blow up his car\nWe find our hero, Ice Cube, on the ground\nBruised, but not beaten\nHe pulls out his cell phone.. WITH THE CHIP!\nAnd begins to dial Mack One-Oh\nWho's faded and rolling through Inglewood\nWith Mr. Short KHOP\nWords.. are spoken", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg"}], "artist": "Ice Cube"}