{"songs": [{"title": "Brooklyn Babies", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Tiffany]\nBobby, I'm tired of yo' shit, nigga!\nI'm tired of you comin' in at 3 o'clock in the fuckin' mornin'\nNigga, you got a fuckin' family here\nYou act like you don't fuckin' know that shit\nNigga, what the fuck?\n\nBorn up in Kings County\n\n[Hook 1 - Force MD's]\nDigital, these niggas should be crazy\nGrowin' up as a Brooklyn baby\nThis how, this is my life..\n\n[RZA]\nYo, yo, yo, yo, yo\nYo, yo, yo, yo, YO\nA Brooklyn baby, I was born up in King's County\nInside the womb seven months before the Queen found me\nUp in wroughty Brownsville with fiends around me\nNow roam gat in Staten with Cream Team around me\nThey called me Bobby, Cousin Billy got the black Harley\nTaught his son how to snipe cats like Lee Harvey\nOswald, all's well that ends well\nMy big brother Divine, he pushed the Benz well\nI got the cherry Range, known for rockin' heavy chains\nI'm from the tribe of men who would bury Kings\nOn the back of the A-train, my daydream\nShould I make a phat hit or should I take CREAM?\nFrom the Clan that taught you cats Cash Rules\nI make slow grind tracks, you grab ass too\nGive respect to the Prince when he pass through\nMight have a chocolate deluxe in a glass shoe\nCousin Billy, known to strap the black uzi\nShoot you in front of the Jakes like Jack Ruby\nLive on TV where you see B-O-B-B-Y\nD-I-G-I-T-A-L (A-L!), things ain't too well\n\n[Hook 1]\n\n[Hook 2 - Force MD's]\nDigital, these niggas should be crazy\nGrowin' up as a Brooklyn baby\nThis is how I live my life..\n\n[Masta Killa]\nYeah..\nPeace Lafyetee, Stuyvessant, Malcolm X\nShot dice on green, we live from Pulaski y'all\nIt's Fred Glassy, zig-zag-zig through traffic\nGet the herb, get the God, peace Ra'\nWhat's the word on things?\nThrough the phone I heard the bangin' sounds\nIn the background, layin' down\nI'm spittin' what the people missin'\nWe extreme with the murder type theme\nDon't sleep, get ya head split to the white meat\nBig guns, down South we blaze\nShippin' bodies back up North, it's the Weston\nWild Texan, no trespassin'\nLong mics hit the dead arm\nPlanet Earth, home of Islam\nBrooklyn, I was physically born, clothes torn\nRough tacklin' the streets, Allah Math' spin techniques\nWe bring heat to the block party, drinkin' Bacardi\nBaggin' shorties for the homies who ain't here\n\n[Hook - both to fade]\n\n[Tiffany {​​​​*overlapped by Hook*}​​​​]\nBobby, that's right, you ain't shit, nigga\nYou ain't shit, but a big dick and a mothafuckin' cheque\nAll that fuckin' Brooklyn shit, Shaolin shit\nNigga, grow the fuck up!\nWhat the fuck is up with you, nigga?\nYou ain't shit, nigga\nComin' in high off that shit\nWhat the fuck?\nI'm tired of yo' shit\nWhat the fuck is that shit anyway?\nWhat the fuck?\nAnd your cousin Billy, I'm sick of that mothafucka\nThat mothafucka could never come up in this\nMothafuckin' house ever again\nHe's a criminal mothafuckin' gangsta, see that shit?\nA criminal, I'm sick of that shit\nI'm sick of yo' shit, Bobby {​​​​*echoes*}​​​​\nBrooklyn this, Shaolin that\nWhat the fuck, nigga?\nI don't know why I love your stupid ass anyway\nPssh.. but I do love you Bobby", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}