{"songs": [{"title": "Undeniable", "album": "Mudface", "year": "2015-11-13", "lyrics": "[Intro]\nHaha\n(Yeah!)\n'Ey Brick City in the buildin', nigga\n(Yeah!)\nI know y'all miss hearin' hard shit like this, nigga\n(Yeah)\n(Ahh-ow!)\nYes sir\n\n[Verse 1: Redman]\nYo, I'm undeniable, I feel you niggas hatin'\nI got your home girl here so I'm renovating\nMy pen game get it on, I'm penetrating\nAnd hoes come in all colors, I'm finger painting\nI'm sick of makin' Lincolns, I wanna make a mil\nI'm 360 but not your label deal\nI get all my bread, I ain't splittin' a dime\nI'm too tight like that leather that’s fittin' the Fonz\nI ain't grippin' a nine\nBoy I’m a motivator, motivatin' the jungle, gettin' that crack gator\nYou irrelevant, beta, Gilla House the hardest\nThe vampires of the game, start wearing your garlic\nI ain't a alcoholic but I make ya say damn\nHe took it back to the afro and the Ray Bans\nIt's Gilla House mane, we breaking all the rules\nAnd everything we drop is undeniable\n\n[Bridge - Redman (Runt Dog)]\n(Yeah)\nGilla House in the buildin', nigga, yessir\n(Shut the fuck up and listen, nigga)\nYou already know, 'ey Runt Dog, you all ready nigga\n(Brick City, nigga)\n(Yeah)\nBrick City we in here, nigga... Let's go!\n\n[Verse 2: Runt Dog]\nI'm too grown to bullshit with you broke ass niggas\nHalf on a nickle bag of smoke ass niggas\nForty years old on the block still hustling\nHead need Rogaine, bed need Just for Men\nBitch niggas full of estrogen\nDog I'm a boss but I still work hard as a Mexican\nGrimey as hell, slimey it smells\nCheck my rap sheet, I spent most the 90s in jail\nOff pills, I feel like George \"the Animal\" Steele bananas\nWith the blammer get your cantaloupe peeled\nFor the cake I push pies, my block the bakery\nBoy I put you to work like a temp agency\nPlus the rhymes you be writing is wack\nI know white chicks that write shit tighter than that, nigga\nYeah, we robbing you for the valuables\nThis that Gilla House grind, undeniable\n\n[Bridge - Redman (Ready Roc)]\nOoh-oh!\n(Yo)\n(Unh yo look)\n(Yo)\nGilla\n\n[Verse 3: Ready Roc]\nLook, let me list a few reasons they call me the beast\nCause anytime I see rappers, I think of a feast\nAnd I ain't talking chicken shack, I'm thinking Felipe's\nSo anytime you think of Ready, you think of the East Coast\nNo disrespect, I'ma rep for mine\nAnd I ain't saying I'm the best but I'm the next in line\nThat's why my nickname Ready cause I'm stretched for time\nSo only way a nigga lock me down is on the dotted line\nWhen I rhyme, it's sort of like a violent crime\nSo if you get caught with my verse, you do a 3 to 9\nHard minutes of ass whippin', I'm passed different\nI play the front like the lead vocals you ad-libbin'\nSee I'm a giant who, more than liable\nTo bring the riot through and turn all beef into lion food\nNow what I gotta prove, I passed all obstacles (yeah!)\nSo when it comes down to my talent, it's undeniable\n\n[Outro - Redman (Ready Roc)]\nGilla House in the fuckin' buildin', mane!\nYo Ready Roc\n(What's good, unc?)\nThis is what we do!\nThey can't stop us! THEY CAN'T STOP US!", "image": "https://images.genius.com/c2929de9421dffcccd19e5114ae76a74.1000x1000x1.jpg"}], "artist": "Redman"}