{"songs": [{"title": "Knock On Wood (Freestyle)", "album": "Any Given Sunday #1", "year": "2011-07-31", "lyrics": "[Intro]\nCole, Cole, Cole, Cole, and on the count of three, baby girl\nCole, Cole, Cole, Cole, and on the count of three, baby girl\nCole, Cole, Cole, Cole, Cole, hey\nAnd on the count of three, Blow up, Blow up\n\n[Verse]\nYeah, and that I will, nigga, that I will\nI keep a checklist of rappers that I'mma kill\nI used to play the bleachers before I had a deal\nNow a nigga gettin burnt, just imagine how that feel\nHmm, ill, fantastic\nFlip rhymes, flip beats, nigga, \"Jam\"nastics\nYour style hot now, but they just can't last with\nSomething like the rap sand-castle\nGone with the tide, I'm here for the seasons\nBend yo' ass over bitch I'm here for a reason\nCold breezin', flow freezin'\nThis ain't spittin' ho, I'm sneezin'\nUsed to hit South Beach, stay at the Parisian\nNo fun nigga, low funds was the reason\nOld school bed that the hoes got pleased in\nNow them Lowes doors, is what I throw keys in\nMan, talk about a come up\nNiggas see me in the street they talk about 'The Come Up'\nOr talk about 'The Warm Up'\nOr \"Nigga, when your album drop?\"\nAnd why these lil' rappers like to run their mouth alot?\nAnd J. Cole, are you really from the south or not?\nI see your jeans, man them thangs, must have cost a lot\nAye do you get a chance to hang out with the boss a lot?\nEven them hating niggas like you at the barbershop\nCole.. Yeah, that's my muhfucking name\nNigga couldn't even watch the All Star game\nHad to do the whole Valentines Day thang\nGotta play the game, so my lady won't complain\nThree or four days, I be back on a plane\nDo a couple shows, where the people know my name\nLook man, the crowd full of pretty young dames\nIf you gonna do dirt, then you can't leave a stain, man!\nTiger Woods y'all\nHe like them white girls, I like them hoods y'all\nShe got her head straight, she got a good job\nShe give the best brain, she got them good jaw\nI got that good game, that's cause I'm good, y'all\nAnd J. Cole the lil' engine that could, y'all\nAnd yeah I'm coming for the top, like I should, y'all\nAnd bitch I never fall off, knock on wood, y'all\nCole", "image": "https://images.genius.com/d75165afed097efe5c123d56cef54f0a.1000x1000x1.jpg"}], "artist": "J. Cole"}