{"songs": [{"title": "I’m Scared (Demo)", "album": null, "year": null, "lyrics": "[Intro: Young Thug]\nOh, really? Yeah\nOh, really? Yeah\n\n[Verse 1: Young Thug]\nI'm scared to break the top (Why?)\nI'm scared to make a mess because I'm watched by the cops (Fuck 'em)\nI'm scared to count my blessings 'cause I'm being watched by my opps (Foes)\nBut fuck it, Lethal Weapon, let it rip from out the top of the drop to his scalp\nNow he out like a light (Ayy)\nEvery nigga with me slime and shiesty\nStay on the PJ but I don't sight-see (No Cap)\nSomebody tell Oprah I want wifey (Call me)\nLil-lil-lil-lil mama tryna fight me (Ayy)\nI got slatt engraved, it in my Nikes\nOh, you caught a body? Doesn’t excite me (Fool)\nAll my niggas murderers, you tiny\n\n[Chorus: Young Thug]\nRunnin' from the cops in a goddamn Rolls (Ayy)\nI just cooked a opp on a goddamn stove (Cook him)\nShot up the opp block and I robbed all they stores (Yeah)\nSlime, do you got clocks? Nigga, twenty times four (Let's go)\nRobbed him for his dank and his car and gas tank (Let's go)\nI'ma rob that bank, I'ma-I'ma rob that bank (Uh, rob that bank)\nIf I hit New York, I take my shank like a Yankee (On God)\nThey stabbed him and he died 'cause it's pointy and they yank it (Woo)\n\n[Verse 2: Doe Boy]\nYeah\nNigga flexin' money, if I want it, then I'll take it (Okay)\nHeard you run no faces, you ain't heard? I shoot faces (Yeah)\nFuck shit better save it, you ain't heard? We don't play it (No cap)\nIf a nigga have some beef with us, he met the pavement (Gang gang)\nThis that ain't no cap at all, I can't hang around no fraud\nNiggas hating cause I ball (Grrra), problem solved\nHit yo' bitch, blow out her walls, I just bust all in her jaws\nBitch, we slimey as they come, my youngin' probably snake his dog\nCop that Rove' (Woo, woo), in that Rove' (Woo, woo, skrr)\nAll my niggas sick, they wipe yo' nose\nAin't never froze, blow my pole (Boom, boom)\nHeard you gangster, it don't count no more, you told (Pussy)\nNo, this Raf shit can't change, we just runnin' up them bands (Let's go)\nTryna figure out which opp that's gonna get murdered with my advance (Freebandz)\nPop the pill, it got me geeked up, nigga, catch me when I land (Let's go)\nPlease don't play like I won't hop right off the jet, jump in a minivan\n\n[Verse 3: Young Thug]\nI'm going big, and it ain't rigged (And it ain't rigged)\nYeah, that lil' pussy pink, like a pig (Just like a pig)\nFreaky lil' bitch (Freaky), drinking my spit (Drink it)\nI was ridin' in the Rove', the one with no lid, a half a mill' (Half a mill')\nDesigner her kicks, she wants to wear Prada (Designer)\nShe said she got white paint on her toes (Woo)\nPeepin' they face, niggas been mad since before (Since before)\nYeah, in a Continental with your ho, nigga (In a Continental)\nI just bought a rental, fuck the incidental\nPut it in her liver, she just like my pickle\nKnew since I was little not to talk to pillars (Skrr)\nMade the news one week, it took off like a missile (Skrr skrr)\nQuietly peel your top off, potatoes (Skrr skrr)\nWe got now, we got next, nigga (Skrr skrr)\nCan I live in a skyscraper? (Skrr skrr)\nI got mills and I'm not gon' cake her (Skrr skrr)\nI got seals and I'm scared to break 'em\n\n[Outro: Young Thug]\nMost of these niggas they played out\nMost of these bitches is played out\nPeepin' they faces, they mad 'cause my cake up\nLiving in the Matrix\nAll of my rings, all of my shades, all my baguettes\nPlay for the cases, niggas really be on your head\nThe racks on your head, they might catch you caking\nWe traveling daily and I got hoes on replacement\nWe serving out a basement, with camera surveillance\nPouring up Laker, and rocking the latest", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}