{"songs": [{"title": "Rough Cut", "album": "Legend of the Liquid Sword", "year": "2002-12-10", "lyrics": "[Intro: Armel]\nUh-huh, GZA, uh, RZA, uh\n\n[Armel]\nListen, if ya'll can spit, we can spit, please get it together\nCuz anything you can do, I can do better\nYour imagine material looks, hidin behind hooks\nRaise the fear, no one, but self, who's shook?\nBring the plague like the revelations in the holy book\nWho's spot youse took? Duke off the hook!\nI'm from the land of the crook, life quick to end\nBetter known as the Brook, rather take than lend\nThere's a lot of wack records, but this ain't one of them\nDJ's off the books, go 'head put the gun at them\nAll groupie M.C.'s, I'm bout to start stunnin' 'em\nDon't matter what crew, every last one of 'em\nIt's gettin' crowded in here, some acts got to go\nLet's start by eliminatin' groups that can't flow\nI bet a mil' my deal, my career with no fear\nThat none of ya'll, duke, can touch what's over here\n\n[Hook: GZA]\nThese rough cut metal tapes\nQuick to break your label mates, won't hesitate\nNegotiate your table stakes, you can't flow right\nOr fuck with me on no night\nFuck the slow light, you need to get your show right\n\n[Prodigal Sunn]\nYo Justice, how many M.C.'s must get pistol whipped?\nCrack faces with bottles of Crys', hollow tips gobble lips\nThat's the penalty for poppin' that shit\nVanish in a colorless whip, bags of grip\nDoo-rags and clips, tag the strip\nYou had the chance to advance, I'm sorry for the holes in\nYour hip\nSon, It's the way of the street merchant, live by the laws\nDie by the rules\nMy gleam play the part of a fool\nNow hear these jewels from a wise king, see what my eyes seen\nTen year supreme, the theme, we sizzle-line and triple CREAM\nMy grip'll off that digital bream, visual scene\nRoll footage on your video screen\nGlobe patrol, Two On The Road, we never fold\nSnub react, GZA mack eliminate tracks\nStimulate phat, Sunzini, nigga, gifted and black\nNow watch me mack to the kingdom of rap\n\n[12 O'Clock]\nGive me a beat, nigga dealin' battles like a thief\nDone killed more niggas than Jason in part 3\nStay Wu, own the graveyard and this label\nDum dums, that battle 12 O'Clock, now it's able\nSo what, looked up and made the bitches clap\nThat was because my style's clothes, not the raps\nAin't that shit, props for the clothing\nShould of brought a mirror, cuz lyric wasn't rollin'\nMy rhymes is all that and yours ain't shit\nAnd at a party, your bitch takin' crazy flicks of me\nShe said I was nigga celebrity\nBut I'm from the slums, with the bums drinkin' Hennesey\nTake a sip of some Jamaican rum\nPut fire to my lung, tongue, teeth and gums\nWhen it comes out my mouth, shit's hot and it burns\nMake fools out of bitches like I'm Howard Stern\n\n[Hook 2X]", "image": "https://images.genius.com/6eec7781b61d16cab75a144ab36ff78d.500x500x1.jpg"}], "artist": "GZA"}