{"songs": [{"title": "God Level (Demo)", "album": null, "year": null, "lyrics": "[Intro]\nWhat y'all wanna do tonight?\n\n[Verse 1]\nProvide a new coffin\nYou don't see murder like this this often\nY'all don't see poppin' numbers up on them often\nWhen the sky on us somethin' now break through\nSomethin' now pump fump-uh take two\nPots enough and a muhf'er make you\nCan't I muh-nuh somethin' I can't do\n\n[Refrain]\nGod level\nGod level\nGod level\nDon't be afraid\n\n[Verse 2]\nOur father, pumpin' up but don't bother\nPumped up, can't but be bothered\nDump a somethin' but seek knowledge, uh\nMight as well make a new casket\nHold up in this though for, for, for the bastard\nWay somethin' happenin' than foster what we happen\nLock us on, it happen in those, nah, nuhmp\nWhen the sky break down in there more than they do\nSomethin' and somethin' that do like they do\nCrump on and up on the niggas that take two\n'Cept for the don and the tons that came true\n\n[Refrain]\nGod level\nGod level\nGod level\n\n[Break]\nIf you could take that moment and live it\nAnd own it, improve it\nLeft on it, I know it\nDon't tell no one\nWhat y'all wanna do tonight?\nOhh, take that ride and get on it\nI know you're too excited\nGirl, come on, come on\nFirst and off, in and all, bands up top\nDon't stop now\nWon't stop now, ohh, in my\nIf you feel like it, if you feel like it\nMight as well if you feel like it\nPop it from the night and day\nUp in the Bent' or pop it\nSomethin' you and I and, yeah\nMake it all done-done a mile away, it don't matter\n\n[Verse 3]\nUh, you see sharks in the water\nThey ain't tryna do nothin' but put cocks in your daughter\nDon't say nothin' 'bout what 'Ye said\nDon't move, motherfucker, play dead\nToo cool, motherfucker, we there\nYeah, we cool, motherfucker, yeah-yeah\nYeah-yeah, yeah-yeah, yeah-yeah\n\n[Refrain]\nGod level\nWhat y'all wanna do tonight?\n\n[Outro]\nYou're alone all the time\nDoes it ever puzzle you? Have you asked why?\nOh, baby, why fall in love and out again?\nDo you really ever love or just pretend, oh, baby?\nOr just pretend, oh, baby\nOr just pretend, oh, baby\nWhy, you're alone all the time\nDoes it ever puzzle you? Have you asked why?\nOh, baby, why fall in love and out again?\nDo you really ever love, ever love, ev-ever love?\nDo you really ever love, ever love, or just pretend\nOh, baby", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}