{"songs": [{"title": "Act Right", "album": "Tical 0: The Prequel", "year": "2004-05-18", "lyrics": "[Intro]\nYeah, that's right everybody get some act right\"\n\n[Verse 1]\nAwww shit! Ya know the name\nWho flip flows like chessboards, there go the games\nI'm drugs to the brain\nEven on the 14th of February I ain't got no love for a lame\nBack doin' my thang, right\nLivin' the fast life\nBitch grab a seat at the bar, get you some act right\nIf that don't do it then rock, lets bring it back like\n(Damn right everybody get some act right)\nEver since I came up, rappers done changed up\nPut your walking shoes back on and step your game up\nI'm getting through off the books, rock we banked up\nY'all don't think my shit off the hook, then y'all can hang on\nI'm like a king that's so fresh so clean\nI leave niggas like black coffee, no cream\nCome inside the party fuck up the whole scene\n(That's right everybody get some act right)\n\n[Hook]\nGet up get up, ya know what we came here for\nWhat up what up, get your asses out on the floor\nCome on come on, I've been away for far too long\nGuess who's back and far too strong for ya niggas (now)\nWe feelin' good tonight, we hittin' 'dro like\nWe gettin money and gettin' honeys that flow like\nMy mic, my clothes, my life, my dough\n(That's right everybody get some act right)\n\n[Verse 2]\nYa damned if you do, ya damned if you don't\nStep inside my Range and get blammed if you won't\nMy Clan in the joint, man we got it locked\nLike whatever niggas got in the bank, I got it stopped\nY'all already know of my strength already growin'\nIn this game many may come but few are chosen\nI don't usually do this, but keep the party going like\n(Damn right everybody get some act right)\nI get tips from B.I.G. and Pac when they blastin' the heat\nIf you's a rapper, don't ever ride the passenger seat\nOne to grow on\nWhen up shit's creek, you get your roll on\nBoy I never stop, I go on, so on and so on\nRappers can't fuck with me\nMy career's like somebody put glue in your chair and now you're stuck with me\nI don't use pick up lines, I guess I'm just picky\n(That's right everybody get some act right)\n\n[Hook]\n\n[Verse 3]\nExtra, extra read all about it\nWho shits they grounded, flies all around it\nMy trees don't doubt it, they green as a salad\nAll American Express I never leave home without it\nI'll never go pop, Meth Man I'm bout it\nWhenever I rock, the jam's over crowded\nI'm never gonna stop, the fans won't allow it\n(Damn right everybody get some act right)\nYo, get it you got it, if you got it then good\n(There's a lot of rappers rappin' but not a lot of 'em could)\nI'm that boy in the hood that told Red Riding Hood\nThere ain't nothin' but wars in my neck of the woods\nSo! Who's ready for MC Whoa\nWhat's beef? Beef is what I got teeth for\nI eat up everything on my plate then eat yours like\n(That's right everybody get some act right)\n\n[Hook]\n\n[Outro]\nStand up! Staten Island, Lond Island get some act right\nEvery borough, New Jersey get some act right\nEach state, west coast, east coast, dirty south, midwest get some act right\nIf it ain't well, it ain't right\nIf it ain't Meth, it ain't tight\nSo on that note like this, everybody get some act right", "image": "https://images.genius.com/b570b137bfca42564ca115c745cf3a4c.500x500x1.jpg"}], "artist": "Method Man"}