{"songs": [{"title": "Greatest", "album": "Kamikaze", "year": "2018-08-31", "lyrics": "[Intro]\nMotherfuckers talkin' crazy (Yeah)\nSayin’ I should quit (Ah)\nI fuckin' tell 'em make me (Bitch)\nEat a fuckin’ dick (Yeah)\nI'm feelin' like the greatest (Woo!)\nOn the beat who ever did it\nMike WiLL the one who made it\nIt's Shady on the lyrics\n\n[Verse 1]\nI'm somewhat outlandish they say\nYou say we're cut from the same cloth\nBut I guess you fabricate, eh?\nYou better bring more men than the Latter Day Saints\nManic states, Stephen Paddock with automatic stay sprayin'\nAt anything that may stand in they way\nAs I stand at the bay window with a hand grenade\nAnd a trey eight, at the Mandalay Bay\nCommon sense, I'm a dollar short and a day late\nJames Holmes at the Saturday Batman matinee\nMust have missed my CAT scan that day (Yeah!)\nI just threw a Tampax at Dre\nTrashcan, Tascam and ashtray\nI’m turnin’ back to a madman, can't take\nAnymore but I try to get away from the anger and rage\nMy basal ganglia’s an A to the K\nGet your ass sprayed like bidets\nBreakin' your legs eight different ways, ankle to waist\nYou chumps don't even know how to do somethin'\nTo give goosebumps a day when you say\nThat somethin’ you wrote gave someone a lump in their throat\nOr you had them choked up, you'd be yankin' my chain (Ayy)\nFeelin' like I'm headed for the padded cell, the\nBar for me when I rap isn't fair but\nGuess that's the standard I'm held to\nBut if somethin' like that doesn't tell ya\nYou set a mark too high when platinum sales are\nLooked at as a failure (Yeah)\nThen you better take it back to The Shelter and Hamburger Helper\n'Cause damn it I'm still the\n\n[Chorus]\nGreatest in the world, greatest in the world, greatest in the world\nNo lie, I might be\nThe best to ever do it, the best to ever do it, the best to ever do it\nI feel like the greatest\nWoke up to honkies sounding like me\nNever be as good, never be as good\nPacking up wife-beaters, white t-shirts, white\nBut I'm the greatest\n\n[Verse 2]\nSo you sold 10 million albums, eh? (What?)\nOnly problem is, you put out 10 million albums, eh? (Haha)\nWait, what was I just about to say?\nOh yeah, let me get this out the way\nI know there's people that are pissed about the way\nI mispronounced a name, \"DIE ANTWOORD!\"\nFuck, I still can't say this shit, but how quickly they forget\nWho the fuck I was; now Ninja try to duck my slugs\nYou let ya girl get fucked by Muggs\nI'd like to give a shout to Cypress (Woo!)\nThis can't be real, you dissed me and I was just tryin' to\nGive you a shout—now get the fuck out my rhyme book!\nNo more shiners, already too much time tokin' rappers\nI hear you talkin' shit, I'm just too big to respond to it\nGod forbid I forget, go and jump out the window\nSomebody better child-proof it\n'Cause if I lose it we can rewind to some old Ja Rule shit\nAnd I can remind motherfuckers how I do shit\nYou don't got the tools I got in my toolkit (Bitch!)\nI bullshit you not, y'all fools just forgot\nThat I'm so fuckin' awful with the thoughts\nAnd when I'm hostile and impossible to stop\nSo you can call it a nostril 'cause it's-snot gonna ever\nI'll never let up on the pedal, might as well get the mop\n'Cause I'm wipin' up everyone in this genre\n'Cause on the mic I feel like I'm the\n\n[Chorus]\nGreatest in the world, greatest in the world, greatest in the world\nNo lie, I might be\nThe best to ever do it, the best to ever do it, the best to ever do it\nI feel like the greatest\nWoke up to honkies sounding like me\nNever be as good, never be as good\nPacking up wife-beaters, white t-shirts, white\nBut I'm the greatest\n\n[Verse 3]\nOh yeah, and one more thing I want to mention (What?)\nIs you're one dimension\nI'm a monkey wrench and I can flunk detention\nI love contentions, so welcome to the gun convention\nMuscles flexin', gotta strut like a front suspension\nAnd you just stuck the key up in the ignition\nAnd gave me enough gas to flood my engine (Yeah)\nPsychopath, Michael's Jack's blowin' up like a raft\nI should slap Vlad with a ISIS flag\nBet you I come back twice as bad (Uh)\nRevival didn't go viral!\nDenaun and Royce tell me that I should take the high road\nFuck that, I'm finna hit back\n'Til I run out of gunpowder and split the scene\nHold the mic similar to pistol, squeeze\nAnd I shoot from the hip when I grip them things\nAnd my lips are the clips got the cig lit like it's nicotine\nTrigger me and Slim gets mean (Prr!)\nBars are like bullets when I spit them schemes\nThat's why I call the motherfuckers M16s (woo!)\nFloat like a butterfly, I'm gonna sting like a bee\nYou ain't harmin' a thing\nI hit a ding hard as I'm gonna swing\nI'm gonna need to put my arm in a sling\nBut like a wedding band\nYou gotta be diamond to even climb in the ring\nAnd nominally I'm Muhammad Ali\n'Cause I knew one day I'm gonna be the\n\n[Chorus]\nGreatest in the world, greatest in the world, greatest in the world\nNo lie, I might be\nThe best to ever do it, the best to ever do it, the best to ever do it\nI feel like the greatest\nWoke up to honkies sounding like me\nNever be as good, never be as good\nPacking up wife-beaters, white t-shirts, white\nBut I'm the greatest", "image": "https://images.genius.com/160b53c324c4cdeb709b605d3a591598.1000x1000x1.png"}], "artist": "Eminem"}