{"songs": [{"title": "The Message 2002", "album": "The Mix Tape", "year": null, "lyrics": "Uh-ha! Uh-ha!\nAnother Inebriated beat\nYou know what time it is, straight for the street\nKRS-One, hold tight! Look, look\n\n[Hook One: KRS-One]\nCrack - don't mess with that\nSpeed - don't mess with that\nIt's whack - don't mess with that\nGreed - don't mess with that\nKnowledge - yeah, mess with that\nGod - yeah, mess with that\nCollege - yeah, mess with that\nA job - yeah, mess with that\nLook look; dealing - don't mess with that\nCrying - don't mess with that\nStealing - don't mess with that\nLying - don't mess with that\nMeditation - mess with that\nForgiveness - mess with that\nEducation - mess with that\nHip-Hop - we lovin that\n\n[Verse One: KRS-One]\nI rhyme for respect y'all, intellect y'all\nNot sex y'all, move that neck y'all, correct y'all\nChecks y'all, cash y'all, don't last y'all\nWith cops y'all to blast y'all, harass y'all\nFlash y'all as they pass y'all, through the glass y'all\nThese videos gas y'all cause they trash y'all\nI ask y'all this fact y'all\nUnaired y'all, these cops y'all they scared y'all\nThey fear y'all they hear y'all they hate y'all\nLess than 40,000 a week, they make y'all\nCops y'all with black feet, livin from week to week\nWalk crooked beats in the streets y'all\nThey greet y'all with the heat y'all, to defeat y'all\nIt's deep y'all, hear what I teach y'all, and speak y'all\n\n[Hook Two: KRS-One]\nHate - don't mess with that\nTrends - don't mess with that\n? - don't mess with that\nRevenge - don't mess with that\nTruth - yeah, mess with that\nSkills - yeah, mess with that\nProof - yeah, mess with that\nBuild - yeah, mess with that\nWars - don't mess with that\nFreaking - don't mess with that\nWhores - don't mess with that\nCheating - don't mess with that\nG.E.D. - mess with that\nScience of mind - mess with that\nFamily - mess with that\nHip-Hop - we lovin that\n\n[Verse Two: Shuman]\nYeah, yo.. aiyyo, yo\nWho seein us, with an overdose level of free in us\nThey bring the heat to us\nThey don't really want the beat in us\nTake heed to us\nWhile they plottin and schemin to be deletin us\nBest believe in us, they not defeatin us\nThem Glocks wanna bust\nWith twenty-one shots to put the leak in us\nSo they can bloody the street with us\nWhat does it mean to us\nYou know what they need from us\nGive cream to us, hide the lies and deceit from us\nThat doesn't equal us\nWho's ready to get in the Jeep with us\nForm a fleet with us and take back the street with us\nMeet with us, drop bombs in the street with us\nNever saw it comin, attack on the sneak with us\nThus, they can't compete with us\nWe flow through your veins like DJ's\nWhen they cut, you'll be bleedin us\nI came with Kris to heat it up\nShowin my body's the temple, hip-hop is the lock\nNow put the key in us\n\n[Hook One]\n\n[Verse Three: KRS-One]\nTruth y'all, facts y'all, proof y'all, black y'all\nTime to check this map y'all, are we goin back y'all?\nLet's make a pact y'all, come together watch your back y'all\nStay in tact y'all, never whack - gimme dap y'all\nComin at y'all, headcrack y'all with the facts y'all\nPolice y'all, on the attack y'all if ya black y'all\nSo if this is fact y'all, when we rap y'all\nOver the track y'all, why we rap about crack y'all?\nThat's whack y'all, we trapped y'all\nHoldin the gat y'all just to kill another black y'all\nClak clak clak y'all, it's like that y'all\nKRS-One yo, let's take it back y'all, listen!\n\n[Hook Two]", "image": "https://images.genius.com/32bf9790e346029d7cf0897f83ab18fa.1000x1000x1.jpg"}], "artist": "KRS-One"}