{"songs": [{"title": "Adventure Time", "album": "YouWillRegret", "year": "2016-12-25", "lyrics": "[Intro: Ski Mask the Slump God]\nCan you smell what VR is cooking? (All-star!)\nBitch I am ready, ready like I got spaghetti\nHeisman\nSauce on me like some spaghetti\n(Ayy, ayy, ayy, ayy, ayy, ayy, ayy)\nOuch!\nOop, Good Intent on the beat!\n\n[Chorus: Ski Mask the Slump God]\nI be tiptoeing (I be tip!)\nI be sneaking geeking (I be sneakin')\nMet a bitch named Nicki (Met a bih' named!)\nMinaj with her mill meek it (Men mam mit um wit' um)\nYo name on my bullet (Your name on my)\nWhen I hit ya body get freaky (Hit that body)\nCheese up on me like Pizza Hut (Bodied a body)\nOr I'm at Chuck E Cheese for the weekend (Cheese!)\nI said I be tiptoeing (I be tip!)\nI be sneaking geeking (I be sneakin' geekin')\nMet a bitch named Nicki (Met a bitch named)\nMinaj with her mill meek it (Minaj wit' her mill)\nYo name on my bullet (Your name on my!)\nWhen I hit ya body get freaky (Hit my body)\nCheese up on me like Pizza Hut\nOr I'm at Chuck E Cheese for the weekend\n\n[Verse 1: Ski Mask the Slump God]\nOkay like (Water!) they just wanna ride my wave\nWoulda thought a nigga was a tidal (Water)\nNow she saying \"Papi cock me!\" (Water)\nShow her like an old western rifle (Water)\nDick make her sing like American Idol\nBut symptoms is drowsy like Nyquil (Hee, whoo)\nRetake my dick like recital (Retake it!)\nRetake my dick like recycle, ayy!\nIt get low, legs get crossed!\nDick get hard, on your mom!\nI'm King Kong! White girl on me\nLike Mick Jagger swag my walk (Swag!)\nWoulda thought a nigga, Ronda Rousey, how I beat the pussy\nCompetition lookin' lousy (Knock it out!)\nWhat's new pussycat?\nNew battle axe to your mouthpiece\nLike I be spitting fire\nLike I'm Harry Potter with a staff (Look at it!)\nYou need some new staff\n'Cause I'm on they ass just like some grass (Look at my garment!)\nBalmains sag off ass\nI was counting while I was skippin' class (Fuck math!)\nI be tiptoeing (Okay!), smoking on that stank pass gas (Bitch!)\nOkay like\n\n[Chorus: Ski Mask the Slump God & DIRTYFACESMOOK]\nI be tiptoeing\nI be sneaking geeking (Oh my god!)\nMet a bitch named Nicki (Ouh)\nMinaj with her (Ouh) mill meek it (Ayy, oh my God!)\nYo name (Ouh) on my bullet (On my!)\nWhen I hit ya body (Ouh) get freaky\nCheese up on me like Pizza Hut\nOr I'm at Chuck E Cheese for the weekend\nDIRTYFACESMOOK\nI be tiptoeing\nI be sneaking geeking (Oh my god!)\nMet a bitch named Nicki (Ouh)\nMinaj with her (Ouh) mill meek it (Ayy, oh my God!)\nYo name (Ouh) on my bullet (On my!)\nWhen I hit ya body (Ouh) get freaky\nCheese up on me like Pizza Hut\nOr I'm at Chuck E Cheese for the weekend\n\n\n[Verse 2: DIRTYFACESMOOK]\nI said I be tiptoeing\nWalking on the water like I'm Jesus (Bitch, Ski Mask and dirty face!)\nSipping on that wock (I be hardt)\nWith a stick on me like an old geezer\nWait, red beam on a choppa thats a night light\nHollow tips make a nigga go night night (Bye bye bye)\nIf you trip, knock 'em out like fight night\nSo bulldog trained and it might bite (ERRRRR)\nGo, I need more\nPick up grabba from the sto'\nDo her dance, slit her throat\nI'm like a stripper, keep a pole\nI'm drippin' you droppin'\nI'm poppin' you diggin'\nI only wanna talk like a nigga with feelings\nI drink too much Henny I need me a kidney\nStraight lines off my dick like I'm Bobbi and Whitney\nRemixing up work gets you hunnids and fifties\nTell me the truth you ain't got lie to kick it\nI'm really with niggas who really be with it\nHop on this wave you be drowning ya feel me?\nTake it or leave it\nI'll squeeze it if you sneeze it\nThis bitches is easy, I feel like I'm Weezy\nSneaking and geekin' I'm counting up tokens\nI'm ridin' around and I'm Chucky, I'm cheesy", "image": "https://images.genius.com/90dbd69cec596913e6823127fa5537d2.500x500x1.jpg"}], "artist": "Ski Mask the Slump God"}