{"songs": [{"title": "North Star (Jewels)", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Intro: Raekwon, talking to Popa Wu]\nYou know God, I just been, you know what I'm sayin'?\nDoing my regular thing man\nSo I'mma get back up with you though baby\nKnowhatI'msayin? You know you my nigga kid\nI'mma always come through for you baby\nYo man, you gotta understand, this shit is real though man\nAll the time, word\nYo man, that's you man\nYo peace Rae, peace God! (Arm Leg Leg Arm and Head)\n(We've got the powers to resurrect the dead)\nWhat's up baby? God damn, look at you man\nDamn God, I got a shit out you man\nMan, I done watched you man, since you was a little crumb-snatcher\nA little weed-hopper running around here man\nLook at you baby, you look good\n(We've got the powers to resurrect the dead)\nUnderstand, I watched you go through a lot of trials and tribulations\nBut you know something, like I used to always tell you baby\nA good listener's a good learner\n(G-O-D's my reality)\nI see you listened VERY well, understand?\n(I'm elevating strong and I'm gonna go on to the highest degree)\nYour time is coming baby\nSee sometime, it could be like, a rear view\nYouknowhatI'msayin? And people don't know when their blessing comes\nBut I watch you grow, man you is a very intelligent man\nMan, I watched you when I used to sit down and you would\nTrick me out my money shootin' dice, niggas is you crazy?\nHa ha ha ha ha ha!\n(G-O-D's my reality)\nCrazy you crazy man\nYo Rae, you remember that shit man?\nWhen we used to be down there in the hills and shit man?\n(I'm elevating strong I'm gonna go on to the highest degree)\nAnd you'd catch it, from Old Man Freed\nHe'd be yelling \"You little slick ass\"\nHa ha ha ha\nTalk to me baby, knowhatI'msayin'?\nHa ha ha ha\nI've been through all them things, man I'm watchin' you growin'\nBut remember one thing Rae like I used to tell you\nThe child you was is making you the man you is today\nAnd if you don't know where you came from baby\nYou DAMN sure know that you don't know where you going\nCan you see what I'm saying?\nKnow which way you traveling\n(We've got the powers to resurrect the dead)\nYou understand? And follow that destiny, follow the light\nAnd it'll set you free\n(Ohh, G-O-D's my reality)\nCause I've watched you baby\nYou my main man\nYeah\n(We're elevating strong and we're going on to the highest degree)\n\n[Verse: Raekwon]\nNow that could be the Wu-Tang production\nStart to knuckle up and, gun shots start to click the block's duckin'\nCould it be, and would it be, that we was babies\nCatchin', rabies, niggas seem to act crazy\nDay one, in my spot July the tenth\nI had a mint, stickin' up Devines hittin' them with nines\nI was toxie, from layin' up with roxies all night\nThis nigga bust a shot, lick my man's wife\nIt was havoc I contact the Abbot\nHe shook the shoulder though, then he passed the phat chrome automatic\nWe goin' to war, you know he had a 2 to 4\nHe would've did it for me fuck it, let's mosie\nScheming dough, with the P.L.O., wrapped on tight\nSayin' in my mic \"Yo we gotta go\"\nMy first impression was to ask some lessons\nQuestion, one, what made you even show your gun and blow the session?\nHe replied and rocked the green eye\nAnd yo, he started, yellin' \"Them niggas sellin' two for fives!\"\nBut he's a goner and I got my corner\nWhat, I'm feeding my babies, Cash Rules from morn' to dawning\n\n[Outro: Raekwon and Popa Wu]\nYeah, Rae baby\nFeedin' my babies, Cash Rules from morn' to dawning\nOnly God is the son of man\n(We've got the powers to resurrect the dead)\nI'll say it one time, and be certain that fake God does not exist\n(Ohh, G-O-D's my reality)\n(I'm elevating strong we're gonna go on to the highest degree)\nThis is why the universe, has itself balanced the scale\nOf divine knowledge, and it was measured by the portion\nOf solid knowledge\nNo man, can judge for another\nBut each man must weigh all facts and circumstances\nAnd find truth in his own judgment of righteousness\nSee, the way to evil, balance equality in no man\nFor no man is good and bad at the same time\nEither you good, or you bad", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}