{"songs": [{"title": "O.G.", "album": "The Gates Mixed Plate", "year": "2010-07-27", "lyrics": "[Intro]\nRaised in the middle of the land\nFull of barbeque stands and the brothers throw hands\nEverybody grittin' gettin' grands\nKansas City where the pretty women make you say, \"DWAMN!\"\n\n[Verse 1]\nKicks it like a donkey cause we famous\nWicked women want me cause I came up\nThis is were the homies trip and say what\nYo we from the show me get my money, puh-uh-pay up\nGot on my Five-O Ones and my gritter posture\nI fit her proper, if she papered I'm in her choppers\nLettin' her know this Nina dinner cost her\nAnd I'm finna squash her, so animal like someone better get her doctor\nThis boy's born and raised in KC, M.I.Z.Z.O.U!\nBut once in a while I hit the L.K. for ladies\n'Cause they straight be, in K.U!\nThen back to Kansas City where it's Gates all on they plate\nWe think about it and we crave it when we vacate\nI represent the MO and all the way to K state\nCall me Tech N9ne but teachers and students call me A. Yates\n\n[Hook]\nI'm hella fine like the food at Ollie Gates\nStrawberry baked bean mixed plate\nSo everybody just bounce rock skate\nCan't wait, O.G!\nOllie Gates (O.G.)\nLike Ollie Gates (O.G.)\nLike Ollie Gates (O.G.)\nOllie Gates (O.G, Baby!\n\n[Verse 2]\n(This is Kansas City)\nWe be scoutin', pretty young things yo we got ourselves in\nLike Don Dilla I'm a pop her blouse and\nGet her hot and ready listenin' to Roger Troutman\nRest In Peace baby, Seven this beat's crazy\nTeach babies we used to listen to this at least 80\nWe Kansas City steppin' no question\nWe reppin' 56 and 57 we know that if he jeffin' then he's shady\nK.C.K.'s Gates got the chicken wings\nThis'll bring, traffic where the people really put the clip in things\nSo you better be listening cause the don is sniffin' green\nThis is the mission get ya when you hittin' your nicotine\nThey got your money man, and you know that they ate\nSomething delicous yeah you know the tray say Gates\nThat's in the place were they come and getcha if the pay late\nBut I stay great because everyone's bangin' the A. Yates\n\n[Hook]\nI'm hella fine like the food at Ollie Gates\nStrawberry baked bean mixed plate\nSo everybody just bounce rock skate\nCan't wait, O.G!\nOllie Gates (O.G.)\nLike Ollie Gates (O.G.)\nLike Ollie Gates (O.G.)\nOllie Gates (O.G, Baby!)\n\n[Verse 3]\nNorth side where is you? (EY!)\nSouth side where is you? (EY!)\nEast side where is you? (EY!)\nWest side, what it do? (EY!)\n(TECH N9NE!)\nAin't nobody's sauce like this\nAin't no other barbeque boss like this\nThem Fiorellas might cost quite a bit\nYeah we do it but the fire ain't brought like this\nO.G. told me go see\nIf them other cities Q is G.O.O.D\nBut he knew that I would find out slowly\nJust like my KC barbeque they cannot hold me, A. Yates\n\n[Hook]\nI'm hella fine like the food at Ollie Gates\nStrawberry baked bean mixed plate\nSo everybody just bounce rock skate\nCan't wait\nNow everbody say\nLalalalalalalalalala\nLalalalalalalalalala\nNow everybody say\nLalalalalalalalalala\nLalalalalalalalalala", "image": "https://images.genius.com/7efd1fa33fbd953a08bc1d44fae9f6a7.600x600x1.jpg"}], "artist": "Tech N9ne"}