{"songs": [{"title": "Hate On Me", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "[Verse 1: Soopafly]\nEh yo, if rappin' was a bitch you'd have no pussy\nMaybe tongue kissin', but still no pussy\nLookin' at me dumb I'll slap you so dizzy\nSuppa so busy cockin' the 4 fizzy\nMad cause I'm too fly, and I pumped your ho\nCrushed your flow, you got jealous, Club Nouveau\nI sensed the hate, I used my optical\nYou was too close around when I pocket doe\nFirst came the wishin', then came the bitchin'\nWanna know the secrets comin' from the kitchen\nI was fine dinin', you was eatin' chicken\nI'll bust a bad ho, nigga take your pickin'\nLike a slut callin' bitches on my cell phone\nBut my bitches, try to take my fly bitches\nI ain't just trippin', I can't trust niggas who ain't us\nBringin' niggas who can't bust\nI'm A+ wid it, I'm anxious to crush ya\nHalf tustla mixed with you just a busta\nBitch ass niggas get me rich fast quicka\nNow don't tricka this Supa ass kicka\n\n[Hook]\nWhy do you hate on me\nCause I don't be trippin' off you\nMy image is stuck on \"G\"\nTry to fuck with me this year...\"Get the 'beep' outta here!\"\nI'm so up on my shit\nThese bitches ain't gettin' my grip\nSo I still remain a \"G\"\nBut why do you hate on me\n\n[Verse 2: Damani]\nHow you gone hate on me\nAnd I'm that nigga that ride beats smoother than Ron Isley\nTalkin' bout fuck Damani but steady eyein' me\nSteady tryin' to see how good sex with me could be\n\"Why won't you let me fuck?\"\nAnd I'm the best thing goin', and you the best thing hoin'\nPlus we got you on tape givin' head in slow motion\nUndercover ho's be real soft spoken\n\"Why would you slash my tire?\"\nAnd I got stock in Goodyear, bitch I'm all good year\nTryin' to fuck up my clutch so I'm forced to change gears\nDarkskin, go-tee with no beard\nI change ho's like I change clothes\nYoung devil in the city o' angels\nKeep it ghetto like cups with staples\nLive from L.A. gettin' head from Rachel. Now...\n\n[Hook]\n\n[Verse 3: Kurupt]\nWhy do bitches blow dicks?\nI don't know that but I can tell you dis, you simple trick\n\"Now you get it all you want.\"\nWe roll joints we don't fuck with blunts, fuck a blunt now\n\"Some niggas is worse than ho's\"\nHoldin' somethin' on your chest let it go\nI'll make a bitch blow balls like a ball and sing that song(echoes)...but naked\nMost o' y'all niggas be break and hatin' records\nThe most hatin' done in 8.5 seconds\nWhy you hatin' Snoopy, you hate Nate and hate me\nWhy you hatin' Soopa and hatin' on Warren G\nWhy you hatin' Roscoe, why you hate Damani\nCause he wanna fuck Armani and don't wear Armani\nHatin' Goldie and hatin' Tray Deee, Tray Deee is like fuck'em if they hatin the \"G\"\nFuck y'all\n\n[Hook]", "image": "https://images.genius.com/32f5907a0f69c52bd9d20ec857b3f90c.944x944x1.jpg"}], "artist": "Kurupt"}