{"songs": [{"title": "Ride On / Caught Up!", "album": "The Best of Snoop Dogg", "year": "1998-02-24", "lyrics": "[Intro: Kurupt & (Snoop)]\nBack by popular demand\nDogg Pound Gangstaville (DPG)\nWhere all the real G's at? (DPG)\nWhere the OG's at? (DPG)\n\n[Verse 1: Kurupt]\nA bitch is a bitch, whether she poor or rich\nShe still eatin' a gang of dicks\nIt don't matter what you do or say\n'Cause bitch you can't change my feelings no way\nI been across the whole U.S.A\nSame ol' hoes on different days\nJust ask my big homeboy Snoop de Snoop\nBitch you ain't cute, with all that (woop de woop)\nI might just rock ya, I ain't afraid to blast\nI might rock a fella like Damon Dash\nGrip the heater and slap your ass\nCock it back, automatic clap your ass\nNow this is how a gangster mash out\nThe homies in the Coupe, me and Snoop in the glass house\nBouncin (bouncin) bouncin (swervin)\nBlaze up a whole ounce and get to rammin' with the cocked cannon\n\n[Hook: Snoop & (Kurupt)]\nYeah, and all my niggas say... ride, ride on\nYeah, and all the homies say... ride on\nYeah, and all the bitches say... ride on\nYeah, and all the riders say... ride on (Don't get caught up)\nYeah, and all my niggas say... ride, ride on\nYeah, and all the homies say... ride on\nYeah, and all the bitches say... ride on out\n\n[Verse 2: Snoop Dogg]\nI'm out to paper count the paper, bump some bitches and move\nI take a trip with my click on a three day cruise\nBank a corner in the fo', sittin' low, gettin' low\nNow we headed to the sto' in the fo', hoes holler\nTop dollar with the gold flea collar\nDippin in my blue Impala\nThey say Snoop Dogg is a fool\n'Cause he got the bitches and the little homie sellin' weed up outta high school\nI never ever break the law, I just bend it\nKeep everything splendid, that's how I intended\nClass is in session, you might get suspended (shhhh)\nIf you don't shut the fuck up and listen for a minute\nI been in it for life, with two kids and a wife\nWith no tattoos, just stress and stripes\nSo, I'mma do what I feel and do what I like\nBut I won't go to sleep without my heater at night (Ride on)\n\n[Hook: Snoop & (Kurupt)]\nYeah, and all my niggas say... ride, ride on\nYeah, and all the homies say... ride on\nYeah, and all the bitches say... ride on\nYeah, and all the riders say... ride on (Don't get caught up)\nYeah, and all my niggas say... ride, ride on\nYeah, and all the homies say... ride on\nYeah, and all the bitches say... ride on out\n\n[Verse 3: Kurupt]\nNigga, gimme everything you got\nFrom your hat to your contacts, T-shirt to your socks\nDogg Pound affiliate? Hell naw, nigga\nI'm certified branded—see the paw, nigga?\nMash in gray and blue all day\nAll night, all heated with heaters, Mac-11's, nine millimeters\nWhat up, Big Nate?\nI got a bitch that gobble up dicks like steak\nShe lives upstate, and I don't think\nNann one of those bitches is proper, stash the chopper\nDPology (DPG) but first call Snoop\nWhat up, big homey? Niggas with the swoop\nThe homie jumps in, whips out the four pound\nWhen we get there, we shakin all motherfucker down\nIt's what I had in mind, let's get paid\nHit the spot just like a raid, one of the homies got a gauge\nCome on\n\n[Hook: Snoop & (Kurupt)]\nYeah, and all my niggas say... ride, ride on (Certified)\nYeah, and all the homies say... ride on\nYeah, and all the bitches say... ride on\nYeah, and all the riders say... ride on (Don't get caught up)\nYeah, and all my niggas say... ride, ride on (Certified)\nYeah, and all the homies say... ride on\nYeah, and all the bitches say... ride on out\n\n[Interlude: Snoop Dogg]\nLet me holler at y'all for a minute, man\nI mean this game is gettin' real deep\nWe got niggas that be misrepresentin'\nI mean, motherfuckers, you know, thinkin the DPG\nIs a motherfuckin football game or a football team or somethin\nNiggas walkin on and shit like they free agents\nAnd just leavin when they want to\nNigga, this ain't no game, this is a motherfuckin way of life\nDPGC, Dogg Pound Gangsta... nigga!\nThe fuck wrong with these niggas, man?\nNiggas be straight tryin to put they little twist down (holla at em)\nBut you know we tryin to stay two steps ahead of the game baby, y'know?\nLet me holler at y'all for a minute, especially YOU\n\n[Verse 4: Snoop Dogg]\nYou done stepped in some Dogg Shit, check your shoes\nNigga, this ain't Hollywood, the House of Blues\nIt's the Dogg House, so regroup your troops\nAnd tell em... it's Kurupt and Snoop\nFuck your crew, it's on, I take your Brougham\nIt's Don Corleone in the chronic zone\nI turn your dubs into nickels, while I'm chillin\nI melt your rhymes into icicles, while I'm killin\nSell em, I tell em, Kurupt, West up\nI know you feel like, givin it up\nWe can't stop, won't stop, what foe\nCause every other day another nigga tryin to pull a dulo\nYou know, when I was fuckin with the hood\nIt was all bad, thought it was all good\nA nigga had to take a breather\nNow I'm Living Single, like Khadijah, 'cause they'll squeeze ya\nFuck a feeding fish\nI put my dick in your bitch and make a wish, ha ha\nNigga, that's gangsta shit, with the gangsta twist\nYeah, Dogg Pound Gangsta...", "image": "https://images.genius.com/ec5f41587b152c503ded03e664eede75.220x216x1.jpg"}], "artist": "Snoop Dogg"}