{"songs": [{"title": "Only One", "album": "Kristyles", "year": null, "lyrics": "*only on Front Page Entertainment 12*\n\nIts time for me to get on and represent the Bronx\nSo lets set this shit off like this\n\nUhh, now check it\nUnderground verbal hip hop you selected\nBy only a few, this type of artist is bought\nSo like Bartles & James thank you for your support\nIt's time for all this chit-chat to skit-skat\nArent you tired of hearin ple-ple-ple-ple-pla\nRase the level of your listenen pleasure a letter\nAnd let the teacher put these new jacks under pleasure\nMy first name is hip hop no doubt\nMy last name is run with me breath for breath\nYes I'll blow your lungs out\nBLOW! And cut your tongue out\nAnd use that shit to clean my rug out\nI ain't even start to bug out\nSomebody requested for the teacher to get active\nCuz of all these rappers I look good to battle\nIm unattractive when actively in your brain cavity\nYou be singin 1-2-3, and your family B-D-P\nI'm Total 'Can't you see'\nI took it there\nYou bee sayin with your swollin eye\nDamn it just ain't fuckin fair\nBut your crew told you what was up\nYou just didn't give a fuck\nMy lyrics are intact\nSo my picture you can pin it up\nTake me out? Give it up your late\nI rocked the 9-1-7 when it was 7-1-8\nI'm a juvenile deliquent group home lord of the state\nThe truth about the matter is that I feel great\nI'm comin in the form of the mind-bender bar tender\nServin that lyrical-net serve your chest then send a\nRemember battlin MC's Im not always doin\nCuz we need new rappers and careers I always ruin\nWhat are you pursuin, who in the hell want this friction\nI'll volt your scene and make you drum machine start blitchin\nSwitchin my diction, I'm quick you need a fixin-\nIm quick to turn you off like the light in a kitchen\n\nChorus -sample/scratching of-\nCuz Krs One means simply one Krs\nThats it, thats all solo, single the one no less\n\nVerse\nI do my dirt and I keep it to myself\nI don't speak it on record and to no one else\nYou think about...\nWhen you do crimes you talk about it\nHELL NO!  You keep that real shit on the low\nCuz prison ain't a place you motherfuckers wanna be at\nHalf of you motherfuckers would turn trick\nBELIEVE THAT!\nYo I can see that, all you ask is where the weed at?\nYou vision is as far as whereever you throw the seed at\nLook at Malcolm X and try to be that\nOr get lost if you can't pick up where Malcolm X left off\nDon't you know were listened to by judges and lawyers\nWhen you go to court they play your album for ya\nThen you turn into Tom Sawyer fiction\nBeggin a judge to just listen sayin...\nIf you listen to my album twice, the positive message is....\nThey shut yo ass up and give you life\nHad you hah a wife instead of bein a lover\nThe court would of seen you as a family man wit some structure\nBut you is a wild brother, black women you can't respect em\nNow you catchin wreck in your rep\nNegativity never had no pull in jail\nYeah, its positivity that they hail\nBut you fail, cuz red books you can't read em\nYour people you mislead em\nYour people you mistreat em\nMislead em for fun...my name is KRS ONE!\nKRS ONE......KRS ONE\nReal Headz they down wit us\nYeah, Krs One representin\nWit outta fraction of a motherfuckin doubt", "image": "https://images.genius.com/2333a9607025ac4cc5a6777157dbce5f.220x220x1.jpg"}], "artist": "KRS-One"}