{"songs": [{"title": "Immortal", "album": "4 Your Eyez Only", "year": "2016-12-09", "lyrics": "[Intro]\nAwwwww...haha\n\n[Verse 1]\nNow I was barely seventeen with a pocket full of hope\nScreamin' \"dollar and a dream\" with my closet lookin' broke\nAnd my nigga's lookin' clean, gettin' caught up with that dope\nHave you ever served a fiend with a pocket full of soap?\nNigga I can tell you things that you probably shouldn't know\nHave you ever heard the screams when the body hit the floor?\nFlashbacks to the pain, wakin' up, cold sweats\nSix o'clock in the mornin', gotta hit the BowFlex\nGet my weight up on the block, keep watch for the cops\nGod they love to serve a nigga three hots and a cot\nNowadays crime pays like a part time job\nAnd the drought got me prayin' for a Carl Thom vibe\nSummer Rain come again\nNumb the pain 'cause it's hard for a felon\nIn my mind I been cryin', know it's wrong but I'm sellin'\nEyes wellin' up with tears\nThinkin' 'bout my niggas dead in the dirt\nImmortalized on this shirt\n\n[Hook]\nReal niggas don't die\nForward with the plot\nOne-Seven-Forty-Five\nForm at the plot\nReal niggas don't die\nForm on the block\nReal niggas don't lie\nForm in the plot\nMy niggas don't die\nForm on the block\nReal niggas don't die\nForm on the block\nReal niggas don't die\nReal niggas don't die\n\n[Verse 2]\nHave you ever seen a fiend cook crack on the spoon?\nHave you ever seen a nigga that was black on the moon?\nHave you ever seen your brother go to prison as you cry?\nHave you ever seen a motherfuckin' ribbon in the sky?\nNope, all I see is that C.R.E.A.M nigga, that green\nI'm a black king, black jeans on my black queen\nAnd her ass fat, too fat for a flat screen\nI'm the type of nigga make the whole fuckin' trap lean\nKingpin nigga, put wings on a crack fiend\nIf they want a nigga, they gon' have to send a SWAT team\nAnd I'm goin' out like Scarface in his last scene\nA legend, what that mean—?\n\n[Hook]\nReal niggas don't die\nForward with the plot\nOne-Seven-Forty-Five\nForm at the plot\nReal niggas don't die\nForm on the block\nHood niggas don't lie\nForm in the plot\nMy niggas don't die\nForm on the block\nReal niggas don't die\nForm on the block\nReal niggas don't die\nReal niggas don't die\n\n[Outro]\nTo die a young legend or live a long life unfulfilled\n'Cause you wanna change the world, but while alive you never will\n'Cause they only feel you after you gone, or I've been told\nAnd now I'm caught between bein' heard and gettin' old\nDamn, death creepin' in my thoughts lately\nMy one wish in this bitch, \"Make it quick if the Lord take me\"\nI know nobody meant to live forever anyway\nAnd so I hustle like my niggas in Virgini-A\nThey tellin' niggas, \"sell dope, rap or go to NBA\"\nIn that order, it's that sort of thinkin'\nThat been keepin' niggas chained at the bottom and hanged\nThe strangest fruit that you ever seen, ripe with pain, listen...", "image": "https://images.genius.com/37291e01ab860f66509cc60d0f0c75bf.1000x1000x1.jpg"}], "artist": "J. Cole"}