{"songs": [{"title": "U Guessed It", "album": "Sorry 4 The Wait 2", "year": "2015-01-20", "lyrics": "[Intro]\nYeah\nMy lil brother Capo in this bitch with me\nHe's on that moonrock\nShit be gettin' all in your mouth – pause\nNigga!\nI'm sorry for the fucking wait\nWas busy\nRacing Ferraris with lil Reginae\nThat's gangsta\nYou know I always come in second place\nYou hatin'\nIt's written all over your fuckin' –\n\n[Hook]\nBitch, you jealous\nWoo\nAnd I was right, yeah, haha\nBitch, you jealous\nStuntin' on niggas\nStunt, stunt – The shit niggas don't like\nTell a fuck nigga – \"Bitch, you jealous\"\nI'm Sorry 4 The Wait, apologetic\nBitch you jealous\nNow give us our cash and our credit\n\n[Interlude]\nPop! Hah\nSorry for the –\n\n[Verse]\nRiding 'round like Pablo\nStill talking that blanco\nMy Nina sing soprano\nSo we gon' leave on a high note\nCome out my shell like Rafael\nAnd crack yours like a taco\nLil Wayne tougher than John Wayne\nMake him change his name to John Doe\nIt's me and my lil brother Capo\nLil Marly G and my bottom bitch\nIf I'm falling, it's bottomless\nIf I'm tripping, it's a power trip\nHer pearl tongue like the pearly gates\nAnd with that said, I climb the fence\nMy other bitches gotta ride the bench\nAnd with that said... bitch you jealous\nI'm fly like my dreadlocks propellers\nI think I should headline Coachella\nMy woman a Queen like Coretta\nAnd nigga you sleep with the Devil\nI couldn't be Junior forever\nI don't mean to ruffle your feathers\nBut I had to spread my wings\nAin't trying to get lemon-peppered\nGot too many pistols, too many issues\nToo many mistakes, too many miscues\nOnly made me better, it turned me into\nThe man I am today, I'm new and I'm improved\nI got my shit right, it's just you and a tissue\nSuit yourself because this suit is a rental\nNow the snow is just coming in\nLike I broke a window to an igloo\nSlow a bitch down like \"Un momento\"\nI'd rather get screwed than scrutinized\nI'd rather get used by a cutie pie\nIf she ain't fucking it's Uber time\nI'd rather be advised than supervised\nYou do the math, we do the numbers\nWe pour champagne and expensive wine\nIn water guns and shoot each other\nI get high, meditate like a monk\nPreposterous when I get drunk\nAnd my goons is wilder than Gronk\nMy do's is as bad as my don'ts\nMet a kinda-cute bitch with a donk\nAs long as the bitch got a donk\nAnd I smell like; pussy, money, and weed\nShe say \"Ooh, I like your cologne\"\nThe last niggas tested us flunk\nSo please study hard, study long\nKill your wife, then take the bitch phone\nAnd text you to please hurry home\nAnd the rain drops turn into blood\nLook like you just come in from a storm\nAnd if all pussies come with walls\nI hope you run into your own\nNigga\nI come with that heroin flow\nI come with that never before\nMy CMB days are dead\nI ain't worried 'bout ghost\nI married the MOB, we divorced\nHoo, and all that shit dead without me of course\nIt's nothing; a zombie, a corpse\nYou burnt yourself and was supposed to pass me the torch\nFuck it, I'll see you in Forbes, nigga\nI'm sorry for the fucking wait\nWas busy, searching my calendar for better days\nI found 'em, you either turn the page or tear the page\nY. M., Young Money; never age\n\n[Hook]\nBitch, you jealous, woo\nAnd I was right, yeah\nTell a fuck nigga \"Bitch, you jealous\"\nStuntin' on niggas\nStunt, stunt; the shit niggas don't like, yeah\nBitch you jealous\nI'm sorry for the wait, apologetic, hey\nBitch you jealous\nNow give us our cash and our credit, hey\n\n[Outro]\nPop!\nWait", "image": "https://images.genius.com/c84ee812d9e99028d560054b386d4d9d.500x500x1.jpg"}], "artist": "Lil Wayne"}