{"songs": [{"title": "Birthday", "album": "Category F5", "year": null, "lyrics": "[Intro]\nBirthday (birthday)\nBirthday\n\n[Hook]\nSomebody in here it's your birthday (it's your birthday) (x3)\nEverybody move like it's your birthday\nBirthday? Mama dance on your birthday\nMama gon' break it down on your birthday\nBirthday? (Birthday) Birthday? (Birthday)\nBirthday? (Birthday) Birthday? (Birthday)\n\n[Verse 1: Twista]\nCelebrate girl, nobody can compare wit'cha\nBirthday in January so she a Aquarius\nThey say the pussy got +Miles+ like Darius\nBut she look better than most chicks in her area\nShawty don't want a lame, she only like G's (like G's)\nOnly fucking with the thugs in the white tees (white tees)\nBirthday February (February) sign Pisces (Pisces)\nInto fish-scales and Long Island Iced Teas (Iced Teas)\nThen right after January and February\nWas a girl who was an Aries who always be smoking berry (berry)\nHad style show but her stuff's so hairy (hairy)\nAss so fat (fat) earrings canary (canary)\nNow break it down with your friends, you a Taurus\nI heard you was fit to a Benz from a Taurus (Taurus)\nI see balloons and the women looking gorgeous (gorgeous)\nSomebody get down for me when you hear the chorus (chorus)\n\n[Hook]\nSomebody in here it's your birthday (it's your birthday) (x3)\nEverybody move like it's your birthday\nBirthday? Mama dance on your birthday\nMama gon' break it down on your birthday\nBirthday? (Birthday) Birthday? (Birthday)\nBirthday? (Birthday) Birthday? (Birthday)\n\n[Verse 2: Twista]\nShe look so good she got me acting like I'm finna die (finna die)\nThe type of chick so thick she catch the other women eye (women eye)\nKnew she was freaky when she said she was a Gemini (Gemini)\nShe wanna do something freaky with me, her friend and I (friend and I)\nKnow ma speaking Spanish, I do not understand her\nBut I love the way she moving the fatty like she a dancer (she a dancer)\nBirthday in June, I'm trying to get Cancer (get Cancer)\nSmoke up the room like I'm trying to get cancer (get cancer)\nShawty grown now, she's so, Leo\nOnly 19 on the G-O like she 3-0 (three-oh)\nOn the grind to be a big CEO\nShe the one taking me when I got to see my P.O. (P.O.)\nHer face is fine but I gotta let her know (her know)\nShe's so fly down south like where the birds go (birds go)\nThat's the type of body a baller wanna splurge fo' (splurge fo')\nAnd she drip slow, cause she a Virgo (Virgo)\n\n[Hook]\nSomebody in here it's your birthday (it's your birthday) (x3)\nEverybody move like it's your birthday\nBirthday? Mama dance on your birthday\nMama gon' break it down on your birthday\nBirthday? (Birthday) Birthday? (Birthday)\nBirthday? (Birthday) Birthday? (Birthday)\n\n[Verse 3: Twista]\nBorn October 12th, yeah she a Libra\nPussy so good that I could never leave her\nI like the way she roll my cannabis sativa\nShawty you bad, here, take my Visa\nKickin' an extra-ordinary flow\nShe was original within her swagger like a married hoe\nI be the lyrical, I wanna stab her with my torpedo\nShe was on top of the stick on my body cause she was a Scorpio\nThere was a woman I could remember a Sagittarius\nShe was the first to let me touch her pubic area\nWe was young, I'm the one that made her cherry bust (bust)\nNow that we grown I still be in that hairy stuff (stuff)\nI'm the illest fuckin rapper born (rapper born)\nShowin love to a December dimepiece cause she my favorite Capricorn (Capricorn)\nIt's your B-day let me cut that cake (that cake)\nCome out them pants and let me cut that cake\nSomebody\n\n[Hook]\nSomebody in here it's your birthday (it's your birthday) (x3)\nEverybody move like it's your birthday\nBirthday? Mama dance on your birthday\nMama gon' break it down on your birthday\nBirthday? (Birthday) Birthday? (Birthday)\nBirthday? (Birthday) Birthday? (Birthday)", "image": "https://images.genius.com/ab06dbf0ce99f56ef5472a2ab819fd5f.675x675x1.png"}], "artist": "Twista"}