{"songs": [{"title": "Good Life (Live From VH1 Storytellers)", "album": "VH1 Storytellers", "year": null, "lyrics": "Or I make the life\nI was very rich\nAlready\n\nBut if I think back to when I was making the College Dropout, thinking was this what I expected?\nI mean, I didn’t expect the losses and you expect everything to work out well\nBut I expected real life\nAnd then I suffered the worst pains to help me to grow\nSo those experiences, I never ask to take them away from me\nBecause they’re all in God’s plan and help make me the man I am today\nAnd help make me more of a soldier and a vessel\nBecause if I hadn’t suffered those losses, I might be scared or too scared to fight the war on traditional thinking\n\n[Intro]\nBetter than the life I lived\nWhen I thought that I was gonna go crazy\nAnd now my grandmomma\nAin't the only girl callin me \"baby\"\nAnd if you feelin me now\nThen put yo' hands up in the sky, let me hear you say\nHeyy, heyy, like we always do at this time\n\n[Hook]\nI go for mine, I gots to shine\nNow throw yo' hands up in the sky\nI, gotta go for mine, I gots to shine\nNow throw yo' hands up in the sky\nImma get on the TV momma and I'mma\nYo, I'mma put shit down\n(Ayy) ayyy (ayy) ayyy\n(Ayy) ayyy (ayy) [I'm good]\n\n[Verse 1]\nWelcome to the good life, where homies who sell D\nWon't even get pulled over in they new V\nThe good life, let's go on a living spree\nMan, they say the best things in life are free\nThe good life, [it feel like Atlanta\nIt feel like L.A. it feel like Miami\n[It feel like N.Y. summertime Chi\nAhhhhh! Now throw yo' hands up in the sky\nSo I roll through good\nY'all pop the trunk,I pop the hood - Ferrari\nAnd she got the goods\nAnd she got that ass, I got to look - sorry!\n\n[Bridge]\nYo it's gots to be cause I'm seasoned\nHaters give me them salty looks - Lawry's\n50 told me [go 'head, switch the style up\nAnd if they hate then let 'em hate, watch the money pile up\n\n\n[Hook]\n\n[Verse 2: Kanye West]\nWelcome to the good life! Where we like the girls who ain't on TV\nCause they got mo' (ass than the models)\nThe good life, so keep it comin' with the bottles\nCause she feel booze like she bombed at Apollo\nThe good life, it feel like Philly\nIt feel like D.C. it feel like D.C\nIt feel like V.A. or the Bay or Yay\nAyy!\nHomey tell me what's good\nWhy I only got a problem when you in the hood?\nLike I'm new in the hood\nThe only thing I wish, I wish a nigga would\nHe probably think he could\nBut, but, I don't think he should\n50 told me, go 'head, switch the style up\nAnd if they hate then let 'em hate and watch the money pile up\n\n[Hook]\n\n[Verse 3]\nHave you ever popped champagne on a plane, while gettin some brain\nWhipped it out, she said \"I never seen Snakes on a Plane\"\nWhether you broke or rich you gotta get this\nHavin money's not everything not havin it is\nI was splurgin on Tryst, but when I get my card back\nActivated, I'm back to Vegas\nI always had a passion for flashin\nBefo' I had it, I closed my eyes and imagined\nThe good life\n\nEverybody wants the good life\nWelcome to the good life\nLet me hear you say:\nHeyy, heyy, ooooh I'm GOOD!\nBetter than the life I lived\nWhen I though that I was gonna go crazy\n\n[Hook x3]", "image": "https://images.genius.com/3c0aee76b72a24d6c01e44a72adb029c.1000x871x1.jpg"}], "artist": "Kanye West"}