{"songs": [{"title": "Fire", "album": "Anarchy", "year": "2000-07-29", "lyrics": "[Intro]\nBusta Rhymes, 2000\nWe got the fire now\nCome on!\n\n[Verse 1]\nHey, come on, hey, whether it's for more or less\nYou best believe Busta Rhymes, more flavor than all the rest\nFrom all the mess, hardcoreness from all the stress\nGotsta get this flawless flow from off my chest\nWho's responsible for the impossible flow?\nAin't a thing in the world that ain't copable, so, so\nI make you anticipate great\nType shit real live niggas appreciate\nTo the utmost I pack toast, keep the gat close\nRun niggas to the island of Patmos\nAfter the gun burst, quench my blood thirst\nWe will be leavin' you much worse in one hearse\nYo, now we embellish, fuck the jealous\nAnd embark on niggas, now what you gon' tell us?\nSkydiver, short circuit just like a live wire\nAnd give it to niggas because we got the FIRE!\n\n[Chorus]\nAll my people in the place (Iyyiiiyyiiiiyyiiiiyyiiiii)\nJust put your hands up in the air\nAnd while we blow the spot and keep it hot\nYou got that FIRE!\nJump, shake, bounce when we come to you turn you out\nIt's Flipmode Squad that keeps on right your rightest place\nWe got that FIRE!\n\n[Verse 2]\nAyo, rock until I'm gone\n'Til the party's over and they start turnin' the lights on\nType of shit, my entire whole crew be on\nLeave the bullshit, so keep movin' on\nNo, I ain't havin' it\nWhile you grabbin' it, my flow is immaculate\nPassionate when it comes to the fire that you have to get\nThen I tackle it and kill like the jackal and gaffle it\nRob niggas and give it to the church so they can raffle it\nNow you can't distinguish how\nI relinquish flow in broken English\nWitness how we stay hot and how we keep it scorchin'\nWomen flossin' blow the spot often\n(WHAT) niggas say (WHAT) you need to calculate\nRe-evaluate your shit talk 'fore we retaliate\nMarinate, when I used to hustle and carry weight\nAnd bust up niggas like you would have flee the state\nHits for niggas like y'all, I hits for only when it counts\nBlack on the set and make motherfuckers bounce\nConnected the raw types of shit\nTo make your bitch bug and make niggas pull out quick\nY'all niggas wack, yo; I stack dough, and pack a rap show\nAnd then let all of my niggas in the back door\nAnd let the spot short circuit just like a live wire\nAnd give it the niggas because we got the FIRE!\n\n[Chorus]\nAll my people in the place (Iyyiiiyyiiiiyyiiiiyyiiiii)\nJust put your hands up in the air\nAnd while we blow the spot and keep it hot\nYou got that FIRE!\nJump, shake, bounce when we come to you turn you out\nIt's Flipmode Squad that keeps on right your rightest place\nWe got that FIRE!\n\nFIRE!", "image": "https://images.genius.com/c03e10c88fa343cd2e7c18112c468983.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}