{"songs": [{"title": "Everything I Am SNL Freestyle", "album": null, "year": null, "lyrics": "[Hook]\nDamn, here we go again\nCommon passed on this beat, I made it to a jam\nNow everything I'm not, made me everything I am\nDamn, here we go again\nPeople talking shit, but when shit hit the fan\nEverything I'm not, made me everything I am\n\n[Verse 1]\nI'll never be picture perfect Beyoncé\nBe light as Al B., or black as Chaun-cey\nRemember him from Blackstreet, he was as black as the street was\nI never be as laid back as this beat was\nI never could see why people reach a\nFake ass facade that they couldn't keep up\nYou see how I creeped up\nYou see how I played the big role in \"Chicago\" like Queen Latifah\nI never rock a mink coat in the sum-time like Killa Cam\nOr rock some mi-mink boots in the winter time like Will.I.Am\n\n[Hook]\nLet me know if you feel it man\nI just messed up on my rap, live TV like damn\nBut hey, hey here we again yeah\nHe-here we go again\nPeople talking this but when this hit the fan\nEverything I'm not made me\nNow break it down\n\n[Verse 2]\nYo, off the top of the dome, dome\nShout out to Chi-town where I call home\nCoast to coast, LA to New York to London to Paris\nShout out to Barry\nThat's my security guard\nCause my rhymes is hard\nListen up I got to praise god\nFor the number one spot that I got cause I'm hot\nAnd everything I am cause of everything I was not\nCause I never was shot\nThey said I'd never make raps to hit the block\nOr never sold a crack rock\nBut now everybody on the jock\nAnd I got the game lock\nEverybody bring it back\nWith the rap I don't know how to act I go crazy\nBackstage, Beyoncé and Jay-Z\nAnd LeBron and I'm gone\nI'm the don, number one\nKeep going going on\nGot to keep it going on\nI keep goin' goin' goin' yeah\nI keep flowin' flowin' flowin'\nYo, I meant to freestyle, I meant to mess up\nY'all meant to dress up\nAy yo, I'm fresh up\nWho fresher than Mr. West uh\nNo-no-no-no-nobody I'm talking all y'all right now\nThe blogs, the blogs\nYo, they try to dis me\nBut they can not see I'm on Saturday Night getting busy\nY'all wish ya can be me, hey mama can you see me?\nHey daddy can you see me?\nI'm rocking on your TV\nY'all thought they'd never let me back in NBC, see?\nLa La La Laaaa", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}