{"songs": [{"title": "Pump It Up", "album": "This is Not a Test!", "year": null, "lyrics": "[Missy Elliott] {Nelly}\n\nHey yo, Nelly! This is fire\n{What you talkin' about, girl?}\nLet's make it hot for the clubs\n{Missy!} Wooooo!\n\n(*\"This is fire!\" cut and scratched*)\n\n[Verse 1 - Missy Elliott]\nDown South girls got them real BIG BUTTS\nReal big butts make ya man wanna look (OH!)\nBack it up, flip it up, skinny girls - eugh!\nLove my guts, so fuck a tummy tuck\n(Oh yeaaah?) Yeah! I shakes my butt\nI shakes my gut like \"yeah, bitch what?\"\nYeah I likes it rough, tough\nAsk your man how I'm good in handcuffs\nMe and Nelly came to rock the club\nPack the place, don't push or shove\nOut of the club, straight to the crib\nI'll let you know if the sex was good\n\n[Hook - Missy Elliott] + {Timbaland}\nPump it up! {Show me love, G}\nPump it up! {Let me see what you working wit'}\nPump it up! {Let me see those big-ass hips}\nPump it up! {Pump it up}\nThis is how me and Nelly pump it up\nPump it up! {Show me love, G}\nPump it up! {Let me see what you workin wit'}\nPump it up! {Let me see those big-ass hips}\nPump it up! {Pump it up}\nC'mon\n\n[Verse 2 - Missy Elliott]\nDOWN SOUTH PLAYERS! WE GOT THAT FIRE MADE!\nGet up on my booty, tutti-fruiti on the rooty\nI'm a thick chick, skinny girls act snooty\nNo matter what your size, my big thighs'll do my duty\nLook at the way my rump shake like a movie (SAY WHAAAT?)\nSee my tight jeans and the coochie\nSpend a little looty, you gotta WORK for the booty (Yup)\nMe and Nelly HOT ON THE TRACK (Track!)\nNelly, can't no-one EVER TOP THAT (Top that!)\nNiggas we came to rock the club (C'mon!)\nDJs better Pump It Up\nMotherfuckers need to back it up\nCause we gon' tear the roof off the club\n\n[Hook]\n\n(*beat stops, needle crackling*)\n\n[Missy] *talking*\nYou know, Down South chicks got big asses\nAnd we a little heavy sometime, but when\nYou're from the South, we don't call that\n\"fat\". We call that \"big-boned\". Fo' sho\n\n(*scratching, beat starts again*)\n\n[Verse 3 - Nelly]\nYeah, ma! I heard you like the magic stick\nMe? I got the gadget stick, it's like \"Go, go, gadget dick\"\nYou know, make you climb the walls and shit\nI make her wanna press pause and shit\nWalk up in the party, girls swingin' they panties\nThey was doing that before I had them brandys\nI get a little freaky when I'm in my yammy\nI may act a little fresh but I still got manners\nIt's Nelly, felony, and Missy Misdemeanor\nBoth going down, there's just to many heaters\nCheck the records, we got records that broke records in record time\nI ain't talkin' about the records that they buyin'\nLyin', can a nigga keep up with me?\nYou see I, still standin VI stackin' the ride with me\nYou struggle to recoup\nI struggle on which Coup' to ride in\n[Missy] See how we be stylin'?\n\n[Hook]\n\n(*\"This is fire!\" cut and scratched to fade*)", "image": "https://images.genius.com/e55efd63b221413fdd81cd115e5549ab.1000x1000x1.jpg"}], "artist": "Missy Elliott"}