{"songs": [{"title": "Kick in the Door", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Skit - Trevin Jones]\nWelcome back, we're here on Bad Boy Television, and I'm Trevin Jones and I've been conversing with the Mad Rapper and quite frankly, he's very mad. We're gonna try to find out why, so we'll take some questions at this point from our studio audience. Yes ma'am, please stand and state your name and where you're from\nShay - Hi, my name is Shay, and I'm from New Rochelle. and I just don't understand; why you so mad? Like, what are you so mad about?\nThe Mad Rapper - Yo, yo, yo-yo, y'know, yo you wanna know why? Yo first of all, you can't be askin' me no question youknowhatI'msayin'? Who the fuck is you? (Ahh, excuse me, Mr. Rapper, Mr. Rapper) YouknowhatI'msayin? You can't be askin' me no question (It's a family oriented show)\nI'ma tell you why I'm mad, youknowhatI'msayin? I'ma tell you why I'm mad, I'ma tell you why I'm mad. These niggas is makin' five hundred thousand dollar videos, youknowsayin? They drivin' around in hot cars, youknowsayin? They got bitches, they got all that shit (Sir, please, please, refrain from your foul language). YouknowhatI'ms--? I'm still livin' with my Moms, youknowhatI'msayin? That's my word. YouknowI'ms--?\nI'm makin' records, I ain't made no money yet I done made, this is my fourth album yo, this my fourth album. I ain't made a dime yet. This nigga made one album, he makin' wild records. That \"Ready to Die\" shit, it was aight, it was aightYouknowI'msayin, that shit was aight, it was cool.  But my shit is J--more John Blaze than that! I got John Blaze shit And they not resp-ecognising, they not sayin, \"I recognize\" And fuck is that, who is you to be askin' me questions, youknowhatI'msayin? Who is you?\n\n[Interlude: Martin Lawrence]\nI gots to talk\nI gotta tell what I feel\nI gotta talk about my life as I see it\n\n[Intro - The Notorious B.I.G.]\nBiggie\nThis goes out to you\nThis goes out to you, and you, and you, and you\nThis goes out to you\nThis goes out to you\nThis goes out to you, and you, and you\n\n[Verse 1]\nUhh, your reign on the top was short like leprechauns\nAs I crush so-called willies, thugs, and rapper-dons\nGet in that ass quick, fast like Ramadan\nIt's that rap phenomenon Don Dada, fuck Poppa\nYou got to call me Francis M.H\nWhite, intake light tokes, tote iron\nWas told in shootouts, stay low and keep firin'\nKeep extra clips for extra shit, who's next to\nFlip on that cat with that grip on rap?\nThe most shady, (Tell Em!) Frankie baby\nAin't no telling where\nI may be, may see me in D.C\nAt Howard Homecoming with my man Capone, dumbing\nFucking something, you should know my steelo\nWent from ten Gs for blow to thirty Gs a show\nTo orgies with hoes I never seen before\nSo, Jesus, get off the Notorious'\nPenis before I squeeze and bust\nIf the beef between us, we can settle it with the chrome\nAnd metal shit, I make it hot like a kettle get\nYou're delicate, you better get - who sent ya?\nYou still pedal shit, I got more rides than \"Great Adventure\"\nBiggie (\"How are you gonna do it?\")\n\n[Chorus]\nKick in the door, waving the four-four\nAll you heard was Poppa don't hit me no more\nKick in the door, waving the four-four\nAll you heard was Poppa don't hit me no more\nKick in the door, waving the four-four\nAll you heard was Poppa don't hit me no more (Biggie)\nKick in the door, waving the four-four (uh-huh)\nAll you heard was Poppa don't hit me no more\n\n[Verse 2]\nOn ya mark, get set, when I spark, ya wet\nLook how dark it get when you're marked for death\nShould I start your breath or should I let you die\nIn fear you start to cry, ask why, lyrically\nI'm worshiped, don't front, the word sick\nYou cursed it, but rehearsed it\nI drop unexpectedly like bird shit, you herbs get\nStuck quickly for royalties and show money\nDon't forget the publishing, I punish 'em, I'm done with them\nSon, I'm surprised you run with them, I think they got\nCum in them 'cause they nothing but dicks\nTrying to blow up like nitro and dynamite sticks\nMad I smoke hydro, rock diamonds that's sick\nGot paid off my flow, rhyme with my own clique\nTake trips to Cairo, laying with your bitch\nI know you praying you was rich, fucking prick, when I see ya I'ma\n\n[Chorus]\nKick in the door, waving the four-four (uh-huh)\nAll you heard was Poppa don't hit me no more (uh, uh, uh)\nKick in the door, waving the four-four\nAll you heard was Poppa don't hit me no more\nKick in the door, waving the four-four\nAll you heard was Poppa don't hit me no more (Biggie)\nKick in the door, waving the four-four\nAll you heard was Poppa don't hit me no more\n\n[Verse 3]\nThis goes out for those that choose to use\nDisrespectful views on the King of N-Y\nFuck that, why try, throw bleach in your eye\nNow ya brailling it, snatch that light shit, I'm scaling it\nConscious of ya nonsense, in '88\nSold more powder than Johnson and Johnson\nTote steel like Bronson, Vigilante\nYou wanna get on son, you need to ask me\nAin't no other kings in this rap thing, they siblings\nNothing but my children, one shot they disappearing\nIt's ill when MCs used to be on cruddy shit\nTook home Ready to Die, listened, studied shit\nNow they on some money shit, successful out the blue\nThey light weight, fragili, my nine milli\nMake the whites shake, that's why my money never funny\nAnd you still recouping, stupid stupid stupid stupid...", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}