{"songs": [{"title": "Real Gangstaz", "album": "Amerikaz Nightmare", "year": "2004-08-10", "lyrics": "[Lil Jon]\nThis some of that real gangsta motherfuckin shit nigga (yeah!)\nYeahhhh! For all the real niggas out there (yeah!)\nYou know what I'm talkin bout? (what!)\nLike my motherfuckin East coast niggas (what!)\nMy motherfuckin Dirty South niggas (what!)\nAnd my motherfuckin West coast niggas (what!)\nLet's go!\n\n[Hook 2X: Havoc] + (Lil Jon)\nSome, peo-ple run (yeah!)\nBut, gang-stas don't (yeah!)\nKnow my hammer stay cocked (yeah!)\nIf, you, leave you crippled (hey!)\n\n[Havoc]\nNow y'all know the deal why we up in here (uh-huh)\nBurn that ma, put it up in the air (c'mon)\nMa got a phattie so I'm up in her ear\nCause - these clowns wanna grill, I got the clique right there\nNow you could get your ass drug around up in here\nYou know I know the promoter, the pound's in here\nAnd these my parts, you outta town out here\nSlow it down, pump the brakes, get found out there\nI'm push that melon, what the fuck's that smellin? (pussy)\nThugs not thugs no more, they tellin (yeah)\nYou did that time, but you not that felon (nah)\nNigga kill the noise, your hammer not yellin\n.. your infra-red not beamin (nope)\nY'all not eatin while your neck not gleamin\nWe don't give a fuck, flip for any ol' reason\nJust for the fun have your bitch ass leakin\n[Lil Jon] Okay!!\n\n[Hook]\n\n[Lil Jon]\nY'all niggas ain't gangsta\nAiyyo Prodigy, tell 'em what's up!\n\n[Prodigy]\nYeah, all I want is the money and y'all can keep them sloppy hoes\nMy calender's shows booked, I ain't got time yo\nGimme the cash, keep them beat up chicks\nMy bank bounce gotta stay thick\nYou know e'ry day I stay with, the latest guns\nKeep those under our belts to blaze you up\nE'ry day we play with, the latest trucks\nWork that tip chronic on the porch well\nDon't get rat-a-tat tatted up, it be a bad look\nBe wettin your pants when bullets hit, mad shook\nDroppin your gun and all that, you mad puss\n34 shell cases fall in one push\nYou get beaten and battered up, y'all little chain snapped\nWe still takin 'em, fuck it let the team have it\nBe droppin your drinks, trippin on things scramblin\nIt be chaos when guns ring at him\n[Lil Jon] Okay!!\n\n[Hook]\n\n[Lil Jon]\nAight it's bout to get real ugly in this motherfuckin club\nWhat, WHAAAAAAAAT?! I need to see nothin (hey!)\nBut the real gangsta niggas and bitches on the dance FLO' (hey!)\nYEEEEEEAHHHHH!! We gon' crank this motherfucker UP!\nLet's crank this bitch up!\nWe need to see all y'all motherfuckers doin this shit! (what!)\nDoin what?\n\nHey, put your middle finger up, motherfucker (motherfucker)\nPut your middle finger up, motherfucker (motherfucker)\nPut your middle finger up, motherfucker (motherfucker)\nPut your middle finger up, motherfucker (motherfucker)\nLet me hear you say - put your middle finger up, fuck you nigga!\nPut your middle finger up, fuck you nigga!\nPut your middle finger up, fuck you bitch!\nPut your middle finger up, fuck you bitch!\n\n[Hook]", "image": "https://images.genius.com/b2028bc5336e13af3d91919e570f79e6.1000x1000x1.jpg"}], "artist": "Mobb Deep"}