{"songs": [{"title": "Harambe", "album": "JEFFERY", "year": "2016-08-26", "lyrics": "[Intro]\nMafia!\nBillboard Hitmakers\nYeah, AP gang, bitch, you know what I'm sayin'?\nLevel up!\nYeah, AP gang\n(Big ice)\n\n[Verse 1]\nYeah, catch him down bad\nBeat him with a bat, hashtag that (Yeah)\nI call it New Jack, yeah, yeah\nBitch, I got a blue Jag, yeah (Ha, ha)\nI make that cash talk, nigga\nI got a new house\nYou wanna get in, need a passcode, nigga (What?)\n225 on the dashboard, nigga (Skrrt)\nStack it up and then you get that foreign, nigga\nStep it up and take care of your daughter, nigga (Ha, ha, ha)\nStack it up and take care of your son, nigga\nStep it up and take care of that mom, nigga (Hey)\nYou know I ran it all up by myself\nAnd now your bitch is drinking cum, nigga (Drink)\nMy diamonds yellow like a corn, nigga (Yeah)\nDouble R at the prom nigga\nSkrrt, skrrt, skrrt\nGot some hitters all of 'em my cuz, nigga\nAyy, girl, I know you love me\nLove me, I know, I know, I know you love me\nYou love me\nHey!\n\n[Chorus]\nBentley wheelin' nigga, bad killer nigga, back it up (Bitch, get down)\nBands kill a nigga fast, will a nigga back it up? ([?], ayy)\nApe shit nigga, Godzilla, nigga, act up (Ha, ha, ha)\nGo ape shit, go Godzilla, bae, back it up (Yeah)\nI just wanna have sex (Hey)\nI just wanna have a baby out you, girl (Hey)\nI just wanna go brazy about you, girl (Hey)\nDon't make a nigga act crazy, oh-ooh girl\nAyy, 'cause you know I will\nAnd I'm on a Perky pill (Hey)\n\n[Verse 2]\nThis shit can get ugly for you (Yeah)\nI'll pull up and bust your mama (Brr)\nI'll pull up and bust your brother (Yeah)\nI'll aim at your fuckin' family (Brrrat)\nI'll aim at your whole clique (Brrrat)\nI'll aim at your mothafuckin' mama\nI'll aim at your fuckin' dad (Brrrat)\nI'll aim at your daughter, son, nigga (What?)\nI'll aim it at everything (Hey, pop out)\nI'll aim at the baby (Hey)\nI got devil inside of me (Hey)\nGot the devil inside me (What?)\nGod tryna provide me (God)\nGod tryna decide (What?)\nDo he wanna leave me or sign me? (Who that?)\nUm, okay, I know you're frustrated 'bout a nigga\nAnd everything I take you through, yeah (Pablo shit)\nI know I did a lot of sins\nAnd I hope you still let me make it through, ah (Hey)\nJust 'cause I got me a spot in LA\nThat don't mean I'ma change the crew (Fuck)\nMy bitch trying to figure out\nHow she can tell me to chill without changin' you (Woo)\nFuck it, I'm changin' up on 'em (Hey)\nBut my fans, not changin' on 'em (Hey)\nMakin' a band, I'm sangin' on 'em (Hey)\nWhip out that bag, syringin' on 'em (Hey)\nHey, hey, we locked that bitch out with no passcode (Huh)\nI bought her some of those\nDamn, she already had 'em though\n\n[Chorus]\nBentley wheelin' nigga, bear killer nigga, back it up\nBands kill a nigga fast, will a nigga back it up?\nApe shit nigga, Godzilla, nigga, act up\nGo ape shit, go Godzilla, bae, back it up\nI just wanna have sex\nI just wanna have a baby out you, girl\nI just wanna go brazy about you, girl\nDon't make a nigga act crazy, oh-ooh girl\nAyy, 'cause you know I will\nAnd I'm on a Perky pill", "image": "https://images.genius.com/52d2a0dba0a686ea304030fe9d3e3e00.1000x1000x1.jpg"}], "artist": "Young Thug"}