{"songs": [{"title": "Let’s Go", "album": null, "year": null, "lyrics": "[Intro]\nYeah.. Gilla House.. {*laughing*} Brick Mob\nGotti click, bitch!\n(You already know nigga) What you about to hear\nCan be devastating to yo' ear {*fades out*} (Ha ha!)\n\n[Redman - talking]\n(Let's go, yo!) You know the deal muh'fucker!\n(Let's go, yo!) You know when Gilla niggas is in the building man\n(Let's go, yo!) You know how we gotta do it nigga\n(Let's go, yo!) You know the deal muh'fucker!\n\n[Redman]\n(Let's go, yo!) I got my hand on the pump\n(Let's go, yo!) I gotta fist full of funk\nMy blunt got the green chunks, new from the jump\nThe duke is hazardous, Boss Hog number one\nReach out touch someone, not Atlantic belle\nRed lost his mind in Africa with Chappelle\nNever pump his brakes, when a chick wan' tell\nI \"clip her,\" then give her weed that \"Sam can sell\"\nI'm fly, apicnell, trips on Pan-am\nOn the shotgun, the hammer, kick like Van Damme\nI am what I am, Popeye, black eye\nTake a hood chick that love Biggie that's cockeyed\nBlah! Blah! You can bring the blue suits in\nI still +Takeover+ like two on the +Blueprint+\nOn my car, you see this guy with a roof big\nAnother thick chick with ass about 210!\nYeah, I don't make threats, I promise\nI'm still the shit, even if Flex don't bomb it\nAnd then my neck vomit, spit heat that spit round comets\nYou wrapped up like Islamics\nGet it poppin like pyros in the hood\nStash the weed from 5-0 in the wood\nI got dried clothes in the mud\nI'm dirty, R-rated, yeah I'm the bro with the bud\n\n[Hook]\n(Let's go, yo!) Chick know it's time to leave\n(Let's go, yo!) Gotta go and grab my keys\n(Let's go, yo!) Chick tryna steal my weed\n(Let's go, yo!) \"It's about to change out here!\"\n(Let's go, yo!) \"Yo, yo, yo, yo\"\n(Let's go, yo!)\n\n[Redman]\nYo, you thought you won two, but you just lost one\nGot Patron on my dome, thick chicks in the trunk\nI'm in the streets like Little Zane in the slum\nI'm the \"Best Man\" like Taye Diggs on the drum\nI'm from.. Brick City, be on the lookout\nWe roll deep like the Wayans, dead at your cookout\n\"Woo zah!\" \"Bad Boy,\" Mama Duke pushed out\nTold Def Jam, watch the plan that I put down\nGilla House! Testicle, one, two\nCheck here, and it's no question what I'm gon' do\nI'm in ya Harlem Nights with Dominique Peru\nDrunk as hell, gettin head at the comedy review\nI, stay around the corner from Park Hill\nI ain't hard to find, but I'm sure hard to kill\nSay \"party over here!\" Watch the truck rail\nOnly dude with H.B.O. on my windshield\nI \"chillll,\" like E and P makin dollars\nThe L's that I roll, the size of Godfathers\nE'rybody know your click but I'm live-er\nI'm drunk off liquor, bitch so I'm drivin\n\n[Hook]\n\n[Redman]\nRedman is in the heezay\nPacker, get that Green Bay up off E-Bay\nI moved up like George and Weezay, greasy\nSent ya wifebeater, B.K. for a cheesecake\nD.J., spin it back one time {*d.j. spins it back*}\nYeah, \"Mami say, mami sai, mami macho sai\"\nI supply the real shit when hip-hop go dry\nMexicans love the way that the vodto rhyme\nHottest thing with the pen since Picasso died\nTwenty six on the tie, fitted, white tee\nHit the hood like.. nighttime with free minutes\nHo! Back up in this bitch like whoa\nThey just started a fight on the main flo'\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}