{"songs": [{"title": "Make the Hits", "album": "The Infamous Archives", "year": null, "lyrics": "[Intro: (Havoc) & The Alchemist]\n(Uh, uh-huh, uh-huh, uh-huh, uh-huh, fo' real)\nYou are now tuned into the sounds\nHandcrafted & designed, by the H A V O C\nHavoc beats, (fo' real) A-L-C talkin'\n\n[Verse One: Havoc]\nYou know my name, you know my pedigree\nIt ain't a game, who could do this better then me?\nAs far as I'm concerned, niggas better play that position\nTheir slugs will be hittin' that target, neva missin'\nAnd - how many times, do I gotta go through that beef\nProtectin' my shines, wit nothin' but that big heat\nI'm down to Earth, but niggas wanna to bring it\nUp to that next level, swing, don't sing it\nBut I warn y'all, tear y'all niggas in new ass off\nCompared to Hav', nigga I'm dope, you lactose\nPass the roach; you laughin' I'ma get that last tot\nGangstas to fly bitches, I rap for those\nAnd - layin' it down, just like it's suppose to be layed\nCheck mate on a nigga when my moves is made\nDon't believe? The proof is in the pudding, my nigga\nStraight face when I'm pullin' the trigger, you didn't know?\n\n[Chorus: Prodigy]\nYo it's the word, you hate P?\nYou hatin' on Hav?, the A-L-C?\nWe gettin' doe, we got the V's\nThat make your hoe come up out them panties\nAnd - we do it big, we +Make The Hits+\nY'all make the check, like it's come up off the checks\nYou gettin' broke, we gettin' rich\nWe got the guns that make a mess, uggghh!\n\n[Verse Two: The Alchemist]\nAiyo it's time, time for me to shock and amaze\nThe best out, chest out when I'm rockin' the stage\nI'm certified, A-L-C claimin' his clout\nAnd I'ma show you what that name's about\nAnd - the +Quiet Storm+ (ssshhh!) blew out the fuckin' lights\nFlood the block and overflow personal\nTrained pipes, me and H, yea we the same type\nGet the checks in the daytime and bang out in the late nights\nPlus, I'm on the grind, snatch a quarter 'mil from KOCH\n'Cause I shook the spot, it went from the bottom to the top\n(Get that) I fake then I'm swingin' the rock\nAnyway you cut the cake I get my CREAM off the top\nCREAM of the crop, on sideways, leanin' and drop\nTop speed 'til the cops give me a reason to stop\nEven in the winter season I'm hot\nLike Ripley's if you a thug, I don't know if I Believe It Or Not!\n\n[Chorus: Prodigy]", "image": "https://images.genius.com/cb51383ec91030d5e17e2b134d0e8477.1000x1000x1.jpg"}], "artist": "Mobb Deep"}