{"songs": [{"title": "Amazing", "album": "Book of Ryan", "year": "2018-05-04", "lyrics": "[Intro: Royce Da 5'9\"]\n(Ryan!) I am not trying to be in the store all day\nY'all can play the game one time\nLemme go get change for a dollar real quick\nHey my man, what's up, you got change for a dollar?\nWhat's up, man? You don't remember me, do you?\n\n[Verse 1: Royce da 5'9\"]\n(Ryan!) I remember you, I remember you definitely\nI remember you took my basketball and wouldn't give it back\n'Cause I dribbled it inside your store but I was just messing with you\nPlus that was my lucky ball\nMy Dad got it signed by Isaiah Thomas so I kept it with me\nEverywhere I went I used to bounce that ball\nEverywhere I used to go I used to bounce that, bounce that ball\nI'm little Ryan from 16650, Baylis\nRemember me? I used to buy all the mystery mix Now and Laters\nI used to wait for God to come down and answer all my prayers\n\n[Chorus: Mélanie Rutherford]\nNever asked for much when I sat down and say my prayers\nAll I ever, ever wanted was to be amazing (Ryan!)\n\n[Verse 2: Royce Da 5'9\"]\nSame little boy used to walk to the corner store\nWho used to get the Funyun chips\nWho ended up, dumb, young and rich\nI had young parents but they both were strict\nI had a superstitious granddad, wait, scratch that, crazy granddad\nI seen him turn his hat around three times\nDrive his car around the corner three times in reverse\nJust 'cause he crossed paths with a black cat\nMan, you remember Hank? He used to be a Jitney at the market\nMy mom used to do his laundry\nHe used to have me and my brothers dyin' laughin' at him\nTalkin' 'bout, \"You know you can't leave them clothes\nIn the washing machine too long when they get done washed\nAnd still put 'em in the dryer, doing that makes the clothes stink\"\nDamn, being back here bring back so many memories\nYou sure you don't remember me? You remember the ball? (Ryan!)\nEverywhere I went I used to bounce that ball\nEverywhere I used to go I used to bounce that, bounce that ball\nNigga, everybody know little Ryan from 17150, Northlawn\nI used to come and cop pork rinds\nI used to watch drug dealers come through in cars\nLike, \"If I get one of those, it's showtime\"\n\n[Chorus: Mélanie Rutherford]\nNever asked for much when I sat down and say my prayers\nAll I ever, ever wanted was to be amazing (Ryan!)\n\n[Bridge: Mélanie Rutherford]\nIs that Ryan? It's always good to see him in the neighborhood\nHey, baby! How your momma?\nLook at that car, he done done it\nI told y'all he was gonna do somethin' (Ryan!)\nHell yeah, hell yeah\nHell yeah, hey, hey, hey, hey, hey\nHell yeah, hell yeah\nHell yeah, hey, hey, hey, hey, hey (Ryan!)\n\n[Verse 3: Royce Da 5'9\"]\nWow, this is overwhelmin'\nIt feels like it was just yesteday I was watchin' \"Good Times\"\nWishin' I could get ahold of Thelma\nFighting with my brother over channels\nI like watchin' movies\nHe likes stupid shit like Robin Williams, goin', \"Nanu nanu\"\nOr whatever that stupid-ass show called\nI ain't around here being no attention whore\nI need niggas to look at these whips\nFor every time we got those extension cords\nGod, I miss my big brother so much, he went to prison so much\nThat I don't think I'd recognize him these days much\nBut I'ma always know what to get him from the ice cream truck\nHe used to get the Push-Up Pops, I used to get the snow cone\nI used to wanna be just like Turbo, he used to want to be Ozone\nI got all the kids wavin' at me, all the elderly off they high horse\nThey wouldn't even let a nigga play twenty-one in the driveway\nNowadays, the ball is in my court (Ryan!)\nEverywhere I went I used to bounce that ball\nEverywhere I used to go I used to bounce that ball\nEverybody going, \"Ain't that lil Ryan from over there on Marlowe?\nI ain't seen him since he was a baby\"\nWell I'm back in town to let the people know\nThat you don't need no lucky ball, you already amazing\nAnd I'm still your neighbor, little ol' Ryan (Ryan!)\n\n[Bridge: Mélanie Rutherford]\nAnd God bless the child no matter\nHow long it seems, somehow he'll find his way home\nIt's so important baby\nBetween the memories and family\nI don't know which one is more amazing\n\n[Chorus: Mélanie Rutherford]\nNever asked for much when I sat down and say my prayers\nAll I ever, ever wanted was to be amazing", "image": "https://images.genius.com/ece0d83dced13a6ca8fbcbc25cfd032f.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}