{"songs": [{"title": "Sunrise", "album": "Camp", "year": "2011-11-15", "lyrics": "[Verse 1]\nYeah nigga, it's me again\nI'm still around, I guess I win\nYou hear me in your sister's room like all the time\n\"Gambino Girl forever\" on that bracelet that she bought online\nTo dudes who couldn't take it, might I say, \"Hasta luego\"\n'Cause I'm takin' all your city like I'm Carmen Sandiego\nI am smokin', I'm on fire\nI am blazin', don't get hurt\nTo my white dudes, it's a concert\nTo my black nerds, this is church\nFrom that NYU dorm to the Emory\nEveryone hated me, I'm more hip-hop than you'll ever be\nI'm bustin', bustin', bustin', I'm bustin' on these niggas, man\nAnd nothin', nothin' nothin', n-nothin' is the same again\nYou lookin' dumb as hell man for ever sleepin' on him\nYour girl is not around, she busy sleepin 'on him\nWill he fail? Now that's the wrong conversation\nTerry Gross on the mic, I'm the talk of the nation, ha\n\n[Chorus]\n(Ayy!) What it do, bitch?\nWhy these other rappers do shit stupid?\nWhile they be sleepin', I be onto that new shit\nWhile they be sleepin', I be onto that new shit, ayy\n(Ayy!) What it do, bitch?\nWhy these other rappers do shit stupid?\nWhile they be sleepin', I be onto that new shit\nWhile they be sleepin', I be onto that new shit, ayy\n\n[Verse 2]\nNew shit, you didn't know?\nBlack rock like a fuckin' LOST episode\nSomethin' for these black kids to call they own\nSo when you skatin' in your driveway, you not alone\nShe stay down like that new coat that I bought her\nAnd the fly Rihanna girls be drinkin' my coconut water\nAnd I'm lookin' at her butt, that's that 20/20 hindsight\nMy shit be Jackson, Jordan, Bolton, Keaton, Tyson, 5 Mikes\nDonald Glover, no relation\nAlways workin', no vacation\nThey couldn't feel me, no vocation\nMurder verses the only motive was motivation\nMoney equals freedom\nI've wanted this since a three-year-old\nI've seen it all, like I'm John Mayer's penis hole\nBein' me, that's somethin' that's so unusual\nI've seen the future, and the future go, ah\n\n[Chorus]\n(Ayy!) What it do, bitch?\nWhy these other rappers do shit stupid?\nWhile they be sleepin', I be onto that new shit\nWhile they be sleepin', I be onto that new shit, ayy\n(Ayy!) What it do, bitch?\nWhy these other rappers do shit stupid?\nWhile they be sleepin', I be onto that new shit\nWhile they be sleepin', I be onto that new shit, ayy\n\n[Outro]\nNew shit\n(Woo!)\nCan't you hear me, baby?\nCan't you hear me callin' out your name?\nCan't you hear me, baby?\nOhh, can't you hear me callin' out your name?", "image": "https://images.genius.com/00196af444633a4108e6dc544358985e.630x630x1.jpg"}], "artist": "Childish Gambino"}