{"songs": [{"title": "Ghetto", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Marlena Shaw]\nI was born and raised, in the ghetto\nI was born and raised, in the ghetto\nI was born and raised, in the ghetto\nListen to me, and just lay up\n\n[Raekwon]\nPark Hill Projects, one eight pound\nHolding it down, that's the motto, 'lo goose and lottos\nBlunts on the regular, O.G. style\nI'm into old V's, swinging in cabs, slinging them OZ's\nAll I know is running in fiends' labs, hitting the green bags\nVisualizing Chef in the green Jag's\nWait til I get on, the haters gonna hate it\nIn this corner, a rich young don with a crisp lab\n\n[Marlena Shaw \"Woman of the Ghetto\" sample]\n*humming*\nBrother, listen to me\nBrother, listen to me\nListen to me, and just lay up\nHow do you make your bread in the ghetto?\nHow do you make your bread in the ghetto?\n\n[Cappadonna]\nHustling, hustle & flow\nWe make bread in the ghetto, by selling that crack\nSee niggas that make bread by busting the gat\nMight stick a nigga up, stab him dead in his back\nIt's a dirty bread game, but we get through them stacks\nBread game, rather have bread than fame\nSome sell pills and weed, it ain't no joke\nMight sell anything as long as we not broke\nSo if you getting that bread, we be coming for your throat\nIt's crazy what a brother might do for the bread\nMight violate parole til ya family is dead\nWe get bread in the ghetto, while we ducking the feds\nI heard bread in the ghetto got a loaf on his head, come on\n\n[Hook]\nBrother, listen to me\nBrother, listen to me\nListen to me, and just lay up\nHow do you get rid of rats in the ghetto?\n\n[Ghostface Killah]\nYo, yo, aiyo we ox 'em, duff 'em, stuff 'em in black bags\nTorture them, toss 'em out the window with rift rafts\nCuz we don't take kindly to rats in the ghetto\nEither your mouth stay shut or get slapped with the metal\nBig fat rats get fried like porkchops for snitching\nGet your ass hung like a wall clock\nIt's Tone Stark, Billy the Kid when the gun bark\nA wire sticking out his shirt, he talking to NARC!\n\n[Hook]\nHow do you raise your kids in the ghetto?\nHow do you raise your kids in the ghetto?\nFeed one child and starve another\nTell me, tell me, and just lay up\n\n[U-God]\nWe like brothers, we came from the same mothers\nIn the projects, under the same covers\nWore the same drawers, fucked the same whores\nRolled dice, kicked rhymes, did crimes in the same hall\nSprayed our names on the same wall\nYo, your kids knew my kids, your wiz knew my wiz\nNow you caught up in music and showbiz\nIf that's what it is, then that's what it is\nRun up in your crib, with twelve black brothers\nThat'll digest to live, die just to live\nSome called us martyrs, some called us fathers\nRun up in the club like the suicide bombers\nWe be the brothers, ready past lovers\nNever wanna see us, blow, we not others\nSomewhere in the competition, friends got lost\nThe money got flipped, your tables got crossed\nNow you all caught up in that label talk\nBrain dead in the grain of thoughts\nWith a name and a game that can change New York\nWe ate from the same fork, pop had the same thought *echo*", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}