{"songs": [{"title": "My Own Planet", "album": "Success Is Certain", "year": "2011-08-09", "lyrics": "[Intro: Royce da 5’9”]\nRight off the rip, nobody could fuck with me\nI’m out of space, mind and body, my soul and so on\nMami I’m fly is an understatement, come to greatness\n\n[Chorus: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back, for doing good\nI don’t need nobody else, I’m gon' do it by myself\nSay what you wanna say but stick to the facts, it’s all good\n\n[Verse 1: Royce da 5’9”]\nRight off the rip, nobody is quite like me\nYou gon' need a NASA spacecraft to sight me\nIf you don’t like me, bite me\nI could give a fuck, less fighting excites me\nLeaning on the moon with a patron fifth\nPlaying my own shit, and I sound terrific\nI’m not cocky, I’m beyond that\nIt’s time to start another hobby, I’m beyond rap\nRun and tell your baby daddy and your son Ray\nI’m hot, I sunbathe on the sun, bae\nI’m the one on the one way\nHands and pretty long legs from the runway\nMy nigga Nauny is a genius\nYou gon' need a ladder just to climb on my penis\nGot two words for the rap game, fuck y'all\n\n[Chorus: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back, for doing good\nI don’t need nobody else, I’m gon' do it by myself\nSay what you wanna say but stick to the facts, it’s all good\n\n[Verse 2: Royce da 5’9”]\nRight off the rip, you thought it was a wrap for me\nDidn’t you? Go ahead and admit it hater\nCold as ice, I’m a living refrigerator\nThe reason hip hop’s breathing the defibrillator\nI did a bid just for drunk driving\nIt’ll never happen again 'cause now I’m drunk flying\nI’m an innovator, when I say I’m on Venus\nI don’t mean that I’m dating the tennis player\nI’m on Saturn where you don’t matter\nAlone, I’m past the zone where your phone scatters\nHello? Can you hear me now?\nYou don’t got a fucking choice\nI elbowed my way into everybody’s conversations\nWith rhyming, timing and patience, now I’m in space, bitch\nI used to have to be on some \"watch what I say\" shit\nBut now you gotta take it\n\n[Chorus: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back, for doing good\nI don’t need nobody else, I’m gon' do it by myself\nSay what you wanna say but stick to the facts, it’s all good\n\n[Verse 3: Joe Budden]\nThey say a closed mouth don’t get fed\nI say a closed mouth don’t give head\nOn the flip side, know a closed fist don’t get bread\nAnd if you swing it then you gon’ get lead\nBoy I put ‘em in a panic, got ‘em all frantic\nOverlook my antics, you’ll see that I’m a throwback\nHip hop Stan Smith, but it lessen my love\n'Cause the so-called rulers ain't quite measuring up\nNow let me give the chicks a message\nBitter exes'll tell you that the dick is precious\nThree words, get over it\nAnd if you speak mine, mention I could trip over it\nLow key like my name too big for the bill\nBetty White style, get it in, still\nPlus I’m on the high you can’t fit in the pill\nBut I try anyway, we gon’ die anyway, ya heard\n\n[Chorus: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back, for doing good\nI don’t need nobody else, I’m gon' do it by myself\nSay what you wanna say but stick to the facts, it’s all good", "image": "https://images.genius.com/7ef2ea2d0242f3b7c5b03da3554a04b1.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}