{"songs": [{"title": "Brr", "album": null, "year": null, "lyrics": "[Intro]\n\n[Hook: Gucci Mane, Soulja Boy, and Yo Gotti]\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\n\n[Verse 1: Gucci Mane]\nYou wanna visit Gucci world, girl, here's a brochure\nWhat a  cold watch, make your wife say burrr\nGolf balls in my ear like burrr burrr burrr\nGot a 'rari with an engine in the rear, look and hear\nShining harder than your partner red amulets, match the carpets\nYou my son, I'm your father, this here trust all on the author\nSo what's popping? Orville Redenbacher. I'm so OJ, ok\nI'm so Waka Flocka, fuck it, I might smoke in front the DA\nI'm so Gotti, I might buck it, two tear drops so I feel like fuckin'\nYou a crystal in a bucket, got a 6K show in Kentucky\nRun up on a kid and he won't be lucky, might be alright and he'll be unlucky\n.38 revolver in the club, try Brick Squad and this shit get ugly\n[gucci!]\n\n[Hook: repeat 2x]\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\n\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\n\n\n[Verse 2: Soulja Boy]\nSoulja Boy off in this ho, I'm gon' roll up all this dro\nGucci on the passenger, the Ferrari's painted, whoa\nBoy you already know the yellow diamond Breitling boy\nFifty stacks plus hundred stacks, a hundred wrecks I hit destroy\nI aim for the fucking pain, bitch you know my name\nSwang swang in that Gucci Mane, man you know I let my chain\nHang, don't go do my thang, Soulja Boy gon' blang\nBlang blang blang, and I let it burrr all off of your e'rrr\nDissap'rrr, bitch you hate on me, man you fake on me\nAnd it's like a masterpiece the way my artists tat on me\nTatted on my chest, tatted on my neck man you know it's like\nI think I'm DJ Khaled, cause we the fucking best!\n\n[Hook: repeat 2x]\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\n\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\n\n\n[Verse 3: Yo Gotti]\nWhite bracelet so ignorant the yellow one the matching kit\nCold hearted nigga and I run around with lunatics\nThey be on some shootin' shit. I be on some neutral shit\nSince I got some soldiers I'm on some might as well use 'em shit\n(Burrr) Left his body cold, you know how the story goes\nNigga disrespect the king, left him full of bullet holes\n(Burrr) Shorty cold with it, work the pole with it\nMagic City money, touch her toes with it\n(Burrr) Rubber bands now\n(Burrr) Money floatin' up\n(Burrr) Money floatin' down\n(Burrr) Bitches baggin' up\n(Burrr) Half a million ones\n(Ones) That's a lotta paper\n(Burrr) Couple hundred guns\n(Guns) Ready for the haters\n\n[Hook: repeat 2x]\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\n\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\nBurrr, burrr burrr, burrr burrr\n\n\nBurrr", "image": "https://images.genius.com/6f0a4980c8ef838036229e1d4dcd036c.408x408x1.jpg"}], "artist": "Gucci Mane"}