{"songs": [{"title": "How Do You Want It (Power 107.5 FM Version)", "album": "One Nation (Bootleg)", "year": null, "lyrics": "[Verse 1: 2Pac]\nLove the way you activate your hips and push your ass out\nGot a nigga wanting it so bad, I'm about to pass out\nWanna dig you, and I can't even lie about it\nBaby just alleviate your clothes, time to fly up out it\nCatch you at a club, oh shit you got me feening\nBody talking shit to me but I can't comprehend the meaning\nNow, if you wanna roll with me, then here's your chance\nDoin' eighty on the freeway, police catch me if you can\nForgive me I'm a rider, still I'm just a simple man\nAll I want is money, fuck the fame I'm a simple man\nMr. International, player with the passport\nJust like Aladdin bitch, get you anything you ask for\nIt's either him or me - Champagne, Hennessy\nA favorite of my homies when we floss on our enemies\nWitness as we creep to a low speed, peep what a ho need\nPuff some mo' weed, funk, ya don't need\nApproachin' hoochies with a passion, been a long day\nBut I've been driven by attraction in a strong way\nYour body is banging baby I love it when you flaunt it\nTime to give it to daddy, nigga, now tell me how you want it\n\n[Hook: 2Pac]\nHow do you want it?\nHow does it feel?\nComing up as a nigga in the cash game\nLiving in the fast lane\nI'm for real\nHow do you want it?\nHow does it feel?\nComing up as a nigga in the cash game\nLiving in the fast lane\nI'm for real\n\n[Verse 2: Hussien Fatal]\nAllow me to introduce to ya, I'm Fatalveli The Don\nTattooed all on my back, neck, belly and arms\nI'm tryin' to talk to ya, give me the stash, 107.5 'bout to do the whole dash back with 'Pac in the house now\nGive it to me, bet you love that nigga whip it out and put it in your mouth now\nGrindin' rawdy, holdin' nine inches in ya shorty\nEven your baby mama if she keep it poppin' for me\nHer brains is bangin', shorty I love the way you want it\nTime to give it to Dizza, Baby now tell me how ya want It\n\n[Hook: 2Pac]\nHow do you want it?\nHow does it feel?\nComing up as a nigga in the cash game\nLiving in the fast lane\nI'm for real\nHow do you want it?\nHow does it feel?\nComing up as a nigga in the cash game\nLiving in the fast lane\nI'm for real\n\n[Verse 3: Big Seth]\nWhenever Big seth rolled with 'Pac\nHe controlled the block\nHoodboogers on every set when I hold or cock\nThey love when they see me thugging with my drug men\nLubricate they miss section, keep 'em bubbling\nMama that walk is mean, my hawkish lean\nOne to 9 hit the loop and off to them things\nI gotta about 9 inches that's brown and bold\nSo shorty come on my block and these on down the road\nOnce I bust this release some slushes\nYou can watch the hammer but you still can't touch this\nTill the next time, I'll get up\nBack at the club with DJ Qualls looking for the wildest sluts\nHow do ya want it\n\n[Hook: 2Pac]\nHow do you want it?\nHow does it feel?\nComing up as a nigga in the cash game\nLiving in the fast lane\nI'm for real\nHow do you want it?\nHow does it feel?\nComing up as a nigga in the cash game\nLiving in the fast lane\nI'm for real", "image": "https://images.genius.com/a1a90553105ad6af8fac203ba73284bf.480x360x1.jpg"}], "artist": "2Pac"}