{"songs": [{"title": "High Rollers", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Verse 1: B-Real]\nLoaded, dazed, confused\nI'm in the Esco' rollin' the kush weed\nYou know that I'm never ever blazin' the Bush weed\nYou know you're on cloud nine fuckin' with me duke\nBe sure that I'm the kush man waitin' to see Proof\nSome say I'm high on life and I don't need ya herbs\nI'm gettin' high every time that you speak the words\nWell I'm glad that means more for me son\nI hit the bong so hard they call me three-lungs\nThey say that I'm the buddah master, \"Rock Superstar\"\nYou know the homie with the weed laced candy bar\nNow I'm blazin it non-stop, you feelin' me fam?\nYou see, everywhere I go it's like Amsterdam\nWe blow the smoke in the air now you smellin' my strain\nIt's the O.G. bush just clouded your brain\nSee I'm ready for fo'-twenty mo' honeys get dough for me\nAll of them Mary, it's scary, they get you most stony\n\n[Chorus: B-Real, Method Man, & Proof]\nHittin' the blunts and bongs\nPuffin' those trees and leaves\nComin' with E and Vic's\nYou know it's on tonight, roll it and pass the light\nSittin' up top of the world\nGettin' on top of your girl\nPackin' those bowls and pipes\nYou know it's on tonight\nRoll it and pass the light\n\n[Verse 2: Proof]\nYou know your man's royal can be Ishmael{?}\nWasn't even finished my drink and thinkin' 'bout refills\nThey got the dro, I'm fin' to roll off these E pills\nAnd I'm the Proof, got on method so be real\nA retired weed head that need bread for trickin'\nOff on a mission to find bitches for sausage lickin'\nEngulfed in liquids, Xena's and perkasets\nI jam like I don't know how to work the tech\nNine times outta ten I'm high off the Henn'\nNever lie for a trend\nTryna die on a binge\nBiscuits is poppin', ain't no stoppin' like Hendrix and Joplin\n'til I find out where Biggie and 'Pac went\nProfit of coppin', most often is gobbled\nStackin' my chips high 'til they auction a Pablo\nPills to swallow, momma don't cry I send you drugs\nTryna get my mind stuck \"In the Middle\" like Monie Love - whaaaat?\n\n[Chorus: B-Real, Method Man, & Proof]\nHittin' the blunts and bongs\nPuffin' those trees and leaves\nComin' with E and Vic's\nYou know it's on tonight, roll it and pass the light\nSittin' up top of the world\nGettin' on top of your girl\nPackin' those bowls and pipes\nYou know it's on tonight\nRoll it and pass the light\n\n[Verse 3: Method Man]\nI semi-automatically spit flows at trash\nAnatomically equipped to rip shows in half\nIf I speak a little fast you get whiplash\nPromoters better get the kid cash\nOr get whipped ass\nGot some Zig-Zags and a Dutch, let's get smashed\nMy little zip bags got more riders than Six Flags\nAnd while y'all get gassed, I'm proceedin' to get high\nGot weed like Mary J. is all I'm needin to get by\nTical motherfucker, run for cover when shit fly\nOne hand is on the lye, the other hand on yo' bitch thigh\nHow many wanna try, Mr. Meth and his clique? Yes\nThat's kinda farfetched like me passin' a piss test\nOkay, let's be real, here's the proof, we need cash flow\nMight catch me in the movies lightin' up in the back row\nFor sho', Killa Bee back. Flac? We don't need that\nIt's fo'-twenty ho, now where the fuck is yo' weed at?\nIn fact..\n\n[Chorus: B-Real, Method Man, & Proof]\nHittin' the blunts and bongs\nPuffin' those trees and leaves\nComin' with E and Vic's\nYou know it's on tonight, roll it and pass the light\nSittin' up top of the world\nGettin' on top of your girl\nPackin' those bowls and pipes\nYou know it's on tonight\nRoll it and pass the light", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}