{"songs": [{"title": "Icy", "album": "Trap House", "year": "2005-05-24", "lyrics": "[Intro: Gucci Mane & Lil Will]\nGucci Mane La Flare\nYeah, where yo ice at?\nWhere yo chain and yo ring at?\nWhere yo bling at?\nI'm icy, I'm icy, so icy, so icy\nI'm so icy, I'm icy, so icy, so icy\n\n[Chorus: Lil Will]\nAll these girls excited\nOoh, you know they like it\nI'm so icy, so icy\nGirl don't try to fight it\nAll your friends invited\nI'm so icy, so icy\n\n[Verse 1: Young Jeezy]\nGot a house around my neck and my wrist on chill\nAny given time, 250 in your grill (a quarter million?)\nAll I do is talk shit\nYou can even add a couple grand for my outfit\nYeah, you better act like you know man\nIn my hood they call me Jeezy the Snowman\nYou get it? Jeezy the Snowman\nI'm iced out, plus I got snow, man\nLet it marinate, y'all niggas slow man\n(Man what the fuck y'all? Dumb ass)\nI used to get nineteen for a beat\nCall me Ginuwine, the same 'ol G\nI'm the shit bitch, I need toilet paper\nAnd some air freshener nigga, fuck a hater\nThese niggas don't like me\nI'm with the Gucci Mane and I'm so icy\n\n[Chorus: Lil Will]\nAll these girls excited\nOoh, you know they like it\nI'm so icy, so icy\nGirl don't try to fight it\nAll your friends invited\nI'm so icy, so icy\n\n[Verse 2: Gucci Mane]\nShe digging my fitted, she think I'm the shit\nIs this the chain on my neck, or the watch in my wrist\nMaybe the ice in my ear, or my bracelet\nBut she look like the type that could take a dick\nYoung Gucci Mane\nDon't kiss me baby, you can kiss my chain\nYou gotta be a dime piece\nJust to look at the rocks in my time piece\nI come through in a drop top Jag\nOr a old school Chevy with the antique tags\nMy pockets so heavy that I can't walk steady\nNiggas copping ice we done done it already\nGot a gold grill but it's not from Eddie\nI ride big Chevys cause a nigga ain't petty\nI'm icy, so motherfucking snowed up\nLittle kids wanna be like Gucci when they grow up\nMe, Jeezy and Boo\nWe ain't hatin pussy nigga 'gon and do what you do\n'Cause we icy, so icy, we icy, so icy\n\n[Chorus: Lil Will]\nAll these girls excited\nOoh, you know they like it\nI'm so icy, so icy\nGirl don't try to fight it\nAll your friends invited\nI'm so icy, so icy\n\n[Verse 3: Boo]\nYeah, I'm hoppin' out the range wit the seats piped out\nYou can still see my chain even when the lights out\n'Cause that's how mobsters do it\nSpit a little game, give 'em that flossin' music\nI'm the man from the C-H-I\nThese lames runnin' 'round thinkin they so fly\nGot a little buzz but Boo been too high\nI'm pullin' hoes in the club and I don't even try\nI guess when she glance at my wrist, she wanna get my dick\nI tell her holla at Jeezy if you wanna pop Cris\nGet at Gucci Mane cause he on some hood shit\nAnd you know I'm in the cut, grippin' my .45\nLike let a nigga trip, naw we ain't runnin'\nWe just takin all your chicks, buyin' drinks, gettin' blunted\nGroupies, show you how to do this son\nWe throwin' out hundreds while you savin them ones, nigga\n\n[Bridge: Lil Will]\nI got so many rocks, in my chain and watch\nI know I'm the shit, my chain hang down to my dick\nI know I'm the bomb, just look at my charm\nI know I'm the shit, my chain hang down to my dick\n\n[Chorus: Lil Will]\nAll these girls excited\nOoh, you know they like it\nI'm so icy, so icy\nGirl don't try to fight it\nAll your friends invited\nI'm so icy, so icy\n\n[Outro: Lil Wil]\nI'm so icy, look at my charm\nMy, chain, hang, down, to my dick, hahahah", "image": "https://images.genius.com/0bfb10f124aefd38f2c50ca21e9f574a.500x500x1.jpg"}], "artist": "Gucci Mane"}