{"songs": [{"title": "D-Elite Part 2", "album": "Rock City", "year": null, "lyrics": "State ya name gangsta!\n\n(Tre' Little)\nTre' Little don status hold my dick\nSay ya label push the date back now that's what you get\nI came in this game like it's more than rap\nDog, I'm tryin' to destroy the salary cap\nThe Source is happy we came six covers its covered\nThat'll last about May, June well into the summer\nWhy talk about different colors for various coupes\nShit green fart Blue, oooh clever you\nHelp me ma' I'll take a shot at any one of y'all\nGot mami droppin' draws before the first phone call\nWe some gangstas study the ten crack commandments\nStay big worship Hail Mary that's how we live\nLay low good guys catch you with a hook I, know why you lie\nYa crew ain't quite like mine\nSpit it like ooh my, these labels like ooh my\n\nState ya name gangsta!\n\n(Cha Cha)\nIts the C-H-A, say it wit me niggas Cha Cha Cha\nY'all Cha Cha Cha\nYou cannot lie or deny these niggas ain't rah rah\nPut the barrel on the bridge of your nose and turn you cock-eyed\nSteppin to us not wise, told you how to get live\nGo in depth best with the finger next to the index\nSuch threats expect five guys, five techs\nMake they gats all sing in unison like a quintet\nThey don't say whodi, son, dun, or youngn\nYou can owe em and say hi and they greet you like \"Hey Guy\"\nWhat up though Nickel, Jah, Tre', X, and Cut Throat\nMy brethrens all veterans all throwin up sevens\nWhen we rock hits to the sky throw em up to the heavens\nUs and crews clash no more we built it from poor\nMe and Royce hit and restore what we were buildin before\nSo add a million sold or more when I get at you whores\n\nState ya name gangsta!\n\n(Cut Throat)\nCut Throat the living threat street shit to blueprint\nThe guideline rappers sideline until they bow down\nThem little guns y'all blow I stay on the low\nRap like this and work the scale like \"So\"\nTake it to the gutter we could duke or shoot it out\nSwitchblades pump gauge, whatever you about\nBurn you to ya hood we could bang for the work\nFor the building or the blocks do the thang to the dirt\nI'ma F**K-in fool crews DUCK and move\nStay in a F**KED up mood one F**KED up dude\nWhen its hot I, breathe in the heat don't even sleep\nI be knee deep in the beats that made me\nCertified gangsta specialize in Duct Tape\nLet you know how many fo' five slugs ya gut take\nShow ya favorite thug how to be a thug, top that (NIGGA!)\nTurn ya favorite drug into another drug, cop that (NIGGA!)\n\nState ya name gangsta!\n\n(Jah 5'9)\nJah da 5'9 speak and shake rhyme great history made\nThe street gangsta city flow race against time\nNever sign for cash my hustles the shit\nYou feel the breeze push past you get a grip\nMillennium game, earth tone keep it in range\nClose to the grey I rock fake niggas shouldn't doubt us\nSurrounded by crooks, full clips and fine weed\nChoice clothes my mind blocked seein fine foes\nLong nights bust those in small Christ\nNiggas playin themselves just thinkin we rhyme alike\nHow would you fight me I'm like ten families strong\nManipulation by song relate to it niggas\nHenny on the rocks toast to the real in God we trust\nCalm gladiator song navigator\nThem whole blocks gotta story tell\nAll of a sudden seasons change, your welcome\n\nState ya name gangsta!\n\n(Billie Nix)\nBillie Nix black man is here listen close\nSpittin just to niggas, X address the niggas\nMost niggas don't see right see light like its darkness\nNo guns in sight no might for the heartless\nWe run ya mics you write like you retarded\nNo offense but ya flow is slow and dense\nI know my niggas hearin the D ya smellin this\nYou smoke that what you wrote while broke, yellin rich\nDidn't know you shoulda spoke while broke sayin poor\nThen biggie up kick in the door play it some more\nThis is the evolution of emcee who dissin us?\nGettin Rah stick up nigga hand me ya listeners\nGet a job we here D-Elite touch it\nMatter fact, niggas is wack, wall street f**k it\nX government agent remember yo name\nRemember yo game you niggas won't be spittin the same, motha f**ka\n\nState ya name, gangsta!\n\nMy God!", "image": "https://images.genius.com/07b1a3fc8d90a21a4bc1e707522e5c82.600x600x1.jpg"}], "artist": "Royce da 5'9'’"}