{"songs": [{"title": "Mixed Emotions", "album": "Control System ", "year": "2012-05-11", "lyrics": "[Hook: Ab-Soul]\nOne time for my niggas poured up yup, match a line\nGet screwed up like the neck on Frankenstein\nPurple weed, purple drank, purple swag, purple tag\nWe be getting throwed, we be, we be getting throwed\n\n[Verse 1: Ab-Soul]\nJust copped a pack of Backwoods, I'm sitting high as hell\nThis OG kush suits this Honey Berry well\nThe lights are low, the mood is right\nI got a fo, that's right I'm tryna get throwed\nHit my nigga Agent, heard he bought an 8\nMy nigga Legend blessed me with a cup the other day\nHit my nigga Carver D, Dough Boy and YayCracc\nTell him it's a poe party, ASAP\nBumping out the speakers, coffee cups with lids\nThis way nobody accidentally ashing in my shit\nGot a few two liters and it's 'bout to go down\nPhenergan is the prescription of choice\nJust call us the Phenergan boys\n\n[Bridge: Ab-Soul]\nI do all this shit, just to say get off my dick\nYou think you know, but you have no idea\nThe lights are low, the mood is right\nI got a fo', who got a Sprite?\nWho got a Sprite? Who got a Sprite?\nI got a fo', who got a Sprite?\nI do all this shit, just to say get off my dick\nYou think you know\n\n[Hook: Ab-Soul]\nOne time for my niggas poured up, yup, match a line\nGet screwed up like the neck on Frankenstein\nPurple weed, purple drank, purple swag, purple tag\nWe be getting throwed, we be getting throwed\n\n[Verse 2: Ab-Soul]\nI got this funny little dream of buying out the bar\nThen flexing in my section like a fucking star\nThey ask me what I like to drink and I say I'm alright\nThen all you see is my purple Sprite\nGlistening off of the strobe light\nNo jolly ranchers please, this Ac' is all I need\nI hope it ain't cliché to shoot Pimp C a RIP\nAs well as DJ Screw since I made up this tune about lean\nBut as of late, all I see is poe like Section 8\nThe homie say he's got a few teens\nThat's three 16's and a whole lot of cream\nI crack a seal, then drop a deuce, now I got mixed emotions\nFrom here on out, it's slow motion\n\n[Bridge: Ab-Soul]\nI do all this shit, just to say get off my dick\nYou think you know, but you have no idea\nThe lights are low, the mood is right\nI got a fo', who got a Sprite?\nWho got a Sprite? Who got a Sprite?\nI got a fo', who got a Sprite?\nI do all this shit, just to say get off my dick\nYou think you know\n\n[Outro: Ab-Soul & BJ The Chicago Kid]\nComing down, still sipping\nDraped up dripped out, still sipping\nComing down, still sipping\nDraped up dripped out, still sipping\nI love the po', more than you'll know (I love, I love, I love)\nGotta let it show, I love the po', hey, yeah (I love the po')", "image": "https://images.genius.com/36147c3e9b6fcfa747233bb1c340f424.500x500x1.jpg"}], "artist": "Ab-Soul"}