{"songs": [{"title": "Own Drugs (O.D.)", "album": "Est. In 1989 2.5 ", "year": "2013-03-13", "lyrics": "[Hook: 2 Chainz]\nI ain't gotta fuck yo bitch, I got my own girl\nI ain't gotta smoke your weed, I got my own drugs\nI ain't gotta drink your drink, I got my own drugs\nI ain't gotta pop your pills, I got my own drugs\n\n[Bridge: 2 Chainz]\nI walk in the party with my own drugs\nGot my girl on the Molly with her home girl\nI really ain't stressin', I ain't even stressin'\nI really ain't stressin', I ain't even stressin'\nI ain't gotta fuck your bitch, I got my own girl\nI ain't gotta smoke you weed, I got my own drugs\nI really ain't stressin', ain't even stressin'\nI really ain't stressin', ain't even stressin'\n\n[Verse 1 : 2 Chainz]\nWhile you stressin' me, God keeps on blessing me\nI know how to make money, baby, this the recipe\nYour pussy get rest to peace, especially murder scene\nHit her from the back, she like, \"Hercules! Hercules!\" (tell 'em)\nStarted from a pot, then I took over the spot\nThen I took over the block, then I took over hip-hop\nThen I started geekin', then I started tweekin'\nThen I started reachin', then I stop speakin'\nFinished Monday, started on the weekend\nGas in my car, I got gas in my 'gar\nYou can smell it when I'm passing your car\nIts the last of the raw, all you need is a straw\nAnd when I ain't feelin good, all I need is a mall, showin' off, uh\nYour pockets on doughnuts (yeah)\nGot my posse out in broad day\nBeen up all night, its been a long day\nIm trying to get higher, fucking up my fung shui\n\n[Hook]\n\n[Bridge]\n\n[Verse 2: Juicy J]\nStyrofoam cups got flying spirt\nDouble cup full of Ms. Buttersworth\nBrownskin bitch in a tennis skirt\nWith some rolling papers, full of purp\nCouple of bad hoes in a penthouse suite\nYa'll broke niggas ain't in my league\nI swear this game been good to me\nIm a veteran in this game, why would I leave?\nReal niggas, thats all I see, Pimp C, R.I.P\nI'm up all night, like \"Fuck some sleep\"\nPush start button, like \"Fuck the key\"\nYour boy's too broke, can't fuck with me\nMy hoes too fine, can't fuck for free\nYa'll niggas out here savin' hoes\nI'mma start calling you niggas \"Justice League\"\n\n[Verse 3: Cap1]\nI'm on codeine, I'ma dope fiend\nGot Molly world for that party girl\nEcstasy, she want the best of me\nTurn her out, she a naughty girl\nYour bitch choose my girl, like\nI ain't gotta speak my wife, get her\nLickin' on me like an Optimo\nGet a boy a Sprite and now pour a pitcher\n450 for a zip of strong, codename: gas money\nMagic City, cuttin' up, bitch shakin' their ass for me\nFuck the bitch in my back seat\nIf she hit the window, she a crash dummy\nI'mma dope boy to get fast money\nAnd every stand I'm for me, I'm gone\n\n[Hook]\n\n[Bridge]", "image": "https://images.genius.com/843b9aebc7fcbc2effb40bfdc48a0ff5.500x500x1.jpg"}], "artist": "2 Chainz"}