{"songs": [{"title": "The Infamous", "album": "Blood Money", "year": "2006-05-02", "lyrics": "[Prodigy]\nJust when you thought it was safe to come out\nInfamous all in your face, in your mouth\nThat's right, niggas best to stay up in the house\nWatch we getting our money, for the two thou'\nNigga, P back out in the streets, so what now?\nStrictly for the ghettos and hoods, in your town\nPableek(?) got bundles of drugs in your town\nLike crack, coke and dope - remember me now?\nQueen Bridge motherfucker we'll blow your house down\nWe the big bad wolf that'll eat your food clown\nI ain't gotta huff and puff you know my style\nCalm as fuck, I just let my gun wild out\nI got cash motherfucker I could have you touched\nBut I rather be hands on with that son\nCertain things, you just gotta perform youself son\nWhen I start busting I don't stop till I hitting, c'mon\n\n[Hook: 50 Cent + Prodigy]\nEverybody got gangs everybody got clicks\nBut they ain't like this (the Infamous)\nEverybody can't afford to live the lifestyle\nOf the young, black and rich (the Infamous)\nYou ain't crazy, don't make me show you\nWhy they call us this (the Infamous)\nWe own the streets - who basically control\nThis rap shit - G-g-g-g-g-g-g-unit!\n\n[Havoc]\nWe got the most gangsta shit, the second most biggest projects\nWe sold the most crack, since '86\nWe don't handle a lot of pricks, we the most thug\nYou think you're dirty over there, but we're more dirtier\nWe last more longer than them; more songs than them\nMore money for us, more broads than them\nWe get the most love in the streets\nI had the most tattoos, ever since thirteen\nP got the most now; our guns are the most loud\nWith enough bullets to down mostly the whole crowd\nWe drink the most Henny, yeah me and Jake\nWe smoke the most weed, that's mostly the haze\nGet the most (?) kicked on a nigga's face\nGotta be the most idiot nigga on the face\nOf the Earth, to ever let the thought cross your head\nThat we're not the most likely to pop off kid\n\n[Hook]\nEverybody got gangs everybody got clicks\nBut they ain't like this (the Infamous)\nEverybody can't afford to live the lifestyle\nOf the young, black and rich (the Infamous)\nYou ain't crazy, don't make me show you\nWhy they call us this (the Infamous)\nWe own the streets - who basically control\nThis rap shit - G-g-g-g-g-g-g-unit!\n\n[Prodigy]\nRight now, I change guns with the season\nWhen I was young I bought Ninja Stars on Jamaica Ave\nHitting trees then; started hitting trees then\nWe ran the train on the girls and on my family dance schools\nWe was beasting, little young heaven\nI had the Rambo knife, and when I got my first gun I was cheesing\nI couldn't believe it; I had the power of life or death\nIn the palm of my hands, fiending\nBut quickly to be scheming; if you choose to front on me\nThat leaves me with no choice but to start squeezing\nAnd I hope they stop breathing\nBecause if they do pull through, in the hospital beds\nThey'll be squealing - talking to these D's man\nThey don't waste no time, they want answers\nEven if you're still bleeding\nHomey I'm on the fleezy\nI ain't got no time neither I'm making money off of this - it's too easy!\n\n[Hook]\nEverybody got gangs everybody got clicks\nBut they ain't like this (the Infamous)\nEverybody can't afford to live the lifestyle\nOf the young, black and rich (the Infamous)\nYou ain't crazy, don't make me show you\nWhy they call us this (the Infamous)\nWe own the streets - who basically control\nThis rap shit - G-g-g-g-g-g-g-unit!", "image": "https://images.genius.com/148e26f7441f249985c43919f5cdf8e4.500x449x1.jpg"}], "artist": "Mobb Deep"}