{"songs": [{"title": "Super Cold", "album": "Friend of the People: I Fight Evil", "year": "2011-11-24", "lyrics": "[Verse 1]\nCold blooded, chilly skin\nCan't touch it like your front wheel when it's wheely-ing\nWanna see Chilly free like Free Willy friend\nWanted to see Free Willy really swim\nI'm super cold, my jacket thin\nI'm two below like a marching band\nThat means I'm super-deep, you surface skim\nI'm the whole thing, you niggas 2%\nPut em up on that carton, I think I'm losing em\nBring all those St. Bernards in\nLet's get some booze in them\nYou know them dogs with them barrels on they neck\nAnd I'mma keep it cool like airholes on a Tec\nI be moving birds like a scarecrow's on the set\nPart dope-ass nigga, an old man winter\nChristmastime diamond singing carols on my chest\nStep up off the jet\nLooking like a Pharaoh in the flesh\n\n[Bridge]\nI'm super-cold!\n\n[Verse 2]\nI'm super-cold, my freezer deep\nMy cooler closed: air-conditioned seats\nI don't trust them niggas, they conviction weak\nThey be thawing out, my commitment keeps\nTwelve months, hope that well jumps\nSeems like selling souls, is havin' sales bumps\nI be in to win while your sales slump\nYour chances getting slim, mine on their 12th brunch\nAnd they smell lunch: Hercules Klump\nThrow my weight around\nAin't left the scale once\nAlways bear in mind: even with your white fur\nWe still polar opposites: you ice picks to icebergs\nI'm colder than Universal Soldier\nAngel on my back everywhere I'm at\nNiggas don't believe it just when I lay it down\nAnd when I get back up and see my angel on the ground..\n\n[Bridge] x8\n...super-cold\n\n[Verse 3]\nChicken soup for souls, now who could use a bowl?\nDon't be salty now, trying to reduce my snow\nCause I just move em out: Ice Man\nFresh out a mutant school, I ain't no student though\nBlack Shaun White and he skis, and he skates\nAnd he leaves all types of cold tracks all behind me\nAnd you can follow those if you ever wanna find me\nBetter dress warm or you might end up like the Shining\nNot that boy or that lady, but that nigga gone crazy\nPretty damn amazing: I can't get out\nSo I'm forced to ride this elevator anywhere it takes me\nBut when I hit my flow, I'm-a open up that door\nWon't be three stacks or your cousin, but just that super cold", "image": "https://images.genius.com/519da23233c0aee9cd94e2ea433cf9d8.320x320x1.png"}], "artist": "Lupe Fiasco"}