{"songs": [{"title": "Check Me Out", "album": null, "year": null, "lyrics": "Throw some motherfuckin' money in the air\nThrow some motherfuckin' money in the air\nTrigga, let's go\nLet's go, let's go\nLet's go, let's go\nThrow some motherfuckin' money in the air\nThrow some motherfuckin' money in the air\nTrigga, let's go\n\nStop. Pose. What's that?\nBend it over quick, throw your butt back\nTuned in for the mill, where the bucks at?\nShe see me spend a couple mill like fuck that\nShe wanna ride on it like a bus pass\nGive me smart brain and a dumb pack\nGo on poke out, thumb tack\nBack that ass up I'mma front that\nKnock it out the park. Let these other niggas bunt that\nTurn the music up, where the club at?\nThrow a couple stacks, where the 1's at?\nShout to all the women that know they got that come back\nGirl, you got that I can see it from the front back\nShe said \"Damn, they be hatin', where the love at?\nI said \"Damn that, you looking like you does that.\"\nHair up, damn, she done brought the fuckin' bun back\nNiggas shady, damn, bring the sun back\nBeat crazy, damn, bring the drums back\nThis yo' city, nigga. Damn, how I run that?\nForgot I was a singer, damn, bring the run back\nWoo!\n\n[Chorus]\nAye, Check me out doe\nI'mma keep it real with you\nAye Check me out doe\nI'm just tryin' to chill with you\nAye Check me out doe\nI'mma keep it real with you\nChe-Check me out\nAye Check me out doe\nI'm just tryin' to chill with you\nAye Check me out doe\nI'mma keep it real with you\nChe-check me out\n\nYou say you work hard, where you work at?\nGirl I go hard, let me work that\nSay you got drive, well reverse that\nI'mma beat it up. I'ma, I'mma hurt that\n\nSingle momma, yeah yeah I support that\nI don't judge baby, I ain't tryin to court that\n\nI don't play baby, I ain't tryin to sport that\nTalking 'bout its real when I know somebody bought that\n\nMy time money and you niggas can't afford that\nBad bitches in the studio where I record that\nRight now and I'm finna pipe down\nOnce I'm done this verse shit\nI'mma kill this pussy I'mma hearse it\nI'mma fool with it, super cool with it\nWhy you snoozin', I got a booze in it\nI took her panties and I put a pool in it\nThe flow stupid, its so stupid\n\n[Chorus]\nUh, check me out doe\nI'm in that Ralph Lo\nRed bottoms for the models, never Aldo\nCatch me ridin', Maserati with the top low\nAnd I get deep up in that pussy, then I outro\nBad bitch and the miles low\nOh, that's your main chick? That's my side ho\nShe a dime and she a dime so we don't know\nWhen I compare 'em it's like a chevy, a tahoe\nYo trigga' where the hoes?\nI'm in the Margielas, they like what are those?\nI got them guys jealous cause I'm getting dough\nShe said she never seen a ghost 'til she was in my rolls\nLookey here, I'mma keep it real with you\nGet it clear, I ain't tryin' to chill with you\nGive her here so I can put the steel in ya\nNow, shorty bust it open for a real nigga\n\n[Chorus]\nThis right here, this goes out\nTo all the motherfucking\nGetting money bitches in the house\nDon't stop let's work let's rock\nDon't stop let's work let's rock\nThrow some motherfuckin' money in the air\nThrow some motherfuckin' money in the air", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}