{"songs": [{"title": "Made You Look (Remix)", "album": null, "year": null, "lyrics": "(feat. Nas, Ludacris)\n\n[Intro: Jadakiss]\nI need it from the top, AHHH!\nThis is history baby\nCommissioner Steve Stoute, Lenny - ha!\nGod's Son, whattup?\nD-Block, whattup?\nBravehearts, whattup? Yeah\nYeah, yo\n\n[Verse One: Jadakiss]\nYo ain't nothin but trouble God\nWhen I kick in the door with D-Block, Bravehearts and the Double R\nDon't make me let the machine off\nThis is methadone music that you can lean off\n\"Made You Look,\" the remix with me up on it\nI copped your shit, now I break weed up on it\nAnd everything is real I see\nLike my niggas that been home but they only got a jail ID\nI helped the game, it ain't help me\nI'm top five dead or alive and that's just off one LP\nAnd, I still buzz, they feel cuz\nCause they know the flow's Ill just like Will was\nI'm just tryin to make sure that my sons wealthy\nOut of shape but I make sure that my guns healthy\nI'm a ape, you can't stand 'Kiss\nComin through the hood in a Aston Vanguish the color of dandruff\nThey said we jumped him, I just let the gun snuff him\nCopped P then turboed soon as they uncuff him\nThis goes out to all of your mans\nWhy put you in the verse when I can put in a coroner van\nD-Block\n\n[Chorus 2X: Nas]\nTHEY SHOOTIN! Ah made you look\nYou a slave to a page in my rhyme book\nGettin big money, playboy your time's up\nWhere them gangsters, where them dimes at?\n\n[Verse Two: Ludacris]\nYuh, woo! It's time to go, Luda let's go!\n\nI'm from the school of hard knocks, sneak peeks and low blows\nWhere X's mark spots and kitchens mark O's\nWhere love is gon' getcha and hate is gon' snitch ya\nAnd fingers squeeze triggers like boa constrictors\nIt's the, Mr. Luda, Jada and Nas\nAnd our bullets give you a deep tissue massage\nSo hear a song and dance while I make these ends\nYou never stood half a chance like Siamese Twins\nAHHH - THEY SHOOTIN, look in the barrel\nThen he made the front page of the Miami Herald\nOr Chi. Tribune, nozzles with silent doom\nWe in that A-Town Journal-list, filed with goons\nYou should print my information, quote my rhyme\nAnd keep me in between these New York and L.A. Times\nI was the victim of society, it's 'Cris the menace\nWith mo' shit out on the streets than evicted tenants\nWOOOOOOOO!\n\n[Chorus]\n[Interlude: Nas]\nUhh.. uhh..\n(BRAVE-HEARTS.. BRAVE-HEARTS.. BRAVE-HEARTS.. BRAVE-HEARTS..)\nJungle, Wiz, Nashawn!\nWe got 'em scared look\nWe got 'em scared they runnin\n\n[Verse Three: Nas]\nYo, I grasp the ratchet, the blinker, the biscuit, the burner\nThe heat, the toaster, the twister you meetin your owner\nThe banger, the hammer, the flamers I aim at the cannons\nAnd can ya, manhandlin ya, you'll be famous like cancer do\nAnd cut, that's the end of your movie\nPretendin you actin like you and your mens'll come shoot me\nMy tennis shoes Gucci, old school pea soup green\nJean Lee suit on Beaver, clicko champagne\nFriday the 13th my CD drop, I rhyme to more Base than EZ Rock\nI'm Jason, call up P.D. watch\nThem Bravehearts, Jungle and Wiz and Nashawn\nIll Will rasta Lake, never revealin his face on\nTV or pictures or even them niggas\nSorry that I made you wait long, glad them fakes gone\n[beat scratches out]\nWE SHOOTIN! Squeezin them triggers with Luda beside me\nMe and 'Kiss get Luniz of weed, set to Styles P\nTell him hold his head, God's Son got him we made y'all look\nFrom San Quentin to Riker's Island to.. [fades out]", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}