{"songs": [{"title": "Different Languages", "album": "Malice N Wonderland", "year": "2009-12-08", "lyrics": "[Intro: Jazmine Sullivan]\nYou make me say [x3]\nOhh\nYou make me say [x3]\n\n[Hook: Jazmine Sullivan]\nI'm from the east coast but I'm falling\nSo hot a nigga got me crip walking\nI'm from the suburbs but it's that good\nMake a good girl wanna get to the hood\nYou make me say (got me speaking different languages [reversed]) [x3]\nSo good got me speaking different languages\n\n[Verse 1: Snoop Dogg]\nVisualize like as I do\nAll I want to do is like be inside you\nRide you, try to find you, fill you, revive you\nGo on with your bad self baby baby cause I do adore\nAnd I give you more\nPut it on you all the time you know mi amor\nWe got for sure pure, I'll even allure\nDon't trip I ain't leaving you for\nJay got Beyonce, I got Shante\nWith no entree, that's my baby\nYou know the thing about when I bring 'em out\nFeels so good I had to sing about\nGet it, get it now, we flying out of town, checking in a suite\nPedicure on my feet\nMiss Bow Wow, queen of the town\nAiyyo Jaz, tell 'em how I put it down\n\n[Hook]\n\n[Verse 2: Snoop Dogg]\nIs it the way you look? Is it the way you walk?\nIs it the way you cook? Is it the way you talk?\nI think it's all of the above\nNo playtime in the daytime making love\nKids go to school, we can act a fool\nSkinny dip in the pool, do it real smooth\nMiss Bow Wow, queen of the town\nAiyyo Jaz, tell 'em how I put it down\n\n[Hook]\n\n[Bridge: Jazmine Sullivan]\nHey baby, ooooooohhhh\nGot me going out of my head\nOoooooohhhh\nGot me saying things I don't understand\nLadies, if your man make you say\n(Got me speaking different languages [reversed])\nHe's here to stay, he's here to stay\nLadies, if your man make you say\n(Got me speaking different languages [reversed])\nHe's here to stay, he's here to stay\n\n[Verse 3: Snoop Dogg]\nUhh, oh yes I am\nThis my plan, you my girl, I'm your man\nTake your pain, take my hand, take my name\nMake my kids, do your thing\nAin't no game, show no shame\nIf I'm the boss, boss lady must be your name\nSo I got you, got 212\nPut your face on my back, brand new tattoo\n20 years in the game, what love won't do\nA lot of women want me but I want you\nYou look cute when you smile, so I renewed our vows\nNowadays I ain't moving that wow, I changed my style\nIt might happen to you\nWhat gotten to me, shit I gotten to you\nAnd start rapping 'bout things like love and being true\nNow maybe we can make another baby or two\n\n[Hook]\n\n[Outro: Jazmine Sullivan]\n(Got me speaking different languages [reversed])\nYou make me say (Got me speaking different languages [reversed]) [x2]\nSo good got me speaking different languages", "image": "https://images.genius.com/a9730b160b9e646d986f0b4659d2dc40.800x800x1.jpg"}], "artist": "Snoop Dogg"}