{"songs": [{"title": "Coolaid Man", "album": "Coolaid", "year": "2016-06-28", "lyrics": "[Intro]\nHey, Snoop Dogg, can you pour me another glass of that Coolaid?\n\n[Verse 1]\nOn the set, my nigga, I'm my own man\nUpgrade, just like your phone game\nBig Snoop Dogg, I do my own thing\nAnd I stays in my own lane\nMy rap style, is dynamite\nA lot of y'all niggas do sound alike\nYou do it how you do's it\nSee, you can blame it on the drugs, and you can blame it on the music\nWhere I come from, if you sound like another nigga\nThat's called bitin', yeah, you the other nigga\nLet my demeanor be the meaning, got you screamin'\nWhile you leanin', now you fiendin', while you dreamin'\nTo have a big car, rap star\nTen-room mansion with a lake in your backyard\nSo disobedient, flavor is the main ingredient\nAnd you lack it, it's all in your jacket\n\n[Hook]\nBut I'm hot, and as cool as a fan\nYou bitches drinkin' lemonade, I'm the Coolaid Man\nStandin' on the corner with a Coolaid stand\nCool as a fan, yeah, bitch, I'm the Coolaid Man\nI'm hot (he's cool), but as cool as a fan\nBitches drinkin' lemonade, but I'm the Coolaid Man\nI'm standin' on the corner with a Coolaid stand\nCool as a fan, yeah, bitch, I'm the Coolaid Man\nNow drink up, Mr. Coolaid Man, Mr. Coolaid Man\nNow drink up, yeah girl that's the Coolaid Man, they call him the Coolaid Man\nNow drink up!\n\n[Verse 2]\nThe reason that I say that I'm the Coolaid\nLook at all the flavor that I gave to the gizzame\nJust add water, it don't get no hotter\nYou got your whole get-down from the Doggy Dogg father\nNever mind it was never mines\nInquire intellectual, clever minds\nBet a dub that this shit pop\nBitch niggas mix love with this hip-hop\nJust to be on, now what the fuck are we on\nLBC, we've been known to get our G on\nThey call me Don Corleone, that's the corner he on, P-I-M-P on\nShe a freak of the week, I'm teachin' niggas how to eat\nCause I'm deep in the streets\nLook, don't get it fucked up loc\nCause every now and then, niggas need a line of this dope\n\n[Hook]\nCause I'm hot, and as cool as a fan\nYou bitches drinkin' lemonade, I'm the Coolaid Man\nStandin' on the corner with a Coolaid stand\nCool as a fan, yeah, bitch, I'm the Coolaid Man\nI'm hot (he's cool), but as cool as a fan\nBitches drinkin' lemonade, but I'm the Coolaid Man\nI'm standin' on the corner with a Coolaid stand\nCool as a fan, yeah, bitch, I'm the Coolaid Man\nNow drink up, Mr. Coolaid Man, Mr. Coolaid Man\nNow drink up, yeah girl that's the Coolaid Man, they call him the Coolaid Man\nNow drink up Mr. Coolaid Man, Mr. Coolaid Man\nNow drink up, yeah girl that's the Coolaid Man, they call him the Coolaid Man\nNow drink up!\n\n[Outro]\nS-N-double-O-P, Mr. Coolaid Man, that's who he be\nS-N-double-O-P, Mr. Coolaid Man, yeah, that's who he be\nNow drink up (hot diggity dog)\nDon't let the snare hit you, baby\nNow drink up!\nMr. Coolaid Man, he's cool", "image": "https://images.genius.com/a417abe2f61213b3db18f28de7cdbc86.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}