{"songs": [{"title": "Druggys Wit Hoes", "album": "Setbacks", "year": "2011-01-11", "lyrics": "[Intro: Schoolboy Q]\nGot the baddest hoes, got the finest weed\nEverywhere I goes, they know who I be\nNow take a picture, now let me be\nLet me do me, let me be a fiend\n\n[Verse 1: Schoolboy Q]\nI'm shooting up, everyday I'm tryna ball\nWith my little China doll, got my back like spinal cord\nThat pistol on me, yeah that .45\nNigga feeling do or die, fuck tryna be unified\nShe over there, wanna be over here\nSo I pull her hair, fuck her from the rear until she there\nHow are you? Shit, I go by Q\nHey ho, now what it do?\nGot a king size and it's built for 2\nI been meaning to be leaning up in that pussy\nLike Promethazine and she took the semen my willy beaming\nOn any given Sunday that pussy a runway\nShe did it the fun way, smash it like Ticante\nShe did me hombre no need for nombre, we screaming olé and olé\nWe scored no goalie, she's just a groupie\nAnd group-a, gave top like toupée, bum rushed that coochie\nHer pussy lukewarm like long lay, her head be Bombay\nLike gin and OJ, took a shot, and I won like gameday\nYes I'm the sensei, comprende? Got a ticket, one way\nOh, you don't really see it that I'm gone?\nPass the baton, black, real rap, spit to the break of the dawn\nNigga we all that, we all that, see that's the shit that we be on\nNigga this Black Hippy, nothing else, beat so bake I'm 'bout to melt\nAll my shit be prison felt, TDE we got the belt\nHold it down if nothing else, swear to God, on my life\nWhere it's at? Shit on sight, down to ride, fuck a bike\nIf I'm locked then fly a kite, keep a strap on like a dyke\nTDE we got the belt, hold it down if nothing else\n\n[Hook: Schoolboy Q] (Ab-Soul)\nGot the baddest hoes, got the finest weed\nEverywhere I goes, got the finest weed\nThe finest weed, the finest weed\nEverywhere I goes, got the finest weed\n(Marijuana, hydro, pussy, ho, ass, titties)\n(Marijuana, hydro, pussy, ho, ass, titties)\nGot the baddest hoes (Ass, titties)\nGot the finest weed (Pussy, ho, ass, titties)\nEverywhere I go (Marijuana, hydro, pussy, ho, ass, titties)\n\n[Verse 2: Ab-Soul]\nQuincy, where the weed at? You know I really need that\nYou know we go back, 'member when I had you smoking Blacks?\nIn the back when Top was gone, now Top is back\nThat mean we in Juice garage, you know you my brethren, we superstars\nStill mobbing the 7/11, fuck a car\nTop Dawg, ya little fists ain't up to par\nGot the baddest hoes, burn the finest kush\nThat means I'm a botanist slash gynecologist\nPlease hold your apologies for sleeping, it was prophecy\nI just need some time and let these demons climb up out of me\nYou know the ones that got me sipping these mickeys 'til I'm numb\nHaving your missis' tongue missing from her mouth, in around my nuts\nRing around the rosie, pocket full of dust bunnies\nThis hip hop ain't done none for me\nKnew I was to be a star when I had a cubby\nWatching Ferngully, now everything I puff fluffy and I'm so comfy\nWatch the company I keep in case they come for me\nAll these bitches in your dreams drinking cum from me\nThis blue dream steam in the lungs of me, oh, buddy (Soul!)", "image": "https://images.genius.com/4e5d39814aadb84f19c68cb7ca188a5d.950x946x1.jpg"}], "artist": "ScHoolboy Q"}