{"songs": [{"title": "Ghetto Dreams", "album": "Based on a T.R.U. Story", "year": "2012-08-14", "lyrics": "[Intro: 2 Chainz & John Legend]\nYeah, preach, preach\nMy ghetto dreams always turn to ghetto nightmares\n\n[Verse 1: 2 Chainz]\nAt night I can't sleep, I toss and turn\nCandlesticks in the dark, I was whippin' the hard\nI was gettin' the broads, they like \"Who the hell is that?\"\nI was dealin' sacks, you lookin' at a nigga that drove to Hell and back\nCharismatic, I was raised by an addict\nWith money in the attic, got guns while you at it\nAt this present time, I'm out of my mind and that's a habit\nStill got 'em waitin' in line, they gotta have it, yeah\n\n[Chorus: John Legend]\nLast night was the first night I got sleep (Oh)\nTossin' and turnin' for two or three weeks (Oh)\nMy nightmares are triggered by bad memories (Oh)\nLord, send me an angel right now while I'm havin' ghetto dreams\n\n[Verse 2: 2 Chainz]\nCold sweats listenin' to the old Sweat\nOne, two, that's a whole check (One, two)\nNah, for real, nigga this a whole check (Check)\nJust horsin' around, Polo sweats (Yeah)\nUsed to dream 'bout a bigger couch (Uh)\nWoke up in a bigger house, c'mon\nCommas in my bank account\nSo much money I had to let the banker count\n\n[Chorus: John Legend]\nLast night was the first night I got sleep (Oh)\nTossin' and turnin' for two or three weeks (Oh)\nMy nightmares are triggered by bad memories (Oh)\nLord, send me an angel right now while I'm havin' ghetto dreams\n\n[Verse 3: Scarface]\nIt's like the world stand still\nYesterday your little man got killed\nAnd all he ever wanted was a bank roll\nBut he died too young 'cause the game's cold\nMost niggas ain't know or they just think slow\nOnce you get in, you gots to leave, but you can't though\n'Cause freedom make a motherfucker evil\nTo the point, down your ass when he see you\nLet's take that needle, fill it with poison\nInject the ghetto with the drug, paranoia\nGot you lookin' at your homeboy sideways\nAin't no honor among thieves, is it nowadays?\nThey tell me crime pays, but I don't think so\n'Cause every criminal I know is in the clink, yo\nA nigga in the game right now\nMust be workin' for them people 'cause that shit played out\n\n[Outro: John Legend]\nI lay awake in my four corner room, tinted candles\nYeah\n\nMy ghetto dreams always turn to ghetto nightmares", "image": "https://images.genius.com/0855f72cd21e5220ad89c1cc26c16d73.957x957x1.jpg"}], "artist": "2 Chainz"}