{"songs": [{"title": "LLC", "album": "Queen (Bonus Version)", "year": "2018-08-10", "lyrics": "[Chorus]\nI just took her name and made that bitch a LLC\nStuff a couple stacks up in there, bitch, get on your feet\nYou'd make twice as much if you switch it up, just to see\nTo you, he's rich and famous, but he's just a guy to me\n\n[Verse 1]\nI feel like I'm King Kong, name still going ding-dong\nIt's two girls gettin' more money, and they don't rap, they sing songs\nI stay with that pink on, pink furs and them pink thongs\nGoons out if they blink wrong, think hard, but don't think long\nPink Friday had Eminem, spit hard but I'm feminine\nIconic trio on Monster, Goblins and Gremlins\nWhat's left that I didn't do? You bit the forbidden fruit\nYou thought you'd get my spot? Who the fuck was kiddin' you?\nTook a lil' break, but I'm back to me\nTryna make a new Nicki, where the factory?\nThey'll never toe to toe on a track with me\nThere'll never be another one after me\n'Cause the skill level still just a half of me\nBlasphemy, my niggas will blast for me\nAll these low IQ hoes baffle me\nTell 'em that I wash bitches take a bath for me\nBunch of trophies in my crib like a athlete\nI see them giving fake love but that trash is weak\nMan, you know that I ripped, every rapper beat\nYou know Nicki gon' eat, Bon Appétit\nUsed to get real hype off a half a mil'\nUsed to get real high off a half a pill\nWe don't pay niggas to front like they like my shit\nWe don't pay niggas to come in and write my shit, uh\n\n[Pre-Chorus]\nNow carry on, now carry on\nNow carry on, now carry on\nSwish, swish, I'm just gettin' my Curry on\nG6 flow, all Louis V carry-ons\n\n[Chorus]\nI just took her name and made that bitch a LLC\nStuff a couple stacks up in there, bitch, get on your feet\nYou'd make twice as much if you switch it up, just to see\nTo you, he's rich and famous, but he's just a guy to me\n\n[Bridge]\nYou made me, you made me, yeah\nYou made me, you made me, yeah, yeah\nOn blood, you made me, you made me, yeah, yeah, yeah\nYou made me (Okay), you made me (Haha, uh)\n\n[Verse 2]\nYo, you made me do it, hoe, I told you, get low (Told you get low)\nI'm popping tens, but they gotta be yellow\nI'm New York Nick, I'm ballin', where Carmelo? (O.K. 'Melo)\nI'm wavy, word to Shawty L-O, hello\nHow your jacket say Porsche and you never rode a Porsche?\nHow you supposed to make the quota when you never went North?\nHow the fuck you got Ferraris when you never went sport?\nAll that hoopin' and hollerin', still ain't scorin' on the court (Rrrr)\n\n[Bridge]\nYou made me, you made me, yeah\nYou made me, you made me, yeah, yeah\nOn blood, you made me, you made me, yeah, yeah\nYou made me (Okay), you made me (Haha)\n\n[Verse 3]\nAyy yo, look at what they made me do, they made me do\nSwitched the foreign on 'em, navy blue to baby blue\nLook at how they started pussy poppin' when 80 flew\nAll my niggas move that Britney, Ari, yeah, Katy, too\nNiggas gassed on the really though, gas I pumped them\nStraight trash on the really, yo, yes, I dumped him\nPush the limits, I'm a pushy bitch, yes, I bumped him\nPushed past being filthy rich, ask I trumped them\n'Cause I scare her, scare her, my biggest era, era\nNever been clearer, clearer, don't force it, Farrah, Farrah\nBecause you'll never be me, that's word to Bella, Gigi\nDolce Gabbana, DG, pretty gang rated PG (Woah)\n\n[Pre-Chorus]\nNow carry on, now carry on\nNow carry on, now carry on\nSwish, swish, I'm just gettin' my Curry on\nG6 flow, all Louis V carry-ons\n\n[Chorus]\nI just took her name and made that bitch a LLC\nStuff a couple stacks up in there, bitch, get on your feet\nYou'd make twice as much if you switch it up, just to see\nTo you, he's rich and famous, but he's just a guy to me (guy to me)\n\n[Outro]\nOn blood, you made me, you made me\nYou made me, you made me, yeah, yeah\nOn blood, you made me, you made me, yeah, yeah, yeah\nYou made me (Okay), you made me (Haha)", "image": "https://images.genius.com/15a79e9b319ecd94a9131a5bc8bbd010.1000x1000x1.jpg"}], "artist": "Nicki Minaj"}