{"songs": [{"title": "Lights Turned On", "album": "EP", "year": "2011-03-08", "lyrics": "[Verse 1]\nSmall chick with a fat ass\nDid I say that out loud? Let me back track\nI know my game ain’t that bad\nHave you ever made out with a Gap ad?\nAnd girls want what they can’t have\nSo I don’t text back when the screen flash\nYou love me? You mean cash\nNeed a friend you can fuck, I can be that\nCrush girls now, couldn’t last year\nOh, you like me now? Well that’s weird\nLast year you were chillin’ with Lil Wayne\nNow you wanna pretend like my feelings is still the same?\nMy work is my playtime\nI need you to understand and to stay fine\nDo this and I just might wife you\nLet me poke you, ma, Raichu\nFuck your life\nI don’t really think I drank enough tonight\nLooking at you, make me wanna fuck for life\nLame ass dudes gon’ suck tonight\nBut so are these girls, am I wrong or right?\nGirl, do somethin’ to me\n“Nah, baby, you way too hood for me”\nY’all girls have never been good for me\nWatch a nigga take over, mutiny\nI wanna fuck with the lights on\nHey, girl, let a python slide on\nStay sick, infect me, Lysol\nI’m on the edge, they hoping that I might fall\nI make it work, I’m running with a new crew\nAnd we do dope shit you ain’t used to\nFor me, by me, fuck Fubu\nThis girl never heard of me, go and check YouTube\nI got a house with a dope view\nSee the ocean, dope shit, you an ’06, I’m an ’02\nBut enough about high school\nI’m getting laid, or I’m getting lied to\nYou my stand-in Cameron, let me be your A-Rod\nYou number one in The Pack, Based God\nShould I say something dumb to give us something to fight about?\nNever mind, lights out\n\n[Chorus]\nI want the lights turned on\nShow me how you do it\nShow me what you doing, I don’t wanna lose\nHave them lights turned on, show me what you doing\nShow me what you do to me, me\n\n[Verse 2]\nSwag\n2:30 and we still making progress\nTalking on Twitter, see where to go next\n3:30, man, where did the time go?\nI’m chilling with this Asian chick I met in Chicago\nShe look like the Social Network chick\nExcept for her ass is twice as thick, man\nJust wanna bite that shit\nWhere the fuck did my license went?\nI must've left it at the other place\nI rent a loft downtown with a ton of space\nYeah, we doing stupid shit, have stories when I’m older\nBut I don’t wanna see pictures of us on Vulture\nNever thought about a year ago\nI’m chillin’ out with the friends at the Super Bowl\nThings change like a motherfuck\nThat’s why I wild out, keep the city up\nUh, I talk a lot about the girls in my songs\nBut you are different from the girls in my songs\nStop talking ’bout the girls in my songs\nIf you don’t like it, I can just take you home\nMore green than the top of these tree trunks\nLeave your boyfriend here, ’cause he bunk\nShe like, “I’m not a slut”—speed bump\nBy the way, what’s your name? ‘Cause we drunk\n\n[Chorus]\nI want the lights turned on\nShow me how you do it (yeah, we drunk)\nShow me what you doing, I don’t wanna lose (we drunk)\nHave them lights turned on, show me what you doing (I’m drunk)\nShow me what you do to me, me\nI want the lights turned on\nShow me how you do it\nShow me what you doing, I don’t wanna lose\nHave them lights turned on, show me what you doing\nShow me what you do to me, me\n\n[Bridge]\nI want the lights turned on\nShow me how you do it\n(I got to get high)\nShow me what you doing, I don’t wanna lose\n(I need to get high)\nHave them lights turned on, show me what you doing\n(I got to get high)\nShow me what you do to me, me\n(I got to get high)\n\n[Outro]\nI gots to get high\nI need to get high\nUh, I needs to get high\nUh, I gots to get high", "image": "https://images.genius.com/be9197ecbcd58f7631a1c17709d6dff2.500x500x1.jpg"}], "artist": "Childish Gambino"}