{"songs": [{"title": "Light Up", "album": "Thank Me Later", "year": "2010-06-15", "lyrics": "[Verse 1: Drake]\nUh, I've been up for four days, gettin' money both ways\nDirty and clean, I could use a glass of cold Spades\nRolexes, chauffers and low fades\nI keep thinkin', how young can you die from old age?\nThey always tell me: \"Nobody's workin' as hard as you\"\nAnd even though I laugh it off, man, it's probably true\n'Cause while all of my closest friends out partyin'\nI'm just here makin' all the music that they party to\nBut party on, party on all night, nigga\nI got these new rappers nervous: prom night, nigga\nI grow tired of these fuckin' grown man liars\nStorytellers, they ain't even need a campfire\nUh, but I just want to tell the truth\nBefore one of these haters load a couple shells and shoot\nThe shit feel like when Fredro Starr\nWas in Sunset Park stuntin' hard in his yellow goose\nAnd I'm a motherfuckin' missed target\nBut a target nonetheless, and I just started\nWas that directed at moi? Can't be\nThey must be talkin' to themselves, Hov: hands free\nYeah, and I'm just fillin' up this daily planner\nGettin' busy 'cause I'm a star: no spangled banner\nJealous dudes get to talkin' in they music\nAnd I just say I wrote it for your girlfriends: Kelsey Grammer\nYeah, that's what life becomes when you're doin' you\nWelcome to Hollywood, don't let this town ruin you\nAnd if you pillow-talkin' with the women that are screwin' you\nJust know that she gon' tell another nigga\nWhen she through with you\nDon't get impatient when it takes too long\nDrink it all, even when it tastes too strong\nYeah, I got to feel alive, even if it kills me\nPromise to always give you me, the real me\n\n[Chorus: Drake & Jay-Z]\nWho would've thought I'd be caught in this life?\nLet's celebrate with a toast and get lost in tonight\nAnd make it all light up\n(Ay Guru tell, tell homegirl to open that Ace right there...)\nWait until the sun goes down\nWe gon' make this bitch light up\nEven when the sun goes down I'ma make it go\n\n[Verse 2: Jay-Z]\nOww, hoes turn they heads like owwwls\nI'm the man of the hour\nTriple entendre, don't even ask me how\nCon Edison flow, I'm connected to a higher power\nBright lights'll make your whole city light up\nA trillion-watt light bulb when I'm in the night club\nI just landed in that G450\nCaught the Mayweather fight 'cause the satellite was crispy, uhh\nY'all can miss me with the money talk\nThe smart money's on Hov', fuck what the dummies talk, uhh\nI don't do too much bloggin'\nI just run the town, I don't do too much joggin'\nMm, I ain't got a scar yet\n'Cause you fuckin' around with me and my dogs is far-fetched\nDrake, here's how they gon' come at you\nWith silly rap feuds, tryin' to distract you\nIn disguise, in the form of a favor\nThe Barzini meeting, watch for the traitors, uhh\nI done seen it all, done it all\nThat's why none of these dum-dums could done him off\nThe summer's ours, the winter too\nTop down in the winter, that's what winners do\nAnd to these niggas I'm like Windows 7\nYou let them tell it, they swear that they invented you\nAnd since no good deed go unpunished\nI'm not as cool with niggas as I once was\nI once was cool as the Fonz was\nBut these bright lights turned me to a monster\nSorry, mama, I promised it wouldn't change me\nBut I would have went insane had I remained the same me\nFuck niggas! Bitches, too!\nAll I got is this money — this'll do\n\n[Chorus: Drake]\nWho would've thought I'd be caught in this life?\nLet's celebrate with a toast and get lost in tonight\nAnd make it all light up\nWait until the sun goes down\nWe gon' make this bitch light up\nEven when the sun goes down I'ma make it go", "image": "https://images.genius.com/f0994c69f0994bc6b307070ecb02d6cd.1000x1000x1.jpg"}], "artist": "Drake"}