{"songs": [{"title": "On Top of the World", "album": null, "year": null, "lyrics": "[Produced by J. Cole]\n\nTop, top top, top of the world!\n\nUh!\nI'm on top of the world (Yeah) and I can't get no higher (Uh uh)\nAnd if I fall, waitin' on me it's a fire (Yeah)\nBut in the meantime I get whatever I desire (So)\nSo if I told you that I'd stop, I'd be a liar (Ok)\nAnd nah, I ain't worried 'bout the things I do (Uh uh)\nIt might be more than a plane's eye view\nBut uh (but uh), ma I'm on top of the world (Uh uh)\nI'm on top of the world\n\n[A.L.]\nUh!\nFirst off, uh, rest in peace Track Willie\nRidin' with me cus, back then nobody pulled for me (Whoo!)\nNow I sit back reclined and shine it's all fine\nCus the flow merit status was before my time\nI remember daydreamin' when I bust like the semen\nOf a heater, said the truth and nobody believed him (Uh uh)\nNow the story's fabricated, the public is elated\nThat somebody from the west considered the next greatest (Who's next)\nThe Prince (haha), and don't get it twisted (Uh huh)\nI spit from the soul but the steez is just gifted\nI lived it, talked about him (yeah), ridin' now, we'll walk about it (yeah)\nDeath of Cornballs like chalk, put the line around it (Haha)\nOn some D.O.A. shit\nNo gangsta reality's as real as it gets (Fo' real)\nI remember writin' rhymes in the halfway house (Uh huh)\nNow I'm sittin' at the top, there's somethin' to talk about\n\nI'm on top of the world (Yeah) and I can't get no higher (Uh uh)\nAnd if I fall, waitin' on me it's a fire (Yeah)\nBut in the meantime I get whatever I desire (So)\nSo if I told you that I'd stop, I'd be a liar (Ok)\nAnd nah, I ain't worried 'bout the things I do (Uh uh)\nIt might be more than a plane's eye view\nBut uh (but uh), ma I'm on top of the world (Uh uh)\nI'm on top of the world\n\n[J. Cole]\nUh!\nThese words go together like a verbal collage\nIt's murder how the words'll collide\nAnd bring you further from where murderers lie\nAnd maybe you could see a mill, no not no burgers or fries\nBut give you food for thought, my nigga this is Gerber with rhymes\nServin' up lines for your child like mine, nigga this live\nSo you think you seen a style like mine, it's a mirage\nBut I, I'll be obliged like Mary J\nThen show you how to strive, when it die like everyday\nAnd nigga stay in court like Perry Mason or Gary Payton\nNew shoes up on his feet like every week, his mom's interogatin'\nLike where you been? Who you been with?\nScared he runnin the streets with them freak and them nitwits\nLook up in his face, she see the fatherly resemblence\nRead him more than a book\nScared he inherited way more than just looks\nBut uh, mama I'm on top of the world\nUh! I'm on top of the world\nI'm on top of the world\n\nI'm on top of the world (Yeah) and I can't get no higher (Uh uh)\nAnd if I fall, waitin' on me it's a fire (Yeah)\nBut in the meantime I get whatever I desire (So)\nSo if I told you that I'd stop, I'd be a liar (Ok)\nAnd nah, I ain't worried 'bout the things I do (Uh uh)\nIt might be more than a plane's eye view\nBut uh (but uh), ma I'm on top of the world (Uh uh)\nI'm on top of the world!", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}