{"songs": [{"title": "Genesis", "album": "Genesis", "year": "2001-11-27", "lyrics": "[Busta Rhymes]\nGenesis, Genesis\nGenesis, Genesis\nGenesis, Genesis\nGenesis, Genesis\n\n[Hook]\nAs we welcome you all to the future\nOh! We come to give you that\nOperating like we be official\nYeah! We come to multiply\nAnd we're plannin the scheme for the long run\nYeah! Our shit be always right\nEvery move you'll see how it's related\n\n[Busta]\nGenesis, Genesis, Genesis\n\n[Hook]\n\n[Busta]\nGenesis, Genesis, Genesis\n\n(Verse 1)\nWhile we continuously stay sculpturin bombs\nLove unconditional greetings with opening arms\nAnd for my worthy niggas I'mma die tryin for y'all\nWith the blessing of an angel's tear cryin' for y'all\nBack to the foundation, takin you under back where it all started\nWith a whole new beginnin and a brand new hunger\nStarvin to where my skin was suffocatin my ribs\nNow we got bitches interior decoratin my crib\nTouch the love I got like you holdin my heart in my hand\nAnd watch my manifesto, shit was all a part of the plan\nThe fashion that I choose to deal with this shit\nSometimes it's so hard to describe the passion that I feel for this shit\nHow many struggles I survived just to eat this meal\nNever thought y'all meet a nigga that could be this real\nFlipmode up in this bitch now let me make you aware\nToo late for turnin back my nigga cause we takin it there\n\n[Hook]\n\n[Busta Rhymes]\nGenesis, Genesis, Genesis\nAnd leave!\n\n(Verse 2)\nAnd leave a mark until it's deep in the floor\nY'all niggas fucked up never should've let let me get my feet in the door\nAnd then I step through, FUCK wipin my feet at the door\nI be the deacon I'm beatin niggas and speakin the raw\nStrictly raw shit is what niggas be seekin me for\nTestin my strength, that's what the devil's try to weaken me for\nC'mon, yes and y'all off to the next step.. for sure\nRep and make you wanna accept more\nNiggas analyze the jewel that I reveal in a rhyme\nI'm like somethin that has evolved about a million times\nPeep the display with all the new features\nThe way we really doin it, these mu'fuckas probably wouldn't believe us\nFlipmode Squad by all means, a pledge of allegiance\nWith the great feelin of people like the comin of Jesus\nWhile a lot of other niggas don't be tellin you nothin\nThat be the same bullshit that's always pushin my buttons\nGodly is how we rep this undeniable force\nYou like a weak preacher, swearin smacked dead on a cross\nKick niggas like the two back legs of a horse\nChop ya fingers for tryin' to put your hands in the sauce\nSometimes I think that it would be best if you run\nAnd do yourself a favor, cause you got your whole life ahead of you son!\nA whole new thang startin for me\nSmell so much ass in a spot, the beat got the world fartin for me\nWhen I spit you know I always love to garnish it hard\nWhile you love-it hate-it niggas trying to tarnish the God\nI know some dudes that would love to bring the hatred to y'all\nWhile I continue to bless you with shit that's is sacred to y'all\nEven if I had to bend you in place\nI always put it down and rep my niggas from the most genuine place\nFrom my street corner niggas to my live niggas everywhere\nToo late for turning back, we takin it there\n\n[Hook]\n\n[Busta: repeat 35X]\nGenesis", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}