{"songs": [{"title": "Solidified", "album": "Free Agents - The Murda Mixtape", "year": "2003-02-25", "lyrics": "[Intro: Prodigy]\nYeah you know the shit don't stop, never, never\nAs we continue on\nWith more of this drama for yo' ass\n{\"She asked me why..\"}\n\n[Verse 1: Prodigy]\nYou niggas always startin somethin\nAnd beefin with rappers, why our music so violent\nAnd so dramatic, where's the love?\nWhy y'all go so much static\nIs it real for real or all for sales?\nI'm like, \"Shorty you must be sick\"\nWe been gettin burned like the Waco kids\nI don't need to diss rappers for recognition\nYou better check the files: Infamous, Hell on Earth, Murda Muzik\nYou can't be SE-RIOUS\nWe created this drama shit, we set the trend\nWe taught you niggas bout diamonds and guns\nAnd numerous ways we choose to earn funds\nWe veterans, we got a decade of albums\nNiggas done came and went, and we still poppin\nOur name is carved in stone\nEven the new blood know, we ain't no joke so\n\n[Hook]\nLet us solidify this - what's that?\nWe been solidified this - but of course!\nLot of new rappers and young kids - uh-huh\nThey all love +The Infamous+ - but of course!\nWe been for this music Dunn - c'mon man!\nWho do it better than us? - c'mon man!\nWho continue to bang and bump? That's right\n{\"She asked me why..\"}\n\n[Verse 2: Havoc]\nI ride around the crib 'fore I get out twice\nWithout the headlights, case niggas know my whereabouts\nWanna, snuff me out, I ain't finished with life\nI'ma, thug it out, front you payin the price\nAnd I'm a nigga who can roll the dice, put up the crib\nWon't sweat if I lose, bet your ass won't live\nTo collect this splurge of mines, never that\nI'm a sore loser the (?), reverse with hammers\nHit your mans up if they press the issue\nSome dead, the other half crippled, and I'm a monster with led\nLodge a slug in your abdomen, puts in the 7\nKnowin in the stash box a rapper's best friend\nGet it twisted and you WILL get twisted with chrome biscuits\nMake no difference my nigga, we handle business\nSo please with the questions they right in, front of your face\nHomey stunt he gettin to' from the gate, so\n\n[Hook]\n\n[Verse 3: Prodigy & Havoc]\nNigga that you used to click with turned on you\nIdiots you used to rap with hatin on you\nDid you really get juxed for half a mill' in jewels\nAt the video shoot? I tell you this boo-boo:\nMy stick-o's still my stick-o\nMy stick man be my stick man 'til the tombstone (mmm, mmm)\nYou got rhymes? You got stomach for the Mobb?\nYou got stomach for P? I get my rocks off\nBelieve nothin that you hear and only half of what you see\nNiggas never cooked in the kitchen and never clapped heat\nNiggas wanna be thugs but on the inside so sweet\nNiggas butchers on they records, but they never handle beef\nKnow nothin bout golden seal, seein your P.O\nGave a dirty urine now you're snuffin a C.O\nFuckin right, I'm a man of the people but I will kill you\nIf you cock-blockin the paper the shit'll get real dude (so)\n\n[Hook]", "image": "https://images.genius.com/8a94d4d15bcdf43ddb8ce2cdbfde357c.455x455x1.jpg"}], "artist": "Mobb Deep"}