{"songs": [{"title": "Killin’ ’Em", "album": "E.L.E. (Extinction Level Event) 2: End of the World ", "year": null, "lyrics": "Attention please, cause it's whoopass season!\n\n[Hook]\nYou killin em baby, you know that baby\n\n[Busta Rhymes]\nIt's getting warm in here; lemme roll my sleeves up\nYou Fettuccine Alfredo niggas is gas\nI respect your outfit, but I’m afraid your ass is trash\nFunny but I always seem to have the last laugh\nAnd bag a bitch with the potato bag ass\nYesterday I was quiet and made the ass glad\nToday I dropped another heater and it made the ass mad\nFuckers, we have got it in a bag and in the stash\nThen do the shit that make the bitches act bad\nSee this moment is addictive motherfucker\nHow I kill shit, they say, \"he a vindictive motherfucker\"\nI see the way niggas be hating when I get in the spot\nThey bitches be hallucinating when I spit\nAin’t no replacement for me when I quit so sick\nGot them saying I’m amazing when I shit\nWhen they come and see the movie and they sit\nThey would come to witness it, I was the greatest in the flick\n\nThis movie has been brought to you by The Conglomerate\nUncle L, talk to 'em!\n\n[Hook]\n\n[LL Cool J]\nLadies love me, I’m on my Breezy\nUncle L, future of the funk\nWithout my stamp on it, how this joint gonna bump?\nLet them taste the vintage, they want a free lunch\nI guess they don’t know we playing ourselves, trump\nOur nose in the air looking all stopped up\nThis is the anti-hista-green for the broke pop slut\nYou wanna impress me? Start manning up\nSay something that sound like you piss standing up\nYou're lucky I made it out, the hood’s bad enough\nGet you for your Gucci, leave your face tatted up\nFlash back the skunk, el producto blunt\nMore green behind me, the fake gold fronts\nI ain’t drop a verse in like 36 months\nAll I see BS, y'all need to quick stunt\nDamn, right, it's like you Midas when you touch\nYour career's like a hymen: once it's gone, you're fucked\n\n[Hook]\n\n[Busta Rhymes]\nNow you know it’s impossible to stop me now, right?\nYou see I’m back to yoke up the game in a chokehold\nPut you to shame like the barrel was engraved in your nose hole\nYou gonna bounce to the next groove: I'm back bitch\nBetter get to rethinking your best move\nMoney to get, beating the pavement, gotta go\nWhere passports and visas and bitches waiting in Monaco\nAs I return to handle my biz\nYou know exactly what it is\n\n[Hook]", "image": "https://images.genius.com/6abc63b36f0361f9d7f1bbf5b951ead0.320x320x1.jpg"}], "artist": "Busta Rhymes"}