{"songs": [{"title": "Starkology", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Ghostface Killah]\nYo... yo\nY'all respect my tour bus\nWe got whores with no drawers ready to do all four of us!\nWildin, bustin big bags of Ruffles\nShow money, rubber band'd up in the duffle\nWith dirtball niggas that steal cake from stores\nBoostin niggas that pop tags in the mall\nTrue spot hoggers, used a few stockings\nNiggas hand over the cash when heat's to they noggin\nI sing a lil' lullaby, who gon' testify\nThe way a gruesome murder been televised?\nStupid! My name still ring in the streets though\nEighty-six, used to slip crack through the peephole\nBiscuit like vaseline if I was a crook\nIn rap I'm past the cream, brand more lean\nIf you niggas complain of sore throats\nShove the gun in they mouth, throat got scratched\nThey suckin on Halls yo\n\nYeah, yo\nYo this verse is like leavin the gas on\nHog-tie a nigga for his bread, have the Hefty bag on\nBy any means, a cheddar king\nGot a '98 kid's voice on smooth like Lenny Green\nWord to my mother I air y'all niggas out\nBigger chromers for the one who got the bigger mouth\n(\"Shout, shout, I'm talking to you, c'mon!\")\nGo 'head and try me, you know you a bird\nYou could be on +Gangland+ wit'cha face all blurred\nSkull deaded up slumped over the curb\nJust watch next time how you write your words\nLeave you hangin like your last name\nOr a old man's nuts that sag with no shame\nPayback's a bitch; yeah I smash y'all berries\n'fore they find you dead in your +Little House on the Prairie+\n\nYo, I can do this on crutches black with no legs\nBoth arms in a sling, push me on stage\nStyle still linger in the air like Glade\nGirls my early 20's I used to run trains\nChill I got next, go behind Dirt\nSometimes I had to chill instead get neck\nRich chandelier gown all over my flesh\n'Bout to throw ladies to Haiti, peace to Wyclef\nBlowed y'all cream never throw dollar bills up\nYou know we window baggin that krillz up\nFingertips hurt puttin that work in\nMove that white in bulk nigga like Jergens\nNew rappers need to skip town\nThis the East coast music, Grandpa Ghost is around\nIcon tellin y'all now\nBe out before dawn 'fore shit get wild~!", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}