{"songs": [{"title": "Jimmy Crack Corn", "album": "Eminem Presents: The Re-Up", "year": "2006-12-04", "lyrics": "[Intro: Eminem & 50 Cent]\nMaaaaan! Let's go\nHey yo, Fif'!\nYeah?\nCall 'em and tell 'em...\nIt's time to hate us again\nWe're back!\nHaha!\n\n[Verse 1: Eminem]\nJimmy can crack corn, but I don't care\nMy enemies crack corn, but I don't care\nYou can be black white or albino, yeah\nYou can have cornrows inside your hair\nI give a fuck if I don't like your stare\nThis bottle of wine goes upside your head\nA little bit psycho, but I know that\nThink you just don't say it and I won't say it\nSee, if you don't brag, then I don't brag\nI know I'm bad as long as I know I'm bad\nI don't need ya'll to co-sign no shit\nYou can just keep makin' them tired old threads\nA little bit like The Boy Who Cried Wolf, yeah\nSee me, but don't dare to try no shit\n'Cause you know that somewhere inside those layers\nThe rattlesnake's right there to bite your ass\nAnd I can be so quiet and strike so fast\nLike lightening bolts, right out the sky, go bad\nFrom out of nowhere, you might just find your career\nCome to it, (Eek!) and I'm just like (Oh, yeah!)\n\n[Chorus: Eminem]\nSee us on them award shows, we're like (Oh, yeah!)\nCan we get more of those, they're like (Oh, yeah!)\nSee us keep blowing up, we're like (Oh, yeah!)\nSo Jimmy can crack corn, but I don't care\nSee me in the videos, I'm like (Oh, yeah!)\nSee me right up close, you're like (Oh Em!)\nAnd where is D12 at, they're like (We over here!)\nAnd where the fuck we goin', we're like (Nowhere!)\n\n[Verse 2: Eminem]\nYou jealous little fucks beg for my attention, but\nI done told you once, I'm not the kind of attention you want\nIf I tell you twice, then I won't be so nice\nIf you keep coming back, that only means you know you lost the fight\nThey wanna talk shit, let 'em talk shit, 'cause they talk shit\nKnowin' deep down, they really just wanna squash it\n'Cause no one wants to walk around, steppin' in dog shit\nAnd get doo-doo on the shoe again, soon as they washed it\nBut the pride won't let 'em, inside's like \"Go get 'em\"\nAnd I'm just like \"Why you're tryin' to fight momentum?\"\nWe just keep winnin', by landslides, oh, and um\nShady Limited's, in any size yo' denim\nTo velour, even our clothing line's on fire\nAs 50 would say \"Our clothing line's on Fiyaa''\nMeanwhile, your minds on us, like mine's on Mariah\nAnd y'all is just like her, you're all fucking liars\nBut I'll just keep fucking you like I fucked her\nRight in the ass with K-Y, yes, sir!\nSo full of joy, boy, am I absurd?\nEven Chingy would tell you: \"Yeah, boy, don't curr\"\n\n[Chorus: Eminem]\nSee us on them award shows, we're like (Oh, yeah!)\nCan we get more of those, they're like (Oh, yeah!)\nSee us keep blowing up, we're like (Oh, yeah!)\nSo Jimmy can crack corn, but I don't care\nSee me in the videos, I'm like (Oh, yeah!)\nSee me right up close, you're like (Oh Em!)\nAnd where is G-Unit at, they're like (We over here!)\nAnd where the fuck we goin', we're like (Nowhere!)\n\n[Verse 3: 50 Cent]\nYour homie got clapped on, man, I don't care\nThe cops in my nana crib, but I'm not there\nIt is what it is, dawg, man life's not fair\nYour friends should've known not to front 'round here\nListen, kid, where I'm from,  the wolves smell fear\nThey'll strip your ass of your jewels right here\nMan, I'ma say this one time, now get this clear\nMan, you can catch a hot one like outta nowhere\nA beautiful day, without drama is rare\nYour girl's a freak, man, sometimes we share\nYeah, I wear a condom and you go bare\nYou probably heard about me, I'm a shown up player\nIn the hood politicin', like I'm runnin' for mayor\nRidin', winin', dinin' and shinin', know what I'm sayin'?\nI ain't got time for fuckin' around, and horseplayin'\nI'm makin' hits, my homies takin' hits, who's stayin'\n\n[Chorus: Eminem]\nSee us on them award shows, we're like (Oh, yeah!)\nCan we get more of those, they're like (Oh, yeah!)\nSee us keep blowing up, we're like (Oh, yeah!)\nSo Jimmy can crack corn, but I don't care\nSee me in the videos, I'm like (Oh, yeah!)\nSee me right up close, you're like (Oh Em!)\nAnd where is D12 at, they're like (We over here!)\nAnd where the fuck we goin', we're like (Nowhere!)\n\n[Outro: Eminem & 50 Cent]\nHaha, haha\nYeah!\nIt's the Re-Up!\nHaha\nGod, I love it\nYou know you hate that laugh, don't you?\nHaha, haha\nKeep doin' it\nDo it again\nWhat?\nThe laugh\nOh, haha, haha!\nI like that\nHaha, haha, haha, haha\nHehehe\nYou don't think they're gonna think we're really crazy, right?", "image": "https://images.genius.com/14ac3116e08bbd78c9235a7c21196530.350x300x1.jpg"}], "artist": "Eminem"}