{"songs": [{"title": "Lay it On Back", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "(Intro-Kurupt)\nYeah, gangsta's make the world go 'round\nI heard that's true\nMake things go up and down\nI heard that's true\n\n(Verse 1-Kurupt)\nI been through the full-court pressure stage\nThe homies gave me a nine\nThe first time I saw a gauge\nThe first time I put my feet...\nDown solid mashin on top of concrete\nBefore all the ways of war\nHouse and car doors felt the rays of war\nWhen life was simple as shit\nAnd we didn't give a fuck about a bitch, 1986\nIt's all about lic's, heat in the streets\nTrucks with the beats\nBitches with biker shorts worn all tight\nTryin to get a pussy just worn all night\nPlus you had to be a baller to get the baddest ho's\nBack in the days, 6-4 six trays\nBack in the days, Elco's, S-S's\nThe best is where the west is niggas don't test us\n\n(Chorus X4-DJ Lethal)\nJust lay it on back (Hey)\nDo you wanna ride?\n\n(Verse 2-Fred Durst & Kurupt)\n\n(Fred Durst)\nBack in the days where them laces were thick\nI was concerned with break dancin and layin some dick\nFor whatever it's worth, I'm still doin the smurf\nAnd I'm walkin on this Earth, like I don't give a fuck\nAnd now I'm rollin up in third gear\nWith 3 dollar bills, 3 more minutes to kill\n3 more seconds to snap, 3 more bottles of beer\nAnd corrupt's my lifestyle, so shut the fuck up\nAnd back the fuck up with that buck free style\n\n(Kurupt)\nNigga what freestyle, nigga\n\n(Fred Durst)\nWalkin on a razor blade\n\n(Kurupt)\nComin through I got it made, posted up in the shade\nComin through to get paid\nSunny California baby\n\n(Fred Durst)\nI got subs in my trunk and it's bound to bump\nStraight smashin, hollerin out what's up Kurupt?\n\n(Kurupt)\nWassup, I'm fillin in my right mind, one to the head\nAnd I'm on the smash hollerin out 'what's up Fred?'\n\n(Chorus X4-DJ Lethal)\nJust lay it on back (Hey)\nDo you wanna ride?\n\n(Verse 3-Nate Dogg)\nI don't give a fuck so fuck what they say\nNigga won't you pass, say pass the bombay\nNiggas they decide to ride and they ride\nNiggas they decide to lie and they die\nI can bust a fleet of ho's with my skills\nI can make them ho's bow down pay my bills\nCan't think I can make them ho's convert to my will\nWanna bet I'll turn them ho's to my scrill'\nIf you love a bitch a bitch can drive you crazy\nAnything a hooker do it won't amaze me\nYou better be up on your game homie cuz they be\nThey may talk a lot of shit but they can't fade me\nIf you hang around with suckaz then you may be...\nAnotha type of brotha I don't want with me\nWhen you compensate with bustaz you confuse me\nCuz I'm tryin to stay out the penitentiary\n\n(Chorus X4-DJ Lethal)\nJust lay it on back (Hey)\nDo you wanna ride?", "image": "https://images.genius.com/32f5907a0f69c52bd9d20ec857b3f90c.944x944x1.jpg"}], "artist": "Kurupt"}