{"songs": [{"title": "I’m a Ridah", "album": "The Dedication", "year": "2005-12-13", "lyrics": "[Verse 1: Lil Wayne]\nHolla at ya boy its Weezy Baby\nThey label me a problem and I probably am so I dont knock em\nI pop up in a broccoli Lam' on choppers\nWith an ol' school bitch, she got on door knockers\nAnd she knock on your door for that raw partner\nHollygrove Wayne, that boy a monster\nJacked for a Mazda come back in Mase-rati\nLike how he? Why he? Cause I be\nMoving through the city like an I.V\nTryna be monogamous but I got bitches on my dick\nLike I'm the shit cause I'm the shit\nSo I only promise this: to my little girl I will give you the world\nAnd to my unborn I'm tryna reason with ya moms so\nIf I'm not with her when you get here, its already clear\nYeah, and for their sake I'm a ball every year\nI'm a pause every tear\nAnd tattoo it on my face\nNiggas know, that I got that black music on my waist\nMake me put it to your ear and get that b-b-b-b-bass\nBluka bluka to ya face, closed casket\nMama can't remember shit but last saturday, what a tragedy\nFlowers for the family\nPowder in my nap sack\nRunning through the projects, tryna get a stack back\nI got my SK bout to get my MAC back to pap pap at niggas who yap yap\nYup yup! and I rep that 17 hard, you know\n'til a nigga ain't nothing but tomb quotes\nRaw Tune, who you know go harder than dude\nSee these is the clues, part of my shoes\nI bleed with them dudes I'm part of the crew\nDon't move cause you right in the route of the gun mouth\nWhen it talk, you know what come out- barreltone\nNigga y-y-young Wayne from out Carrollton\nYeah, I got my eyes on the sparrow\nThough my path is narrow, my angels are shadows\nI saddled up, and get the fucking battle\nAutomatics up, like nigga fuck whoever\nYou touch and reach, you get fucking bleached\nAbove the law niggas put you underneath\nYou call the law nigga? You fucking leech!\nYou Saved by the Bell, you fucking Screech\nMy bucket screech through the streets like a R&B singer\nYou ain't pimping until you fuck a R&B singer\nI walked in this building with all these bangers\nAnd all these niggas look like targets to me\nWhat's a drought to you may be a bargain to me\nCause I just may be sitting on a carton of Ki's\nI got important people thats trying to market me\nSo I'm gon' stop talking 'bout the white, Sike!\nI know I'm not walking without a fight\nSo I'm swinging with all my might\nWe can go all night\nI'm a blow all day, and I'm a blow all night\nDo a verse today and do a show tonight!\nFuck a ho today, and fuck a ho tonight!\nIm' a live my life like there's no tonight\nI might go tonight so mama pray don't cry\nCause your prayers maybe working, mama they gon' try\nYeah,and we rock to the same lullaby\nNigga I got 10, nigga I got 5\nI hope you got yours, cause nigga I got mine\nI'm goin for the green bitch, Its popeye time\nSo I can be a paid nigga, and make that tomb stone say \"I'm a made nigga\"\nI'm a MADE nigga", "image": "https://images.genius.com/d5aa064a83b316efd87b4aed4c2a27be.941x938x1.jpg"}], "artist": "Lil Wayne"}