{"songs": [{"title": "Last Wordz", "album": "Strictly 4 My N.I.G.G.A.Z...", "year": "1993-02-16", "lyrics": "[Intro]\nGot any last words\nYeah I've got some last words\nIce Cube's in the muthafuckin' house\nThe nigga you love to hate\n\n[Verse 1: Ice Cube]\nHere comes the nigga with the ruff, the terror\nThe paranoid, gots to get the boy\nGet your steel cause I feel like a headbanger\nYeah I got a gang of shits, styles guns\nMy Uzi weighs a motherfucking ton\nBucking down one, bucking down two\nBucking down your crew, muthafuck you\nPigs wear blue, I wear black, nothing but black\nCause Goddamn it's a brand new payback\nFuck Pat Sajak, never did nothing for a nigga\nOn the trigger the zigga the zag the nickel the bag\nThe nigga the sag the forty four mag got you running like a fag\nSo, keep your muthafucking jokes\nCuz, I'm that nigga with a fresh pair of locs\nNo yokes but smokes\nCrakers and them dirty mackers friends aren't jackers\nGet yah for your drawers, young niggas out to kill for the cause\n\n[Hook]\nIce-T in the motherfucking house\nL.A. Playa\n\n[Verse 2: Ice T]\nO- to the muthafuckin G, I break crazy\nA lot of niggas hate me but they can't fade me\nStop me, clock me, cops wanna Glock me\nBut the punk motherfucking pigs can't stop me\nUHH, am I a G? I got proof\nBanged in my youth, keep niggas on the roof\nWith a scope, dough, Cube keep the rope\n2Pac'll string a nigga up if the mob don't\nSo whats up, punk? You want what I got\nStep to me wrong fuck around and get shot\nYour moms crying fuck her bust her\nBitch start screaming to me and I'll dust her\nPops got the LP phat, track on hit\nLaid by the muthafuckin' Bobcat\nNinety-three suckas want me to go out\nThrow the ho out, bitch muthafucker, I'm rich\n\n[Hook]\n2Pac's in the muthafucking house\nNigga I'm loc'd, 2pac's gonna get'cha motherfuckers\nGot any last words\n\n[Verse 3: 2Pac]\nNow they're after me, why?, cause a nigga's Black\nSpittin' facts and ain't afraid to pull a trigger back\nLet em come step to a real muthafucker\n(Boom Boom) Mama ain't raised no suckers\nDan Quayle, don't you know you need your ass kicked?\nWhere was you when there was niggas in the caskets?\nMuthafucker rednecks all the same\nFear a real nigga if he ain't balled and chained\nThat's why we burn shit and wreck\nCause the punk police ain't learned shit yet\nYou mutha-fuckas gonna pay the price\nCan't make a Black life, don't take a Black life\nIt's on, the next real nigga fall dead\nDread, jheri curl, process, or bald head\nBe prepared for the smoke to bust\nWhat niggas need to do is start loc'in up\nUnited we stand, divided we fall\nThey can shoot one nigga, but they can't take us all\nLet's get along with the Mexicans\nAnd we can all have peace on the sets again\nImagine that if it took place (ha ha ha)\nKeeping the smile off they White face\nI ain't racist but let's trade places\nTrace the hate 'n face it\nOne nigga teach two niggas\nThree teach four niggas and them niggas teach more niggas\nAnd when we blast that'll be the biggest blast you've heard\nAnd them is my last wordz", "image": "https://images.genius.com/fb1da91ac989d8c57dfce412441800da.953x953x1.jpg"}], "artist": "2Pac"}