{"songs": [{"title": "The Biz", "album": "May 25th", "year": "2010-05-25", "lyrics": "[Intro]\nYeah\nTo all my smokers and my hundred blunt rollers\nNo no no no I'm talkin bout\nReal talkers who ain't never ever sober\nHahaha\nYo, yo, yo, yo\nCheck me out now. Check me out now\nGo head then\n\n[Verse 1]\nAllow me to introduce myself again\nBob's out the office but Bobby Ray is in\nPlease leave a message wait, let me get a pen\nI don't really need it cause I spit it off the lid\nAnd every time I come around I look like I'm a pimp\nReally that's the dip because the ? is on my hip\nThey love me cause I tell 'em what they really wanna hear\nSlap her on that booty with a hundred dollar bill\nWHAT!?\nNah I'm just playin' man sometimes I kid\nJust so that my job doesn't get monotonous\nCrumble up the bud, put it in a spliff\nPut it in the air like I'm levitating shit\nThey say, \"Bob how you feel about the fame?\"\nReally ain't famous till Obama know my name\nThe game's in a drought\nIt was going down the drain\nWhen I come around man its prolly gon' rain (so what's you sayin'?)\nMaybe I'm just sayin' I can switch up the flow\nHow you can't feel me when I'm rocking this show?\nGoing over seas to a whole 'nother coast\nCome back get a sack full of that like whoa\nYeah I can take you way back like +Whoa+\nSo listen two me rap sit back like whoa\nAnd every time I rip they be like, \"That's dope\"\nYeah that's dope\nNitro like colt, my flow lets go\n\nHaha Haha\n(What you be done?)\nYeah\n(Is that it?)\nHell naw, we ain't done\n(Let's do it)\nNeed to get round two in\n\n[Verse Two]\nOh oh oh\nWell the biz, the biz I'm in the music biz\nI really couldn't tell you what the main objective is\nCause really that depends\nOn if you got a hit or just a good song that they never ever spin\nAnd then that depends on the genre that you in\nIf you're a rock artist or a hip hop blend\nThat's where I come in\nThey try to box me in\nBut I am not a square nor a parallelogram\nYes I got several fans through Japan to Maryland\nThey try to shoot me down but I never ever land\nAnd no man could never ever walk in my pants\nOr live what I've lived\nOr be what I am\nDamn\nI don't give a damn\nAll up in this booth try to lay this shit down\nYeah, so let me turn it down\nWe all around it;s a mixtape now\nStay tuned for more\nAnd don't turn the dial\nBloaw", "image": "https://images.genius.com/51bfc55fdc338bff1c957159669698ce.320x320x1.jpg"}], "artist": "B.o.B"}