{"songs": [{"title": "OKRA", "album": null, "year": "2018-03-29", "lyrics": "[Intro]\nMan, now they go (ayo)\nI cut off some friends, where they go?\n(Did this shit in one take, ayo)\nI stick to the plan, that's the goal\n(Ayy, we got that fire shit, nigga)\nFuck these niggas man (run it)\n\n[Verse 1]\nCheck my bankroll, ayo, 400K for vehicle\nPaintjob look like ashy ankles on Django, interior look mango\nShotgun grape, he look like mayo\nGolden voice on payroll, neck all gold like Kayo Corp\nWe aim at dorks, get out the way, yo\nKeep them bucks in banks like Yayo\nSwampy niggas out the bayou\nPockets flooded, y'all be dilute\nWatered down, I'm Big Mac\nI'm quarter pound, you chicken nugget\nFuck it, travel bag Balenciaga, 30,000 just for luggage\nFinancial advisor buggin', Flower Boy is buzzin'\nGrammy-nominated, tell yo' cousin ain't nobody fuckin' with him\n\n[Chorus]\nMan, now they go\nI cut off some friends, where they go?\nI stick to the plan, that's the goal\nFuck these niggas man, that's for sure\n\n[Verse 2]\nSay\nUno the shoe, red with the blue\nLook like a flag, what the fuck it do?\nGolf be the set, no more OF\nLike Ron Artest, bitch, we aim for your neck\nGive a fuck about you or your respect\nYeah, that way, fuck your accolades\nBut I made the cut like I pack a blade\nYou could call me Brush, I've been makin' waves\nSince Ashley Banks' cousin had a fade\nBut that's '92, I'm '91 (hey!)\nWatts Riot in my blood, nigga what's up\nAnd that pussy pink like the drink in my cup\nLemonade, yeah it's Minute Maid\nI been gettin' paid, pockets gainin' weight\nYour bank statements on Mary Kate, but that's up to you\n\n[Chorus]\nMan, now they go\n(I ain't fuckin' with none of these niggas, man)\nI cut off some friends, where they go?\n(Yeah, give these niggas information nigga)\nI stick to the plan, that's the goal\n(Now we never fuckin' stop)\nFuck these (ayo) niggas man, that's for sure (ayo)\n\n[Verse 3]\nTell Tim Chalamet to come get at me\nSkin glowin', clear of acne\nDiamonds see-through, so holographic\nRed Ones look like Aidan Mackey\nSpent dinero like Taxi Driver\nHandmade is that thing with tires\nBut I rode the bike and Vill tail behind me\nAnd he got the Cannon like he bagged Mariah\n(Pew, pew, pew, pew, pew)\nYeah, we straight but if you wrinkle up the situation he will go grab the iron\nAnd he do what I says like Simon\n(No violence)\nAnd my bitch mixed like jambalaya\nMan, fuck with the fam, we in Japan\nBitch you’re a bum, see you don't understand\nYeah, I cut off some friends, \"T where you been?\"\nBitch I'm in Bel-Air, been lookin' for land\nNeed a spot in the hills, not the beach, need a pool\nJust to cool it, I do need the grass, not the sand\nGot enough rocks, see, check my hand\nAnd I got crack, watch how I talk\nAnd it's still Wolf Gang, bitch, watch how I bark\nWallace still trippin' on shit that I bought\nBut I really do not care the cost 'cause okra\n\n[Outro]\nMan, now they go\nI cut off some friends", "image": "https://images.genius.com/3a8be6e1e5ee0078fa7eb0eca79fa24a.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}