{"songs": [{"title": "They Burn Me", "album": null, "year": null, "lyrics": "[50 Cent]\nLook at what they did to me, they burn me, they turn me\nInto a animal, they flipped son, they burn me\nTo the first degree, me son, they hurt me\nI looked out for them motherfuckers, they burn me\nI was good now I'm bad, see they done turned me\nInto a monster, I can't believe they burned me\nI showed 'em love, they showed me hate, they burn me\nNow I'm heartless, your pain don't concern me\n\nI got so many enemies, so many memories\nSo many flashbacks, we used to be friends\nSugar turned to shit, people just change\nThey keep pushin a nigga 'til the hammer go BANG\nYou violate I will let that motherfucker rang\nFeels like, money came then, more money came\nAnd, niggas start foamin out the mouth growin fangs\nNow, when did I become the savior of the hood?\nLook homie you don't know me, I wouldn't save ya if I could\nI sacrifice for suckas and they change me, I'm angry\nThey selfish, all they want is what they want so they blame me (wow)\nLike it's all my fault they ain't caked up\nYou a grown-ass man, damn, when you gon' wake up?\nTurn, 7 to 14, 14 to 28\nAn O to 62, nigga get up your weight\nLearn how to duck the jakes, stack your paper then you're straight\n\n[Hook: 50 Cent]\nI tried to help a nigga eat, man it's hard out on the street\nCause I'm kind they think I'm weak (they burn me)\nThey see the way I grind and they like the way I shine\nThey want paper like mine (they burn me)\nMan they be on some shit when they tryin to hit a lick\nMan a motherfucker flip (so they burn me)\nYou think they won't trip cause you helped 'em from the rip\nThey ain't loyal to SHIT!\n\n[50 Cent]\nShe called the cops on me, cause I don't love her like I used to\nTried to fix what was wrong; guess it hurts cause I'm gone\nMy son he love me but she tryin to poison his mind\nActin like, everything they got ain't come from my grind\nI say a prayer for her like \"God, please change her heart\"\nAll this hatred at one time is tearin me apart\nMan I ain't lookin for trouble, I'm lookin for blessings\nBut ever since the money came, me I been stressin\nGot my ass kicked for bein kind, I can't trust nobody\nThe closer they get to me the more they take from me\nMan, I'm givin all I got to give, I'm tryin to live\nThey look at me they eyes got dollar signs, they want the kid\nTo give it all up, fall apart, break down\nI ain't got much left, what they wan' take now?\nMy life? I got so much more to offer\nI'mma make 'em watch me be #1 'til I'm done, yeah\n\n[Hook]\n\n[50 Cent (+ Governor)]\nThey bringin me all, the way dowwwwwn\n(Everybody's tryin to bring me all the way down)\nAnd betray me just becauuuuse (betray me) I'm down (just because)\nI, don't know, what, to do nowwwww (I don't know what to do)\nMe? My loyalty's, what I'm 'bout\nHa ha (that just happens to be what I'm about)\nThey burn me, over and over and over (over and over again)\nLike they doin what they supposed ta\nThey burn me, goddamn look at how they do me (look at how they do me)\nSomebody new tryin to sue me\nSo they burn me (after all I've done)\nSo they burn me\n(Seems like I can't find a friend, every time they burn)", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}