{"songs": [{"title": "Repo", "album": "Legend Era 2", "year": null, "lyrics": "[Intro]\nWe gon' knock this right out\nWe gon' skate to one song and one song only nigga!\n\nYeah!\n\n[Verse 1]\nReally? Fuckin' \"Condom Style\"? \"Get your jig on\"?\nYou a clown-ass nigga, put a wig on\nNigga I be goin H.A.M. till the pig gone\nAll this ice around my neck, I got a fridge on!\nBody Cass, put 'em in a body bag\nBroke nigga, we should put you in a bodycast\nReal nigga, all I know is get a lot of cash\nI took you hater niggas spot that’s why you prolly mad!\nMy story, all guts, glory\nPosted on the corner, Glock .40 tucked on me\n20 years on me, me and my army\nFeelin' like none of y'all niggas can harm me\nI came from the bottom where they never make it at\nWith all my jewels on they ain't never takin' that\nTheres rules to the game I ain't never breakin' that\nAnd once you give a statement, nigga, you can never take it back\nYou lame part of the game, nigga pardon the fame\nI got 30 in my clip I can park in your frame\nPlus this Rollie on my wrist cost some cars and change\nWe talking bike life, 'bout to put a park in my name\nJust to ride on you niggas, or slide on you niggas\nG550 when we glide on you niggas like\nClyde on you niggas, homicide on you nigga\nI ain't never had no rap, had no ties to you niggas, so\nWhy you suckas hatin' and talkin' 'bout what I'm makin'?\nWhen I be out in Jamaica and ballin' like I'm like a Laker\nIt's givers and it's takers, these niggas is gettin faker\nAnd I'm just gettin' richer I wake up and get my cake up!\nBlack Maserati, chinchillas for Papi\nTen killers beside me, all lookin' like ahkis\nI remember nights on corners with beef and broccoli\nRice and gravy, now it's crazy cause Phillipe's got me\nAll gold AP, same watch as Jay-Z\nBallin' like I'm KD, how can niggas play me?\nIf you ain't talkin' money nigga fuck you, pay me\nDrophead with the top down and the A.C\nOn, drawn, fuck is y'all doin'\nI'mma king you a pawn, lil nigga I'mma Don\nThe coke price high, it cost 40 for a jawn\nAnd like 20 for a half lil nigga do the math\nAnd you talkin' bout a battle rap, how you gon' handle that?\n100 grand pussy nigga, you ain't got the tab for that\nYou ain't got the stacks for that, you the one we laughin' at\nYou ain't got half of that, they pump you up: Asthma attack\nBye clown, calm down 'fore you make me bomb now\nFucking all these superstars like \"Who Meek Milly bomb now?\"\nWent from driving Bentleys to going half on pie pounds\nYou niggas need to die down, Philly nigga: my town\nI heard your car got re-poed\nBut this is bike life boy you just got Deebo'd\nThem Twitter niggas fucking with your ego\nYou in the field tryna turn to God like Tebow\nNaw that won't work nigga, that'll get you murked nigga\nAll-black Ghost nigga, looking like a hearse nigga\nBeen a dead man, so I'mma dig you out the Earth nigga\nJust to stuff your skeleton right back into the dirt nigga\nWhat you made this year? What you worth nigga?\nI dropped \"Dreams & Nightmares,\" I made church nigga\nI did \"I'ma Boss,\" youngin' set the summer off\nMan these old niggas mad at me cause they fallin' off!\nHa! Get your hate on Cass\nAnd we ain't talking larceny cause they all trash\nAnd your goons ain't riding witcha, they all mad\nCause you ain't never put no food up in AR abs\nMy dog killed a body for ya, damn he didn't eat from it\nNow you mad at Swizz cause you can't get a beat from him\nOnce my niggas coming at you dog, we gon' keep comin'\nWeirdo Forest Gump nigga, better keep runnin'\nD.C. nigga, you P.C. nigga\nWhile you was scared, I was eatin' chichi nigga\nTalking to Tip about how we gon' beast these niggas\nAll I know is bang bang, like that Chief Keef nigga\nGot a matte black Aston, gold rims on it\nBitch looking like it got a pair of Timbs on it\nCashmere sweater, bunch of Jims on it\nAll my guns come with extends on it\nDuck ? and hit up, tuck nigga you lit up\nCause you looking like food my youngins ready to get up\nCall you for a verse and tell you to write some shit up\nBoom, high stick up, jumping all out the pick up, woah\n\n[Outro]\nYou know you fucked up right?\nThe \"hustla\"\nYou know you fucked up right?\nMan I ain't doing this shit no more with you nut ass niggas\nI came in the game, I ain't even signed a year nigga\nI got more money than all you hatin' ass old niggas put together\nY'all niggas ain't do shit!\nTalkin' all this Philly shit\nY'all niggas ain't put no foreigns out here nigga\nAll my niggas drive foreigns!\nMy niggas don't even rap and drive better cars than you niggas\nCoon copped that 'Rari , you don't feel sorry for these bitch ass rappers!\nYou can't come to Philly no more!\nAnd not even because of this, you was never comin' to Philly\nYou ain't been here eight years you pussy ass nigga!", "image": "https://images.genius.com/58afb8838b4939c76f0e7afac955adc3.500x500x1.jpg"}], "artist": "Meek Mill"}