{"songs": [{"title": "Everyday We Sick", "album": "Dedication 6", "year": "2017-12-25", "lyrics": "[Verse]\nEverything was meant, everything was meant\nI took a L, what comes after L? My nigga — Ms\nThat AK with the twins, that's Mary Kate and sis\nMy shooters, they don't miss; fade away, then swish\nDedication 6, and every day we sick\nTreatin' medication scrips like some Revelation scripts\nI thought yesterday we quit\nBut you know, every day we spent\nThen we celebrate the win like we'll never play again\nLord I just talked to my hitman, he say that he made a list\nNigga always breakin' in, and he never leave a print\nAnd I never shaved a brick, OK, now I'm talkin' shit\nWhere that bakin' soda mix? Raise my Arm & Hammer fist\nAnd my yellowbone, she thick, and her belly don't exist\nAnd she never saw the gym, she stay healthy 'cause she strip\nDoin' very late events, and I never paid a cent\nPussy never leave a scent, Toni Braxton, breathe again\nEvery day, all week, we lit, you know every day we sip\nAnd we having steak and shrimp with some naked waitresses\nTold that bitch to bring a friend, you know that we make 'em kiss\nShe know if it's goin' down, I keep a elevator lit\nNow where the elevator music? Yeah, they better play the hits\nI can serenade a bitch, you interrogate a bitch\nIf we interrogate that bitch, we be like \"Where that safe at, bitch?\"\nPut that barrel to her tits, and if she hesitate, that's it\nI need that combination bitch, 'cause I ain't got no patience bitch\nI hate to do it, but the line between love and hate is thin\nYou know every day we win, you know second place ain't shit\nYou know that we take the kids, just like Freddy, Jason, IT\nYou know that we spray and dip, one-eight-seven, eighty-six\nWhile you eatin' bacon grits again while police takin' tips\nYou know every day we drip, drippin' wet Mercedes-Benz\nDrippin' wet and glazy clit, you know every day she drenched\nThis that Dedication 6, you know every day we sick\nGive me wet, a life, a gift, catch a body like the Lyft\nThis that Dedication 6, if she starstruck, make a wish\nI tell her pussy \"Take your lick\", I'm big-headed, make it fit\nYou know every day we sick\n\n[Outro: Lil Wayne & DJ Drama]\nThat's some sick shit, yeah\nShoutout Young Money!\nYou know every day we sick\nThat's some sick shit, oh\nMy nigga Mack Maine\nAnd that's that Dedication 6\nYou know every day we sick\nAnd you are just a patient, bitch\nIt's that Dedication 6\nYou know every day we sick\nAnd that's some sick shit, yeah\nYeah, yeah yeah yeah\nThat's some sick shit, yeah\nYeah yeah, yeah yeah\nThat's some sick shit, yeah\nYeah yeah, yeah yeah\nYou know every day we sick", "image": "https://images.genius.com/380dd8ad2dd34e87e19877a3ba6ee494.598x598x1.jpg"}], "artist": "Lil Wayne"}