{"songs": [{"title": "Hollerin’", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Verse 1]\nI got skinny jeans on, so I got my swagger\nI got new kicks and embarrass my niggas\nA skinny tattoo with a paintball space\nSo a nigga got bounce like a pinball game\nI got housewives like my name was Bravo\nThe dude is Bueller, the world Chicago\nI'm hard to follow, ya boy's sick\nI'm Adam Sandler so fuck ya clique\nI hang with dogs like Michael Vick\nAnd ya girls get wet like a glass of quick\nCause your boy stay fresh like a bunch of mints\nAnd I fight this flow like a pacifist\nA barrel of monkeys, a house of chimps\nI'm way more fun than your boyfriend is\nHe need new jeans like a accident\nCause your boy right here where the action is, ah!\n\n[Hook]\nDon't talk about it\nYou can live without it\nYou don't even need to go down ?\nDon't talk about it\nYou can live without it\nYou don't even need to go down ?\nCause you were hollerin', hollerin' \"Oh!\"\nHollerin', hollerin' \"Oh!\"\nHollerin', hollerin' \"Oh!\" girl\nCause you were hollerin', hollerin' \"Oh!\"\nHollerin', hollerin' \"Oh!\"\nHollerin', hollerin' \"Oh!\" girl\n\n[Verse 2]\nI said these niggas mad at me like Baby Mammas\nThese niggas slept on me like old pajamas\nYou niggas stay soft like Jon Secada\nAnd this nigga stay lit like a candelabra\nAnd even if I didn't have a million dollars\nI would still have cream like Beard Papa\nGirl I ain't playin' I'll treat ya proper\nI got no limits like Silkk the Shocker\nYou look too sweet like Betty Crocker\nYou could ride in the front, you could meet my partner\nMy boy in the back, you could meet my partner\nBut he ain't got a girl so you should bring your partner\nYa boy got books like he made of lockers\nThe girl got legs like a pair of Dockers\nTito chip like empinadas\nYou should shake that shit 'til you got maracas\n\n[Hook]\n\n[Bridge]\nIf we're together\nCan do whatever\nI'll make sure that you're close to me\nCause baby girl it's a fantasy\nAs long as you are here with me tonight\n\n[Hook]\n\n[Outro]\nCause I want ya\nCause I need ya girl\nCause I want ya\nCause I need ya girl, yeah", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}