{"songs": [{"title": "I Live in a TV", "album": "The Movie (Gangsta Grillz)", "year": null, "lyrics": "[Intro]\n1 for the money, 2 for my jewelry game\n3 for my luggage game (Dram' cruise!)Crazy luggage game Gucci\n4 for shoes, 5 for my closet same size as your apartment\n(Mr. Thanksgiving!) Well damn Gucci!\n(Pay attention!)\n\n[Verse 1]\nSo Icey the pharmacist, coca leaves like Sosa\nI shoot you just like Tony\nWhen homey knocked his sister down\nScarface Gucci: my life’s a motion picture\nGucci Tarantino, Casino, Gucci Pacino\nI’m Gucci Mane Soprano, more keys than a grand pianoWatching Blow, thinking George'll look out for Diego\nI’m smoking on that color purple, working like I’m Harpo\nFeeling just like Smokey felt when Craig beat shit out Debo\nCall me Gucci Watch Me, freeze me, save me, watch me: TiVo\nYour album came out, I rated it \"worst\". Response: I hated it\nBoyz In The Hood, got juice and rock jewelry\nCars \"Fast And Furious\", shout out to my boy Ludacris\nSupafly, High School Higher Than an Eagle eye\nI think that they should legalize, my flow stronger than turpentine\nTrafficking like Bailey, bricks coming across the border line\nBust a brick, he tell her: \"Sniff\", then she say that: \"It’s party time\"\nIt’s frightening and scary so they say I've got a horror mind\nGucci Mane not Stephen King but my car crazy like Christine\nRolls - Mary's baby born young and broke in 1980\nBlack and broke I’m thugging crazy, made it hard for mom to raise me\nSet it off, Dead Presidents, hop out the trash can painted faces\nEddie Murphy: Trading Places\nSanford Son, Gucci Mane\nBut you can call me Shady Grady\nHaha Gangsta Grillz you bastard, Gucci Mane will be your Daddy\n\n[Hook]\nI live in a TV, I live in a TV\nIt’s Gucci Mane La Flare, I live my life in a TV\nTell me, do you hear me lady?\nI know that you see me, Baby\nI live in a TV, I live in a TV\n\n[Verse 2]\nPicture me posing in your plasma\nDon’t you think I’m handsome? There’s no need to answer\nMy watch is so handsome; better yet attractive\nHoes think it’s cute but my money got my pants sagging\nI’m international and I’m icy like your baby daddy\nNo, I’m 10 times icier than your daddy\nTell your boy the truth: that his daddy is a faggot\nOnly reason that you had him was for your fucking taxes", "image": "https://images.genius.com/0f274ea265a9e4a4f1ab889fea0d42ef.640x640x1.jpg"}], "artist": "Gucci Mane"}