{"songs": [{"title": "Rough", "album": "Hoodmorning (No Typo): Candy Coronas", "year": "2011-07-29", "lyrics": "[Game: Verse 1]\nWhat do you do when life gets too hard for you\nShed tears or is that to hard for you\nI’m just a man, reflection of my family\nMeaning you ain’t gotta have one to understand me\nI got kids, I got friends\nOnly difference between me and you is I don’t care bout this benz\nI care about Will he was dying and he needed me\nI care about the Grammy they gave Missy they cheated me\nBut they cheated Drake, they cheated Justin Bieber\nGuess America don’t like Canada we some fuckin heathens\nGame can’t watch his mouth thats why his daddy beat him\nSame mouth made him millions and now his daddy need him\nFinally got a black president look at how they treat him\nKids starvin in Africa why only Oprah feed them?\nWhat happened to the music that I know\nI miss it, you too, I guess we feel like Bono\n\n[Hook]\nIs it my fault, cause I tried?\nGave it my all. Hip Hop died\nWhere do we go now, when it's over?\nI'm lookin' all around\nCan this be, the aftermath?\n\n[Game: Verse 2]\nThe living, the dead\nThese Dre beats, my head\nMy life, featuring Wayne\nThat was Jayceon, this is Game\nAdjacent to the fame ain't chasing a damn thing\nSo tonight let all of your pain be champagne\nI can't tame my killers but I can tell them chill\nI might give you a pass depending how I feel\nThe bi polar bear\nThey said the end of the world is coming, I know it’s here\nCuz California cold this year\nDetox, R.E.D\nMC’s dead\nKill them softly like Lauren Hill\nSkin heads goin K-K-Krazy cuz a nigga in a foreign wheel\nWe all born to die, some of us born to kill\nIf that don’t wake you up I hope tomorrow morning will\n\n[Hook]\n\n[Yelawolf: Verse 3]\nNever I thought I’d see the day when I, would roll up in the parking lot\nAnd have people coming up to me for a photograph of the shit I talk about\nYela can I get an autograph Alabama so proud that we just can’t wait\nCongrats on the Shady deal, any news on the release date?\nI told them what I can, shake another hand sign another autograph it’s cool\nGot fans gettin inked up, dedicated to me I love you too\nGot 3000 sold, the spirit of rock and roll\nLong barrel .38 loaded I’m John Wayne in Geronimo\nSo I dont really know whats got some these pussies panties in a ball\nCuz I never done shit but get better and believing in God\nAnd leaving my mom at 15 with a dream and a cross\nA cross that I didn’t see until I was nailed to it for believing at all\nThat I could ever be accepted the way that I saw it\nI mean I knew it would be hard, but really come on y'all\nOh I’m a redneck? FUCK YOU tatted on my neck\nI’ll sip high life in a can at the Grammys now add that to my rep\nBitch!\n\n[Hook]", "image": "https://images.genius.com/c7e8ae0f47986bad415f5d58fc0b2281.320x320x1.jpg"}], "artist": "The Game"}