{"songs": [{"title": "Dick Pleaser", "album": "The Drought Is Over 6 (The Reincarnation)", "year": "2008-12-16", "lyrics": "[Intro: Lil Wayne]\nI gotta bitch named Keisha, she a real dick pleaser\nBut shawty from Cuba still workin' on a Visa\nHer girlfriend Lisa met her in Puerto Rico\nHow she don't suck dick but expectin' me to eat her?\nI gotta bitch named Keisha she a real dick pleaser\nI gotta bitch named Keisha she a real dick pleaser\n\n[Verse 1: Lil Wayne]\nI got a bitch named Keisha, she a real dick pleaser\nBut shawty from Cuba, still workin' on her visa\nHer girlfriend Lisa, met her in Puerto Rico\nHow she don't suck dick, but expectin' me to eat her?\nThat ho crazy, man, you don't wanna meet her\nBut her homegirl Nita swallow cum by the liter\nShe look good in boy shorts and a beater\nBut this other girl Quita way sexier than Nita\nI ain't lyin she the, hottest bitch, heater\nBut I'm a fuckin' freezer, yea, I'mma fuckin' leave her\nYeah, I'm a fuckin' eagle, flyer and deeper\nSmoke like a Cohiba, your ho give me cerebral\nNow get low and touch your toes for my people\nAnd if you ain't fuckin' them, then you ain't fuckin' me either\nYou think your man hot? Well, fuck it, me ether\nHeard I got guap, wanna kick it like FIFA\nEvery day Christmas, cause I'm smokin' that wreath-a (reefer)\nKeep a lot of bitches like Queen Latifah\nI am southern-land, not Kiefer\nY-M-E for Young Money Entertainment, ha\nRun, dummy, finna bang it\nYou want beef? Then my money will arrange it\nI am not fuckin' finna aim it\nBut that Nina Ross shout for me when I'm angry\nYeah, Hollygrove, biatch\nSloppy like Joe, you better go get G.I\nAll my guns knee high, M-O-N-E-Y\nThats what I rely on, I'm gone\nHe high, yep, I'm three-high\nIm just schoolin' these fucks like DeVry\nCollege institution, finals and confusion\nStop with your excuses, hip-hop, I am seducin'\nBeat ya like producers, eat you like produce\nMan I'll fuck your girl till her pussy got no juice\nNow she can't produce, so you won't be needin' that baby\nCause all you really need is Weezy F. Baby\n\n[Interlude: DJ Drama]\nAlright let me vent for a minute\nSee, the problem I got with the game is\nThere are no gatekeepers in hip hop\nWho is letting these wack niggas in?\nI mean, can someone please put a combination lock on the door\nAnd stop giving out the code?\nGod damn! Hey, Millz, show 'em how it's done\n\n[Verse 2: Jae Millz]\nI knew this freak named Tammy from around the way\nShe used to go to Catholic school back in the day\nNow she strippin' in Sue's for a stack a day\nBut she bring it all to Daddy, so that's okay\nI got bitch named Lola, true dick-smoker\nPart-time broker late nights, she work at Strokers\nHer cousin named Mocha, got a insane spine\nBut it's crazy 'cause I fucked 'em both at the same time\nI even got a bitch in the bay named Jessica\nI swear, she might give the best mouth in America\nVanessa got a attitude, but her ass meaner\nShe remind me of this ho I used to fuck named Sabrina\nUgly little thing, from the home of the Ravens\nI only kept around 'cause her ass was amazing\nTiffany and Emily, my bonafide sluts\nWhen I cum, they touch tongues and share that nut\nGot a white chick down in Florida named Sasha\nOn my momma, her head golden like an Oscar\nAnd I met her through Tasha\nAt the condo she let me fuck her on the washer\nSeptember nigga, so you know he nasty\nAnd if she nasty, we do the nasty\nNow, I tell a bitch like this\nYou gotta take 10 dicks before you meet the president\nYoung Money!\n\n[Verse 3: Lil Wayne]\nI know this one honey\nI call her track star, cause when we fuck she run from me\nAnd I'm hella fly, and her dude dumb-bummy\nAnd I don't get girls, I make her get one for me\nMy weed real plummy, and real gummy\nAnd my flow is harder than an anvil, honey\nShoot these niggas with the handheld, honey\nI paper chase, fuck standstill money\nNiggas kill with me and kill for me\nBest believe we ridin' if the fan belt runnin'\nLeave a mothafucker just layin' there bloody\nI'm from the dirty and I make it rain, damn, that's muddy\nShe just wanna be my cuddy buddy\nAnd on these tracks I go nutty-butty\nWhat it dizzoo, is you or is you ain't my baby?\nBaby?", "image": "https://images.genius.com/3f99fb60638817d357014fe4a769ff57.320x320x1.jpg"}], "artist": "Lil Wayne"}