{"songs": [{"title": "Heaven & Hell", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Blue Raspberry]\nNo one can fuck with the Wu-Tang\n\n[Intro: {​​​​​Raekwon & (Ghostface Killah)}​​​​​]\nYo what what, yo\nExotic type shit\nNinety-four, we must go to war fast\nWith the pen and the pad\nGoddamn, shine like gold rims on Pathfinders\nWu-Tang reclines, lamps for the nine-squares kid\n(Money, clothes, designer hoes and shows y'all)\n\n[Verse 1: Raekwon (Ghostface Killah)]\nYo, yo, waking up about ten kid\nJumping in the shower, peace about to make\n(Moves and slide like grease)\nWhat, I'm all about Tecs and checks with nuff respect\nYou front, I'm slamming you like the Lex\nSo now I'm out in the ninety-five\nRocking that real nigga don't die\nGuess down, (Drawers Kani)\nBut yo, I'm making a pit stop\nGo and buy a box of Glocks, he rolled up and yo\n(Whattup 'Ak)\n(Yo, remember that kid that we vicked\nHe made a half of mil for real\nHe brought about four bricks)\nYo, so now we connect thoughts\nMeet me at the airport\n{​​​​Tell Golden Arms maintain the fort}​​​​\n(Get in touch with that west coast Cali crab you stabbed\nAnd meet me at the bitch lab)\nSo word up kid, we slid like a fat four to twelve bid and shit\n(Couldn't even rest, I need the vic)\nAnd when I slept, I dream Gs, son I need some\n(Keys won't sell, call up Son)\nI heard Pook and Tyriq caught a beef over some real shit\n(A fake nigga faked and they killed his clique)\nGimme a minute and I'm with it\n(Yo, niggas done did it), rock your vest\n(Keep your whip tinted)\n(So now we see him up in Bojangles strangling a forty ounce\nWith ten Gs worth of gold bangles)\nDiamonds, what, all up in his face\n(With his man's mace), medallions (the size of dinner plates)\nYo, he knew we knew him so we blew him\nTook thirty G's worth of jewels off that nigga {​​​Do him}​​​\n(So now I'm lamping in my man's Land)\nStreets is hot like sand\n(G's is rolling in my right hand)\nYup, you know the steez all-black\nGot to go down like that, (Shallah)\nCigars and {​​​mob hats}​​​\nNinety-four, taking niggas to war, yo, yo\n\n[Interlude]\nWhat do you believe in, heaven or hell?\nYou don't believe in heaven cause we're living in hell\n{​​​What do you believe in, heaven or hell?\nYou don't believe in heaven cause we're living in hell}​​​\nSo it's your life\n(What a chamber, fucking with mad strangers\nYeah, you know how it runs baby, straight up yo\nMoney, clothes, designer hoes and shows y'all\nThat's how it goes, whatever)\nWhat do you believe in, heaven or hell?\nYou don't believe in heaven cause we're living in hell\n(31st chamber y'all)\nSo it's your life\n\n[Outro]\nNiggas ain't even know Son, only half is sewed cash\nThey haven't yet sold their weight\n(Question, shit is real, you know what I'm saying?)\nNiggas think it's all about a real live Allah\nA little hundred dollars and that make you a man\nKnow what I'm saying?\n(You ain’t even promised tomorrow Son, word up)\nNiggas don’t understand how life can be so short\nCome so fast\n(With the blinkin of eye, blinkin of eye you’re gone baby\nStraight up, know what I'm saying? Get turned to dust Return to the casket)\nAnd that ass is out Son, word up (Word up, get evaporated, straight up)\nWord up (Lose all your strength nigga)\nCrazy dedication shout out to the memory of Two Cent Jason\nHeartbroken, we soakin wet though\nKeepin it real for my peoples\n(Yeah, yo And my physical brother DeVon, you’re still in here baby, because you’re in my arms nigga, word up\nI never let you go baby\nYou know what I'm saying? You my life charm, word up)\nFor real (Keep shinin)\nReal for keepin' it real, shout out to major niggas\nBig Kawai, Jess, Hell in the computer system\nThe RZA, who slams fat discs for the ninety-four\n(Word up, RZA, he’s my nigga baby\nYeah, eatin dinner with the big boys now)\nYou know what I'm saying?\nWord up, Big Booth represent the Q\nKnow how we do? lamp, get that power-u, type, things on float\n(The GZA, word up, Masta Killa)\nThe Abbot of the Clan, Method Man, Inspectah Deck\nDirty Bastard\n(U-God, word up baby Keep it real Son Keep packin' them guns)\nWord up", "image": "https://images.genius.com/a4fd243396292974cd5167fe4ef75e0b.600x596x1.jpg"}], "artist": "Raekwon"}