{"songs": [{"title": "Nobody", "album": "Mastermind", "year": "2014-03-03", "lyrics": "[Produced by Diddy]\n\n[Intro: Diddy]\nYou wanted to fuckin' walk around these roaches. These niggas is roaches. These niggas is mere motherfuckin' mortals. I'm tryna push you to supreme bein'. You don't wanna motherfuckin'... You don't wanna embrace your destiny, you wanna get by\nYou don't wanna go into the motherfuckin' dark where it's lonely. You can't handle the motherfuckin', the pain of the motherfuckin' not knowin' when the shit is gonna stop\n\n[Hook: French Montana]\nMomma's tryna save me but she don't know I'm tryna save her\nMan, them niggas tried to play me, man, 'til I got this paper\nYou're nobody 'til somebody kills you\n\n[Verse 1: Rick Ross]\n\"Blast for me\" – the last words from my nigga\nOn the pavement, born killers, body shivers\nDrug money, dollar figures\nHustlers movin' out of rentals, art of war is mental\nHavin' sushi down in Nobu\nStrapped like an Afghan soldier, nowhere to go to\nSo it's bang, no survivors\nOnly riders on my rider, murder rate rises\nStalkin' niggas on their IG's, never; I be\nStill solo, Under Armour still Polo\nNo wire, on fire\nMy desire for fine things made me a liar, a shooter\nGettin' high feelin' like it's vodou\nNine lives, SK with the cooler\nMakaveli in the 'Rari, still B-I double G, I, E\nI pray you smoke with me\nGo to bed with a kilo like Casino\nJanet Reno, we all we got the creed of Nino\nPretty cars in the driveway\nIf you cut it then you sideways, double up, crime pays\n\n[Hook: French Montana]\nMomma's tryna save me but she don't know I'm tryna save her\nMan, them niggas tried to play me, man, 'til I got this paper\nYou're nobody 'til somebody kills you\n\n[Interlude: Diddy]\nYou fuckin' wanna walk around with these niggas? What the fuck is their culture? Where the fuck is their souls at? What defines you? These niggas with these fuckin' silly looks on their faces. You wanna walk around with them or you wanna walk with God, nigga? Make up your goddamn mind\n\n[Verse 2: Rick Ross]\nI'm from where the streets test you\nNiggas mix business and pleasure where the cocaine measure\nThe narcotics is our product\nThe by-product, you walk up on me, I cock it\nNew Mercedes as it peels off\nNothin' penetrates the steel doors, gang signs, see 'em all\nI said my prayer as I'm countin' sheep\nNever really athletic, but I play for keeps, do you feel me?\nThe mortician, the morgue fillin' with more snitches\nWe kill 'em and takin' their bitches, R.I.P\nChinchillas on a winter night\nBlack bottles when I'm feelin' like, you wanna know what winners like\nAnd I'm never on that tour bus\nJust a decoy for niggas, the PJ's for two of us\nCiroc boys down to die for Diddy\nMy niggas ride for less, keep it real, homie, made me filthy\nTouch mine, until it's even: kill\nLike I'm knowin' every heathen will, closed the deal with Steven Hill\nWe Magic City of the networks\nCut a nigga cast off, how my nigga net worths\n\n[Hook: French Montana]\nMomma's tryna save me but she don't know I'm tryna save her\nMan, them niggas tried to play me, man, 'til I got this paper\nYou're nobody 'til somebody kills you\n\n[Outro: Diddy]\nFuck, y'all wanna talk about fuckin' jewelries and Bentley's and Hublot's and fuckin' art that niggas ain't got on their fuckin' walls and fuckin' mansions niggas ain't got. Niggas can't even pay the IRS, let alone their fuckin' staff, nigga. You gotta tell the truth, man. The truth'll set you free, son, the truth will set you free", "image": "https://images.genius.com/4572c45790f47ff0adf42cf53122823c.1000x1000x1.jpg"}], "artist": "Rick Ross"}