{"songs": [{"title": "Be My Dirty Love", "album": "You Nasty", "year": null, "lyrics": "(singer croons \"be my.. dirty love\" 2X while Short spits)\n\nAin't nuttin changed.. Short Dawg\nSheezee.. sheezee\n\n(singer croons \"be my.. (be my) dirty love (dirty love)\" 2X)\n\nMuch love y'all\nShort Dawg's in this\n\nVerse One: Too $hort\n\nI'm high profile, but you can't see me ho\nGot limosine tint like a real CEO\nHands free, talkin on the speaker phone\nHandlin my business, just tryin to get my freak on\nYou know, bitches always beepin me with code 69\nI'm real with mine, I make hoes wait in line\nCan't fuck em all, and don't want to\nCause some of these tramps might front you (watch out)\nYou waited six months, I fucked her on the first date\nAnd so I smoke the green weed to keep my mind straight\nIt's Friday, doin shit my way\nMe and yo' bitch, rollin down the highway (right)\nWhile you shootin that.. she gave it up easy\nFore-a-play and all that, wasn't tryin to tease me\nNow you wanna feud, fuck that shit (slut)\nLet's fight behind a lady, not that punk ass bitch\n\n(singer croons \"be my.. dirty love\" 2X while Short spits)\n\nWatch em.. keep your eyes open\nDoesn't make sense\n\nVerse Two: Too $hort\n\nNow here I go, spittin another verse\nLet the pen read my mind cause the shit ain't rehearsed\nI'm so curious, about what this fat bitch have\nA big bag of weed and a pack of zig-zags (smokin)\nSo I kicked it with her, with no intentions to fuck\nSmoked up her weed and got my dick sucked (yeah right)\nI said I got a lot of money but I'm short on cash\nCould you give a nigga some so I can get some gas? (stupid shit)\nShe gave me twenty dollars, I know it's small pimpin\nBut it's mandatory, when I deal with all women (all these hoes)\nIt ain't gon' be no one-sided, I support her shit\nJust because she hurt, Too $hort got a grip, beyitch!\nI break it down, like the beat\nRide you like a motherfuckin seventy-three\nOld school, everytime I roll through\nAll you suckers know who all the bitches go to, Short Dawg\n\n(singer croons \"be my.. dirty love\" 2X while Short spits)\n\nFuck a bitch.. they fuck with you main\nFoul mouthed little motherfuckers.. ?\n\nVerse Three: Too $hort\n\nIt's cause rap music is like sellin dope\nEvery dollar you invest you get seven mo' (and that's real)\nI hope you never ask me, how much it costs\nIf you can't figure out how the fuck I floss (big ballin)\nYou better get in where you fit in\nCause a nigga like me ain't kiddin (no jokes)\nHere come her boyfriend, with that narrow minded shit\nKissin on the bitch, she sucked e'rybody dick (slut)\nDon't get mad, you knew the bitch had flaws\nRidin in the Benz (bitch) dick hangin out my drawers..\n.. now why she give me head? (why?)\nAll she ever wanted was to get in my bed\nI ain't gotta be a trick to tramp your ho (nope)\nI spit the game like a pimp while I'm ridin chrome\nI had a dream I was through, can't sell records\nCan't catch hoes, bring em home and get naked (what?)\nIt's not the first time, I had this dream\nBut music is my drug and I'm a dopefiend (straight)\nThe way I put it down, it don't seem too hard\nScorin points like Kareem-Abdul Jabbar (swish)\nAnd if you tryin to catch me, you'll find out fast\nWhat you tryin to do is an impossible task (can't do it)\nCause what I'm doin (can't do that) no rapper ever did it\n(can't do that) Eleven albums and I'm still the shit, bitch!\n\n(singer croons \"be my.. dirty love\" 2X while Short spits)\n\nCan't do that.. nah nah.. ain't gon' happen\nOld school Too $hort, that's right I said Too $hort\n\n(singer croons \"be my.. (be my) dirty love (dirty love)\" 2X)\n\nWe go way back, youknowhatI'msayin?\nBuy you some motherfuckin business\nGet up out the madness", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}