{"songs": [{"title": "BUS that", "album": null, "year": "2017-04-17", "lyrics": "[Intro]\nI'm on the road right now\nBack of the tour bus, chillin' (Kato on the track bih)\nJust wanted to drop some shit\nYou know\n\n[Verse 1]\nOkay, a wise man told me\nThat niggas that you beef with will pro'ly be your best pals\n(Is that right?) Got my ear to the streets\nAnd I notice everybody dropping shit, I feel left out\n(Is that right?) If you in it for the cheese\nThis is real trap music, yeah, you go be a dead mouse\n(Is that right?) You on a oneway street\nEither collide or turn it around, that'd be your best route\nListen, y'all need to stop with the dissing\nNo one pays attention, so quit with the chitchat\nListen, y'all niggas steadily fishing\nYou riding me hard and my girl want my dick back\nListen, these niggas play like it's cool\nAnd then run their mouth soon as I'm leaving, why is that?\nListen, I've been touring off an album\nI ain't even dropped, you pro'ly think I rigged that (Nice)\nI'm the plate, nigga, you just the dish rack\nThe whole Ill Mind series, I done did that\nNiggas double taking, getting whiplash\nHow you tryna school me when I skip class\nConfrontation with you is just quick cash\nWhat the fuck you gon' do when your ship crash?\nI got the juice, don't get caught in the splish splash\nWe don't fit in together, we mismatched\nI am the misfit that nobody likes\nI am colder than ice, I will hold up your life\nYou bigging you up, you were so overhyped\nYou were no good with mics, you'll be gone overnight\nI saw my window and I dove on it right\nPlus the flow is precise, I'm just rolling the dice\nYou claim that you got the shit on lock\nThinking you safe, but homie, I done broken it twice\nAlright\n\n[Chorus]\nAll around the fucking planet\nNiggas on my shit, dog\nWest side, east side, north side, south side\nBitches on my dick, dog\nSnatch yo' freak, I'm that nigga\nCash on fleek, I'm that nigga\nPast O.D., I'm that nigga\nAs for me, I'm that nigga\nAll around the fucking planet\nNiggas on my shit, dog\nWest side, east side, north side, south side\nBitches on my dick, dog\nSnatch yo' freak, I'm that nigga\nCash on fleek, I'm that nigga\nPast O.D., I'm that nigga\nAs for me, I'm that nigga\n\n[Verse 2]\nLook, got a brand new chick\nShe a law student working real hard out in Cape Town\n(Cape Town, Cape Town) I became ill\nWhen I hit the beat raw, it was ass up, facedown\n(Facedown, facedown) Homie, you ain't shit\nYou tryna shine, I'ma turn your sunlight into a gray cloud\n(Rain, rain) Had to hit you with a new flow\nSaying that I sound like Slim Shady during 8 Mile\nYou signed your life away to record labels\nWhile I'm signing big ol' voluptuous titties\nI run through the city, the ladies are comfortable with me\nThey're wet and I want to go swimming\nA wonderful feeling (Woo)\nI strike that pussy like a thunderbolt hitting (Woo, woo)\nLadies say \"Oh my God, papi\nIt's all in my hair now, your cum is so sticky\" (Yikes)\nAm I a sellout or prodigy?\nWord on the street is the question is suss\n(Suss) Niggas threw dirt on my name\nIt's ironic that they just got left in the dust\n(The dust) You got your head in the clouds?\nI am convinced that your head is just stuck\nHmm, don't make me go through my files\nAnd pull all of your dirty evidence up (Oh no)\nNiggas it's been on, my pen strong\nIf one shot fires I'm Kim Jong, so bitch, run\nI sent bombs like ISIS from Islam\nYou drenched on with a light mist of piss, son\nWho you know could get it like this? There is none\nRip your limbs, gone from a sick collision\nSee my nuts hang low, you can't miss the big ones\nI'm coming, nigga, here, tell your chick to sip some\n\n[Chorus]\nAll around the fucking planet\nNiggas on my shit, dog\nWest side, east side, north side, south side\nBitches on my dick, dog\nSnatch yo' freak, I'm that nigga\nCash on fleek, I'm that nigga\nPast O.D., I'm that nigga\nAs for me, I'm that nigga\nAll around the fucking planet\nNiggas on my shit, dog\nWest side, east side, north side, south side\nBitches on my dick, dog\nSnatch yo' freak, I'm that nigga\nCash on fleek, I'm that nigga\nPast O.D., I'm that nigga\nAs for me, I'm that nigga", "image": "https://images.genius.com/304185418dc28c2e8953bc3b9fcba93d.1000x1000x1.jpg"}], "artist": "Hopsin"}