{"songs": [{"title": "That Power", "album": "Camp", "year": "2011-11-15", "lyrics": "[Hook]\nAll these haters, see you later\nAll that I could do, but you don't even feel me though\nI know you know I know you got that power\nThat power\nOh, oh oh\n\n[Verse 1]\nSo CG, but a nigga stay real though\nI'm fly, I'm ill, I'm runnin' shit\n3-points, field goal\nRappers used to laugh like I tripped and fell\nCause I don't stunt a gold cross like I Christian, bail\nYeah, they starin' at me jealous 'cause I do shows bigger\nBut your looks don't help like an old gold digger\nUncool, but lyrically I'm a stone cold killer\nSo it's 400 blows to these Truffaut niggas\nYeah, now that's the line of the century\nNiggas missed it, too busy, they lyin' 'bout penitentiary\nMan, you ain't been there, nigga you been scared\nAnd I'm still livin' single like Synclaire\nLovin' white dudes who call me white and then try to hate\nWhen I wasn’t white enough to use your pool when I was eight\nStone Mountain, you raised me well\nI’m stared at by Confederates, but hard as hell\nTight jeans, penny loafers, but I still drink a fo' dime\nStaying on my me shit, but hated on by both sides\nI’m just a kid who blowin' up with my father’s name\nAnd every black \"You're not black enough\"\nIs a white \"you're all the same\"\nMm Food like Rapp Snitch Knishes\n'Cause it's Oreos, Twinkies, coconuts, delicious\nHow many gold plaques you want inside your dining room?\nI said, \"I want a full house\"\nThey said, \"You got it, dude\"\n\n[Hook]\nAll these haters, see you later\nAll that I could do, but you don't even feel me though (Brra)\nI know you know I know you got that power\nThat power\nOh, oh oh\n\n[Verse 2]\nHolla, holla, holla, holla at your boy\nLike your dad when he's pissed off\nGot flow, I could make a cripple crip walk\nNiggas' breath stank, all they do is shit talk\nPeople want a real man, I made 'em wait this long\nMaybe if he bombs, he'll quit and keep actin'\nAnd save paper like your aunt does with McDonald napkins\nHow'd it happen? Honesty did it\nSee all of my competition at the bodies exhibit\nYeah, I bodied the limits and I deaded them fakers\nMotherfuck if you hate it, cremated them haters\nSo, my studio be a funeral\nYeah, this is our year, oh you didn't know?\nUh, yeah I'm killin' you, step inside the lion's den\nMan I'm hov if the 'O' was an 'I' instead\nOn stage wit' my family in front of me\nI am what I am: everything I wanna be\n\n[Hook]\nAll these haters, see you later\nAll that I could do, but you don't even feel me though\nI know you know I know you got that power\nThat power\nOh, oh oh\n\n[Outro]\nThis is on a bus back from camp\nI’m thirteen and so are you\nBefore I left for camp I imagined it would be me and three or four other dudes\nI hadn’t met yet, running around all summer, getting into trouble\nIt turned out it would be me and just one girl. That’s you\nAnd we’re still at camp as long as we’re on the bus\nAnd not at the pickup point where our parents would be waiting for us\nWe’re still wearing our orange camp t-shirts. We still smell like pineneedles\nI like you and you like me and I more-than-like you\nBut I don’t know if you do or don’t more-than-like me\nYou’ve never said, so I haven’t been saying anything all summer\nContent to enjoy the small miracle of a girl choosing to talk to me\nAnd choosing to do so again the next day and so on\nA girl who’s smart and funny and who, if I say something dumb for a laugh\nIs willing to say something two or three times as dumb to make me laugh\nBut who also gets weird and wise sometimes in a way I could never be\nA girl who reads books that no one’s assigned to her\nWhose curly brown hair has a line running through it\nFrom where she put a tie to hold it up while it was still wet\n\nBack in the real world we don’t go to the same school\nAnd unless one of our families moves to a dramatically different neighborhood\nWe won’t go to the same high school\nSo, this is kind of it for us. Unless I say something\nAnd it might especially be it for us if I actually do say something\nThe sun’s gone down and the bus is quiet. A lot of kids are asleep\nWe’re talking in whispers about a tree we saw at a rest stop\nThat looks like a kid we know\nAnd then I’m like, “Can I tell you something?”\nAnd all of a sudden I’m telling you\nAnd I keep telling you and it all comes out of me and it keeps coming\nAnd your face is there and gone and there and gone\nAs we pass underneath the orange lamps that line the sides of the highway\nAnd there’s no expression on it\nAnd I think just after a point I’m just talking to lengthen the time\nWhere we live in a world where you haven’t said “yes” or “no” yet\nAnd regrettably I end up using the word “destiny”\nI don’t remember in what context. Doesn’t really matter\nBefore long I’m out of stuff to say and you smile and say, “okay”\nI don’t know exactly what you mean by it, but it seems vaguely positive\nAnd I would leave in order not to spoil the moment\nBut there’s nowhere to go because we’re on a bus\nSo I pretend like I’m asleep and before long, I really am\n\nI wake up, the bus isn’t moving anymore\nThe domed lights that line the center aisle are all on\nI turn and you’re not there\nThen again a lot of kids aren’t in their seats anymore\nWe’re parked at the pick-up point, which is in the parking lot of a Methodist church\nThe bus is half empty. You might be in your dad’s car by now\nYour bags and things piled high in the trunk\nThe girls in the back of the bus are shrieking and laughing and taking their sweet time\nDisembarking as I swing my legs out into the aisle to get up off the bus\nJust as one of them reaches my row\nIt used to be our row, on our way off\nIt’s Michelle, a girl who got suspended from third grade for a week\nAfter throwing rocks at my head\nAdolescence is doing her a ton of favors body-wise\nShe stops and looks down at me\nAnd her head is blasted from behind by the dome light, so I can’t really see her face\nBut I can see her smile. And she says one word: “destiny”\nThen her and the girls clogging the aisles behind her all laugh\nAnd then she turns and leads them off the bus\nI didn’t know you were friends with them\n\nI find my dad in the parking lot. He drives me back to our house and camp is over\nSo is summer, even though there’s two weeks until school starts\nThis isn’t a story about how girls are evil or how love is bad\nThis is a story about how I learned something and I’m not saying this thing is true or not\nI’m just saying it’s what I learned\nI told you something. It was just for you and you told everybody\nSo I learned cut out the middle man, make it all for everybody, always\nEverybody can’t turn around and tell everybody, everybody already knows, I told them\nBut this means there isn’t a place in my life for you or someone like you\nIs it sad? Sure. But it’s a sadness I chose\nI wish I could say this was a story about how I got on the bus a boy\nAnd got off a man more cynical, hardened, and mature and shit\nBut that’s not true. The truth is I got on the bus a boy. And I never got off the bus\nI still haven’t", "image": "https://images.genius.com/00196af444633a4108e6dc544358985e.630x630x1.jpg"}], "artist": "Childish Gambino"}