{"songs": [{"title": "Mark McGwire", "album": "Notice Me", "year": "2013-01-15", "lyrics": "[Intro: DJ Drama]\nYeah, I guess I feel like Lance Armstrong\nYou know, I win the race, hell yeah\nWe call it the Tour of the Streets\nBut it’s like I'm cheatin'\nCause my shit is on steroids\nAnd they shit ain't\nYou niggas keep peddlin', though\nMr. Thanksgiving\n\n[Hook]\nI took those VVS's - and slapped ‘em right on my chest\nAfter I smash her, I don’t care who come next\nI took off in a Bentley, and came back in a Spider\nMy trap on steroids, we servin' Mark McGwire\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\n\n[Verse 1]\nI think I'm Big Meech – all my niggas sell drugs\nCause I'm a rich nigga – she wanna give me a hug\nBut she a freak ho - and I won’t show her no love\nMy shit's on Mobb Deep - like I'm from NYC\nA thousand for some glasses - I see my city in 3D\nI'm poppin' bottles, nigga - like it’s the 4th of July\nI think I’m Bill Gates - I'm takin' over the Net\nWe shootin' choppers, nigga - we ain't fuck with them tecs\nI think I'm Young Jeezy - cause I motivate thugs, yeahhhh\nI think I'm Lil’ Boosie - I’m ‘bout to start sendin' hits\nAnd Future Castellano - I’m on that mafia shit\n\n[Hook]\nI took those VVS's - and slapped 'em right on my chest\nAfter I smash her - I don't care who come next\nI took off in a Bentley - and came back in a Spider\nMy trap on steroids - we servin' Mark McGwire\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\n\n[Verse 2]\nI know my dope raw - I seen it come out her ass\nI wipe that shit off – and throw it right in the bag\nI'm livin' fabulous – the shit I do in your dreams\n\"Future you're arrogant\" – now I think I’m the king\nName a bitch I can't fuck – name a bitch that ain’t tight\nName a bitch that ain't a slut – just name one, name one\nI think I'm Antawn Jamison – I'm ballin', ballin', ballin'\nI think I'm Ted Turner – when I ride around with that burner\nI got three young gunners - and they gon' squeeze on anything I point at\nI think I'm Ferragamo – I think I'm leanin', I think I'm leanin'\nI think I'm 'bout to turn up - I think I'm 'bout to burn up\nA sack full of hundreds - all this ice on me\n\n[Hook]\nI took those VVS's - and slapped 'em right on my chest\nAfter I smash her - I don't care who come next\nI took off in a Bentley - and came back in a Spider\nMy trap on steroids - we servin' Mark McGwire\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?\nWho you think you is? Who you think you is?", "image": "https://images.genius.com/f92c4abd9da5850837b46aedc6026a03.500x500x1.jpg"}], "artist": "Future"}