{"songs": [{"title": "Mad Fo", "album": "#IDGAF", "year": "2013-05-24", "lyrics": "[Intro: Swizz Beatz]\nYou know one thing I hate?\nIt's when a person come up to me or I hear somebody say, “It must be nice”\nYou know my answer that is, “You must be a hater”\nTell me why you mad fo' (Remo the Hitmaker)\nHey, listen here, Luda, we gotta keep it real, boy\nWe gon' do it like this, baby\nListen here, you know what I'm saying? Luda\n\n[Chorus: Swizz Beatz & Ludacris]\nTell me what they mad fo', come around the hood\nSee us sitting there looking good\nTell me what they mad fo' 'cause you be on the radio\nSounding like you made a million dollars\nYeah, time to start putting grown-ass men on time out\nTell me what they mad fo'\nHuh? Tell me what they mad fo'\nGo to the corner and cry somewhere, man\nTell me what they mad fo'\nOld insecure ass, nigga, yo heart pump Kool-Aid, man\nTell me what they mad fo'\nWhat you mad at me for? Luda\n\n[Verse 1: Ludacris]\nIs it 'cause I got houses on every coast?\nOr that I'm on that Forbes list makin' rich rappers look broke?\nWhile they're blowin' that smoke, I'm blowin' a couple million, makin' a killin' stuntin' on impostors\nOnly rapper in the game with a Grammy and an Oscar (and the winner is...)\n7-figure movie deals, 8 figure bank runs\nAnd I'm still feedin' the same hood that I came from (yeah!)\nAny car that you got, I've already drove\nAny chick that you hit, my nigga, I've already hoed (I did, ow!)\nSay it with your chest like these diamonds in my charm\nName on my headphones, label tatted on my arm (oh!)\nAir traffic control say, “Ludacris is insane”\nThat niggas daughter's birthday's the tail number on his plane (tell 'em, real talk)\nFuck with me but nobody's fuckin' with me\nTakin' a shot of my cognac, more millions, real G's chug it with me\nIf I'm happy, there's no reason you should be sad for (why?)\nSo will somebody, can somebody please\n\n[Chorus: Swizz Beatz & Meek Mill]\nTell me what they mad fo', ah, come around the hood\nSee us sitting there looking good, skrrt\nTell me what they mad fo' 'cause you be on the radio, yeah\nSounding like you made a million dollars\nTell me what they mad fo', ha\nTell me what they mad fo'\nIs you niggas hatin' 'cause you mad\nOr is you mad 'cause you hatin'?\nTell me what they mad fo'\nChoose one, hater\nTell me what they mad fo'\n\n[Verse 2: Meek Mill]\nNow if these niggas hatin' on me, I'ma kill 'em dead\nIf I wasn't rappin' I'd be probably be in the feds\nIn the cell, gettin' mail, with a million dollar bail\nBut instead of countin' blues, I'ma take this YSL\nAnd this Gucci, and this Louis, Prada 'cause I'm hotter\nI used to ball in Philly, with that nina Iguodala\nI beefs up in my Beamer, check aboard my collar (skrrt)\nAnd when I check my bank account, I'm checkin' for them commas\nI'm like all these niggas haters, all these bitches fuckin'\nAt 24 I went and bought a Ghost like it was nothin'\nAt 25 I bought that Aston Martin, now we stuntin'\nAnd you nigga still talkin' all this money, shit, you bluffin'\nYou bluffin', you bluffin', I really think you bluffin'\n100,000 dollars, magnum bottles just crush 'em\nNow tell me why you hatin'? You hatin' 'cause you mad?\nOr is you mad because you hatin'? Boy, you sad\n\n[Chorus: Swizz Beatz & Chris Brown]\nTell me what they mad fo', come around the hood\nSee us sitting there looking good\nTell me what they mad fo' 'cause you be on the radio\nSounding like you made a million dollars\nTell me what they mad fo'\nHuh, tell me what they mad fo'\nTell me what they mad fo'\nTell me what they mad fo'\nHaha, look, yeah, okay\n\n[Verse 3: Chris Brown]\nI see why you mad, I'm countin' all this money\nAnd I'm poppin' all these tags, hoppin' to it, fuckin' bunnies\nReal nigga, one hundred, you tryna do it, I done it\nI spit sick on this rap shit, make 'em sick to they stomach\nI'm clean, man, you hate, mad 'cause I make it keep it real with a real nigga\nI got racks on racks and a black Maybach, call it black on black 'cause I kill niggas\nIn the club, all girls, no niggas, don't talk to me 'cause I ain't really tryna hear niggas\nIn the coupe, it's the truth and the roof go poof, vamoose, I can make it disappear, nigga\nSee this the type of shit that I be sayin'\nJust because I'm ballin', that don't mean a nigga playin'\nYup, haters can blow me like a fan\nFlyer than a bitch, I don't think I'ma ever land\nBut in the meantime, baby, what's your plan?\nYou can call me daddy but I can't be your man\nFiendin' like the addicts, when I pull it out, they panic\nBi-bi-bitch, I do damage, you gon' need an ambulance\n\n[Chorus: Swizz Beatz]\nTell me what they mad fo', come around the hood\nSee us sitting there looking good\nTell me what they mad fo' 'cause you be on the radio\nSounding like you made a million dollars\nTell me what they mad fo'\nHuh, tell me what they mad fo'\nShowtime\nTell me what they mad fo'\nPut one hand in the air if you know somebody\nThat's mad at you right now for no reason\nTell me what they mad fo'\nCan you hear me now? Ayy\n\n[Verse 4: Swizz Beatz]\nAyy, ridin' around in my Jeep, bumpin' that 2Pac (ayy, ayy)\nI'm walkin' around in my hood, cocked back two Glocks  (bam)\n98 in my status, I came back, I'm the baddest\nChristian's on my feet, I told you, I'm the baddest (damn, ayy)\nAll the way in Paris, don't talk, you'll get embarrassed (yeah)\nMy watch is fuckin' up, yeah, you get embarrassed (ayy)\n500 hunnid on them racks, pulled out them stacks (get 'em, Gs)\nNiggas talkin' crazy, drop top Maybachs (ow!)\nMy life is just ludicrous, sucker, you just new to this\n430's pullin' up, godddamn we do this shit\nChickens and the waffles, chillin' in the villa\nBumpin' Ludaversal, gettin' that scrilla\n\n[Chorus: Swizz Beatz & Pusha T]\nTell me what they mad fo', huh, come around the hood, ayy\nSee us sitting there looking good\nLadies and gentleman\nTell me what they mad fo' 'cause you be on the radio\nSounding like you made a million dollars\nHa, tell me what they mad fo'\nYuugh\nTell me what they mad fo'\nWoo\nTell me what they mad fo'\nHey Luda, you know why these haters mad right?\nTell me what they mad fo'\nThe truth shall set you free\n\n[Verse 5: Pusha T]\nIf you sellin' all the records and you fuckin' all the bitches\nAnd you sit a top of the charts and you livin' out your wishes\nWith your chains all smothered and your watches all glittered\nAnd your Ghost and your Phantoms all comin' home to visit\nOr maybe 'cause your bitches was never really your bitches\nWith your baby mama fuckin' every rapper in the business\nNiggas sayin' you was better when the drugs was in your system\nNow your crack swag gone ever since you came from prison\nGot you tweetin' all stupid, is you skatin', is you dissin'?\nFound out your Ghost leased and your Phantom just rented\nWon’t need it in your name like Pac when he went missin'\nMakaveli lives on so I'm ridin' on you bitches\nHail Mary be the witness, Lord Willin', I was dealin'\nStupid motherfuckin' five star, tatted on his ceilin'\nBulls eye, be the motherfuckin' target for this killin'\nAin't y'all the motherfuckers with the millions?\n\n[Chorus: Swizz Beatz]\nTell me what they mad fo', come around the hood\nSee us sitting there looking good\nTell me what they mad fo' 'cause you be on the radio\nSounding like you made a million dollars\nTell me what they mad fo'\nHuh, tell me what they mad fo'\nTell me what they mad fo'\nTell me what they mad fo'", "image": "https://images.genius.com/59084ad168e65b54e99e3d6e138cdf83.500x500x1.jpg"}], "artist": "Ludacris"}