{"songs": [{"title": "Kill My Pain (Mixup)", "album": null, "year": null, "lyrics": "[Eminem]\nBack's to the wall, I'm stacking up all them odds\nToilets clogged, yeah, ‘cause I'm talking a lot of\nShit but I'm backing it all up\nBut in my head there's a voice in the back and it hollers\nAfter the track is demolished, I am your lack of a conscience\nI'm the ringing in your ears\nI'm the polyps on the back of your tonsils\nEatin' your vocal chords after your concerts\nI'm your time that's almost up that you haven't acknowledged\nGrab for some water\nBut I'm that pill that's too jagged to swallow\nI'm the bullies you hate that you became\nWith every faggot you slaughtered\nComing back on you, every woman you insult\nBatter, but the double-standards you have\nWhen it comes to your daughters\nI represent everything you take for granted\n‘Cause Marshall Mathers, the rapper's persona\nIs half a facade, and Matthew and Stan's just symbolic\nOf you not knowing what you had 'til it's gone\n‘Cause after all the glitz and the glam\nNo more fans that are calling your name\nCameras are off, sad, but it happens to all of them\n\n[Evanescene] (x2)\nI tried to kill my pain\nBut only brought more\nSo much more\nI lay dying\nAnd I'm pouring crimson regret and betrayal\n\n[Notorious B.I.G]\nCheck it, I grew up a fuckin' screw-up\nGot introduced to the game, got a ounce and fuckin' blew up\nChoppin' rocks overnight\nThe nigga Biggie Smalls tryna turn into the black Frank White\nWe had to grow dreads to change our description\nTwo cops is on the milk box missin'\nShow they toes, you know they got stepped on\nA fistful of bullets, a chest full of Teflon\nRunnin' from the police, picture that\nNigga, I'm too fat, I fuck around and catch a asthma attack\nThat's why I bust back, it don't phase me\nWhen he drop, take his Glock and I'm Swayze\nCelebrate my escape, sold the Glock, bought some weight\nLay back, I got some money to make\n(I repeat)\nCelebrate my escape, sold the Glock, bought some weight\nLay back, I got some money to make\n\n[Evanescence] (x2)\nI tried to kill my pain\nBut only brought more\nSo much more\nI lay dying\nAnd I'm pouring crimson regret and betrayal\n\n[2Pac]\nBut still I'm havin' memories of high speed when the cops crashed\nAs I laugh, pushin' the gas while my Glocks blast\nWe was young and we was dumb, but we had heart\nIn the dark, will we survive through the bad parts?\nMany dreams is what I had, and plenty wishes\nNo hesitation in extermination of these snitches\nEnvious bitches, they still continue to pursue me\nA couple of movies, now the whole world's tryna screw me\nEven the cops tried to sue me, so what can I do?\nBut stay true, sippin' 22's of brew\nAnd now media is tryna test me\nGot the press askin' questions, tryna stress me\nMisery is all I see, that's my mind state\nMy history with the police will shake the crime rate\nMy main man had two strikes, slipped, got arrested, and flipped\nHe screamed \"Thug Life!\" and emptied the clip\nGot tired of runnin' from the police\n\n[Evanescence] (x2)\nI tried to kill my pain\nBut only brought more\nSo much more\nI lay dying\nAnd I'm pouring crimson regret and betrayal\n\n[Eminem]\nThere they go, packin' stadiums as Shady spits his flow\nNuts they go, macadamian they go so ballistic, whoa\nHe can make them look like Bozos\nHe's wondering if he should spit this slow\nFuck no! Go for broke\nHis cup just runneth over, oh no\nHe ain't had a real buzz like this since the last time that he overdosed\nTheyve been waiting patiently for Pinocchio to poke his nose\nBack into the game and they know\nRap will never be the same as before\nBashing in the brains of these hoes\nAnd establishing a name as he goes\nThe passion and the flame is ignited\nYou can't put it out once we light it\nThis shit is exactly what the fuck that I'm talking about when we riot\nYou dealin with a few true villains\nWhose stand inside of the booth truth spillin\nAnd spit true feelings, until our tooth fillings come flying up out of our mouths\nNow rewind it!\nPayback muthafucka for the way that you doubted me hows it taste?\nWhen I slap the taste out your mouth with the bass so loud that it shakes the place\nIm Hannibal Lecter so just in case youre thinking of saving face\nYou ain't gonna have no face to save by the time I'm through with this place\nSo Drake\n\n[Evanescence] (x2)\nI tried to kill my pain\nBut only brought more\nSo much more\nI lay dying\nAnd I'm pouring crimson regret and betrayal", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}