{"songs": [{"title": "Otis Freestyle", "album": null, "year": null, "lyrics": "[DMX]\nI’m taking the mic, fuck who’s next!\n2 niggas repping the R, X & X\nMy nigga, there are no raps shit\nMy nigga clap shit that quick\nYeah, we on that shit\n\n[Busta Rhymes]\nAbout to roundhouse kick you motherfuckers face off\nMy voice so big you can turn the fuckin base off\nWanted for lots of murders lately - cops surround the place off\nI’m busting DMX up in this bitch\nYou better take off\n\n[DMX]\nWent away for a while.. jail, prison\nGetting down for real, fuck it - living!\nDon’t worry about what condition I’m in\nCats can't survive half the places I’ve been\n\n[Busta Rhymes]\nAnd while a lot of motherfuckers\nSit and watch the throne killer\nWe in the booth barking dog, welcome home\nWe spazzing in this bitch\nWhile we keeping the crowd hyped\nRemind em like what this\nShit's supposed to sound like\nDogg, I pulled up in front\nOf the jail to picked you up\nConvoy of whips with about 30 bitches in the trunk\nCome on!\n\n[DMX]\nThey saying locked down is easy\nBut a nigga like me is greasy\nPopulation or PC, Check my 5 nigga\nSee when I’m on\nFeeding with that thing, then I’m gone\n\n[Busta Rhymes]\nMost you niggas talk too much\nPutting police on ‘em\nBunch of blabbermouth-ass niggas: Jackie Gleason\nI dig my foot in your face, putting my cleats on\nYou niggas steady watching me putting the streets on\n\n[DMX]\nYou need to think cause\nI got on and changed that something changed?\nBitch, I am the streets. What's my name\nI’ve been trying to stay suckerfree\nBut look where the suckers be\nHad the hood under me, can’t a motherfucker breathe\n\n[Busta Rhymes]\nI know you baggage claim rapper niggas.. just carry my luggage\nAnd I take great pleasure whenever it’s time to punish\nIncinerate a rhyme, let me throw their ass in the rubbish\nI don’t give fuck what they think\nYou niggas know that I run this\nYou niggas can see just what it is and how I’m on it\nHow I fuck your money up and be the foulest nigga\n\n[DMX]\nFall back cause of all that noise you're making\nOnly lets me know you boys is faking\nLet me know that everything\nYou got is mine for the takin\nBefore I leave you dead and stinkin\nLook here, I don’t play games, I don’t say names\nJump through with the guns out spraying lames\nI don’t take aim, hit the whole crowd\nI shoot loud!\n\n[Busta Rhymes]\nYa’ll niggas know my M.O, I kill you, little boy\nHeatseeker missle whistle seek and destroy\nYou ain't ready for the standoff\nAnd while a dog shooting\nI’m chopping a nigga's hand off\nFunny little nigga, see the way I treat him\nTalk shit when I whoop niggas, than I beat them\nAnd if you run around, I woop your ass cookoo\nDon't. Talk. Back. When your father's talking to you\nThese corny niggas is wavin surrender flag banners\nTaking no prisoners, pussy, I’m teaching your ass manners\nFuck your ass up bad, more bangers\nAnd air them out to dry\nLike we left them on clothes hangers\nI’m sickly as hell, eat your body up: cancer\nWho's the nicest in the spot?\nYa’ll already knowing the answer\nThen I listen to niggas talk\nAnd they fill me up with laughter\nThese niggas say they're \"thug\"\nBut be lookin' more like a dancer\nThere's something that you niggas need to know, it's so important\nThat I ain't the one to fuck with homey\nI’m tired of talking!", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}