{"songs": [{"title": "Faithful", "album": "Be", "year": "2005-10-08", "lyrics": "[Chorus: sample & (Common)]\nFaithful to the end (we got to be)\nFaithful to the end (I want to be)\nFaithful to the end (yes, it's for the people)\nI'd like to be her very best friend\n(God moves, yeah)\n\n[Verse 1: Common]\nI was rollin' around, in my mind it occurred\nWhat if God was a her?\nWould I treat her the same? Would I still be runnin' game on her?\nIn what type of ways would I want her?\nWould I want her for her mind or her heavenly body?\nCouldn't be out gettin' bogus with someone so godly\nIf I was wit' her would I still be wantin' my ex?\nThe lies, the greed, the weed, the sex\nWouldn't be ashamed to give her part of my check\nWearin' her cross, I mean the heart on my neck\nHer, I would reflect on the streets of the Chi'\nRide wit' her, 'cause I know for me she'd die\nThrough good and bad call on her like I'm chirpin' her\nCouldn't be jealous 'cause other brothers worship her\nWalk this earth for her, glory, I'm grateful\nTo be in her presence I try to stay faithful\n\n[Chorus: sample]\nFaithful to the end\nFaithful to the end\nFaithful to the end\nI'd like to be her very best friend\n\n[Verse 2: Common]\nHe worked with her, she was his lady's best friend\nEven if they don't try some ladies test men\nAnd this was a test that was bigger than him\nSome believe its the nature that is given to men\nHe had a good gig, a wife, a kid, a decent home\nOne reason or another couldn't find peace at home\nShe asked, \"Why do men always have to stray?\"\nHe said, \"I'm bad, not as bad as Eric Benet\"\n\"I used to take 'em out to eat but they wasn't really eatin'\nMighta got a little head but I wasn't really cheatin'\"\nIt's hard when your lady don't believe what you say\nAnd what you did in the past you gotta live with today\nShe asked if they could spend the night together\nHe thought, and said, \"I'm tryin' to get my life together\"\nWent home to his lady, these were his confessions\n\"Baby you a blessin' and my best friend\"\n\n[Chorus: sample]\nFaithful to the end\nFaithful to the end\nFaithful to the end\nI'd like to be her very best friend\n\n[Outro: Bilal & John Legend]\nFaithful to the end\nFaithful to the end\nI'm gonna be, I'm gonna be, I'm gonna be so faithful\nI'm gonna be, I'm gonna be so faithful\nSo, so, so\nSo, so, so\nSo faithful\nSo, so, so\nSo, so, so\nThat's what I'm gonna do\nFaithful to the end\nThat's what I'm gonna do\nFaithful to the end\nThat's what I'm gonna do\nFaithful to the end\nYeah, yeah, yeah, yeah", "image": "https://images.genius.com/af231bd3cefe10a3d898842a54af3d3f.1000x1000x1.jpg"}], "artist": "Common"}