{"songs": [{"title": "Roman Reloaded", "album": "Pink Friday: Roman Reloaded", "year": "2012-02-24", "lyrics": "[Hook: Nicki Minaj]\nBang, my shit bang, it bang-bang\nBang, my shit bang, it bang-bang\n\n[Verse 1: Nicki Minaj]\nYo, I guess I went commercial, just shot a commercial\nWhen I flew to the set, though, I ain’t fly commercial\nAnd the ad is global; your ad was local\nWhen we shot it was a lot of different agriculturals\nSo I laugh at hopefuls; \"Nicki pop!\"\nOnly thing that’s pop is my endorsement, akh\nFuck around and I'll have to go and reinforce the Glock\n\n[Hook: Nicki Minaj]\nBang, my shit bang, it bang-bang\nBang, my shit bang, it bang-bang\n\n[Verse 2: Nicki Minaj]\nYo, is it me, or did I put these rap bitches on the map again?\nYou mad ’cause I’m at the Grammys with the Vatican\nYou in the booth, but I'm who you be channelin’\nWhy they never bring you name up at the panel, then?\nHottest MCs, top five\nYou need money? I got mine\nMore knots than Eric on Basketball Wives\n(Ya dig?)\n\n[Hook: Nicki Minaj]\nBang, my shit bang, it bang-bang\nBang, my shit bang, it bang-bang\n\n[Verse 3: Nicki Minaj]\nUgh, I couldn’t do your TV show, I needed ten more mil'\nNot ten on the back, I need ten on signin'\nGive that shit to a wash-up, bitch, I’m winnin’\nIf I had a label I would never sign you, hoes\nTake bitches to school, then I Columbine these hoes\nI hear the slick shit, bitch, you washed\nAll you hoes cryin’—Christopher Bosh\n\n[Hook: Nicki Minaj]\nBang, my shit bang, it bang-bang\nBang, my shit bang, it bang-bang\n\n[Verse 4: Nicki Minaj]\nAyoow when I tell ‘em that it’s Barbie, bitch\nYes, I really do mean that it’s Barbie, bitch\nAsk Mattel: they auctioned my Barbie, bitch\nRaggedy Ann, could never be a Barbie, bitch\nYou at the bottom of the barrel, scrapin’\nI’m out in LA at the Ice Age tapin’\nI’m chillin’ at the top, I got ample time\nBite me—Apple sign, haha\n\n[Hook: Nicki Minaj]\nBang, my shit bang, it bang-bang\nBang, my shit bang, it bang-bang (HahaHA! Yeah!)\n\n[Verse 5: Lil Wayne]\nKush on my breath, cocaine on my tongue\nEat that pussy, make it numb, she can't feel herself cum\nGot a body on my gun, fuck the world with my thumb\nPop a molly, smoke a blunt, that mean I'm a high roller\nMy ex wanna work it out, bitch, try yoga\nTwo hoes in the bed, tell them hoes, slide over\nExcuse my French, two bitches and moi\nThat's a Nicki-Ménage à trois, ha!\nTunechi\n\n[Hook: Nicki Minaj]\nBang, my shit bang, it bang-bang\nBang, my shit bang, it bang-bang\n\n[Verse 6: Lil Wayne]\nUm, my shit so cold, man, it don't even stank-o\nDestructive-ass nigga, watch me break the bank\nWeezy F and the 'F' is for \"fill in the blank\"\nI say, shout out Mack Maine, backyard bully\nAnd the weed purple like a black girl pussy\nWord, middle finger on the trigger\nUnh, so you know that mean \"fuck a nigga\"\n\n[Hook: Nicki Minaj]\nBang, my shit bang, it bang-bang\nBang, my shit bang, it bang-bang\n\n[Hook: Lil Wayne]\nBang-bang, my bitch bang, she bang bang\nWell that's 'cause my bitch is Nina Ross\nA-and she bang, b-b-bang, bang bang\nShe go bang, bang-bang, bang-bang\nBang, bang-bang, bang-bang\nWe bang, bang-bang\nBang, b-b-b-bang, bang, bang, Blood gang!\nHey!", "image": "https://images.genius.com/c03dd916d36bd46dd2cd57e464236f19.1000x1000x1.jpg"}], "artist": "Nicki Minaj"}