{"songs": [{"title": "Lunch Time Cypher", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Intro: Hopsin]\nYo man\nLet's take this shit back to fuckin' high school lunch time cyphers\nWhen mother fuckers was beat boxin'\nAnd kickin' ill ass flows in the fuckin' cafeteria\nFuck all that Hollywood shit!\nLet's fucking rap, man\n\n[Hook: Hopsin]\nYo, check it\nThis that high school lunch time cypher\nI might just step in this bitch and fuck ya life up\nI hope the principal doesn't come and give me a write up\nNow who the fuck I gotta snatch the mic from?\n\n[Verse 1: Hopsin]\nI spent a long time tryna build a buzz\nHop is in the building, cuz\nStep to me up on this battlefield, you know I will erupt\nDidn't change, I'm still a nut\nThe girlies see my skills are up\nSo I be gettin' head every single night like a pillow does\nWhen a nigga be flow bashin'\nYou know I be keepin it old fashioned\nMy compassion is so tragic on instrumentals when I toe tag it\nThrow dirt on me? Then guard your face and stomach\nCause I'm swinging on you like ya ass cheeks had a rope hangin' from it\nI'm out my mind, I can't configure it\nI'm way too niggerish\nI tried to read the Bible but I'm straight illiterate\nWith anger temperaments\nI put myself in strange predicaments\nThey labeled this as sick\nThe doctor says to take some Ritalin\nMan, I'm a lunatic,rockin' a crucifix\nI'll mack on any chick I feel who got the cutest tits\nI'm wanted, fugitive,robbin' yo whip to cruise in it\nSee, I'm the only kid on Elm Street that Freddy Krueger skipped\nPants saggin' cause they too loose to fit,I'm torturous\nGrab a hammer and nail for your front door and board it shut\nI stare deep in ya eyes, rip out your soul and absorb it up\nAnd have Biggie Smalls yellin' out \"call the coroner!\"\nMy groupies stay horny\nThey always call to say \"Hopsin can you fly me out to Cali?\nPlease pay for me\"\nI make that pussy pop for you like you skateboarding\nThen you can come inside like a hurricane warning\nI got a lot of sluts, I like to call it Hopsin luck\nBut now I feel like having sex with these bitches is not enough\nI needed something new for moments when I gotta bust\nSo lately I've been beating my dick with a pair of boxing gloves\nI got the maddest rhymes, how dare yo ass deny\nI'll stab you in the brain with a knife\nYou can keep that in mind\nYou talkin' shit inside yo house, cool, fine, fuck it\nI'll break in and stomp you out inside of it\nAin't tryna be ya friend\nI'll knock you out and when you wake up\nI'll just be standing there with a mischievous grin\nLike\"Ha, we meet again\"\nI'll puncture yo skin with a crack fiend's syringe\nAnd drill your nut sack to the seat you're in\nYou want props? You don't deserve it, you're not ill\nI won't stop 'til every rapper lurkin' has got chills\nWhy these niggas actin' like they certainly pop steel\nWhen only time they carry heat is serving a hot meal\nSince I was young, been on a mission to make dough\nAnd put all my niggas on like this shit was a slave boat\nSo tell me why your songs sound like skittles and rainbows?\nThat's a dead giveaway you love to listen to Wayne bro\nI'm sick and deranged when I'm spitting this strange flow\nStuck my dick in the game, that's the business I came for\nWitness my pain grow, I don't kick it with lame folks\nSimple and plain though, you gon remember my name ho, ha!\n\n[Hook: Hopsin]\nYo, check it\nThis that high school lunch time cypher\nI might just step in this bitch and fuck ya life up\nI hope the principal doesn't come and give me a write up\nNow who the fuck I gotta snatch the mic from?\n\n[Verse 2: Passionate MC]\nI'll snatch it from anyone when I dance with Satan\nAnd detach more wigs than every female cancer patient that ever cared for a transformation\nWith a (diss joint | disjoint) sweeter than a diabetic amputation\nWhen I split niggas, clipped quicker than big pictures\nHeads get bodied with a single line like a stick figure\nCause my words are wild, and when I write\nThey can't wait for the sentence like family victims of a murder trial\nOpenly flow potently\nTighter than the choke-hold needed to put the Incredible Hulk to sleep\nTighter than the boatload of soldiers that stormed Normandy\nTighter than the hairy twat with the Virgin Mary's ovaries\nThey choke up like their throats cut when I show up\nTo keep the competition (win-free | Winfrey) like Oprah\nCause when I work with Hopsin, everybody who's hip\nIs getting (killed | kilt) like a skirt from Scotland\nThen I'll cock-back quicker than mouse traps\nAnd stare as they pull (outta here | out a hare) like magicians tricking with Top hats\nI got foreign objects\nThat'll get you (capped in America | Captain America) like Marvel Comics\nWith a strap like star guitarists\nWhen this lead of mine see ahead in time like Nostradamus\nOr swift jabs that swing left like crip flags\nWill be the reason you break (next | necks) like whiplash!\nSo who the fuck wants war with this?\nDistorted thoughts morphed this author to Spartacus\nWhen he balls his fists around the swords he lifts with the force of a horses kick\nMultiplied by the reason why god exists, and makes Thor his bitch!\nHorror flick like imagery, organs everywhere..\nYou would swear I was orchestrating a Symphony!\nIt's passion, the force within him will cause the critics to look-n' drop dead like gorgeous women, hah!\n\n[Hook: Hopsin & G-Mo Skee]\nYo, check it\nThis that high school lunch time cypher\nI might just step in this bitch and fuck ya life up\nFuck the principal, he can give me a fuckin' write up\nNow who the fuck I gotta snatch the mic from?\n\n[Verse 3: G-Mo Skee]\nDon't get this shit confused\nYou're not a person, you're delicious food\nNo matter your race, birthplace, or religious views\nAll you niggas getting chewed\nI eat a rapper, fitted cap first and then I spit out his tennis shoes\nMissing screws in my top, I don’t have the patience\nI grab the chop and leave you niggas eradicated\nI never let the doctor give me shots, I'm unvaccinated\nAnd I got small pox, you can have a blanket\nGet assassinated and left with broken bones\nIf you gotta travel through the woods don’t go alone\nI'm fucking bitches in a mobile home\nLike a mutated nigga from the hills have eyes with no Trojan on\nThis is paranormal activity with a dagger\nI got paranormal tendencies y'all just a pair of normal rappers\nSo why you talking like you not defenseless?\nI punch you ten times in the mouth\nAnd have your pussy asses hoppin fences\nI got suspended for a few weeks in the 8th grade\nWhen the principal caught me on the street tryna spray paint\nI bought a dozen eggs from Safeway\nAnd threw them at the muthafuckas house on the same day\nYou can get it the same way\nI'm making bitch niggas walk the plank\nIn crocodile infested water mixed with toxic waste\nBury you alive with a camera strapped across your face\nThen come back 2 weeks later and watch the tape\nYou cried like a bitch trying to make the coffin break\nYou died like a bitch instead of trying to concentrate\nI'm here to depopulate on the red carpet with a sniper rifle\nTaking out any nigga you nominate\nSo if you see me as soon as you turn the news on\nChances are I laid a nigga down like a futon\nWhile you at work dealing with groceries and coupons\nI got your bitch tossing my salad pass the croutons\n\n[Hook: Hopsin, Passionate MC, & G-Mo Skee]\nYo, check it\nThis that high school lunch time cypher\nI might just step in this bitch and fuck ya life up\nI hope the principal doesn't come and give me a write up\nNow who the fuck I gotta snatch the mic from?\n\n[Outro: Hopsin]\nYeah hah! Took it back to fucking lunchtime on these muthafuckas son!\nYeah, yeah, yeah, yeah, yeah Funk Volume", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}