{"songs": [{"title": "Live from L.A.", "album": null, "year": null, "lyrics": "[Hook: Snoop Dogg (& Ice Cube)]\nUh, L.A. (yay yay!), Californi-i-a (Yay yay!)\nCity of ballers, Hollywood, we love it! (we love it)\nUh, L.A. (L.A.) , Californi-i-a (Californi-i-a)\nCity of ballers, Inglewood, we love it!\n\n[Verse 1: Snoop Dogg]\nLive from L.A., this way that-a-way\nSlide in the hid-house, feeling burned did-out\nKick of your shoes and relax your feet\nAnd party on down to this DJ Quik beat\nThe beat that gets you up and gets you outta your seat\nFlip your BET on kick back and get your 'G' on\nWe on some west coast get those to the liquor store\nSippin' on some Rémy Martin before the show get started\nIt's gon' be off the hanger, and a few cool rap singers\nI can't believe it, my boy got a show now\nBow wow, let's hit the corner in my four now\nLong Beach style, make your woman wanna smile\nAnd all guests on the show gonna bust a freestyle\nSuggestin' questions and confessions\nWe havin' a good time on that BET live session\nLet's move out to Swap Meet or Rodeo Drive\nOr just post up by the Hollywood sign\nWe throwin' BBQ so life a grill\nAll my dawgs invited so y'all come on a chill\nYou at the beach or at the park or\nShootin' a [?] or at the park\nDoin' it after dark\nYou heard me? Doin' it after dark\n\n\n[Hook: Snoop Dogg (& Xzibit)]\nUh, L.A. (Los Angeles) , Californi-i-a (California)\nCity of ballers, Inglewood, we love it!\nUh, L.A. (Los Angeles) , Californi-i-a (California)\nCity of ballers, Hollywood, we love it!\n\n[Verse 2: Xzibit]\nI gotta call it hot shit now\nMost people mistake havin' money for havin' style\nWe actin' wild up in the streets without a second thought\nIt's about gettin' away and gettin' caught\nIt's written thought, matter a fact in the form of X\nI came to take everything except a final breath\nI'm rock and rollin' coast to ya left side\nAfter sunset we shine on the westside\nSo let 'em know, Cube\n\n[Verse 3: Ice Cube]\nYou know I got Snoop Dogg at my arraignment\nStart a riot for this black entertainment\nL-7's gotta ask who I came with, Xzibit\nYou midget, we don't rap it, we live it\nTake it if you don't give it\nBET is my digits, baby\nSo won't you come here, cause we can play all day\nLive from LA, that's where the party people stay, yay yay\nAnd we can do it like this, unless you flippin' on that\nAll black, get the format, sunny day, top back\nDouble R, high beams on the black and white or widescreen\nRun and tell ya family tree that they can see me on BET\nWeekly, and if it looks like Cube is gettin too much sun\nI'm comin' live from L.A. havin' too much fun\nYay yay!\n\n[Hook: Snoop Dogg (& Ice Cube)]\nUh, L.A. (yay yay!), Californi-i-a (Yay yay!)\nCity of ballers, Hollywood, we love it! (we love it)\nUh, L.A. (L.A.) , Californi-i-a (Californi-i-a)\nCity of ballers, Inglewood, we love it!", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}