{"songs": [{"title": "Biology", "album": "White Cocaine 2", "year": "2014-10-25", "lyrics": "[Intro]\n\n[Verse 1: Havoc]\nNiggas dead on arrival\nHand on the bible\nBet I be the last nigga that you ever lie to\nWhat nigga line you and anybody 'round you\nLIfe's no value, take a look around you\nAll we see is dead people\nWe're all thirst equal\nLookin' to grim reap you\nRepo' life take yours and that's that\nAnd damn near do anything for more stacks\nWith all that said they walkin' without that\nWith that there said you fool without rach\nWho the livest nigga? We pick him outta the batch\nWash him up, song about it, this is savage rap\nThrow a \"H\" on your chest, nigga handle that\nTryin' to figure where you sleep I have you man do that\nIt's a cold world [?] not rockin' the thermal\nKeep your mouth shut especially when shit don't concern you\nI got goons on Troy Ave down to Fran Lewis\nAnybody fuckin' with snitches we call the rat grooming\nSo you can keep that movin'\nI mark niggas for death, don't let me start tattooin'\n\n[Verse 2: Prodigy]\nFirst the dynasty break up\nNow everyday I wake up\nRappers want me to prove I can still bang somethin'\nMy cousin turn punk all of a sudden\nLike suddenly I'm soft like erectile dysfunction\nYou niggas is truly buggin' tryin' to act all fly\nBut y'all crabs on my ball sack, hitchin' free rides\nI know\nYou try and use me for publicity\nYou's a stunt man jump into the fire, you's a beast\nYou's the illest nigga in Omaha, you take me\nFor a easy lick, I see you real naive\nYeah you powered by lithium, all charged up\nPlus that superman juice got you feelin' it\nYo, niggas wanna move on me\nAnd make history\nAnd make TMZ and this is 50\nThat's a kamikaze mission\nI'm Commander in Chief\nYou hit Obama, guess what happen to you after you swing?\nAy yo, dog shit\nYou play yourself you gonna get curbed\nI let you know right now, whatever it is you heard\nFrom these bird ass thugs, stay chirpin' my name\nYou get yourself hurt bad, push me to display\nStrength, power, force\nWhat is it that you thought? I be lying in my songs?\nNIgga I'm a boss, you deal with my employees\nI gotta couple freelance niggas that enjoy beef\nNiggas wanna play chess, I don't even play games\nBut I do gotta few queens, nigga stay bangin'\nFive star flags, six star rags\nI will drop bodies but I'd rather drop bags\nYou should know the Bandana Don\nRun rap marathon tracks around\nAny rapper, they never last long\nThat's why they always wanna go at me\nThey know they want the top slot\nThey gotta beat the top dog", "image": "https://images.genius.com/1a1ef02a31eb57f3ac11a3474ff96147.500x500x1.jpg"}], "artist": "Mobb Deep"}