{"songs": [{"title": "I Like It", "album": null, "year": "2014-09-06", "lyrics": "[Hook: Meek Mill]\nI was fucked up, but bitch I'm back\nI wasn't in the club ho cause I was in the trap\nI see you show me love, you ain't like when I was down\nNow, I'm stuntin' on them hoes bitch, how you like me now. bitch?\nHow you like me now?\nI tell 'em how you like me now?\nCause I be shinin' like a diamond, I got money in my pocket\nI don't even have to press, I see it, like it, I'ma cop it, oh!\nI see it, like it, I'ma cop it, oh!\n\n[Verse 1: Meek Mill]\nI see it, like it, I'ma cop it, nigga, what's the topic?\nStarted from the bottom, now, I really got it poppin'\nSee these bitches in my section, they just wanna ride it\nSame hoes that fronted back, they want it, now I got it\nCause I'm ballin', I'm talking Spaldin'\nRollie on my wrist, flooded like New Orleans\nA nigga buzzin' now, I'm talking hornets\nCause I murder all my enemies, stretch my opponents\nMicrophone killer, tell em' Mac Miller\nZombies in my neighborhood, shit is like Thriller\nAnd I'm Mike Jackson cause I'm they dealer\nIn my zipped-up jacket and my neck on chiller\nGoing hard is gettin' scary, I swear it's gettin' scary\nI put mirror tint all on this ghost and screamin' Bloody Mary\nSo when you see me Bloody Mary, Bloody Mary, Bloody Mary\nA nigga play around with me, he get fuckin' buried\n\n[Hook: Meek Mill]\n\n[Verse 2: Mac Miller]\nComin' through the city, up in Philly, out with Meek\nMake a hunnit every week so now I'm stuntin' like a Sheikh\nAnd we do this shit for PA, we do this shit for PA\nHow I use to get it dirty, now my money come the clean way\nBlindfold on me, doing 100 down the freeway\nTill I'm driving off the cliff, just to fly and take a trip\nBitch, I came right out that circus shit, youngin' but i'm learning quick\nMurder this, burn your kids, then call up child services\nAnd they ain't even gotta ask, they know that Mac workin'\nAct certain, smoke a fuckin' beat like it's a Nat Sherman\nGo ahead and hand me a rapper\nI'ma chew his ass up like he a animal cracker\nI might rip your hands off, slap you in the face with 'em\nSpit straight venom, give you bars like it's a state prison\nYeah, I'm still scruffy, gettin' money\nGot all these writers mad cause they daughters wanna fuck me\n\n[Hook: Meek Mill]", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}