{"songs": [{"title": "Girl Like U", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "Yeah, yeah..un-uh, un-uh, un-uh, un-un-un-un-uh\n(ad-libbing)\nHe strikes..He strikes again\nCheck it\n\n[Hook: Nelly and Snoop]\nIf I didn't have no dough, would you love meeee?\nIf we didn't have a place to go, would you still be therrrre?\nOr would you leave me alone, when the chips are dowwwn?\nOr would you stay around, and beeee down\nOh girl!\nI gotta have a chick like you\nI gotta have a girl like you\nI gotta have a chick like you\nI gotta have a girl like you\n\n[Nelly]\nEh..eh, eh, eh\nHey little Unc, who that is standing there like that?\nLookin' from the front, but I can see what's in the back\nHips like (Oh!), thighs like (Oh!)\nPretty toes in a row and they be lookin' like (Oh!)\n\n[Snoop] (Nelly)\nIon't know nephew, let's just do what we do\nLet's just slide up on these hoes and put this pimpin' to use (Agreed!)\nAnd then what we do (What we do?)\nYou take the one in the white, I take the one in the blue\nPreach!\n\n[Hook] Nelly+ Snoop\nIf I didn't have no dough, would you love meeee? (Would you love me, girl?)\nIf we didn't have a place to go, would you still be therrrre? (Would you still be there?)\nOr would you leave me alone, when the chips are dowwwn? (when the chips are down)\nOr would you stay around, (oh, oh) and beeee down\nOh girl! (Oh!)\nI gotta have a chick like you (I gotta, I gotta)\nI gotta have a girl like you (I like this part)\nI gotta have a chick like you (Make a nigga clap to this)\nI gotta have a girl like you (Yeah, yeah, yeah)\n\n[Snoop]\nAy yo, I don't know if you been told\nBut, you look like you should be gold\nYou're so precious, the way you shape up\nI'm just here to help you step ya game up\n\n[Nelly]\nYou look like you might ride for me (you know)\nHop in front of the bullet and die for me\nCause when I fly, you be fly, you'll be fly wit me\nAnd when I fly to other countries, you gone fly wit me\nCome on\n\n[Hook] Nelly+ Snoop\nIf I didn't have no dough, would you love meeee? (Would you love me, girl?)\nIf we didn't have a place to go, would you still be therrrre? (Would you still be there?)\nOr would you leave me alone, when the chips are dowwwn? (when the chips are down)\nOr would you stay around, (oh, oh) and beeee down\nOh girl! (Oh!)\nI gotta have a chick like you (I gotta, I gotta)\nI gotta have a girl like you (I like this part)\nI gotta have a chick like you (Make a nigga clap to this)\nI gotta have a girl like you (Yeah, yeah, yeah)\n\n[Snoop]\nNow once the night wounds down, and the weed gets low\nPlayers still playin', and I'm still on a float\nI groove to the beat, 'til my feet get tired\nI just want to be your desire\nEva Knieva, best believe-a\nYour not a dime piece, your a diva\nTake it from me you can be the, O-N-E\nIf you roll wit me\n\n[Nelly]\nNow if looks was the case, baby girl'll be federal\nThe top half - incredible, the bottom half - edible (huh)\nI ain't telling you what I heard, mayne I'm telling you what I know\nAnd I ain't telling where to stay, or where to go\nAnd, if she, want me, we'll take a trip down, wit the homie\nThe D-O-double-G\nAnd if I'm lonely, jump from a lil' town\nAnd it's low-key, and guess who wear the crown (Whoo!)\n\n[Hook] Nelly+ Snoop\nIf I didn't have no dough, would you love meeee? (Would you love me, girl?)\nIf we didn't have a place to go, would you still be therrrre? (Would you still be there?)\nOr would you leave me alone, when the chips are dowwwn? (when the chips are down)\nOr would you stay around, (oh, oh) and beeee down\nOh girl! (Oh!)\n(If so!) I gotta have a chick like you (I gotta, I gotta)\n(If so!) I gotta have a girl like you (I like this part)\n(If so!) I gotta have a chick like you (Make a nigga clap to this)\n(If so!) I gotta have a girl like you (Yeah, yeah, yeah)\n\n[Outro] Nelly *fade with beat*\nClap ya hands everybod-y\nEverybod-y, clap ya hands\nAnd if ya came to party wit the D-O-double-G, and the N-E-double-L-Y band\nI said\nClap ya hands everybod-y\nEverybod-y, clap ya hands\nAnd if ya came to party wit the D-O-double-G, and the N-E-double-L-Y band", "image": "https://images.genius.com/22daab0632e506300bab596c589dcfb2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}