{"songs": [{"title": "Sut Mig", "album": "Strangeulation", "year": "2014-05-06", "lyrics": "[Verse 1: Tech N9ne]\nI done a whole lot of livin' and I hold my position\nAnecdote of condition, hey\nGotta load of your women and you know what they wishin'\nThey can blow what I'm grippin', hey\nWhat I say, when you haters broke and dusty\nCan afford no piece to snuff me, mad I'm livin' lovely, hey\nTo them suckas who wanna touch me\nWhen I done rose out the mothafuckin' dirt all I got to say to a nigga, \"suck me\"\nDouche-bags, the douchiest of the douches get deuces\nWhen I'm blowin' Caribou Lou cash\nAlways in the air like a red, white and blue flag\nCause everywhere my music blare like a Jimmy Choo bag\nI been workin', got these grown men hurtin'\nWanna begin jerkin' tens cause my win certain\nFuck that cause lately I been yen searchin'\nTryin' to get my one and only upgraded from Louis Vuitton then Birkin\nTrippin' with me cause all this work I done did\nAll this pain for me to become big\nMad at Strange you're nothing but some kids, quit it\nToured the world with Big Krizz, did it\nCouple of bitches up in the biz, hit it\nSee this ho, she wanna meet this mo\nCause I treat this flow like my jizz, spit it\nGot these niggas lookin' like a sad puppy\nCause I ride the wave of success like a huffy\nBecause of that I attract the big butt and busty\nWhat? What I'm gon' do? What I'm 'gon say to a hater?\n\n[Hook: Tech N9ne]\nSuck Me, Suck me, Suck me\nYou wanna throw salt\nYou wanna cuss me\nWhat I'm gon' say to y'all\nI'mma tell you suck me\nWho say \"dude, they tempt me\"\nS-U-C-K-M-E\nWho say \"dude, they tempt me\"\nS-U-C-K-M-E\nWho say \"dude, they tempt me\"\nS-U-C-K-M-E\nWho say \"dude, they tempt me\"\nS-U-C-K-M-E\n\n[Bridge]\nDo I bring you for y'all? (Yes)\nDo my team do it all? (Oh yes)\nOkay, when I say jealous you say bitch\nJealous (Bitch) jealous (Bitch)\nJealous jealous (Bitch, bitch)\nJealous jealous (Bitch, bitch)\n\n[Verse 2]\nYou can be negative\nI got the juice to be ahead of it\nGet the best crew then we level it\nComin' for you with thee rhetoric\nMan this industry's hoes, with my energy flows\nMan I fucked that bitch 'till she gave me the gold\nThen she gave me the Forbes, listen gave me the glow\nTook my tribe on the crazy road and baby we sold\nAll you man ladies behold, that's the way that we roll\nThat's what the swisher and ya bitch up in her wavy-vy ho\nLook, that's why them mom and daughter duos wanna fluff me\nThey love my music, they can't help but be a hussy\nYou think you stoppin' Strange, think you 'gon crush me\nBoy, s-s-s-s-s-s-suck me\n\n[Hook]", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}