{"songs": [{"title": "What You Gonna Do", "album": "Baller Blockin’ OST", "year": "2000-09-12", "lyrics": "Intro:\nStraight out of QB niggas\nThis is nas, lo\nWith my braveheart niggas\nJungle, wiz and horse\nFuckin with these Ca$h Money Millionaires\nSo what yall gonna do about that\nNiggas\n\nHook:\nWe on your block\nWe got rocks\nYou got robbed\nThe man got shot\nThat nigga's dead\nCome get revenge\nWe getting money\nWe in the benz\n\nWe drive cars\nWe fuck your hoes\nWe taking charge\nWe gettin dough\nYall niggas pussy\nI cut your face\nI'm in your hood\nEvery fucking day\n\n[Verse One: Wiz]\nYeah What up nigga im back\nFuck you got the mac\nTouch you and them niggas you with\nThe bigger your clique the bigger my clip\nThe bigger my gun them niggas im with is horse and jung\nAnd of course youll become a corpse if you fucking with me\nThe 44 caliber killer don't tussle with me\nI been to war couple of times slept in the cold\nShed tears seen it all been outside for years\nWhat this life mean to yall?\nMoney ice and cars Bustin nuts in broads\nNever trusting god\nYou better trust him had with you when you hustlin\nIt was him that kept me alive when niggas was bustin\nHe ain't gonna save you so when I AK you and spray you\nI run in your spot and take all whats yours\nSo you lay on the floor we expanding\nWhat you gonna to do about it nigga?\nNot a damn thing\n\nHook:\nWe on your block\nWe got rocks\nYou got robbed\nThe man got shot\nThat nigga's dead\nCome get revenge\nWe getting money\nWe ridin in the benz\n\nWe drive cars\nWe fuck your hoes\nWe taking charge\nWe get the dough\nYall niggas pussy\nWe cut your face\nWe in your hood\nEvery fucking day\n\n[Verse 2a]\nWhat the fuck yall was born brave?\nI put a slug through your cornbraids\nSummertime broad day\nYou get your face blown right at the pay phone\nI got big guns that break bones\nBeef with me you take home to your family\nBullets fly randomly\nWet you like hard rain\nBravehearts gangbang\n\n[Verse 2b: Nas]\nYo last night it was on Niggas came pistols drawn\nPoppin off I had to run they shot one the kid is gone\nNiggas quick to get it on know the block im living on\nQueens bridge murders kings live merciless\nHeartless crazy mercedes the projects young killas OG's enemies targets\nBlow weed henessee more beef let it be\nNo chance of wetting me I hold heat in the streets\nRolls royce drop top crusing where the women be\nLast nigga fucked around hes a hood memory\nFresh nikes wife beater knicks jersey white sneakers\nHeavy like an ice freezer deadly not nice either\nIll fuck the ho with pussy that's mind blowing\nDo my thug dance in clubs with my nine showing\nNiggas tell they hoes, \"why you fucking with nas?\nHe just gonna nut on your eyes\nHave you suck all his guys\nAnd also he say when you done cussin his by\"\nYou ain't thuggin you lie bitch\nBrave till we die bitch\n\n[Verse 2c: Horse]\n??? a nigga that would kill something over something small\nThe one you can't ??? with unless you paid in full\nThe one that hold grudges cause gun games for free\nThe only thing you wetting and splittin is ???\nIm the one that lift the skirts up on fake ass rappers\nThat be killin for a long time but now it don't happen\nAll them tough guys is wanksters they ??? me in their songs\nIm a braveheart till death so I got to die strong\nA big man that's troublesome and follow no rules\nRun through crews after smoking blunts and sippin on brews\nDisrespecter pistol whippin hustlers for their cheddar\nThe deebo of the rap game but walk with a beretta\nMy heart is made of stone my eyes is filled with blood\nSurvivors of the street wars yall niggas know whats up\nFrom the projects to penthouse yall niggas better look out\nBefore these braveheart motherfuckers put they gun in your mouth\n\nHook:\nWe on your blocks\nWe got Glocks\nYou get robbed\nThe man get shot\nThat nigga's dead\nCome get revenge\nWe getting money\nWe ridin in the benz\n\nWe drive cars\nWe fuck your hoes\nWe taking charge\nWe gettin dough\nYall niggas pussy\nWe cut your face\nWe in your hood\nEvery fucking day\n\nShit talking at end:\n\nWe in your hood\nEvery fucking day niggas\nEvery day niggas, huh\nLook around niggas\nWe on top\nWhat you gonna do about it nigga?\nWhat you got to say about it nigga?\nThat's right\nThat's right\nRun all over yall niggas\nWhat yall gonna do about it? Nothin\nBunch of corny ass phony ass niggas\nGet brave nigga we brave nigga (bravehearts!)\nBrave to the death baby\n(bravehearts!)", "image": "https://images.genius.com/d4fe589e61d6a1ea910f4acd62330a24.220x220x1.jpg"}], "artist": "Nas"}