{"songs": [{"title": "Broken Safety", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "[Kung Fu sample]\n*sounds of fighting*\nHeh, do you know any other styles?\nI am very grateful!\nAre you ready?\nI'm ready...\n\n[Verse 1: Jadakiss]\nUh, down on 40 Deuce, when I was a shorty duke\nThat's when I first got the Nauti' goose\nNow I come through in a sported coupe\nI know what you better do, stop talking bout what you outta do\nMy crack spot is still portable\nFunerals are still affordable, I'm better than all of you\nI'm in the hood scraping 'em, Jadakiss, Rae and 'em\nYa'll lame niggas, come uptown, spend a day with 'em\nBigger ones, bootleg liquor runs, blow something, nigga\nLet the Earth smoke hit your lung, get your guns\nThe economy is down, so you already know\nIt's gon' be a lot of homi's in the town\nThat's why I'm still bringing the seed back\nThe sneakers that I can't pronounce, that cost a G stack\nNiggas in the yard, got this on repeat, black\nFuck saving hip hop, we bringing the streets back, what?\n\n[Verse 2: Raekwon]\nPlayer spit snipping, different color wallies on\nBliffen had to take 'em off, they fucked up the soles, flipped it\nI'm forever zooted, crushed up glass, I'm just flashing through it\nNine times out of ten, suede down at the Jumer\nMaybach bloomers, playing rumors, card shark\nGetting cash money, take a loan, hit this tuner\nWe onion head niggas, the gun gooners\nPut us together, he run sea, I run land, with one ruger\nStop playing, you know we run rap, you know we done that\nStop fronting, son, put the gun back\nWe came with the containers, besides having the flamers\nMy Mexican mans is famous\nRunning through the streets, the bulldog\nConehead hoodies on, eighteen five for footballs\nMaxed like I'm under a good wall, good G\nGood recipe, good status, a hood broad\n\n[Verse 3: Styles P]\nI used to move brown rectangles\nRoll you a blunt, then smoke you with death's angel\nChrome trey pound is making your neck dangle\nBlue trey eight is leaving your chest mangled\nIt's math but the gun could kill you at all angles\nLeave the toast home, I'm leaving you all strangled\nLouis loafers on the Jaguar, gas pedals\nYou got the cops with you, you ain't even half ghetto\n(Not even half) We neither here nor there\nBut if, you was over here, you would of been got aired\n(Been got aired) Like a pair of white Nike's on a summer day\nPointing the gun away, I could kill you niggas a hundred ways\nMinds in a place that yours ain't, so I'm wearing war paint\nFor the day that I see the Lord saint\nBlowing the purple haze, playing The Purple Tape\nFuck with Chef or the Ghost, get left with a purple face\n\n[Kung Fu sample]\nToo bad, your courage will be the death of you\n*sounds of fighting*", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}