{"songs": [{"title": "Winners Circle", "album": "Animal Ambition: An Untamed Desire To Win", "year": "2014-05-13", "lyrics": "[Hook: Guordan Banks]\nAre you ready to win?\nCome join the winners circle (Fuck with the winners baby)\nPut up your hands for me, baby (Put 'em up)\nAnd do it like we're supposed to\nCause we're gonna win\n\n[Verse 1: 50 Cent]\nConsider this the theme song for victory\nThe shit you say to yourself when you make history\nI'm trying to make it feel like the first time\nLike a junkie I'm sort of chasing my first high\nI'm focused, I'm disciplined, I'm ready\nMentally on point, sharp as a machete\nHard work, I work hard, I get the job done\nThere's only one number 1, nigga, I'm number 1\nI'm confident, you can call it vain or conceited\nCars, clothes, I need it\nCondos, condoms and bad bitches to be with\nRun with a winner, baby\nBe unconventional, freak me off with friends maybe\nYou can be my girl, be my fair weather friend\nOr you could be my, yeah yeah, be my friend 'til the end\n\n[Hook: Guordan Banks]\nAre you ready to win?\nCome join the winners circle\nPut up your hands for me, baby\nAnd do it like we're supposed to\nCause we're gonna win\n\n[Verse 2: 50 Cent]\nI got that disease ambition, success is the cure\nThey wanna win, I gotta win, I sell the shit pure\nI got dopeboy bonds, Einstein brains\nThe heart of a nigga homicidal on the chain gang\nI want yachts and drops, I got spots to watch\nI wanna see what life is like from the mountain top\nWho says sky's the limit? I'm limitless, I just took the pill\nWhy you think a nigga slow flow so ill?\nBe careful, the shit I got is highly contagious\nWe hustled 'til it had us all locked up in cages\nTime gon' fly when niggas been bidding for ages\nWar stories and wounds, back and forth, a nigga been trading\nFor the root of all evil, Lord said it's for Satan\nWe from the bottom, desperation cause moves that we making\nI guess it's all risk versus rewards\nA nigga risk it all for the broads\n(What's up?)\n\n[Hook: Guordan Banks]\nAre you ready to win?\nCome join the winners circle\nPut up your hands for me, baby\nAnd do it like we're supposed to\nCause we're gonna win\n\nCome join the winners circle\nPut up your hands for me, baby\nAnd do it like we're supposed to\nCause we're gonna win", "image": "https://images.genius.com/e38c9fce2a42f96648eb8787c9618ebe.1000x1000x1.jpg"}], "artist": "50 Cent"}