{"songs": [{"title": "Big Dogg Status", "album": "Made", "year": "2007-10-20", "lyrics": "[Scarface]\nHo! It's young 'Face, slanging yay everyday\nHeavyweight, got a bad bitch in every state\nOn the grind non-stop till I touch this cake\nMark ass niggas stay the fuck up out my way\nI'm a true OG, you can quote what I say\nI'm an H-town nigga from around the way\nSouthside, Ridin' Dirty like I'm UGK\nAsshole by nature like my name was Trae\nAnd I don't gangbang, I patrol the game\nAnd what I'm representing here is putting holes in brains\nBefore I say the same thing I'll be old and grey\n'Fore I fall off and rap about my clothes and chains\nGripping grain and popping trunks, dog but that ain't me\nThese elbows hit the scene back in eighty-three\nI stay street, when it's done, that's that\nYou could find me in your hood pumping monster crack\nI roll over rodents in Rovers with rims on 'em\nSniffing out a rat I expose him and then dome him\nA lot of nigga's bitches, they claim that they OGs\nA straight up pussy and claims that he knows me\nYou see I, putting out these DVDs\nNow my shit done hit the streets, he gots to squat the pee\nGot the Feds on his team so they watching me\nMousetrap for a rat, pussy watch and see\n\n[Hook - Scarface] + {UTP}\nI've been straight {for a long time}\nGetting cake {for a long time}\nE&J {for a long time}\nNigga {try to get like this!}\nI've been a G {for a long time}\nIn the street {for a long time}\nToting heat {for a long time}\nNigga {try to get like this!}\n{I got big dog status} *8X*\n\n[T.I.]\nHey I'm they fave\nThey say pressure busts pipes, but I ain't scared\nIt's my pleasure to tell it right, don't think I ain't said\nCause they got prices on my head homie, I don't slip\nClips long as giraffe necks, that's why I don't trip\nJust open up and let it rip, ain't nothing new to a G\nHey I ain't worried about these niggas till they shooting at me\nMy partner died, daughter too, give excuses to me\nStill a buster ass rapper I'm refusing to be\nScarface seem to say I'm the king, you a fool if you think\nThere's another young new rapper dude out there cooler than me (Haha)\nI cruise in the V, brand new with the beat\nI live a real life like I say I do in the beat\nYo, true indeed, I do indeed\nDo it for the OG's and the true MC's\nThem busters say this year I got brand new and it's all phat\nCut that fighting in the club, I'm done with all that\nNigga ass out of line, well his ass getting wet\nGive a west side nigga ten stacks, that's that\nOh, or maybe less as a matter of fact\nNigga be testing the professor, what's the matter with cats?\n\n[Hook]\n\n[Lil Wayne]\nI've been doing this shit, nigga who are you?\nLil nigga, I done seen keys bigger than you\nLil nigga, you ain't know shit\nCut off a nigga head, make him suck his own dick\nHow the game go? Money over bitches and flowers over snitches\nMoney over bitches and flowers over snitches\nMr., Mr. Scarface, pistols into y'all face\nMr., Mr. Scarface, pistols into y'all face\nYeah!\n\n[Scarface]\nI came here to exercise my game\nSpread love to the hood is how I do my thang\nSmoking weed with my homies, barbeque them wangs\nSip Hennesey and coke cause I don't fuck with drank\nDon't pop pills either cause that shit ain't cool\nWe just drunk a Mad Dog 'fore we went to school\nFlick off, back then I was smashing boys\nJump wrong, you saw a nigga get his ass destroyed\nSame rules right now, I demand respect\nAnd if I slapped one ho, then her man was next\nI'm a kick door robber, a hot-shot driver\nA crack rock slanging motherfucker for a dollar\nIf it's a dare to be made, then I'm finna make it\nBut if it ain't no way, then believe I'm finna take it\nCause a nigga with no hustle, it ain't worth this G\nAnd a bitch like this is even worse than that\nI've been good at bullshitting but this game can cost\nAnd if a nigga can't maintain, mayne he lost\nHe a nerd, and they fuck nerds in jail I heard\nAnd as a nigga, I come in here with my balls and my word\n\n[Hook]", "image": "https://images.genius.com/b7d1e1769347c22add1b6da369fe66f7.500x500x1.jpg"}], "artist": "Scarface"}