{"songs": [{"title": "Tyler, The Creator’s Instagram Tribute To Pharrell’s In My Mind", "album": null, "year": "2016-07-25", "lyrics": "I WAS 15 ATTENDING SUMMER SCHOOL AT HAWTHORNE HIGH, SPENDING MOST OF MY NIGHTS TRYING TO FIND ANY SNIPPETS OF THE ALBUM ON VARIOUS GERMAN SITES. THEN 7/25/06 CAME. IMM RANGES IN DIFFERENT STYLES AND SOUNDS AND I BELIEVE THATS WHY I GRAVITATED TO IT SO MUCH\n\nTHE UPRIGHT BASSLINE ON “CAN I HAVE IT LIKE THAT” OR THE BUCKETS ON “HOW DOES IT FEEL”. OFF THE WALL MJ ON “NUMBER 1″. I STILL TO THIS DAY DONT THINK I CAN MAKE A SONG BETTER THAN “THAT GIRL”. AND “I REALLY LIKE YOU GIRL” IS EASILY THE BEST SONG ON THIS ALBUM WITH YOUR BEST TIMBERLAKE IMPERSONATION AND STEVIE HARMONICA. IMM ALSO INCLUDES “RASPY SHIT” WHICH IS THE WORST SONG IN YOUR DISCOGRAPHY I HATE THAT SONG SO MUCH YOU ARE SO GROSS FOR THAT. BUT THE ONE THAT STOOD OUT WAS “YOU CAN DO IT TOO”. THE SADE BASSLINE, THE STRING PAD WITH CHORDS THAT YOU CLAIM ONLY Q-TIP, YOU AND I LIKE, THE JAMIE CULLUM OUTRO!\n\nBEING 15 BLACK NOT REALLY “INTERESTED” IN WHAT THE MAJORITY OF MY PEERS WERE INTO, IT MADE ME FEEL SAFE. I WAS OPTIMISTIC, ALWAYS DAYDREAMING AND SETTING GOALS SO I FELT YOU WERE DIRECTLY SPEAKING TO ME. I REMEMBER CLANCY TELLING ME HOW JIMMY IOVINE THOUGHT THIS ALBUM WAS A “COMPLETE FUCKING FAILURE IT DIDNT WORK”\n\nBUT SEE, IT DID, JUST NOT ON THE KIDS HE WAS LOOKING AT. THE ONES WHO JUST EXISTED;USED THE POPULAR SLANG;LISTENED TO WHAT WAS THROWN AT THEM;DRESSED IN CLOTHING THAT WAS TRENDING AT THE TIME. NOT SAYING THATS BAD BUT OF COURSE THIS WOULDNT WORK ON THEM. BUT IT WORKED ON ME AND I CREATED ODD FUTURE THAT SAME SUMMER. I WAS ACTUALLY NAIVE ENOUGH TO BELIEVE YOU AND THOUGHT I COULD DO ALL THESE AMAZING THINGS IF I REALLY TRIED. WHERE I GREW UP, NIGGAS GET STUCK AND NEVER MAKE IT OUT. JAIL, DEAD, SHIT JOBS, NOT REALLY GROWING\n\nIT SEEMS LIKE AT A CERTAIN AGE, IDEAS; ORIGINAL THOUGHTS ARE NO LONGER A THING; I DIDNT FALL INTO THAT CYCLE. I’M NOW A YOUNG ENTREPRENEUR ALL BECAUSE I BELIEVED YOU WHEN YOU SAID I COULD BE. YOU WERE THE FIRST PERSON I CONTACTED WHEN I PULLED OFF THAT MCLAREN DEALERSHIP! THIS IS GETTING LONG SO UHHH, HBD IMM. I NEVER HAD BROTHERS,UNCLES OR MY FATHER AROUND SO THANK YOU FOR BEING THE MALE FIGURE I GRAVITATED TO. ALLOWING ME TO EMBRACE BEING DIFFERENT AND TRUSTING MY IDEAS ❤️", "image": "https://images.genius.com/610384882ca6311db99de4fbfcdf2b46.421x421x1.jpg"}], "artist": "Tyler, The Creator"}