{"songs": [{"title": "​untitled 07 | 2014-2016", "album": "untitled unmastered.", "year": "2016-03-03", "lyrics": "[Part I: \"untitled 07 | levitate\"]\n\n[Intro: Kendrick Lamar]\nPimp-pimp! (Hooray!)\nPimp-pimp! (Hooray!)\n(Hooray!)\nPimp-pimp! (Hooray!)\n(Hooray!)\n\n[Verse 1: Kendrick Lamar]\nLove won't get you high as this\nDrugs won't get you high as this\nFame won't get you high as this\nChains won't get you high as this\nJuice won't get you high as this\nCrew won't get you high as this\nHate won't get you high as this\nLevitate, levitate, levitate, levitate, uh\nLove won't get you high as this\nDrugs won't get you high as this\nFame won't get you high as this\nChains won't get you high as this\nJuice won't get you high as this\nLevitate, levitate, levitate, levitate\n\n[Verse 2: Kendrick Lamar]\nLife won't get you high like this here, no\nHe won't get you high like this here, no\nShe won't get you high like this here, no\n\"For Free?\" won't get you high like this here, no\nTwo keys won't get you high, no, no, no\nBentleys won't get you high, like, no\nLevitate, levitate, levitate, levitate\nLife won't get you high, no, no, no\nHe won't get you high, no, no, no\nShe won't get you high, no, no, no\n\"For Free?\" won't get you high, no, no, no\nTwo keys won't get you high, no, no, no\nBentleys won't get you high, no, no, no\nBars won't get you high, no, no, no\nLevitate, levitate, levitate, levitate\n\n[Verse 3: Kendrick Lamar]\nShut your fuckin' mouth and get some cash, you bitch, you\nYou be in your feelings, I be in my bag, you bitch, you\nSanta's reindeer better have some ass, you bitch, you\nEverything I'm working, gotta be the gas, you bitch, you\n(Don't fuck around, don't fuck around, don't fuck around, don't fuck a…)\nShut your fuckin' mouth and get some cash, you bitch\nYou be in your feelings, I be in my bag, you bitch\nSanta's reindeer better have some ass, you bitch\nEverything I'm working, gotta be the\nLevitate, levitate, levitate, levitate\n\n[Verse 4: Kendrick Lamar]\nMe don't want problem (Me don't want problem)\nMe don't want trick (Me don't want trick)\nMe do want dollars (Me do want dollars)\nMe want it big (Me do want dollars)\nMe don't want problem (We ride Impalas)\nMe don't want trick (Me don't want trick)\nMe do want dollars (Me don't want trick)\nLevitate, levitate, levitate, levitate\nWe don't want problem (We don't want problem)\nWe don't want trick (We don't want trick)\nWe do want dollar (We do want dollar)\nWe do it big (We don't want problem)\nWe do it big (We don't want problem)\nWe do it big (We don't want trick)\nWe don't want problem (We don't want problem)\nLevitate, levitate, levitate, levitate\n\n[Interlude: Egypt]\nCompton is where I'm from\nIs where I'm from, where is I'm from\n\n[Part II]\n\n[Intro: Kendrick Lamar]\nYeah, yeah\nYoung Egypt\nLook, look\n\n[Verse: Kendrick Lamar]\nI feel like Pacino in Godfather, I'm charged\nOur Father who art in Heaven, Kendrick at large\nCame in the game with a plan of beatin' the odds\nWhat an accomplishment, broken promises\nKept my focus anonymous till I dealt with the consequence\nThe greatest, the latest mogul, you know what time it is\nYou niggas fear me like y'all fear God\nYou sound frantic, I hear panic in your voice\nJust know the mechanics of making your choice and writin' your bars\nBefore you poke out your chest, loosen your bra\nBefore you step out of line and dance with the star\nI could never end a career if it never start\nThe murderous capital, avenues lookin' like evil dead zombies\nWith batteries to the head\nThe flattery of watchin' my stock rise\nThe salary, the compensation tripled my cock size\nI run through these stop signs with no brake fluid\nJust premium gas, do it for dolo\nCrash markets and prejudiced tags, look at my photo\nBlack excellence, pessimist died countin' my coin\nHope it's evident that I inspired a thousand emcees to do better\nI blew cheddar on youth centers, buildings and Bimmers and blue leather\nForecastin' my future, this is the future\nThe mastermind until my next album, more power to you\n*Gunshot*\n\n[Part III]\n\n[Intro: Kendrick Lamar & Taz Arnold]\nCome on, come on, come on, come on\nCome on, come on, come on, come on, come on\nCome on, come on, come on, come on (Hell yeah), come on\nCome on, come on, come on, come on\nCome on, come on\n\n[Interlude: Kendrick Lamar & Taz Arnold]\nThis is a fifteen minute song (Ahahaha)\nWe're just jammin' out, we on stage\nTaz, we just jammin' out (Shhh)\nHundred thousand (Aw, yeah, aw, shit, hahahaha)\nHundred thousand, you gotta see it!\nLook, look, look, go back to the down note\nThey all sing this shit, everybody\n\n[Verse 1: Kendrick Lamar & Taz Arnold]\nNow I don't let you down, down for\nYou see, you see, you see, you see (Right)\nBut I don't shake you down, dog for you, you, you, you, uh\nThey say the government ain't the truth, truth, (Mhm) truth, truth\nAnd the politicians always mislead the youth, youth, youth, youth\n\n[Verse 2: Kendrick Lamar & Taz Arnold]\nBut head is the answer\nHead is the future\nDon't second guess yourself\nCome on, give me some help\nHey one more time, band, I need y'all to help me out right now (Hahahaha)\nHead is the answer (Yeah)\nHead is the futu—it's the future, that nigga said\nDon't second guess yourself (Crazy, holy shit, hahaha)\nCome on, give me some help\nSay come on, come on, come on, come on, come on\nCome on, come on—my background singer—come on, come on (Right, yeah, yeah, yeah)\nSay, come on, come on, come on, come on, come on\nCome on, come on, come on, come on\n\n[Verse 3: Kendrick Lamar & Taz Arnold]\nI said, girl you make me wanna, uh\nGreat, the—the ho's screaming now, uh (Hahahaha)\nI said baby you make\nYou make me wanna just, ah!\nBaby, (Hahahaha) you got me speechless right now\n(Hahaha, you gotta take it there)\nI gotta take it there, I ain't even playin' no more\nUh, said you just make me wanna drag you down\nTo the ground, to the ground\nLike bam, bam, bam, bam, bam\nJu—you just make me wanna drag you down\nTo—down, around like bam, bam, bam, bam, bam\nAnd, baby, if your mama's around, if your mama's around\nIf your mama's around, if your mama's around\nTell her, tell her\nNo discrimination (Haha), she young nigga chasin' (Ahahah!)\nAnd she can get this dick too!\n\n[Outro: Kendrick Lamar]\nI said come on, come on, come on, come on, come on, come on\nYeah, nigga\nYou gotta do it, man\nWe gonna lay that shit\nWe gonna lay that shit man, and watch what it's gon' do", "image": "https://images.genius.com/45790022edf45dc9796e781a40cabb42.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}