{"songs": [{"title": "Mr. Jones", "album": "Pound Syndrome", "year": "2015-07-24", "lyrics": "[Intro/Interlude]\nThis nigga Hopsin blew the fuck up son - outta nowhere.\nYo how the fuck this nigga doing that shit? This nigga corny as fuck dog.\nI've been rapping just as long as the nigga and niggas don't respect me\nWhat the fuck nigga\nDamn it's like that, it's like that\n\n[Verse 1]\nI know you mad cause they fuckin' with my music and it's not yours\nNow you wanna copy like I'm spanish on a chalkboard\nYou still ain't got a key to the locked door\nGame ain't showed you no love, nigga my lord\nYeah, 2015 Raw encore\nGive me my saw with the countdown - five, four\nThree, two, one, see when I choose bums, I bruise 'em\nThe new Duke Nukem is gruesome\nJust last summer homie you was the hot dude\nLabel being shady with you, who do you talk to?\nNigga your career is done as soon as they drop you\nAnd all those little groupies you was cool with forgot you\nThe game never came with no easy assembly\nNow you grieving in misery doing pizza delivery, damn\nWe don't recognise you like a secret identity, man\nShoulda came to FV for the remedy fam\n\n[Hook]\nSay something now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\n\n[Verse 2]\nThese underground niggas think they on a roll\nThen why you can't get the double X-L cover honor roll?\nBeen years, you ain't got no respect\nI just watch y'all fall like the domino effect, nigga\nUsed to talk like you had the plan laid out\nTill it backfired, nigga, what you got to say now?\nDoing twenty buck collabs through your Paypal\nShoulda joined FV, you coulda shut your bank down\nNiggas like \"Hop calm down\nWhy you always gotta get so emotional?\"\nI'm like \"if it ain't coming from the heart\nHow the fuck is my fanbase s'posed to grow, alright?\"\nYeah, tell these folks not to bother\nWhen I blew up, you got blown out the water\nYou just some old gym sneakers thrown in the locker\nYour shit wasn't polished, my flow is too proper\n\n[Hook]\nSay something now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\n\n[Verse 3]\nNiggas jumpin' in cause the bar is low\nFuck it, I been starvin' yo, weak ass niggas, I'ma target those\nDo not approach wit a sorry flow, I'll chop you into particles\nI'm on the pedestal that you are below\nI ain't heard a mutha'fuckin' thing that's remarkable\nDissin' me just won't work out, no cardio\nWelcome to the ill rap carnival\nBout to blow your mutha'fuckin' brains out quick with my arsenal\nUh, nigga stop with the coupe charades, not in the mood to play\nYou goin' to school today\nYou put a single out, pocket then loot in change\nNigga your jewelry is not gonna boost your fame\nYou too lame, bottom of the food chain\nThe poop stain, I'm Bruce Wayne, I'm too trained\nThere ain't no way to reduce pain, when I throw blows\nIf I ain't hot, God damn, I don't know\n\n[Hook]\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nOne more time, what you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nCome on, what you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\nWhat you gotta say now Mr. Jones\nOoh, what you gotta say now Mr. Jones\n\n[Outro]\nMr. Jones where you at man?\nWhen you gon' blow up man?\nWhen am I gon' start hearing about you, it's been years man?\nYou been rapping for over a decade and haven't made one move buddy\nShit, I know why you haven't made no fucking move\nNigga you suck", "image": "https://images.genius.com/e4079e5e3fa49647b0a22cad37ceae57.1000x1000x1.jpg"}], "artist": "Hopsin"}