{"songs": [{"title": "Fantasy", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nYo Ryan man (yo what's up cuz)\nI just sorted block girls (what's up)\nI'm tryna talk to her but, we ain't even explain what happened (straight up man)\nIt was funk, she was fine (she was fine) (she was takin' over dude, what you think)\nShe was fine some of us scream for magazine (just shit up)\n(I wanna know what's up with that)\nCheck this out man (what's up)\n\n[Verse 1: 2Pac]\nTrapped like a prisoner, fantasize of kissin' her\nTreat you like a queen but other guys is dissin' ya\nThinkin' of ya nightly thigh so hold you tightly\nVisualizin' figure, damn that excites me\nI wonder if you know how much I think of you\nIf I can throw you water, then I sink in you\nIt's for eternity, this feelings are burnin' me\nIt's like a fire, this desire yearns to be pullin' me\nCloser, until your chest is close to mine\nFeelin' you heart beat, our arms are intertwined\nWantin' to kiss you, the passion raisin'\nBut don't wanna rush you, so I'm still waitin'\nWhat if we were lovers, what a night that be\nCause we be raidin' undercover like the savage beast\nClose my eyes and visualize, it's you I feel\nThen wake up and realize, it was not real\nIt was just my heart, playin' tricks on me\nIts tryna to make my fantasy a reality\nCause just thinkin' about ya baby, makes you want ya more\nThese feelings make me crazy but I can't ignore\nWhat you mean to me, you're a dream to me\nNo matter how realistic it seems to be\nGotta get a grip on myself, because I'm dissin' myself\nI wake up, I realize that I be kissin' myself\nI just have to find this girl in my fantasy\nAnd hope that someone in this world is who meant for me\nBut if I find her, will I have the nerve to speak?\nOr will me ego overrob makin' my heart to greed?\nI gotta do it, I gotta tell her how I feel\nIt's the only chance to make my fantasy turn real\nNow my heart beats fast, I sweat feat on my thumb\nGotta get myself together cause here she come\nI said: hi, she was fly, get lost in her eyes\nTried to speak another word but my tongue was tied\nDamn, I can't explain it, the state I'm in\nEvery time I try to speak, I stutter again\nFeel like I'm ready to cry, embarrassed outof  my mind\nShe smiles and gives me her number and says call her sometime\nBut she walks away, almost as quick as she came\nAnd it hit me, I never even knew her name\nSo when I turned around, I felt my heart broke\nShe was gone, so was the number she wrote\n\n[Hook: Ryan D]\nIt was a fantasy\nNothin' but a fantasy\nI fell in love with a fantasy\n\n[Interlude: Ryan D]\nStraight man (word man I feel you)\nOh cuh (well do it your way man)\nBut check this out man I just coming from the crib man, oh man\nShe's [?] I can't believe this man (what's up what)\nLet me tell you [?] is sayin'\n(break it down to be do, what's up)\nCheck this out\n\n[Verse 2: Ryan D.]\nI woke up this Thursday mornin' in a terriful mood\nWent straight to the kitchen cause I needed some food\nStep inside, the kitchen door had tell me what I would see\nA giant stackin' dirty dishes are waitin' for me\nI didn't really wanna do it so I accepted the facts\nSpill out all my funky tequila swisher and my feline hat\nSat in my yard, then I noticed it was nice outside\nTell my [partner, \"Hmm, I think I'll go for a ride\"\nRollin' down the avenue chillin' my way\nWith the incredible sound (of who?) Marvin Gaye\nI see my homie on the corner, \"What's up, Terry T?\"\n\"Yo check this out,\" is what he said to me\nTold me that he knew a lady that I needed to meet\nSuper fine like wine and she couldn't be beat\nI said, \"Okay,\" he said: \"Come on in,\" then we went to her house\nBut when she opened the door, I couldn't open my mouth\nI mean damn there she was, right in front of my face\nAnd here I am cold fuzzin' like I'm in disgrace\nShe had a beautiful smile, eyes greener than grass\nAnd god damn, homeboy you shoulda see that well\nI don't wanna get explicit, but you know what I mean\nThe type of girl that don't recover of a magazine\nShe said her name is Limay, I didn't know what to say\nExcept my name is Ryan D. and it's beautiful day\nWe went outside and had a drink, conversated a bit\nTerry said we had to leave, but then she told me to sit\nShe said: \"Terry, you can go, but Ryan's stayin' awhile\"\nWhen she said this to my homie I just started to smile\nShe says she wanted to talk, so she can know me some more\nI said, \"Cool\"\nTerry left and then she locked door\nNow I'm a cool type of fellow, really mellow with her\nAnd when she came and step beside me I had sweat in my palms\nI mean she was so fine, I can't explain to my brothers\nFiner than the dilla Ice T's album cover\nI said, \"Well, here we are. What we can do now?\"\nShe looked me deep in my eyes and broke it all down\nShe said, \"Ryan D., as hard as this may seem, I wanna make love to you, you're the man of my dreams\"\nShe said she saw me before, and then she knew that day\nShe had to get me, had to have me somehow, some way\nI said, \"Baby, don't you worry, cause I think I'm in love. You're the angel of my life, sent from heaven above\"\nWithout a moment's hesitation, we were deep in the groove\nBodies tight and touched together as we started to move\nOnly with persistent movements, I removed her clothes\nShe was heavy as the kiss she began to moan\nFirst she start, twist me back I really don't know how\nShe put her arms around my neck and said, \"I want you now\"\nShe was already hot, I had began to sweat\nI knew that this would be a moment I would never forget\nShe told me lay on my back so she can get on the top\nShe said, \"Make it last, please, and just don't stop\"\nI had my eyes closed now that she felt so soft\nBut when I open my eyes, my alarm went off\nI got up, rubbed my eyes\n\"What's goin' on?\" I said\nIt was then I realized that I was home in my bed\nI said, \"Damn,\" to myself, as hard as it may seem\nImagination had to go but it was only a dream\n\n[Hook: 2Pac & Ryan D.]\nIt was a fantasy\nNothin' but a fantasy\nI fell in love with a fantasy\n\n[Outro/Interlude: 2Pac & Ryan D.]\nDamn, man. That's hard, man\nMan, it was bugged out\nAin't that weird, though? We both felt like that?\nMan, it was sort of a trip, man\nI can never tell a homeboy this, man. Yo, keep this between me and you, man. Nobody ever gonna believe nothin' like this. Alright man, I'm straight goin' to school man\nJust remember that shit, man\nWord\nI don't know what to tell you, man\nYo, see you later on, dude\nAlright. Know what it was, though?\nPeace man. Yo, what?\n\n[Hook: 2Pac & Ryan D.]\nIt was a fantasy\nNothin' but a fantasy\nWe fell in love with a fantasy\nWe fell in love with a fantasy\nWe fell in love with a fantasy", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}