{"songs": [{"title": "Full Nelson", "album": "Redman Presents... Reggie", "year": "2010-12-07", "lyrics": "[Intro: Saukrates]\n(Click) All I-yi-yi (ohh, ohh)\nI-yi (ohh) I-yiii (click)\n\n[Chorus: Saukrates]\nAll I-yi-yi, all I-yi-yi\n(I got that thang) Right by my side\n(And when it go BANG) How I survive\nWhoaaaa yeah - how I survive\nWhoaaaa yeah - it's right by my side\nWhoaaaa yeah (yes sir) ohhhhh yeah\n\n[Red] Let's go!\n\n[Runt Dawg]\nThe moon full, the goon's ready to set it\nHoodrats drinkin 'til 11 while they pregnant!\nMy hood look like the video for \"Thriller\"\nThe fiends feedin they kids cereal for dinner\nYou ask \"Who dat?\" And they scream GILLA!\nTour bus roll up like an 18-wheeler\nAnd who am I? Good question\nThis the blackout, make you niggas tap out, full nelson!\n\n[Chorus w/ ad libs]\n[Redman]\nYo! I take over, yo, the game over\nHop off the sofa to hit it like Sosa\nBig (Whale), tip the scale, call me Jonah\nCloset got kicks like Pete Rock folder\nHold up, girl, how do that feel?\nI'm nice with the mic like I'm from Catskills\nA veteran, take a step back, get real\nThat's like Shaquille, lookin for a rap deal!\nPop a Advil boy, this a headbanger\nBIG TRUCK gotta park in airplane hangars\nYeah they wanna hate ya, when you're gettin paper\nI know, that's why I (Set it Off) like Jada\nGenerator, I'll shut your lights off\nAnd sucker for love? Doc ain't the type y'all\nHUH, it might turn to a fight club\nAnd believe me, I'll survive like a lifer!\n\n[Chorus w/ ad libs]\n[Ready Roc]\nOkay, yo (Gotti Click nigga)\nHuh, like 2Pac (All Eyez on Me)\nThat's the reason my career on the rise slowly\nI'm headed to the top, that's what God told me\nSo anybody think they better than this guy show me\nSo I can chew him up and spit him out\nWhat else you figure from a nigga that's from Gilla House?\nI come through coupe with the ceilin out\nI'm on the road to success, steady peelin ouuuut\nAnd nobody in my lane\nJust a year ago man nobody knew my name\nNow they get the picture like I put it in the frame\nCause my flow's so dope you can put it in your veins\nPut this in your brain, I'll leave this bitch cookin\nBlind to the fact but I still see you lookin\nI do it (Big) like March 9th in Brooklyn\nBeast on the beat, call me Wolfman!\nAnd that's why\n\n[Chorus w/ ad libs]", "image": "https://images.genius.com/4d4f1e8f8a259cccb95855c51037a514.600x600x1.jpg"}], "artist": "Redman"}