{"songs": [{"title": "Hallelujah", "album": "Everybody", "year": "2017-05-05", "lyrics": "[Intro]\nSo, here we go, here we go\nAm I ready? Are you ready?\nAre they ready? Are we ready?\nI don’t know, I don’t know\nWhat do I know?\nI know you need to\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\nOpen your mind, open your mind, open your mind\n\n[Chorus]\nI’m like hallelujah!\nPraise God, almighty, the most high\nAlpha and omega in the sky\nI’m like hallelujah!\nPraise God, almighty, the most high\nAlpha and omega in the sky, I'm like\n\n[Verse 1]\nMade in the image of God\nWith a blunt in my mouth and a bitch on the side\nHold up, wait a minute my life need a massage\nHappy ending with a money menage\nMe, dirt broke, that’s a money mirage\nRunnin' my city like I’m the Wizard of Oz\nEverybody wanna know what I devise\nEverybody wanna know, yeah\nGot a new vision, everybody listen\nFuck around I got a new religion\nWhat it is, what it isn’t, all of that revision\nGet the fuck up out that prison\nIt’s obvious the body is the cracker\nThe worse it is, what hurts it is, the blacker\nEverybody actin' like the brain don’t matter\nMind over matter unless we talkin' brain matter\nActin like you never seen a ass way fatter\nBitch way badder, mind in the gutter\nFood for thought, yeah that’s the plan with the butter\nTalkin' shit, ya get hit like what up?\nI just wanna do it but I can’t\nWorld wanna tell me what I ain’t\nFar from a saint, come now just let that boy paint\nLet a mothafucka like this live\nYeah, lemme show 'em what I gotta give\nLet a mothafucka like this live, like, like\nMade in the image of God, can you feel the vibe?\nMothafucka is you ready to ride? Is you ready to die?\nLike B.I.G. the V.I.P\nThe greatest of all time, I’ll be Ali\nSee, I be\nThe cost of livin', it ain’t free\nSee, the tab on me\nFeelin’ like the man got tabs on me\nWonder if I only had rags on me\nWould ya love me, want me?\nHere with this, I know\nFunny thing is I don’t even know\nAll I get to have and all I have to give\nIs what my God will give\nYeah, lemme show 'em what I gotta give\nLet a mothafucka like this live, like, like\n\n[Chorus]\nI’m like hallelujah!\nPraise God, almighty, the most high\nAlpha and omega in the sky\nI’m like hallelujah!\nPraise God, almighty, the most high\nAlpha and omega in the sky\n\n[Bridge]\nI’m like\nHold up, wait a minute\nKnow my mind been goin' like whoa, ayy\nI been thinkin', prayin', hopin', dreamin' it won’t go away\nI know my mind alright, I know, ayy\nI know my mind alright, do you know a way?\nYour way, do it your way\nDo it your way, do it\n(Open your)\n\n[Outro]\nThis is beyond the flesh, this is beyond the flesh\nThis is from the soul and for the soul\nThis is for all my brothers and sisters, for all my children\nThis is for every race\nThis is for every color, every creed\nMusic does not discriminate, music is made to assimilate\nBlack is beautiful, black is beautiful, and so are you\nStrollin' down the highway, I’m strollin'\nAnd I was strollin' down the highway\nStrollin', strollin', strollin', strollin'\nI was strollin' down the highway\nWith my mind ablaze\nStrollin' down the highway\nFor days and days\nStrollin' down the highway\nWith my mind ablaze\nStrollin' down the highway\nFor days and days and days and days\n\n[Skit]\nHello?\nI know, I know, I’m supposed to been home, I’m coming\nJust, I’m on my way home, every time\nI’m on my way there right now, okay?\nOh shit!\nLife, what’s it all about?\nWhat? Wait, where am I?\nThe space between spaces\nBeyond time and existential intelligence\nForget, fuck all the hippy shit, where am I?\nWhat’s the last thing you remember, Atom?\nI was in the store, I bought some smokes\nI came outside, the phone rang, I...\nHow do you know my name?!\nYou were walking home from work when you died\nDied? Dead? I’m dead? I’m dead?!\nIt wasn’t an act of courage or bravery, but it was your time\nWhat do you mean it’s my time? What? I got...\nWhat about Vanessa? What about the baby?\nYour wife and son? You see, that’s what I like to hear\nYou find out you’re dead and the first thing you worry about is others\nMan, answer me, what about my family?\nWhat’s going on with Vanessa?\nThey’re doing just fine\nYou see, your wife was cheating on you\nWait, wait, the bitch did what?!\nAnd even though she loved you dearly\nShe was a bit relieved you would never find out\nWait, what the fuck you mean she cheated on me?\nHow you gon' tell me I’m dead then gon' tell me my wife cheated on me?!\nAtom, none of that matters now\nWalk with me\nWait, what is this? Is this...Is this heaven?\nNo\nWell, I don’t see no pitchforks\nLittle red people runnin' around\nIt ain’t too hot up in here so I guess this ain’t hell either\nI think the easiest way to describe it, this white void\nIs to look upon it as a waiting room\nSo...are you God?\nYes, I’m God", "image": "https://images.genius.com/1a2c364a06d2844fd9e294ee0ea798ff.1000x1000x1.jpg"}], "artist": "Logic"}