{"songs": [{"title": "The Kids", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Intro]\nAnd everyone should get along\nOkay, children, quiet down, quiet down\nChildren, I'd like to introduce our new substitute teacher for the day: his name is Mr. Shady\nChildren, quiet down please\nBrian, don't throw that! (Shut up!)\nMr. Shady will be your new substitute\nWhile Mr. Kaniff is out with pneumonia (He got AIDS!)\nGood luck, Mr. Shady!\n\n[Verse 1]\nHi there, little boys and girls! (Fuck you!)\nToday we're gonna learn how to poison squirrels\nBut first, I'd like you to meet my friend Bob (Huh?)\nSay hi, Bob (\"Hi, Bob!\")\nBob's 30 and still lives with his mom\nAnd he don't got a job 'cause Bob sits at home and smokes pot\nBut his twelve-year-old brother looks up to him an awful lot\nAnd Bob likes to hang out at the local waffle spot\nAnd wait in the parking lot for waitresses off the clock\nWhen it's late and the lot gets dark\nAnd fake like he walks his dog\nDrag 'em in the woods and go straight to the chopping blocks (Ahh!)\nAnd even if they escaped and they got the cops\nThe ladies would all be so afraid, they would drop the charge\n'Til one night Mrs. Stacey went off the job\nWhen she felt someone grab her whole face and said not to talk\nBut Stacey knew it was Bob and said, \"Knock it off!\"\nBut Bob wouldn't knock it off, 'cause he's crazy and off his rocker\nCrazier than Slim Shady is off the vodka\nYou couldn't even take him to Dre's to get Bob a doctor\nHe grabbed Stace' by the legs as he chopped it off her\nAnd dropped her off in the lake for the cops to find her\nBut ever since the day Stacey went off to wander\nThey never found her, and Bob still hangs at the waffle diner\nAnd that's the story of Bob and his marijuana\nAnd what it might do to you\nSo see if the squirrels want any—it's bad for you\n\n[Chorus]\nSee, children, drugs are bad (Come on)\nAnd if you don't believe me, ask your dad (Ask him, man)\nAnd if you don't believe him, ask your mom (That's right)\nShe'll tell you how she does 'em all the time (She will)\nSo kids, say no to drugs (That's right)\nSo you don't act like everyone else does (Uh-huh)\nThen there's really nothin' else to say (Sing along)\nDrugs are just bad, mmkay?\n\n[Verse 2]\nMy penis is the size of a peanut, have you seen it?\nFuck no, you ain't seen it, it's the size of a peanut (Huh?)\nSpeakin' of peanuts, you know what else is bad for squirrels?\nEcstasy, it's the worst drug in the world\nIf someone ever offers it to you, don't do it\nKids, two hits'll probably drain all your spinal fluid\nAnd spinal fluid is final, you won't get it back\nSo don't get attached, it'll attack every bone in your back\nMeet Zach, twenty-one years old\nAfter hangin' out with some friends at a frat party, he gets bold\nAnd decides to try five, when he's bribed by five guys\nAnd the peer pressure will win every time you try to fight it\nSuddenly, he starts to convulse\nAnd his pulse goes into hyperdrive\nAnd his eyes roll back in his skull (blblblblblb)\nHis back starts to look like the McDonald's Arches\nHe's on Donald's carpet, layin' horizontal barfin' (Bleh)\nAnd everyone in the apartment starts laughin' at him\n\"Hey Adam, Zach is a jackass, look at him!\"\n'Cause they took it too, so they think it's funny\nSo they're laughing at basically nothing\nExcept maybe wasting their money\nMeanwhile, Zach's in a coma, the action is over\nAnd his back and his shoulders\nHunched up like he's practicin' yoga\nAnd that's the story of Zach, the ecstasy maniac\nSo don't even feed that to squirrels, class, 'cause it's bad for you\n\n[Chorus]\nSee, children, drugs are bad (That's right)\nAnd if you don't believe me, ask your dad (That's right)\nAnd if you don't believe him, ask your mom (You can)\nShe'll tell you how she does 'em all the time (She will)\nSo kids say no to drugs (Smoke crack)\nSo you don't act like everyone else does (That's right)\nAnd there's really nothin' else to say (But umm…)\nDrugs are just bad, mmkay?\n\n[Verse 3]\nAnd last but not least, one of the most humongous\nProblems among young people today is fungus\nIt grows from cow manure\nThey pick it out, wipe it off, bag it up\nAnd you put it right in your mouth and chew it\nYum yum! Then you start to see some dumb stuff\nAnd everything slows down when you eat some of 'em\nAnd sometimes you see things that aren't there (Like what?)\nLike fat women in G-strings with orange hair\n(Mr. Shady, what's a G-string?) It's yarn, Claire\nWomen stick 'em up their behinds, go out and wear 'em (Huh?)\nAnd if you swallow too much of the magic mushrooms\nWhoops, did I say magic mushrooms? I meant fungus\nYour tongue gets all swoll up like a cow's tongue\n(How come?) 'Cause it comes from a cow's dump (Gross!)\nSee, drugs are bad, it's a common fact\nBut your mom and dad know that's all that I'm good at (Oh!)\nBut don't be me, 'cause if you grow up and you go and OD\nThey're gonna come for me and I'ma have to grow a goatee\nAnd get a disguise and hide, 'cause it'll be my fault\nSo don't do drugs, and do exactly as I don't, 'cause I'm bad for you\n\n[Chorus]\nSee, children, drugs are bad (Uh-huh)\nAnd if you don't believe me, ask your dad (Put that down!)\nAnd if you don't believe him, ask your mom (You can ask)\nShe'll tell you how she does 'em all the time (And she will)\nSo kids, say no to drugs (Say no)\nSo you don't act like everyone else does (Like I do)\nAnd there's really nothin' else to say (That's right)\nDrugs are just bad, mmkay?\n\n[Outro]\nCome on, children, clap along! (Shut up!)\nSing along, children! (Suck my motherfuckin' dick!)\nCome on, clap along\nDrugs are just bad, drugs are just bad (South Park is gonna sue me!)\nSo don't do drugs! (Kiss my motherfuckin' ass!)\nSo there'll be more for me (Hippie! Goddamn it!)\n(Mushrooms killed Kenny!)\n(Uh, the fart button's on) (*fart*) (Ew, ahh!)\nLa la la (So fucked up right now)", "image": "https://images.genius.com/e7f2305258d668431f8e250a41f3459f.1000x1000x1.png"}], "artist": "Eminem"}