{"songs": [{"title": "Bring Your Whole Crew", "album": "Flesh of My Flesh, Blood of My Blood", "year": "1998-12-22", "lyrics": "[Intro]\nUhh..\nAyy, c'mon!\nUhh! Uh-huh!\nBut they don't hear me though\nUhh, but they don't hear me though\nUhh, but they don't, they don't, they don't, they don't\n\n[Verse 1]\nI got blood on my hands and there's no remorse\nAnd got blood on my dick cause I fucked a corpse (C'MON!)\nI'm a nasty nigga - when you pass me nigga look me in my eyes (WHAT!)\nTell me to my fuckin face that you ready to die (C'mon)\nYou be a dead motherfucker, red motherfucker\nDon't be stupid, you heard what I said motherfucker\nWho shot you? Aww nigga, like you don't know (Woo)\nStickin you for yo' dough while I'm fuckin yo' broke ho (What)\nYo! Don't you get the picture? Niggas can't touch me (Uhh)\nCause I don't give a fuck G, I'll get you touched B\nI got joints that with one slug could take apart a door\nAnd enough crazy niggas behind me to start a war (C'mon)\nSo what you want nigga? Help, cause youse about to rest (Uh)\nWhen I'm fed, Red Cross couldn't clean up the mess\nAnd a vest will do nuttin' but make you look a little thicker (Yeah)\nCause in the dark - you ain't nuttin' but a lil' nigga (What)\nAnd if you'd been thinkin' about that shit you did\nYou wouldn't have brought the joint, wit' you kid\nNow I'ma have to get you kid, and split your wig, wit' the machete (What)\nI bring beef to niggas, and string em out, like spaghetti (C'mon)\nYou ain't ready - nor can you stand how I'm bringin' it (UH!)\nI'm givin' it is how I'm livin' it so I'm swingin' it (Uh)\nRed dot on your head, cause youse in mid range\nRed dot on your chest, opens up your rib cage, nigga\n\n[Chorus: P Killer Trakz]\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\n\n[Verse 2]\nNow if your heart was as big as your mouth, you'd be real\nBut it's not - so I know if you get knocked, you'll squeal\nLike a bitch, cause you is a bitch and always been a bitch (oh, Oh, OHH!)\nAnd you know how niggas do a bitch we run up in a bitch (Oh)\nPut something in a bitch - nigga do you know me, nigga do you owe me? (Uh-huh)\nFigured you could blow me? Well I'ma let this trigger fill you homey\nY'all niggas gots to be smokin' somethin' thinkin' you chokin' somethin' (uhhh)\nFuckin around wit' me you'll be a broken somethin' (Woo)\nI'm out for 'Blood' with the 'Crips' at war\nHow much shit could you talk wit' your lips on the floor?\nPussy niggas make me itch, so I scratch, youse a bitch (uh, UH, UHH..)\nSo I snatch up your face, fake-ass pit so I scratch you (..UHH, UHH, C'MON!)\nYeah there was a time, when I woulda jumped up and choked this nigga\n(BUT NOW!) But now I'm on some shit like, \"Yo.. smoke this nigga!\" (Uh-huh!)\nI'm 'bout to find out how much guts you got before I spill em\nSomebody come and get this muh'fucker before I kill him (Please)\n(Arf) Fresh out the asylum, I'm wilin\nY'all niggas know the phone numbers for help you best to dial em (Ayy)\nNine-one-one, emergency, the urgency\nWill have witnesses seein' what the surgeon see (WOO!)\nHow far you gon' get, wit' your dome split fool!\nI catch your man slippin' cause he think his shit cool; (C'MON)\nBut it ain't, so I paint the walls with his blood (UH, UH, UH)\nAnother dick in the mud - nigga WHAT!!\n\n[Chorus: P Killer Trakz]\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\n\n[Outro: Ruff Ryders]\n(C'MON!)\nHey yo you know who this is for\nThey let the dogs in the door (c'mon c'mon, yeah)\nHey yo you know who this is for.. (c'mon)\nThey let the dogs in the door (yeah yeah)\n\n[Chorus: P Killer Trakz]\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\n\nI just love when a nigga bring his whole crew\nIt's just a bigger piece of cake for me to chew a hole through\n\n[Outro: Ruff Ryders]\nI just love--", "image": "https://images.genius.com/236ac8cb125196c489579b947c3b2fb8.945x945x1.jpg"}], "artist": "DMX"}