{"songs": [{"title": "The Diary", "album": "The Diary", "year": "1994-10-18", "lyrics": "[Intro]\n(Say, Face .. nigga, I think I can fade you now)\nWhat, fade me how?\n(Sheeit, on this rap shit)\nCome on, nigga..\n\n[Verse]\nI brought my chopper and my hard hat\nThe shit's fucked up now show a nigga where the war at\n'Cause I'm about to clean house\nStick this A.K. up your ass and blow that fucker clean out\n'Cause you niggas in the wrong\nYou came up short and now we fin to get it going on\nI ain't your average motherfucker\nYou step out of line and watch a motherfucker bust ya\n'Cause you done came at me the wrong way\nI ain't no Clint Eastwood, nigga, and you done picked the wrong day\nSo bring your ass to the battleground\nRat-a-tat-tat, like that is how my gat'll sound\nAvoid no niggas 'cause niggas be human\nI squeeze the trigger and niggas be movin'\n'Cause I don't point it in the air and pull the trigger (Why?)\nI'd rather point it at your ass and watch the nigga die\nI gives a fuck about your team mates\nWhen it's all said and done you're gonna wish you never seen 'face\nYou shoulda seen that lil' nigga Brad\nCame through here, seen David done that nigga bad\nAnd your homies better stand still\nDon't make my brother Warren bust one of you bitches 'cause the man will\nDon't bring your ass to my picnic\n'Cause I done had it up to here with all you niggas talkin' that bitch shit\nSo you better get your shit right\nI'm from the state where you rarely see a motherfuckin' fist fight\nIt's all about the gun blast\nSo you can miss me with that bullshit you spittin' with your punk ass\nIt's the diary of a born killer\nDon't have to worry about me fallin' off this thang cause I'm a strong nigga\nDoubt my regard of the hard\nWith niggas behind me from East Oakland to the South Park\nI've got the mind of the man right behind ya\nYou can run, you can hide but I'll still find ya\nLike I say there's no getaway\nAnd I'm gon' have it where your family'll have to throw your shit away\nIt's the return of the real niggas\nI'm prejudiced to a certain extent but still I kill niggas\nI'll bust that ass on the fuckin' double\nSo push on with that ho shit, bitch, cause you don't want trouble\nSo get your ass up off my shoestrings\nAnd let your shermed nigga do things\n\n[Outro]\nAy, ay, ay where you fin to go, fool?\n(I can't fuck with it, you got it, man)\nCome on, man .. you wanna rap, nigga?\n(I can't do it) Come on\nYou see, you see! That's how motherfucker is, dogg\nThat's how motherfuckers be, punk ass hoes\nYou motherfuckers better quit fucking with me like this\nThat's really doe", "image": "https://images.genius.com/18ccee2c198d56c7f1368268755e5bd3.1000x966x1.jpg"}], "artist": "Scarface"}