{"songs": [{"title": "I Got a Seecret (Remix)", "album": null, "year": null, "lyrics": "Yeah, yeah, yeah, yeah\nThese metaphors be broad\nCheck it, damn\nLadies.. and gentlemen\nI got a secret\nSomebody told me yo' ass stink!\nDon't blame me!\n\nHah, what, huh..\nAh, one two three four\nHuh, huh, yo\nHuh, yo yo yo yo yo yo\n(C'mere baby)\nYo, yo yo, yo yo, yo\nYo huh\n\nYeah, yeah, yeah, these metaphors be broad\nTake the Shanks out of Shaw Redemption and hold it to your jaw\nClimb aboard, jump out the ninety-ninth floor\nThat bitch on the salt box, know when I rain I pour\nShoot up the Mardi Gras with double chrome forty-fours\nFull up plates, cause someone I'm ready to take yours!\nJungle music got my mind and body stimulatin\nHyperventilatin, you're talk of the town like date raping\nCall me the Doc-casian Spot, The Beatles\nMalfunction in the SL Board without the EQ\nFuck fuck fuck bitch I'll bust a nut all over that gut\nBuck buck buck souflee you lay you then I'm hittin that clutch\nIt's where the blacks rub, what, fuck your back up\nMy dubs be filled with dust when I bust you definitely feel\nThe rapture.. ha ha.. HA HAH.. HA HAH!\n\nAiyyo!  Feel what I feel, see what I see son\nBreak your neck -- secretly blown, talico style Doc\nTrace the sketch -- according to verbal recording hot\nBricks underground detox fuck up farm crops\nYo beautiful!  Cut the cabbage and sell it as pharmeceuticals\nI react - the baddest juvenile bite off his cuticles\nI'm stone, to the bone, flip poems that roam further\nI serve the murder then beef it to ham-burger\n* Redman skats, I can't follow it * but I'm only kidding\nKnowin god damn well that's hard to spit\nFans call me mix tape arsonist, marvelous, in the hood\nEveryday, wanna star?  Check an astrologist\nFuck fuck fuck bitch I'll bust a nut all over that gut\nBuck buck buck souflee you lay you then I'm hittin that clutch\nYou know, papi chulo with the fucked up grammar\nSo much spanish ass, niggas think I own Copa Cabana\nShot up Santa, got more tools than, Hanna Barbera, check it\nThe clues I left was hard for cops to Etch-a-Sketch it\nSerial killer that tracks pussy in every borough\nKidnap ya, tie ya down, drug ya, kiss the girls\nKlack automatics no matter the pressure the static (KLACK)\nI blow you by two miles, cut my lights and hit the hazards\nFatal, duckin from pussy police in LeSables\nBiggest thing since getting earrings pierced in your navel\nHigh, Funk Doc, Roni Size keep the herb twistin\nAnd now get the Ampegs real hot like jerk chicken\nHa ha.. alright one more time..\n(c'mere baby)\n\nBuck buck buck bitch I'll bust a nut all over that gut\nBuck buck buck souflee you lay you then I'm hittin that clutch (8x)\n\nIt's where the blacks rub, what, fuck your back up\nMy dubs be filled with dust when I bust you definitely feel\nThe rapture..", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}