{"songs": [{"title": "Tough Guy", "album": null, "year": null, "lyrics": "Feat. Xzibit\n\n[Busta Rhymes]\nAiyyo it's the immaculate conception Busta Bus himself\nAnd nuttin other than the godfather, spectacular X to the Zizzle\nThat's what the fuck it is, 'nuff said\n\nYEAH! YEAH! YEAH!\nI wanna see you motherfuckers put your hands up\nStretch bitch like you doin aerobics motherfucker\nYeah!\n\n[Chorus: Busta Rhymes]\nThought you was a tough guy? {*BOOM!*}\nWhen I put one right in ya head, now tell me what you think you is now\n(A top dollar biller, a Rottweiler, a killer)\n(Slap the shit out a nigga tryin to copy my style)\n\n[Busta Rhymes]\nCheck it\nI got cars (many) switches (many) hoes and (many) bitches\n(Many) huh, bodies that's buried in holes of many ditches\n(Many, many) homes, plenty chrome up on my whip\n(Plenty) stop for you make me run up on your block and cock the semi\nReady, any, nigga front I hold it steady\nI (cock) back (pop) the ratchet and spill your spaghetti\nHUH! Properties or blocks, we control 'em\n(Many, many) Glocks know how I kill all your soldiers Freddy\nMy machete (huh) will cut niggas like I ain't really like 'em\n(Ha!) Then carve a nigga meat deep like I'm killin a bison\nHUH! Tyson, animal instinct the way I will beat you\nGot (many) shots and (plenty) spots for them bullets to eat you\n(Ha!) See through (huh) them holes them bullets'll leave in between you\n(Ha!) It seems you, got left to die slow all up inside the venue\n\n[Chorus]\n[Xzibit]\nYup! Yo\nOrangutangin slangin, I'm hangin over the edge\nI rock two 40 Glocks, I call 'em Barney and Fred\nI stay hungry like I'm only fed water and bread\nThe king of the castle get at you, screamin off witcha head\nBrutal bustin, it's the X to the Z, we chart climbin\nYou see my name next to that diamond, it's all timin\nHit you in the stomach, with somethin your face and feet'll\nBe touchin to have your bones start crackin and bustin\nTo my women who be workin them jeans with fat asses\nRich Itala heels, Roberto Cavali glasses\nCome to my hideout, let me pimp your ride out\nHit your backside, tear your spine out and slide out\n(HUHHH!) Yeah, cause my grind don't quit\nI'm a walkin franchise with them extra clips\nI keep the bread roll thick, do lines so sick\nThat you can cut 'em with a razor blade, sniff the shit, c'mon\n\n[Chorus]\n[Busta Rhymes]\nYeah, check it\nI tell you (no lie) bitch nigga you (gon' die - kill or be killed!)\nOr get bodied just because you (walked by - nigga be still!)\n'Fore the trigger go off and a (shot fly) and the shit'll be ill\nIf the shot turn your stomach to a (pot pie) nigga we spill\nA little liquor for the homey muh'fucka (WE STILL)\n'll make a nigga leak blood, 'til he need a (REFILL)\nYou try to be a tough guy, and complicate what I build\nSomebody don't beat the shit out this muh'fucka (WE WILL!)\n\n[Xzibit]\nAsthmatic, dramatic, fold you like a Kraftmatic\nHeavy metal press hittin your chest like a train wreck\nCommand respect, throw it one time for your set on deck\nNiggas you never forget\nI set up precedents, homey you never snitch, hide the evidence\nDummies dig ditches, they dyin for dead presidents\nThe big screen make 'em seem large like an elephant\nBut in real life they so soft and so delicate\n\n[Chorus]", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}