{"songs": [{"title": "Two Way Street", "album": null, "year": "1999-05-25", "lyrics": "Well I shot some deer, then I copped some beer\nAnd did a show up in west bumblefuck somewhere\nDue to rap's wider ratio, satelites-to-NATO\nHillbilly's drawers flew on stage like tomatoes\nApparently more mack than I thought\nUnfortunately wifepiece back in New York\nAnd I'm starvin - being human and open\nA mad fine hillbilly woman was scopin' Rick\nThought entered how to lean and bend it\nThough I'm not gonna lie I was extremely tempted\n(\"To what Rick?\")\nTo discharging a sister, next thing in the dressing room\n(\"Pardon me mister\")\n\"Yes\" I said, cautiously\n(\"Crazy but possibly you could sign your name on the back of these daisy duke shorts for me?\")\nTried to resist, now girlfriend's starting it\n\"The pen won't write\", (\"You can press down hard on it\")\nNow my hand browsing her south end, spun around, about to shove my tongue in her mouth when (\"RING\")\nLoosen the grip my (?) had; my girl she was talking so nice I felt bad\nBeing untrue no telling what it might do to her\n\"I Love you\" - Forced to say \"I Love you\" back too to her\nAny thought of getting pussy was doomed, too\n(\"You gotta wife?\") \"Anniversary comin' up soon too\"\nGot off the phone, (?)\n\"Don't get me wrong, it's not like you're not cute\" (uh huh)\nI'm all from the street and I be wanting to skeet in you (\"I understand good-bye it was real nice meeting ya)\nWhat an angel overcoming his wrongness, all I am trying to get across in this song is...\n\nChorus: (repeat 2x)\nIf goodness is what you're filling your soul with\nAnd want to find a woman you can chill and grow old with\nKeeps no secrets, like who they creep with\nRealize early it's a two way street kid\n\nCasually seating with some thick (?) eating with my album playing at a big board meetin'\n(\"I love this!\") Being the coolest and the roughest\nA big (?) woman pulls The Ruler in her office\nI fixed the wedge in her garment unsteady; unsteady my heart went\nCause her office looked like a three bedroom apartment\nPoundin' was inevitable, she said to me \"Rick I think your album is incredible!\"\nThe (?)\n(Rick I think you're so darn sexy with that patch over your one eye)\nI'm glad you think it's boomin and I catch ya', it means a lot to me coming from a woman of your stature\nI mean who could resist the darn hat, start caressing Rick's private, kiss me on the neck\nAnd I can't be held accountable, down her gown I pull, girlfriend pussy look plump and poundable\nShe sweats (?), put one of your legs up on the desk, and let me enter ya\nFantastic girl I start to act drastic, when I see my wedding band palm the bitch left ass cheek\nDeep down she felt that I tried to diss. I'm like\n\"I can't do this as much as I'd like to, miss\"\nAn angel overcoming his wrong kids, the point I'm trying to get across with this song is...\n\n[Chorus]", "image": "https://images.genius.com/c919a00200647c646c275a32d9d66956.750x750x1.jpg"}], "artist": "Slick Rick"}