{"songs": [{"title": "LAnd of the Snakes", "album": "Born Sinner (Deluxe Version)", "year": "2013-06-18", "lyrics": "[Intro]\nYeah, uh-huh\n\n[Verse 1]\nThis the shit I used to roll down Lewis Street with\nLord, know some hoes from the past\nLike, \"Damn Cole, wish I knew that you would be rich\"\nWell, shoulda asked\nIt's funny how these niggas on some real \"be cool with me\" shit\nI bag two bitches like it's two of me, bitch\nThis the shit I used to roll down Lewis Street with\nFinally got my own bedroom in this bitch\nNo more sleeping in my brother room\nLike, \"Man, I might as well be sleeping in my mother room\"\n'Cause how I'm supposed to sneak hoes with my bro here?\nPlus she gon' find out I been rocking all his old gear\nThis his flow here, this is no fair, this is so pure\nThis is so clear, this is one breath, this is no air\nAin't no wedding but I do the most here\nI'm the President, you the co-chair\nYou the player, yeah, I'm the coach here, nigga, I coast here\nThis weather got me set up on this West Coast, yeah\nAvoiding the snakes, AKs, and coke, yeah\nGet my dick wet but I never let it soak there\nMan, I been thinkin' 'bout movin' out\nWhat? Country boy in the city\nOf New York nine years, ran that shit like Diddy\nRiding through South Side Queens like Fiddy\n\n[Chorus]\nNothing's impossible\nAnd all you lame niggas show me what not to do\nI met a real bad bitch in the club tonight\nShe told me, \"Watch the snakes 'cause they watching you\"\nI told her, \"Awww baby don't start!\nI ain't looking for the way to your heart!\"\nShe said, \"You 'bout to miss church\" while she riding me\nI like my sundaes with a cherry on top\nMake that ass drop (drop, drop)\nHey make that ass drop (drop, drop)\nHey make that ass drop (drop, drop)\nHey make that ass drop (drop, drop, drop)\n\n[Verse 2]\nNow if you only had one wish is it devious?\n'Cause you already know who your genie is\nAin't get a cover now your mag on my penis\nLike damn, he turned out to be a genius\nDamn, real shit nigga, no Pixar\nYou niggas soft like Meagan Good's lips are\nMy kicks hard, my whip hard\nI came out the womb with my dick hard\nBack when I was playing Stomp the Yard\nIt'd be a bunch of niggas up on campus talking hard\nDon't get exposed to these hoes boy, knock it off\nI seen your mama in the Benz when she dropped you off\nDamn, now who more thorough than me?\nI paint a picture of my pain for the world to see\nCould paint a picture of the game but my girl would see\nGotta ask myself, \"What mean the world to me?\"\nMe, me\n\n[Chorus]\nNothing's impossible\nAnd all you lame niggas show me what not to do\nI met a real bad bitch in the club tonight\nShe told me, \"Watch the snakes 'cause they watching you\"\nI told her, \"Aw baby don't start!\nI ain't looking for the way to your heart!\"\nShe said, \"You bout to miss church\" while she riding me\nI like my sundaes with a cherry on top\nMake that ass drop (drop, drop)\nMake that ass drop\nHey make that ass drop (drop, drop)\nMake that ass drop\nHey make that ass drop (drop, drop)\nMake that ass drop\nHey make that ass drop\nMake that ass drop\n\n[Interlude]\nMake, hey, make that ass drop (drop)\nHey, you seen me in this every damn day (drop)\nIt got the dick hard as a rock (drop)\nAnd I can't control (Let it rock)\nHehe, control\n\n[Verse 3]\nThis the shit I used to roll down Lewis Street wit'\nYeah\nThis the shit I used to roll down Lewis Street wit'\nA little Fayettenam nigga out in Beverly Hills\nThat's when I ran into this chick I went to college with\nYeah, back when a nigga was on scholarship\nWas in a rush but I still stopped to holla, shit\nThat's the least I owed her 'cause see I tried to hit\nOn the first night, and nah, I ain't proud of it\nI boned her in my dorm room and kicked her out of it\nAnd I never called back, how thoughtfulless\nNow I'm standing in the streets tryna politic with her\nIn her mind she calling me a misogynist, nigga\nOn some Bobby Brown shit, my prerogative, nigga\nIs to hit and never commit\nNot realizing when I hit she never forgets\nSo every time I ignore the telephone call\nSaying I'll hit her back knowing I'm never gon' call, she was hurting\nNow she's staring dead in my face, she was smirking\nLike, \"Yeah, I remember and nah you ain't worth shit, nigga\nYou ain't worth shit, nigga\"\n\n[Outro]\nHm, this the shit I used to roll down Lewis Street with", "image": "https://images.genius.com/fbfa7c8b3518f456c489c0bc1cf3ffd5.1000x1000x1.jpg"}], "artist": "J. Cole"}