{"songs": [{"title": "Living In Pain", "album": "Duets: The Final Chapter", "year": "2005-12-20", "lyrics": "[Intro]\n[Just Blaze]\nWelcome to the House of Pain\nJust Blaze, niggas\n\n[Mary J. Blige]\nThere's no way out, it seems I can't get free\nSomebody tell me what's happened to me\n\n[Verse 1: Notorious B.I.G.]\nThe country bud got me chokin'\nI'm on a mission to the point that motherfuckers think I'm smokin'\nYeah, that sick nigga Biggie with the 8-shot fifth\nWith the extra clip for that extra shit\nDon't you know that a killing is thrilling?\nAll the blood spilling is all a part of drug dealing\nA born gangsta, my daddy was a thug\nHad a .38 with the hollow point slug\nSo when he licked shots\nNiggas dropped quicker than a bootlegger sells his liquor\nA little nigga tried to squeeze .22's in my Reebok shoes\nPayin' dues, while kids was on their one's and two's\nNow I'm much older, colder, fuck a holster\nGot the MAC-11 swingin' from my shoulder\nIt's a damn shame I got to put my momma through the strain\nI'm livin' in a house of pain\n\n[Chorus: Mary J. Blige]\nIs anybody listenin'? Tell me can you can see\nThis darkness surrounding me\nNow it's gettin' colder heavy on my shoulder\nAnd it's gettin' hard to breathe\nVision's gettin' blurry, I'm gettin' worried\n'Cause it's gettin' hard to see\nWhen you're livin' in the House of Pain\n\n[Verse 2: 2Pac]\nThe motherfuckin' dust kicker, who can you trust?\nDo you have the heart to see a nigga, before you bust?\nMy name is spoken on the tongues of so many foes\nBustin' motherfuckers out the box, I ain't even go!\nNow how the hell do you explain my claim to fame?\nFrom doin' flicks to bustin' tricks out the fuckin' frame\nGot these bitches on my jock, niggas on my block\nJealous ass suckers got 'em duckin' from my smokin' Glock\nAnd bustin' niggas asses to stay alive\nSkinny ass player watchin' bigger motherfuckers fry\nThey ask me how I'm livin', high, I'm a hustler\nBuckin' busters 'til they die\nNow it's on in the ghetto, you ain't heard?\nNiggas got they AK's headin' for the 'burbs\nAimin' at them skinhead bitches, let it rain\nGivin' 'em a wet welcome to the House of Pain\n\n[Chorus: Mary J. Blige & (Nas)]\nIs anybody listenin'? Tell me can you can see\nThis darkness surrounding me\nNow it's gettin' colder heavy on my shoulder\nAnd it's gettin' hard to breathe (MJB)\nVision's gettin' blurry, I'm gettin' worried (Be worried, niggas)\n'Cause it's gettin' hard to see (Yeah, Nas)\nWhen you're livin' in the house of pain\n(What up, B.I., Pac?)\n\n[Verse 3: Nas]\nWendy Williams say I stayed dusted, maybe I should\n'Cause these rappers'll have your phone tapped like Savion Glove'\nAnd on the West, yo, police corrupt, some are Bloods\nBut these Teflons I loaded explodin' some mugs\nI'm like Furious in Boyz n the Hood, but at the drive-thru\nI ain't runnin', I'm dumpin', crazy like a Piru\nAnd loc'd up, know how Nas do\nI'm callin' Henchmen and Concepcion, to organize a black truce\nThen we party hard, party with Nas\nSince there ain't no more - Mardi Gras\nAnd Bush won't apologize\nI got gangsta hoes Kobe Bryant scared to sodomize\nAnd .45's for them suckers y'all idolize\nY'all yellin' my name, but y'all soon dyin'\nTryin' to portray real but they be lyin'\n'Cause they want the real niggas to die so they could gain\nBut never that, this ain't Everlast, this the House of Pain\n\n[Chorus: Mary J. Blige]\nIs anybody listenin'? Tell me can you can see\nThis darkness surrounding me\nNow it's gettin' colder heavy on my shoulder\nAnd it's gettin' hard to breathe\nVision's gettin' blurry, I'm gettin' worried\n'Cause it's gettin' hard to see\nWhen you're livin' in the house of pain", "image": "https://images.genius.com/09b1732dbce927085a1fca7538fc1bb3.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}