{"songs": [{"title": "Sexcapades", "album": "Ooh, I Love You, Rakeem ", "year": "1991-07-01", "lyrics": "(Rakeem)\nYo, this is sexcapades, the sexcapades\n\n[Hook]\nBaggin ladies, drive 'em crazy\nThat's my everyday routine\nI don't bug on this, we be lovin it\nThey be singin \"Oh we love Rakeem!\"\nAnd as I get them, I just hit them\nWith the center of my love\nAnd once they're afflicted, they're addicted (why G?)\nCause they're on you like a drug\n\n[Verse One]\nSo let me speak, on a goal I seek\nHow many freaks can I bag in the course of a week\nYo get this they strip with the quickness\nCause they can't resist the Ra style of slickness\nOnce activated, right, they become captivated\nSexually infatuated (by who?)\nBy the slick majestic kid wit the braids\nWhat is this? And this is sexcapades\nEpisode one - I'm down at a store\nSaw a young girl that I wanted to explore\nI said \"Peace, yo my name is Rakeem\"\nShe replied \"Hi, my name is Charlene\nBut all my friends, they call me Cha Cha\"\nI said \"Word, now you can call me Ra Ra\"\nShe said \"Why, are ya rowdy?\"\nI said \"Nah-hah that's not my style see\nWhen brothers wanna shoot and have gang fights\nI like to lounge and get pootang all night\"\nThat was the end of the convo\nNext thing you know, we're back at her condo\nShe had a grill like an actress, catch this\nJacuzzi and vibrating mattress\nNow the Ra was on a mission\nTo do the Humpty Hump in a vertical postion\n\n[Hook]\n\n[Verse Two]\nAiyyo, yo, yo\nLet's get on with the episode\nScene two, I'm walking down Clove road\nA day, a gloomy day\nThe plants cold scrubbin for light because the sky was gray\nBut I was lookin dope if I may say so (you may say so)\nCause my gear was in there like Prego\nAnd as I walked I saw up ahead of me\nA girl, top choice breed like a pedigree\nNow now now now, I didn't wanna past yet\nI stayed behind so I could sweat her assets\nShe had credentials, influential body potential\nSomethin I would love to slide into\nSo, without a moment to waste\nI slid over like I was slidin to home base\nYes I was successful, usin my special\nWu-Tang slang, that captured her brain\nNext step, was sex yep\nNot to disrespect, but I must protect my rep (you got to)\nAnd at the crib I told her to entice me\nShe played Michel'le and said that she was NICETY\nI said \"Yo listen baby check it; it's one or the other\nLiar, lover, fronter or fucker?\nAnd guess which choice she chose\nThe one that had her lyin in my bed with no clothes\nAnd the Ra was all on her\nCause you can save that NICETY shit for ya mama\nDMD dicks 'em down\nAnd skips town like Casanova Brown\n\n[Hook]\n\n[Outro]\nYeah and this is sexcapades, the sexcapades\nThe sex the sex the sexcapades\nThe sexcapades\nYo what time is it kid?\nYo It's time to get laid\nAnd this is sexcapades (Word)\nYo what time is it kid?\nYo It's time to get laid\nAnd this is sexcapades\nThere was a Ra, there was a -Keem\nThere's a A there's a Lah\nStrikes again never hitting below the belt\n'91 gettin things done\nWord DMD type thang and I say\nPower Equality Allah Cees Equality\nAnd that means P.E.A.C.E", "image": "https://images.genius.com/b9de29dee1a5b6dcb8d879daf5fd9484.493x478x1.jpg"}], "artist": "RZA"}