{"songs": [{"title": "Fam (Members Only)", "album": "Legend of the Liquid Sword", "year": "2002-12-10", "lyrics": "[Intro: RZA]\nYo, yeah check it... yo, yo yo yo\nYo, if you think you can [fuck] with the Wu Clan\nYou get ya nose gets swolled up like Toucan\nIf you think you can [fuck] with the Wu Clan\nYou get ya nose swollen up like Toucan\nIf you think you can [fuck] with the Wu Clan\nYou get ya nose swollen up like Toucan Sam\nAnd we don't give a damn\nBullets soaked in oil so the Tec can't jam\n\n[Verse 1: RZA]\nSipping on Caribbean rum, coconut juice\nSmoking on that chocolate stick, open up two\nBottles of that brass monkey on some drunkie [shit]\nYou R&B fake rappers suck a monkey's [dick]\nI'm from back in the days, with the Christopher Hayes\nOn my back, striped out black\nYou like that? Seven rays in my head\nMy girl stays in the bed and she love to lay the eggs\n\n[Verse 2: Masta Killa]\nPrepare for the mic onslaught swift with the sword\nSlick Lord, holding my weight home and abroad\nThe crowd roared for the peeps playing for the streets\nI reaped and sewed, scriptures weaved and vowed\nBehold gold for the people equal\nFresh on the weekend\nWu-Tang, Biggie Smalls live at the Beacon\nBackstage drinks on the house the show was banging\nBrothers Grey Goosing, Wu was Tanqueraying\nAllah teaching schools in session, the Gods speaking\nI'm just knowledging\nSnake handshakes and fake hugs\nWaiting for the hour to devour\nAnd splatter ya heads to powder\nI'm a slave to the rhythm\nBut never to a mental deafened power\nThe hour has come\nWe got y'all eleven to one son\nYou done off, too late to break north\nTactics are hazardous to the health, bomb stealth\nRifle stay M-16, know what I mean?\nKnow what I mean?\n\n[Break: Masta Killa (+RZA)]\nYo Just, what we (stand for?) Loyalty\nWhat we strive for? Righteousness\nWhat we live and (die for?)\nStrictly fam members only\nYo (strictly fam members only)\nYo, yo Just, what we (stand for?) Loyalty\nWhat we strive for? Righteousness\nWhat we live and (die for?)\n(Strictly fam members only)\n(Strictly fam members only)\n\n[Verse 3: RZA]\nA-yo, a-yo, great minds think alike\nWe used to drink all night\nThink about things that's wrong and how to make it right\nIce cold bottles of brass, time flashes\nA hundred blunts passes\nBefore the God asked us\nWhat's the square miles of the planet?\nWhy is the axis slanted?\nHow much is covered by water?\nHow much is granite?\nTrue-I-Master-Equality, God body be\nFlowing like the chi energy inside your artery\nFaithful as a Palestine rock against a tank\nThe force of my will still kill shooting blanks\nJust from the sound alone ya heads blown\nStill scoring in the red zone you best of head home\nOr get thrown to the dead zone, son we need to live\nInterrupt the Grammy show and teach the kids\n\n[Break: RZA]\nYo Just, what we stand for?\nWhat we strive for?\nWhat we live for?\nWhat we give for?\nWhat we die for?\nStrictly fam members only\nStrictly fam members only\n\n[Verse 5: GZA]\nI grew up around block parties ready to rock\nBehind the rope [nigga] with my rhyme on cock\nVerse shot, first [nigga] who had [shit] to pop\nMy bad weather blew the feathers off a hundred flocks\nSeventy-percent goose, thirty duck\nGet stuck, if each link in your chain is struck\nCan't come in the rhyme cypher with non-snipers\nCharge off the juice from the pied pipers\nGrew up around B-Boys, DJs, MCs\nThrough rap, never thinking their ways of TV\nIt was strictly all about about magnificent rhyme clout\nThe R.E.C. Room, two dollars with the flyer, three without\nNow it's wigs pushed back, name's removed\nOff the plaque, too wild to reenact\nWith tax, that's the price to pay, my goal is to\nAim and spray; my night is the same as day\n\n[Hook: RZA] (x2)\nYo Just, what we stand for?\nWhat we strive for?\nWhat we live for?\nWhat we give for?\nWhat we die for?\nStrictly fam members only\nStrictly fam members only", "image": "https://images.genius.com/6eec7781b61d16cab75a144ab36ff78d.500x500x1.jpg"}], "artist": "GZA"}