{"songs": [{"title": "6 Reasons", "album": "The Underground EP", "year": "1996-03-02", "lyrics": "[Verse 1: Proof]\nThey wish that they could bear me, black, D12 standing back\nNo planning that, Def methods, we got a hand in that\nWhoever run this shit, you get a jammed knee cap\nMake the healthy kids in your fam handicapped\nYou a fan of rap? My clan attack your school, home, your bitch house\nPull my nine milli: you gon' die with your fist out\nI'm here in this; it's over with. Venomous as cobra spit\nDrunken dialect; we're aggressive sober, bitch\nMy bionic fires demolish your larynx\nDemonic as tainted chronic. Impossible to hold down like vomit\nMics, I palm it. Your state, I'll bomb it\nLike terrorists that's Islamic. I enter your atmosphere like a comet\nThe new god of rap: call me 'Nigga Thor'\nSnap your back when I slap your ass in a figure-four\nFrom miles around they can feel it's lethal\nI make hardcore groups like Wu Tang look like the Village People\nNo sequel. The general with the sinner style\nAbort your mind-state and kill your inner child\n\n[Verse 2: Bizarre]\nIt's been a while since you bitch-niggas heard of me\nCause the last six months I been doing R&B\nBut now I'm on some sick shit; niggas better duck quick\nYou don't know who you're fucking with; I'll leave you niggas breathless\nSeeing me and Bugz rolling in the blue hummer\nYou a bitch: scared to shoot like Lindsay Hunter\nDon't need to be a father cause I'm just to illmatic\nI'll probably poison my kids like flowers in the alley\nFuck your anorexic, neglects it, fuck a Lexus\nI'm doing drive-bys on fusion BMXs\n\n[Verse 3: Bugz]\nI know a girl who said she's free, yo and her sign is a Leo\nBugzy fucked her in a Regal then she took me to my PO\nFuck rolling ceelo; I'm down to a C-note\nLost a G rolling dice in that punk-ass casino\nBut fuck it, cause when times get bad\nSee me in drag, whipping macs on unsuspecting fags\nI gotta shoot. Bitch, you got the boot\nAnd hurry up with it: I'm trying to catch this prostitute\n\n[Verse 4: Kuniva]\nI'm the nigga that spotted ya; spit something hot at ya\nRip your Nautica; saw you backstage and shot at ya\nAnd kill subliminally. You can go on\nAnd spin your group name 25 times in one song\nI'll still write about you. Hip-hop is better off without you\nBlowing niggas outta they bathrobes and funky house shoes\nFor the hell of it, I fuck Missy Elliott\nDon't give a fuck if her belly gets in my way: I'm still nailing it\nGot this verbal tech nine spitting at you for telling shit\nGet this dead body off the mic: I'm tired of smelling it\n\n[Verse 5: Kon Artis]\nFuck it: let's have a scrap-out. Fuck around with us and see what happen\nWe all got them guns blapping; got y'all niggas back tracking\nYa, we dump bodies in seashores\nBusting DJs over they backs with keyboards\nTurn up my levels. Your crew is fruitier than pebbles\nChanging you razorback emcees to running rebels\nBust up. Kon Artis: quick to smack your slut up\nKeep a pack of rubbers just in case I gotta nut up\nBrigade-style hold 'em out down; that's how it's meant to be\nYou kick the same shit: your whole tape sound like a symphony\nDon't say shit to me. It's DP conning your daughter\nTalking bitches outta they panties, dollars and last quarters\nLike that horseman, I'll leave you wack clowns headless\nRastafarians come to my show and leave dreadless\nWhoever said this slash-rapper-and-producer wouldn't make your head twist?\nGuard your grill and your necklace\n\n[Hook: DJ Jewels Baby] [x4]\nI got six reasons why we keep shit coming\nDirty Dozen left niggas running for cover\nHiding behind they lovers; skirting off, peeling rubber\nAs we shout \"don't fuck with Dirty Dozen\"\n\n[Outro: Proof & Bugz]\nYeah yeah bitch (what what)\nWe'll bring it to your crew\nWe'll bring it to your crew\nAny of y'all\nDie bitch\nDon't fuck with Dirty Dozen\nDirty Dozen\nBugz\nProof\nBizarre\nDon't fuck with Dirty Dozen\nDa Brigade bitch\nDJ Head\nDon't fuck with Dirty Dozen\nThe saga starts right now\nIf you ain't down with us from this day on\nThen fuck you", "image": "https://images.genius.com/7a40a5dcf4af48c56e2c80bf3d485197.900x900x1.jpg"}], "artist": "D12"}