{"songs": [{"title": "Somebody Got Robbd", "album": null, "year": "2015-06-30", "lyrics": "[Verse 1 - Redman]\nThe economy down, you ain't know?\nNiggas is starving\nBlacks can't set up shop\nBoy I love my hood but my finger on the trigger\nIt be warning niggas saying keep your head up doc\nI got robbed before, I could spot the tension\nI could spot the car riding slow with tensin\nHis peripherals he sees a victim\nMy peripherals I see them slipping\nNever catch me boy, plans gone wrong\nThe streets taught me how to post them bare arms\nMy shotgun pump I call Nia Long\nThey drill them like ary bonz nigga\nBut still the right stickup kid rob your whole fam\nShoot your knee cap until you get the program\nWhere the safe, where the drugs, where the gold, mane?\nI can't make you but I bet the 44 can\nStop the blood clot cryin'\nGimme what I need take it easy and I ain't mad lyin'\nMy boys outside is waiting on a signal\nAnd next rap niggas chains is on the menu\nSo when you hear these words:\n\"Give it up nigga\"\nIt's a 80% chance that nigga gorilla\nThat he got your jewelry all on the floor\n\n[Hook - Redman]\nThat nigga fucked, he just got robbed!\nNow up in brick city somebody got robbed\nAnd out in NY somebody got robbed\nAnd right about now somebody getting robbed\nThat's why I keep a heater when it's cold outside\nOut in Chi Town somebody got robbed\nAnd out in Killa Cali somebody got robbed\nAnd all around the world everybody getting robbed\nKeep the gun under 'cause the bricks get wild\n\n[Verse 2 - Redman]\nI got a younger brother that did 12 joints\nFor robbery, attempted murder, and assault\nSo believe me boy when it comes to getting robbed\nI got a team my niggas hungry for the job\nJersey niggas, don't sleep on the state\nFrom Paterson to Camden, we increase the rate\nHey young bro, why don't you explain\nHow you rolled upon a nigga make them come out they chain\n\n[Verse 3 - Mr. Yellow]\nGrab a stolen car, load up slow\nNo mask on 'cause I'm thinking high mode\nLet you see my face in the shine of the chrome\nIt's home invasion when I'm raiding y'all folks\nCock back the hammer and tell them what it is\nGimme all your fortune, everybody lives\nI rob you at Mickey drive-thru for a dollar\nI'm like Kang, nigga you tryina kick knowledge\nI want dope, coke, money, jewels\nI love this, shit I was born to be a goon\nWhen it's a full moon Mr. Yellow gone change\nLike take off my chain and put on your chain\n(What you do?)\nFuck that chain, I sell it to another nigga\n(Then what?)\nStack that bread then go stick another nigga\n(Yo!)\nThat's why Mr. Yellow's on the job\nAnd right about now somebody's getting robbed", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}