{"songs": [{"title": "Spellbound", "album": null, "year": null, "lyrics": "Solo don't spell like this money, Know what I'm sayin'?\nNeed to get at me with that dumb shit\nHit me dawg. Hey Wood, what's up dawg\nOhh, Uhh. Check it out yall\nBig Vee on the muthfucking tables\nThis how it's goin dizzee\n\n[Verse 1]\nSpell Bound, It ain't hard to tell, You go crazy, when the S-P-E-L-L\nYou won't catch it or match it, but once you how much it\nHeats up the crowd, your beats won't touch it\nAs long as I'm the D-M-X, The rhymes are D-O-P-E cold\nD-A-M-A-G-E an E-M-C-E-E, I get I-L-L and K-I-L-L, W-O-R-K U-N-T-I-L\nI hit the best and I'm the best of them all, S-P-E-L-L-I-N-G until they fall\nDropping like an F-L-Y they T-R-Y to get wit, The D-M-X but always die\nAnother body in the M-O-R-G-U-E\nYou will be trying to battle and can't emcee\nS-P-E-L-L B-O-U-N-D is the S-T-Y-L-E I like the to U-S-E\nWhen I am rhyming or R-I-P-P-I-N-G\nKeeping on timing I'm in my P-R-I-M-E\nThe D-M-X E-L-I-M-I-N-A-T-E-S C-O-M-P-E-T-I-T-I-O-N and the rest\nY-O-N-K-E-R-S the B-R-O-N-X, Mahnhattan, Brooklyn or Q-U-E-E-N-S\nIs where I'm F-R-O-M, And I will have to show them\nAnd if they are B-I-T-E-R-S I do not know them\nI can S-P-E-L-L, W-E-L-L, Raising some H-E-L-L, Ringing the B-E-L-L\nStaying at the T-O-P, I'm R-U-G-G-E-D\nAnd if you went to Do B-A-T-T-L-E then see me\nBut you will L-O-S-E A-G-A-I-N-S-T me\nThe D-M-X cause I'm the D-O-P-E-S-T\nI'll always B-E-A-T an E-M-C-E-E\nThat has enough heart to S-T-E-P T-O M-E\nS-T-Y-L-E that is W-I-L-D, It's Spellbound, Thats a N-A-M-E\nPumpin' lyrics that are based on my abillity to spell\nThen I just fuck it up it ain't hard to tell\n\nYeah. Keep that goin' man\nCause I'm 'gon show 'em somthin' real on the spellbound tip\nI'mma show 'em somthin', You know what I'm sayin'?\nI'mma show 'em some real shit, right here\nUh, check it out yall, check it, check it, check it out yall\nNow tell me if you catch what I'm sayin, baby. I'm on some shit like, umm...\n\n[Verse 2]\nI am T-H-E O-R-I-G-I-N-A-L A-U-T-H-O-R O-F S-P-E-L-L-B-O-U-N-D\nCause X M-A-R-X T-H-E S-P-O-T, Now\nD-I-D-N- Apostrophe T you T-R-Y T-O B-I-T-E A R-H-Y-M-E\nU-S-I-N-G A S-T-Y-L-E that was made by me?\nO-F C-O-U-R-S-E Y-O-U D-I-D so D-O-N-T L-I-E\nB-E-C-A-U-S-E Y-O-U-R-E C-A-U-G-H-T O-U-T T-H-E-R-E\nA-N-D S-T-R-A-I-G-H-T U-P B-U-S-T-E-D C-H-U-M-P\nN-O-W W-H-A-T\n\n\nNow what the fuck I spelled was...\n\"Didn't you try to bite the rhyme, using the style that was made by me?\nOf course you did, So don't lie, because you caught out there and straight\nBusted chump. Now what?\"\nYou know what I'm sayin\nNow that's what mutherfuckers that have to rewind on they tapedeck\nYah mean. Catch it if you can baby. Spellbound", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}