{"songs": [{"title": "Me Myself & I (Freestyle)", "album": null, "year": "2015-02-23", "lyrics": "[Intro]\nUh huh, Rob Got Beats on the beat\nWe Ready? Yeah\nMan this like one of my favorite Beyonce songs, man\nWhat up though, Bey? Yeah\nSean Don\n\n[Verse]\nMan, this one for the ones who hold me down so we forever on the rise\nLong as I got charts, it's never me, myself & I\nStraight up, champagne\nMan this one for the ones who cop the album and they ain't need a receipt\nAll the internet plumbers, you know looking for the leaks\nBeen trying to find middle ground, like yellow lines in the street\nThis show is just getting started, don't worry man take a seat\nI got mom and bro around like whats better than the family\nDid a show at House of Blues that shit was better than the Grammy's\nOn the phone with my dad trying to handle whats out of hand\nReminiscing we used to play 5-on-5, no hand to hands (ballin)\nFunny man what all those times meant to us\nGirls ask me why they call me big, that shit ambiguous\nRappers who was killin shit, lately I can't feel that shit\nYa'll used to didn't feel my shit and now ya'll like \"you hear this shit?\"\nDetroit niggas, say whats up doe, where I be\nFresh as my nigga IB, what up to Don C\nThe most improved player, watch me turn that I to a V\nOn my third LP but by the time its IV\nThat's the fourth, don't be surprised if I'm in first with high leads\nWe came a long way from having hands together like God Please\nDo I really gotta emphasize, my mind spaced out\nYeah I call that bitch the enterprise\nI hop up on the song with Em, Jay, and K, watch me hold my own\nBitch it's Sean\nVerses standing out like it close at 10 o'clock and its 10:05\nOh boy, I spit that spiritual\nYeah I'm the underdog but Underdog was a superhero too\nAnd my city going through hell, they need a miracle too\nYou're more about showing off, I'm more about show and prove\nYa'll braggin about so and so, like \"Oh, he really it?\nThe new nigga in rap? Well, can he really spit?\"\nOr do he just hide behind his skits like half of these rappers do\nAnd then ya'll fucking go and praise him and his bitch like they savior of this shit\nI'm like \"Aw, man. Here we go\"\nI'm not the same man I was a year ago\nI learned that life could be a merry-go\nMoving at a stand still is the scenario\nI also learned some girls can fit the stereotype if they got a stereo\nCrazy what a cold bitch'll do for palm trees\nType that can't hold my hand even if they palm read\nGot a good girl at home, yeah that's all me\nI gave my number out on the outro I'm like \"call me\", real nigga\nSince they cut my umbilical, I pass weed in my physical\nYeah my woman is vegan, she got my ass trying different food\nI got her listenin to music that she wouldn't listen to\nGot her vibin to Nas, she like \"Man, This what I been missin, boo?\"\nI'ma do what I didn't do, all the ridicule is just fuel\nI'ma take this little profit, I gotta flip it, no reciprocal\nNigga, fuck open arms, nigga open the safe\nRespect in this bitch like  a gun on my waist\nRappin like I got a gun in my face\nI treat my life like I be runnin a race\nSupa Dupa flow, up up and away\nYou at the top, well I'm on the way\nI'ma come for your spot then I cum in your face\nI been trying to make I gotta have it to a habit\nAddicted to the mathematics, I'ma add-it addict\nBeware of the niggas who abandon when your shit was abandoned\nBut there for the mansion\nThen hit after hit after hit\nSomebody tell me what's the fuckin batting average\nDark Sky Paradise, you niggas can have it\nClique rainin so hard, you can white water raft it\n\n[Outro]\nMan, we just fucking around, man\nJust off the top, on the spot, just fuckin around\nWe was in three different cities today, man\nShout out to my old team\nMan, we been going hard as fuck\nMy nigga Xeno, Mike Carcen, DJ Mo Beats, waddup doe\nAmir, Key Wayne, Earl Mac, Dark Sky Paradise shit man\nBoogie waddup doe\nHey the album out tomorrow, man I can't believe this shit\nI can't believe it\nHey waddup doe Detroit\nMan waddup doe to my family, my friends, my fans\nI do this for ya'll\nWe put our hearts into this shit\nMy boys damn near gone\nI don't know its like 5 in the morning\nWe ain't slept in fuckin days\nWe do this from the heart man\nAnd we did out our way\nBoss up, it's time to get it, yeah\nCountin blessings over money\nStraight up", "image": "https://images.genius.com/5617bba6580f6357817c16f6e07d12bc.500x500x1.jpg"}], "artist": "Big Sean"}