{"songs": [{"title": "Molasses", "album": "Doris", "year": "2013-08-20", "lyrics": "[Intro: RZA]\nSearch inside my purse to find something worthless\n\n[Verse 1: Earl Sweatshirt]\n99 problems all gone in that one joint\nAnd that neck gold froze like he held it at gunpoint\nI'm a bubble in the belly of the monster\nWith a duffel full of troubles, trunk rattle in the Mazda\nRagged with the contra, Phantom of the Opera\nAnd I'm standing on the cop's truck, stacking for the long run\nThe bags packed, roadside with the thumb out\nToe tagged, don't gag, [censored], spit your gum out\nNomadic, chrome-grabbing when it's danger\nI'm a manger-born puppy, holding flight like a hangar do\nKnife to the trachea, spit scabies and bet\nThe label don't like me but they pay me a grip\nAnd you see how his day going by the state of his wrists\nY'all niggas busy Play-Dohing, bet the baker came swinging like\nWhat the fuck you saying? All that aiming and miss\nAyy, I'mma fuck the freckles off your bitch, nigga\n\n[Hook: RZA]\nI'll fuck the freckles off your face, bitch\nWe could do this shit all night\nI'll fuck the freckles off your face, bitch\n\n[Verse 2: Earl Sweatshirt]\nYou know me, drugs out, front the telly\nI'm couch-drunk and ready to fuck, count fetti and bucks\nPack loud as that slap 'cross the belly\nWhat's up? Fuck nigga, what's up? I'm at the deli\nScheming on a Fanta and a Camel Crush screaming \"Saddle up!\"\nLike, \"Fuck is beef?\" Get your cattle cut, pansy\nIf them fans only local, why them flights trans-atlantied up?\nThe rice and the patties cooked nice for the chancellor\nThem teeth with the gold bright, the light switches mad at us\nSnapchatting panty-clad baddies, I'm a bachelor\nI'm high and polite cause po-lice is in back of us\nAnd write with the same hand I smack 'em up with\nStretching out the fifteen I had initially\nIcky Thump, sticky kush lit up in a rental Jeep\n\n[Hook: RZA & Earl Sweatshirt]\nWe could do this shit all night\nI'll fuck the freckles off your face, bitch\nWe could do this shit all night\nI'll fuck the freckles off your face, bitch", "image": "https://images.genius.com/4ffe0cff138a9901c8034b4cf5a92b79.630x630x1.jpg"}], "artist": "Earl Sweatshirt"}