{"songs": [{"title": "Pretty Flacko (Remix)", "album": "LONG.LIVE.A$AP (Deluxe Version)", "year": "2013-01-15", "lyrics": "[Intro: A$AP Rocky]\nUgh, yeah, ugh\nYou know I be that Lord Pretty Flacko Jodye the Second, nigga\nYou know we had to hit you with another one\nThis time I got my niggas with me\nWe finna keep it trill in this bitch, know what I'm saying?\nIf you a trill nigga, if you a trill bitch\nThrow that shit up right now!\n\n[Verse 1: A$AP Rocky]\nShotgun pop, make the military mad\nChop, won props with a military badge\nWent AWOL cause I serve 8-balls\nAnd I straight eggnog with the military axe\nPimping when I'm pinning, bitch, you couldn't tell me that (ugh)\nWay too live, where the cemetery at? (yeah)\nWay too smart to wear the penitentiary hat\nSo remember, to the end or to infinity it's (swag)\nSkinny nigga, Pretty Flacko, nigga gripping that yopper (yeah)\nParty like a rocker (ugh), now my niggas rocking with Flocka\nGuess who just walked in with a Goyard bag\nSixteen gold teeth and four gold slabs\nOne dime piece, you already know she bad\nGivenchy tee and extraordinary...\nMy wrist said I'm rich (ugh), my-my whips say I made it (yeah)\nMy tat say A$AP and yo bitch say I'm famous (yeah)\nMy whole clique dangerous (yeah)\nWe creeping and sweeping them grams up\nFor niggas and bitches and killers with triggers\nWho bucking and keeping them hands up (yeah)\n\n[Hook: A$AP Rocky]\nIf you a trill nigga, get your mothafuckin' hands up\nIf you a trill nigga, get your mothafuckin' hands up\nIf you a trill bitch, get your mothafuckin' hands up\nIf you a trill bitch, get your mothafuckin' hands up\n\n[Verse 2: Waka Flocka Flame]\nWaka Flocka, loco loco (Flocka!)\nI don't fuck with po-po, po-po (No!)\nFN on my hip, shorty (BOW! BOW!)\nI'm not ridin' solo dolo (BOW! BOW! BOW! UGH!)\nR.I.P. to Duncan Romo (Damn!)\nPay for pussy, that's a no-no (Flex!)\nThrowin' money, dive in the crowd (Flex!)\nShorty I take all that promo (Flex! Flex! Flex!)\nCall me Pretty Gordo (Swag!)\nBaller, date a model, drinking Roma (Bass!)\nMoscato keep me G'd up\nWhile I'm buying bottle after bottle (Okay!)\nThirty chicks, Frankie Lymon (Flex!)\nHe ain't balling, girl, he's just lying (No!)\nOh, broke-ass nigga, won't you keep on trying? (Hahaha!)\nKilled the parking lot, oh you heard, we shining (Woo! Woo!)\nMy watch say I made it (UNH!), my chains say I'm rich (Flex!)\nDiamonds in my mouth got me talking cash shit (Squad!)\nKush Clark Kent (Squad!)\nFour-door Benz, what I spent (Squad! Squad!)\nFuck your main girl off my down-south accent (Waka Flocka!)\n\n[Hook: A$AP Rocky & Waka Flocka Flame]\nIf you a trill nigga, get your mothafuckin' hands up (Flocka!)\nIf you a trill nigga, get your mothafuckin' hands up (Waka!)\nIf you a trill bitch, get your mothafuckin' hands up (Squad!)\nIf you a trill bitch, get your mothafuckin' hands up\n\n[Verse 3: Gucci Mane]\nMy whip said I made it, my chain say I'm rich (Rich!)\nI'm talking cash shit, 'cause Gucci Mane the shit (Gucci!)\nHit a lot of licks (Licks!), sold a lot of bricks (Skrt!)\nServed a lot of pounds, and I will never quit (Quit!)\nGucci going loco (Loco!), had that cocoa loco (Loco!)\nShorty say I fucked her, I don't really know, though (Know, though)\nThese ladies want a hug, baby want a photo (Ugh!)\nBlue and white diamonds bitch, I'm so Tony Romo (Damn!)\nThirty-four bricks, I crammed 'em in the van\nStack a lot of bands and I serve a lot of grams (Skrt!)\nThirty-six O's, stamped with the dragon\nBrick Squad, Bird Gang, yeah, we got them Falcons (Skrt!)\n\n[Hook: A$AP Rocky & Pharrell]\nIf you a trill nigga, get your mothafuckin' hands up (Skateboard)\nIf you a trill nigga, get your mothafuckin' hands up\nIf you a trill bitch, get your mothafuckin' hands up (Ya heard?)\nI rock Chanel nigga, and BAPE fish lures\nIf you a trill bitch, get your mothafuckin' hands up\n\n[Verse 4: Pharrell Williams]\nYour girl hold my dick like a Wii controller\nWhere's your bitch, nigga? We control her\nThe weed, she holding while she be over\nAnd when she saw my mothafuckin' keys, it's over\nAnd when I start it up, she like, \"Lean me over\"\nCold heart, warm dick, momma, we be polar\nI wore Louboutins before they knew what they was\nThey like, \"Louis Vuitton? Naw, uh-uh, cuz\"\nThat's when I realized they didn't know what they was\nThem niggas act like I fuckin' stepped in blood\n'07 to '11, man, I put out duds\nAnd ate space cakes that was filled with bud\nAnd now 2012, nigga, look at these Scuds\nGreen hair, money on my mind, hip-hop grunge\nYou wear a cross, I wear a Cartier nail\nYou niggas ain't fuckin' with Ph'rell\nMy wrist sizzle hot like it's stuck in the chair\nMy jewelry's so loud, it's got something to share\nLike a conspiracy, like it's ACHAP\nEverybody on my dick like Ahab\nWait, did I say that? First, pause, then play back\nRecognize nigga, A$AP\n\n[Hook: A$AP Rocky]\nIf you a trill nigga, get your mothafuckin' hands up\nIf you a trill nigga, get your mothafuckin' hands up\nIf you a trill bitch, get your mothafuckin' hands up\nIf you a trill bitch, get your mothafuckin' hands up", "image": "https://images.genius.com/8df28c565dd602a9b9311830378f27bd.600x600x1.jpg"}], "artist": "A$AP Rocky"}