{"songs": [{"title": "Put Some Keys On That", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nWeed and syrup is the combination\nAnd the inspiration is you pussy-ass niggas\nI just realized y'all can't fuck with me\nAnd you never will, bitch-ass niggas\nWeezy F. Baby, believe that\nHaha, yeah\n\n[Verse]\nI got them 24 inches, sitting on them Joe Buddens\nAnd the trunk straight jumping, bitch, I can't hear nothing\nOr I might do the Spurs, sitting on them Tim Duncans\nAnd in that Lamborghini I do donuts like Dunkin's\nHow come every bad bitch with a pussy wanna fuck him?\nBut I just feed 'em drugs and just watch 'em fuck each other\nMy neck was a hundred and my wrist was another\nIt make her pussy wet, I leave that bitch with a puddle\nI'm a beast, I'm a dog, I should rap with a muzzle\nPeyton Manning flow, I just go, no huddle\nBaby girl getting straight dick, no cuddle\nYou know I'm out this world, I just bought a space shuttle\nI'mma put some D's on that bitch\nAnd these hoes starting to get like fleas on my shit\nHave you seen her? Who? Nina, she's on my hip\nYellow-white diamonds, call it cheese on them grits\nYou niggas ain't ballin'\nReal talk, you niggas can't guard me\nTwo niggas can't guard me, you looking at Jordan\nFrom the side, like Spike at the Garden\nI got the hardest bars, call me the warden\nYeah, excuse me, pardon\nI break a bitch down like Tonya Harding\nBitch, I'm col', not dude off Martin\nPockets just fat like the Klumps and Norbit\nBitch, I'm fly like a magic carpet\nAnd bitch, I'm fresh like a pack of Orbit\nSee, I'mma take it and go bring it back to New Orleans\nAnd bitch, I'mma shine in the land of darkness\nIn which I'mma grind 'til my stacks is tall as a wall is\nAnd I'm high, don't wanna know how deep the fall is\nNo, I can't come down\nAnd every time I send my girl out of town\nI put some keys on that bitch, I'm a certified gangsta\nHaters make me nauseous, the money make me anxious\nListen how my words are poetic like Langston\nDreads down my back like I come straight from Kingston\nBut I come from Hollygrove, seventeen, danger zone\nSo many C-notes, I can sing a song\nT-top coupe, looking like a thong\nYour girl love my dick, she treats it like a bong\nI don't wanna be right if gettin' high is wrong\nMy eyes so low, I look like I'm from Hong Kong\nBoy, I got more green than the Bishop Don Juan\nOK, I'm not a rookie, I'm a pro — methazine fiend\nMake the homies say ho, and make all the girlies scream\nI am a vegetarian, man, I only eat beats\nWear a lot of carats, and I smoke the best greens\nNo beef in my grocery bag\nJust some Swishers and a whole bunch of cans of whoop-ass, ha\nI'm strapped, like a bookbag\nSo anyone of y'all can come on and get a foot tag\nD.O.A\nRide all night; sleep, no way\nSleep when I lay\nSix feet deep, and until that day\nI'mma be living like it is that day\nYeah, I keep holding on\nI said, bitch I been hot, bitch the stove been on\nIf you don't like it, I roll over and roll alone\nFuck you and the horse that you rode in on\nYeah, some cool shorts and my Kobes on\nLooking slicker than the lane that you bowling on\nIf they ain't tell you I'm the shit, then they told you wrong\nBitch, I'm bubbling like soda foam\nIn a styrofoam\nCup\nYou know what's in my styrofoam?\nWhat\nS-Y-R-up\nThat's my car, yup\nVrooommmmm (Errr!)\nI'm gone", "image": "https://images.genius.com/32e1b9a7e336b3f316f0f5de4d6c2815.300x300x1.jpg"}], "artist": "Lil Wayne"}