{"songs": [{"title": "Gossip", "album": "Tha Carter III", "year": "2007-12-25", "lyrics": "[Intro]\nI hate gossip\nAnd I don't walk around looking for it, you know?\nBut, yesterday it seemed to just\nWander around 'til it found me\nYou know like, the gossip found me\nThen why don't try provin' it?\nHow? You don't know how to prove it?\nWell, what you just do is, stop\n(Streetrunner)\n\n[Verse 1]\nStop hatin' on a nigga\nThat is a weak emotion, the lady of a nigga\nAnd you can get tipped like you're waitin' on a nigga\nPut a body bag and an apron on a nigga\nI give my all behind the mic\nBut you can never see if you sit behind the light\nAnd you don't have to pick me to win the title fight\nBut I'mma wear that championship belt so tight\nAnd if I'm wrong, there is no right\nAnd if I'm wrong, there is Snow White\nI'm tryna be polite\nBut you bitches in my hair like the fuckin' po-lice\nAnd my flow is rare, these other rappers nice\nThese other rappers bark, some of 'em even bite\nBut I'm much more bright, I give the game sight\nSo before you dim the light, you just might, might wanna\n\n[Refrain]\nThink it over\nOoooh, think it over\nThink it over, baby baby (Get 'em)\n\n[Verse 2]\nStop! Analyzing, criticizing\nYou should realize what I am and start epitomizing\nLegitimate, I got the heart of the biggest lion\nI'm confident, like fuck 'em all, pull out my dick and ride it\nMy flow sick, so sick, it's like my shit is dying\nIt rains a lot in my city because my city's crying\nBecause my city's dying\nStill I emerge from all of that, I am a living pion–eer, near Zion\nFear God, not them, steer my robin coupe\nThrough the streets of the Boot, and soo-woo!\nAnd then I leak blood in the booth, I leave a bloodbath\nSorry, there's a tub in the booth, now where the drugs at?\nI'm twisted like the strings on a shoe, no, nigga, fuck that\nI'm twisted like the strings on a boot, now where New Orleans at?\nI feel hip-hop stole me like a bus pass\nSo in your possession, I-I-I must ask\n\n[Refrain]\nHey, haven't I been good to you?\n(Think it over) Tell me, haven't I been sweet to you?\n\n[Verse 3]\nDrag my name through the mud, I come out clean\nCast away stones, I won't even blink\nA gun is not a math problem, I won't even think\nJust leave you dead like the mink under my sink\nDon't believe in me, don't believe me\nI graduated from hungry and made it to greedy\nMy flow is like pasta, take it and eat it\nBut I'm gon' need cheese if I'm baking a ziti\nYou niggas want beef, I want a steak, and, uh, we be\nLost in Amsterdam or Jamaica where weed be\nHardbody nigga just takin' it easy\nAll about my paper, 'bout my paper like E-Z\nWider wrappers, why do rappers lie to fans, lie to rappers?\nLot of rappers lie like actors, cut the motherfuckin' cameras\nCut the check, nigga, fuck your props\nAnd make it out to \"Mr. Hip-Hop\"\n\n[Outro]\nI'm not dead, I'm alive", "image": "https://images.genius.com/70a7ef69242915a9cd1c3f68031e4c0a.1000x1000x1.jpg"}], "artist": "Lil Wayne"}