{"songs": [{"title": "My Hatin’ Joint", "album": "Habits & Contradictions", "year": "2012-01-14", "lyrics": "[Produced by Mike WiLL Made-It]\n\n[Intro]\nNigga just be wanting all the hoes sometimes. Nigga want every last one of these bitches. Nigga do anything for a bitch. I had to tell the bitch, you nah mean?\n\n[Verse 1]\nLook at you, now look at me, now look at him, now back at me\nI'm saying tho, I ain't tryna be a nigga, what you playing for?\nCame up from the bottom, yeah, that Hoover Figg\nReal life fifty niggas, so I like 'em thick\nAnd by looking at your curves, you what I deserve\nWe can head up to the crib old girl, just say the word\nGot some purp, got some Henny, got my penis too\nHave you ignoring his calls when you fuck with Q\nDrop your panties to the floor, down below your feet\nSpread them pretty legs and shit let me see, you should fuck with me, huh\n\n[Bridge]\nMan that nigga, that nigga he can't protect ya\nRemember when he had left and you took him back from that heffa\nAnd then he did it again and tried to fuck on your friend\nAnd got caught up once with your kin, I'm saying tho\n\n[Interlude]\nThat nigga like... shit, thirsty for the bitches, sagging my pants and shit. Paid this much for the belt, I better crack a bitch\n\n[Verse 2]\nWord around that nigga Q in town\nI heard it's for a show, but let me call my ho\nThey be like, \"Bitch you bet' not be out with them nigga!\"\nOh, oh, soon as she hang up with 'em\nShe like \"There He Go,\" I be swag from head to toe\nSometimes I ain't gotta hate, she know that my paper grown\nPolo shirts and Polo drawers, Polo socks, they matching too\nOoh, with the finest weed, I show you what these OG's do\nSuper duper triple O, can't see me with a telescope\nI just wanna dick her down, tell me what's the verdict though\nI just swag so fucking hard, she bringing up her nigga\nI beats the pussy up, girl you my main contender\n\n[Bridge]\nSee you keep bringing up him and then he be hanging with them\nAnd then they be hanging with her when he really should be with you\nWhat I do, see he can't do, this is true\nYou should tell that nigga you through, I'm saying tho\n\n[Interlude]\nLike, nigga like, shit, I don't know, shit, I had to nigga, the bitch was bad, nigga, shit, I had to get that one\n\n[Verse 3]\nFresh up out the studio like \"Can I Live\"\nLooking for a ho so I can break her ribs\nI'm saying tho, I got a couple hundreds, what it's hitting fo'\nA rack of condoms and some fire girl lit\nNow dim the lights and let me see you do your shit\n(Face down, ass up) Fuck me good\nCause ain't no nigga out here fuck you like I could\nGrip you by your hand, waist, pillow to face\nSatisfaction at its highest point, I set the stakes\nPlus, a nigga over there with Tammy and 'em\nGiving that bitch all your time, why you deal with him? You oughta win\n\n[Bridge]\nSee that nigga there is a loser, besides my dick is a ruler\nI bring it to ya, and plus he be with them bitches\nAnd treating you like them bitches, you his main or his mistress?\nI don't get it, how you living? I'm saying tho\n\n[Interlude]\nI don't give a fuck, bruh, like I said, the bitch was bad, bruh, I hit it, bad cuh, I had to hit it, a nigga was cheating on her anyway, definitely cheating on her\n\n[Outro]\nMy hating joint, my hating joint, my hating joint, my hating joint\nToo much gangsta in my lungs for me to hit a joint\nMy hating joint, my hating joint, my hating joint, my hating joint\nToo much gangsta in my lungs for me to hit a joint\nMy hating joint, my hating joint, my hating joint, my hating joint\nToo much gangsta in my lungs for me to hit a joint\nMy hating joint, my hating joint, my hating joint, my hating joint\nToo much gangsta in my lungs for me to hit a joint", "image": "https://images.genius.com/41740fc8a4f359c7d4a16721d87de950.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}