{"songs": [{"title": "Too Fake", "album": "Finally Famous Vol. 3: BIG", "year": "2010-08-31", "lyrics": "[Verse 1: Big Sean]\nThey say I’m too fake, fuck it I’m paid\nI can’t even find an empty spot inside my safe\nI got Carties on my eyes, Louis on my case\nLobster, shrimp, and calamari right here chilling on my plate\nThey tell me I’m on time, even when I’m late\nEven if it’s a lie they say everything is great\nI’m grabbin’ the fattest asses, just to see ‘em shake\nI swear I’m too real to be, I’m too real to be livin’ so fake\n\n[Chorus]\nLook out!\nCause I’m just too fake for the world\nI know it’s just a game to me\nI’m just too fake you see\nI wish I didn’t have to be but watch out\nI got too much soul for the world\nIt’s breaking my heart in two\nI got too much soul for you\nI don’t like it but it’s true\n\n[Verse 2: Big Sean]\n\"Yeah I know Sean, I swear that nigga ain’t shit\nKnown him for forever and he ain’t on the same shit\nIt breaks my heart when all the kids be yelling 'You the mayne, Big'\nHe ain’t no hometown hero, he on that LeBron James shit\"\nMan I tell them suck my dick then choke on a nut\nCause when they see me it’s \"Oh, It's Big, What's up?\"\nMan for the team, man, fam, or regime\nMight knock down any door, open it up\nGot on and now you startin’ actin’ different huh?\nNo really I wasn’t fuckin’ with you from the beginnin’ bruh\nHere we are, here we go, my circle tighter than a Cheerio\nPeople want a handle like silver spoons\nPeople want a handout like here you go\nMan, the realest nigga I know is inside the mirror bro\nAnd these fools be trippin’ like a suitcase, a shoelace\nThey too fake, and I’m too real, yeah, boy\n\n[Chorus]\nLook out!\nCause I’m just too fake for the world\nI know it’s just a game to me\nI’m just too fake you see\nI wish I didn’t have to be but watch out\nI got too much soul for the world\nIt’s breaking my heart in two\nI got too much soul for you\nI don’t like it but it’s true\n\n[Verse 3: Chiddy]\nFake it til you make it\nWhat happens when you do?\nFriends turn to strangers, so I’m a stranger, too\nThey want this or that\nBoy gotta hustle like a flip or pack\nYear a go a nigga wasn't gettin' scratch\nWhen I hit the booth I came up with a sick attack\nOh yes, feelin’ so strong we about to take the game like Conquest\nWish we fail, but they check pre-sales, and a hater gets proven wrong, yes\nThey just bantering, calls I’m not answering\nMarried to the music so I never give a hand a ring\nBut Chiddy jigga with these girls we be on the next\nAnd they get mad cause we really don’t respond to text\nYeah, they say I, may be just on the shady side\nMaybe I, grow so much and I smoke so much got a lazy eye\nYeah I’m too gone, this the new shit to get loose on\nThe boy Chiddy and Sean on a new song\nIf you ain’t with it, tell me what the fuck you on\nI said I in heads, made it off of Big chance\nYeah and still the game can make you fake like implant\nBut I'm real", "image": "https://images.genius.com/77c8c4775e5c1d31fe5ab3d65845291d.500x500x1.jpg"}], "artist": "Big Sean"}