{"songs": [{"title": "Arab money - dirty", "album": null, "year": null, "lyrics": "Busta rhymes intro\nAyo somebody tell steven speilberg & george lucas\nThank you for directing this movie (hahahaha) (hashemeke hayla ha-its the remix!)\nChorus x2\nBismillahi r-rahmani r-rahim, Al hamdu lillaahi rabill'alamin (Oooohh)\nWe gettin' arab money (haha), We gettin' arab money\nBismillahi r-rahmani r-rahim, Al hamdu lillaahi rabiil'alamin (Oooohh)\nWe gettin' arab money (haha), We gettin' arab money\nBusta rhymes verse\nYou can talk about your money but i really dont care\nIm into coppin streets shit im trying to buy air\nIm the first black nigga that i rap trillionaire\nI control heat i'm bout to buy the ozone layer\nIm into coppin minerals now diamonds and granite\nSo much paper i could probably gift wrap a planet\nAnd clone a million janet's respect my company\nWhile I stack another billion and I give it to the block cuz\nChorus x2\nP diddy\nAyo busta we gettin this money for a long time mayne\nCheck this out\nI'm profilin with my billions pilin\nIm just wildin, bought two islands\nLakshmi betallion\nDiamonds a stylin\nBout to buy japan, trick im just stylin\nMoney insane\nMy generals poppin bottle\nI was buyin out planes just to fly around spain\nFuck a recession im still investin\nBout to buy dubai and swim in the shark section\nGet the dark section (its the remix)\nBitch thats the barack section\nChorus x2 (we gettin bad boy money)\nRon browz verse\nCatch me in da coop that cost a hundred thous\nHakala shikmina lady ron browz\nMy money make noise yours quite as a mouse\nSend a email in da boyz in da house\nAll da girls love me, ya pop bubbly\nHakalashikrhi shorty damn ugly\nFindin me in the dance floor doin the dougie\nTrucks sittin high too next to yo buggy\nChorus x2\nSwizz beats verse\nDont even call me swizz no more\nCall me kaseem gawi chencha dean my government install you\nWhen i come thru hit you with the brand new\nBuggati coupe, damn thing only only sits 2\nBut you know who who ridin in my passenger\nSide with me flyin shit 2.5 in it, hey hey hey\nIm in my jeezy watchin tv she call you houdini\nWhile she feedin me linguini\nLeft right left right and arab dance poppin right\nSwizz beats busta, money money busts pipes\nChorus x2\n\nChorus x2 (swaggg swagg)\nAkon's verse\nAkon, convict\nMusic\nI got dat arab money (money)\nCome through lookin like wayne evry time they see me\nStraight cash wanna keep on comin\nLemme exchange da currency coz its so foreign\nI got dat arab money (money) makin upto 5 kind\nYour minds on the money, diamond mine still runnin\nOn all of africa you can ask tarzan\nChorus x1 (heyyyyyyyyyyyyyy)\nSenegal! (we gettin arab money)\nSenegal! (we gettin arab money)\nYay!\nChorus x1 (heyyyyyyyyyy)\nConvict (we gettin arab money) (alright boyz)\nMusikkk (we gettin arab money)\nLil wayne's verse\nCalendar say gettin money errday\nSmile look like iced out perrier\nBury me a g and tell ma kids that i was\nNow jump into ya grave do you dig what i dug\nCash money universe, my old town check\n20 chains look like a scarf on my neck\nYoung money entertainment, drugs and fame\n(and buck a motherfucka in the money hall of fame) (Aarab money)\nYa!\nChorus x2", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}