{"songs": [{"title": "God Is Freedom", "album": "Def Poetry Jam", "year": null, "lyrics": "I feel rugged, I am rugged, damn rugged\nI walk on the carpet of the universe\nKeep on\n\nAnd speak on shit most are scared or unprepared\nBut I fled for my people\nSo keep on\n\nBeyond space I look for a place to put hurt\nI gotta work\nKeep on\n\nDreams of Black roads, of Black souls that act holistic\nIt's realistic\nKeep on\n\nPharoah of the sun looking down the barrel of a gun\nY’all know where I’m from\nKeep on\n\nNiggas at the crib saying Rash look weird\nFrom myself I never hid\nKeep on\n\nNiggas at the crib say for them I never did\n30 year old kids, shit boy\nKeep on\n\nAny means necessarian, vegetarian\nI be missin' chicken\nKeep on\n\nRequest for another Resurrection\nThe way I rhyme before progression\nThis ain’t ’94\nKeep on\n\nChat room geeks critique my B-Boy physique\nWho the fuck made you Hip Hop police?\nKeep on\n\nJournalist who never had their turn at this\nIf it's fresh, who are you to determine this, groupie?\nKeep on\n\nYou here to show truth or expose your cooch?\nYou know I know reek from the roots\nGirl, keep on\n\nDisease man made to reproduce, we afraid\nA cure, magic got AIDS\nKeep on\n\nSupporting two homes paying back school loans\nLike the NBA I’m in a new zone\nKeep on\n\nGot married and you carry the weight it take to not get your freak on\nKeep on\n\nFuck shrooms and ecstasy\nI’m consumed with a recipe\nTo get my blood to the highest destiny\nKeep on\n\nThe blackest of rappers, I ain’t doing no namin'\nGo to Europe and start O’Jayin'\nKeep on\n\nWhether chopping the raw or studying for the bar\nWe all children of Allah\nKeep on\n\nFlyer say Free Mumia on my freezer\nI’m holding still mixing Echinacea and Golden Seal\nKeep on\n\nIs it just an illusion?\nIt’s many levels to it\nIt’s rebel music\nSo keep on", "image": "https://images.genius.com/2ba45279dc14611f186ea61531cb027f.331x331x1.jpg"}], "artist": "Common"}