{"songs": [{"title": "My Own Style / Our Own Style", "album": "One Nation (Bootleg)", "year": null, "lyrics": "[Intro: 2Pac & Greg Nice]\nOld jealous ass motherfuckers\nYo 'Pac, baby what's up?\n(They'd love to see me in my motherfuckin' casket)\nWhat's up my nigga? Greg motherfuckin' Nice\n(It ain't happenin')\nThat new?, yeah\n(That's one of them new Ben Franklin's\nYou're countin' there baby 'Pac?)\nWe gotta get our cash man, to do it\n(We gotta get that money, homeboy)\nWe got the West side and the East side\nOh man, this is how we do it\nEast West, west east to south, that's how do it\nThey can feel it, We're the fuckin' realest, let's do it\n(Ahhhh)\n\n[Chorus: 2Pac]\nHow we; Our own styles\nHow we; Our own styles\nHow we; Our own styles\nOur own styles\nHow we; Our own styles\nHow we; Our own styles\nHow we; Our own styles\nOur own styles\n\n[Verse 1: 2Pac]\nDon't you love it? 2Pac free shit, that reach the public\nStill I, believe my speech so deep that all my real niggas dub it\nAss naked rhymes in these cash makin' times\nGot me losin' my mind inside the lines of these wicked rhymes\nLabel me a ghetto star, comin' up quick\nShit!, fuck what you heard, we be runnin' this shit\nIt's plain to see, my whole damn clique shine bright\nAlways knew the real niggas would end the shit when the time is right\nNow East to West is irrelevant, we're doin' it worldwide\nHa ha, similar to bitches, like girls they hide\nThey die slow, when I ride low, bumpin' this beat\nI bury, all bitch made niggas, comin' for me\nI rock them to sleep, then evade the cops\nI'll never go alive, 45 Blazin' shots\nStill gettin' mine, livin' blind, search for salvation\nStill got my guns, but I visualize One Nation\nMy work is done when my niggas get their cash in stacks\nGet your ass on the cash checks, mash in packs\nForever ballin', the alcohol callin' me\nAnd I still, bust on them all till they crawl to me\nTo all my Hip Hop junkies and my niggas in jail\nWhen this song (HUH!) play give them Hell, my thug nation\n\n[Hook: Greg Nice]\nHUH! HUH!\nPeep out how we freak our own styles\nPeep out how we freak our own styles\nPeep out how we freak our own styles\nPeep out how we freak our own styles\nPeep out how we (HUH!) freak our own styles (HUH!)\nPeep out how we freak our own styles\nPeep out how we (Yeah) freak our own styles\nPeep out how we freak our own styles\n\n[Verse 2: E.D.I. Amin]\nEnter; make yourself welcome! 'Cause E.D.I. is hostin'\nRollin' with niggas on the mash, coast to coastin'\nWe don't be boastin', no high postin' is allowed\nMakaveli hit us a lick and we set to make 20 thou'\nBut it's all gravy, baby who does this daily?\nIt ain't amazin', real niggas trail blazin'\nMan, stays in constant flow 'cause we gots to get it y'all\nAlways had a passion for cash so now it's gettin' critical\nDigital, display relays that on this day\nThe East Coast/West Coast war is now history\nFeel me? then picture me rollin' with niggas from Hoboken to Oakland\nPuttin' it down more potent than that shit you're smokin'\nOne Nation!\n\n[Verse 3: Young Noble]\nYoung Noble, I'm calm and casual\nBomb like the Arabs do, the end be tragical\nTelevised, I'm nasty new, the revolution comin'\nWhat you gonna be shootin' or runnin'?\nMy crew was trained for gunnin', soldier state your name and number\nWe're racin' Hummers, tryin' to catch the sunset\nWe lace state runners, a handful of death threats\nSo what's next? A war plan and a strategy\nBattle me to the death, there's none left to hell with casualties\nWe made niggas under trainin', trained triggers for the aimin'\nJersey claimin'; ain't a damn thing changin', One Nation!\n\n[Hook: Greg Nice]\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles\nPeep out how we freak our own styles (OoohhaaaahhhHH)\n\nSaid what? - said what?\n\n[Verse 4: Greg Nice]\nI been rockin' mics since Sergio Valenti\nDown for my people just like Kunta Kinte\nGot more Boricua mommies than Tito Puente\nMy man 2Pac picked me up in the Bentley\nYou come from the East, come to speak peace\nCome from the West, bring the Buddha bless\nCome from the East, come to speak peace\nCome from the West, bring the Buddha bless\nIt ain't no motherfuckin' hair off my chest\nTime is hard, I rock a bullet proof vest\nMet so many yes men, so many yes\nThey try to gas my head like Hess\nThe heavenly father put me to the test\nDivide and conquer what I do best\nAin't nothin' to it but alleviate stress\n\n[Hook: Greg Nice]\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\nPeep out how we freak our own styles (styles)\n\n[Outro: 2Pac & Greg Nice]\nHa ha ha ha shit, was it ever a war?\n(Oh! man yo 'Pac, this is all lovely baby)\nOnly in your minds (Yeah nigga)\nToday we sign the treaty EAST SIDE / WEST SIDE\nAll the real niggas ride, to pay these motherfuckers (WE RIDE NIGGA),  (World Wide)\nNobody tryin' to be clashin' and shit\nMotherfuckers tryin' to get their cash\nThat's why we mash in this bitch (Greg Nice, 2Pac and Tha Outlawz)\nSo I'ma just ride out on this motherfucker\nLet my Oakland peeps let you bitch made niggas know how we roll\n(Baby Jesus and them Allstars, you know how we doin' it (BIATCH!!)", "image": "https://images.genius.com/a1a90553105ad6af8fac203ba73284bf.480x360x1.jpg"}], "artist": "2Pac"}