{"songs": [{"title": "Dumb It Down", "album": "Lupe Fiasco’s The Cool", "year": "2008-06-05", "lyrics": "[Intro: Lupe Fiasco]\nCarrera (Dumb it down!)\nCoolest nigga, what? (Dumb it down!)\nF-N-F, up! (Dumb it down!)\n(Dumb it down!)\n\n[Verse 1: Lupe Fiasco]\nI'm fearless, now hear this, I'm earless\nAnd I'm peerless, that means I'm eyeless\nWhich means I'm tearless, which means my iris\nResides where my ears is, which means I'm blinded\nBut I'ma find it, I can feel its nearness\nBut I'ma veer, so I don't come near\nLike a chicken or a deer, but I remember\nI'm not a listener or a seer so my windshield smear\nHere you steer, I really shouldn't be behind this\nClearly cause my blindness\nThe windshield is menstrual, the whole grill is roadkill\nSo trill and so sincere, yeah, I'm both them there\nTook both pills when the bloke in the trench coat\nAnd the locs in the chair had approached him here\nMade it clear as a ghost or a biter of the throats in the mirror\nThe writer of the quotes for the ghosts\nWho supplier of the notes to the living\nRiveting as Rosie, pockets full of posies\nGiven to the mother of the deceased\nAwake and at war 'til I'm resting in peace\n\n[Hook 1: Gemini]\nYou going over niggas heads, Lu (Dumb it down!)\nThey telling me that they don't feel you (Dumb it down!)\nWe ain't graduate from school, nigga (Dumb it down!)\nThem big words ain't cool, nigga (Dumb it down!)\nYeah I heard \"Mean and Vicious,\" nigga (Dumb it down!)\nMake a song for the bitches, nigga! (Dumb it down!)\nWe don't care about the weather nigga (Dumb it down!)\nYou'll sell more records if you (Dumb it down!)\n\n[Verse 2: Lupe Fiasco]\nAnd I'm mouthless, which means I'm soundless\nNow as far as the hearing, I've found it\nIt was as far as the distance from the earring to the ground is\nBut the doorknockers on the ear\nOf a stewardess in a Lear, she's fine and she's flying\nI feel I'm flying by 'em, cause my mind's on cloud nine\nAnd in a mine at the same time\nPimps see the wings on the Underground King\nWho's also Klingon, to infinity and beyond\nSomething really stinks, but I Sphinx like Leon\nOr lion in the desert\nI'm flying on Pegasus, you're flying on a pheasant\nWriter of the white powder, picker of the fire flowers\nSpit, \"hot fiya\" like Dylan on Chappelle's skit\nYeah, smell it on my unicorn\nDon't snort the white horse, but toot my own horn\nSleep?\n\n[Hook 2: Graham Burris]\nYou've been shedding too much light, Lu (Dumb it down!)\nYou're makin 'em wanna do right, Lu (Dumb it down!)\nThey're gettin' self-esteem, Lu (Dumb it down!)\nThese girls are trying to be queens, Lu (Dumb it down!)\nThey're trying to graduate from school, Lu (Dumb it down!)\nThey're startin' to think that smart is cool, Lu (Dumb it down!)\nThey're trying to get up out the hood, Lu (Dumb it down!)\nI'll tell you what you should do (Dumb it down!)\n\n[Verse 3: Lupe Fiasco]\nAnd I'm brainless, which means I'm headless\nLike Ichabod Crane is\nOr foreplay-less sex is, which makes me saneless\nWith no neck left to hang the chain with\nWhich makes me necklace-less, like a necklace theft\nAnd I ain't used my headrest yet\nThey said they need proof like a vestless chest\nAbout the best-fed F-F jet in the nest\nWho exudes confidence and excess depth\nEven Scuba Steve would find it hard to breathe\nAround these leagues; my snorkel is a tuba\nLu the ruler around these seas\nWestside Poseidon, Westside beside 'em\nChest-high and rising, almost touching the knees\nOf stewardess and the pilot, lucky they make ya fly with\nPersonal floating devices, tricks falling out of my sleeves\nDavid Blaine, make it rain\nYou make a boat, I make a plane\nThen, I pull the plug and I make it drain\nUntil I feel like flowing and filling it up again\nWestside!\n\n[Hook 3: Gemini]\nYou putting me to sleep, nigga (Dumb it down!)\n'S'why you ain't popping in the streets, nigga! (Dumb it down!)\nYou ain't winning no awards nigga! (Dumb it down!)\nRobots and skateboards, nigga?! (Dumb it down!)\nGQ Man of the Year, G? (Dumb it down!)\nShit ain't rocking over here, B (Dumb it down!)\nWon't you talk about your cars nigga? (Dumb it down!)\nWhat the fuck is Goyard nigga (Dumb it down!)\nMake it rain for the chicks (Dumb it down!)\nPo' CHAMPAGNE on a bitch! (Dumb it down!)\nWhat the fuck is WRONG WITH YOU?! (Dumb it down!)\n...How can I get on a song with you? (Dumb it down!)\n\n[Outro: Gemini]\nLook B, here's my main, my two-way\nUh, what should I, ah, here take this\nThat right there, fuck what my boys'll talk about me, nigga\nNigga, you hot to me! I like you! (Dumb it down!)\n\n[Outro 2: Lupe Fiasco]\nBishop G, they told me I should come down, cousin\nBut I flatly refuse: I ain't dumb down nothing!", "image": "https://images.genius.com/f097b99dcc00024d51d3fba2d7b73cf6.600x600x1.jpg"}], "artist": "Lupe Fiasco"}