{"songs": [{"title": "Tim Westwood Freestyle", "album": null, "year": null, "lyrics": "[Verse 1]\nI'm try watch my mouth, I already know what it is\nYeah the mental state of a young black genius conflicted\nThe fast life I done seen on the screen is addictive\nMoney and clothes I done dreamed about\nAnd all the hoes that I thinked about\nEy tell me am I wrong for visualizing material things I never had?\nWaving gats instead of flags, the American Dream\nWhy do we cling to the villians?\nKnowing they killin’\nMy niggas high enough to swing from the ceiling\nInk from the pen spilling on my notebook\nFilled with dreams, this is my hope book\nStill the screams from little girls shot and killed fill my head on the daily\nAt times I question God can you blame me? They can’t tame me!\nMy voice screech through the street I'm a beast on em!\nOh no he will not fold, you will not see a crease on him!\nHe will not slip or lose his grip, they got them cleats on him!\nBut never will he run unless you call police on him\n\n[Verse 2]\nC.R.E.A.M get the money, dollar dollar billion\nCash rule everything around me, C.R.E.A.M get the money\nEverything around me, C.R.E.A.M get the money dollar dollar\nLook hey\nI'mma kill the game and invite witnesses\nNo death penalty, I'm giving life sentences\nLike keep grinding boy, your life can change in one year\nAnd even when it's dark out, the sun is shining somewhere\nYeah, look here I pay dues\nMy own worst enemy so fuck it either way I can't lose\n808's so my south niggas feel me\nLight-skinned so the house niggas feel me\nShe catch me creeping out your house she'll kill me\nIs it worth for what's under that blouse?\nMy heart'll turn pitch black and cold if I split with my girl\nIf I could gift-wrap the globe, I would give you the world\nBut, do you love me like you used to?\nEven though I ain't that nigga that you're used to\nRemember back when I was broke, you would fix me\nDo you prefer the broke me or the rich me\nThe broke me couldn't buy you meals, not even a value meal\nAnd now I pay for everything, how you feel?\nMixed feelings cause now all the chicks feeling him\nYou gotta adapt though I'm never going back\nI said I'm never going back No!\n\n[Verse 3]\nLook kid, its raining outside boy\nF--- an umbrella, man they banging outside boy\nThey guns'll dumbbell a nigga\nTired of telling niggas that's deceased, rest in peace\nWe tired of only having just a piece\nAnd f--- policing, they killing brothers what's the reason\nHis daughter starving and she fucking freezing\nSo no wonder why he fucking squeezing\nThey out here bussin’ leavin’ niggas stuck and bleedin’ on the flo’\nBullets wet you like a semen on a ho\nBreathing slow man, I'm in hell\nOne day you tryna make rent, next day you in jail\nLord knows he meant well\nSo I take the pencil and write like a pen pal\nSome shit that’s darker than the tints up on the windshield\nWelcome to Sinville where niggas on base\nShit is looking like an infield\nHigh as a Sprint bill\nWhat you think, that's the reason why this ink in my pen kills\nPhoney niggas until they are extinct, boy I’ve been real\nWestwood I said I've been real", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}