{"songs": [{"title": "Ostrage Trot", "album": "D12 Limited Edition Mixtape", "year": null, "lyrics": "[Intro: Proof]\nEy yo from the politicians to D12\nFrom the revelations of Heaven all the way to Hell\nSun is dying\n\n[Verse 1: Proof]\nI ain't trying to go as long as my grandpa\nGive the kids the answer, \"I had a fight with cancer\"\nI'm out, please pass the transfer\nDon't hold me for ransom, tell Myra her grandson couldn't take it\nWhoever knew all these years I grew and wouldn't make it\nTell me if the hood is sacred, then display hell on the block\nSnitches, switches, ambitions, now you tell 'em to cock\nMy future fell on my props, but pop jetted like North West\nOf course sex was all he expected, neglected our door step\n(Now I feel rejected) so I turn to drugs burning but learned I was stuck with reality\nNothing to hold me down, they fuckin' with gravity\nIron right like they hit on Iron Mike, tryna die tonight\nCan't think of one good reason why that fuck should try to fight\nAnd by the life of my children that sit with great women\nAnd it ain't that I'ma loser bitch, I just hate winnin'\nIt's in the bottom of the eighth inning, swingin' and ain't hittin'\nThe top up of the night, it's almost over we ain't pitchin'\nYou ain't even listen the top of the knife\nAnd bitch we ain't pitchin' pitchin'\n\n[Chorus: Proof (Bizarre)]\nNothing but drugs approach me (Approach me)\nI won't stop trying to OD (I wanna OD)\nWhere's the flames or is Heaven smoking? (Is it smoking?)\nAsking God, does He really know me? (Do you really know me?)\n\n[Verse 2: Proof]\nAnd what the fuck I wanna be here for?\nMy friends got money, but it's like they wanna see me poor\nBut like that homie, shit ain't gon' be no more\n'Cause I'ma take you to slope, so you could see me go\nIt's like scrappin' with a homeless man for his space\nIt's like a enemy from your past, but you don't know his face\nThat's it, nothing clever the chorus really listen to it\nAin't no gimmick to it, war we can get into it\nThis microphone let me spit into it [*proof spit*]\nFuck this game, real shit you didn't do it\nThis game is a drug, I'ma OD for ya\nVomit the industry lives on a four-leaf clover\nIn hot pursuit and the Glock will shoot\nYou can't knock the Proof, one thing I got is truth (What?)\nSo here's the word to the wise, Big and 'Pac didn't motherfucker\nI'm deserving to die, I'm coming\n\n[Chorus: Proof (Bizarre)]\nNothing but drugs approach me (Approach me)\nI won't stop trying to OD (I wanna OD)\nWhere's the flames or is heaven smoking? (Is it smoking?)\nAsking God, does he really know me? (Do you really know me?)\n\n[Ad-libs: Bizarre]\nDo you really know me motherfucka?\nDo you know the shit I been through?\nDo you know the drugs I take?\nThe hoes I fuck? The niggas I beat up?\nIt's D-12 motherfucka, and you don't know me\nDirty Harry a little skinny motherfucka that'll fuck you up\nChris Rock your brother, bitch\n\n[Chorus: Proof]\nNothing but drugs approach me\nI won't stop trying to OD\nWhere's the flames or is heaven smoking?\nAsking God, does he really know me?\nNothing but drugs approach me\nI won't stop trying to OD\nWhere's the flames or is heaven smoking?\nAsking God, does he really know me?\nKnow me!", "image": "https://images.genius.com/a9a6c306e6ebd80f4136c1c7407750f9.587x600x1.jpg"}], "artist": "Proof"}