{"songs": [{"title": "Get Down", "album": "Tha Carter", "year": "2004-06-29", "lyrics": "[Intro: Birdman & Lil Wayne]\nWeezy\nWhat up pop. What up pop\nFuck what they heard it's what they need to know nigga\n(They sayin C.A.R.T.E.R. yep!)\nYa feel me. Hey nigga we done built this shit from the ground up now homie\nBelieve that daddy. It ain't no lookin back from here. We too strong\n\n[Chorus]\nAnd that's the only way we get down (We get down)\nCause that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark yea)\nAnd that's the only way we get down (We get down)\nAnd that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark fuck a law Oh!)\nCause that's the only way we get down\n\n[Verse 1]\nI down down a brother we ain't cut from the same cloth you Downy soft\nBullets separate ya body compound a busta\nI'mma find ya if ya hidin' I'm a bounty hunter\nIn ya home puttin' dick all down ya woman\nYou come home we in the bedroom countin' money\nI bring her home and I fuck her on a thousand hundreds\nThen I shoot the nasty bitch in the mouth for nothin'\nI say Birdman Birdman what's good today\nWe ain't never let them niggas take our food away\nAnd we recognize real and got a rude awakenin'\nAnd woke up together and our life was better\nI'm the Cash Money son I never like fa cheddar\nNot a rat though hat low Nike is leather\nLil maw twist to get my life together\nYa bitch meet me at the bar and we night together Cut!\n\n[Chorus]\nAnd that's the only way we get down (We get down)\nCause that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark yea)\nAnd that's the only way we get down (We get down)\nAnd that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark fuck a law Oh!)\nCause that's the only way we get down\n\n[Verse 2]\nThrow my weight like Sherman Klump\nI gotta hold up my estate like Donald Trump\nAnd I aim kinda straight when it's time to pump\nI bring the pump when it's time to punk\nWrapped around my waist like a cummerbund\nDon't make a nigga pump (clap clap) you up!\nI come in that new thing she threw up\nNow yo' bitch ass gotta clean yo' shoe up\nI'm rich as fuck and I never blew up\nBusiness mug gotta get my loot up\nBet ya bitch get fucked if I ever met her\nBet ya ditch get dug you ever step up\nOne by one I push 'em down\nFat bullet fat head make a pussy sound\nHard head soft ass make a gushy ground\nI'm straight from a crooked town\nLike that bitch!\n\n[Chorus]\nAnd thats the only way we get down (We get down)\nCause thats the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark yea)\nAnd thats the only way we get down (We get down)\nAnd thats the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark fuck a law Oh!)\nCause thats the only way we get down\n\n[Verse 3]\nI give my arms and my legs to the game I'm ahead of the game\nI dead any mane if he said any thing but it's cool as long as nigga paid when he came\nAnd I'm a fool wit the flame and the 'caine\nCut it just a little bit but the drain stay the same yea\nYoung Wayne and the pain and the stain still remain\nOn the chest where the four made a mess, yes\nI'm still here in the flesh 21 year old legend I'mma live way after my death\nI sacrifice whateva that's left\nI give ya'll the last of my breath like..(exhales)\nWrite it down take a picture record a copy\nPress pause only way you stop me fucker\nI'mma get mine and make you not me\nSpit wine at ya face if you watch me bitch!\n\n[Chorus]\nAnd that's the only way we get down (We get down)\nCause that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark yea)\nAnd that's the only way we get down (We get down)\nAnd that's the only way we was taught (We was taught)\nAnd everything we got we bought (We bought)\nAnd real niggas still shine in the dark (Still shine in the dark fuck a law Oh!)\nCause that's the only way we get down\n\n[Outro]\nAnd that's the only way we gettin down nigga Cash Money CMB man\nYou already know we here neva left fuck 'em\nSee me if you got a problem boy\nI'm at home all day man. It's not a game\nStunna, what's really good wit 'em we ain't neva let 'em take our food away\nFresh you nasty on this on dawg. Ugh\nThis one, this is the Carter beotch!", "image": "https://images.genius.com/423c90e7f232e6d83a86b2645ff72b5c.500x500x1.png"}], "artist": "Lil Wayne"}