{"songs": [{"title": "Philadelphia Freestyle (Drake Diss)", "album": null, "year": null, "lyrics": "[Meek Mill]\nI been, I been looking on the motherfuckin’ internet\nAnd I been seeing a lot of niggas on Gram with fake busted ass things\nIf you from Philly\nAnd you rep for Meek Milly, make some fuckin’ noise\nYou don’t wanna see my Philly niggas hanging out the window\nLike we’re tryna spot Ricky\nAnd shout out to the niggas that showed me they not with me\nShit, I don’t think it’s bout no rapping, it’s about Nicki\nHe told us he was first in line but it got tricky\nI still wake up with the lady that you said you first in line with\nDid five months, came home, that’s perfect timing\nTo make a sucka nigga look sucka without trying\nIf Quentin Miller wrote that shit, why were we buying?\nMight as well go and get his tape, is he good or is he great?\nNiggas turn to hoes, Caitlyn Jenners turn to Drizzy Drakes\nWoah shit, we in Philly right?\nSee I represent the niggas that come from the bottom\nIf you started from nothing, make some fuckin' noise in this bitch\nI said when I first seen my homie sitting in the casket\nIs when I first went to get the ratchet\nShit is real, the fuckin' crackers itching to do me like Emmett Till\nAnd I can smell death in the air and you the kill\nWhen you was still out in the field toting them Glocks\nMan, he was still with wheelchair Jimmy rolling them blocks\nMy momma used to hold them Berettas when it was hot\nYour momma used to peek out the window and call the cops\nAnd the nerve of y’all niggas, saying y'all started from the bottom\nWhen the real niggas dying, cops killing, metal flying\nAll that bullshit you selling, real niggas never buy\nUh, I got word from the six, niggas say you testified\nWhen they ran up on you…\nFuck knows how many I got\nLet's turn up, we in fuckin' Philly, let's get it", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}