{"songs": [{"title": "I Don’t Feel So Good", "album": "Fahrenheit 1/15 Part III: A Rhyming Ape", "year": null, "lyrics": "[Intro: Gorillaz]\nPicture I'm a dreamer\nI'll take you deeper\nDown to the sleepy glow\nTime is a low\nDon't you know?\nWhat are we going to do?\nWhat are we going to do?\n\n[Verse 1: Lupe Fiasco]\nIs there something in the air? Do you feel it?\nIs it close? Is it far? Is it here? Do you feel it?\nAre you happy? You sad? You scared? Do you feel it?\nIs it right? Is it wrong? Is it fair? Do you feel it?\nIs it real? Is it fake? Do you care? Do you feel it?\nWhen he stopped and he paid for head, did he feel it?\nWith his wife when he laid in the bed, did she feel it?\nWhen the police kicked in the door, did he feel it?\nWhen he had to go to war, did he feel it?\nWhen they hung and they swung from a tree, did they feel it?\nWell I know when they come for me, will I feel it\nWhen he blew all his money to ball, did he feel it?\nWhen that bullet came through a wall, did she feel it?\nWhen he stopped and he dropped when he died, did he feel it?\nWhen his momma closed his eyes, did he feel it?\nWhen she couldn't take the pain, did she feel it?\nWhen the dope flows through her veins, does she feel it?\nWhen she took off all her clothes, did she feel it?\nWhen she slid down that pole, did she feel it?\nWill it all be clear to see, will I feel it?\nIf God forgives me, will I feel it?\n\n[Hook]\nI ask my baby if she love me, she said she don't know\nShe said the game's got her heart, the streets have got her soul\nI ask my baby if she love me, she said she don't know\nShe said the game's got her heart, the streets have got her soul\nI said, \"Wow\"\n\n[Verse 2: Lupe Fiasco]\nWhen his food come out the trash, does he feel it?\nWhen he sleeps under the underpass, does he feel it?\nWhen she's pregnant and smoking weed, does she feel it?\nWhen the jury just won't believe, do they feel it?\nWhen this song come on in the club, do you feel it?\nWhen a racist shows you love, do you feel it?\nWhen he know he won't win the game, do he feel it?\nWhen a preacher is driven insane, do he feel it?\nEvery time I write a rhyme, do I feel it?\nWhen I'm running out of time, will I feel it?\nWhen the liquor is poured on the ground, do they feel it?\nIf my music didn't make a sound, would you feel it?\n\n[Hook]", "image": "https://images.genius.com/d7cb576cfd73d770ccf1bee4e00c5e09.286x282x1.jpg"}], "artist": "Lupe Fiasco"}