{"songs": [{"title": "Miss Me", "album": "Thank Me Later", "year": "2010-06-01", "lyrics": "[Verse 1: Drake & Bun B]\nI said \"Tell me what's really goin' on\"\nDrizzy back up in this thing, I'm ready, what's hannenin'?\nGone for surgery but now I'm back again\nI'm 'bout my paper like a motherfuckin' scratch-and-win\nWorld Series attitude, champagne bottle life\nNothin' ever changes so tonight is like tomorrow night\nI will have a model wife, yo' bitch is as hot as ice\nEvery time you see me, I look like I hit the lotto twice\nDrake, you got 'em, right? Yeah, I got 'em, Bun\nI love myself 'cause I swear their life is just not as fun\nNeeks got the weed, Hush got a gun\nCJ got my credit cards and a lot of ones\nYeah, I'm in the city of the purple Sprite\nSomeone tell Maliah I'm on fire, she should work tonight\nCall up King of Diamonds and tell Chyna it'd be worth the flight\nI'll be at my table, stackin' dollars to the perfect height\nWork somethin', twerk somethin', basis\nShe just tryna make it so she right here gettin' naked\nI don't judge her, I don't judge her but I could never love her\n'Cause to her I'm just a rapper and soon she'll have met another\nThat's why me and Lil Jaz 'bout to spaz, can you keep up?\nI'm just feelin' sorry for whoever gotta sweep up\nYeah, bills everywhere, trill everything\nAnd Drake just stand for Do Right And Kill Everything\nI love Nicki Minaj, I told her I'd admit it\nI hope one day we get married just to say we fuckin' did it\nAnd girl, I'm fuckin' serious, I'm wit' it if you wit' it\n'Cause yo' verses turn me on and yo' pants are mighty fitted\nUgh, damn! I think you caught me in a moment\nLike I catch 'em stealin' flows 'cause I swear I never loaned it\nAnd life ain't a rehearsal, the camera's always rollin'\nSo come and get a portion of this money that we blowin'\n'Cause it's on\n\n[Chorus: Drake]\nYeah, girl it's on\nYou know what it is when I finally make it home\nI just hope that you miss me a little when I'm gone\nYeah I just hope that you miss me a little when I'm gone\nAnd you just tell me what you down for, anything you down for\nI know things have changed, know I used to be around more\nBut you should miss a little when I'm gone\nI just hope that you miss me a little when I'm gone, gone, gone\n\n[Verse 2: Lil Wayne]\nOoh, shit, motherfucker, God damn\nKickin' bitches out the condo like Pam\nGettin' money every day, I'm a groundhog\n'Bout to scoop ya girl up like a ground ball\nI walk light so I don't piss the ground off\nMan, I swear, my bitches do it 'til they suck the brown off\nEw, that's nasty\nYes, I am Weezy but I ain't asthmatic\nJames Bond cologne, honey I put on\nMake 'em run and tell they friends like a marathon\nVoice baritone, haters carry on\nBeat the pussy up, call me Larry Holmes\nYoung Money's Jerry Sloan, I turn every stone\nWhen she masturbate to me, that's how she learn every song\nTo the women I condone, better write me when I'm gone\nNo, I'm not that thuggish, not that ruggish but I do pack Bone\nUh, I'm a love machine\nAnd I won't work for nobody but you\nIt's only me and her 'cause the Bugatti a coupe\nIt's Blood gang, slime, but I parlay with Snoop\nI ain't lyin', I shoot, you don't need signs for proof\nTurn you to a vegetable like you lyin' in soup\nAnd when I'm in the booth, bitch, the lion is loose\nMan, I got so many styles, I am a group\nHa ha, damn! I'll be gone 'til November\nBut fuck it, I ain't trippin', I know Drizzy gon' kill 'em\nI'm stickin' to the script like lint on denim\nMomma said \"If the rules ain't bent, don't bend 'em\"\nReal nigga talkin' – shut the fuck up, ho!\nGotta do it one time for Haiti – what up, Zo?\nWeezy F. Baby and the F is for Front Do'\n'Cause that's where I brang it\nSuwoo if you bangin', motherfucker!\n\n[Chorus: Drake]\nYeah, girl it's on\nYou know what it is when I finally make it home\nI just hope that you miss me a little when I'm gone\nYeah I just hope that you miss me a little when I'm gone\nAnd you just tell me what you down for, anything you down for\nI know things have changed, know I used to be around more\nBut you should miss a little when I'm gone\nI just hope that you miss me a little when I'm gone, gone, gone\n\n[Outro: Drake]\nUh, yeah, forever in our hearts\nJJ, we love you boy—H-Town!\nI’m gone, I’m gone, when I’m gone\nI’m gone, I’m gone, when I’m gone\nI just hope that you miss me, miss me\nMiss me, miss me\nMiss me a little when I’m gone\nMiss me a little when I’m gone, gone, gone\nOh-whoa, oh-whoa, oh-whoa", "image": "https://images.genius.com/70262c540b904af145831738f851a206.1000x1000x1.jpg"}], "artist": "Drake"}