{"songs": [{"title": "Gold vs. The Right Things to Do", "album": "DROGAS WAVE", "year": "2018-09-21", "lyrics": "[Intro]\nLet me tell you 'bout the 'ting\nCome sit 'round the fire\nMe tell you where we come from\nMe tell you the story\n\n[Verse 1]\nSome men wanna live like a banker\nFill up the ship then pull up the anchor\nPay the man dem to come run and take ya\nRassclaat chain in a brainwash nature\nJoggin' in y'all clothes to the tailor\nDrop leg to di riddim of the maker\nMash up di boat ah di fassyhole sailor\nNo rain a fall pon a Babylon acre\nZinc fence but me mind is a mansion\nDem a sufferer, we still have a bashment\nHim inna cross but im still be a-dancin'\nEvery ting cook a curry like a champion\nIn a jam, but the man, him a jammin'\nOriginal, you should come follow fashion\nMe already dun seen what the future hold\nNuff gold for the dark hearts and the chasms\nSo big up your chest\nLike a skin teet in a bad man wagon\nNo fear, me a duppy assassin\nMake a wish me a dutchie Aladdin\nWah dem i-sire for dem earthstrong?\nGive thanks to the first Gong\nDi man word like a bird song\nIya self me a work pon (Fyah!)\nMe gon tell ya bout the nation\nGravelicious men in them wicked navigations\nSmall up the slaves and stuff them in arrangement\nWe the children of the first generation\n\n[Pre-Chorus]\nFire burn (atat tat tat tat)\nBabylon (atat tat tat tat)\nReal mumma (atat tat tat tat)\nSoon forward (atat tat tat tat)\nFire burn (atat tat tat tat)\nBabylon (atat tat tat tat)\nDownpressed (atat tat tat tat)\nJah bless (atat tat tat tat)\n\n[Chorus]\nAll I got is gold, golden memories\nWhen I think about what you meant to me\nAll I got is gold, golden memories\nWhen I think about what you did to me\nWhen I think about, when I think about (reparation)\nWhen I think about, when I think about\nWhen I think about, when I think about\nWhen I think about, when I think about (respect)\n\n[Verse 2]\nMan dem a come down from England\nAnd dem wah commerce for your kingdom\nSay 'em got nuff Manilla for the yute\nAnd the gal and the man, would you bring some?\nTallawah and bashy, yuh sight me?\nSay him don't want the likkle or the feisty\nSay him got nuff bickle for the trip\nNah worry 'bout a thing man, everyone irie\nFuckery, mi nah wan' fi do it\nAnd the samfie man wan mi fi trade pickney\nFor a quattie, baldhead must think me foolish\nMe put a cutlass in this nuisance\nBwoi, wake up from your dream\nTo the smell and the sound and the screams\nAnd the panic of the captain and the crew\nWho don't know what to do\nAs the ship comes apart at the seams\nGot 'em, ship gets pulled to the bottom\nBy a group of men and women holdin' ropes\nWith large hooks on the ends specifically designed for catchin' boats\nCrew in disbelief as they choke\nThe weight of the chains on the slaves\nPullin' down to what they think are they graves\nAfraid as they sink from the surface of the sea\n'Til a soft voice in the water tells them, \"Breathe\"\n\n[Pre-Chorus]\nFire burn\nFire burn (atat tat tat tat)\nBabylon (atat tat tat tat)\nReal mama (tat tat tat tat)\nSoon forward (atat tat tat tat)\nFire burn (atat tat tat tat)\nBabylon (atat tat tat tat)\nDownpressed (atat tat tat tat)\nJah bless (tat tat tat tat)\n\n[Chorus]\nAll I got is gold, golden memories\nWhen I think about what you meant to me\nAll I got is gold, golden memories\nWhen I think about what you did to me", "image": "https://images.genius.com/86aa1a0cb9e9a473ce83eb531fa78079.500x500x1.jpg"}], "artist": "Lupe Fiasco"}