{"songs": [{"title": "HVN4AGNGSTA", "album": "Sunday Service", "year": "2012-11-19", "lyrics": "[Intro: Master P]\nWhat's up, Game?\nPour out a lil liquor, for Jevon Taylor\nLil Drako, and JoJo\nMy brother Kevin Miller, Hot Boy, Lil Fred\nAll the real niggas man\nY'all hold y'all head up\nIs there a heaven for a gangsta, gangsta, gangsta?\n\n[Verse 1: The Game]\nLet my nigga C out\nHotbox the 7 'til the smoke start to seep out\nGot on chains like a slave in the deep south\nCould've been Michael Jordan but I took the Master P route\nHad to take the street route, niggas know what we 'bout\nHard to snitch when the Glock knock your fucking teeth out\nAnd I just voted for Obama, nigga\nBut I'd still shoot you in front ya mama, nigga\nWord to Michelle, got stripes like Gazelles\nPour hot sauce in the devil food, strike a match in hell\nSkip that yayo just to tip that scale\nMy favorite stripper drive a Maybach, I tip that well\nFish tail in the Phantom with a chick that's pale\nWhite America's nightmare, rich black male\nUsed to work at Foot Locker, had to use my brother piss\nI got the job, but he got hit with the fifth\n\n[Chorus: singer & Master P]\nIs there a heaven for a gangsta, gangsta, gangsta? (I need to knooow)\nIs there a heaven for a gangsta, gangsta, gangsta?\nHeaven's in your heart\nHeaven's in your heart, ooh ooh, oh\nHeaven's in your heart\nHeaven's in your heart, ooh ooh, oh\nIs there a heaven for a gangsta, gangsta, gangsta?\n\n[Verse 2: The Game]\nI think so, but my blood still run cold\nI'm tryin' to make my momma feel like Gabby's when she won gold\nThe greatest stories remain untold\nAs souls wither away, transparent in that gun smoke\nI tell the story so my sons know\nI believe there is a heaven for a gangsta, nigga, Pun know\nUsed to have to pump blow to make my funds grow\n'Cause when them funds low that Uzi weigh a ton though\nCatch me in the morning sipping champagne on Instagram\nFunny how that chandelier used to be a ceiling fan\nFunny how that Buick Regal, turned into a Lam\nFunny how Lilly's grandson turned into a man\nI look around out here, a bunch of little me's\nEverybody tryin' to do it B.I.G., a bunch of Lil' Cease\nAnd since Lil JoJo can no longer breathe\nI'ma ask y'all for him, so check it\n\n[Chorus: singer & Master P]\nIs there a heaven for a gangsta, gangsta, gangsta? (I need to knooow)\nIs there a heaven for a gangsta, gangsta, gangsta?\nHeaven's in your heart\nHeaven's in your heart, ooh ooh, oh\nHeaven's in your heart\nHeaven's in your heart, ooh ooh, oh\nIs there a heaven for a gangsta, gangsta, gangsta?\n\n[Verse 3: Master P]\nMy nigga dead, didn't make the team\nCould've been the next ML King\nYoung niggas rolling with them triple beams\nCup full of lean, but why a nigga spilling dreams?\nAnd the little homies dying over Twitter beef\nBlack president, niggas should consider P\nIt's a dirty game, nigga, when you got cash\nBitches don't holla when a nigga on his ass\nAnd the pigs set the trap and they got C\nI really know them motherfuckers wanted me\nAnd now the world's scared of Chief Keef\nHe just a lil' nigga tryna eat\nI remember bitch, '99 ('99)\nNow it's 2012, I'm getting mine (getting mine)\nLittle niggas pay attention\nAll my real niggas know that I miss 'em\n\n[Chorus: singer & Master P]\nIs there a heaven for a gangsta, gangsta, gangsta? (I need to knooow)\nIs there a heaven for a gangsta, gangsta, gangsta?\nHeaven's in your heart\nHeaven's in your heart, ooh ooh, oh\nHeaven's in your heart\nHeaven's in your heart, ooh ooh, oh", "image": "https://images.genius.com/1a1d0e3f59e6937963ec42438b4fe5b3.500x500x1.jpg"}], "artist": "The Game"}