{"songs": [{"title": "Worldwide", "album": "Skull & Bones", "year": "2000-04-25", "lyrics": "Verse 1: Sen-Dog\nYou better hope I'm chained up, shackled with a yard\nI'll snatch you by the neck, bide you like a tech\nWreck fools when I disconnect, make you sweat\nShit your pants, get in yuor step on my advance\nCatch a glance of the legendary brother who carries\nYour body and buries two more lyrics in styles varied\nFool what?  You ain't got nothin' to say\nI been backin' up east side LA, all day\nBlowin' up the best techs, the best flex\nHavin' the best sex, fuckin' in Wessex\nThe hardcore shit, I know you like it raw\n'Cause ain't no other Dog breakin' the last straw\n\nChorus (2x): B-Real\nYou better bounce, nigga, smoke an ounce, nigga\n'Cause you rollin' with the Hill and what counts is uh\nCan you hang with us?  You wanna bang with us?\nCypress Hill, worldwide, Los Angeles\n\nVerse 2: Sen-Dog\nI don't bark, I just bite, mangle and maim niggas up\nCheck your strap, they mangle us and pick us up\nFool, now you tremblin', I give you three seconds\nTo break out before you resemblin' a dead man\nA hole through your headband\nMy gat's in my right hand, my plug's in my left hand, punk\nCypress Hill worldwide, you just a local\nDon't anger me, or you can hear it in my vocal\nYou don't want that strap on my hip\nTo deal out, the repercussions dug a fat lip\nI'm buckin' at the room soon to the boom\nFuckin' with your head like the 'shroom you consume\n\nChorus\n\nVerse 3\n(BR) Bitches, you're all thick-eyed, a weak ride\nI take money-money, make dummies all night\nUse the mic, bruise the mic, we choos the mic\nWhen you sorry niggas go off and lose the mic\n(SD) We choose a life right, we roll with crew tight\nSee the light at the end of a tunnel - a gat barrel\nWettin' up your flyest apparel, a cane ray\nYou forget me and I'll be back to refresh your fuckin' memory\nRemember me now, Cypress Hill soldier\nUp and down the boulevard, big money folder\nYou bring descript sequence with no defense\nThe whole defense hittin' the bones while you sleepin'\n\nChorus", "image": "https://images.genius.com/af5085b228c3f1b6bc3a2ac39f6c6be8.1000x977x1.jpg"}], "artist": "Cypress Hill"}