{"songs": [{"title": "Goblin", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Intro: Tyler, The Creator as Dr. TC]\nYou wouldn't do that Tyler, kill yourself or anyone. You don't even have the balls to begin with. What you need is me, someone to talk to, uh, it's been a while since our last session. So, tell me what's been going on\n\n[Verse 1]\nI'm not a fucking role model (I know this)\nI'm a 19 year old fucking emotional coaster with pipe dreams\nSince Kanye tweeted telling people he's bumping all of my shit\nThese mothafuckas think I'm 'sposed to live up to something? Shit\nI'm still jacking off and proceeding my life careless\nBut getting more pussy 'cause I tell bitches I'm Wood Harris (as you should)\nPhilly to Paris, I'm getting these weird stares\nAt skateparks and airports all in a year, it's weird\nYonkers dropped and left them craniums mindfucked\nNow competition missing like that nigga my mom fucked\nHe still hasn't called me yet (that's not your fault)\nBut that's a whole fucking different argument, shit, I got over it\nAnd a couple bucks in my pocket, so now I could go buy\nA couple Hot Pockets and grandma could stop cooking\nThem nasty ass collard greens, pressure's on me like this top hat\nBastard intro, how the fuck I'm gonna top that?\n\n[Interlude: Tyler The Creator, Tyler, The Creator as Dr. TC]\n\"Tyler, you'll top it, you'll top that, you're a very capable individual\"\n\"Okay, you guys caught me, I'm not a fucking rapist or serial killer, I lied\"\n\"You know, you just want attention, you'll be fine\"\n\"I try too hard, huh?\"\n\"No, you don't\"\n\n[Verse 2]\nMade a couple thou' and I just don't know what to buy yet\nThe 'preme shit is free and I don't drink, so fuck a wine set\nNigga, fuck a mindset, my brain is an obscenity\nI'm fucked in the head, I lost my mind with my virginity\nOh, that's a triple three six, isn't he a devil worshiper\nCause I'm too fucking ignorant to do some research?\nI'm the star of the group (Yeah)\nSo no one else gets the respect that they deserve cause of you\n(Bastard was good though) What you think I record it for?\nTo have a bunch a critics call my shit a bunch of horrorcore?\nLike I didn't make \"Parade\" or \"Inglorious\"\nCause I'm too scared to tell my friends the way I really fucking feel?\nOf course they only listen to lyrics about me pissin' off\nIn the tombs of Lara Croft, I'm getting pissed off (I bet)\nMessage boards are on my dick, I need a pissing waiver (here)\nLet me bust one in they mouth, I know they full of flavor\n\n[Interlude: Tyler, The Creator, Tyler, The Creator as Dr. TC]\n\"Can't they just be happy for me like, a kid with nothing, living out his dreams? Why they got to fucking hate?\"\n\"I think everyone's happy, everyone's immature, everyone loves you Tyler, you have to believe that.\"\n\"I don't even skate anymore, I'm too fucking busy, I can barely kickflip now.\"\n\"Why? Why is that? Do you not have any free time at your home?\"\n\"What the fuck you mean I'm not talented? You see the shit that I've been doing?\"\n\"I have, I mean you're a great person.\"\n\"I mean, I'm not that great of a rapper but as a whole, I'm pretty cool, right?\"\n\n[Verse 3]\nPeople excited, thinking shit is so tight (For what?)\nGetting co-signs from rappers that I don't even like\nWhat the fuck you want me to do? Start to gobble his mic?\nAnd start Jackson him off until his cack blasting off? (No...)\nFuck that, (Yeah) These niggas ain't fucking with me\nCause I don't listen to the Immortal of Tech-of-the-nique\nAnd all this underground bullshit that's never gon' peak\nOn the Billboard Top 20 and Jam of the Week\nI'd rather listen to Badu and Pusha the T\nAnd some Waka Flocka Flame instead (All that shit) of that real hip hop\nThat's bull-of-the-sheet, but they want to critique\nEverything that we, Wolf Gang, has ever released\nBut they don't get it, (They don't, it's not made for them) cause it's not made for them\nThe nigga that's in the mirror rapping, it's made for him\nBut they do not have the mindset that's same as him\nI'm not weird, you're just a faggot, shame on him\n\n[Interlude: Tyler, The Creator, Tyler, The Creator as Dr. TC]\n\"It is, but Tyler, you're going to have to cut down on that \"faggot\" word, that's very, that's a bad...\n\"I'm not homophobic.\"\n\"I mean, I don't think you are but...\"\n\"Faggot.\"\n\"Alright, well, since the last time we...\"\n\"The fuck is a good performance? I get on stage and I have as much fun as I can.\"\n\"I mean, you, you, it seems like you have fun. But your Twitter posts, just.. I mean, they're really random and it's ADD.\"\n\"Who doesn't have ADD..? Well, I don't.\"\n\"I mean, sometimes, you're just really out in the distance and we just want to know, what's the problem for this?\"\n\"I wish Thebe was here.\"\n\n[Verse 4]\nTherapy's been sinning and niggas getting offended\nThey don't want to fuck with me cause I do not fuck with religion\nYou see, that's my decision, you fuckers don't have to listen\nHere, put this middle finger in your ear (I'd rather not)\nWhen someone gets blamed cause some white kid had aimed (What?) his AK-47\nAt 47 kids, I don't wanna see my name mentioned\n(I don't think anyone's going to men—I don't think anyone takes you serious enough to believe you.)\nCollege wasn't working and I wasn't working\nSo I was at home jerking off until my dick was hurting\nBut I was determined to be great, so those classes can wait\nCause the four days that I went, I wasn't learning shit (I mean, you...)\nNow I'm living dreams that I wanted since eight\nAnd can afford to get my mother something on her birthday\n(I mean, you've explained to me that you were in school, but, I mean, I...)\nThey claim the shit I say is just wrong\nLike nobody has those really dark thoughts when alone\nI'm just a teenager, who admits he's suicide prone\nMy life is doing pretty good, so that date is postponed for now\nWow, life's a cute bitch full of estrogen\nAnd when she gives you lemons, nigga, throw 'em at pedestrians\n(So, what are you saying, take advantage?\nI mean, you've been doing pretty good, I've seen that)\nI still live in my grandma's house\nSell out a fucking show in London just to end up on couches\nI hate my fucking life, but when I make that announcement\nMy hero calls my phone, just to put that in doubt then\nAnd then I am confused if I want in or just out\nMy friends really think I'm playing when I say I need counseling\nI sit in grandmother's living room and just pout\nAnd shout loud inside, sometimes I just want to die (No, you don't)\nOdd Future came from the bottom\nAnd it's gonna take a couple armed armies tryna stop 'em\n(I believe you) All you fucking lames don't have to like me\nThe devil doesn't wear Prada, I'm clearly in a fucking white tee\n\n[Outro: Tyler, The Creator as Dr. TC]\nWhoa, umm, alright, uh, so Syd was telling me you went to New York...", "image": "https://images.genius.com/fd29e400e2d672aa992f9fda170e9959.640x640x1.jpg"}], "artist": "Tyler, The Creator"}