{"songs": [{"title": "Illegal Business Remix 2004", "album": "Keep Right", "year": null, "lyrics": "Ha! Ha! Huh! Huh! What's this?\nYo, huh, huh, huh\n\n[Verse One]\nI'm the one that steps in the club, ya not see it\nGivin dap, givin pounds and hugs, ya not see it\nIn the club I'm not lookin for love, ya not see it\nGimme the mic and I'll show you whassup, better believe it\nI'm not at the bar, whatever the pub, ya not see it\nStill they sendin me these bottles of bub, ya not see it\nBut I will open the minds of thugs, ya not see it\nWho you think really bring in the drugs, ya not see it\n60 million people smokin the bud, ya not see it\nCause the American way of life is bugged, ya not see it\nYou never peep it, yo this ain't a secret, ya not see it\nThey confiscate it, resell it, you retrieve it, ya not see it!\nSo believe it while you sit there weeded, ya not see it\nHip-Hop culture who gonna lead it, ya not see it\nK, R, S One, ya not see it\nPeace love unity and havin the fun, ya not see it\n\n[Hook]\nCocaine business control America\nGanja business control America\nKRS-One still causin hysteria\nIllegal business control America\nDiamond business control America\nThe oil business control America\nKRS-One still causin hysteria\nIllegal business control America\n\n[Verse Two]\nYo, rise up brother, raise up sister\nVisualize wealth, put yourself in the picture\nVery few cats gon' tell you the half, ya not see it\nCause they're really only after the cash, ya not see it\nBut they wind up sellin they own ass\nOne album, two album, they gone they don't last\nSo hold on a minute now, don't be so fast\nKnowledge Reigns Supreme with me ya won't crash\nHa, I'm the cat that spits the raw, ya not see it\nThey can't believe when I hit the tour, ya not see it\nI'm not ready to retire for sure, ya not see it\nI'm from the 70's, I'm down by law, ya not see it\nWe passed fliers door to door, ya not see it\nPopularity's growin more and more, ya not see it\nConscious rap where the heart is at, ya not see it\nWe be screamin WHERE THE PARTY AT, ya not see it\nBut instead of the Bacardi sack, ya not see it\nFallin out in the party in the back, ya not see it\nLet me show you where the art is at, ya not see it\nPut down your money I'm takin all of that, ya not see it\nAll the clubs they be callin me back, ya not see it\nI'm never short cause I'm taller than that, ya not see it\nI'm only showin you the other way out\nMaybe I'm preachin but this is what love is about, ya not see it\n\n[Hook]\n\n[Verse Three]\nKRS, I speak when I must\nThis that official underground rap, this you can trust\nI stand outside the industry and there's many of us\nTalkin mad shit but for those who not bilingual, plenty of stuff\nMy whole crew is why you can't get with any of us\nReason I'm not on TV cause I'm not sellin you nothin\nI'm not rhymin for a Bentley or a house this plush\nI spit for the conscious, what about us?\nTime's up, time to open that mind up\nTemple of Hip-Hop sign up, devils we bind up\nWhen I'm up rhymin cuts your spirit hear it and shines up\nClimb up before you wind up takin\n\n[Hook]\n\n{*scratching*}\n\n[Hook - minus instrumental]", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}