{"songs": [{"title": "Skrilla", "album": "High School High (Music From and Inspired By the Motion Picture) ", "year": null, "lyrics": "Intro:\n\nSkrillaaaaaaaaaa\nSkrillaaaaaaaaaa\nSkrillaaaaaaaaaa\nSkrillaaaaaaaaaa\n\nVerse 1: Facemob\n\nThinkin bout money, money, money, plottin how to get me some\n(The fast dough) Cos see don't nothin move but the flow, really doe\nI kid you not, I'm real with dis\nHavin skrilla is the only way to deal with this\nIf it ain't green, it ain't me, that's no goddamn lie\nWell show me big skrill and I will get live\n\nGive up the loochie, I need it in a major way\nNow gimme all (all), I gots ta have it (everyday)\n\nIt's my world, the only mom, I'm stressed, that'll make you\nBreak you, if it's really real then I'll take you\nShake you for the dollar bill let's see\nYou're outta here (smoked on the fuckin concrete)\n\nChorus:\n\nSkrillaaaaaaaaaa - Got me crazy, skrilla got me gone\nSkrillaaaaaaaaaa - got me flippin new Cadillac chromes\nSkrillaaaaaaaaaa - got me crazy, skrilla got me mad\nCos skrilla gives me from riches to rags (motherfucker)\n\nVerse 2: Scarface, Facemob\n\nIt ain't nuttin but the cash flow game\nHow long can you last 'fore you're down to your very last change, nigga?\n(Money makes the world go round) Tell em again y'all\n(Money makes the world go round) (*My God*)\nForty, fifty grand a night, that's what I'm seein\nAs I'mma vin your own ass tonight, you know the meanin\nOf a worldwide national? Big money gripper\nBaller, called a, million dollar nigga\n(uhh, who me?) Yes you (Could be, but who?)\n\nUhh, 350 bringin on in the weeks news\nAnd no I don't shoot, I swoop in my Coupe\nSkrilla for realla my nigga, so whatcha wanna do?\nDo you want to fuck around with my crew? Do you\nWant to? Would do exactly what you did do\nStay in you, don't have enough to attend to the menu\nSo come and let me single, continue (everybody sayin)\nTo make money money money, make money money money (yeah)\nHere go fat stacks if you can't take money nigga\nTake money money money, take money money money\nSo can you please make the cheque out to the Facemob\n\nCheck it\nNow one, two, three to the fo', like\nRippin million dollars in my hand, tight\nFacemob rule number one thing (what?)\nSkrilla, nuttin but skrilla's the way to maintain\nUs both, have got to keep the skrill between\nUs fo', as we proceed to make mo'\n\nReally doe, from town to town we puts it down\nAs I, hold it down, game tight, right\n\nNow Miss Crabtree (Crabtree), I know that you are mad at me\nTo find out that it was your money (money)\nThat I spent and now girl, it's all gone\n(It's what?) It's all gone\n\nIt's gone like riches to rags, dishes to bags\nOf leftover ten and jam, can happen to any man\nGots ta get money, money I gots ta get\nThis shit right now so I can hop on the lot\nAnd we about to come up as we put the shit down\nHold up, don't rush, cos I'm good ta gets mine\nIf it wadn't for bad, I'd have no up than luck\nSmokin plank of man, who gives a motherfuck!!!!\nThe bill collectors, they ring my phone\nScam my wife when I'm not home\nBitch I'm gone, tryin ta come back phat\nFacemob where ya at? (Right behind ya and we strapped)\n\nStrapped with straps and all eyes on paper\nAnd most importantly you keep your mind on papin\nAnd you can have it all, if you can take your money pieces at a time\nBut you can't take your pieces outta mine\nBig wine, it's all about the dollar sign\nI'm, flippin in the big Dawg, continental flyin\nTryin to stack it to the ceilin on you home's\nCos bitches got me cummin but skrilla got me goin\n\nChorus:\n\nSkrillaaaaaaaaaa - got me crazy, skrilla got me goin\nSkrillaaaaaaaaaa - got me flippin new Cadillac chromes\nSkrillaaaaaaaaaa - bought me houses, skrilla bought me clothes\nSkrilla got me flippin in a Rolls", "image": "https://images.genius.com/cd29718e436b4c969a36495c282f35e7.400x393x1.jpg"}], "artist": "Scarface"}