{"songs": [{"title": "The Ride", "album": "Take Care", "year": "2011-11-15", "lyrics": "[Intro: Drake]\nI hate when, I hate when people say they feel me man\nI hate that shit\nIt’ll be a long time before y'all feel me, if ever\nFor real\n\n[Verse 1: Drake]\nYou won’t feel me 'till everybody\nSay they love you, but it’s not love\nAnd your suit is oxblood\nAnd the girl you fucking hates you\nAnd your friends faded off shots of\nWhat you ordered to forget about the game that you on top of\nYour famous girlfriend's ass keep getting thicker than a plot does\nAnd when you forget it, that's when she pop up\nAnd you got a drop but you ride around with the top up\nOr get three SUVs for niggas dressed like refugees\nAnd deal with the questions about all your excessive needs\nAnd you do dinners at French Laundry in Napa Valley\nScallops and glasses of Dolce, that shit's right up your alley\nYou see a girl and you ask about her\nBitches smiling at you, it must be happy hour\nThey put the cloth across your lap soon as you sat down\nIt’s feeling like you own every place you choose to be at now\nWalking through airport security with your hat down\nInstead of getting a pat down, they just keep on\nSaying that they feel you, nigga\n\n[Hook: The Weeknd]\nI've been faded too long\nI've been faded too long\nI've been faded too long\nWhy won't it stop? The ride\nWhy won't it stop? The ride\n\n[Verse 2: Drake]\nYou won't feel me til you want it so bad you tell yourself you’re in it\nAnd tell the world around you that your paperwork is finished\nAnd steal your mother's debit cards so you maintain an image\nAnd ride around in overpriced rental cars that ain't tinted\nYou need a minute? You got it\nYou know it's real when your latest nights are your greatest nights\nThe sun is up when you get home, that's just a way of life\nApartment 1503: some couches and paintings\nWhen you record with two others that want the same things\nIt start to feel better than home feels\nAnd so you up there every night, you swear you getting close\nThat champagne money was for gas and phone bills\nBut shit, you bout to spend it on what matters most\nYou drop a couple songs in hopes that you could be the nigga\nAnd come out every night to let the city see they nigga\nTelling stories that nobody relate to\nAnd even though they hate you\nThey just keep on telling you they feel you, nigga\n\n[Hook: The Weeknd]\nI've been faded too long\nI've been faded too long\nI've been faded too long\nWhy won't it stop? The ride\nWhy won't it stop? The ride\n\n[Verse 3: Drake]\nI haven't been inside Terminal 1 and 3 in so long\nI’m driving right up to it now\nMake sure you got your coat on\nThat runway can be cold especially after summer's rolled on\nAnd all you knew is alcohol and city lights and slow songs\nFor four months out the year, it's got you asking whats good at home\nWhat's good at home?\nThe same hoes are still at it, I shoulda known\nMy young niggas popping M’s and sipping dirty jones\nProblem children that all be repping October's Own\nBrand new girl and she still growing\nBrand new titties, stitches still showing\nYeah, and she just praying that it heals good\nI’m bout to fuck and I’m just praying that it feels good\nI really don’t know much but, shit, I know a secret\nThey say more money more problems, my nigga don’t believe it\nI mean, sure, there’s some bills and taxes I’m still evading\nBut I blew six million on myself and I feel amazing\nYoung money maker, season ticket holder\nSeason switching over\nI come through them bitches\nStill scorching as if I didn’t notice\nYou niggas getting older, I see no threat in Yoda\nI’m out here messing over the lives of these niggas\nThat couldn’t fuck with my freshman floater (flow ta)\nLook at that fucking chip on your nephew's shoulder\nMy sophomore, I was all for it, they all saw it\nMy juniors and senior will only get meaner\nTake care, nigga\n\n[Hook: The Weeknd]\nI've been faded too long\nI've been faded too long\nI've been faded too long\nWhy won't it stop? The ride\nWhy won't it stop? The ride", "image": "https://images.genius.com/a50b0608affc94c4dae3d502a65ea390.1000x1000x1.jpg"}], "artist": "Drake"}