{"songs": [{"title": "Ooh", "album": "Fahrenheit 1/15, Part I: The Truth Is Among Us", "year": null, "lyrics": "[Verse 1]\nYa hopefully hand over the Land Rover keys\nSlowly and run like hosiery\nI move eggs like ovaries\nClosed lactose and sudairy\nWho y'all suppose to be?\nNone of them close to me, my poetry poison til' they posing me\nAnd little kids poking me openly\nFuck police I slip through they fingers like rosaries\nOff the hook with the .38 rotaries\nGet it locally move anti-socially\nTwice the rapper get it from both of me jokingly\nSo constant and nonchalant from BIC's to Mont Blanc's\nLose conscience, Lu's not the one to confront\nWorth my weight you impersonate niggas like\nMiller Light spit it right in your life, terminate\nI'm the worst case scenario\nBump heads for coins like Mario\nPop more rounds than Merry-Go(-rounds), from birth date to burial\nIn South Beach beeches going south with they mouth piece without speech\nOh now he's official from the start\nThey miss you, holding vigils in the dark\nGo head try and stop it, couldn't block sun with Hawaiian Tropic\nWhat's in your pockets my profits\nFoxes pick me up like chop sticks, this hotness\nThey wanna put me in boxes like chocolates...that's nonsense\nNothin' sweet about this but the hotel room Presidential like the wrist\nI know, I'm sorry I never meant to end shit\nNever rental get mine freeway like Van Wyck\nPeace to Francis and all my manz(iz)\nTake trips to France(iz) where all my manz is\nWith fifths in handz(iz) rewind and chant this, niggas!\n\n[Verse 2]\nI got a bezel from embezzlin' Good Heavens! And they said I lost it in 97'\nAbout to start using Mexicans not cause they better than just cause I get Si Senor not I need more\nWith chicks from Singapore from bunk beds ?\nTo tour room Colonials and still testimonial\nAnd so I keep it secret, in the kitchen in the cabinet in a jar where the grease is\nL-U-P speaks it til' its pieces, peanut butta like\nAlways being a quiet cat not the meanest motherfucker type\nFor a hundred grand plus, I'd be buffin' brass Knucks\nBest listen to your dawgs, get Son of Sam'd up, what!\nAhead of my time, failed history passed chemistry, quiet nines in Quinine\nMy energy always be weaponry to unload, while there's people to holdup reputations to uphold\nI'm Gung Ho with them white lines, not the kind that divides traffic\nBut the kind that reminds addicts, automatics to yo attic\nTecked out Porsche' in the decked out Boxter WASup!\nFed's is nice with the camera's, challengers get beat black and lavender\nWomen put my name across they chest like janitors\nFans of the, hustler under the stairs his fiends on the banisters WHAT!!!", "image": "https://images.genius.com/9922f7078ce1f910a0541c33e13cce5b.500x500x1.png"}], "artist": "Lupe Fiasco"}