{"songs": [{"title": "Stoner (remix)", "album": null, "year": null, "lyrics": "Hey, this a stoner music, man!\nStoner! Boner!\n\n[Hook: Young Thug]\nI'm a stoner, I'm a stoner, I'm a stoner!\nI'm a stoner, I'm a stoner, I'm a stoner!\nI'm a stoner, I'm a stoner, I'm a stoner\nI'm a stoner, I'm a stoner, I'm a stoner\nI'm a stoner, I'm a stoner, I'm a stoner\nI'm a motherfuckin' stoner\n\n[Bridge: Young Thug]\nI just put a forty on my wrist just like a bus\nI just put ten thousand on my bitch just like a boss\nI just drank with YSL just like a F- boss\nJust like a f- boss, just like a\n\n[Verse 1: Young Thug]\n\nThugger Thugger, you\nI want Michael Jackson land, ohh\nAww I'mma cash out\nI'm high as hell ain't got no satellites on me\nI tell that bitch I feel like Fabo\nI feel like Fabo, I feel like Fabo\nI feel like Fabo, I feel like Fabo\nI feel like Fabo, I feel just like Fabo\nI'm back at it, Juug man voice (Yung Ralph)\nBankhead\nHear my song way from Y-T-C-R-O-B-S-M-M, now we YSL venom\nSlime Thugger wit it, Slime DK wit it\nSlime Wicced wit it, Slime Mondo wit it\nSlime Slugger with it, Slime Bubba wit it\nSlime Check wit it\nCount hundreds and fifties off everyone's city\n\n[Hook]\n\n[Verse 2: Wale]\n\nStoner, rotation three in slowmo\nOk, that's me, myself and I, so now I'm cheefin' solo\nWhy? Cause most these niggas is no go\nOh, no. I see y'all ho shit!\nI believe my train of thought is cuckoo\nI've got a locomotive\nBaby girl I be the dopest, please then roll me up, I'll be good\nY'all see us, and y'all see them\nIf y'all compare, y'all not serious\nI've got that tzz-tzz, Tom Ford\nI've got that tzz-tzz, black orchid\nI've got that tzz-tzz, Bob Mar\nWith that Jumanji decor\nAnd I record, out of this world\nDanny's gon' cop\nTravis go roll, those are my dogs\nOne more animal, camel toe showing, camel toe roll\nNow we at the mall, somebody goin' broke\nFellow, where's my dope?\nIn Atlanta where, so much damn Versace\nHow could I not be stoned?\nMedusa, baby, what do you know?\nYou choose your nature, leave me alone\nRolex official in the Presidential\nAnd the bitches love it like Olivia Pope\nThis is one flow, got one million more\nAnd the city is mine\nI'll just let you know\nI've got ...\nPut tray on it\nI've got fats on\nIt cost a million more\nI've got black on and I can rap on\nWhatever track dog, I'm like a young quarterback\nRunning, quarterback draws million of yards\nAnd never giving it up\n\nI'm a stoner, I'm a stoner, I'm a stoner!\nIf you a roller, I'a roller so come over!\nI'm a stoner, I'm a stoner, I'm a stoner!\n'less you police, don't look too deep beneath the corner\nI'm a motherfucking stoner! Tell somebody bring the roll up\n\n[Hook]\n\n[Verse 3: Young Thug]\nRun it, run it, up, like a dark trial\nWhen you beat it, turn it, in a stone trial\nWe don't stay in line, get your shoes up your feet\nEverybody stoned\n\nEverytime I walk inside the club I see everybody looking\nOh, no, I'm a stoner, I can't love you...\nNow, you can start my banana, but I won't eat your pudding\nSo come a little closer, I might know you\nAndale, andale!\nHow the fuck I ... when there is a runway?\nMy thought is a match from the blood on my chest\nShe put up my dinner, she well like a fish\nI took up a T-Rex stake, T-Rex\n\n[Hook + Bridge]\n\n[Outro]\nI feel like Fabo!\nI feel like Fabo!\nI feel like Fabo!", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}