{"songs": [{"title": "Scream on ’Em", "album": "Doctor’s Advocate", "year": "2006-11-14", "lyrics": "[Intro : Swizz Beatz]\nYeah... y'all really want this to happen? (Game time!)\nC'mon! ... ARRRRRRRRGH!\n\n[Verse 1 : The Game]\nHomey it's hard not to kill niggas; it's like a full time job\nNot to pull out the steel and shove it in your grill\nYoung California got that mass appeal\nI summons the hood, they get up in yo' ass for real\nKnockout flow, Winky Wright jab for real\nAnd all you niggas pussy, need Massengil\nSee I'm the gun-cocker, one-shotter, lift 'em off the ground\nChop 'em down, like a cantaloupe, My flow the antidote\nSick flow, it's so, motherfuckin six-fo'\nYour bitch know, hop in the back when you see Swizz ho\nDiss that, all you niggas get up off my dick so\nI can cook crack on the track and watch it mix slow\nCocaine, my flow fire, call it propane\nEvery nigga know Game, five shots no pain\nAnd that's the reason why I'm shittin on you niggas\nShut me in the looney bin, I'm sicker than you niggas\n\n[Hook: repeat 2X]\n(ARRRRRRRRGH!)\nThis is that disrespectful, motherfuckin West coast\nHip-hop death blow, Swizz Beatz, let's go!\n\n[Verse 2 : The Game]\nWhere I'm from, I seen the most stand up niggas lay down\nWhere skinny niggas make buff niggas victims of that trey-pound\nAnd gangbangers is the sharpshooters, we don't need no rooftops\nJust knock his ass down and take the money out his tube socks\nWest Coast niggas is back on the map\nIf only for now until the next time I body a track\nFrom the first clap I hurt rap, now watch the earth crack\nBring the hearse back, and take a lyrical dirt nap\nI roll with the hardest niggas, make money with the smartest niggas\nI ain't got time for you fuckin artist niggas\nBetter shut your trap before you become a target nigga\nY'all army brats I'm the motherfuckin sargeant nigga\nBeauty pageant-ass niggas on the runway\n+Boyz N The Hood+ 'til they see the nigga in that red Hyundai\nBlow his fuckin back out, cause I'm the rap Stackhouse\nBlack Wall Street bitch, the hip-hop crackhouse, what?\n\n[Hook]\n\n[Verse 3 : The Game]\nMy flow opposite of handsome, it's ugly\nHip hop tantrum, sick, call the shit cancer\nOne man show cause I fucked all the dancers\nLet the critics ask questions, my album be the answer\nThese niggas let the rumors sit in they head like tumors\nSo I had to take 'em back, to toothbrush on the Pumas\nClean... mean... rappin machine\nRed rag hangin low in the back of my jeans\nI black out like February, back out what's necessary\nOh-seven Bugatti with Jimmy Iovine's secretary\nI'm runnin the buildin, don't make me run in the buildin\nNo this ain't the first time I had my gun in the buildin\nWalkin past offices I see my son in the buildin\nLast album on the wall I'm number one in the buildin\nThey should build me an office up under the buildin\nMy elevator goin down, I am done in the buildin nigga\n\n[Hook]\n\n[Outro : Swizz Beatz]\nWe in the motherfuckin buildin man\nYou ain't got your motherfuckin mind right?\nYou gon' get your mind blown out your motherfuckin mind right nigga\nIt is what the fuck it is man\nHow y'all wanna cut the cake?\nYou touch this you get your hands cut off, nigga\nSwizz Beatz the motherfuckin monster\nGame is in the motherfuckin buildin\nWe could turn this whole motherfuckin world red nigga\nBitch!", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg"}], "artist": "The Game"}