{"songs": [{"title": "Bring You Down", "album": "Kiss of Death", "year": "2004-06-22", "lyrics": "[Verse 1]\nTop of the food chain, It's just the way that I do things\nThe dungaree seats in the blue Range\nI'm working with new change, a Gemini nigga with mood swings\nHad the fiends looking for new things\nI stopped playin' with birds and started playin' with words\nThe money wasn't right, so I had to stay on the curb\nAnd I'll be a player later. But for now\nCall me pootay 'Kiss, if not that? Montega Jada\nI kick hard bars and blow hard weed\nAnd be everywhere, cause I move at God's speed\nAnd my aim is to make y'all bleed\nY'all got embarrassed in the class when the teacher used to make y'all read\nUh-huh, Mind over matter\nAnd that's all good but fuck that\nMy new shit is spine over bladder\nAnd everybody tryin'a get to the top, and that's all good too\nBut right now - I'm on the ladder\n\n[Hook]\nLook at you then, and (uh-huh)\nLook at you now. (yeah)\nDon't let this cold cold world,(uh-uhhh)\nBring you down\n\n[Verse 2]\nI know your queen got her eyes on me\nI got my eyes on your queen, The SMG is Heineken green\nMad thing is you know before long that we gon' get it on\nMy kit costs thirty and ten to put it on\nNo tints, windows clean - heavy Windex\nGears on the steering wheel, I shift 'em with my index\nReal life - it's just in another form\nKiss of Death, it's about to be another storm\nI'm a goddamn raging bull\nStay out of jail by just tellin' myself the cage is full\nGot niggas on the payroll, just to squeeze\nYou're in no position to challenge my expertise\nThey get a bonus if they leave you\nOld school - from the era of the 45's with the penny on the needle\nBoss of the bosses, so please don't violate or cross him\nOr you'll be the corpse of the corpses\n\n[Hook]\n\n[Verse 3]\nUh- Huh, You know the word anger\nIs just one letter short of the word danger, and I ain't no stranger\nNever use a gat more than twice if you don't clean it\nAnd never say fuck something if you don't mean it\nAnd when it comes to life, the route you've been using thus far ain't working right?\nTake the scenic\nWhatever faith you got, put in a crook\nWanna hide something from a nigga? Put it in a book\nTrust me, this album, the vapour's gon' go around\nIf you ain't hot, you need paper to throw around\nYeah, it's getting clearer every day\nWhen you wake up in the morning, look in the mirror and say\n\n[Hook]", "image": "https://images.genius.com/2b764e1a48616aab1941bfc2c79cd515.1000x1000x1.jpg"}], "artist": "Jadakiss"}