{"songs": [{"title": "Ms. Fat Booty (clean)", "album": null, "year": null, "lyrics": "I know, I can't afford to stop\nFor a moment.. that it's too soon.. to forget\nI know, I can't afford to stop\nFor a moment.. that it's too soon.. to forget\n\n[Mos Def] - speaking over sung vocals\nMan.. for real\nI was in love with this girl, y'know\nI was.. to' up dog! I'm tellin you man\nShe was wild man.. f'real\nIt's just too.. let me tell you about her\n\n[Mos Def]\nYo, in she came with the same type game\nThe type of girl givin out the fake cell phone and name\nBig fame, she like cats with big thangs\nJewels chip, money clip, phone flip, the six range\nI seen her on the ave, spotted her more than once\nAss so fat that you could see it from the front\nShe spot me like paparazzi\nShot me a glance in that catwoman stance with the fat booty pants\nHot damn!\nWhat your name love, where you came from?\nNeck and wrist laced up, very little make-up\nThe slims at the Rebok gym tone your frame up\nIs sugar and spice the only thing that you made of?\nI tried to play it low key but couldn't keep it down\nAsked her to dance she was like 'yo, I'm leaving now'\nAn hour later, sounds from Jamaica\nShe sippin Crys straight up, shaking, winding her waist up\nScene two: my fam throwin the jam\nFor Reed is on the stand big things is in the plan\nThe brother Big Moon make space for me to move in\nHey, this my man Mos, baby let me introduce\nI turn around\nSay, you is the same pretty girl that I had priorly observed\nTrying to play me for the herb (yeah, that's her)\nShocked as hell she couldn't get it together\nI just played it low and pretended I never met her\n'How you feelin', 'oh I'm fine', 'my name is Mos', 'I'm Sharice'\nI heard so much good about you its nice to finally meet\nWe moved to the booth reserved crew especially\nAnd honey love ended up sittin directly next to me\nI'm type polite but now I'm lookin at her skeptically\nCause baby girl got all the right weaponry\nDesigner fabric, shoes, and accessories\nChinky eyes, sweet voice is *fucking* on me mentally\nWe conversated, made a laugh, yeah you know me bro\nEven though I know the steelo, she wild sweet yo\nI'm about to merc, I say peace to the family\nShe hop up like 'how you gonna leave before you dance with me?'\n\n[hook]\n(sung)\nI know I can't afford this life\nFor a moment\nThat its too soon\nTo forget\nX2\n\n(spoken by Mos Def)\nShe blew my whole habit, that girl\nI was like 'what'\nI played it low though, I was like 'yeah, aiight, c'mon then, let's go'\nIts mad, it was so sick, I tell ya\nYo, honey was so blazin, she was just\nYo, she was like J. Kennedy\nWord bond, to my mother man\nShe was that ill man, she take me to the dance floor\nAnd she start whispering to me\n\n[Mos Def]\nYo, let me apologize for the other night\nI know it wasn't right\nBut baby you know what its like\nSome brothers don't be coming right\nI understand, I'm feeling you\nBeside, 'can I have a dance?' ain't really that original\nWe laughed about it, traced her arms across my shoulder blades\nThey playing lovers' rock, I got the folded fingers on her waist\nHeating my blood up like the Arizona summer song\nFinished then she whisper 'honey, let's exchange numbers'\nScene three: weeks of datin late night conversation\nIn the crib heart racin, tryin to be cool and patient\nShe touched on my eyelids, the room fell silent\nShe walked away smilin singing Gregory Issac\nLike 'if I don't, if I don't, if I don't'\nShowin me that tan line and that tatoo\nPlayin Sade, \"Sweetest Taboo\"\nBurnin candles, all my other plans got canceled\nMan I smashed it like an Idaho potato\nShe call my at my J.O., 'come now', I can't say no\nGinseng tree trunks, rockin the p-funk\nCocking her knees up, champion lover not ease up\nThree months, she call 'I feel I'm runnin a fever'\nSix months, I'm tellin her I desperately need her\nNine months, flu-like symptoms when shorty not around\nI need more than to knock it down I'm really tryin to lock it down\nMidnight we hook up and go at it\nBurn is over, let her know, sweetheart I got to have it\nShe tellin me commitment is somethin she can't manage\nWake up the next morning, she gone like it was magic\nAhh damnit! My shit is all Harrison Ford frantic\nMy 911 wasn't answered by my fly Taurus enchantress\nNext week, who hit me up, I saw Sharice at the kiddie club\nWith some banging ass Asian playin lay it down and lick me up\nWhat!?", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}