{"songs": [{"title": "I’m On One", "album": null, "year": null, "lyrics": "I'm on one, I'm on one\nWho want one? Who want one?\n\n[Hook]\nI'm on one, girl I can't lie\nI'm on one, who got them, guys?\nI'm on one, girl I can't lie\nGeeked up in the club, baby, we so high!\n\n[Verse 1 - Gucci Mane]\nIn the club and this girl really dig me\nHer lil baby brother wanna be like Gucci\nGot a plasma screen chain like a 60'' movie\nShorty say \"borin\" - Gucci starts grooving!\nGnarly, Bob Marley, I'm smoking\nNo need to fix the flow: it's not broken\nHate Gucci Mane - is you rolling?\nBitch I might be, but I sure ain't broken\nGucci do the Gucci shoes, never do the pro-keds\nSo Icey Entertainment: call me young showbiz\nWhere did he go kid?\n\"Mama that's the Gucci Mane!\nCan he be my step-daddy? Then we'll be icy!\"\nShorty got swag, but her swag don't touch me\nUnderarm kush dogg, don't it smell musty?\nBart Simpson chain, mane, ?\nGot a pound of purple kush, and It got no seeds\nBad boy Gucci Mane: stacking up groceries\nNow I'm tryna bubble kush, now I got no sleep\nBad boy Gucci Mane: stacking up groceries\n\n[Hook]\nI'm on one, girl I can't lie\nI'm on one, girl I can't lie\nGeeked up in the club, baby, we so high!\nGucci!\n\nThe bitch go so dumb when she pop one\nI got some Skittles in my bag if you want some\nIf you want one, bitch I'm the X-Man!\nRiding 3 ?\nI put em on a Superman and watch em get loose\nWhen bitches come through, I tell em bring their girl too\nIt's swallow dick/truth, drink it like Grey Goose\nThey like who in the mini coop with the missing roof\nI'm so high I can't see a thing\nBut it feels so good when I'm getting brain!\nI'm high up in the sky\nWhatever you demand, I supply, you can buy\nMy eyes so red, boy I'm so outta here\nIs it really me? Or is it fuckin hot in here?\n\n[Hook]\nI'm on one, girl I can't lie\nI'm on one, girl I can't lie\nGeeked up in the club, baby, we so high!\nGucci!\n\n[Gucci Mane]\nI'm up in the club dogg, you don't wanna get none\nParty pack of pills, man I gave your bitch another one\nShe took another one, ? getting dumber son\nPut around a rubberband, tossed it to my brother's son\nGucci going half dogg, nigga you can smell me\nAjax nigga, what a playa ain't gon tell me?\nGot a racer bike, it's sitting on a ki\nWhole body roll though ?\nGucci Limp Bizket\nGucci Kid Rock\nI don't take pills dogg, I just bought\nPsych!\nIf you one of those guys\nI'm fine, rolling Bentleys, bitch wanna be my wife\nCall it G.B.D. chores, getting brain while I drive\nStellar Chevy rims on some skinny-ass tires\nCall it G.B.D. chores, getting brain while I drive\nStellar Chevy rims on some skinny-ass tires", "image": "https://images.genius.com/6f0a4980c8ef838036229e1d4dcd036c.408x408x1.jpg"}], "artist": "Gucci Mane"}