{"songs": [{"title": "Loving You No More", "album": "Young Sweet Jones 2", "year": "2010-09-21", "lyrics": "[Intro: Dirty Money]\nSo hard to breathe this air that we call love (ooh)\nAin't nothin' worse than the hurt we receive from love (ooh yeah)\nWhen you get hurt by the one you livin' for\nPain can make you wanna love no more\n\n[Refrain: Diddy]\nLovin' you no more\nI just, I can't, I just can’t be lovin' you no more\nI love you more than I love myself\nLovin' you no more\nI just, I can't, I just can’t be lovin' you no more\nI love you more than I love myself\n\n[Verse 1: Diddy]\nHurt with the heart that's bleeding slowly\nSo many lonely sleepless nights\nI'm going through hell to convince she love me\nBut never her approval no matter how I try\nThe way you talk to me but still I say I love you\nI’m ashamed you can see it in my eyes\nMomma always told me to respect the woman\nBut what am I about to do when her parents do not try\n\n[Bridge 1: Dirty Money]\nSo many tears I cried\nBut all for nothin' I’m afraid to say\nOh\n\n[Refrain: Diddy & Dirty Money]\nLovin' you no more\nI just, I can't, I just can’t be lovin' you no more (I can't)\nI love you more than I love myself (no, woah)\nLovin' you no more (I can't)\nI just, I can't, I just can’t be loving you no more (no, no, baby)\nI love you more than I love myself\n\n[Verse 2: Diddy]\nI’ve been so dependent on your love for so long\nPunishment for me is tryin' to let go\nGive it from your heart is what you taught me\nAddiction to pain is what it got me\nMy life, now it's changed\nMy life, ain't the same as you are\nHeartbroke to the point sometimes wanna end it\nIf I can’t have what mean most to me\n\n[Bridge 1: Dirty Money]\nSo many tears I cried (I cried)\nBut all for nothing I’m afraid to say\nOh, oh, oh\n\n[Hook: Diddy & Dirty Money & Drake]\nLovin' you no more\nI just, I can't, I just can’t be lovin' you no more (I can't)\nI love you more than I love myself\nLovin' you no more  (I can't) (Diddy)\nI just, I can't, I just can’t be lovin' you no more (no, no, baby) (Drizzy baby, uh uh)\nI love you more than I love myself\n\n[Verse 3: Drake]\nUh, tryin' not to over think\nOnly 'cause I drove and I've done had a lot to drink\nWhen I wanted it blue you said we got to paint it pink\nAnd there’s pieces of ya hair still sittin' in my sink\nAnd you still got underwear that’s sittin' in the dryer\nHow come every time that you’re suspicious I’m a liar?\nYou stand out, I can hear you whistle in a choir\nAnd that’s the only reason you the Mrs. I admire\nDamn. Tell me what I’m gon' do?\nSince everything that I’m trying to forget is all true\nMe and all your main girls get along too\nI would take my last dollar out and bet it on you\nBut uh, you see the same one I’m missing\nIs basically the reason I became something different\nAnd just that I remember me before\nAnd if you could do the same, baby, then we’d be for sure\n\n[Bridge 2: Dirty Money]\nSo selfishly, you can only show feelings\nWhen you feel yours in jeopardy\nOh, time, oh, time has changed and I’m no longer willing\nCan't you see how my heart is bleeding?\nI guess I…\n\n[Hook: Diddy & Dirty Money]\nLovin' you no more\nI just, I can't, I just can’t be lovin' you no more (no, lovin' you no more)\nI love you more than I love myself (no, no)\nLovin' you no more (I can't)\nI just, I can't, I just can’t be lovin' you no more (no, woah)\nI love you more than I love myself\nLovin' you no more (oh, no)\nI just, I can't, I just can’t be lovin' you no more\nI love you more than I love myself\nLovin' you no more\nI just, I can't, I just can’t be lovin' you no more (just wanna love you baby)\nI love you more than I love myself (just wanna love you baby)", "image": "https://images.genius.com/d0129f5c63f1ee10f591e6ce8849c5c5.500x500x1.jpg"}], "artist": "Drake"}