{"songs": [{"title": "Soldiers at War", "album": "The Calm Before the Storm: Part 1", "year": "1999-11-09", "lyrics": "[Intro: Tech N9ne]\nH.I.G.H.L.A.N.D\nHighland, nigga!\nHeartless Insane Ghetto Hoodlum Livin' And Never Dyin'\nThat's what I'm talkin' about\nRogue Dogs, when I call my Rogue Dogs\nRogue Dog, niggas, for the nine-eight\nWe'll have to crash 'em like this, nigga\nYeah!\n\n[Chorus: L.V.]\nMy nigga, my nigga, we're soldiers at war!\nKillin' off our enemies 'til it ain't no more!\nLaws we break, yo' shit we'll take!\nMurder for them bustas and hatas it ain't no escape\nRogue Dog for life!\n\n[Verse 1: Don Juan]\nIt's the beginning of the ending for yo' ass\nYou broke ass niggas hit the strip, we need mo' cash\nIt's Midwestside hittin' like a M-1 time to get some\nPayback fo you bustas that laid back\nMy gats ain't met yo next, so fuck yo vest, we dumpin'\nKillin' all that punk shit that you heart be pumpin'\nSee somethin' I take it cuttin' through the red tape\nYo legs break tryna catch up who who led the race\nIt's 57, high as heaven, causin' insanity\nWhatcha handin' me we'll have you bitch ass postin' the vanity\nPause, gotta recoop fuckin' with these troops\nSoon as we see you, load up and we shoot on sight\nTurnin' out the lights, my appetite for destruction\nGot me in the mood for bustin' dumpin' accross the Mizzou\nAnd get to huntin' for Kevin East the oo-oo\nAnd nigga you knew the Rogue Dogs rule\nYour so called truths get battered and bruised\nStackin' you fools so deadly it don't matter the tools\nI'm after my dues, prove if you snooze, you lose\nPrepare for war when you fuckin' with my crew\nRogue Dog for life!\n\n[Chorus: L.V.]\nMy nigga, my nigga, we're soldiers at war!\nKillin' off our enemies 'til it ain't no more!\nLaws we break, yo' shit we'll take!\nMurder for them bustas and hatas it ain't no escape\nRogue Dog for life!\n\n[Verse 2: Big Scoob]\n265 lbs. hog nigga\nAnd I'm good with these dawgs nigga\nGot steel plated balls nigga\nRepresentin' 57th street\nMe and my Dawgs bringin' the heat\nBorn and raised to be a villain on these Kansas City streets\nBest retreat when you hear my dogs barkin'\nSnarlin', got that blood boilin'\nMidwest side carved in hangin' out the Chevy now we blastin' and laughin'\nMade to hit me smashin' on them bastards\nDon't be talkin' when they ask you, shit got drastic on that bastard\nLeft him 'fo the cats that sent them straight to hell\nJust like hosts of veil another soldier's tale\nNigga the life of a coward was taken when we bailed\n\n[Verse 3: L.V.]\nLook I swore to die for bloodline\nMore heartless than my father brought (nigga)\nLoad the cartridges with hollow point hard ones\nWhen Rogue Dogs call it's an all out war move\n56 marks it 'cause 56 swore to\nHeartless insane ghetto hoodlum livin' and never dyin'\nMidwest side until my last breath on highland\nWhy should I lie? I live and die for my side\nRide the city 'til they roll with diddy one last time\nLet this nine yell out fuck 'em\nFuck 'em if he's no Rogue he's nothin'\nFuck where he's from he'll even run when I'm dumpin'\nRogue Dog fo life, no fear of death no more\nI swore to live a life a soldier at war\nRogue Dog for life!\n\n[Chorus: L.V.]\nMy nigga, my nigga, we're soldiers at war!\nKillin' off our enemies 'til it ain't no more!\nLaws we break, yo' shit we'll take!\nMurder for them bustas and hatas it ain't no escape\nRogue Dog for life!\n\n[Verse 4: Short Nitty]\nAre you afraid of the unknown brains get blown\nExpose chrome to your dome 'til you stiff as stone\nWith the phone neva suck it I'm goin'\nIn the pockets and blowin muthafuckas to smithereens\nYou knowin' that it ain't no niggas stickin' me like K-do\nBe warned I'm able to explode like a volcano\nOn y'all we told y'all we Rogue Dawgs\nWe know y'all this one is [?]\nFo' you bustas and hatas we gotta make that paper\nCan't break us then take us I'll peel you like a potato\nNigga wait a minute got me bustin' like a lieutenant\nMy intent is to eliminate you cynics\nRogue Fo' Life!!\n\n[Verse 5: Tech N9ne]\nThese young niggas always yellin' about ridin'\nBut these bustas ain't no muthafuckin' ridas\nI pumps the cock up in they bitch and then I'm slidin'\nThese wannabe hustlas can't compare to Midwest sidas\nI'm rollin' deep with my troopas finna expose the chrome\nDetrimental to domes though ozone\nThousands of bodies bein' found around me\nBottles of bud and W-double E-D\nN9ne milla, rhyme killa\nFuck with me I'll take that bust of myron D\nAnd throw 'em to my Dawgs in the red sea\nNow let's see if he can swim back to shore\nChunks missin' yellin': \"I don't wanna diss Tech no mo-ah\"\nI know you don't\n\"Tech N9ne - I never say it again\"\nNigga, I know you won't, never will these niggas lit on my friend\nAnd mister scarecrow, bitch nigga you ain't got to lie\nYou just a scared ho, nigga this is highland 'til we die\nWe got the triple life Cosa Nostra Rogue Dawg shit\nBitches and niggas all on the balls when it hit\nI never could understand how a nigga can come so whack\nWhat? Oh, I ain't talkin about me I'm talkin' about them other cats\nTroopa!\n\n[Chorus: L.V.]\nMy nigga, my nigga, we're soldiers at war!\nKillin' off our enemies 'til it ain't no more!\nLaws we break, yo' shit we'll take!\nMurder for them bustas and hatas it ain't no escape\nRogue Dog for life!\nMy nigga, my nigga, we're soldiers at war!\nKillin' off our enemies 'til it ain't no more!\nLaws we break, yo' shit we'll take!\nMurder for them bustas and hatas it ain't no escape\nRogue Dog for life!", "image": "https://images.genius.com/1d4a12a154c6cf30e77857bb018ab602.1000x1000x1.jpg"}], "artist": "Tech N9ne"}