{"songs": [{"title": "Nuttin’ to Do", "album": "Nuttin’ to Do / Scary Movies", "year": "1999-10-01", "lyrics": "[Intro: Royce Da 5'9\" + Eminem]\nWhat?\nUh\nThe Bad!\nYeah\nThe Evil!\nThe Bad, the Evil!\nPut 'em together...\n\n[Hook: Royce Da 5'9\" + Eminem]\nIf it wasn't for your whip, I'd have nothing to strip\nIf it wasn't for a wrist, I'd have nothing to slit\nIf it wasn't for the shrooms, I'd have nothing to chew\nI'm just fucking with you, 'cause I got nothing to do\n\n[Verse 1: Eminem]\nI came in the diner with skateboarders and placed orders\nAte hors d'œuvres and hit the waiter with plate warmers\nLet you inhale the Glock smell while I'm ripping your wallet off\nAnd slipping a Molotov in your Cocktail\nBurning your contracts punch your A&R in the face\nSmash his glasses and turn 'em to contacts\nI'm on some Suge shit, if it's missing I took it\nNurse, look at this straitjacket; it's crooked\nI go to jail and murder you from a cell\nPut a knife in an envelope and have you stabbed in the mail (FedEx)\nSo how do you describe someone with a decapitated head\nWhen the rest of his body's still alive running?\n\n[Verse 2: Royce Da 5'9\"]\nComing with five gunmen, waiting to do a drive-by\nSo when you see the black 500, hide from it\nFor every hundred emcees rhyming about birds\nOnly about two thirds really said it without words\nYo, you ain't a thug, I can make you bitch up\nPick the fifth up, cock, spit, you would swear it's raining slugs\nI'm the hottest shit in the industry\nI got every thug on the block that get a wind of me, defending me\nYou lack class and respect, get a direct backblast\nThe Bad and Evil mad rap, I cover the Bad half\nYou know how a thug in this shit'll end up\nSpit a round, lift your chin up, you get hit, ten down and ten up\nI take it if you run your mouth, then you wanna get sent up\nHeat it up, you be leaking blood and spitting phlegm up\nNow we rivals, 'cause of a small name or title\nYou stepped, got devoured and left with a flower and Bible\n\n[Hook: Royce Da 5'9\" and Eminem]\nYo, if it wasn't for your whip, I'd have nothing to strip\nAnd, if it wasn't for a wrist, I'd have nothing to slit\nIf it wasn't for the shrooms, I'd have nothing to chew\nI'm just fucking with you, 'cause I got nothing to do\n\n[Verse 3: Eminem]\nForget a chorus, my metaphors are so complicated\nIt takes six minutes to get applause\nAnd by the time you all catch on, I'mma end your career\nAnd walk away with the whole floor so you have nothing to fall back on\nI'll throw you off of ten floors\nPull a fucking headache outta my head, and put it in yours (Take this)\nI'm indoors, waiting for this acid to seep in my skin pores\nTo go outdoors and do some in-stores\nThis bitch wanted to blow me, I said it oughta happen\nYou swallow cum bitch? \"No, but I brought a napkin\"\nGetting skully while I'm autographing\nGot my daughter laughing 'cause I sent her mother whitewater rafting\nI'm not a fact, I'm a proven fear\nMr. Rogers blocked up my U-haul screaming \"You ain't moving here\"\nLorena Bobbitt, c'mere, want a souvenir?\nI've been high as fuck, since I was a juvi-neer\nJuvenile? Same difference, I need some 'caine\n'Cause I ain't sniffed since I woke up to seven slain infants\nBrain implants and they say there's a slim chance\nI won't stay the same 'cause I traded brains with a chimpanz'\n\n[Verse 4: Royce Da 5'9\"]\nWalking in swamp water with an M-16\nOut for the blood, shove a gun in the mouth of a thug\nTo break braces, you say grace and make faces\nI'll display hate and break you in eight places\nTake paces, turn around draw in a standoff\nPrecise aim, ice in my veins, blowing your hand off\nDancing with the Devil leading, I won't die, I'm never leaving\nI pledge allegiance to forever breathing\nStreet niggas with nuts, what? My meat's bigger\nFake-ass thugs with toy guns and cheap triggers\nWith a deathwish, thinking I'm the nigga to mess with\nLet the tech lift, direct chest hit, melt your necklace\nFor instance, you just a henchmen, on tough soil\nA follower never had heart, he just loyal\nThugs is glass doors, I see through 'em, put the heat to 'em\nBe careful you might get what you ask for\n\n[Hook: Royce Da 5'9\" and Eminem]\nYo, if it wasn't for your whip, I'd have nothing to strip\nAnd if it wasn't for a wrist, I'd have nothing to slit\nIf it wasn't for the shrooms, I'd have nothing to chew\nI'm just fucking with you, 'cause I got nothing to do", "image": "https://images.genius.com/ea6b18623746fe7fa4ec54a079b99a0b.600x600x1.jpg"}], "artist": "Bad Meets Evil"}