{"songs": [{"title": "Edge Of Da Night", "album": "Unleashed & Unreleased", "year": "1998-01-01", "lyrics": "The best of y'all niggas remind me of myself when I was younger\nWhen it was hunger that stopped the nigga from going under\nAnd you wonder, why I pat you on your head, smile\nLook in your eyes and thank the lord for my child\nMeanwhile, something I gotta show you an I hope you can take it\nGonna leave you in the desert, an I hope that you make it\nGotta put you on your ass to see what it does to you\nWhen you stand up an see that I'm just showin' love to you\nOther niggas would put a slug through you, over your ends\nCaps I fucked with are real, but hey\nThose are your friends\nIts just what you got coming sometimes you don't know\nWhat you asking for, did you ask for more?\nShould the casket door swing here, it is done\nAn thought you was a killer, you swore you'd never run\nNigga died with his gun still up in the holster\nIt is comin' in the air? Yeah its getting' closer\n\nI see life through many shades of grays and blacks\nI could take that an hit 'em with the blazin' tracks\nWhen I make that you fake cats have violent dreams\nTakes another dog to be able to hear my silent screams\nThe devil got a hold on me an he won't let go\nI can feel the lord pullin' but he movin' dead slow\nLet 'em know that amidst all this confusion\nSome of us may do the winnin'\nBut we all do the losin' its just who does the choosin'\nEasy goin up or down what have you been provin'?\nJus that you were fuckin' ground\nBitch seen the bullshit, but never spoke on it\nAn I know that deep down you really don't want it\nI woulda traded the chance of bein' the child with a father\nMovin' talent and bein' able to survive when its harder\nMy balance on the high beams of life, keep my dreams in strife\nThat's why I hit these motherfuckin' streets at night\nCome on!\n\nThere's a lotta shit that I let slide, cuz its outta my hands\nLotta niggas I let ride, but its not in my plans\nAn a lot of my mans is not seein' through the fog\nFamilies by the truckload, fleein' them to the morgue\nFull moon, arooooo, the howlin', grrrrrrr\nAn growlin', shhhhhh, an prowlin'\nDon't know love, can't show love\nThat means you gonna need more love\nThan on old thug, but hold up, roll up\nTalkin' out the side of your mouth is\nWhat's gonna is what's gonna let niggas know\nWhy you bad in your house, an they lie up to your spouse\nTold her it was suicide, but you an I\nBoth knew the truth, for we'd never die\nListen nigga, if you scared, get a dog, but be prepared, for the mob\nCuz you dead up in the fog, an that's your head by the log\nI can smell it in the air, I can tell when its there\nThis is hell an we both here\nCan you feel it? Tell me yeah", "image": "https://images.rapgenius.com/c048ed75e001e7462e2f3445177e4821.500x500x1.jpg"}], "artist": "DMX"}