{"songs": [{"title": "Should I Killer", "album": "Boiling Point: K.O.D. Collection", "year": "2012-10-30", "lyrics": "[Intro]\nTo the people I might offend with this song, forgive me\nIt's just, some sick shit that I was thinkin'\nWhen I was dealing with some real shit\nAnd it's called \"Should I Killer?\"\n\n[Hook] (x2)\nI can't hold her, I can't control her\nCould I? (Killer!) Should I? (Killer!)\nIf I can't grope her, I might as well choke her\nCould I? (Killer!) Should I? (Killer!)\n\n[Verse 1]\nThe condom busted, upon this fluff chick\nReally bomb and lust when vagina's thrusted and I'm disgusted\nCan't come in the club bitch, dumb nigga trusted\nI won't hit a gust quick, son should've clutched it\nWhat he spit, what he gunned this let it in her rump and erupted\nShe say she know no pill, she stay thinking on your scrill\nShe know you're sold your mill and you Tecca Ninna with the solo deal\nSo what you think she's thinking?\nIf you fertilize the pink one, sinking your linking\nNothing but the jinx, now I gotta write her off like an ink pen\nIf she fattens, she said that it won't happen\nSteady laughing at him, mashing, splashing ass, should've had it fastened\nNight is over now, she ain't showed around, town about a month\nAnd I gotta call saying she gotta tote around\nSomething extra from when I sexed her\nMy nigga, that's the, moment I had a heap, a whole plethora\nOf homicide thoughts... Can I kill her? Why not?\nCause if wifey find this out, she's gonna take everything I got, nigga\n\n[Hook] (x2)\n\n[Verse 2]\nKiller shit, I played it out, abortion, yes, I paid it out\nBut every time that I call to see if it's done, it's like she waited out\nLike, \"I got to be further along to get that\"\n\"Somebody's calling my phone, so hit back\"\nI guess I've been having a dome to click clack\nBone to pick, that's wrong to sit back\nAnd let yourself protrude from something else, no food\nWhat, you're gonna tell your dude that you're having my baby?\nWhat the hell? That's rude!\nBut you took my money and all my calmness from me\nBut you reassured me saying she's gonna be taken by her mommy\nWhen her mama took her, she said it kind of shook her\nWhen her mother cried and told her that God had wanted this baby to push her\nTo be a better person, read a verse, then yeah they burst in tears\nDead is certain, I ain't shed and cursed in years\nAnd as sick is here, make a nigga wanna drip a tear\nMan, this is fear, cause I already got kids and the missus near\nSo I'm vicious, steered, twisted admist this wicked sphere\nThink I'm gonna clip this weird chick\nReally quick and the bitch just disappeared\n\n[Hook] (x2)\n\n[Outro]\nIf I kill this woman, I gotta apply my stealth\nCause if my family finds out, wave bye-bye my wealth\nAnd if her family finds out, they're gonna make this guy cry help\nI guess it be way, way easier, for me to just die myself\n(Hey, just calling to let you know, everything's done, my mom took me)\n(You know, if you really loved me, you would have let me keep it)\n(Alright, talk to you later)", "image": "https://images.genius.com/b49e837c9c7732be929537953b47ac6e.700x700x1.jpg"}], "artist": "Tech N9ne"}