{"songs": [{"title": "The Last Assassin", "album": "The Cable Guy (Original Motion Picture Soundtrack)", "year": null, "lyrics": "[Phone Call]\nBueno\n?Como esta todo?\nBien, bien, que bueno, que bueno\n\n[Léon (background): The rifle is the first weapon you learn how to use, because it lets you keep your distance from the client. The closer you get to being a pro, the closer you can get to the client. The knife, for example, is the last thing you learn]\n\nBueno, a lo que estamos hablando, van a ser 50000 (cincuenta mil) bolas\n25 (veinticinco) ahora y 25 despues\nY a que usted agarre noticia de que Don Miguel ha muerto\nNos veremos en el centro de Los Angeles\nAha por la Pico y la Figueroa\n\n[B-Real]\nLookin' back in the days of my youth no doubt\nI didn’t have any role models kickin' the truth out\nSo who am I supposed to look up to?\n[Them Niggas] on the corner, or the boys in blue\nNow I had 2 choices, what could I be?\nDown with, runnin' with the pigs or the g's\nLet’s see, a pig ain’t done nothin' for me\nBut try to guide me to the penetentiary\nThe g’s on the other hand wanna see me\nCallin' shots in the hood, recruitin' homies\nEither way I’m [fucked] unfortunately\nSo I think I’ll roll with the neighborhood family\nG’s in the hood are influential\nPigs on the street are detrimental\nA g’s got stripes on his credentials\nGrowin' up ain’t easy in the Central\n\n[Chorus]\nIn the soul of the one holdin' the gun\nOf the Assassin, elimination, blastin', assassination\nThe lone hard core to the bone individual\nHighly advanced than your average criminal\nThrough the shadows I lurk through the alleys\nAnd rooftops, scoped and aimed at your brain\nUntil we meet in the next world again\nUntil the year 2000 come on in my friend\n\nAn O.G. told me how to make some ends\nTo get the Rolex and the phat [ass] Benz\nAll I gotta do is take out a few friends\nDisappear for a while then come back again\nI used to have to hit them with the long range shot\nIn time I got better in the closer I got\nThe last thing I learned was the knife in hand\nBlade to the throat, Oh, how I could kill a man\nYou could never understand how my mind works\nThe professional methods I use when I do dirt\nEnemies and adversaries on the contract\nNo combat, I catch them in their Z’s\n\n[Chorus]\n\nNo one ever knows how the cards get dealt\nIn the hands of the maker when you break yourself\nWhy do I do [the fuck] things I do\nNobody was ever there for me to talk to\nOnce I was youngster, pure and true\nNow I’m runnin' with the sick [ass] crew\nYou could never understand what I go through\nThere could never be another [nigga] fillin' my shoes\nSometimes I wonder how I made this far\nIn the gang set trippin'\nGivin' up the set I claim\nPigs lookin' at me and they wanna take aim\nBut I don’t give a fuck cause it’s all the same\n\n[Chorus] — [last line is different]\nUntil the year 2000 my friend", "image": "https://images.rapgenius.com/5b6ec31922d9da0ce4a7f15a2cd794fa.500x500x1.jpg"}], "artist": "Cypress Hill"}