{"songs": [{"title": "Lil Ass Gee (Eerie Gumbo Remix)", "album": "Bootlegs & B-Sides", "year": "1993-12-07", "lyrics": "[Lil Ass Gee]\nHell naw nigga fuck this\nNigga let me up out of here!\nNigga y'all can't take me to jail anyway\nI don't even know why y'all got me gaffled\nLook, fuck that, when my big homies find out about this shit\nY'all gon' be workin in Alaska, so dress warm motherfucker\n\n[Ice Cube]\nHahahaha, yeah\n\n\"This type of shit it happens ev-ery-day\" -] Slick Rick (2X)\n\n[Ice Cube]\nLook at that lil' ass Westside loc'ed out\nInsane-in-the-brain little nigga servin 'caine\nUse to have to ask could he cross the street\nNow he's rollin in a G, the G is on E\nHe's quick to hit you up with the two fingers spreaded (Wassup?)\nHe'll roll that shit (Wassup?) and hold that shit (Wassup?)\nNow you know what fuckin set he's claimin\nA wild little nigga and it ain't no tamin\nAnd just when you think everything is calm\nThat motherfucker is the first to bomb (like the)\nBang, ping, catch you with the sleeper\nHe'll draw down, and then check his beeper (fool)\nHe's clockin them chips and bucks\nGettin, his little dick sucked by the, clucks (yeah)\nAnd will he do dirt? Fool oh please\nLittle loc's are harder then the O.G.'s (that's right)\nYou fall to the ground and then bleed\nJust got served by little niggas on a 10-speed\nTwelve years old, got bumps they can't keep\nA straight killer, a fool, a lil' ass gee\n(a lil' ass gee) (a lil' ass gee)\n\n[Lil Ass Gee]\nHey, you little niggas need to get up out the spot man\nWhat, what nigga you think I'm a lil' punk or somethin?\nWhat you trippin for man?\nNigga fuck yo' life! {*BLAM BLAM, BLAM*}\n\nChorus: N.O. Joe Johnson\n\nWhen you run for yo' gun, just to save yo' life\nIt's just a .. little ass gee\nWhen you hatin on these fools on these motherfuckin streets\nI'm just a .. little ass gee\nWhen I step up on yo' ass with the shank\nNiggas know it's just a .. little ass gee\nJust a young motherfuckin tryin to clock my grip\nI'm just a .. little ass gee\n\n[Ice Cube]\nGod damn, it's a trip\nUse to have the G.I. Joe, with the kung-fu grip (yep)\nNow it's straight Crip, or Blood\nNow ya sag, you used the flood (mark)\nNow you're known as the baby Droopy (yeah)\nGoin to camp, and it ain't Camp Snoopy (Wassup?)\nBut I ain't surprised\nIt's 12 months later, yea, I see you got a little size\nYou motherfuckin crook\nYou want respect cause you didn't get'cha manhood took\nDrinkin that 'gac like it's no tomorr-y\nWestside hustler, fuck Atari\nBeen to jail, and it ain't no thang\nCan't wait til you get 22's on the hang (nigga look)\nA underage boy that's smokin' Thai\nAnd that's your idea of junior high\nAll you want for Christmas is guns and triggers\nLittle nigga nuttier than a Snickers\nYou don't wanna be like Mike, you wanna be like me\nA fool, a killer, a lil' ass gee\n(a lil' ass gee) (a lil' ass gee)\n\n\"Crazy motherfucker from around the way\" -] Cube (N.W.A.)\n\nChorus\n\n[Sampled interlude]\nWe have people, that have been conditioned\nNot to expect to live, beyond the age of 30\nThey no longer care\nOnce they no longer care, they're extremely dangerous\n\n\"I'm not afraid of bein shot\nCause that's the environment I grew up in\"\n\n[Ice Cube]\nSee, I knew it wouldn't be long (tell 'em)\nThey got yo' ass stretched like Stretch Armstrong\nIn the one-man cell, it got'cha thinkin\nSendin more kites than Benjamin Franklin\nTwenty years old but ya still a veteran\nWon't touch down til we're livin like the Jetsons\nProud of yourself, because ya done done it\nGotcha 22's and your name on your stomach\nNever even think about a woman to fuck\nRather stand in line to bust the ass of a young buck\n(Who's next?) Got stuck, now you're bleedin\nHospital ward, is got your reading\nLearn about the knowledge of self ya see\nGot ya mad enough to go and stick the deputy\nSee, it ain't about bein hard (that's right)\nBut that's whatcha tell the little homies on the yard\nYa already done did ten\nAnd wish you could start all over again\nBrand new inmates, and who do ya see\nYour baby brother in shackles, a fool, a lil' ass gee\n(a lil' ass gee) (a lil' ass gee)\nA fool, a lil' ass gee\n\nYo this go out to the little hardhead homies\nWho probably gon' see more uhh, asshole.. than pussyhole\nWhen they get you in that system, and I ain't trippin\n\nChorus", "image": "https://images.genius.com/bd986178756b67188db2d06a77696b78.1000x1000x1.jpg"}], "artist": "Ice Cube"}