{"songs": [{"title": "That’s Right", "album": "What’s My Favorite Word?", "year": null, "lyrics": "That's right...\nRight right right\n\n[Verse One]\nI know you love me, I'm like a habit\nBut if you had a million dollars, could I have it?\nIf I was broke and starvin, would you feed me?\nIf I drove a big car, would you see me?\nWhile I'm foldin yo' money in half\nIf you was holdin on down to yo' last\nYou know I need it, everything you got\nI gotta get it or we'll never see the top\nIf it was a Happy Meal, or a half-a-mill\nIt's the same thing baby, that's real\nDon't matter if you're holdin out, no doubt\nIf you fuckin Ludacris bitch, +Rollin' Out+\nWith a Chinese name, Won Gone\nPack yo' bags, and get the fuck on\nIt's understandable, why I do what I do\nGettin money every day and I'm still comin through, right..\n\n[Chorus]\nI'm a woman that'll hold you down\nWhen the other ones can't be fou-ounnnd, that's right\nI'm a woman that'll keep you rich\nWhen the others want you to tri-iiiick - that's right\n\n[Verse Two]\nI need team players, to roll with\nGet down with an O.G., knowin it\nWould you mix Hennessy, with Tanqueray?\nLet me fuck yo' best friend every day\nWould you walk from Compton to Hollywood\nFrom Richmond to Oakland I got it good\nFrom the Soul Train Awards to the Grammys\nFrom New York City to Miami\nIf I went to jail, would you bail me out?\nIf I went through hell, would you help me out?\nGet a king and have better things\nSell your grandmomma's wedding ring\nUnconditional love, would you donate yo' kidneys?\nI wanna know how much would you give me\nLet my dawg hit it, matter fact let us all get it\nBreak somethin off on it, right..\n\n[Chorus]\n\n[Verse Three]\nI woke up one day in the A-T-L\nWith a pocket full of money feelin way too real\nThinkin bout what happened 'fore I went to sleep\nI'd be broke if it wasn't for the pimp in me\nRead my mind, I want what you got\nTop down girl, bumpin 2Pac\nYou got too much money in your freak pants\nThat's why I keep my ladies in a deep trance\nFrom January to December\nShe can't remember, her mind's in a blender\nWake up in the back of a Caddy\nDon't even know who's your momma or your daddy\nThe name is Too $hort\nI'm addictive like Newports, but of course\nYou can fight the feelin if you want to\nBut this game might come back to haunt you, right..\n\n[Chorus]\n\n[Outro from \"Pimpin' Ken dot Com\"]", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}