{"songs": [{"title": "Hood Politics", "album": "To Pimp a Butterfly", "year": "2015-03-15", "lyrics": "[Produced by Tae Beast, Sounwave & Thundercat]\n\n[Intro]\nK-Dot, pick up the phone, nigga\nEvery time I call, it's going to voicemail\nDon't tell me they got you on some weirdo rap shit, nigga?\nNo socks and skinny jeans and shit, ha\nHa-ha-ha-ha-ha-ha-ha-ha-ha-ha-haha\nCall me on Shaniqua's phone!\n\n[Chorus: Kendrick Lamar]\nI been A-1 since day one, you niggas boo boo\nYour home boy, your block that you're from, boo boo\nLil hoes you went to school with, boo boo\nBaby mama and your new bitch, boo boo\nWe was in the hood, 14 with the deuce-deuce\n14 years later going hard, like we used to on the dead homies\nOn the dead homies\n\n[Verse 1: Kendrick Lamar]\nI don't give a fuck about no politics in rap, my nigga\nMy lil' homie Stunna Deuce ain't never comin' back, my nigga\nSo you better go hard every time you jump on wax, my nigga\nFuck what they talkin' 'bout, your shit is where it's at, my nigga\nCame in this game, you stuck your fangs in this game\nYou wore no chain in this game, your hood, your name in this game\nNow you double up, time to bubble up the bread and huddle up\nStickin' to the scripts, now here if them Benjamins go cuddle up\nSkip, hop, drip, drop, flip, flop with the white tube sock\nIt goes \"Sherm Sticks, burn this\"\nThat's what the product smell like when the chemicals mix\n50 nigga salute, out the Compton zoo, with the extras\nEl Cos, Monte Carlos, Road Kings, and dressers\nRip Ridaz, P-Funkers, Mexicans, they fuck with you\nAsians, they fuck with you, nobody can fuck with you\n\n[Chorus: Kendrick Lamar]\nI been A-1 since day one, you niggas boo boo\nYour homeboy, your block that you're from, boo boo\nLil hoes you went to school with, boo boo\nBaby mama and your new bitch, boo boo\nWe was in the hood, 14 with the deuce-deuce\n14 years later going hard, like we used to on the dead homies\nOn the dead homies\n\n[Verse 2: Kendrick Lamar]\nHopped out the Caddy, just got my dick sucked\nThe little homies called and said, \"the enemies done cliqued up\"\nOh, yeah? Puto want to squabble with mi barrio?\nOh, yeah? Tell 'em they can run it for the cardio\nOh, yeah? Everythin' is everythin', it's scandalous\nSlow motion for the ambulance, the project filled with cameras\nThe LAPD gamblin', scramblin', football numbers slanderin'\nNiggas names on paper, you snitched all summer\nStreets don’t fail me now, they tell me it's a new gang in town\nFrom Compton to Congress, set trippin’ all around\nAin't nothin' new, but a flu of new Demo-Crips and Re-Blood-licans\nRed state versus a blue state, which one you governin'?\nThey give us guns and drugs, call us thugs\nMake it they promise to fuck with you\nNo condom, they fuck with you, Obama say, \"What it do?\"\n\n[Interlude: Kendrick Lamar]\nObama say, \"What it do?\"\nObama say, \"What it do?\"\nObama say, \"What it do?\"\n\n[Chorus: Kendrick Lamar]\nI been A-1 since day one, you niggas boo boo\nYour homeboy, your block that you're from, boo boo\nLil hoes you went to school with, boo boo\nBaby mama and your new bitch, boo boo\nWe was in the hood, 14 with the deuce-deuce\n14 years later going hard, like we used to on the dead homies\nOn the dead homies\n\n[Verse 3: Kendrick Lamar]\nEverybody want to talk about who this and who that\nWho the realest and who wack, or who white or who black\nCritics want to mention that they miss when hip-hop was rappin'\nMotherfucker, if you did, then Killer Mike'd be platinum\nY’all priorities fucked up, put energy in wrong shit\nHennessy and Crown Vic, my memory been gone since\nDon’t ask about no camera blocking at award shows\nNo, don’t ask about my bitch, no, don’t ask about my Vogues\n'Less you askin' me about power, yeah, I got a lot of it\nI'm the only nigga next to Snoop that can push the button\nHad the Coast on standby\n“K. Dot, what up? I heard they opened up Pandora’s box”\nI box ‘em all in, by a landslide\nNah homie we too sensitive, it spill out to the streets\nI make the call and get the coast involved then history repeats\nBut I resolved inside that private hall while sitting down with Jay\nHe said \"it's funny how one verse could fuck up the game\"\n\n[Chorus: Kendrick Lamar]\nI been A-1 since day one, you niggas boo boo-\n\n[Poem: Kendrick Lamar]\nI remember you was conflicted\nMisusing your influence\nSometimes I did the same\nAbusing my power full of resentment\nResentment that turned into a deep depression\nFound myself screaming in a hotel room\nI didn't want to self-destruct\nThe evils of Lucy was all around me\nSo I went running for answers\nUntil I came home\nBut that didn't stop survivors guilt\nGoing back and forth\nTrying to convince myself the stripes I earned\nOr maybe how A-1 my foundation was\nBut while my loved ones was fighting a continuous war\nBack in the city\nI was entering a new one", "image": "https://images.genius.com/ffb1a13cfda120ba85ab9e2a83a4e158.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}