{"songs": [{"title": "Racks", "album": "Sorry 4 The Wait", "year": "2011-07-13", "lyrics": "[Verse]\nI can't fuck with ho niggas, I can't trust these hoes neither\nWake up early in the mornin', eat that pussy like cold pizza\nHatin' ass niggas be baller blocking, actin' like some goalkeepers\nThere's a reason for everything, but my niggas kill for no reason\nCamo shorts with a ho-beater, all-black hoodie, I'm Grim Reaper\nLook like it's time for spring cleaning\nBrand-new spanking streetsweeper\nBeen in the game, I'm knee deeper\nI like good head, I like good reefer\nAll my niggas strapped and ready to set it off, Queen Latifah\nGot a chopper with a drum, split Swishers with my thumb\nGet money like Donald Trump, double-barrel on that pump\nThis kush I got ain't no chump, get stupid and get stomped\nTwo guns, I call 'em Kriss Kross, Kriss Kross'll make you jump\nGotta do what a nigga gotta do\nGot goons, I ain't even gotta shoot\nGot a bunch of bad bitches by the pool, I like my bitches in twos\nGotta go, I stick it and move, G-code, I stick to the rules\nLast night I got so high I swear to God I went to the moon\nI'm on that shit you can't get nowhere\nYou pussy boy, don't go there\nIf I don't do nothing I'mma ball, no hair\nSmoking on that \"Oh yeah,\" my niggas tote that hardware\nWhat you 'bout, whoadie? My niggas 'bout that warfare\nReal nigga since day one 'cause I ain't promised day two\nThrow that pussy at me, bitch, I think I'm Babe Ruth\nDroptop Maybach on the way, yeah, that's that new Landaulet\nShe let me into her jungle, I'm gonna hit her with that rattlesnake\nGuns clap like patty-cake, Blood gang red bandana face\nMake them pussies pop they self, you can call that \"masturbate\"\nI don't front, don't fabricate, I get high, I gravitate\nWeezy F. Baby, bitch, the \"F\" is for Fascinate\nLouisiana, I'm from that swamp, I'ma pull this bitch out and dump\nBetter run like Forrest Gump, fuck you and where you from\nThree, Two, I am the One, job well done\nI ball 24/7, 3-6-5, twelve months\nWhat's up Redbone? What's up Caramel?\nCome to Wayne's World, it's a fairy tale\nYeah I'm high, bitch; bitch, I parasail\nCarter 4 is late, sorry for the wait\n\n[Outro]\nThank you", "image": "https://images.genius.com/a22efe31e108ac84ea44f489ff2716f3.320x320x1.jpg"}], "artist": "Lil Wayne"}