{"songs": [{"title": "The Pinkprint Freestyle", "album": null, "year": "2016-09-04", "lyrics": "[Pt. 1]\n\n[Intro]\nI'm talkin' 'bout my brand and you talkin' 'bout your brands\nThe difference is a lot of MMMMMMMMMMs to your couple hundred grand\nYoung Money!\nShout out to Lil Wayne for signing a lil chick from Queens\nNew York City\n\n[Verse 1]\nYoung ma, it's the female Jay\nI'm a brand accordin' to what retail say\nYeah my tours be sellin' out on presale day\nPlus I got the title queen stream, press replay\nTestified for my nigga to the DA's face\nOne time for this super old PA case\nI'm still schoolin' bitches like GA State\nAnd I'ma still ball, call me T.D. Jakes\nBars for years, niggas thought I did a bid\nI'm draggin' these hoes like Harambe did the kid\nShut the club down, it was poppin' then we slid\nI call my pussy liquor, I ain't talkin' 'bout a swig\nBut if you thirsty, I own a sangria\nShout out to Fox Brown, I don't mean Pam Grier\nI got a sign that say \"Lames can't hang here\"\nBats eyelashes, blank stare\nHe be like, \"You came?,\" I be like, \"You came?\"\nHe say my ride game smoother than a Muslanne\nEvery time they count me out I be like, \"You sane?\"\nBitch I come back like Jordan in his flu game\nEvery time I shoot it, it be all net\nI give him ostrich, that mean all neck\nAnything he need, I got on deck\nAnd go to sleep playin' with his ballsack\n\n[Verse 2]\nHahahah... Aaaaah! Rrrrrr...\nThey wanna know my recipe\nThey know I ball like the niggas at the ES-PYs\nStrung out on the pussy so I call her Crystal Methanine\nShorty tryna give me brain like telepathy\nAyo Sinceré, get Chanel bags\nGot a bitch lookin' like Chanel ads\nChillin' out in dem Beverly Hill pads\nI gave bitches time but they still mad\nSi, está loco\nIf my bitch don't like you, yo tampoco\nMe Dorothy and you Toto\nNow put some marshmallows in my cocoa\n[Sips] Mmm.. Tastes good... Hahah...\nYo, don't ever talk about Nicki in the past-tense\nUnless I fly pass that ass in a fast Bent'\nFuck outta here you dumb bitch\nYou know I'm pretty, and I'm witty, and I'm dumb rich\nYou throw shade, but I sun bitch\nAnd now you know what I'ma say, you my son, bitch\n\n[Outro]\nYikes, yikes, yikes, yikes...\nKeep me rollin', Juice..\nHold on, hold on, keep me rollin' Juiiiiice..\nLike I ain't make all these bitches want a fat ass at some point\nHahahahahaaaaa\nLike I ain't make these bitches rock pink hair at some point!\nHahahahah! Rrrrr! Oh my God!\nWait, God is good\nLemme, lemme testify, God is good\nShoutout to my fans, I love y'all so much too\nI miss y'all so much too\nOoouuu! Hahaha\nOoouuu! Uh!\nLike I ain't make a lot of bitches start spitting metaphors and all of that\nMm, queen back...\n\n[Pt. 2]\n\n[Intro]\nUh, uh, uh, uh ,uh\nTurn it up, turn it up in my ear, Juice\nMm, okay, uh, hahahaha, uh\nThis is only for my bad bitches, okay\n\n[Hook: Shabba Ranks]\nTing-a-ling a ling, dancehall it swing\nDJ head stuck up when dem hear boom riddim\nTing-a-ling a ling, schoolbell it ring\nKnife and fork ah fight fi dumplin\nTing-a-ling a ling, dancehall it swing\nDJ head stuck up when dem hear boom riddim\nTing-a-ling a ling, schoolbell it ring\nKnife and fork ah fight fi dumplin\n\n[Verse]\nUh, uh, uh\nI fly like paper, I get high like planes\nIf you catch me at the border I got visas in my name\nI got visas in my name, I got visas in my name\nIf you catch me at the border I got visas in my name\nTh-this is my reign, que-queen is my name\nYou, dutty gyal, nuh dare in my lane\nWatch unu mouth, wa-watch what unu say\nThis is my game, so watch how unu play\nM.I.A., M.I.A., I make bitches go M.I.A\nM.I.A., M.I.A., I make bitches go M.I.A\nM.I.A., M-M-M-M.I.A., I-I-I make bitches go M.I.A\nM.I.A., M.I.A., I make bitches go M.I.A\nRrrr\n\n[Hook: Shabba Ranks]\nTing-a-ling a ling, dancehall it swing\nDJ head stuck up when dem hear boom riddim\nTing-a-ling a ling, schoolbell it ring\nKnife and fork ah fight fi dumplin\nTing-a-ling a ling, dancehall it swing\nDJ head stuck up when dem hear boom riddim\nTing-a-ling a ling, schoolbell it ring\nKnife and fork ah fight fi dumplin\n\n[Outro]\nI'm talkin' 'bout my brand and you talkin' 'bout your brands\nThe difference is a lot of MMMMMMMMMMs to your couple hundred grand\nMm, c'mon! Kyuh", "image": "https://images.genius.com/f529ac9662b35e2329569405824cf03a.1000x1000x1.jpg"}], "artist": "Nicki Minaj"}