{"songs": [{"title": "Soldier", "album": "No Mercy, No Fear", "year": null, "lyrics": "[50 Cent and DJ Whoo Kid talking]\n\n[Hook]\n(I'm a soldier) G-UNIT! I started my own gang\n(I'm a soldier) G-UNIT!\n(I'm a soldier) G-UNIT! I started my own gang\n(I'm a soldier) G-UNIT!\n\n[50 Cent]\nIt's a fact homie, eagles don't fly in flocks\nBut the eagles I got hold sixteen shots\nLike beefin', homie I ain't sayin' a word\nI'll run up on your punk ass squeezing the bird\nNow what New York niggas know about country grammar\nNot much, but we know how to bang them hammers\nWhen I pull out that thing, you better break yourself\nOr win a trip to ICU, and you can take yourself\nIf you lucky motherfucker, I'm solider I told ya\nPush ya shit back, put my knife through ya six pack\nGat bust, adrenaline rush, blowin' the dust\nFive point O, burnin' the clutch, while I'm burnin' the dutch\nYou thought them other niggas was hot, I'm turnin' it up\nThis the blueprint, nigga are you learnin' or what\nYou done told them you respect me, now tell them I'm the nicest\nAdmit it nigga, I'm a mid-life crisis\n\n[Hook]\n(I'm a soldier) G-UNIT! I started my own gang\n(I'm a soldier) G-UNIT! (I got the rep of a villian, the weapon concealin')\n(I'm a soldier) G-UNIT! I started my own gang\n(I'm a soldier) G-UNIT! (full of controversy until I retire my jersey)\n\n[Lloyd Banks]\nIt's like niggas rate the respect of who gat bigger\nBanks been blowin' on purple stuff before that fat nigga\nPennies make dollars, and dollars make death threats\nI'm doin' remixes to bulletproof the Lex next\nDuck nigga, everyday's war\nI'm heavy on sports, so my drawer's like the NBA store\nDon't make me send the piece at you\nI'll have your man walk around with another rest in peace tattoo\nLook creampuff, you can get killed here\nNigga you ain't invincible, even Superman in a wheel chair\nI've always been a picky man, but I ain't a flowered star\nSo I'mma fuck all fifty fans\nLook, whether you like it or not, right in ya spot\nAll in your grill, wearin' the crown, airin' em down\nWe're in the pound puttin' fear in the clown\nI'm running with gangstas, don't make one of em shank ya\n\n[Hook]\n(I'm a soldier) G-UNIT! I started my own gang\n(I'm a soldier) G-UNIT! (I got the rep of a villian, the weapon concealin')\n(I'm a soldier) G-UNIT! I started my own gang\n(I'm a soldier) G-UNIT! (full of controversy until I retire my jersey)\n\n[Tony Yayo]\nI'mma ride with my rap shit and my body armor\nRide like a Taliban suicide bomber\nFour five six feet, I off ya feet\nI kill ya with a pillow when you fall asleep\nYour records can't sell, your company is buyin' em\nGive it up, Burger King is hirin'\nYou shoulda been a cop, cause you snitch a lot\nTalkin' to the jakes, you bound to get shot\nI used to watch Big Bird and Scooby Doo\nNow I'm choppin' big birds and them bundles too\nFor that Master P money, that shoppin' spree money\nThat coke, that dope and that ecstasy money\nI'm tryin' to build empires across the state line\nSo move like vampires, never see me in the daytime\nI jump out with a nina and a mack\nI have you like Khia, my neck, my back", "image": "https://images.genius.com/bd2b4854454a895a49da3fbb67e2d805.953x946x1.jpg"}], "artist": "50 Cent"}