{"songs": [{"title": "The Only Way", "album": "Greatest Hits from the Bong", "year": "2005-12-13", "lyrics": "[Hook]\nSometimes I think about the only way that I'll ever see life beyond L.A. is dying\nSometimes I think about the only way that I'll ever see life beyond L.A. is...\n\n[Verse 1: Sen Dog]\n\nOnly way out is in a bag I figure\nYou ain't leavin' me, you lil punk ass nigga\nOnce you down for me, you down for life\nWe stay hustlin fool, keep the family tight\nWe run business, snow out witness\n[?]\nThat's why I only love to control it\nLove for my hood, and the niggas that I roll with\n\n\n[Verse 1: B-Real]\n\nI love LA, but it's a jungle\nWe come from the darkest corners, where all the street kids rumble\nGet their hustle on and hold dice in the bundle\nStumble on the red, some can't stay humble\nMany catch cases of leather, pressure, they crumble\nWill pigs catch 'em, they bound to catch a couple\nStreets of hot lead sure enough, will make you tumble\nNo names attached, they could put you out with one blow\n\n[Hook]\nSometimes I think about the only way that I'll ever see life beyond L.A. is dying\nSometimes I think about the only way that I'll ever see life beyond L.A. is...\n\n[Verse 2: B-Real]\n\nFrom eastside to the valley, raw dogs all over LA, here represent Cali\nLowriders and hot women, what you tell me?\nWe're ballin' out here and the weed is so smelly\nDon't slip or you can get drugged through the alley and violated for credit, get stuck in your belly\nCause it's all about survival\nBetter learn it quick, or you might get wet on arrival\n\n\n[Verse 2: Sen Dog]\n\nI got ways of dealin' with my own\nThat's better off not spoken or shown\nHot-head city when I bring the anger\nHeat on the street in the form of gangbangers\nThis side of earth don't forget, chew you up and spit you out like...\nLegal bill and it stung like hell\nHunt your ass down to the graveyard [?]\n\n[Hook]\n\nSometimes I think about the only way that I'll ever see life beyond L.A. is dying\nSometimes I think about the only way that I'll ever see life beyond L.A. is...\n\n[Verse 3: B-Real]\nAs a young buck growin' up in the Angel City\nCaught a glimpse of life, together, will ya say it with me?\nWas an outlaw for so many years, some in tears\nCome reminiscin' about the homies who ain't here\nEscape the street karma, no matter what deep harm, I could never catch sleep\nYou know everyday gets much harder\nWill set up and get product or set up and get shot up\nIf you wanna survive, better have the street knowledge\nRappers, actors, gangstas, ballas\nWatch stars, cop cars, we pop collars, chop dollars\nBetter have that shit on lock, you got a fat wallet\nSo you might have a braveheart like Will Wallace\nWith a chip on your shoulder, I'm [?] freeze\nI'm the coldest nigga in the streets to trigga' with these, assault you, nigga\nI know life's cold and bitter when you're all alone and ain't nobody running with ya'\n\n[Hook]\nSometimes I think about the only way that I'll ever see life beyond L.A. is dying\nSometimes I think about the only way that I'll ever see life beyond L.A. is...", "image": "https://images.rapgenius.com/c4601a13b57b410039a75b79a9e8e313.500x333x1.jpg"}], "artist": "Cypress Hill"}