{"songs": [{"title": "500 Degreez", "album": "500 Degreez", "year": "2002-07-23", "lyrics": "[Lil Wayne talking]\nIt's the real shit, yeah\n500 Degreez this time biotch\nYes sir, you already know\n\n[Lil Wayne verse 1]\nYou see me? I eat, sleep, shit, and talk snaps; so fuck rap\nMan I got weed, pills, pistols, all crack\nBitch niggas where ya hearts at?\nYa'll ain't stuntin' like us\nBitch niggas where ya cars at?\nThey like, \"Wayne why the fuck you dressed in all black?\"\nI'm about to bring CMR back\nAnd all the lames, we done lost that\nAnd all we got is Weezy, Weezy, and Lil' Weezy to fall back\nI'm about to lock it from the summer to the fall and back\n\"Its Weezy baby!\" The ballers back\nAnd the wheels on my car you got all of that\nStop playing, I've been balling jack\nYou don't want my Glock spraying - I hit all them cats\nYou don't want my stomach ache - I shit on them cats\nI get all them gats - Fresh and B it's all a rap!\nIf I'm the only Hot Boy what do you call that?\n\n[Hook]\nYou don't want to fuck with Weezy\nYou don't want to fuck with Weezy\n\n[Lil Wayne]\nBitch what? I'll bust ya ass up\nDon't even go there round\nNiggas get your cash up\nWe probably need to clash up\nAnd shit got me 'bout ass up\nThey finding niggas in they shit with they ass up\nIt ain't October 31st but we gone mask up - and guess what\nAnd I heard they got a nice chain\nAnd for the right price I'll bust the right brain\nAnd mommy hot cause pull up in that white thang\nYo nigga might be fly but I still get trifling\nRiding through the city just me and my friend\nFriday night special, professional tight aim\nA gangsta is who you hearing\nMe in my building with 20 bricks in the ceiling\nI'm more real than, I got more scrill than\nGot more skill than them there\nI'm a Cash Money Millionaire\n\n[Hook]\nYou don't want to fuck with Weezy\nYou don't want to fuck with Weezy\nHot Boy, Hot, Hot, Hot Boy, Hot, Hot, Hot Boy\nHot, Hot, Hot Boy\n\n[Lil Wayne]\nBaby let me get the keys to the rover\nNo, let me get the keys to the house in Eastover\nSo I can throw a 500 Degreez platinum party, then the after party\nMe and my Squad stomping in this bitch, fuck a Kappa party\nDon't go to rapper parties - I'm no rapper man\nBut when the homies come home we throw a monster jam\nAnd all my people tote chrome - we some monsters man\nWe gone mob to the promise land\nI bought big - I'm a Tymer man\nSon of a Stunna - still a girl fuck with a hustler!\nWeezy keep it gutter for ya Baby Bubba\nBaby blue Mercedes Coupe - Got it bullet proof\nMake me shoot my 80 duke at your fucking roof\nYou're fucking with a big dog, nigga fucking woof\nMr. S-Fucking-Q - I'm the fucking truth\nThree stripes, maybe Nikes, lot of ice fucking ooohf!\nThat's 500 Degreez!\n\n[Hook]\nYou don't want to fuck with Weezy\nYou don't want to fuck with Weezy\nHot Boy, Hot, Hot, Hot Boy, Hot, Hot, Hot Boy\nHot, Hot, Hot Boy\nBitch get your mind right, Bitch get your mind right", "image": "https://images.genius.com/87a5f9b0e354a8eb9ed86d0a62eb8273.400x400x1.jpg"}], "artist": "Lil Wayne"}