{"songs": [{"title": "War Ready", "album": "Mastermind", "year": "2014-02-08", "lyrics": "[Produced by Mike WiLL Made It]\n\n[Pre-Intro: Skit]\nSentence should now-now be pronounced I'll ask that you stand for sentence, please. Mr. *** it is the sentence of the court that your custody be committed to the department of corrections for confinement of the *** state prisons without possibility of parole for the remainder of your life. You may be seated\n\n[Intro: Rick Ross]\nWar ready\nYou got shooters, I’ve got shooters\nWe’ve got money\nLet’s do what them other niggas can’t do\nMastermind, uhh, uhh\nNigga got a thousand guns, nigga (Dade County)\nIf money is power, nigga, then I’ve got millions of power, nigga\nHahaha! (Miami shit)\nFuck with me nigga, huh?\n\n[Verse 1: Rick Ross]\n17 I was chargin' niggas 17\nRidin' clean, youngest nigga in the Medellín\nBomber green, in that thang, in the middle lane\nDid some thangs for my niggas which I can't explain\nVersace slippers, 20 chains, bitch I'm Dana Dane\nPut a patch over your eye, fuck with my petty change\nFuck what you heard, for that bird I'm a dirty nigga\nLaid to rest by the one you thought was workin' with yah\nWar ready, the game just wanna take my life\nWar ready, pussy boy we all could die tonight\nWar ready, fast cash above the law\nWar ready, gas mask when them choppers talk\n\n[Hook: Tracy T]\nKillas on front line when you're war ready\nChopper shoot a thousand rounds when you're war ready\nJust another mama cryin' when you're war ready\nJust another homicide cause we war ready\nKillas on the front line when you're war ready\nChopper shoot a thousand rounds when you're war ready\nJust another mama cryin' cause we're war ready\nJust another homicide when you're war ready\nWhoa, whoa, whoa!\n\n[Interlude: Young Jeezy]\nA coward dies a thousand deaths, a real nigga dies but one\n21 gun salute out of the top of your drop top coupe\nI know a lot of niggas gon' hate to see this\nYeah I wish Shake could see this\nI'll never fall for what I stand for\nThis here for Nando\nWe could live today, blood, and die tonight, cuz\n\n[Verse 2: Young Jeezy]\nBox Chevy hit the block, run the whole 50 shots\nYou just poppin' 'til you know you can't pop 'em no more\nWe done came through the block in so many colored drops\nAnd these mothafuckas think you can't drop 'em no more\nWar ready, a nigga put some change on your head\nDamn right, fuck around, clear my safe out\nI got a few digi scales and a couple Denzels\nAnd you mothafuckin' right, this a safe house\nGive me the K and a shovel, I'll bury that nigga\nBe his pallbearer, so I can carry that nigga\nWhat you gonna hit him with, the Glock or the chop?\nLook I wouldn't give a fuck if they were sharin' that nigga\nYou mothafuckas out here always talkin' 'bout what another mothafucka said\nYeah, I got that FNH with that mothafuckin' Fendi holster\nI ain't out here to mothafuckin' play\nWhy these fuck niggas always cryin' 'bout somethin'?\nEither you're livin' like a ho or you're dyin' 'bout somethin'\nTry to let that Rollie breathe but it's hidin' in my sleeve\nLike that motherfucker timid or shy about somethin'\nTomorrow ain't promised, nigga roll up that weed\nGotta stay strapped to live the life I lead\nStart your own alphabet with all them G's\nOpen up a hundred doors with all them ki's\nYeah we live for them coupes but we dyin' by the gun\nMissed his court date, now my nigga on the run\nBig shit poppin' and it's sparkin' like a lighter\nShit bag leave a grown nigga in a diaper\nHangin' out the Rolls, on your mark, get set\nLet it go, yeah hold that bitch steady\nWhen adrenaline get to rushin' and them drums get to bussin'\nYeah I hope you pussy niggas war ready\n\n[Hook: Tracy T]\nKillas on front line when you're war ready\nChopper shoot a thousand rounds when you're war ready\nJust another mama cryin' when you're war ready\nJust another homicide cause we war ready\nKillas on the front line when you're war ready\nChopper shoot a thousand rounds when you're war ready\nJust another mama cryin' cause we're war ready\nJust another homicide when you're war ready\nWhoa, whoa, whoa!\n\n[Verse 3: Rick Ross]\nFollow in my footstep, I was born to die a soldier\nNigga couldn't walk a mile, found him naked in his Rover\nShout out to the Vice Lords, shout out to my Blood nigga\nShout out to them GD's, where that Crip love, nigga?\nShout out to them dopeboys, owe it to the plug, nigga\nI could die a thousand times, will never die a fuck nigga\nShoutout to my city, too, my clip hold a 62\nRidin' down on 63, rest in peace to Fluty Coupe\nHeroin and quinine\nCut that bitch a thousand times\nPhone call said he need a brick\nI text him back, \"Come stand in line\"\nYou went out of town so I had to wack your bitch\nNever came back, pussy boi, go die a bitch\n\n[Hook: Tracy T & Rick Ross]\nKillas on front line when you're war ready (War ready)\nChopper shoot a thousand rounds when you're war ready (If you ain't ready to die about it)\nJust another mama cryin' when you're war ready (Don't even mention it to a nigga like me, baby)\nJust another homicide cause we war ready (I went from nothing, nigga, to $60 million, nigga)\nKillas on the front line when you're war ready (Walking around in my motherfuckin' Belaire Rosé )\nChopper shoot a thousand rounds when you're war ready (Evander Holyfield's estate, nigga, ($6 million in marble, $2 million in drapes, $25 million, nigga)\nJust another mama cryin' cause we're war ready (Another 5 in chandeliers)\nJust another homicide when you're war ready (230 acres, nigga)\nWhoa, whoa, whoa! (That's just one of the many properties, nigga)\n\n[Outro]\nWar ready\nIf you ain't ready to die about it\nDon't even mention it to a nigga like me, baby\nI went from nothing, nigga, to $60 million, nigga\nWalking around in my motherfuckin' Belaire Rosé [?]\nEvander Holyfield's estate, nigga\n$25 million, nigga\n$6 million in marble, $2 million in drapes\nAnother 5 in chandeliers\n230 acres, nigga\nThat's just one of the many properties, nigga\nWar ready\nAnd I'm down to die 'bout that\nWe gon' ride 'bout that\nSo you know we ready to slide 'bout that\nCut that check, nigga\nWhatcha money like, huh?\nIt's hard to go to war with $70 million, nigga\nRead the obituary, nigga\nPrint that motherfucker in Italian, nigga\nWhat's a hassa?\nWhat's a hassa?\nThat's you, haha\nI'm not gonna kill you, though, haha\nI'm not gonna kill you, though, haha\nHey Black, kill this motherfucker", "image": "https://images.genius.com/19f55ffc401c826cd6d01bd3253f1158.1000x1000x1.jpg"}], "artist": "Rick Ross"}