{"songs": [{"title": "Crackers And Cheese", "album": null, "year": null, "lyrics": "[Intro]\n\"Other man!\"\n\nI stand in slapped by the wind as I begin\nDo you know who I am? And many reply with a grin\nYes, I'm tired of being obtruded\nWhy should I be secluded? I've got a brand new horn to be tooted\nTo sum it up in a nutshell, \"Eminem will you kick it for me?\"\nSo I find myself in a certain obligatory\nA place that I dwell in, fell into some wonderful productions\nTo make up for lost time, and then it brings obstruction\nFinally let loose, unloading the stockpile\nA mental projectile, I aim at the reptile\nI look to the one handed juggler and ask him this\n\"Why is it you insist upon stepping to an octopus?\"\nIs there a reason for this? The hindrance is aggravating\nHow many times will it take you before you realize you're fading?\nFading from existence, cause simulations are dead\nThere's so much more to learn and pages left to be read\nSo put up the front while you jam for the grammar that's poor\nWhile I hold the scrapbook that's heavier than the hammer of the mighty Thor\nWords can weigh a ton\nTherefore it's never to fall into the hands of the wrong one\n\n[Scratched samples] - \"Yeah\", \"It's another\n\nVery few have made an attempt to put in a foot on the other side\nBut I see no borderline, from under this colorblind\nAnd some will probably never hold pieces of the sacred\nBut then I'm finally about to put an end to the hatred\nWrong, the world would never endure to arguing\nAwaking to the absence of unity is startling\n\"Oh foolish pride, what the hell are you trying to do?\nYou cannot beat someone that's better than you so quit trying to\"\nYour echoing words that mean nothing are despicable\nSo how do you think you can manage to kick the unkickable\nYou're graceless, bland, you're tasteless and you're faceless faceless\nDamn, you're dull it's time you faced this, here taste this\nStraight from off of the pile, one of the numerous styles\nThe date of my birth on the Earth, the deliverance of a starchild\nBlessed with formidable talent and versatility\nBut with such a power, there comes a responsibilty\nTo infringe on the boundaries, so now the defiance is clear\nTo form an alliance is something even the giants fear\nSo instead of being oblivious to the color of skin\nRefusal of usin' is accepted now it's a trend\n\n[Scratched samples] - \"Yeah\", \"It's another...\"\n\n[Eminem]\n\nYou know I don't understand why we all just can't get along\nYou hate me but you know me and what I stand for\nNo. so then why do you speak for me\nAnd every other white man when you that we're your enemy?\n\nOn the floor lies a broken door, cause I'm not to be spoken for\nStereotypes and superstitions and fictional folklore\nRarely do you see the lighter side of me\nI try to be persuasive but also invasive and try to end the rivalry\nBut ? is isolated, apologies are exhausted\nFeelings are turning glacial never to be defrosted\nWho can I trust after repeatedly being shafted\nSwitch to the opposite, now scenes are being re-enacted\nPull up that boy by his roots, destroy him quick\nHis fracture's obviating, we hate him, his patterns past us, huh\nAlways fighting for the position of top dog\nThat spot's already occupied, and I don't play leapfrog\nCause I do not wish to fight over territory that's already mine\nBut I'm always having to prove myself, time after time\nOh how I never understand how a man could be outcast\nJudged from the past and he's put last\nAnd others with nothing to say\nStutterin' and slurrin' and mutterin' words with no meaning attack be signin' like Danny Kaye\nHere I go again hammerin stammerin grammerin\nAnd eat it like cheese, pass me the crackers please\nI've got a craving", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}