{"songs": [{"title": "My Mind Is Playing Tricks On Me", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2009-01-01", "lyrics": "[Intro: Scarface]\nI sit alone in my four-cornered room\nStarin' at candles\nOh, that shit is on?\n\nYeah, Aye, Aye-o At Night I Can't Sleep,I Toss And Turn\nI Get Lost For Words,Its Like I Lost My Nerves\nIt All Started With My Chick About A Bitch That I Hit\nThat I Swear Ain't Shit,But She Swear I Ain't Shit\nAwww Man Lord Help Her She Can't See What Im Sayin\n'Or Hear What I Tell Her\nIt Feel Like Im Talking To Helen, Keller\nI Wish That She Could Understand Me,Like A Shelter\nI Called Her Up And Said Im Tired Of Beefin'\nTold Her Im Leavin' And That Shes Not Needed\nShe Said Oh So You Just Done With Us, I Love You Doe\nYeah Well That Makes One Of Us And Hung Up\nI Got Tired Of My Living Room Decor\nThen Headed To The Liqour Store To Get Liqour\nSwishor And A Stickor,And Then Pull A Lift Off\nTil I Buzz Like Clipors And Pose Like A Clip Board\nI Then Go Somewhere I Had No Business\nEr'body Hands Up So It Wasn't The Question\nI Started To Dippin' , It Take A Man With A Wooden Cane In The Air\nTo Reconize A Stick Up\nHell Yeah The Niggas Tried To Hit Me\nBut Off A Whole Round Swear To God They Just Missed Me\nThen The Police Sirens were Roarin\nThey Took What They Saw Then Went Out The Back Door\nShit I Hoped Off The Floor Tryna See Which Way They Went\nMad Than A Motherfuckin' Bitch\nWalked Back In To Make Sure Er'thang Was Cool\nLooked On The Floor Saw Blood By The Pool\nSo I Asked The Clerk Dude Whats The Trouble\nNo Response but His Face Seemed Puzzled\nI Walked Towards The Huddle To The Front Of The Crowd\nAnd Thats When I Saw Myself Strecthed Out\nSee It Wasn't Til I Say My Own Body\nThat I Realized Them Pussy Ni***s Shot Me\nMan I Couldn't Even Tell My Bitch I Love Her\nMan I Couldn't Even Kiss My Mother\nAin't That Some Shit Homie?\nMy Mind Is Playin' Tricks On Me", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg"}], "artist": "Big Sean"}