{"songs": [{"title": "Look At Me Now", "album": "Delusions of Grandeur", "year": "2019-06-21", "lyrics": "[Intro]\nTay Keith, fuck these niggas up\nTake off\n\n[Verse 1]\nSaid I was bad, now I'm rich, they say I'm nice now\nThe royal treatment what I get when I bring my wife around\nInvited to exclusive events, yeah, that's my life, clown\nFirst they was scared of me, but now they all feel safe now\nSaid I was ugly, but she can't stay out my face now\nOoh, how they lovin' me, man, this industry so fake, wow\nThey call me Mr. Clean because I put that lean down\nI'm writin' checks, I'm payin' tax, my money clean, clown\nUpgrade the sixty carat ring for the queen now\nI had to cop the four-door Phantom for the king now\nYou know the team 1017 shine when the lights out\nThey tryna surf on Guwop wave but they wiped out\nThey had to cool the crowd off, brought the ice out\nThey thinkin' I'ma pipe it down, but they psyched out (No)\nThey say I'm bad 'cause I'm rich, yeah, I'm nice now\nI'm a legend in this shit, I've been nice, clown (It's Gucci)\n\n[Chorus]\nI was down for a second but I'm up now\nI had to turn my life around, yeah, I fell down\nWent through hell to get here, but I'm up now\nIn cold cells, I shed tears, but I'm up now\nI was down for a second but I'm up now\nI had to turn my life around, yeah, I fell down\nI went through hell to get here, but I'm up now\nIn cold cells, I shed tears, but I'm up now\n\n[Interlude]\nNow\nIt's imperative that I change the narrative\nHaha\n\n[Verse 2]\nLook at me then, look at me now (Look at me now)\nSay you my friend, but tell me how? (You not my friend)\nKicked, I was down (When I was)\nYou been talked down\nCan't come around (Can't come around)\nYou're not my round (You're not my round)\nSee through the grin\nKnow it's a frown (Know it's a frown)\nBack on the town\nGive me my crown (Give me my crown)\nLook at me now (Look at me now)\nGolds out my mouth (Golds out my mouth)\nAt Mr. Chow (At Mr. Chow)\nMe and my spouse (Me and my, mwah)\nLook at my coupe, look at my house (Skrrt)\nMy mom and pops (Mom), they in the clouds (Pop)\nThey lookin' down (They lookin')\nI know they proud (I know that)\nMy engine loud (My engine, yoom)\nMy paint so wild (My paint so, it's Gucci)\n\n[Chorus]\nI was down for a second but I'm up now\nI had to turn my life around, yeah, I fell down\nWent through hell to get here, but I'm up now\nIn cold cells, I shed tears, but I'm up now\nI was down for a second but I'm up now\nI had to turn my life around, yeah, I fell down\nI went through hell to get here, but I'm up now\nIn cold cells, I shed tears, but I'm up now\n\n[Outro]\nNow", "image": "https://images.genius.com/860a060fe0fae2c527819cb61d52fe7f.1000x1000x1.jpg"}], "artist": "Gucci Mane"}