{"songs": [{"title": "Power", "album": "Mr. Philadelphia", "year": "2010-08-25", "lyrics": "[Intro]\nFirst you get the respect and then you get the money\nAfter you get the money, that's when the power come\nYou dig?\n\n[Verse 1]\nI'm only 23, living like I'm 32\nI just made a 100K and spent it all out with my crew\nI be blowing money fast, what the fuck I'm supposed to do?\nAll this paper I done made, I can't take it to the grave\nIn a R8 Audi with the motor in the rear\nI was nominated youngest baller of the year\nJust think a couple months ago, I was locked up on the tier\nIn a cell but now I'm dropping on these niggas like a tear\nFor the way I got that Lambo in the back of me\nPhantom in the front  of me\nStunting on my old hoes, look what this money done to me\nShout out all them niggas in my hood that ever fronted me\nCause I'm a put them all on and better they run to me\nCause real niggas do real things\nIf you was real you would've went and bought a real chain (Fraud)\nFake ass niggas playing in the real game\nFrontin' on they old block, saying that the deal came\nThey asking how I get all this power\nCause I be on the grind like 24 hours (Yes sir)\n365 dream chasing for a dollar, I been here since yesterday, I ain't even take a shower\nMore money more power, more power, more business, more bitches\nTryna holla when they see you by the dollar\nAnd the problem when you on that cake\nAnd when you shine, a lot of niggas they be on that hate\nIf I don't grind then who the fuck gon' put it on my plate?\nShe say I'm Hollywood, well shit I must be on my way\nWith my Louis luggage straight to Californ-ia\nI hit my nigga K, like meet me by the port by eight\nUh, I had a dream like Mr. King\nThat I was in a phantom, color Listerine (Ew)\nNo top, bald headed like Mr. Clean\nShit I ain't claiming these bitches like Billie Jean\nI'm just doing something to these niggas really mean\nHe got the money without the power, what do he mean?\nHe like the nigga that ride the bench that's playing for a team\nThat win the champ ain't get no ticks but he still get the rings\n\n[Outro]\nYou dig me?\nYou like a nigga\nYa'll niggas got five rings\nBut you been riding the bench for five years\nSo that don't make you a nigga with power\nYou know what I mean?\nThat don't make you a Kobe nigga\nCause you was riding the bench while niggas was putting in the work\nBut you was just there and got the rings\nYou dig me?\nThat's like a nigga with no power, I'm gone", "image": "https://images.genius.com/02fee89da0cebb67c2da7a31768e15c2.500x500x1.jpg"}], "artist": "Meek Mill"}