{"songs": [{"title": "48", "album": "Wolf", "year": "2013-04-01", "lyrics": "[Intro: Nas]\nCrack fucked up the world\nAnd I wonder if they realized the damage\nI mean, they come from an era\nWho made a lot of money off that shit\nAnd I wonder if it fucked with they conscience\nIt fucked with me being out there, I couldn't stand it\nI couldn't stand seeing people fucking theyselves up like that on the shit\nAnd that's where the money came from\n\n[Chorus: Tyler The Creator & Frank Ocean]\n48, 48, 48 states I get it in (Nigga)\n48, 48, 48 states I get it in (Nigga)\nThey call me Mr. Treat Your Nose\nIf you really need some blow, I can get it for the low, nigga\n48, 48, 48 states I get it in (Nigga)\n48, 48, 48 states I get it in (Nigga)\nThey call me Mr. Treat Your Nose\nIf you really need some blow, I can get it for the low, nigga\n\n[Verse 1: Tyler, The Creator]\nShit's getting warmer, on that corner\nGotta watch out for them 5-0 foreigners\nYour mother's a goner\nI warned you before you supersized my fries with that dollar\nYou got a daughter, shit's getting harder\nThe only thing you wanna bunk her was your freedom\nYou can't afford to get caught up but you in too deep\nAnd the seashore ain't saw ya\nYou got a mother, she don't support you\nBut you bought her a new house cause you love her\nGrowing up you barely had a roof\nNow you got a coupe and it doesn't have a roof\nI guess you’re accustomed what you’re used to\nSo you bought two, nigga\nThey coming for you, nigga\nNiggas be hating I'm doing them bitches\nLike Susan and Karen be doing your pockets\nAnd running the man and he's losing his fucking mind\nAnd it’s all an illusion\nWho was alludin' all of this potent?\nI am the reason your family is using and shooting up\nIt's my fault\nYou can, blame me, motherfucker\nFor killing your aunties and uncles\nThe hustle and hunger\nAll I wanted was a cheeseburger\nAnd a little chain, tucked\nDidn’t realize this game fucked, up some lives\nOh, how's mine?\nMy conscience eats it up all the time but, other than that I’m fine\nI got a little money in my pocket\n\n[Chorus: Tyler The Creator & Frank Ocean]\n48, 48, 48 states I get it in (Nigga)\n48, 48, 48 states I get it in (Nigga)\nThey call me Mr. Treat Your Nose\nIf you really need some blow, I can get it for the low, nigga\n48, 48, 48 states I get it in (Nigga)\n48, 48, 48 states I get it in (Nigga)\nThey call me Mr. Treat Your Nose\nIf you really need some blow, I can get it for the low, nigga\n\n[Verse 2: Tyler, The Creator]\nNigga, we broke as fuck\nHomie got a chop shop, I stole that truck\nAnd I sold that dope, motherfuckers hope this nigga go broke\nBut like my work I give no fucks, I'm sorry (Yeah)\nShe could have been a doctor, nigga, I’m sorry (Yeah, nigga)\nCould have been an actor and won that Oscar, said I'm sorry\nI sold that soap, and I killed black folk, I'm sorry (Yeah, nigga)\nBut I got a nice car, put my sister through school\nWhile my mama all cool, I'm sorry (Yeah, nigga)\nI'm in too deep and I can’t see the shore, I'm sorry\n\n[Outro: Nas & Tyler, The Creator]\nYou get addicted to the flip, we used to call it\nYou get addicted to the flip (I'm sorry)\nThe, the, the, the transaction, the hustling (I'm sorry)\nEven more than the money, it's just your job (I'm sorry)\nYou feel like it's your duty to be the man in between the man\nAnd make this happen for that person (I'm sorry)\nAnd to do this and do that\nYou become the go to guy forever\nNext thing you know you’re in too deep\nWay too deep, it'll scare the shit out of you\nYou wind up with so much work, that you'd be scared to death\nIt's important for us to realize man, we gotta get out of that, man\nYou know, dudes is buying choppers\nShoot down the people that look just like them\nDudes is buying guns to take down each other\nNobody wins, ya know what I mean?", "image": "https://images.genius.com/dde81a162bfe7b81092c8630cdf16d70.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}