{"songs": [{"title": "I’m A Beast", "album": "The Drought Is Over 2 (The Carter 3 Sessions)", "year": "2007-06-16", "lyrics": "[Lil Wayne]\nRapping is my hobby, my house has a lobby\nMy bitches act snobby, because I feed them thousands\nI know that didn't rhyme but I'm only being honest\nYou can't pay me in cash now I'm only seeing commas\nI swear I got on Saks 5th boxers right now\nI'm trynna milk the game as if the game was a cow\nI had an Eddie Bauer Expedition seven years ago\nMy grandma used to tell me that she swear I been here before\nI used to wear braids like Jason's Lyric, whoa\nSpent a bundle on the cross because I'm spiritual\nAnd I can never pass a physical, I stay high\nHigh as the voice of Akon\nAnd make mine a straight with no chase\nHold the ice, I got enough on anyway\nAnd when they see the boy, they hyperventilate\nI got 'em running after me like I'm about to win a race\n\n[Hook]\nCause I'm a beast, I'm a dog\nBitch I'm a beast, ho I'm a dog\nYeah you know that I'm a beast, I'm a dog\nI'm a beast, ho I'm a dog\nYou know that\n\n[Lil Wayne]\nNo, never entertain the suckers with the hating bidness (Nah he never did that)\nI'm on a yacht playing table tennis\nExpensive linin, women sinning\nAdultery - compulsively\nI'm an arsonist on the beat, blaze fire\nThe door close to the booth, I feel like a caged lion\nYeah let me loose, now let me get 'em\nCause I ain't going back and fourth like badminton\nNo I will never drop the ball like bad mitten\nAnd I ain't being conceited, I'm just admitting\nI flow cocky, got hand rhythm\nI got this bitch on lock like San Quentin\nI'm tough daddy, what's popping gangster?\nI'm trynna keep my pockets fat like opera singers\nSo sharp, if you touch me I'll chop your fingers\nI'm on top of the game like helicopter angles\nI see you niggas, I hope you having fun\nI hope you have a gun, this shit is crazy\nIt's little Baby, I'm here to take it\nAnd it's looking vacant\n\n[Hook - x2]\n\n[Lil Wayne]\nOk, now I'mma go off on 'em, at first I was going soft on 'em\nBut now it's time to go hard, busting, banging Bogard\nTake a shit in yo' yard, take a piss on yo' broad\nMake a list of yo' boys, and go and murder them all, huh\nLife is short, yeah a midget told me that\nAnd I always thought I was fly like I had a pigeon on my back\nBut I got decisions on my back, vision on my back\nSo don't you try to run up on me, I got precision with that gat\nI don't rat-tat-tat-tat-tat, all I got to do is tat\nBet I hit my tar-get, like a fucking dart mat\nMy address is Cloud 9, seek and you shall find\nWeezy on da grind, I'm bout my Frankenstein\nYou know me, yeah, from my Lincolns to my Franklins\nSee I make that money stretch and connect like an anklet\nKeep the bitches running in and out my house like a banquet\nAnd I don't even speak their language, haha\nAnd if the bitch boyfriend get angry\nThen my niggas turn around and tell his whole click\nFuck that nigga! Pussy ass nigga!\nFuck that nigga! Yeah!\n\n[Hook - x2]", "image": "https://images.genius.com/58abe7b35759cd5e876b36af76e0b072.400x400x1.jpg"}], "artist": "Lil Wayne"}