{"songs": [{"title": "Flow Boy", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Intro] [Royce Talking]\nShout out to my nigga B-Love. Music pro\n\"Invasion\"\nC'mon\n\n[Verse One]\nYes, Bic\nThey call me the Flow Boy\nI'm dope\nI'm about dough, I'm a dough boy\nThe mag light up like a glow toy\nI let it go\nI got a couple skeleton's in my past to show for it\nNo disrespect to Mistah F.A.B\nBut nigga I ain't never really been out flowed by no boy\nYour food look just right\nI'mma eat your porridge\nEven though I'm full as a motherfucker like no storage\nI kid you not\nI spit too hot to diss you\nMan, I should go out and challenge a blow torch\nRespect no boy\nExcept maybe Bun B\nI'm from the place with the area code Shady 1-3\nFuck ?\nI'm in some new jeans and Gucci's\nRockin' a District 81 tee\nI ain't sayin' I'm a ladies man\nAll I'm sayin' is\nNigga I don't want every lady that want me\nSo, do the math nigga\nThey be like\n\"Damn, Nickel you be runnin' through hoes/holes like you a shoe string\"\nI tell you two thangs\nOne\nDon't ever disrespect me\nTwo\nCall me \"God\" like you from Wu-Tang\nI put a bullet inside you cause the truth ain't\nYour record deal advance to me is loose change\nNigga, is you sane?\nI'm the shit\nI don't smoke but I've been known to light up a Square like butane\nThe fame made me wait\nBut not the hoes nigga\nI don' fucked mo' than Big Daddy Kane in '88\nSo tell your man to get back\nIf the dogs with me, they obedient\nI lift a finger up from my hand they attackin'\nI like my hoes fast\nI like my cars fast\nFuck it I should just go out and date Danica Patrick\nI manufacture maniac rap if you askin'\nPut life back in hip hop and put it back in it's casket\nFuck peace\nYou should try to dap and bury the hatchet\nThen I'mma clap you and find somewhere to bury the ratchet\n\n[Hook]\nThe flow boy is in the buildin' tonight\nYou know I\n(Flow boy)\nWhassup?\n(Go boy)\nC'mon\nThe flow boy is in the buildin' tonight\nYou know I\n(Flow boy)\nC'mon\n(Go boy)\nLet's go\n(Flow boy is in the building)\nYou know I\n(Flow by)\nWhassup?\n(Go boy)\nLet's go\n(Flow boy is in the building)\nYou know I\n(Flow boy)\nI'mma\n(Go boy)\nC'mon\n\n[Verse Two]\nAnd yeah, ain't nobody true as us\nYou ain't gotta like me\nI like me enough for the two of us\nDon't compare me to the best rapper alive\nI contemplate suicide to be compared to the best rapper that died\nI'm killin' with them Boyz N The Hood like Cuba Gooding\nI go to the place in the hood that the shooter shouldn't\nWe do the casing, you do the bookin'\nLike the police\nSpeaking of them\nWe the reason they do the lookin'\nI'm the label\nI do the songs, I do the pushin'\nSo I'm sittin' on top of the world while you the cushion\nI clean pussies up\nYeah, I do the douching\nI'm Bill Cosby's teaspoon\nAnd you the pudding\nMy cousin Eye is crazy\nAll I gotta do is wave and yeah, it's bye bye baby\nI'm higher than Wayne and I rhyme like crazy\nI shoot a nigga's ass with the nine like Gravy\nI should like Shady\nI keep a dime like Haley in a dark brown creme gut Klondike Sadie\nIt's like my kidney's compensate for what my liver couldn't\nI'm a wolf, to kill me you're gonna need a silver bullet\nAny one of you niggas fuck with me then it'll heat up\nY'all do nigga's beats\nI make niggas give the beat up\nAny nigga step up\nI'mma make him step back\nWith either that Tec blaaat blaaat\nOr that fifty caliber gold plated Desert Eazy\nThat's for who ever rebellious\nThe cartridge to it lookin' like The Legend Of Zelda\nBorn winner\nRhymin' like there's two horns in him\nAfter I win the battle rap\nI'mma blow your motherfuckin' head off\nSo you can call me a sore winner\nI fuck with The Game\nThe rest of y'all give a fuck about too much shit\nMe, I don't give a fuck about nothin'\nI don't give a fuck about shit, but the outfit\nMy name fall out your mouth\nI'm at your house quick\nYou don't want them boys at your crib\nAbout six\nReady to let out a clip\nLike \"Rap about this\"\nMy crew is like your audience\nWe clap about shit\nWe sick\nWe don't be fightin' nobody\nWe probably fight each other whenever we drunk\nThat's about it\nApproach the enemy with caution\nBorn leader\nMy identity is ?\nAwe, ain't he awesome?\nI've been known to stick a nigga\nNo homo\nMy dick get hard when I feel on the trigger nigga\nMurder every verse\nMy rhyme is like a heavy hearse\nEach word is deeper than cemetery dirt\nThat fully automatic\nI pull it and let him work\nDo him a favor and spray his head\nI ain't gonna let him hurt\nYou better watch your mouth\nCause I can knock you out\nBut I'd rather give the Glock somethin' to talk about\nI'm in your bushes with the ump, thumpin'\nY'all about to dance with the one night stand\nSoon as you +Walk It Out+\nGive you the afterlife\nYou got a smart mouth\nYou a dick and a pussy like you a hermaphrodite\nAssassinate you this evenin'\nIt's assassin-night\nHave you weezin'\nYou and Eddie Murphy can laugh alike\nThe Revival\nYou can call it the Preme project\nBut it's violent\nYou should call it the pork and bean project\n\n[Hook]\nThe flow boy is in the buildin' tonight\nYou know I\n(Flow boy)\nWhassup?\n(Go boy)\nC'mon\nThe flow boy is in the buildin' tonight\nYou know I\n(Flow boy)\nC'mon\n(Go boy)\nLet's go\n(Flow boy is in the building)\nYou know I\n(Flow by)\nWhassup?\n(Go boy)\nLet's go\n(Flow boy is in the building)\nYou know I\n(Flow boy)\nI'mma\n(Go boy)\nC'mon\n\n[Outro]\nNow that's how you body a beat\nMan, if I got to say, \"I'm the shit fool\" one more time...\nSomebody gonna get urinated on. And then boo boo'd on\nAnd then a nut busted on. Happy Bar Exam 2 bitches", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}