{"songs": [{"title": "Soundboy Kill It", "album": "Fly International Luxurious Art", "year": "2013-12-10", "lyrics": "[Verse 1: Raekwon]\nAy-yo, life's good, cashmere sweaters in the rover\nPull up at the club, getting love, pull em over\nJump out the luxury stroller for ballers\nWe sit, burn money all day, blow and roll up\nFine broads around, that's fly, that's a low ball\nPaper settlin' its real for my gold club come up\nYou ain't even know nothing, last week all on the street\nYelling 'Let me hold something!'\nNow shorty throw your booty up\nNiggas with cash\nKeep it above, we in Louis stuff\nSit back, blasted, do me something\nWhen it comes to you, me and this rap shit\nI'm quick to toolie up\nMy style, my fly, my weather\nYeah I drive high plus fly\nYou a devil, you endeavor\nMean days in Ciroc with the kettle\nThrowing cream at shorty's, love it, he a rebel\n\n[Hook: Melanie Fiona (Raekwon)]\nWatch the soundboy, he 'gon kill it\n(To every ghetto that's far, we here.)\nYeah, watch the soundboy, he 'guan kill it\n(I seen so many scars from it)\nYeah\nNo, we can't turn back the rain\nNow we gotta find another way\nCause we grind it, burn it, street life's\nGot me caught up can't you...\nCan't you see it's 'bout to blow?\nCan't you see it's bout to blo-o-o-o-o-ow?\nRaekwon, kill it!\n\n[Interlude: Raekwon]\nAy-yo, wha gwan, you know what it is!\nAssassin, soundboy gangsta, let's go!\n\n[Verse 2: Assassin]\nWell mi say bodybag a zip up like a ziploc (Blaow! Blaow!)\nMurder soundboy, kill the disc-jock (Blaow! Blaow!)\n8 ball lodge inna yu six-pack (Blaow! Blaow!)\nSay \"it wasn't me\" like Rik Rok (Blaow! Blaow!)\nRaekwon, we got the game inna we hand\nControl the dogs like Cesar Millan\nAssassin on the track yo, call it microphone-icide\nWhy? (Cause we murder every beat dat we on)\nThen, soundboy yu dead and inna freezer you gone\nMi say you end up inna tomb, but anuh Giza yu gone\nRaekwon a tell me, \"Yo Assassin easy nuh man\nYu nuh fraid dem tek weh yuh visa mi don?\"\nMi say no, sound fi dead, whole clique a dead\nWhen mi say di sound dead, all di speaker dead\nAmps dem, di control, all di tweeter dead\nAye!\n\n[Hook]\n\n[Outro: Raekwon]\nIt's real, man\nThe Chef, Assassin, Melanie Fiona\nWord up all my soundboy killers\nThe DJs, hold the fort down man, word up man\n100 cases of motherfuckin' Guinness\nNigga you know how we win this\nSong feels so real 'til I finish this shit\nAah!", "image": "https://images.genius.com/14e76164726b071e30682fcdf43337a0.640x640x1.jpg"}], "artist": "Raekwon"}