{"songs": [{"title": "Let Us Begin", "album": "Neva Left", "year": "2017-05-19", "lyrics": "[Intro: KRS-One]\nYeah! Lalala lala lala la la la la\nLalala lala lala la la la la\nWhat up Snoop?\nKRS in the building\nListen! Listen!\n\n{Verse 1: KRS-One]\nToo much brrr brrr brr\nToo many people getting brrred [?]\nAll you hear is brrr brrr brr in the streets\nPeople gripping they heat just to settle they beefs\nNow you getting chased by police\nYou running to the west, running to the east\nBut the problem is you under the beast\nBrr brr brr - now your brother's deceased\nWe need peace, not brrr in the streets\nThe brrr in Iraq lasts for weeks\nWack rappers, I'm crushing these creeps\nEvery time I spit they get weak\nKnowledge reigns suprrreme\nI take you back to the days when the telephone used to rrring\nI'm reading the sacred script, KRS, Battlecat, Snoop in it, uh!\n\n[Hook: Snoop Dogg]\nLet us begin - what, where, why or when?\nMost of my homeboys are dead or in the pen\nWhile I'm at the top, upfront getting it in\nOpen doors, fuck that cuh, we kick them in\nBlastmaster (One!), blast faster\nNo more slave mentality, cause now we the masters\nReady for whatever cause you know that they after us\nClear the scene with the beam, cuh, this shit could get disastrous\n\n[Verse 2: Snoop Dogg]\nBy any means necessary, peeking out the window\nWatching all this sucker shit, look at the pretenders\nThinking how the rap game was\nI dig, I dug, I push, I shove, yeah I fell out of love\nBut it ain't no thing, telephone ring\nThey don't make 'em like they make 'em when I used to bang\nSo I try to show the little homies different things\nHow to diversify, and change different lanes\nLearn to read a little, exercise your brain\nMental gymnastics, it's a cold game\nAlways knew that they would try and trip me, trick me but they couldn't\nCause all my teachers and doctors were curious to the furnace\nThe honorable speaks\nLike Minister Louis Farrakhan my influence is deep\nCause it's truth\nWhat's that? You don't like that?\nWell we fight back. And we'll be right back\n\n[Hook: Snoop Dogg]\nLet us begin - what, where, why or when?\nMost of my homeboys are dead or in the pen\nWhile I'm at the top, upfront getting it in\nOpen doors, fuck that cuh, we kick them in\nBlastmaster (One!), blast faster\nNo more slave mentality, cause now we the masters\nReady for whatever cause you know that they after us\nClear the scene with the beam, cuh, this shit could get disastrous", "image": "https://images.genius.com/60bf707949edab977c5ad8da61ef82a2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}