{"songs": [{"title": "Fuck You", "album": "Baytl", "year": null, "lyrics": "[Verse 1: V-Nasty]\nI think they mad cause I'm relevant\nBig choppers put holes in elephants\nI got a bad bitch and she's elegant\nBet a hundred thousand that bitch selling it\nI'm on the block, bitch I'm doing hella shit\nThem suckers over there, looking is irrelevant\nI got a bolo coming from Mexico\nAnd if the bitches talking gas, they ass like Texaco\nI'm a reckless ho, you can't check this ho\nBitch, my outfit cost more than your necklace, ho\nAnd I'm doing shit that you never seen before\nHaving withdrawals, man, hurry where my blow\n\n[Hook: V-Nasty]\nFuck you! Bitch fuck your mama too!\nYou can't fuck with us\nYou can't do what we do\n\n[Verse 2: Gucci Mane]\nI got a swag so sick make the whole crowd cough\nI got a Lamborghini, hit the gas, the bitch get lost\nYou with a loser, need to lose him, it's not your loss\nI got a suburban tender, she stay in Norcross\nI'm a boss, you's a worker boy, go jerk off\nBrick Squad on the stage, know our shirts off\nAnd I'm horny as a rhino and her ass soft\nI got a fetish for a fine ho: I break her off\nLet's get it on, let's get it in\nLet's get it on, do it again\nSo bring a friend if you want to\nDon't tell me what you won't do\nWant me like I want you? All night long!\nLet's get it on!\n\n[Hook]\n\n[Verse 3: Slim Dunkin]\nI fuck her, you lick her\nI hit her and pass her\nThe number at the light, I'mma fuck her by tonight\nShe say a friend to dice, she allergic to the pipe\nAngie ridin' around no shoes, fuckin' quittin' on dudes\n10k from my parents\nSame shoes on clearance\nFuck your mama, your sister and your kids\nWould say fuck your girl but I already did\nI be in and out her jaw, can't go in and out her raw\nAnd I got them birds, man: I be stuntin like my paws\nDo it private when I travel: plane\nLouis in my baggie claim\nStanding on them couches with V-Nasty and Gucci Mane\nAll the ice on my hands got my fingers cold\nCall me Slim Dunk: I don't finger roll..\n\n[Hook]", "image": "https://images.genius.com/97562f951a31e446dbcef599814a320a.500x500x1.jpg"}], "artist": "Gucci Mane"}