{"songs": [{"title": "The Day the Niggaz Took Over", "album": "The Chronic", "year": "1992-12-15", "lyrics": "[Intro: Protestor]\n\"I'ma say this and I'ma end mine. If you ain't down for the Africans here in the United States—period point-blank, if you ain't down for the ones that suffered in South Africa from apartheid and shit, dammit, you need to step your punk ass to the side and let us brothers, and us Africans, step in and start puttin' some foot in that ass!\"\n\n[Bridge: All]\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\n\n[Hook: Snoop Dogg]\nI got my finger on the trigger, some niggas wonder why\nBut livin' in the city, it's do-or-die\nI got my finger on the trigger, some niggas wonder why\nBut livin' in the city, it's do-or-die\n\n[Verse 1: Daz Dillinger]\nDem wonder why mi violent and nuh really understand\nFor de reason why mi take mi law in mi own hand\nMi nuh out for peace and mi nuh Rodney King\nDe gun goes click, mi gun goes bang\nDem riot in Compton and dem riot in Long Beach\nDem riot in L.A. 'cause dem nuh really wanna see\nNiggas start to loot and police start to shoot\nLock us down at seven o'clock, barricade us like Beirut\nMi don't show no love 'cause it's us against dem\nDem never ever love me 'cause it's sport to break dem\nAnd kill, at my own risk, if I may\nTo lay, to spray with my AK, and put 'em to rest\n\n[Interlude: Reporter]\n\"Yes, we have—there have been riots, ah, uh, rioting. Well, I don't wanna say rioting, but there's been looting downtown. But right now, Bree, what I want to show you is, they have started fires down at the end of the street.\"\n\n[Refrain: All + Dre & Snoop]\nHow many niggas are ready to loot?\nYeah, so what you wanna do?\nWhat you wanna do?\nI said, how many niggas are ready to loot?\n\n[Sample: Interviewee + KRS-One]\nGot myself an Uzi and my brother a 9\n\"That's what they told us today: In other words, you still a slave. No matter how much money you got, you still ain't shit!\"\n\n[Verse 2: Dr. Dre]\nSitting in my living room, calm and collected\nFeeling that gotta-get-mine perspective\n'Cause what I just heard broke me in half\nAnd half the niggas I know, plus the niggas on the Row is bailing\nLaugh now, but cry much later\nYou see when niggas get together\nThey get mad 'cause they can't fade us\nLike my niggas from South Central, Los Angeles\nThey found that they couldn't handle us\nBloods, Crips on the same squad\nWith the Ese's helpin', nigga, it's time to rob and mob\n(And break the white man off something lovely, biddy-bye-bye\nI don't love dem so dem can't love me)\nYo, straight puttin' it down, gettin' my scoot on\nIt's jumping off in Compton so I gots to get my loot on\nAnd come up on me some furniture or somethin'\nGot a VCR in the back of my car\nThat I ganked from the Slauson Swap Meet\nAnd motherfuckers better not try to stop me\n'Cause they will see that I can't be stopped\n'Cause I'ma cock my Glock and pop 'til they all drop\n\n[Interlude: Reporter + Reporter 2]\n\"Yes, on the videotape we seem to have the, ah, people in the crowd throwing things at the officers.\"\n\"And swinging at them as well, as a result a young woman there, you see took a swing at at an officer with some object in her hand.\"\n\n[Refrain: All + Dre & Snoop]\nHow many niggas are ready to loot?\nYeah, so what you wanna do?\nWhat you wanna do?\nI said, how many niggas are ready to loot?\n\n[Sample: KRS-One]\nGot myself an Uzi and my brother a 9\n\n[Hook: Snoop Dogg]\nI got my finger on the trigger, some niggas wonder why\nBut livin' in the city, it's do-or-die\nI got my finger on the trigger, some niggas wonder why\nBut livin' in the city, it's do-or-die\n\n[Verse 3: RBX]\nOne-time trigger happy, no nigga love\nOne-eighty-seven time, time to grab the glove\nCan't get prints on a 9 I throw away\nOr get prints on my Uzi when it spray\nPop-pop, pop, another motherfucker drop\nAnd I get relief like, plop, plop, fizz\nSmash, I crashed his head like a window\nI ain't Nintendo, I'm high off the indo\nCreepin', with the quickness to the cut\nBust one to his head while he munches on a donut\nAnd crack-up, so now he best to back up\nI guess I gots to pack up, filling the clip up\nI zip uptown but motherfuckin' cops are all around\nHelicopters flyin', these motherfuckers tryin'\nTo catch me and stretch me on Death Row\nBut hell no, the poor blacks refuse to go\n\n[Interlude: Reporter 2]\n\"This is now covering a very, very wide area of Los Angeles where these fires have been, uh, ignited. I mean, from here to the, uh, to the south end of South Central is a long way.\"\n\n[Bridge: All]\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\nBreak 'em off somethin'\n\n[Verse 4: Daz Dillinger]\nThe outcome of this is destruction, so them all fall\nNiggas don't give a fuck, so them bust and them fall\nThe description of three blacks\nShows no justice, so, pick up it's your right\nIf you riot again, mi, turn the other cheek\nWe, be too many, mi got, mi nine to my side\nSo mi bust, flick, 'cause he don't give a fuck\nAnd mi don't give a fuck\nAnd all my problems end with that buck-buck\n\n[Outro: Snoop Dogg]\nBlam, blam, blam til dem fall\nListen to the shots from my nigga Doggy Dogg, biddy-bye\nDr. Dre, him bust gun shots\nDiggidy Daz and RBX, dem bust gun shots\nCome again", "image": "https://images.genius.com/f069b7a57cd614d79e5dba8ee92f08f8.944x937x1.jpg"}], "artist": "Dr. Dre"}