{"songs": [{"title": "Tim Westwood Freestyle", "album": null, "year": "2011-06-15", "lyrics": "[Verse 1: Method Man]\n[Instrumental: The Game - Red Nation ft. Lil' Wayne]\n\nYeah, Yeah, Yeah, Yeah, Uh! (X2)\nMeth, Check the verse, no curses, Yo\nListen\nStill living by the code\nToo many pretty women still living by the...\nYo, Yo\nHaha yeah, yeah, here we go\nNo curses, yo, check the joint!\n\nI'm just trynna get a mill\nWhen I started rhymin' wasn't trynna get a deal\nI was trynna get a feel\nHomicide housing, bodies lyin' in the hill\nMan ain't nothing worth me dying in the field\nEspecially when I'm trynna pay the bills\nA lot of y'all relying on the steel\nAnd see the court denying your appeal\nIf y'all don't know nothing, you better know it's real\nIf it works like a workshop, better know the drill\nI'm past childish games\nY'all just trynna take me outta my game\nAnd call my black women outta their name\nI'm serious, they're out of my brain\nUnderstand that my slang's\nFast and furious, they're out of my lane\nBoy I'm hot, kids be calling me blaze\nIn the industry I'm not, they be calling me slave\nI ain't trynna burn the spot, but I'm set in my ways\nI'm just a product of the block, and the city I'm raised, Aha\nI'm still living by the code\nToo many pretty women still living by the strode\nDaddy pimping 'em for doe\nEarly in the morning cops kicking in the do'\nMan I think somebody snitching on the low\nI caught my father sniffing on that snow\nThat's when he try to tell me things are different than befo'\nKids don't listen any mo', that's for sho'\nWe used to ask permission from our folks\nAin't no food up in the kitchen cause we broke\nAnd I ain't trynna miss another meal\nCause love will get you killed\nAnd if it don't, your baby mother will\nBut y'all ain't recognizing that it's real\nUntil that undercover pull a shield\nAnd now it's kinda late to cut a deal\nSo I ain't gotta tell you how I feel\nWhy I'm trynna keep my pockets stuffed with hundred dollar bills\nI should'a went to school and got a skill\nBut it wasn't in my future so I steal\nThat's why I got this Ruger in your grill", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}