{"songs": [{"title": "Run Tha Streetz", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Chorus: Michel'le]\nYou can run the streets with your thugs\nI'll just be waitin' for you\nUntil you get through, I'll be waitin'\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be waitin'\n\n[Collision: 2Pac]\nHey yo, Storm, honestly I think\nI can fuck with a motherfucker like you\nSee, I don't like a motherfucker that be all lonely and shit\nAll up under me, tellin' me we havin' gold\nIn case she gold ringin' when I'm comin' home\nAnd all of that ol' crazy shit, what type of life I live\n\n[Verse 1: 2Pac]\nNow peep it, here go the secret on how to keep a playa\nSome love makin' and homecookin', I'll see you later\nIt don't take a lot to keep a nigga heart\nMust be a lady in the light but real freaky in the dark\nPlus I got some enemies, baby, hold my pistol\nAnd wrap your arms around a nigga every time I kiss you\nCan you visualize the picture: me and you in ecstasy?\nDon't be upset, it's good sex, when you next to me\nDo you wanna test me, put your tired head on my chest?\nA thug nigga's in the house, now you can rest\nI bet'cha never screamed a nigga's whole name out\nAnd felt the pleasure and the pain\nAbout to fuck the very taste out your mouth\nYou can call me when you need me\n1-800-SKYPAGE, when you wanna see me\n'Cause I can be your man and, baby, you can be my lady\nBut you gotta give a nigga space or you'll drive me crazy\nRun the streets\n\n[Chorus: Michel'le]\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be waitin'\nYou can run the streets with your thugs\nI been waitin' for you\nUntil you get through, I'll be waitin'\n\n[Collision: Storm]\nYo 'Pac, you know I'm 16 strong behind you boo\nBut I gotta do what I gotta do\nI gotta run the streets, you know\nI ain't no \"clean up in one minute\" type of ho\nYou know\n\n[Verse 2: Storm]\nNow me and you was cool, but I ain't the one to play the fool\nCan't make no money in bed, so ain't no future fuckin' you\nI ain't the bitch to love ya, can't do a damn thang for you\nIf you ain't about money, nine times outta ten I'll ignore you\nIt's a man's world, but real women make the shit go 'round\nDisrespect and I clown the type of bitch to throw down\nThrow up the block 'cause nothin' stops my chips\nI boss play ya with this, then twist you lame tricks\nHolla if you understand my plan, ladies, fuck havin' babies\nBy them shady-ass niggas, swearin' he can save me\nMy strategy's official, checkin' ya pockets while I tongue kiss you\nSoft as tissue, so my next issue is how to diss you\nThey call me Storm, from the day I was born\nI been known to break the coldest mothafucka 'til his heart's warm\nI ain't never been the type to wait at home alone\nJust 'cause we bone don't mean you own me, nigga, I'm grown\n\n[Chorus: Michel'le]\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be waitin'\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be waitin'\n\n[Collision: 2Pac]\nHahhahaha, yeah nigga\nLet a nigga hang out with the homies, you know, baby\nAy, a nigga that hang out more will come home and love you better—you feel me, sweetheart? Let a nigga be free!\nDon't have a nigga all up under you!\nLet him run with his niggas!\nLet the nigga run the street, boo, let him run the streets!\n\n[Verse 3: Mutah]\nI'd rather run the streets than make some mail\nAnd put the game down tight\nFor these gamin' bitches could get it right\nIt might be a plan that I'm choosin'\nDon't get in confusion\nBecause I'm known for showin' examples how I do it\nThinkin' I'm new to this because I'm younger\nWhere I'll only leave you suspicious and to wonder\nAnd at the end I make a come up\nNigga, was raised up off of M.O.B\nFetti over somethin' that's tellin' me don't run the streets\n\n[Verse 4: 2Pac]\nSo tell me, am I wrong\nFor tryin' to communicate through a song?\nI'm up early in the morning, by sunrise I'll be gone\nAll my homies is waitin' for me\nPlottin' on plans that we made and all the fun that it's gonna be\nSo meet me at 3' and don't be late, nigga\nWe hangin' out all night while drinkin' straight liquor\nI heard it's poppin' at a club\nBut they say I can't get in 'cause I'm dressed like a thug\nUntil I die I'll be gang related\nGot me strivin' for a million, stayin' motivated\nNow that we made it, it's a battle just for the big money\nI'm livin' wild, no smiles, 'cause ain't a thing funny\nI came up hungry, just a lil nigga tryna make it\nI only got one chance so I gotta take it\nYou never know when it's all gonna happen\nThe rappin' or the drugs\nBut until then give me love and let me run the streets\n\n[Chorus: Michel'le]\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be waitin'\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be be waitin'\n\n[Outro: 2Pac]\nLet a nigga run the streets, boo\nI hate you, hahah, I'll call you back\nJust let me hang with my niggas\nWhy you actin' like that Michel'le, ha?\nYou know nigga wanna kick it with his homeboys and shit\nI told you I was comin' back later on, right?\nSo you don't believe a nigga?\nJust cook for a nigga, pleaaase!\nMake some of that shit you made last meal\nSome of them ribs and shit\nI'll be back through later tonight, I'm havin' some weed\nWe finna drink some Hennessy and some Alize\nWe finna eat that foods, smoke a lil blunt\nLay up in the bed, watch out Jay Leno or somethin'\nThen after that, shit, do whatever comes to mind, baby\nJust let a nigga run with the homies\nLet me go kick it with my niggas\nWhen I come back, I be all yours, for real\n\n[Chorus: Michel'le]\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be waitin'\nYou can run the streets with your thugs\nI'll be waitin' for you\nUntil you get through, I'll be waitin'", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}