{"songs": [{"title": "Clientele Kidd", "album": "The Lex Diamond Story", "year": "2003-12-16", "lyrics": "[Intro: Raekwon]\nYo straight up last minute, you know what time it is\nWord up, yeah, yeah, yeah\nWord up, blip blip blap blap blap\nWhat up?\n\n[Hook x2: Polite]\nWho don't know? They don't know, betta let 'em know\nThere they go, here we go\n\n[Verse 1: Raekwon]\nAiyo Clientele Kidd\nLayin in the crib gettin' ill money, those who hate ours get hit\nGot rugby's on and 4/5ths\nAttractin' them niggas I go against, the money was his\nOne nasty unit of murderers, all type of Goons'll watch\nThen four minutes later they burglars\nI heard from the grapevine mine made it\nElevate the name up, this gift gotta reign and his game went up\nAnd now he's stronger than ever, Nike jackets and Classics\nGo against it and it's instant vendettas\nHe run things, gun down Kings, check the joint the kid flyin' in\nCrib in Africa with two lions\nSomethin' like the Prince of a jewel thief, so smack the millions\nCame back wrapped it up, too sweet\nThe game is missin' somethin' unique\nI put too much to fall back on, I rather just sleep\n\n[Hook x2: Polite]\nCHEF! We designin', rhymin' with Diamonds\nCHEF! Ice Water, it was all in the timin'\nCHEF! He gave y'all niggas bricks on consignment\nCHEF! To the death and he Billboard climbin'\n\n[Verse 2: Fat Joe]\nYeah uh\nYo Don Carta' bomb harder over nearly everybody\nVery rarely you find me without the mini-shotti\nJust waitin' for Rae to give me the cue and\nYou see about 100 Puerto Rican niggas shootin'\nGet down, lay down, we don't play around\nI don't know what you heard but, we don't play around\nIt's cooked coke, but look, but what the fuck happened?\nHow you leave the dope game to pursue rappin'?\nAlready knowin' that ya shit was trash\nBreathin' hard on the mic when yo' click is ass\nAll we tryin' to do is bring dignity to rap\nAnd you kiddin' me? I'm literally the epitome of that\nUh, we much better than y'all, Terre-error the Squad\nMy niggas set it when we get in the yard\nWhether Marcy or Comstock, triggers 'pon cock\nStraight punch in ya lung and you niggas gon' drop\nWhat?\n\n[Hook x2]\n\n[Verse 3: Ghostface Killah]\nYo yo yo shoot him in his mouth.. (nah)\nFuck him, get the gasoline tell Terry to pull the Ac' up\nBring him to Rae warehouse, hang him from hooks then skin his ass\nAs lame as he look he ready to cook (yeah)\nAnd he pleadin' for mercy, bleedin' from his dome and he thirsty\nThe first week we made him eat shit!\nVideotaped his wiz and I fucked his bitch\nMade him watch me on the couch havin' fun with his kids\nSo what hurts more: is it me showin' love to ya fam?\nOr you in the box laid under the floor?\nOr keep you alive blow torchin' ya balls?\nMy murder chainsaw, ya bloods on my Scarface walls\nNot even Ajax can clean that, Jack\nWe need that maintenance man shit that kill that greasy blood on contact\nFinish you off cuz I'm pressed for time\nYour man and 'em will be next to die\nMothafucka!\n\n[Hook x2]\n\n[Hook x4]", "image": "https://images.genius.com/8703b73c19201fea3baccb6c300ec07e.1000x1000x1.jpg"}], "artist": "Raekwon"}