{"songs": [{"title": "Who Do You Luv", "album": null, "year": "2018-12-09", "lyrics": "[Intro]\nWheezy Beatz\nWho do you love? (Thugger)\nWho do you love?\nLotta this shit on me (yeah)\nJeffery, hey\n\n[Chorus]\nWho do you love?\nI'm talkin' 'bout who do you love\nGot a lotta this shit on me, hey\nGot a lotta this shit on me, hey, hey\nI'ma let God judge you, today\nI believe that's the only one that can judge you, ayy\nI got a lotta this shit on me, wait\nI got a lotta this shit on me, hey, hey\n\n[Verse 1]\nI can tell you so good, I can tell (I can tell)\nShe got icy watches, by the layers (Oh my God)\nA hundred red bottoms, on the shelves (On the shelf)\nShe'll expel you, she the sheriff, cute as hell (She cute)\nIs you rocking with me girl? (That's the question)\nHow you no longer wishing and dreaming? (Oh no)\nThat dick done made her crazy, you fiendin' (Fiendin')\nOh ride, ride, ride, ride, ride it (Ride it)\nTopic of discussion, she the finest (Finest)\nFuck it man I love it when she riding it (Ride it)\nWhen I'm in and out the house she said she finding (Find me)\nPolar, polar, polar jewelry got her flooded\n\n[Chorus]\nWho do you love?\nI'm talkin' 'bout who do you love\nGot a lotta this shit on me, hey\nGot a lotta this shit on me, hey, hey\nI'ma let God judge you, today\nI believe that's the only one that can judge you, aye\nI got a lotta this shit on me, wait\nI got a lotta this shit on me, hey, hey\n\n[Verse 2]\nBaby they just wanna be like you\nThey just wanna live like you and eat like you, yes, feast like you (Yup)\nFuck them hoes, they hating, drinking haterade and not no Gatorade (Hey)\nTake you to the mall today and take you out to date you (Date you)\nTake you 'round the world with me and take you on vacation (Hey)\nLet you see what you won't see and put you in the latest (Latest)\nRinse it on a quarter key and flood it with some blazers (Blaow)\nI know you ready, I know you ready, want your patience (Patience)\nOoh, I know them bitches wanna be just like you (Wanna be just like you)\nI bought you fifty Chanel purses in Peru (Peru)\nSome were old, but majority of 'em was new\nYou ain't tied yet, I'ma take you to the moon\n\n[Chorus]\nWho do you love?\nI'm talkin' 'bout who do you love\nGot a lotta this shit on me, hey\nGot a lotta this shit on me, hey, hey\nI'ma let God judge you, today\nI believe that's the only one that can judge you, ayy\nI got a lotta this shit on me, wait\nI got a lotta this shit on me, hey, hey", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}