{"songs": [{"title": "C. Delores", "album": "The Bar Exam 4", "year": "2017-06-19", "lyrics": "[Intro: Sample]\n\"It is obscene, it is obscene, it is obscene.\"\n\"In 1992 the Canadian Supreme Court ruled that it was more important to ban speech that is dehumanizing to women than to protect free speech.\"\n\"Now we see the direct and indirect effects. We see the rise in murder, in abuse, in battles, teen prostitution, and teen suicide. We hear the wailing mothers, the grieving sisters, the tormented brothers and fathers, and children planning their own funeral with pink dresses and pink caskets.\"\n\"If the filth that is portrayed in these gangsta rap videos and art is not obscene then I submit that nothing is obscene.\"\n\n[Verse 1]\nWe started off as targets\nWe had the Congress mad at the whole genre\nTryna get rid of us\nNow it's like we not even trying to be good\nIt's like we just sitting ducks in the eyes of evil\nI open windows with hopes that the wind blows you ten mo' blessings\nSet my Timbo's next to my dresser with the  Nintendo, and yes\nThe extendo's on the AK 47 and it's wrapped in the dresses of En-Vogue\nIt's time, it's time to move something\nI guess we missed our window to try to prove something\nSpot a whack producer from across the room\nWalk up to him, smack his hookah across the moon\nBreak a platinum plaque over a rapper back\nGo and toss that bitch into a dark lagoon\nGo into the heart of the art form with a harpoon\nThey ain't skilled enough to stand the field with us\nYou gon' have to retire me\nIt's only like four or five of you rappers who can actually inspire me\nI be out here telling the truth\nI should sign my autograph with a polygraph\nI move in silence tryna get to you 'fore you could brace yourself\nCause I'm tryna put yo' ass in a body cast\nY'all niggas lollygag, not me\nThis evening I'm with the biggest spenders having the most prestigious dinner\nYou eating Church's Chicken with suspicious fictitious sinners\nI'm a living legend, you a fidget spinner\nI'm getting cheddar, they tryna catch up to my past M's\nAnd I'm getting better quicker, tryna catch up and pass Em'\nI be blacking out, you could ask them\nEverything I spit be sick, gag phlegm\nEverything I wear be tailor-made to fit, Giraffe trim\nHuh, it seem like everybody out here right now wanna be 'Pac\nWhile I'm zoning, stirring the pot\nI'm 'bout to go so motherfucking Lamont Coleman\nThis 'bout to be disturbing to watch\nWhile I'm out here swerving the drop\nYour favorite rapper 'bout to get cleaned up, served in a box\nLike laundry detergent, pushing 'round these birds with a mop\nTryna stay in a genius, creative state of mind\nTryna stay sharper than straight sharks in a 'gator pond\nGrate her down, all for the greater good and the greater grind\nWhile they denying now, all these heathens be crying 'bout\nTaking care of two, three dudes but these people be lying\nWe keeping it G, we keeping the iron out\nThey feed negativity, we eating vagina while\nKeeping it Zion, we turning the streets of Detroit to a D zoo\nEating while we feed people to lions\nThe dude that I brought with me psycho and schizo\nHe think that he Luke, he like to lift you and make you skywalk\nYou don't wanna play with none of his make-believe truth\nThey'll make the iron speak too\nHe'll do the R2D2 to your heart\nUntil it's parts of a easel\nThrew a piece of your heart in a jar for the people\nTo dissect at Juilliard\nI'm the best at who we are, that's fucking food for thought\nNobody else been thinking like me thus far though\nSubpar cerebrals\n\n[Interlude: Sample]\n\"For 400 years, profit came before principle.\"\n\"We marched for our rights to Selma, I was there with Dr. King.\"\n\"—music that glorifies and promotes violence with guns, knives, or drugs—\"\n\"—and that includes all this gangsta rap—\"\n\"—that's it—\"\n\"—we march again and we're gonna keep on marching and demonstrating till it...\"\n\n[Verse 2]\nI make your mouthpiece obese like Della Reese\nWhile I'm flipping pies like Patti LaBelle, Sara Lee\nEating all the bark with Gargamel off of the cherry tree\nKing of the dark art, all is pale compared to me\nLet the hail from the evil word flip hath fury\nWhile hip-hop stay colorful fruity like RiFF RaFF jewelry\nI enter into a different intuitiveness on instruments\nI just whiplash new beats\nYou just the next wave to catch a crazy catchphrase\nI'm just a neck brace to the next crazy contestant who should step to me, neck pain\nTell paparazzi I'm charging sales tax to media\nIn order to picture these digits, press will have to capture Loch Ness\nOn the back of a hellcat or capture a meteor\nMe, I left from the frying pan like the Devil's last ingredient\nWhile Jesus wept I made boss music flunkies relate to\nBetter each time I came through like I held back the previous\nLook, I'm the real thing\nThese niggas just here to provide dangerous detail\nIf any of y'all MCM's is any flyer than me there\nThese niggas listen to sign language, probably speak braille\nMe, I'm just about to stick my dick in the dirt\nEither that or a model, these Ether raps are the Bible\nI'm gon' relapse for a bottle or be in the absence of Godot\nRelax for a throttle\nOne of the last living rap forefathers who wouldn't ask for a dollar\nMy style lethal ferocious\nStreaming out your club when your single drop\nLike a single drop of blood off the beak of a vulture\nUh, I broke my key off in the car door\nJust as I was on my way to score a quarter key off Artmore\nI'm an angel at squalor\nMy threshold for pain goes farther than a marine who's been ordered to war\nSo at 3:45, which, by the way, is a quarter to four\nSomebody ask me for change for a dollar\nWhile I spray your ass with four different fours\nMore layers than 44 sorting couture\nVocabulary lords sicker than Herbie's recording thesaurus\nThe Virgin Mary took a morning-after pill the morning before fornicating the Lord\nThey gave birth to me 44 days later drinking a 40 at the corner store\nTherefore, this is more than just my dormitory\nThis is the safe place I come to look Benjamin in the face\nSo when you gon' end up getting ate like four and four\nIcicles is made of blood-boiling water alluring gore\nI'm here to combine all three Bar Exams for a fourth\nWhile I shoot the shit as deep as foul goes though, so it's four to four\nWhile driving a Ford wondering why guys look at me foreign for\n\n[Outro: Sample]\n\"—we're beaten with billy clubs and we're bitten with dogs unleashed by Bull Connors. We will not tolerate injustice and insults from our worst enemies then, and we sure ain't gonna accept insults from our youth...\"\n\n[Produced by Quality Kid, Kyle \"Keyz\" Davidson, and Wiz Buchanan]", "image": "https://images.genius.com/2627cc5445030d64606928667383564b.800x800x1.jpg"}], "artist": "Royce da 5'9'’"}