{"songs": [{"title": "Where’s Your Money", "album": "Dirt McGirt (Bootleg)", "year": null, "lyrics": "[Intro: Ol' Dirty Bastard]\nYo.. all my bitches that make money\nThrow ya motherfuckin' hands in the air (Suuuu!)\nCuz it's all about the money\n(Yo, yo, all my, all my, all my homies\nLet me hear you go suuuuuuuu!) Money rules the world\nI take over all pussy with money\n(All my girls making money, out there)\nAll cars get tooken over cuz of money, baby\n(Let me hear y'all go suuuuuuu!)\nAll businesses, baby, it's all about the money\nTo all my niggas that bustin' shots for money, right now\nBust shots (suuuuu!) bust shots for the money, now\n\n\"Where's your money?\" (suuuuuuu!)\n\"Where's your money?\" (about the money)\n\"Where's your money?\" (it's all about the money)\nThrow ya motherfuckin' hands in the air! \"Where's your money?\"\n\n[Ol' Dirty Bastard]\nThe Brooklyn borough king, you bitch to me is everything\nSent me to Jersey, trapped off the parascene, or Penelope Pitstop\nYou can't duplicate the picture, or record this hip hop!\nMy owl's are tryna crust up the ziplock\nDime pieces in high heels and flip flops\nReal playas, with the Zenty's wristwatch\nOutside of clubs, is backed up in gridlock\nThree bouncers the size of sasquatch\nPlus whips that will make your eyes pop\nHot burns that burn faster than matches\nDirt is only out to catch vicks\nSee boys on the back on some rap shit\nFake industry heads sweating in the guest list\nI'm on the spot with a bottle of fresh Cryst'\nLay up on the table, arm around the best chick\nIt's all about the money\n\n[Interlude: Ol' Dirty Bastard]\nHey, I'm O.D.B., let me know \"Where's your money?\"\nNext time you see me, let me know \"Where's your money?\"\nBaby, I just got home, let me know \"Where's your money?\"\nWe got to feed these kids, baby, let me know \"Where's your money?\"\n\n[Busta Rhymes]\nIn a fly, tailor-made suit, cooking a blunt\nGot the Phantom, parked, crooked out in the front\nRowing, gun toting, Sonny Chiba niggas we large\nCaymen Island style, sucking on cohiba cigars\nThe way we stack cake, you know I know it's making you sick\nWatch dough with diplomats from other countries and shit\nHeh, now let me show you why we walk with a swagger\nMoney over flowing, spending like it don't even matter\nMoney do a lotta shit, money make me more bread\nBut money take a nigga life, put a price on they head\nThink you nicer than the dreads, niggas fight with the feds\nKeep it cool, while I put all of the hype on the bed\nBitch, ever since my cake got a little bigger\nFuck a JP Morgan, Merryl Lynch and them niggas\nFuck it, call it what you wanna call it, nigga, we sinners\nThrow my money at ten thousand dollar tables for dinners, now\n\n\n[Interlude: Busta Rhymes]\nIt's a Busta Bust now, nigga, let me know \"Where's your money?\"\nEverytime you see me, let me know \"Where's your money?\"\nYou can give me all your money, let me know \"Where's your money?\"\nWhen it's the first of the month, nigga, let me know \"Where's your money?\"\n\n\n[Busta Rhymes]\nFor the carat D class, next to my middle finger\nWhen I see my own reflection, diamond frost the mirror\nDiamonds as cold as ice, frost bite like winter\nFloss fitters, three quarter four length chinchillas\nYou wish you knew the way, the kid'll quiet dough is a mystery\nNiggas bread'll stack longer than American History\n\nHeh, now peep the way we runnin' through y'all, it's funny\nFuck around get you murked with my \"Woo-Hah!\" money\nLay you down in the dirt, let me school y'all dummies\nHit the town with the work, like crack heads, they love me\nShit, to call my cake disrespectful bitch, holla\nA lot of acres with a pet alligator, named Dollar\nBust it, y'all niggas know that I'm the most, so just stop it\nI cop cribs, and stash cake and keepin' money in wallets\nNiggas money smaller than a bar of Whatchamacallits\n\nMoney hungry like Sudan, when my paper stay brolic\n\n[Outro: Ol' Dirty Bastard (Busta Rhymes)]\n\nHey, I'm O.D.B., let me know \"Where's your money?\"\n(It's a Busta Bust now, nigga, let me know) \"Where's your money?\"\nNext time you see me, let me know \"Where's your money?\"\n('Fore I stick ya ass up, nigga, let me know) \"Where's your money?\"", "image": "https://images.genius.com/645a534b0aef589fb069ea26da0769a5.543x551x1.jpg"}], "artist": "Busta Rhymes"}