{"songs": [{"title": "G.O.D. Pt. III", "album": "Hell On Earth", "year": "1996-11-19", "lyrics": "[Hook]\nIt's the G.O.D. Father Pt. III\nQBC, sip lime Bacardi\nHeavy on the wrist, cube-link, my ice rink\nDrama we bring, yo, that's a small thing\n\n[Verse 1: Prodigy]\nAlright now, pay attention to the crime rhyme Houdini P\nKeeping you niggas in perspective\nMobb, representative, call me the specialist\nProfessional, professor at this rap science\nUp in the laboratory, that's why your small rhyme bore me\nYour store bought rap ain't shit, my category\nIs that of an insane man who strike back\nI draw first blood, it's over with, and that's that\nYou wanna square off, I'm saying 'slice that cat'\nYou get splashed from back of your head to ass crack\nSearching for signs of the end, well I am that\nWhich bring, apocalypse to this game called rap\nNot a game but quite serious and yo in fact\nYou'll be running for dear life so far you might fall off the map\nFucking with P, you need the gat\nAt least you have the opportunity to bust back\nFresh out the motherfuckin' pack a rare world premier\nShook individual bounce in blind fear\nScared to death niggas fall to they worst fear\nHorror tales in Braille, for vision impaired\nYou looking for P, well, you can find him everywhere\nIn a project near you, I'll be right there\nI was brought up and taught to have no fear (now)\nLive wire niggas they behind me in the rear (now)\nCowardly hearts, step aside, stand clear (clear)\nMy bloodthirsty niggas got they eyes on you (you)\nQBC, lime Bacardi, Godfather Pt. III\nOn some hashish, to Embassy Suite, crash your party\n\n[Hook]\nYo, it's the G.O.D. Father Pt. III\nQBC, sip lime Bacardi\nHeavy on the wrist, cube-link, my ice rink\nDrama we bring, yo, that's a small thing\nYo, it's the G.O.D. Father Pt. III\nQBC, sip lime Bacardi\nHeavy on the wrist, cube-link, my ice rink\nDrama we bring, yo, that's a small thing\n\n[Verse 2: Havoc]\nYo, lime Bacardi, getting bent, crash the party\nHandle B-I, bringing it to anybody\nPhysical damage, crowd control handle cannons\nHitting you ripped, leave your bloodstream contamin-ed\nWhile you acting out of character, we observing\nGrilling 'em down so hard, I know he felt it coming at 'em\nHennessy raps do like the Phantom\nRunning you up out of the spot in which you standing\nNever second-guess a cat who hold gat\nConcealed, but easily revealed and fast\nBody casting raps to get your back snapped in half and severed\nImpossible pain beyond measure\nSheisty living brought him to his last prayer (prayer)\nLife changed around quick with one stare (stare)\nFace full of fear, conquering your ice grill (grill)\nDrowsiness, put him to sleep like NyQuil (NyQuil)\nGiven a overdose of this rap potent\nPotentially dangerous, fatally left open\nFor the vultures, scavengers, that's EMS\nFuneral homes, anticipating your death\nThat's the dead truth, check in the morgue, you'll find proof\nEnough to make you think and stop before your ship sink\nTo the bottom, like Albolene, the Mob'll spot him\nYou know the routine, face up before I shot him\n\n[Hook]\nYo, it's the G.O.D. Father Pt. III\nQBC, sip lime Bacardi\nHeavy on the wrist, cube-link, my ice rink\nDrama we bring, yo, that's a small thing\nG.O.D. Father Pt. III\nQBC, sip lime Bacardi\nHeavy on the wrist, cube-link, my ice rink\nDrama we bring, yo, that's a small thing\nIt's the G.O...Father Pt. III\nQBC, sip lime Bacardi\nHeavy on the wrist, cube-link, my ice rink\nDrama we bring, yo, that's a small thing\nG.O.D. Father Pt. III\nQBC, sip lime Bacardi\nHeavy on the wrist, cube-link, my ice rink\nDrama we bring, yeah, that's a small thing\nSmall thing...what?", "image": "https://images.genius.com/2c1555f27e44bd87876d75ca225fcb3a.600x600x1.jpg"}], "artist": "Mobb Deep"}