{"songs": [{"title": "We Got What You Want", "album": "Genesis", "year": "2001-11-27", "lyrics": "(Busta Rhymes)\nYeah I though all y'all was goin'\nUh, Yeah, yeah, yeah\nWere gonna take y'all on a little ride and shit\nYou mean now, now, now, yeah\nWe gonna sail in one of them big fat ocean liners on the street\nSwim through this mutha fucka\nBusta-Bus now, now, now\n\n(Busta Rhymes)\nHop scotch I found a new bounce\nJust rock back and fourth while my beat knock (Aurgh!)\nStop chips and cock Glocks wit' clips\nGo sailing in hot ships and park big whips (oh!)\nGetting' them whips and bounce outta town\nTake trips ride slow through them hoods and park at the main strip\nBaby girl gimme yo hand cock fast (c'mon!)\nWith a number in your hand, hot ass (hold up!)\nShorty actin' just like she had a hit (on me!)\nFuckin' while shorty's busy shakin' her shit (on me!)\nMan stop, just let 'em flop watch girlfriend let alone cock block\nHot shit make a bitch wanna whine just like a reggae tune\nMake y'all niggas wanna act and bust the AK boom!\nEveryday create a may lay today is pay day mutha fucka you better make way!\n\n(Hook)\nIt's your night go get your money\nGet that dough bounce if ya want\nAnd light that blunt smoke if you got to\nShake yo shit bounce if you have to\nFlimode squad back in the spot\nWith all yo shit bounce in the truck\nYes yes y'all bounce we go what ya want\n\nAll my niggas, all my niggas\nAll my bitches!\nC'mon!\n\n(Busta Rhymes)\nWe stay spittin' on\nSee what we sittin on\nShittin' you see how my 20\" be fittin' on nigga\nA 100 dollar bill shorty number was written on\nHittin' shorty on the sink wit' the lights in the kitchen on\nC'mon! move quiet with all the DL chicks\nWho carry on Lincoln head up on my CL 6\nHit y'all wit' the shit split y'all\nChicks all on my whip hoping ya ass fit y'all\nWe suppose to reach most shit bang\nWatch how niggas bounce in East Coast (Heaighh!)\nChoke y'all provoke y'all\nKillin' street everytime we distribute the coke all\nCheck it, see now a days we caught cribs\nAnd caught big fat loss\nFuck big fat bitches that make cliques back off\nThe way we prove it to y'all\nIs just bang niggas every time we do it to y'all\n\n(Hook)\n\n(Busta Rhymes)\nYeah\nStraight black out shit fo show\nMaking you back yo mack out quick Aiyo (huh)\nYeah we floss and drop pricy things\nTalk slick and money and rock icy things\nShe tried to get that score\nBy throwing the pussy begging me to hit that raw (uh oh)\nWe puts it on and watch bitches getting' a getsy\nFlimode up in this mutha fucka just for the record\n\n(Hook)", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}