{"songs": [{"title": "SMS Get The Message (Freestyle)", "album": null, "year": null, "lyrics": "[Intro]\nNigga I ain't fucking around\nSMS, get the message, get the message!\nSMS, get the message!\n\n[Verse 1]\nI go hard full time, duck when I pull mine\nI run from one time, fuck a pig, ya dig?\nI go to war with one nine\nI work, you see mine\nBut I ain't never ever gonna say I did it\nIn a hoopty, hoody on, cruising the back locks\nYou stuntin' on hungry niggas, go ahead get your ass shot\nYour neck got your chain on it\nBullet got your name on it\nI'm serious, sometimes it seems like I'm playin'\nDump a shell case in your face, The D's got 40?\nThey tryna find a rat or call it a cold case\nI know some niggas, some snitches\nI know some bitches who's scared\nI got some shooters around me and they stay fully prepared\nWe got them straps you niggas look at and flinch\nGhetto nigga get rich, what you think I'ma get?\nWe got that pump in that chopper, we got the tech in that sweeper\nWe got that Ruger that Mac, I call it my bitch nigga ether\n\n[Chorus: x2]\nAll we do is get that grain\nAnd my niggas move cocaine\nPlus we let them hammers bang\nI'm talking 'bout the Unit gang\n\n[Verse 2]\nInhale! Smell the gunpowder, my hands is full of residue\nNiggas'll shoot niggas, you lucky it weren't you\nNigga, my best song, my chucks are bomb proof\nYou shoot, I shoot back, find God when I'm on you\nThis ain't tales of the crypt, nigga, this tales of the hood\nStay the fuck out the way with your mouth shut like you should!\nWhen the bullshit start I'mma find a spot\nAim it right at your knot than the shell cases'll drop\nMan, you niggas don't know me, you know my government name\nGo 'head ask about booboo, they tell you I let it bang\nGot a big reputation, there's something wrong with my brain\nNigga front, I'mma squeeze it, go 'head stunt, I'm squeeze it\n\n[Chorus: x2]\n[Outro]\nYeah! Back on my shit, man!\nI don't give a fuck about fitting in\nYou niggas gonna follow me!\nBack to the ground, nigga we gonna make it nice and dirty!\nNow wan' get dirty with me?\nWe gon' see if you all you niggas done with soft?\nAll y'all get with the shit man\nThis the shit man\nAll the real niggas feel it!\nRest of you RnB ass niggas\nGo on, man! Go on play ya little song, nigga\nFuck It!\nG-G-G-G-G-Unit\nSMS Audio, Sleek By 50\nR.I.P NATE DOGG", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}