{"songs": [{"title": "So High (G-13)", "album": null, "year": null, "lyrics": "{*sampled woman singing \"So High\" in background\nThroughout whole track*}\n\n[Intro: ??? (RZA)]\nYeah son, 36 dirty\n(Smoked out.. oh.. smokin.. smokin)\nOh, yeah man, It's Not a Game son\nYo Ra man (Smokin) Yo Ra man, bring it back\nWe gotta bring them ten of them, nahI'msayin?\nAnd don't forget that Remy with the.. (Smokin) that Henny, knowImean?\nAnd that big booty bitches with it ripped off\nWith the jiggles on, knowI'msayin?\nYeah bring some big women and smoke it\nGet high over here, knowI'msayin? (Smokin)\nStraight like that baby\nLet them niggas know what's up Ra\n\n[RZA]\nBZZZZ..\nKilla Bee will sting, blitz from the sticky green\nI had the chocolate thai mixed with the G-13\nFrom the supercali-fragalistic twisted\nThroat dry as brownies, I had to sip a Mystic\nCalled up Johnny Blaze cuz I know he like to smoke\nHe said for migraine headaches weed be the anti-dote\nBrown bags got more seeds than a cantaloupe\nNorthern Lights have you runnin like wild antelopes\nSeen through a microscope, crystallized T.H.C\nI mix mine with the Digi soaked in minty leaf\nAnd I puff.. puff and I smoke the smoke\n{*coughs three times*} ..but I didn't choke\n\n[Timbo King]\nBlaze up, and let's smoke 'til we hazed up\nWhat you drinkin? Lemonade or Henny straight up?\nSuper-high motherfucker, nigga, Wake Up\nAnd cop a bag of that good shit\nEh-yo, dip that shit, nigga, one pull and pass\nSmoke 'til ya lungs collapse and hit ya ass\n'Dro, evergreen, ever seen seeds?\nNo, you never seen trees like these\nBudded, with the crystal studded\nI'm blunted with the pistol, shut it\nKeep smokin.. {*inhales*} super-high nigga\nI'm whino real, fifty sack of that good shit\nFrom the hood shit\nGot the Remy on my side 'til death do us\nEyes low, breath smellin like hydro\nI'm high yo, up in the Tahoe bumpin Faith\nKeep gats like G's son, just in case\nBlackjack Las Vegas, we puff God shivegas\nHigh outta my mind, forgot what today is\nIt's Bo King blunted, chokin on the Arizona\nSmoke scream effects, smell the green marijuana\n{*inhales*}\n\n[Outro: ??? (Timbo King)]\nSo High girl, Ohwee (Uh, good shit, good shit)\nSo High, So High, uh\n(We got yo nostrils flaired smokin on the chocolate)\nAh.. Killa Bee drama.. look at the chick yo she high..\nYeah.. I'm gettin all that baby\nI'm only gon' get ya high one time\nSeen? Yeah, we gon' get you high over here\nNahI'msayin? Mix some of this Cognac\nMix it back baby, get some realy tonic here\nStraight up G mackin up in here baby\nBlack dust on the road with this.. flow\nGoin on and on, didn't I try to tell ya?\nYeah, straight up Wu-Tang baby\nNigga, knowI'msayin? Umm-hmm\nThis is what you need, I'm So High girl\nI just wanna lay a little guerilla back on a sweetback baby\nThat's what I'm tryin to tell ya, umm-hmm", "image": "https://images.genius.com/0050e4b1c52ecca6d63818331b489e2a.683x683x1.jpg"}], "artist": "RZA"}