{"songs": [{"title": "You’re Not Ready", "album": "God’s Plan", "year": "2002-11-01", "lyrics": "[Intro: 50 Cent]\nOh, Oh!\nG-g-g-g-Unit!!\nNigga!\nHaha!\n\n[Hook: 50 Cent]\nYou said you're ready, you're not ready\nWe don't shoot no one on one's\nNiggas'll clap, all that pack you\nEither way your ass is done\nWhen them shells hit you and they split you\nYou gon' scream like a bitch\nIn your dreams it don't feel\nHow it feels when you're hit\n\n[Verse 1: 50 Cent]\nMomma baby boy is a killa\nAin't it funny how them guns get to pop for the scrilla?\nFour bodies at 19, man I love that little nigga\nFor 5 grand niggas'll air the strip out\nFor 10 grand niggas'll run up in your house\nHave you ass tryna talk with a gun up in ya mouth\nNew York has taught niggas to get money Down South\nBut get knocked in the commonwealth, stake your ass out\nFuck the captain, fuck the sarge\nFuck the king's that's in charge, bitch\n\n[Hook: 50 Cent]\nYou said you're ready, you're not ready\nWe don't shoot no one on one's\nNiggas'll clap, all that pack you\nEither way your ass is done\nWhen them shells hit you and they split you\nYou gon' scream like a bitch\nIn your dreams it don't feel\nHow it feels when you're hit\n\n[Verse 2: Tony Yayo]\nWhen my warriors come out and play, I'm Osirus\nI eat, sleep, shit and catch niggaritis\nAnd beat niggas down like the turtles on Riker's\nI'm a cheap ass connect with some high ass prices\nI've been totin'.fo-fo's and Mack-10's\nSince Tim Dog was on raw, G ten\nI'm the nigga on the strip that make feinds relapse\nI'm the nigga on the strip that's a walking G pack\n\n[Hook: 50 Cent]\nYou said you're ready, you're not ready\nWe don't shoot no one on one's\nNiggas'll clap, all that pack you\nEither way your ass is done\nWhen them shells hit you and they split you\nYou gon' scream like a bitch\nIn your dreams it don't feel\nHow it feels when you're hit\n\n[Verse 3: Lloyd Banks]\nI don't bash woman, but I'll throw a bitch in a sleeper\nI been this way since Rakim was kicking a speaker\nYou can fly on holiday's like Christmas and Easter\nThe only way yellow ice is if you piss in the freezer\nI'll put your partner in a case and park him off of pace\nYou suppose to be getting money, cheddar carpet off your face\nI'm in the blaze, top runner in the race\nNike fanatic, spent spring summer [?]\nLook what happened to Ma$e, I hope you see them same lighters\nAnd my tape pound from me, put you on tubes and vitamins\nI might've been slunked in the G-5 drunk and\nThumpin' the chronic one ridin' with the Thump Jiva\nI'm on the run from marriage to rolling the carriage\nTo go with the average, give me someone established\nI'm performing if they come with the carros\nThese bitches want my son in their carriage\nBut I don't wanna feel dumb and embrassed, bitch\n\n[Outro: Tony Yayo & (50 Cent)]\nPummy-ass niggas!\nWhen are y'all fucking with us, man? (Ha ha ha!)\nG-Unit!\nHottest niggas out in the streets right now!\n(Tell em niggas)\nLloyd Banks, Tony Yayo (Ha ha ha!)\nThe General, 50 Cent nigga! (Yeah, you heard him motherfucker!)\nGo ahead and scream my name, nigga!\n(Go ahead and say something!)", "image": "https://images.genius.com/7488990258b7e75bb8e35de7a131ec87.697x694x1.jpg"}], "artist": "50 Cent"}