{"songs": [{"title": "Say You Will", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2009-04-16", "lyrics": "As I hop on this red eye flight with all red eyes\nHoodie over my head, recognize a Jedi\nIf I go too fast down this road I end up like Left Eye\nI’m wondering would it be better if I left life\nMy girlfriend know I got a fetish for fine hoes\nI'm worldwide so she know I’m gonna find hoes\nSneaking in my iPhone, looking through my call log\nIt hurts looking at her face to ask her what she crying for\nI’m so fresh I’m wondering \"why didn’t I design clothes?\"\nThis rap shit is something that you gotta be designed for\nMeetings at the label saying they gon' make Sean blow\nTurned the radio on and do I hear Sean? No\nMan please do not gimmick me, put me on the shelf and not remember me\nAnd treat me like a John Doe\nI wish that I could drop my nuts in they tonsils\n(ahem) Shut up bitch swallow\nAnd I been signed to Ye for well over a year now\nIt’s clear now, I'mma focus on my career now\nYou taught me to create a process\nSaying that you changed my life dog it’s me being modest\nBut honestly I wish that I could take you off tour\nPut you in the studio so you could focus more on my shit\nAnd I don’t mean to sound selfish\nBut I am not an artist that's selfless\nI’m feeling like a crab in a bucket\nThat’s just tryna get it crackin'\nAmongst all these fuckin' shellfish\n\nAnd it’s a dream come true that you signed me\nBig Sean, G.O.O.D. Music signee\nPeople asking me how it happened, man I tell 'em\nI Rolex-ed the situation and just had perfect timing\nAnd you already know where to find me\nBitch I'm connected to the D like Siamese\nSo if you see me out of town getting money\nKnow I do it for my city and I be back very promptly\nSo say what up if you see us\nAnd the D is burn rubber and the Sean man lead us\nLike being undefeated, feeling undefeated\nDick so big I bust a nut for a fetus\nGlad to do any interview or dope feature\nCome holla at a nigga as I’m trying on sneakers\nNiggas making diss records in efforts that I see it\nWaiting on my reply but they never will receive it\nYou are not half of what I am and can’t be it\nYou are just a hundred-and-one percent bitch\nRecognize a star like you pledge to the allegiance\nAnd I don’t want fans, I want believers\nRace to success so I'mma keep pedalin'\nCuz my mama man she deserve everything\nSo if I find a girl with beauty and brains like her\nThen best believe she gon' get a wedding ring\nBut I don’t know if I believe in love to be honest\nCuz every girl love the headliners\nTake her to my hotel all my niggas there\nAnd best believe they gon' give us all a hair line-up\nAnd that’s why girls wanna leave us\nTell 'em where we are but they never gon' believe us\nWon’t stop till we end up on that show Cheaters\nBut I bet you couldn’t spot me if a nigga wore cheetah\nAnd I be in the strip-club Teasers\nGiving all the girls what’s needed\nHonest dog had so many problems dog\nI could hand 'em out and be labeled a fuckin' teacher\nSo respect my hand gesture\nI dare any nigga try and come test us\nYou a mothafuckin' act dog, a A.C.T. that’s why niggas try and test ya\nA-Dub how the hell we gon' make a mil\nPay the bills man, I ain’t tryna waste a deal\nIf you could make a deal believe you could break a deal\nAnd if you can’t keep your promises then don’t say you will\nNigga don't say you will", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg"}], "artist": "Big Sean"}