{"songs": [{"title": "Oh I", "album": null, "year": "2017-10-27", "lyrics": "[Intro]\nBongo by the way\n\n[Chorus: Jeremih]\nOh, my\nYou keep that to yourself\nOh, my\nYou don't trust no one else\nOh yeah, yeah, yeah, yeah, yeah\n\n[Verse 1: The Game]\nMet her backstage at a Tiller show\nShe said I got a reputation, I'm that nigga though\nShe tryna play hard to get, but I'ma get it though\nShe say she ain't that type of girl, she sendin' pictures though\nShe get naked on the Snap 'cause it disappear\nI seen that pussy for a sec' and I say, \"Bring it here\"\nSee the way that I'ma fuck you, you ain't ever did\nI'ma fuck you everywhere and baby I ain't ever scared\nAre you prepared to sit in the club with thugs?\nI'm hopin' you there 'cause all that we got is trust\nYou got friends, they don't fuck with me like that\nSo in return, I don't fuck with 'em right back\nI could have fucked one, I could have fucked two\nBut I'm only fuckin' you, what you goin' through?\nNow you mad, textin' in all caps\nLike I just didn't put my kids on your back\n\n[Chorus: Jeremih & Sevyn Streeter]\nOh, my\nYou keep that to yourself\nThe way you do it, baby\nIt's drivin' me crazy\nOh, I\nYou don't trust no one else\nThe way you do it, baby\nIt's drivin' me crazy\nOh yeah, yeah, yeah, yeah, yeah\n\n[Verse 2: Young Thug]\nI'm so gone off your love, I'm so gone\nI'm so gone, I'm so gone, I'm so gone (aw yeah)\nI'm so gone off your love and you know\nI'm so gone, I'm so gone, I'm so gone (I'm so gone)\nI got drunk off your love and throwed up (bleh)\nPour my heart inside your double cup\nOut the park when the first batter up\nI got scars from her nails when we fuck (let's go, ayy)\nI wanna see your boobs, throwin' you some Jerry beads\nBlack diamonds in your chain, you a Merry kid\nChrome Heart clear lenses when you lurkin'\nEighty thousand dollar bag, you a Birkin\nWorkin', 800 in a bag, you ain't worth it\nHeard you dropped out of school, was you workin'? (She workin')\nNo climax from your man? He ain't worth it\nHundred racks on purses, she's mine\n\n[Chorus: Jeremih & Sevyn Streeter]\nOh, my\nYou keep that to yourself\nThe way you do it, baby\nIt's drivin' me crazy\nOh, my\nYou don't want no one else\nThe way you do it, baby\nIt's drivin' me crazy\nOh yeah, yeah, yeah, yeah, yeah\n\n[Bridge: Jeremih]\nHell yes\nHer body talkin' to a nigga, say less\nI'm fuckin' up her weave, need a hair net\nI'ma put your body on bed rest\nLate nights, took her out to Maestro's\nShe can get the lobster for the backstroke\nYou know how to love it when I ask though\nMake a nigga feel good that it's the last stroke\n\n[Chorus: Jeremih & Sevyn Streeter]\nOh, my\nYou keep that to yourself\nThe way you do it, baby\nIt's drivin' me crazy\nOh, my\nYou don't want no one else\nThe way you do it, baby\nIt's drivin' me crazy\nOh yeah, yeah, yeah, yeah, yeah", "image": "https://images.genius.com/09c32b18130291d70625c71320ecd211.1000x1000x1.jpg"}], "artist": "The Game"}