{"songs": [{"title": "Guest House", "album": "Ghostdini: Wizard of Poetry in Emerald City", "year": "2009-09-29", "lyrics": "[Intro: Ghostface Killah]\n{We're sorry, the number you have reached is not in service}\nFuck... fuck is these niggas at, man\n{Please check the number or try your call again}\n(Aiyo, hello?) Aiyo, bring that shit (what happen, son?)\nThat's my word, yo, these niggas is fronting out here (where at, where you at?)\nI'm in Jersey, you know where the fuck I'm at, nigga, I'm in Jersey\n(Aight, so, what happen though, man, what happen?) I need that shit\nI tell you when you get here, don't even worry about that shit\n(Aight yo, I'll be right there, man) Just hurry the fuck up, bring\nThat big joint\n(That's my word) Yeah (one) Yeah\n\n[Ghostface Killah]\nIn the crib on this rainy day, I'm chilling\nGlass pianos and Portuguese drapes, hang from the ceiling\nPersian rugs, Moroccan sofas\nI walk through the house in paisley robes and Ferragamo loafers\nAnd Iron Chef just season the salmon\nIt's coming down pouring, he watching BBC, eating a salad\nI'm on the couch hitting the chalice\nChecking my textes and out of nowhere, my dick is hard as a callus\nI stood up, pulled back my sleeve, checked my watch\nWhere the, fuck is my wife, it's 12 o'clock on the dot\nVery impatient, I'm getting nervous, can't stop pacing\nMy heart's racing, her Nextel don't get no service\nDamn, all this over a gallon of milk\nSomething, happened to her, somebody wig'll get peeled\nOkay, let me calm down, maybe she at Keeba house\nHer birthday's today, we both bought her jeans and a blouse\nSince 7 o'clock, she been gone for hours\nJetted up the steps to the master suite, checked the shower\nNope, all that is there is towels and soap\nStomach is nauseous, caught a big lump in my throat\nFound a phonebook with mad names, looked down\nBow, there go Keeba, tying my shoes, I put the bitch on speaker\nAnd bluntly addressed her, 'where's my girl?' (Shit, I don't know nigga)\n(Last time I seen her, Ghost, she hittin' on an old nigga)\nYo, Keeba stop playing, yo (Nah, we took a shot of Henn')\n(Maybe she was out by 10, I told the bitch, fuck that bitch)\n(Don't even try to call me, I'm getting me some mad dick)\n(Show these muthafuckas, how Keeba love to drive stick)\nI snatched up my raincoat, the grass was soaked\nUnder the bed in the guest house, where I keep my toast\nI yelled to the Chef, yo, watch for Kayla, check the pool and the bowling alley\nIf anything, just hit my cellular\nHopped in the go cart, the yard is dark, I'm bugging\nFew feet from the guest house, is where I parked\nHope she's OK, is what I say in my heart\nBut something don't feel right, so is what I'm saying to God\nAs I got closer, something ain't kosher\nI heard a bunch of squeaky sounds from the house, I don't think I'm suppose to\nIs this the end, of the Starks regime?\nLet me find out somebody on my ground, yo, is pounding my queen\n\n*door slowly opens*\n\n[Ghostface Killah] (Fabolous) {Shareefa}\nYo, I'mma kill, yo! (Hold on, cuz)\n{Baby, let me explain, you over reacting, that's not what it was}\nShut the fuck up, you got caught moaning with your legs up\nEyes all red, what? Did ya'll just blaze up?\nThen froze for a sec, so I dipped quick, lift the mattress\nAimed the biscuit at both of them bastards\nWhat ya'll excuse now (Yo, cuz, she said she live with her pop)\n(Her dude mad strict, that's why we up in the spot)\n(And yo, this little trick of yours, bought me a ten G watch)\nHe reached down for his drawers, thats' when I let off a shot\nBack the fuck up, snatched his covers\nHad 'em looking like the black Adam & Eve, some sinful lovers\n(Chill, Tone, put the gun down) How you know my name, son?\n{Hold on, let me explain} Yo, ya'll two is done\n(Just let me put my drawers, get dressed, before I get rocked)\n(Cuz real talk, is looking like you trynna let off that Glock)\nYeah, you right, you look familiar, you put my cable in, right?\nThe FiOS nigga, and you fucking my wife?\n(Yeah, I put that cable in, nigga, we both got caught)\n(And she a triflyn ass chick, don't act like it's all my fault)\n{Baby, no} Mind your business\n(Now Kayla, don't stop him, let the sucker do what he do)\n(He touch me, and he finished)\n\n[Outro: Ghostface Killah (Fabolous)]\nWhat, nigga, hold that, eat it\n(Oh shit, what the fuck) You forgot your drawers\nAnd your little tools, nigga\nYou FiOS mustache wearing muthafucka, I got you nigga\n(Fuck you, nigga, I'mma see you nigga)\n(Fucker, fuck) That's why you dive out the window\nOn some Jim Kelly, shit, nigga, fuck that\n{We're sorry, the number you have reached is not in service}\nFuck... fuck is these niggas at, man\n{Please check the number or try your call again}", "image": "https://images.genius.com/ea54fa933d61e534fbf14d9509cc7146.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}