{"songs": [{"title": "Fuego", "album": "SPIN CITY Vol. 1: Classic 90s & New School Underground", "year": "2010-09-19", "lyrics": "[Hook: La Bruja]\nTú nunca llegaras a quemar lo que quemo yo [x2]\nNo quieres jugar con mi fuego\nTen mucho cuidado que te quemo\nNo puedes jugar con mi fuego\nTen mucho cuidado que te quemo\nTate quieto cuando entro que te quemar con mi fuego [x2]\n\n[Verse 1: B-Real]\nI'll make you burn like the green that I stick in my pipe\nFeel the heat, scorchin' niggas with my flame on site\nIt's the real one, still some question the tactics\nI flip shit daily like it's fucking gymnastics\nSome call me brujo, greñudo, ya estuvo, but you know\nBetter than to fuck around with [?]\nRhymes kick quicker than triggers click\nYou ask why (why?)\nYou play props with your life so your ass dies\nWe smoke you, burn you like cash\nAnd we double toke you when you turn to ash\nAnd you soft ass busters fall apart and crumble\nTalk shit, mumble, can't stay on the humble\nBut I got the remedy, remember me nigga\nI'm gonna put you through it's remedies nigga\nThe serial rhyme killer, you understand dog?\nDon't get too close, I'll burn your hands off\n\n[Hook: La Bruja]\nTú nunca llegaras a quemar lo que quemo yo [x2]\nNo quieres jugar con mi fuego\nTen mucho cuidao que te quemo\nNo puedes jugar con mi fuego\nTen mucho cuidado, pendejo\nTate quieto cuando entro que te quemo con mi fuego [x2﻿]\n\n[Verse 2: B-Real]\nThe flame burns eternal, the inferno gets higher degrees-wise\nSome [?] up my journal\nFor all those concerned, don't hesitate and learn slow\n'Cause it's hot in hell, and you burn slow\nMagazines, emcees, the entries, [?]\nHollow heart, so make me spit dark to tempt me\n'Cause clearly, you ain't no friend of Real\nBut like superman, yo' punk I'm bending steel\nBitches quit trippin' and offendin' Real\nYou wanna act hard? I see you pretendin' still\nBitch, bump yo' head, take a Benadryl\n'Cause you ain't got no friends and no ends to build up\nAny momentum, but one moment please\n'Cause all live bullets will get fucked with [?]\nIt's freeze nigga (freeze nigga)\n[?] You lost your mind\nYou think you can fuck with me, it'll cost ya'\nBring any rapper on your roster\nI'll toss them out until there's no-one left to call up\n\n(don't trip) x5\n\n[Hook: La Bruja]\nTú nunca llegaras a quemar lo que quemo yo [x2]\nNo quieres jugar con mi fuego\nTen mucho cuidado que te quemo\nNo puedes jugar con mi fuego\nTen mucho cuidado,pendejo\nTate quieto cuando entro que te quemo con mi fuego [x2﻿]", "image": "https://images.genius.com/b686957b77cbdefef0f9ffe874f0cbc8.666x666x1.jpg"}], "artist": "Cypress Hill"}