{"songs": [{"title": "LA LA", "album": "STOKELEY", "year": "2018-11-30", "lyrics": "[Intro]\nLa-la-la (Huh)\nLa-la-la-la (Huh)\nLa-la-a, la-la-la\nOh my god, Ronny!\nStupid\n\n[Verse 1]\nLike a Quarter Pounder, I found her\nShe want a bite, dick game Ned Flanders\nShe said that, really nice\nWith my ice, I drown her\nI found her soul in the night\nShe's a salamander, cold-blooded the type\n\n[Chorus]\nYuh! This ain't that, bitch (Yuh!), that ain't this (Yuh!), yuh (Yuh!)\nThis ain't that, bitch (Yuh!), that ain't this (Yuh!), yuh (Water!)\nThis ain't that, bitch (Yuh!), that ain't this (Yuh!), yuh (Bitch!)\nIs that him that's talking shit?\nBend him like a brim (Yuh!)\n\n[Verse 2]\nI know she gon' swallow like the bitch can't swim, yuh\nHit her with a follow and the bitch gain ten, yuh\nWho the fuck the reaper? Fuck that nigga named Grim, yuh\nI am one with light inside the darkness of the den, yuh\nI'm a god but I'm still praising God, too\nI know a nigga know dogs, sell dog food\nKnow my game on point, no harpoon\nKnow these niggas said I'm fried, so I told 'em get fist\n'Cause these niggas too old, too broke too (Ayy, ayy)\nCut em' off my frequency, no Pro Tools (Ayy)\nBlue cheese and blue jeans and you know they're Balmains\nSo they come with the wrinkles like a Pug do (Ay, ay, ay, ay, ay)\n\n[Chorus]\nYuh! This ain't that, bitch, that ain't this, yuh!\nThis ain't that, bitch (Yeah!), that ain't this, yuh! (Woo!)\nThis ain't that, bitch (Ha-ah!), that ain't this, yuh! (Bitch!)\nIs that him that's talking shit?\nBend him like a brim (Let's go!), yuh!\n\n[Verse 3]\nGucci on my body feel like water, I can't swim (Yuh!)\nSo I bought a Gucci rubber ducky with the fins (Yuh!)\nWhen I was a youngin', hid at home, I was 10 (Yuh!)\nTold my Dad, \"I'm selling molly,\" ninth grade in (Yuh!)\nYou are now inside of my mind\nIt is very black and white, no mime\nI put diamonds up on my time, mmm\nLaid back sipping Fiji with the lime, do\nShe an animal, eat me like bamboo\nYoung nigga, and I'm sly like Cantu\n\n[Chorus]\nYuh! This ain't that, bitch (Yuh!), that ain't this (Yuh!), yuh (Bitch!)\nThis ain't that, bitch (Yuh!), that ain't this, yuh (Woo!)\nThis ain't that, bitch, that ain't this, yuh (Water!)\nThis that him that's talking shit (Bitch!)\nBend him like a brim (Bitch!), yuh!\n\n[Outro]\nLa-la-la-la\nLa-la-la-la\nLa-la-la-la\nLa-la-la-la\nLa-la-la-la", "image": "https://images.genius.com/66707e67245fd5b934257c15027ab096.1000x1000x1.jpg"}], "artist": "Ski Mask the Slump God"}