{"songs": [{"title": "Independent’s Day", "album": "Independent’s Day", "year": "2005-06-28", "lyrics": "[Verse 1: Royce Da 5'9\"]\nYeah, yeah\nWell it's the uhh, uhh, abbrevia-ated letter\nAssociated with meta-metapho-phores and cheddar cheddar\nThe C.O.D., the P.O.P\nThe \"cash on delivery\" at the \"point of purchase\" - don't I be workin'?\nHeaven and hell is standin' next to you at the same time\nCuttin' into your playin' time, keep playin' (playin')\nMost of my predictions is speculation based on the patience\nI've developed hustlin', racin' this check I'm chasin' (chasin')\nSellin' mixtapes to them albums from 30 to 50 thousand (wow)\nIt ain't no problem, I got it, my following got me (got me)\nLong as I continue to spit poems\nTo send you niggas back to the L-A-B\nI'mma be sellin out venues\nBe out at them venues, sellin that merch'\nShippin' CD's overseas, nigga we sellin' that work\nThe Escrow crew, just ran by the petro man\nSelect don't know who the check go to\n\n[Hook: Royce]\n'Round here here, 'round here, 'round here\n'Round here they call me independie\n'Cause of how independent my pen be\nMovin' on that paper, movin' that paper\nUhh, uhh, 'round here, here, here\n'Round here they call me independie\n'Cause of how independent my pen be, uhh\nWe be on that paper like ink on that paper, uhh\n\n[Verse 2: Royce Da 5'9\"]\nYou can call it the quickest winter, the unstoppable summer\nThe opposite of the apocalypse comin' to popular\nWanna be poppin' this gun\nHe about to be doin' some old impossible Three 6 Mafia numbers\nEach quarter like the Beach Boys or the Beatle\nThe Parliament globally callin the shots explodin 'til 'Pac\nRoll all the way over, respectfully hate me, you best to behave\nI'm seven dollars a record makin' heftier pay\nCan you realize platinum artist buck by buck, is that what you say?\n200 thousand sold compared to the average platinum rapper\nCouldn't afford, what I blow on all my taxes\n'Cause I own my own masters, own my own catalogue\nAin't tryna be old talkin' 'bout \"Oh, I had it all\"\nSo it's mo' money, mo' albums, add 'em all\nThe scanner that seal is the reason I feel like a man of steel\nStill standin' 'cause I'm still scannin'\n\n[Hook: Royce]\n'Round here here, 'round here, 'round here\n'Round here they call me independie\n'Cause of how independent my pen be\nMovin' on that paper, movin' that paper\nUhh, uhh, 'round here, here, here\n'Round here they call me independie\n'Cause of how independent my pen be, uhh\nWe be on that paper like ink on that paper, uhh\n\n[Outro: Royce]\nY'know I always like to say that this album is like a median\nBetween \"Death is Certain,\" and \"Rock City\"\nBut along that way, I manage to find my independence\nSo that's where we at right now\nRoyce Da 5'9\", \"Independent's Day\"\nWhattup Broady, you know'm talkin' 'bout Broady?\nNiggas act like I ain't know they ass as I want to\nThese units will move, I will be on that TV screen\nI will be ridin' through a hood near you\nGettin' some attention from yo' bitch, hahaha\nM.I.C., oh yeah and we comin' back again this year too\nWe not gon' be sittin' out for long periods of time no more\nSo be on the look out for \"July 5th\"\nComin' soon to a motherfuckin store near you\n'Round here, here, here..\n\n\"Let me see, two words to sum up my name in reality – growth and patience, y'know they work hand-in-hand with each other, but at the same time they both deal with movin' forward. I just try to keep some bits about myself 24 hours a day. Y'knowmsayin? I been through a lot and if it's one thing I can say that I learned, it'll be stay bossy. I'm a boss, boss, boss..\"", "image": "https://images.genius.com/5296587baa4eefd1b2b1ef7daff66f78.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}