{"songs": [{"title": "Heartbeat", "album": "The Day After", "year": "2005-10-04", "lyrics": "[Intro: x2]\nHeartbeat\nHeartbeat\nHeartbeat\nBreathe nigga, breathe\n\n[Verse 1]\nOh, Twista told you don't make him mad\nYou won't like me when I'm mad, I'm a motherfucking beast\nTry nigga, I'mma ride nigga, you still alive nigga\nGon' die nigga, gon' drop, cause ain't no room at the top\nWalk in the room like I'm 'Pac, bringing you doom when I rock\nIts suicide nigga, blood stains nigga, nuts hang nigga\nBust them motherfuckers from my black, mustang nigga\nYes I shot them with the pound, got them with the rounds\nHollow point to lay his motherfucking body on the ground\nNow you breathing and shaking cold, hoping that god don't take your soul\nWith two bitch straps and a vest is just the only way to roll\nNow if you don't wanna die, then I suggest you better try\nBreathe hard, hold on to your life, fight nigga\n\n[Hook: x2]\nCan you feel your, heartbeat?\nYou still got a, heartbeat\nThey can take away your, heartbeat\nBe strong nigga, breathe nigga breathe\nCan you feel your, heartbeat?\nYou still got a, heartbeat\nThey can take away your, heartbeat\nDon't die nigga, breathe nigga breathe\n\n[Verse 2]\nA demon in the club, got them leaning in the club\nHit them with the screwed voice, I got her screaming in the club\nPull up on the sista, according to the scripture\nI'mma break 'em off again, when I metamorph into twista\nShit, I'm coming with the pistol, when I gotta kill 'em up\nApocalyptic I'mma get 'em, when I hit 'em up\nFill his body up wit holes, and the terror that will follow\nWill have a nigga hit the deck, when I send it up\nPut the pipe to your dome, I don't give a fuck about right from wrong\nI get in the club, a nigga be feeling so bold\nBut if a nigga talk shit, I'll go right for the chrome\nThen when you come back, come and see me do it worse\nI'mma shoot the vehicle up put your body in a hearse\nBring you back alive like the bullets was a curse\nMaking the drive or put the ride in reverse\nDon't wanna die again better get up in the wind\nCuz a nigga kinda handy with the black four fin\nOr I gotta hit him wit the millimeter nine or the rhyme\nEither way it'll be a flat line\n\n[Hook: x2]\nCan you feel your, heartbeat?\nYou still got a, heartbeat\nThey can take away your, heartbeat\nBe strong nigga, breathe nigga breathe\nCan you feel your, heartbeat?\nYou still got a, heartbeat\nThey can take away your, heartbeat\nDon't die nigga, breathe nigga breathe\n\n[Outro: x4]\nYou still alive nigga", "image": "https://images.genius.com/6e50ebd81ceeb1860beb446ab2cdec8e.1000x1000x1.jpg"}], "artist": "Twista"}