{"songs": [{"title": "Throw Your Flag Up", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Intro: RZA]\nEh-yo, Kinetic\nWhat up God? You got that Glock cleaned?\nSoaked those bullets in oil?\nSo yo, I'mma call the Black Knights up\nAnd North Star from down in the Westside\nNah mean?\nEh-yo, they gon' come and blast this shit over\nYouknowImean?\nThink we don't need no Shaolin cats for the job\nTake it to the Wild Wild West\n{​*beat kicks in*}​\nBOODOODOO..\n\n[Intro Pt. II: Crisis (RZA) {​Ms. Roxy}​]\nYeah.. (Come on son)\nThe one and only.. sharpshooter..\n(Spark these niggas my nigga)\nYo I speak to be heard {​Digital}​\nThe truth shall set you free {​Digital}​\n(Set them niggas free God)\nYou in a Chamber, in the Chamber {​Bobby, Bobby, Bobby..}​\n(BOODOODOO.. Darkness, you know? Must come to light)\n\n[Verse 1: Crisis (RZA)]\nEh-yo, it's the sharpshooter, one and only, guaranteed\nI ain't tripping, yo it ain't no comparing me\nTo nothing else, untraceable, like a stealth bomber on your radar\nThere they are, take a look, yo I spit the uncontainable\nHighly flammable, unexplainable\nGame Pro - Crisis show you how to tame a ho\nShow you how the game should go\nSo you lames can know\nBlack Knights equals nothing but dope\nSo what you working with?\nYou bitch niggas ain't hurting shit, spitting commercial shit\nWe rhyme for different purposes\nI spit for the cause, you spit for the broads\nI spit for the streets, you spit for the geeks\nI spit for North Long Beach and all of my peeps\nHolding it down, I spit for the meak\nWe holding the crown, you savage niggas had your chance\nSo now it's on us, it's just us, you get your bones crushed\nYou got against us, resist us?\nI thinks not (thinks not), it's impossible {​*echoes*}​\n\n[Break: RZA]\nIf you live for the blood, Throw Your Flag Up\nIf you got the love in your heart, Throw Your Flag Up\n\n[Verse 2: RZA]\nRollie Fingers in the back, son rolled the bag up\nStreet had the pen and the pad, he threw a tag up\nUncooked beef in the street, they tagged the rag up\nGoldie got the clip from the closet and filled the gat up\nBobby sharpened the razor, oiled the bat up\nLet the dogs out the basement, pulled the rap up\nSomehow the Brown cats about to get clapped up\nPussy high nigga off coke tried to act up\nAgainst the world's greatest mind, Bob Digital\nMight throw a Shaolin Hand-block or a fifty-two\nMy young son Big Un don't fuck with Patty Cake\nBound to walk through the woods barefoot, choke a rattlesnake\nWhile his brother Melchizedeck, dissect it\nUp in the project life, the street's be hectic\nThe gun burst, son shot his tongue first\nShouldn't've shot his tongue first, should've shot the gun first\nNow chew on the Sunburst, bitch, it's Bobby's day\nLyrics for the out, click click, like shottys spray\nTear through flesh/bone, get lodged up in your ass cheek\nCuz you came talkin' that same bullshit last week\nFuckin' cokehead nigga, what? Your brain numb?\nI used to wonder where these pussy-clats came from\nUp in the thirty-six cell block I Shadowbox\nSip on wheat grass and build up like a male ox\n\n[Break: RZA (Monk)]\nIf you love for the Glock, +Throw Your Flag Up+\nIf you got love for the Gods, +Throw Your Flag Up+\nIf you live from the heart, +Throw Your Flag Up+\nDon't cause the beef, I might tie the rag up\nAll my Digihead niggas, roll the bag up\nBOODOODOODOO.. and +Throw Your Flag Up+\n(If you come from Long Beach, +Throw Your Flag Up+\nIf you come from Compton, throw your rag up\nIf you come from the West then throw your hood up\nIf you come from the block then +Throw Your Flag Up+)\n\n[Verse 3: Monk]\nI spit the flavor for the ear, shit for the streets\nRollin' in the cutty about five niggas deep\nOne SK, two Tec-9's and two sticks\nReady to trip on these fools around my way poppin' shit\nLike the Black Knights don't air them things out\nKnuckle up in the spot 'til someone get drops\nStomped, get passed out\nPassed out off a pint of that pah, ready to mic brawl\nClean sweep, took the first pitch, knocked the home-run\nBlack Knights known to grab mics, leave the spots full blown\nYou know motto, the +Knights or Nuttin'+, so stop frontin'\nLike you ain't heard this high pitch through your twelve-inch\nKenwoods,  Alpines, I keep those six-by-nines thumpin'\n+Jumpin' Jumpin'+ like Destiny, I laced it with the Rugged recipe\nYou know my technique on a Ra' beat\nSpeak the Digi slurred speech but aggressive with the mic\nOn mine, it's strictly Black Knights\nSteal the spotlight, show niggas how to rock mics\nThe right way, spit like a K, M-o-n-k\nThe conqueror, smash your sponsor\nLearn the lesson from the Black Knight lethal +Silent Weapon+\n\n[Outro x2: Ms. Roxy]\nDigital, Digital, Digital..\nBobby, Bobby, Bobby..\nDigi, Digi, Digi..", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}