{"songs": [{"title": "Rainy Dayz", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Intro: Blue Raspberry]\nIt's a mystery inside\nOf how I'm gonna get mine\nI'm thinking 'bout so many ways\nOf how to conquer these rainy days\n\n[Dialogue]\n– You sang beautifully just now\n– I sing for him, and he isn't here\n\n[Ghostface Killah]\nIt's going down man, word man, what's up black?\nNiggas just fuckin' robbed my gate man\n\n[Raekwon]\nWord?\n\n[Ghostface Killah]\nFuckin'... I'ma murder somebody man\nFor real I ain't playing, whatever whatever\n\n[Hook: Blue Raspberry]\nIt's raining, he's changing\nMy man is going insane, insane\n\n[Verse 1: Ghostface Killah]\nThe war is on, yo\nOn rainy days I sit back and count ways on\nHow to get rich son, show and prove, ask my bitch\nStood up late nights, build with my a-alikes\nWe can pull a heist, snatch ice, or rock mics\nBut this rap shit, got me wanna clack back the latch\nHow it goes the only pesos made from scratch\nBut in due time, soon to get mine like Bugsy\nHeavy on the wrist, Polo Moc, Socks and Rugby's\nOld flicks remind me of Gucci's\nBack in Union Square when little Maxmil, blast Pierre\nThat was Build Build, fast forward, ninety-four\nWho got the bad base? Filthiest fiends scream for more\nBless me out of state, howdy Jake, Starks is back\nNiggas want work, 9 brought back off a g-pack\nCoke rocks flood the co-ops living gossip\nThem big lip niggas singing to cops need to box it\nStop it, the projects overflooded with slow leaks\nThe fiends get, new faces get wrapped in sheets\nI gotta get mine, like my old Earth, bless the cheese line\nSipping on fine wine, the power of the blacks refined\n(Rainy days) Divine\nWaiting on these royalties takes too long\nIt's like waiting on babies, it makes me want to slay thee\nBut that's ungodly, so yo God, pardon me\nI need it real quick, the dough flow like penmanship\nMeat heads get pistol-whipped, I blow spots like horse shit\nSo now talk shit, nigga what?\n\n[Hook: Blue Raspberry]\nIt's raining, he's changing\nMy man is going insane, insane\nIt's raining, he's changing\nPast sunlight, more gunfight\n\n[Verse 2: Raekwon]\nWhat brings rain, hail, snow, and earthquakes\nThe beat breaks, cause all my niggas to break son\nStyles is similar to criminals locked up\nWith gats, ghetto tabernacles is fucked up\nI live once, though the mind stays infinite\nTraveling to touch nine planets, in my midst\nWhile I carry, to earn a decent salary\nSoon get married, raise a family, but the plan'll be\nReal great, to sit up in the loft, count stacks and max\nAnd real cats cold watch my back\nBut listen to the Wu son, and maintain\nIt's all real, starving individuals kill\nI puff what's only right, leave the poison alone\nProjects, infested with rats, cats, and crack homes\nHalf of us'll try to make it, the other half'll try to take it\nSo many fake half real freedom-build\nBorn to science my alliance analyzes\nWild surprises, keeping my eyes wide to this\nThe unfortunate, laying in mountains counting\nWith jewelry on, can it be the next team house the horn\nChill dun, just for real ones, light the lye up\nI hate to have to tie the next guy up\nPay attention to 1010 WINS, Wu blends\nNow I'm steering you to truth, buckle up\nNow who's a legend?\n\n[Hook]\nIt's raining, he's changing\nMy man is going insane, insane\n\n[Raekwon]\nWord up dun\nPeace to Philly, VA, these days\nWord up y'all, word up\nThe sun moon and stars fly cars, word up y'all\n\n[Outro: Blue Raspberry]\nNo sunlight, more gun fights\nI've lost him to the street life, street life\nNo cash flow, no more dough\nHe's someone I don't even know, someone I don't know\nRainy Days\nGetting through those rainy days\nGetting through those rainy days\nGetting through those rainy days\nGetting through those rainy days\nI lost him to the street life, the street life, whoa", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}