{"songs": [{"title": "Glory", "album": "Fahrenheit 1/15 Part II: Revenge of the Nerds", "year": "2006-01-01", "lyrics": "[Verse 1]\nWhen your spirit is strained\nAnd you limited to change\nThe lyrics in your limericks'll change\nA different hook, the way the sentences arranged\nMore demented in your deliverance, more sinister in your slang\nSounds more belligerent when it's sang\nThe truth is limitless in its range\nIf you drop a 'T' and look at it in reverse it can hurt\nLook at the grimaces of the pain\nAnd it's worse when it works and your membership is gained\nBut you forgetting the proof diminishes in the flames\nLike 'poof', the media pours images in your brain\nOf the score of the war where militants is slain\nThe faces of the guilty where innocence is proclaimed\nAnd they filthy, the deaf ears are the winners\nThe listeners are the lames\nOf the ballad of the man that the son of a minister has became\nSo\n\n[Hook]\nWherefore does my glory go?\nWherefore does my glory go? (Glory, glory)\nWherefore does my glory go?(Wherefore does my glory go?)\nWherefore does my glory go? (Glory, glory)\n\n[Verse 2]\nBut you gotta understand, our differences is the same\nWhat starts in clouded minds, finishes in the reign\nOf the fools that are used as instruments in the game\nWhere oppression is the queen and ignorance is the king\nWhere revolution is dead, no candles in is memory\nNo remembrance of its fame, just a mystery\nNo mentioning the history of the chain, the enemy\nNo hennessy sentiments in its name\nJust an unmarked grave that menaces have defamed\nWith the propaganda, and images of the gangs\nA lost art, no apprentices in it trained\nAnd they brainwashed, no interest in its stain\nAnd the minds weary, all the adrenaline in it drained\nWhile the wrecking ball is, disassembling things\nHer highness is the cause, his eminence is the blame\nThe pride is still there, the privileges still remain, but\n\n[Hook]\n\n[Verse 3]\nAnd you've gotta respect the position in which you playing\nNever let your heart reflect the conditions in which its staying\nEven if it's dark, and the temperature is the same\nAs winters in the Ukraine, your appendages is in chains\nHave forgiveness from the start, keep maliciousness restrained\nBe smart, never indiscriminate in your aim\n'Cos there's innocent witnesses oblivious to the things\nThat come, the one's the hypnotists keep entertained\nAnd you can't arc, have some resilience in your frame\nStay resistant, and stay committed to what you sing, 'cos\nThey can flip it the minute that you refrain\nRead the book and the lines, and literature in between\nAnd gotta be educated when going against the grain\nPay attention, they illegitimate in their claims\nThey assisted in the killing and pillaging\nIn addition to the addiction\nShit is much bigger than just them planes, but\n\n[Hook]\n\n[Outro]\nWherefore does my glory go?\n(Is it on TV? Yeah)\nWherefore does my glory go?\n(Maybe it's on a CD?)\nWherefore does my glory go?\n(Do you see it when you look at me?)", "image": "https://images.genius.com/dbe43b56e43c0bf22c2ad2f2bce13dd0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}