{"songs": [{"title": "Young Man", "album": null, "year": null, "lyrics": "[Intro: Talib talking]:\nTalib Kweli. Kanye West. \"Pay close attention to my story\" John Legend. \"You'll find every word is true\" Blacksmith, G.O.O.D. Music connection. It get's no better than this. Exclusives. One, two. Mic check. Mic check\n\n[Hook]\n\"Young man standing on the corner\"\nYoung man where you goin' in life, you know it ain't right\n\"Sellin' death, no conscious has he\"\nYou can't escape the shadow in the light\nShine on ya\n\"Young man standing on the corner\"\nYoung man where you goin' in life, you know it ain't right\n\"Sellin' death, no conscious has he\"\n\n[Verse One]\nYeah, the conscious MC\nSometimes I keep it simple\nFuck what the nerds say\nAin't tryin' to impress you with the intricate wordplay\nCatch me at a bodega and plus I know my neighbors\nA little too well, it's like my walls are made of paper\nBut this is New York City\nWhere our music Biggie\nWe do it gritty, take you through it like you grew up with me\nFirst I'mma make a comment\nIt's time to change the context of what's considered conscious\nWe the concept obnoxious\nAnd let me make a promise\nI'mma always keep it honest\nAnd to portray all my people cause we put in boxes\nCategory\nTryin' to make a break through\nDealin' with the hateful\nTryin' to stay faithful\nGot an attitude house niggas can't relate to\nListening to music that the field niggas escape to\nI plays phonetic\nOver revolutionary rhetoric\nCause I'm down for action like a predicate\n\n[Hook]\n\n[Verse Two]\nYou can't escape\nYou can't escape\nHe patriotic to his niggas over God and country\nHe felt 'Pac when he said Only God Can Judge Me\nYou see the [?] walkin' in the playground\nStalkin' like a predator, you're baby ain't safe now\nWait now, ain't it big how he talkin' like he evil\nAnd the [?] never acknowledge how he could be tryin' to feed his people\nYoung, black and throw in a line up\nLabeled as a 'gang banger' though he never signed up\nCops is tryin' to get the crime up\nYou get that on your record\nEmployers gonna check it\nFire you, so now you gotta resort to the only method\nThe scene will guarantee any sense of clarity\nAs to when the rental be paid, it's street salary\nYou're sure to meet tragedy, die or go to jail\nBut somehow, it all seems worth it and that's real\nWishin' for the day you can say it's your last deal\nBut you know you be portrayed like Jesus at His last meal\nThat's...\n\n[Hook]", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}