{"songs": [{"title": "Boom", "album": "Doggumentary", "year": "2011-03-08", "lyrics": "[Intro: T-Pain and Snoop Dogg]\nBoom!\nBoom!\nYeah, top dog\nBoom\nHaha, uh\n\n[Verse 1: Snoop]\nGet your money, whip your hair\nExecutive branch blowing smoke like a player\nYeah in the club, yes it cracks\nCute little mama, but they stacked with backs\nI’m smoking grape, purple urple\nYou in doggie world, come and join my circle\nI break down herbal 'til I move like a turtle\nMy money is green, and my Porsche is turbo\nIn hot pursuit, come rock with Snoop\nBaby's a lawyer, her body's the truth (Cute)\nI’m in the game for real, it pays to chill\nI walk in the club, and they front the bill\nI’m the big dog, best beware\nYou coming with me, if you stop and stare\nShe'll be on my team, in my car\nOn the way to the spot, yes you are\nToasting up, hosting us\nAnd when we done, we west coasting love\nFor shendo, blowing endo\nHow much for the dog in the window\n\nOh\nWh-what, wh-what?\nBoom!\nBoom!\nSay what? Say what?\nBoom!\nTalk to 'em T-pain\n\n[Hook: T-pain]\nBaby I’m a dog! (I’m a dog!) Beware! (beware!)\nI’ll do whatever, however I want! (I want!)\nThis one for y'all! (This one for y'all!) Oh yeah! (Oh yeah!)\nNow put your hands in the air (now), whip your hair and go\nLa, la la la\nBoom shakalaka when it drop, oh I'mma have her saying\nLa, la la la\nOne hitter quitter, shawty know the damn thing\nBoom!\n\n[Verse 2: Snoop Dogg]\nI'm all about the money, the money I got\nOn the V.I.P. tip, Maserati's in the lot\nChilling with the stars, where the bottles never stop\nGot a model on my lap, baby show me what you got\nWith a cup of Landy, Tiffany and Sandy\nGirls who like girls, wanna do it to daddy\nReal talk, tha suites is next\nOne more drink gonna lead to sex\nThese girls is bad, the floor is packed\nThey shut the door down when it reach the max\nWhatchu tryna drink? Clear or yak?\nShe got a apple-bottom homie, all I do is mack\nI does it well, your game is wack\nI gets to the business, no chit-chat\nNow where do we go? I beast the gush\nShe in love with the gangster, that's whassup\n\nThat's whassup!\nBoom!\nThat's whassup!\nBoom!\nThat's whassup!\nBoom\nSpit to 'em T-Pain\n\n[Hook: T-pain]\nBaby I’m a dog! (I’m a dog!) Beware! (beware!)\nI’ll do whatever, however I want! (I want!)\nThis one for y'all! (This one for y'all!) Oh yeah! (Oh yeah!)\nNow put your hands in the air (now), whip your hair and go\nLa, la la la\nBoom shakalaka when it drop, oh I'mma have her saying\nLa, la la la\nOne hitter quitter, shawty know the damn thing\nBoom!\n\n[Verse 3: Snoop Dogg]\nBoom shakalaka, here comes the chief rocka\nSmoke good with T-Pain, and Snoop the weed doctor\nBig 808, now feel the base in your chakra\nAnd watch me smoke like a shotta'\nCoke bottle shape, light green eyes\nDrunk off of love like a Colt 45\nI keep kush in my lungs, I'mma smoke 'til I die\nJust bust a bad one, for my homie D. Dimes\nThey do it for fortune, some for fame\nI got five different strains, you ever taste Purple Rain?\nTurn up the volume, adjust the game\nAin't a damn thing change, still a G-thang\nLil' mama whip your hair, exhale the chronic\nAs the smoke disappears, I'm ready to ball\nYour girl on my team, and she ready to fall\nAnd if you didn't know, I'm the big Snoop Dogg\n\nBoom!\nSay what? Say what?\nBoom!\nI don't think they heard you\nBoom\nTalk to 'em T-Pain\n\n[Hook: T-pain]\nBaby I’m a dog! (I’m a dog!) Beware! (beware!)\nI’ll do whatever, however I want! (I want!)\nThis one for y'all! (This one for y'all!) Oh yeah! (Oh yeah!)\nNow put your hands in the air (now), whip your hair and go\nLa, la la la\nBoom shakalaka when it drop, oh I'mma have her saying\nLa, la la la\nOne hitter quitter, shawty know the damn thing\nBoom!", "image": "https://images.genius.com/bf66457764b32165c7cdb2908ea44580.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}