{"songs": [{"title": "Oh Yeah (2012)", "album": "Fuck Da City Up", "year": "2012-01-01", "lyrics": "[Hook: T.I. & (Trey Songz)]\nWherever you are, I'm sorry I'm gone (oh-oh)\nThem bitches say they miss me, tell em shawty not long (yeah, yeah)\nGot them so turned on til they so turned out (oh-oh)\nCause I'm so turned up and I'm burnin that loud (yeah, yeah)\nI pull up, hop out, all the bitches like wow (oh-oh)\nCatch me at Philippe Chow or at Vegas in Tao (yeah, yeah)\nIts a sold out crowd bitches from the front row (oh-oh)\nUp to the nose bleeds and they all wanna go (yeah)\nNo they all wanna go, I make em say (oh-oh)\nAy, they all they wanna go, ay don't they Trey? (yeah, yeah)\nHey if your girl wanna go tell her say (oh-oh)\nAnd if that broad wanna go she should say (yeah, yeah)\nNow from LA to the bay, I make em say (oh-oh)\nAnd from New York to MIA, bitches say (yeah, yeah)\nFrom Chi-Town to the D, bitches scream (oh-oh)\nSt. Louis, Houston do you wanna go with me? (yeah)\n\n[Verse 1: T.I.]\nHey you can catch me in Atlanta with my pedal to the floor\nOn that 599 guts like a bloody nose\nAin't no secret how I kick it nigga everybody know\nBout my paper sorry no time for you haters gotta go\nWhen im on the westcoat in that ghost on that low\nOne 5 for a movie, quarter mil for a show\nGotta pill in a bottle for the rod for a ho\nSweet heart to a lady, still hard on a ho\nThank god for my lady I know they be on that radio wiling\nWhile we chilling somewhere on an island, smiling\nOn a big yacht is he really that hot\nAin't you too niggga guess not\nBitches hoppin on my dick, 'fore I hop up out the car\nWalk away with 5 or 6 as im passing by the bars\nSee im tuggin on my zipper as I fire up my cigar\nLets get this straight, you go get naked get it crackin till tomorrow\n\n[Hook]\n\n[Verse 2: T.I.]\nYeah we in the same book, but I'm on another page (capeesh)\nKing off the leash out the cage on the streets\nKill niggas like AIDS, cut bitches like blades\nShine always, fuck you when whatever y'all say\nBitch nigga I'm paid even when I'm locked up\nHeard nigga went broke, well shawty not us\nCaught a case, did a bid, they say shawty washed up\nTo a bitch, bullshit then shawty popped off in yo motherfucking town\nJust to show it's going down\nMy brother and my lil cousin got you lady goin round\nNigga I dont want her, I'm so superior by far\nShe'll never see the inside of my car\n\n[Hook]", "image": "https://images.genius.com/c4a42649ba1a4f401f2ed78317e312fc.1000x1000x1.jpg"}], "artist": "T.I."}