{"songs": [{"title": "Me", "album": "Diary Of a Trap God", "year": "2014-07-14", "lyrics": "[Intro]\nMe, I got my own back\nI'm the CEO, CFO, account manager, and security\n\n[Verse 1]\nWho the only one you trust? (me)\nCEO, so who I'm signed to? (me)\nWhen I got beef, man, who I run to? (me)\nShe live with you, but why she riding with (me)?\nBags of kush, who my weed man? (me)\nPTs, BTs, man, who my lean man? (me)\nSo much jewelry, I got a million on (me)\nVersace down, these hoes keep kissing on (me)\nYellow diamonds, dripping, pissing, say I rap explicit\nIn the kitchen whipping, doing the dishes, I'm my own assistance\nI hit a lick so low cuffed on myself, then I took me to Lenox\nIf you ain't getting no money with me then what you doing with me?\n\n[Hook]\nMe, me, I only think of me\nHoes say that I'm conceited cause it ain't a \"we\"\nI book the club and do the show, chop up the bag with me\nI cop the dope, then front the dope, then me come shop with me\nOn the TV watching me, in a Bentley listening to me\nI'm my own stylist, I'm dressing me; I'm my own goon, I'm shooting for me\nI'm so turnt I'm jocking me, you hating on me and I'm hating on me\nWatching you watching me, and she cheating on you and she cheating on me\nMe, me\n\n[Verse 2]\nMimi, Mimi, me, yeah the bitch name Mimi, me\nFucking and sucking me, but I know the bitch running game on me\nAnd she put the thang on me, why you put the blame on me?\nThat's a shame on me, and her credit card on E, car on E\nSo, yeah, she put her mouth on me\nPut it on freeze is a mini disease\nPowerful me, can you do it for me?\nShopping for you like I'm shopping for me\nLike I'm trapping for you but I'm trapping for me\nBoss of a nigga but working for me\nStruggle for you but she cuddle for me\nBoss of my label, I'm rapping for me\nAnd where would I be if it wasn't for me?\nTony Montana Six wasn't for me\nWasn't for you and she wasn't for me\nDon't leave it to beaver, man, leave it to me\nLooking at me and I'm jam of the week\nRiding through the through with the top in the teeth\nGucci Gambino, who talking to me?\nBaby Latino, she fine in some jeans\nGucci bilingual, I'm talking to ti\n\n[Hook]\nMe, me, I only think of me\nHoes say that I'm conceited cause it ain't a \"we\"\nI book the club and do the show, chop up the bag with me\nI cop the dope, then front the dope, then me come shop with me\nOn the TV watching me, in a Bentley listening to me\nI'm my own stylist, I'm dressing me; I'm my own goon, I'm shooting for me\nI'm so turnt I'm jocking me, you hating on me and I'm hating on me\nWatching you watching me, and she cheating on you and she cheating on me\nMe, me\n\n[Verse 3]\nI got lean by the PT, but I'm serving me\nAnd they should name me De-me-trius cause all I think about is me\nMTV, that's Me TV\nHOV, but I'm ridin' just me\nOne deep chilling in this damn RV\nWith a touchdown, I'm a front this shit to me\nGive it to me, leave it to me\nYou screaming, \"Why did it happen to me?\"\nYour girlfriend squirting and spitting on me\nI guess baby girl happy to see me\nGot a trapping disease, smoking disease\nThem hustlers ain't welcome? I'm happy to leave\nYour uncle and brother be coping for me\n10 bales of the weed in they family trees\nSnitch of the force, say you got it from me\nAverage go broke it won't happen to me\nDon't got jumper but putting up the numbers\nSo much cash I need another machine\nRappers are fake, Gucci a G\nWho am I featuring? I'm featuring me\nDon't need a road manager, managing me\nManage the dope and the weed and the lean\n\n[Hook]\nMe, me, I only think of me\nHoes say that I'm conceited cause it ain't a \"we\"\nI book the club and do the show, chop up the bag with me\nI cop the dope, then front the dope, then me come shop with me\nOn the TV watching me, in a Bentley listening to me\nI'm my own stylist, I'm dressing me; I'm my own goon, I'm shooting for me\nI'm so turnt I'm jocking me, you hating on me and I'm hating on me\nWatching you watching me, and she cheating on you and she cheating on me\nMe, me\n\n[Bridge]\nWho the only one you trust? (me)\nCEO, so who I'm signed to? (me)\nWhen I got beef, man, who I run to? (me)\nShe live with you, but why she riding with (me)?\nBags of kush; who my weed man? (me)\nPts, BTs, man, who my lean man? (me)\nSo much jewelry, I got a million on (me)\nVersace down, these hoes keep kissing on (me)\n\n[Outro]", "image": "https://images.genius.com/0c7ed83845eb021940125a831f5a2f11.667x667x1.jpg"}], "artist": "Gucci Mane"}