{"songs": [{"title": "I Do This (Remix)", "album": "Overly Dedicated", "year": "2010-09-14", "lyrics": "[Chorus 1: Kendrick Lamar]\nThe homies say I'm the truest\nThe bitches think I'm the cutest\nThe definition what cool is\nBoy, I thought you knew this\nBitch, I do this\n\n[Verse 1: Y-O]\nNow I prefer women with some sexy toes\nWith no corns but enjoys eating vegetables\nSeem like everybody love the role of assholes\nBut I'm feeling better being crowned with some bad hoes\nMr. Michael of Amish yo speaking\nFedora on the top, the black Abraham Lincoln\nI hear they fell in love with my penis\nOnly concerned with my balls like Venus\n\n[Verse 2: Thurz]\nHuh, they say I'm rolling like a big shot\nKama Sutra missionary, fuck shit up on top\nSay, I'm big time, Flavor Flav on a wristwatch\nAnd all these chickens want that rooster, call it Big Cock\nCo-co-co-cock that, aim and shoot that sure shot\nU-N-I, T.D.E. be doing it so go head and hop\nOn that bandwagon of my genitals, not new to me\nI’m still serving, broads on my TIP for gratuities\n\n[Chorus 2: Kendrick Lamar]\nThe homies say I'm the truest\nThe bitches think I'm the cutest\nThe definition what cool is\nBoy, I thought you knew this\nBitch, I do this\nBitch, I do this\nBitch, I do this\nThe definition what cool is\nBoy, I thought you knew this\nBitch, I do this\n\n[Verse 3: Skeme]\nOh Lord, here he come, there they go again\nKendrick got my cover fire, bitch I'm going in\nBurn a swisher up, then I roll again\nEe-Jay and Weezy, just make sure that dough keep rolling in, hah!\nGot the world going crazy\nBig chrome .380 if a nigga try and play me\nNigga's swag wavy, chauffeur got me car-pooling\nSo when it come to stunting, bitch I do it\n\n[Verse 4: Brown]\nNever been like you or wanted to be, I do me\nShe found out that I'm in a group, now she's a groupie\nDon't need a watch that's full of diamonds to know that it's perfect timing\nWe be shining blue and brown and got that golden Gucci\nYeah, keep it simple stupid, all I see is trendy all around me\nT.D.E. the movement, we Sore Losers out of Dallas County\nCountry accent, city fashion, lights are flashing on the cameras\nHoes are choosing, niggas' hating, we ain’t tripping, keep our balance\n\n[Chorus 2: Kendrick Lamar]\nThe homies say I'm the truest\nThe bitches think I'm the cutest\nThe definition what cool is\nBoy, I thought you knew this\nBitch, I do this\nBitch, I do this\nBitch, I do this\nThe definition what cool is\nBoy, I thought you knew this\nBitch, I do this\n\n[Verse 5: Kendrick Lamar]\nThese hoes want to love me, man\nSo I'm like, what up? Uh what up?\nUh, bitch I do this remix stupid, fire burning, people looting\nThat's the chaos, comes from K. Dot swinging swords and hanging nooses\nChucking deuces, then drop one, dropping music and I won\nCall me hot or call me Pac, every eye on me and it's obviously\nI'm close as next to kingdom come, I just run my city dude\nYou just make your city run, they hate to be next to you\nTables turn, say you earn rights to be the God MC\nI'm 'bout to make that halo burn, now goddamn that's some irony\nI am the messiah of society\nBeside a Halle Berry, feed me berries in Paris, oui-oui\nI carry on a great endeavor, ambition leave all men grief\nLike beliefs of Mason Betha, reporting from C-P-T motherfucker\n\n[Outro: Kendrick Lamar]\nBitch, I do this\nBitch, I do this\nThe definition what cool is\nBoy, I thought you knew this\nBitch, I do this", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg"}], "artist": "Kendrick Lamar"}