{"songs": [{"title": "Lord Of The Light", "album": "Catch the Throne: The Mixtape, Vol. 2 ", "year": null, "lyrics": "[Intro: Stannis Baratheon]\nThey're sellswords\n\nWe're willing to use blood magic to put you on the throne, but we're not willing to pay men to fight? I've never heard of visions and prophecies winning a war. Soldiers win wars. Soldiers on the ground. It's dirty on the ground\n\n[Verse 1]\nThe night is dark and it's full of terrors\nWhere your heart, nigga, where your courage?\nI was buildin' with the older guy, he said you act like you know it all\nAll praise to one true God\nHow you know if you alive if you don't got a few scars?\nThese cowards in power enforcin' these new laws\nNo respect for the poor people fightin' they wars\nWhen I pull out my sword, put away lemon cake cutters\nKeep my blade covered with the blood of the fakes\nSo just take daughters and they kill fathers and they rape mothers\nSisters make lovers out of their brothers for the great other\nAnd it's dirty on the ground\nHalf of Flea Bottom living on bowls of The Brown\nSay it's all for the gold when the poachers come around\nYou can smell the dead way before the vultures come around\nSoldiers comin' back after the battle\nStill gotta face the fear of the unknown\nDaughters and they sons grown\nThen they gotta explain why they been gone\nTook a man from his family just to get home\n\n[Hook]\nLord of the light to ya'll\nLord of the light\nLord of the light to ya'll\nLord of the light\nLet's go, let's\n\n[Verse 2]\nShadows are created by the light\nSo that's when we fight for our freedom\nThat's the battle for our lives\nWe stickin' out our tongue, we never bite\nThis why the arguments of the day is the violence of the night\nRespect and fear ain't the same so they get confused\nSee the vision when you're starin' in the flame\nIn this game of thrones, when you win you still lose\nCause your ego get insane when they cheerin' your name\nAnd they preyin' on your weakness\nCause they playin for keepers\nAnd they slayin' all your leaders\nNow your people face disease and famine\nAnd fuck the king cause we famished\nThat's why the brothers that I roll with don't be waving no banners\nWarriors for the cause and we raisin' a family\nAnd when it's time to exact revenge\nHave a son, come back from the dead\nLook to the light yo\nThe protector of the realm and the citadel\nLiving in squalor while the rich people livin' well\nI'm seein' they enjoying they seven Heavens\nAlmost like they forgot about the seven Hells\n\n[Hook]", "image": "https://images.genius.com/79300fbca741c0da5f837d0dcfdecf18.1000x1000x1.jpg"}], "artist": "Talib Kweli"}