{"songs": [{"title": "How U Do That", "album": "No Genre", "year": "2011-01-01", "lyrics": "[Hook]\nBob how you do that? H-how you do that\nBob how you do that? (in Atlanta)\nThey be like: B-Bob how you do that\nH-how you do that, b-bob\nHow you do that? (in Atlanta)\nB-Bob: H-how you do that\nHow y-you do that? (in Atlanta)\nThey be like B-bob\nH-how you do that, h-how you do that\nB-Bob how y-you do that? (in Atlanta)\nB-Bob how y-you do that?\nHow y-you do that? (in Atlanta)\n\n[Verse 1]\nNumber 1 on your playlist, one of Atlanta’s bravest\nThey wondering how I deal with the fame, I villainified, this gravy\nShout out to all the ladies\nI dont know how to say this but\nI’m into deep sea diving, I go deeper than the Navy\nBehavin’ like a maven, I'm crazy crazy crazy\nI rise to the occasion ’cause raging’s my occupation\nShouts out to my Haitians my Asians and my Caucasians\nLatina señorita es muy caliente\nThey say I’m amazing but, really it's amazing\nToday's world the craziest to make the main page\nJust to be a daily topic of a conversation\nKutta’s on the beat so I guess its an operation\nSo call me Dr. Bob yes I’m on the job\nShe say I’m like a teacher before she lights my yard\nStick to the script take a shit in your draws\nAnd I don't need to take you number girl this ain't no casting call\n\n[Hook]\nBob how you do that? H-how you do that\nBob how you do that? (in Atlanta)\nThey be like: B-Bob how you do that\nH-how you do that, b-bob\nHow you do that? (in Atlanta)\nB-Bob: H-how you do that\nHow y-you do that? (in Atlanta)\nThey be like B-bob\nH-how you do that, h-how you do that\nB-Bob how y-you do that? (in Atlanta)\nB-Bob how y-you do that?\nHow y-you do that? (in Atlanta)\n\n[Verse 2]\nYes she give it to me cuz she know just how I want it\nAnd if this where we battle we would be worthy opponents\nI had to get up on it, kinda how you do a pony\nIt's kinda like a bank 'cause she knows she wants to loan it\nShout out to my gangsta who get down in Atlanta\nWassup to Magic City, this here should be your anthem\nSo throw it on back cuz I want that butt\nI'ma still be hear when the sun comes up\nWhen the sun comes up who’ll still be here\nWith ball and a bat give me one more plaque\nSo I guess I might as well turn things up\nI’ma burn things up like the purp you puff\nTryna get loose she poppin that coo\nBut when she get through she goin serve things up\nAll the bad girls in the building just shake it\nOne time if ya feel it now\nI ain't really trippin bout yo homegirls with ya\nI'ma bring you home with 'em and she gob' get it\nLay up, ho, but I dont really want no more\nBut I'ma just go fast like a baseball throw\nFast like a kenco show\nNow I'm in the zone, I ain't even playin\nIn the paint no mo’ I'ma take it straight to the hole\nHell yeah, she know she bad, she so bad\n\n[Hook]\nBob how you do that? H-how you do that\nBob how you do that? (in Atlanta)\nThey be like: B-Bob how you do that\nH-how you do that, b-bob\nHow you do that? (in Atlanta)\nB-Bob: H-how you do that\nHow y-you do that? (in Atlanta)\nThey be like B-bob\nH-how you do that, h-how you do that\nB-Bob how y-you do that? (in Atlanta)\nB-Bob how y-you do that?\nHow y-you do that? (in Atlanta)", "image": "https://images.genius.com/d18ebaef113d710715491da16422feee.1000x1000x1.jpg"}], "artist": "B.o.B"}