{"songs": [{"title": "Blow My Buzz", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Intro: Swifty McVay]\nHmm, yeah\nThis just one of them days when yo' ass just wanna chill out\nAnd motherfuckers be all in yo' ear and shit, yknowhatI'msayin?\nOr that nagging bitch, that just like to hear herself talk\nBlowing all yo' high away\nNow that's some fucked up shit, heh\nBut it happens, yknowhatI'msayin? Yo\n\n[Eminem]\nYo yo yo yo\nSchizophrenia, how many of ya got it?\nHow many motherfuckers can say they psychotic?\nHow many motherfuckers can say they brain dry-rotted from pot?\nYou got it like I got it or not?\nIf you did, you would know just what I'm talking bout\nWhen your tongue's rotting out from cotton-mouth\nWhen you end up becoming so dependent on weed\nThat you end up spending a G in the vending machine\nYou got the munchies, look at you, junk food junkie\nPotato chips and lunch meat, up in the front seat\nSometimes you can get so paranoid from ganja\nThat's it gotcha thinking the whole world is watching ya\nOr maybe you don't smoke, maybe you just roll\nBut whatever your drug's yo, go for the gusto\nJust don't, come fuck with me when I'm doing my drugs\nYou see me in the club don't come fucking my high up and\n\n[Hook: Eminem/Kon Artis]\nBlow, my, buzz\nDo what you want to just don't blow, my, buzz\n(Do what you want to) And I'm gon' sit here and just roll, my, drugs\n(Smoke my weeeeed) And if you talk I'm gonna fuck, you, up\n(I might just whoop yo' ass) Just don't say shit and we'll be cool\n\n[Bizarre]\n{*ding dong*} Bitch let me in the house (Avon?)\nNo, I just came to eat your mother out\nIt's the big guy, doing a butterfly to the ground (go 'head!)\n[Eminem]\nBizarre sit yo' nasty ass down!\n[Bizarre]\nI spot this fat bitch from across the room\nNow suck my dick while your boyfriend's in the bathroom (yea yea!)\nMy face is pink, looking for a sink\nAnd don't worry bout what I put in your drink\nIt's called a date-rape drug, ten minutes you'll be fucked up\nOpen your nasty-ass legs up (yeah you whore)\nBitches I'm catching, blunts I'm matching\nDon't call me Bizarre, I'm the Reverend Jesse Jackson\n\n[Swift]\nWho the fuck is this guy, why the hell you in my presence?\nIt'd be cool if you was asking me some reasonable questions\nBut you on some bullshit nigga, this yo' last beer (f'real)\nGet the fuck off my dick and tell yo' bitch to bring here ass here\nI kick a ho out without giving her cabfare\nAnd leave her barefooted just for nagging in my damn ear\nWhen I'm out eating, you fags'll interfere\nThey don't go until I let 'em know a mag' is sitting here\nI get drunk and I smoke weed, whatcho' ass wanna hear?\nI didn't answer you clear, I met Manson this year okay?\nYou want some yay? I'll front yo' ass a play\nBut other than that, get the hell out my face\nBecause you niggas trying to\n\n[Hook 2: Kon Artis] (adlibbing)\nBlow, my, buzz (heeeeeeey)\nDo what you want to just don't blow, my, buzz\n(I'm gonna sit here) And I'm gon' sit here and just roll, my, drugs\n(hmmmmmm) And if you talk I'm gonna fuck, you, up\n(Shut yo' damn mouth!) Just don't say shit and we'll be cool\n\n[Kuniva and Kon Artis]\n[Kuniva] Yo, Denaun you seem shook\n[Kon Artis] I really am dawg - look!\nThis fat bitch keep chasing me trying to give me the nook\n[Kuniva] Aww, man you probably lead her on\n[Kon Artis] I just bought her a beer!\n[Kuniva] I saw her rubbing on your head while she was wiping your tears\n[Kon Artis] I admit, I was high, but you ain't seen me crying\n[Kuniva] Nigga, you lying, and you blowing my high, just stop denying it\n[Kon Artis] Well at least somebody in this bar is, this big bitch did\nThe ultimate by saying she wanted to have my kids\n[Kuniva] Look man you grown, just leave me alone, I'm in the zone\nCall it a night, get stoned, and take that fat slut home\nJust drink the drink, hit the dank, do some drugs\nGo kill yourself\n[Kon Artis] Fuck you!\n[Kuniva] Well, stop blowing my buzz!\n\n[Proof]\nI'm at the front of the bar by the lounge in the back\nWith a slut on my arm while I'm downing the 'gnac\nGot the pills in my system, floating around\nEvery time I start drifting, someone open they mouth\nYo my ear been spit licked and freestyled in\nI think I'm going def like most senile men\nOnly one good demo out of three thousand\n(Yo I ain't wanna rap for you anyway) A'ight, peace out then!\nNext nigga that bump me, I'mma do the Humpty\nAnd elbow bitches, 'til everybody jump me\n\n(Yo man whassup wit you man why you keep bumpin me and shit)\nWhassup fool? Fuck you punk!\n(Motherfucker, the fuck? It's on fool it's on! Whassup then nigga?)\n\n[Hook 3: Kon Artis] (adlibbing)\nBlow, my, buzz (heeeeeeeeeeey)\nDo what you want to just don't blow, my, buzz\n(Do what you want to) And I'm gon' sit here and just roll, my, drugs\n(Smokin', Rollin', on and On...) And if you talk I'm gonna fuck, you, up\n(Slap the shit out you!!) Just don't say shit and we'll be cool\n\n[Outro: Kon Artis]\nWe'll be cool\nWe'll be cool if you don't talk while I'm just trying to smoke my weed\nSmoke my weed\nI'm trying to drink with my niggas; just shut the fuck up\nWhile I'm just trying to get blowed\nSpitting to me some mo'.. (hehehe)", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}