{"songs": [{"title": "Snake Pond", "album": "Shaolin vs. Wu-Tang", "year": "2011-03-07", "lyrics": "[Kung-fu sample]\nVery good!\nWho are you?\nWe are from the Wu-Tang\nShaolin's the foundation\nFrom which all kung-fu springs\nBuddha's name be praised\n\n[Raekwon]\nI met him by Snake Pond, my hand on the flamer, my bomb\nI park, Rae, Ghost, then lit up the bong\nIt's nightfall, nothing here, nothing to fear\nJust got things to touch on, then he walked up weird\nWalked in frail as stale, his eyes were soft\nHis face was pale, I looked at him kneel\nJust wanna talk, you a deer, starting chasing him\nHe jumped in the tree, had grass in his ear\nI'mma kill you nigga, you gonna have to come down\nLittle did he know I was a leader, a full bred eater\nJump in new V's, shopping, had the fever\nNext stop Starbucks and Spiegels, Jags had diesel\nThen she walked in, fly little diva\nNiggas on the scheme for your gleam, they come from your school\nA bunch of snake bites, they bitch smacked Shareen\nShe slid in the '09 Beemer, with that sex whore Sabrina\nForging checks, live in Medina\nThanks for the info, my kinfolk, listen, Miss Window\nWith the big pimple on her temple\nAny more knowledge is college, you gave enough to be bounced now\nShe shot up in Chipotle, don't quote me\n917, 646, you know it's war, bitch, can't dress for nothing, she fronting\nTook a piss, roll up, let's twist, pulled down my pants\nGood look, and shot through her tits\nNow I gotta picture who I'm looking for, fake ass Brooklyn boy\nI know his fucking family, fuck 'em all\nI used to love brothers, now I hate 'em\nMostly them gator boys, who stunting and they never seen nathan\nMe and my real soldiers who started it, won't play part of it\nBut I'mma get to the bottom, I got 'em\nNewspapers saying they shot 'em, but on the low\nI heard he shot himself\nA trip, yo, the poison me, I come from the poison bees\nWhere mothers run old nightclubs with tons of ki\nOld lady holding them G's, dope fiends, holes in they jeans\nMagicians that can make blow green\nI know his whole team, no craze, dough so low\nI hit 'em off mean, now he wanna hold me, no bro, B", "image": "https://images.genius.com/bd1e2ea326f22bdcaa7332457249e1c5.1000x1000x1.jpg"}], "artist": "Raekwon"}