{"songs": [{"title": "Trap House", "album": "Muddy Waters Too", "year": "2019-02-04", "lyrics": "[Intro: Redman]\nOh, what is a trap house, oh (Let's go!)\nWhat is a trap house, oh (what is a trap house)\nWhat is a trap house?\nYo\n\n[Verse 1: Redman]\nMy studio is my trap house\nI'm generating them racks out my trap house\nThem arms bars I'm writing'll make you tap out (Let's go)\nI-I-I'm killin' shit, your girl'll have to wear a black gown, then blow her back out\nI kitted down my Rubicon (Keep goin')\nMy trap house all day I got music on (Keep goin')\nI could feed your whole block, nigga, with my food for thought (Keep goin')\nI can make you trip more cheaper than a Uber cost\nNigga recognise I'm the boss\nRed (Man), I'm a legend\nFrom the era of Makaveli\nStraight up and down, I'm six o'clock\nYou ready or not? I'm after seven\nMy DJ is my trap house\nHe throw my record on, baby, make that ass bounce (Bounce, bounce)\nMy nephew Kazzie is rollin' in with that half pound (What up?)\nI-I-I play to win, I bet it all then I cash out\nThen step like a Frat house\nBang, when I'm recording, your eardrum get extorted\nBang, you go report it\nSame shit, different toilet\n\n[Chorus: Redman]\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (So incredible)\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (What is a trap house?) (Let's go!)\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (Get 'em)\n(Stoner)\n\n[Verse 2: Kazzie Stoner]\nI'ma-I'ma-I'ma crack baby from the trap house (Ow!) (From the trap house)\nI make her cook the coke with her ass out\nI don't trust the bitch, she might steal my shit\nI had to beat the hoe 'til her tracks out\nYeah, the lights off but the door work\nI was makin' traps in the blackout\nI gotta peephole that peep hoes\nCloset filled with just kilos\nGot a livin' room with a pole in it\nTurned to the trap house to a freak show\nI got pure codeine in my trap\nGot pills and weed in my trap\nGot triple beams in my trap\nY'all can't serve a fiend in my trap\nIt's the first of the month, got a line on the front of it\nIf you ain't buyin', can't come in it\nBoy, if you know if you try, we rumblin'\nO.G. Mama a hustler\nFish scale, fish scale, ooh\nWe could break the bricks down\nHol' up, hol' up, get that nigga out the trap house\nSee a pig tail, big twelve knee\nMore work, bring the cash out\nMy work good, make her pass out\nMy baby momma keep trippin' on me 'cause I turned the crib into a trap house\n(Stoner)\nWe get it in, in my trap\nYou know we dishin' them packs out\nSo when we go to the trap, you know we takin' the back route\nStoner\n\n[Chorus: Redman]\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (So incredible)\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (What is a trap house?) (Let's go!)\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house? (Oh)\nWhat is a trap house? (What is a trap house?)\nWhat is a trap house?\n\n[Outro: Redman & Kazzie Stoner]\n(What is a trap house?)\n(What is a trap house?)\n(O-o--oh)\n(What is a trap house?)\n(What is a trap house?)\nGot-got triple beams in my trap (O-o-oh)\n(What is a trap house?)\n(Oh-oh)", "image": "https://images.genius.com/e105aae1a8e317af580491c598d7b972.750x750x1.jpg"}], "artist": "Redman"}