{"songs": [{"title": "Long Kiss Goodnight (Original)", "album": null, "year": null, "lyrics": "{Intro:]\nYo\nI'mma smoke this nigga, man..\nWhat the fuck y'all doin' man? You fuckin' with the jam master\n(Time, time for you to die)\nAs I kiss.. your.. ass.. goodnight)\nI ain't fuckin with you niggas, I ain't fuckin with you niggas\nThis stupid nigga, man\nFuck that\nUh\nYo, yo yo yo, yo, yo, yo, yo\nYo yo yo, yo, yo, yo!\n\n[Verse 1:]\nI make yo' mouthpiece obese like Della Reese\nWhen I release, you lose teeth like Lil' Cease\nNigga please, blood floods your dungarees\nAnd that's just the half of my warpath\nLaugh now cry later, I rhyme greater\nThan the average playa hater, and spectators\nBuy my CD twice; they see me in the streets\nThey be like, \"Yo he nice, but that's on the low though\"\nBe the cats with no dough, tried to play me at my show\nI pull out fo'-fo's, and go up in they clothes\nShort-change niggas, snort 'caine niggas\nExtortion came quicker, bought the Range nigga\nYa still tickle me, I used to be as strong as Ripple be\nTil Lil' Cease crippled me\nNow I play hard, like my girl's nipples be\nThe game sour like a pickle be, y'all know da rules\nMove from BK to New Jeruz -- thinkin 'bout\nAll the planes we flew, bitches, we ran through\nNow the year's new, I lay my game flat\nI want my spot back, take two\nMotherfuckers mad cause I blew, niggas envious\nToo many niggas on my dick, shit strenuous\nWhen my men bust, you just move with such stamina\nSlugs missed ya, I ain't mad at ya (we ain't mad at ya)\nBlood rushin', concussions, ain't nothing\nCatch cases, come out fronting, smoking something\nSippin' White Russians, bitch in the Benz bumping\nI laced it with the basic, six TVs a system\nKnockin' Mase shit, face it, we hard to hit\nGuard ya shit, 'fore I stick you, for your re-up\nWipe the pee up, lick shots, woke your seed up\nGo in the ashtray, spark the weed up\nLong kiss\n\n[Hook: The Notorious B.I.G. (singing)]\nTime, time for you to die (dick-ridin' ass niggas everywhere..)\nAs I kiss.. your.. ass.. goodnight\nTime, time for you to die\nAs I kiss.. your.. ass.. goodnight (there's more than one dick to ride in the rap game) (no doubt, no doubt)\nTime, time for you to die\nAs I kiss.. your.. ass.. goodnight\n\n[Verse 2: The Notorious B.I.G.]\nWhat, what, what, what?\nI'm flamin' gats, aimin' at, these fucking\nManiacs, put my name in raps, what part the\nGame is that? Like they hustle backwards\nI smoke Backwoods and Dutchies, you can't touch me\nTry to rush me, slugs go, touchy-touchy\nYou're bleeding lovely, with yo, spirit above me\nOr beneath me, your whole life you live sneaky\nNow you rest eternally, sleepy, you burn when you creep me\nRest where the worms and the weak be\nMy nine flies, baptize, rap guys\nWith the Holy Ghost, I put holes in most\nYou hold your toast shaky, slippin' tryin' to break me\nLook what you made me do, brains blew\nMy team in the marine-blue, six Coupe\nSkeeted out, weeded out, cleanin' out -- the block\nFor distances, givin' long kisses bitch!\n\n[Hook: The Notorious B.I.G. (singing)]\nTime, time for you to die\nAs I kiss.. your.. ass.. goodnight\nTime, time for you to die\nAs I kiss.. your.. ass.. goodnight\nTime, time for you to die\nAs I kiss.. your.. ass.. goodnight\n\n[Verse 3: The Notorious B.I.G.]\nFrank White the menacing, Chron-Chron's the medicine\nI got the lettuce and, you turn green like cucumber skin\nGot the new, Hummer in the summer when I was a new comer\nThen, drugs and MAC-10s\nHugs from fake friends, make ends they hate you\nBe broke -- girls won't date you\nThat's why I relate to, choke yo' ass out til your face blue\nMake you, open the safe too\nNo matter how you call it (how you call it)\nThis brolic, alcoholic\nLike his weed green'd out, like his brick solid\nDistribute to, kids who, take heart like Valentine\nDrink Ballantine, all the time\nSlugs hit your chest tap your spine, flatline\nHeard through the grapevine, you got fucked fo' times\nDamn that three to nine, fucked you up for real though\nSling steel slow, as for remorse, we feel no\n\n[Hook: The Notorious B.I.G. (singing)]\nTime, time for you to die\nAs I kiss.. your.. ass.. goodnight\nTime, for you to die\nAs I kiss.. your.. ass.. goodnight\n\n[Outro: The Notorious B.I.G.]\nFuck that!\nThat nigga tryna be on that up and coming shit, FUCK THAT!\nI ain’t the type to toot my horn, but toot toot motherfucker! I’m the nicest nigga in the game, man! Face the motherfucking facts man!\nYou fuckin' with the other side! You can’t see me! You can’t see me! In a fistfight you won’t SEE me nigga!\nSick of this bullshit\nOnly reason I ain’t naming no names, is so I don't give these  bitch-ass niggas a chance to make a record coming back just to sell a few units\nFaggots!\n(we blowin' kisses at you niggas)\nOld dirty half-ass niggas, man..", "image": "https://images.genius.com/accf2df97375292b16f399ff6ec71e6e.500x500x1.png"}], "artist": "The Notorious B.I.G."}