{"songs": [{"title": "Wild in Da Club", "album": "The Lex Diamond Story", "year": "2003-12-16", "lyrics": "[Intro: P.C.]\nDon't take it per-son-al.. it's only mu-sic\nHolla at me.. yo! Yo!\nIce Water! Yo.. yo\n\n[P.C.]\nTry me, P.C.'ll put a clip in a nigga\nFuck a hole, my bullets'll dig a ditch in a nigga\nListen, I've been reppin', only pack big weapons\nOne shot to the stomach, you missin' ya midsection\nI'm off the wall, dog, I could off ya balls\nStick his ass to the rooftop, toss 'em off\nHit the Ave with the rooftop off the porch\nI get money cuz it costs to floss, nigga you feelin' me?\nAnd if not then fuck what you gotta deal with me\nI've only been here for a minute but haters wanna get rid of me\nP.C. creep with at least three heats\nAnd a shotgun stashed underneath the backseats\n\n[Stumic]\nNiggas actin' like you don't feel a draft\nYou seen ya man? Tell him I'mma kill his ass\nAnd I don't, wanna talk I want a mill in cash\nI come through 'tards shittin', lookin' ill in the past\nCuz it's the, Ice Water, don't get it confused\nAnd one false move'll cause me to spit at you dudes\nIt's Stumic, motherfucker and I'm pickin' ya food\nAnd ain't no one out you know that my niggas'll do you\nLet's spit on 'em, rush these niggas\nAnd crush several fuckin', will leave a dent out ya liver\nOnly kid in the hood with a mustard ninja\nHeard you broke down good, well I fucked ya sister\n\n[Hook 2X: Stumic]\nEh yo we Wyld in Da Club, style in the club\nThis is for my niggas gettin' down in the club\nAt the bar throwin' down rounds in the club\nTalk slick and get the four pound in ya mug\n\n[Break: Polite singing]\nYo I keep my gun on me, what the fuck y'all want from me?\nY'all touch my property somebody gon' die, uh-huh\nThis ain't no joke, it's for real\nMy niggas they totin' they steel\nAll it takes a phone call and they ready to ride\nGet ready to die\n\n[Polite]\nEh yo the cards are dealt, the words are spoken\nNigga, welcome to the Hell, the gates is open (uh-huh)\nGatekeeper, first degree murder through the speaker\nWho deep enough to flow with the reaper?\nStuck in the middle, I spit a little riddle\nLeavin' niggas crippled, my niggas ball 'em like Kerry Kittles\nYou niggas makin' it hard, it's really kinda simple\nIf a nigga gotta pull it out I'm puttin' it in ya temple\n\n[Ultra]\nOfficial I do this, rude maneuver\nI use the Rugers to keep the bullets movin' through ya\nWeak anatomy, fuck the small talk and flattery\nYa power is weak, to beef you need much more batteries\nKeep it genetic, or dead it, Ice Water Inc. we said it\nWhoever so-called did it or said it, promote it and spread it\nFake it or front it, get ambushed and confronted\nWith slugs in ya head, back, chest and stomach\nNiggas don't want it or ask for it, so we give it to 'em\nDead in the club and let them things spit and rip through 'em dead in the club\nIs you gon' fuck around and be the nigga dead in the club?\n(Yeah? Uh-huh..)\n\n[Hook 2X]\n\n[Raekwon]\nEgyptian look, gazelles on, L's lit, this how it's goin' down\nSki mask, Chanel shit, move like a terrorist click\nNineteen eighties babies, worldwide, ya girl on our dick\nAll you know is Rae look good, he hood\nEnvision the flips, I make money like them niggas who take money\nFresh out the can, Duran look, Astro van\nThe ill Castro, rap Son of Sam\nMore Rugers, more bow and arrows\nStill no losers, forty five dollars ahead\nGo at niggas shootin' lyrical leads\nStop absorbin, break shit, knock that gay shit out ya head\n\n[Hook 2X]", "image": "https://images.genius.com/8703b73c19201fea3baccb6c300ec07e.1000x1000x1.jpg"}], "artist": "Raekwon"}