{"songs": [{"title": "Piru Blues", "album": null, "year": "2013-12-25", "lyrics": "\"Piru Blues\"\n\n[Hook]\nShow me how to breathe again\nGive me a reason to end\nThis pain and all this suffering\nIs there something, can I win?\nIt's hard to believe again\nIs it something?\nOr maybe nothing, nothing\n\n[Verse 1]\nBlood stains on the camouflage jacket\nAnd love pain hands on the fully automatic\nShe looks into the eyes of her comrade/lover\nComcast, C-SPAN cover warfare rages on the other\nSide of the wall where the revolution utters\nIn the language besides brotherly love for the sufferers\nIt's the sacrifice that touches her\nHe brushes her cheek, smeared with black smudges\nOf oil and dirt he picked up from falling to the earth\nWhen did things fall so far to love and so into berserk?\nSupplies in the church but nothing of worth\nThat can repair the hurt, so out comes the tears and\nIn come the visions, gargoyles and gryphons\nThe tensions, the strength, and the stiff and release\nOn his way to God, guarded by the beast\nShe picks up his rifle and rushes to the street\n\n[Hook]\n\n[Verse 2]\nWith blood stains on the chinchilla fur\nAnd a hundred bullet holes in the Rolls Royce Spur\nThrough designer sunglasses the world is a blur\nDiamonds are being ripped from the neck of the third\nSecond and first seems so unneeded\nBut this one she feels that he got what he deserved\nThe money floats, the liquor spills\nShe dances on macabre; a nigga is being killed\nSkeletons dance with her an elegant prance amidst the\nWhores and the drunks, the sinners and the punks\nA parliament of fools baptized in the funk\nCologne won't stop bullets no matter where you put it\nBut they spray it in the trunk\nIt mixes with the blood and the residue of drugs\nIt hits her all at once\nStings the nostrils, as our Rihanna as Madonna\nAnd Nirvana bewitches another hostile\n\n[Hook x2]\n\n[Verse 3]\nWith blood stains on the maxi pad missing\nWe welcome another soul into the land of the living\nSomething about the mirror so different, it smiles\nNow how could glass smile?\nSo she runs into the kitchen\nThe microwave, the spoons and the plates\nEverywhere where there's a reflection of her face\nThe turned off TV, the cell phone and laptop screen be\nLooking jubilant as Jeezy\nIn the trap or Gucci in the chain shop\nA fan getting name dropped, this wasn't in the plans\nBut the pain stopped, and held the daffodils\nPleasant surprise not in the newspaper horoscope\nA scene in the leaves of the chamomile\nShe musta missed it\nProbably fell outta the bag but she dipped it\nNonetheless, she feels terrific\n\n[Hook x2]", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}