{"songs": [{"title": "Ey-Yo! (The Reggae Virus)", "album": "Caught Up (Music From the Motion Picture)", "year": null, "lyrics": "[Mad Lion] *singing to the tune \"Walk Like an Egyptian\"*\nWho wan come try, dis-respect\nDe mother yon chop upon dis head (chop man)\nMother knows every style, oh-wayyy-ohh\nLike Shaggy, one called KRS [Yes!] (whooooh!)\nThe champagne drink, rock-n-roll link\nHoly smoke pon de bass mix (tell em, tell em, tell em)\nNever know tell me go, oh-wayyy-ohh\nYo Kali, serve his head like Chef\nAll de massive in de pub just say, eyyy-yo, eyyy-yo\n(Rob him like dat, man now come down bring it)\nEyyyheyyyyyo eyyyyy-yo\n(Ya come down now KRS, tell em, tell em, yeah!)\n\n[KRS-One]\nYou don't realize the magnitude I laugh at you\nFlappin you rat-a-tat, you on your own avenue\nWhile I'm slappin you, askin you, \"Why you actin new?\"\nCrushin a mack and you turnin up the black in you\nSkill for skill you the minor we the major\nI grade your whole album like a mad term paper...\nZERO, don't be a fan! Like DeNiro\nBe a teacher, be a role model, be a hero\nGet it clear yo, I be rollin with de po-sse\nNow do your plan over or get, ran over\n\n[Mad Lion]\nI be crusin down the highway, just sportin in the fly way\nTurn it up a notch and de sound hits dem\nCreepin through traffic with the sunroof open\nTo ventilate the scent from the spliff we smokin\nHuff with a chop we do not\nWe make up a mighty powder, said scrap, last week!\nWe close in the Jeep, no fire for sleep\nDem come rough and make you one of dem weak or\nIn de dance kill a watch like chicken in my pot\nCall dem with de champagne, can't stop that's right!\nMan of been to dem place, to champagne away\nSign of money, can virus strike\n\n\"I see you move...\"\nLook now man, look look\n\"I see you move...\"\nI think it's time for it\n\n[Shaggy]\nWho dat from the chat with the boom shot\nHit you with the lyrical bash, so won't last\nRudebwoy check your stash, caught the cash\nAnd if you don't like dat, somebody gettin bitch-slapped\nI'm the raggamuffin with the Dream Team\nKRS, Mad Lion guaranteed to make your money scream\n(See? All you need) rhythmatical style\n(Need) ya done gwan irie, peep\nPump ya best if ya irie, like me\nCause we don't want know si-ren, hey\nNuff a rhyme works, nobody gets hurt\nLook up on the dancefloor, herd of nothin but skirts\nFellas in the club, actin like vi-pers\nBitin them girls like your name was Marv Albert\nBaby love no fighting, come to back biting\nYou and your girlfriend should do the right thing\nI'mma let this beat swing, while I think I'm the king\nAnd go rap pon a nice sexy young queen\n\n\"I see you move...\"\n\"I see you move...\"\n\n[Mad Lion] *singing to the tune \"Walk Like an Egyptian\"*\nWho wan come try, dis-respect\nDe mother yon chop upon dis head (chop man)\nMother knows every style, oh-wayyy-ohh\nLike Shaggy, one called KRS\nThe champagne drink, rock-n-roll link\nHoly smoke pon de bass mix (tell em, tell em, tell em)\nNever know tell me go, oh-wayyy-ohh\nYo Kali, serve his head like Chef\nAll de massive in de pub just say, eyyy-yo, eyyy-yo\nEyyyheyyyyyo eyyyyy-yo\n\n[KRS-One]\nYo... get your hands up!! Yo!\nOn the mic I'm sheddin light, you better get it right\nI produce what you like, satisfy your appetite\nNo fly-by-night, we rock you right\nKRS Shaggy Mad Lion yo whassup with this money?\n\n[Mad Lion]\nMind bogglin, oh love them ogling\nTurn watch while we seek, see now stop dance wid dem\nDon'tcha want this girl, with her Erykah streak\nKafi yome love go me because we off that weed\nChase while we head to the watch pon me wrist\nWe gets another week til we own necklace\nGet receipt on me watch, if we buy it then we flaunt it\nKill you alla dem, make dem come back haunted\n\n[Shaggy]\nAlla big up to Shaggy rock love\nMad supporters, love\nAnd de people rock dis KRS-One\nYa feel the vibes all mel-low\nShaggy, I want cha pump ya fist and just throw it up like this\nYeah, uhh, push it up, yeah, uhh, let em know\nI wanna big up my whole, hip-hop fraternity, yeah\nMy reggae fraternity, yeah\nAll men, all posse everybody in this rock\nLeft right yeah, uhh, sync your butt, yeah\nUhh, Mad Lion, uhh\nUhh, Flatbush style, uhh\nBrooklyn Queens Bronx style, yeah\nStrong Island, wicked wild, yeah\nUhh, and New York town flavor\nAll the crew\nKRS-One, Shaggy, Mad Lion run dat", "image": "https://images.genius.com/f3bcb1ffff290f08feb29c5e4f3f14f3.590x590x1.jpg"}], "artist": "KRS-One"}