{"songs": [{"title": "Good Guy (Spanish)", "album": null, "year": null, "lyrics": "[Verso: Eminem]\nAquí vamos de nuevo, de héroes a villanos\nSolía ​​ser tu Romeo pero ambos estábamos abandonados\nUn par de veces, por lo que tuvimos una pendiente resbaladiza para hacer frente a\nPero aún así, me dio la esperanza de que obtendremos\nA través de ella, un lóbulo cortado\nEnviado a usted en un S-O-B-re\nSería drogadicto, pero ¿a qué tipo de longitud puedes ir?\nTire de un Vincent van Gogh, solo para convencer a un maldito ho\nSer una ama de casa que miente abiertamente\nElla está borracha, ahora está de vuelta en mi camino\nSalí corriendo, ¿por qué está intentando actuar?\nElla es casi de mi tamaño, me golpeó en la boca dos veces\nChicos, cuando alguien por quien morirías\nPega un cuchillo de carne en tu corazón, ¿intentas más?\nOtra tarde en la noche, ella tropieza a través de mi puerta\nDeja entrar la luz del día y todo lo que hacemos es luchar más\nY no soy violenta, pero ella está revisando mis cajones\nPara plantar el K-Y, una puta me está acusando\nQuien huele a San Ides y quien probablemente haya jodido cinco mas\nChicos, chuparon ocho / nueve hombres\nMe llevo dos por cuatro a nuestro ocho por diez\nPerra, eres tú, arranqué el marco, gano\nPoner un nuevo puntaje alto, venció a este juego en el que estoy\nY aquí hay algunos de dos capas para cuando salgas con mis amigos\nPara limpiarte el culo cuando moviste tus entrañas\nCuando renovamos nuestros votos, este es el agradecimiento que recibo?\nEstoy esperando el día que pueda\nTe oigo decir: \"Marshall, ¡qué gilipollas he sido!\nY hay un chico nuevo, estás siendo reemplazado por él \"\nTengo sus tubos atados para él, tengo ese trabajo de tetas para él\nMe duele hasta la médula, pero el dolor en el que estoy\nDespués de ti, juré hacer cesar los cielos grises\nAquí vienen los rayos, como cuando se obtiene una subida de sueldo y\n¿Soy el chico bueno o solo juego como él?\n¿Y espero que te deje?\nEs como un sueño hecho realidad, solo para gritar \"¡Vete a la mierda!\"\nSupongo que tomas la vida de la misma manera que juegas dados\nPorque solo me miras y les pones los ojitos de serpiente\nYa que-\n\n[Coro: Jessie Reyez]\nDesde que compraste el jurado, me llamarán culpable\nMe van a llamar culpable\nUsted compró el jurado, me llamarán culpable\nAunque sabes el verdadero yo\nNo puedes vencer a un tramposo, convence a un no creyente", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}