{"songs": [{"title": "Are You Ready", "album": "Young Sinatra", "year": "2011-09-19", "lyrics": "[Hook: Phil Ade]\nEverybody like (Hey!) are you ready to go? Ready to go\nEverybody like (Hey!) are you ready to go? Ready to go\n(Hey!) Are you ready to go? Ready to go\nEverybody like (Hey!) are you ready to go? Ready to go\n\n[Verse 1: Logic]\nOn my Charlie Sheen, homie, yes I am a winner\nAnd when it comes to making music, I am no beginner\nHit the stage and get wild, my braniac's loud\nCall me double 07 because I bond with the crowd\nYou shine like a star but I sun it\n50 keep it a 100, homie you know I run it\nThe game needs change and Logic can break a 100\nI had a shorty to bun it, until she didn't want it\nSo I focused on the flow and they gon' put me on the map\nWith a pocket full of change, every day a different dime\nOnly fuck with golden girls, and I ain't talking Lifetime\nWhen I rhyme, they up on me, ‘cause they seen how I'ma shine\nNow, you may be wondering how my raps rock\n‘Cause I'm so fifth key to the right of caps lock\nAnd when my tracks drop, I'ma be sipping Ciroc\nWith a whole skyline chillin’ in the backdrop\n\n[Hook: Phil Ade]\nEverybody like (Hey!) are you ready to go? Ready to go\nEverybody like (Hey!) are you ready to go? Ready to go\n(Hey!) Are you ready to go? Ready to go\nEverybody like (Hey!) are you ready to go? Ready to go\n\n[Verse 2: Phil Ade]\nShit, nigga I was born ready\nAnd I swear I'm what these rappers can’t bear, warn teddy\nMy Pro Tools bouncing like a '64 Chevy\nI'm trying to win fast y'all on that Eddie\nPlus Carl and Harriet, G is how I carry it\nBeen in it for miles, don't believe ask Darius\nRunning this beach like Chariots of Fire\nI aspire to be higher than these superficial liars\nThe attire I acquire cost a grip, buy your pliers\nI'm a ball out and die in Maryland, Len Bias\nApply a sire to my name, yeah you ain't know I'm royal\nI foil from slick talk, yeah trip of that oil\nToying with girls feelings, lord forgive me I need healing\nI know you said it's wrong but a long would make a killing\nHit the bong I hit the ceiling, hit the drink I hit the floor\nIf they show 'em in the buildin to the crowd, then let me know\n\n[Hook: Phil Ade]\nEverybody like (Hey!) are you ready to go? Ready to go\nEverybody like (Hey!) are you ready to go? Ready to go\n(Hey!) Are you ready to go? Ready to go\nEverybody like (Hey!) are you ready to go? Ready to go", "image": "https://images.genius.com/6118bfdbbde22320e3c6bc130e1772d3.1000x1000x1.jpg"}], "artist": "Logic"}