{"songs": [{"title": "My Closest Roaddogz", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro]\nHere me and my closest road dogs\nTo my dog named Mussolini (you know it dog)\nBig Syke (Westside)\nThug Life, baby (outlaw)\nThe return of the mashers, you know how we do it\nHahaha!\n\n[Verse 1]\nShit half the times we fought and caused trouble\nMy closest road dog it was cool cause I love you\nFuck what they talkin' bout\nLet me take you back in time, rewind to eighty-nine\nIntroduced me to this life of crime, but we was blind\nLittle nappy-haired juveniles, livin' wild\nNo smiles on our faces, thirteen catchin' cases\nIndeed, it was misery\nDriven by my own demons, cause they was killin' me\nHow can I be sure I'll be saved soon?\nCatch me dip into the light, of a stray moon\nIt's gettin' deeper now, let me get yo' mind right\nFuck yo' enemies, nigga grip yo' nine tight, tonight's the night\nMurder murder Mr. Lucifer\nPictures of the devil DUCK when he shoot at cha, it's all political\nRunnin' from the future, escapin' in the fog\nLive yo' life like a hog nigga, me and my closest road dogz\n\n[Hook: sung]\nEvery ghetto street got a crosswalk\nLet me get to the other side with my road dogz\n(me and my closest road dog)\nAll roam in the scary place called home\nTake a second victim and if they all gone, my closest road dogz\nEvery ghetto street got a stop sign\nCan I trust in you my road dogz on mine?\nEven when I'm goin' through hard times\nI still got my closest road dogz lookin' out for all mine\n\n[Verse 2]\nHaha.. bring artillery and ROLL with a nigga\nThey could never take the soul of a M.O.B. soldier nigga\nCowards get rolled up, mob on 'em Makaveli\nBoy you's a boss player, that's what all the bitches tell me\nEven if I died now\nI live my life eternally and never lie down, why cry now?\nFooled a few but never 'came a gamer\nAin't tryin' to hear it\nEvil spirits hide at total strangers, yo' life's in danger\nPrepare nigga be aware, cause we ain't scared\nM.O.B., 'til I die, when we ride niggas disappear\nFill 'em up with pistol smoke\nNever forget to blow a hole in his head\nFor leakin' information to the feds\nThe burnin' bed was the tellin' sign\nTwo hired guns bustin' everyone, yellin' everybody die\nWhy the fuck they fuck around, we left 'em in the fog\nBleedin' like a stuck hog, me and my closest road dogz\n\n[Hook: sung]\nEvery ghetto street got a crosswalk\nLet me get to the other side with my road dogz\n(Bleedin' like a stuck hog, me and my closest road dogz)\nAll roam in the scary place called home\nTake a second victim and if they all gone, my closest road dogz\nEvery ghetto street got a stop sign\nCan I trust in you my road dogz on mine?\nEven when I'm goin' through hard times\nI still got my closest road dogz lookin' out for all mine\n\n[Verse 3]\nFuck they feelings, that's what they get for squealin'\nThat's the pressures of a gangsta, dangerous this drug dealin'\nSee me in physical form, my niggas swarm\nTake the figure of a circle beatin' jealous niggas 'til they purple\nSimon Says take they heads homies\nAnd send them phony motherfuckers to dwell with all they dead homies\nFishin' for fake niggas, observe and shake niggas\nThe only way to see six figures, is break niggas\nMe and Mussolini set to ride we high\nBig Bogart got the alibi,homicide ask us why\nLabelled a Capo in the mob as big as the globe\nTo live and die as a millionaire, on ..\nSet to explode, my M.O., is kill them hoes\nMy pistol's like a disease, my enemies and foes\nGet murdered and disposed of, we in the fog\nMakaveli the Don, and my closest road dogz\n\n[Hook: sung]\nEvery ghetto street got a crosswalk\nLet me get to the other side with my road dogz\n(my closest road dogz)\nAll roam in the scary place called home\nTake a second victim and if they all gone, (my closest road dogz)\nEvery ghetto street got a stop sign\nCan I trust in you my road dogz on mine?\nEven when I'm goin' through hard times\nI still got my closest road dogz lookin' out for all mine\nEvery ghetto street got a crosswalk\nLet me get to the other side with my road dogz\nAll roam in the scary place called home\nTake a second victim and if they all gone, my closest road dogz\nEvery ghetto street got a stop sign\nCan I trust in you my road dogz on mine?\nEven when I'm goin' through hard times\nI still got my closest road dogz lookin' out for all mine", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}