{"songs": [{"title": "Peep Game Part 2 (Unreleased)", "album": null, "year": null, "lyrics": "[Intro]\nDamn\nHey, close yo' muthafuckin' mouth...\nShut yo' muthafuckin' mouth!\nThis is how we going to to this in '94\nHere we go\nTime to size these niggas up and cut they ass short, yow know?\nMothafuckers got me going for it\nFuck these niggas\nDING!\n\n[Verse 1]\nMomma ain't raised no punks\nPlaya-hate niggas, pay attention, this is what they want\nSince you all up in a nigga mix\nThen maybe you can hang with the street game, don't be a bitch\nKeep your head up, baby, and I meant that\nNow you trying to toss me in the mix, and bitch, I resent that\nThese hoes ain't shit\nPlottin' on a nigga 'cause he rich\nThen wonder why they call you bitch\nAnd if you offended, you's a lyin' ass trick and that was intended\nI'm coming back with a passion\nAnd screaming 'Thug Life,' bitch\nWhen my niggas get the blastin'\nI'm puttin' hoes on tape, and not 'cause I wanna, but I gotta\n'Cause tramps love to scream \"rape!\"\nI'm rushing bitches to the hotel\nAnd I'm blindfolding hoes I don't know well\nHuh, guess it's hard on a nigga in '94\nIf you can find a ho, nigga, peep game\n\n[Verse 2]\nTell me what you need when you see me\nDucking these tramps 'cause they sleazy\nBitch, take it easy\nI told you last year it's a test\nI know you can't see my tattoos through my bullerproof vest\nSo you roll, baby, hold up\nAnd why you touchin' on a nigga\nIf I touched you back, you'd probably go nuts\nYou see, you hoes got it all wrong\nShouldn't listen to them niggas that be bangin' on them slow songs\nThat's where you go wrong\nI ain't never been a trick\nFake bitch, keep yo' clothes on\nWith you're mouth closed, and you're leg shut\nIf I was broke, you'd probably wouldn't said much\nBut I'm paid, so you all in a nigga face\nYou wanna move in, fuck, get a bigger place\nPlease, I ain't goin' out like these, trick ass niggas that be fuckin' off G's\nYou suckas need your game plan changed\nAnd peep game...", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}