{"songs": [{"title": "Dope Bitch", "album": null, "year": null, "lyrics": "I love a Daytona rose gold Rolex, the black face, a good Fendi fur, some Tom Ford thigh high's and a crocodile Birkin. I'm set. I'm not basic right here\n\nNot basic? (Not basic)\n\nNah, no basic bitches allowed\n\nWhy? What they do?\n\nBasic bitches make me nervous. Yes. They make me nervous. You wanna impress? Here, I'm gon' show you. If you're a boss, this stack right here falls out of your pocket, you don't even got time to pick it up. (You keep walking) You don't got time. You keep going. It's probably not worth your time. (Your minutes cost more than the stack.) Keep it moving. (Alrght.) Keep it fresh. (Keep it fresh. Keep it money, baby. All day.) It's our money dance. I have my basic bitches pick up my money for me. I pay my basic bitches to pick up my money for me\n\nAlright, that's cool\n\nI tell 'em keep it. Buy something nice. I heard Raven's having a sale. Yes. You know the real boss bitches though? Call up George Condo. Make me a fucking one of a kind\n\nOne of one's?\n\nOne of one's\n\nHow much was it?\n\nPriceless, baby\n\nPriceless. So what's a typical shopping day for ya'll? How much? Like on a tab?\n\nTypical shopping -- it's never typical with me\n\nThat day you -- that day you go-\n\nIt depends on what kind of mood I'm in that day\n\nYou're in the mood to shop\n\nI'm in the mood to shop?\n\nRight\n\nCan't put a price on it\n\nShe doesn't wanna make you nervous\n\nI don't wanna make you nervous, baby. I don't wanna make you nervous\n\nI don't think you can. I ain't been nervous in a minute, in a while\n\nYou sure? You're not nervous right now?\n\nDo I look nervous? I'm relaxed\n\nYeah?\n\nI'm so relaxed. I'm probably too relaxed\n\nYou're relaxed\n\nYeah\n\nLet's make him a little nervous\n\nHow are we gonna make you nervous?\n\nGive him my number\n\nI don't think you can\n\nYou sure? My shoes don't make you nervous?\n\nNot at all\n\nAre you sure? My wrists?\n\nThat's a nice wrist\n\nHow about my earrings? They make you nervous?\n\nNah\n\nNah? My weave make you nervous?\n\nYou wanna know what basic bitches do? They wash their hair with shampoo. You know what we wash our hair with?\n\nI wash my hair with fucking champagne, baby. (All day) Champagne. (All day)\n\nI hope it's Belaire Rosé\n\nI bathe in Belaire Rosé. I have people wash me in Belaire Rosé. People fucking throw rose petals at me when I walk by. They throw Belaire Rosé\n\nWhy they do that?\n\nI'm a fucking boss. Ugh. Was that good? How was that? Ugh. I can't take life. Was that great?\n\nBut there really is a lot of money on the floor. What is that?", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}