{"songs": [{"title": "Barbershop", "album": "Fishscale", "year": "2006-03-28", "lyrics": "{*bell rings as the door opens*}\n\n[Friend talking to Ghostface]\nHey yo man, what's the deal fam (yo yo)\nYo stay on top of that nigga when you gettin your cut G\nThat nigga just fuckin zeked me (damn son)\nLook what he did to my motherfuckin shit (check this shit out)\nGot me lookin all out of order (damn!)\n(Yo cut my shit right nigga)\n\n[Another friend]\nAiyyo son whattup man what's good what's good\nWhat's poppin with y'all niggas though and shit\nHow the fuck this nigga skimp me and shit like\nThe fuck like I don't spend no bread in here and shit\n(Got that money, I got that money nigga)\nI give that nigga fuckin Swiss Rolls, Jags, minks\nI give that nigga shit for his fuckin grill man (true, true indeed)\nThe fuck man? Like I don't fuckin spend money in this bitch\nNigga what the fuck man? (Ha ha ha) (f'real f'real)\n\n[Barber to Ghostface] + {random fan}\nYo whattup man, how you want it cut? {Shit whattup Starks?}\n(Just give it to me how you been doin it) {Yeah yeah yo}\n{Yo I just got that brand new 40 Cal son}\n(Knahmean? Do no bullshit, and don't fuck me up this time neither)\n{I gotta open it right now son}\n\n[Music starts]\n(Aiyyo fam keep it cool, you know we got them thang thangs up in here man)\nYeah my nigga, buy you a Foreman Grill\nStraght up, you like to eat right?\nFuckin with niggas heads and all that shit\nY'knahmean you got niggas goin to different barbers 'n shit\nNigga be throwin you forty beans, fifty beans and\nAnd then can't get not one free cut out your lil' monkey ass right?\nAlright\n\n[Ghostface]\nAHH! Didn't I tell you don't touch the sides? I'm goin bald on top!\nYou lucky you cool, I'mma let it ride\nSlide, you played me so you can't get paid\nHow you gon' fuck up a don and cold dog his fade?\nI look like UTFO one of them dudes from back in the days\nThe Educator Clapper is housin your coke and the spray\nBarbershop niggas, always wind up fuckin around\nOne minute you hot, next minute you not\nRemind me of the New York Knicks with they jumpshots\nOx, whack as hell, my ratchet spell\nFuck up again you'll have a funny smell\nAll Reneece is doin straight nails\nPuttin in bangs for bitches\nHundred dollar weaves, some different strains of horsehair\n\n[Outro]\nYo Tone put the gun away, the cops is here\n(I want everybody down! I wanna see ID, and I don't wanna nobody sayin nothin)\n(I put one of you moolies back, I'm telling you right now)\n(I will shoot any one of you guys, I'm telling you)\n(Don't hit the exit) {*man running and breathing hard*}", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}