{"songs": [{"title": "Reach Out", "album": "Life Is Good", "year": "2012-07-17", "lyrics": "[Produced by DJ Hot Day, Rodney Jerkins & Salaam Remi]\n\n[Intro: Nas]\nDJ Hot Day...\n\n[Chorus: Mary J. Blige]\nThis kind of love is a once in a lifetime groove\nReach out and touch the love that I have for you, aww baby\nI see you standing there\nSo lost and all alone\nI wanna take you in my arms\nAnd tell you that you’re home\nI look into your eyes\nI said I know you very well\nI see a mirror of my life\nA reflection of myself\n\n[Verse 1: Nas]\n3:45AM can't sleep, can't dream\nI'm stuck, money problems pop up\nHow will I survive?\nGuess it's best to decide not to decide\nSo that's my decision\nWhatever happens happens\nI keep making my millions\nCan see myself in Presidential campaign dinners\nBut I'm passing blunts around a bunch of gang members\nWhen you're too hood to be in them Hollywood circles\nAnd you're too rich to be in that hood that birthed you\nAnd you become better than legends you thought were the greatest\nAnd outgrow women you loved and thought you could stay with\nLife become clearer when you wipe down your mirror\nAnd leave notes around for yourself to remember\nI like to teach and build\nWith brothers about how easy it is to reach a mil\nAll you need is some skill, then it’s grind time\nImagination better than knowledge, says Einstein\nIt’s all in the mind\nNasty the nicest, I'm somewhat of a psychic\nJust one minute after it's heard\nYou all'll recite it, you all'll repeat it\nYou'll call me a genius, if you didn't\nNow that I said it I forced you to think it\nWrite in my little vignettes, sipping Moët\nBitch when you vision me, you vision the best\nWhen I was young they called me Olu's son\nNow he's Nas' father, I was the good seed\nHe was the wise gardener\n\n[Chorus: Mary J. Blige]\nThis kind of love is a once in a lifetime groove\nReach out and touch the love that I have for you, aww baby\nI see you standing there\nSo lost and all alone\nI wanna take you in my arms\nAnd tell you that you’re home\nI look into your eyes\nI said I know you very well\nI see a mirror of my life\nA reflection of myself\n\n[Verse 2: Nas]\nYeah, what y'all know about this..\nYo, beautiful life, often I dream that I can bring my niggas\nConservatives don’t understand slang linguistics\nThe burbs talking like the hood will change with quickness\nLove the skinny model chicks but I prefer the thickness\nSo what I rap about my riches and I'm ostentatious\nGet out a gangsta's business, seems to me your thoughts are basic\nTry to compare what you live to the life I master\nSee the fly shit I wear, you try to rock it after\nBig bracelets, golden Egyptian faces\nWhite wine spritzers and Switzerland on vacation\nThe strip club scene favors Josephine Baker\nDope fiend neighbors, growing up I seen paper\nI describe it, hope you can visualize it\nThis is reminiscent to all the parks in the project\nWhen my British Knights can rival your Foamposites\nDon’t make me pull my Lottos out the closet\nDon't make me pull my Lottos out the closet\nHa ha ha\n\n[Chorus: Mary J. Blige]\nThis kind of love is a once in a lifetime groove\nReach out and touch the love that I have for you, aww baby\nI see you standing there\nSo lost and all alone\nI wanna take you in my arms\nAnd tell you that you’re home\nI look into your eyes\nI said I know you very well\nI see a mirror of my life\nA reflection of myself\n\n[Outro: Mary J. Blige]\nYou remind me, ohhhhhhhhhh\nYes it's true baby, ahh yeah", "image": "https://images.genius.com/d77829b400779c24c98b27bec8d6bfda.800x800x1.jpg"}], "artist": "Nas"}