{"songs": [{"title": "Same Damn Tune", "album": "Dedication 4", "year": "2012-09-03", "lyrics": "[Intro]\nTunechi, Drama, same time\nCan only be Dedication\n\n[Verse 1]\nTurn the music up in my headphones\nUh, I'm wildin' out on my skateboard, she ridin' dick like race cars\nMy blunt longer than spacebars, I'm gettin' higher than quasars\nI beg your pardon, I egg your noggin, got Nin up in my glove compartment\nI'm so short, yellow bus retarded, my flow hard, these niggas carpet\nI'm Tunechi, I do me, smoke doobies, tote uzis\nI make that bitch cum 'til she come to a conclusion\nI'm ill as an illusion, I got B's like a student\nBitch I am not a human and this dick is therapeutic\nShe say, \"Tunechi give that dick to me, smoother than a symphony\"\nTwo bad bitches at the same time, symmetry\nMurder you no sympathy, got medal like olympians\nTee put the weed in the blunt like a parentheses\nFuck y'all niggas I'm gettin' me, is you kiddin' me?\nThat big booty, them pretty feet\nThem swishas' sweets with that purp\nChurch - with the priest\nThat red-boned get licked to sleep, she'll wake up and get dicked to sleep\nPickled meat, freaky deak, I test these niggas with a cheat-sheet\nHer clit look like a jelly bean, I'm on that promethazine\nBlow your ass to smithereens, kush strong like Mr. Clean\nI'm a king I have a dream, money flippin' trampoline\nMoney flippin' balance beam, fresher than the prince, the king, and the queen\nThat's your bitch if my celly ring and I kiss her belly ring\nPut that dick up in her spleen, I shine like afro sheen\nAnd I eat pussy, she suck dick at the same damn time\nThat's a 69, then pass her to my slime\nI'm skatin' and rappin' at the same damn time\nI said I might retire, but y'all know I be high\nI did that time, I paid that fine\nFuck around and go to jail for the same damn crime\nFor the same damn crime? Na, murder this time\nPotato on the end of the barrel, french fries\nI'm rich bitch, Trukfit in Macy's!\nAnd you pussy niggas hatin' like a racist\nTotally dude, I'm white boy wasted\nShe can't wait to take her drawers off like braces\nYeah, Scooby got another one, smokin' on that bubble gum\nTwo dutch bitches, double dutch, I'm the shit, bubble guts\nNigga get your duffles up, don't know if it's love or lust\nTell that ho to suck it up, she got lips like rubber ducks\nThat pussy whack, I'm one and done, trouble some I'm troublesome\nGot two bitches off twitter, Tweedle-Dee and Tweedle-Dum\nSingle ladies, double cups, I'm tighter than a cummerbund\nSmokin' on that strong, my blunt a fucking muscle punk\nTunechi\n\n[Outro]\nAnd I'm gone\nHahaha, yeah, Dedication 4 ho\nFuture fuck with me!", "image": "https://images.genius.com/1cca3a7cb35e2d8b6baa82593cc9844d.525x525x1.jpg"}], "artist": "Lil Wayne"}