{"songs": [{"title": "Pornography", "album": "Rodeo (Deluxe Edition)", "year": "2015-09-04", "lyrics": "[Intro: T.I.]\nNine light years away, just outside of the Kepler solar system\nWe find ourselves consumed and utterly mesmerized with a story of a young rebel against the system\nRefusing to conform or comply to the ways of authority\nHe chose the mood of \"Fuck this shit\"\nAt that moment, the one known as Jacques turned to Scott\nChose to jump off his mama porch\nLeading the stampede of lost souls\nIn the middle of their metamorphosis\nNot quite through with their journey\nAin't made it to wherever the fuck they gon' be in life\nBut wherever it is, it's better than here\nSo fuck you and fuck this\n\n[Chorus: Travis Scott]\nNo monogamy, ménage with me\nPornography surrounding me\nYou get high with me, you come down with me\nThat's all I need in my fantasy\nAll these flashing lights\nGive you some of me, you want all of me\nAnd get high with me and come down with me\nYeah, that's all I need in my fantasy\n\n[Verse 1: Travis Scott]\nYou remind me of my ex, crazy love\nWe designed our love around the drugs\nWe both in this club, we both tryna fuck\nI'ma rub a dub, tryna get a nut\n\n[Chorus: Travis Scott]\nNo monogamy, ménage with me\nPornography surrounding me\nYou get high with me, you come down with me\nThat's all I need in my fantasy\nAll these flashing lights blinding me\nGive you some of me, you want all of me\nAnd get high with me and come down with me\nYeah, that's all I need in my fantasy\n\n[Interlude: T.I.]\nThe story of the bastard was never told\nThe soul of a bastard was never sold\nWill he survive, or will he fold up?\nLiving like a bronco, lifestyle wild and untamed\nSit sip at the top, a long list of no named\nMisfits can't wait to get a chance to say \"Fuck you\"\nTo the ones who say \"Fuck you\"\n'Til you doing ya thing, codeine and cocaine cartels\nWho leads the charge of this young mob?\nLa Flame, he hears in his head, the world is yours\n\n[Verse 2: Travis Scott]\nWake up, nigga, gotta get the cake up, nigga\nNiggas in the bushes in the farms\nMight gotta rake up a nigga\nI'm way too antsy 'cause my ambition's too frantic\nI might need to move to Atlantis 'cause my mind too outlandish\nIt's the rodeo, time to get started\nHouston nigga goin' James Harden\nThey was wildin' on us niggas in the projects\nWonder why a nigga went cold hearted\nThey wanna put my soul up on an auction\nBut I'ma make 'em take the fall like August\nAnd they gon' vote me right in on my caucus\nAnd I'ma show these niggas how to get lawless\nWhy your hands out, asking could you hold one?\nWho do I owe? Nigga, no one\nThey bigging you up but you low down\nAnimated acting frozen\nI got porno pics, wish I can post them\nStackin' Franklins, I can't fold 'em\nNiggas askin' for the old him\nBut I'm way too young to be the old him\nI'ma make this shit crack Lamar Odom\n'Til I climb to the top of the podium\nSo wake up, nigga, gotta get the cake up, nigga\nNiggas in the bushes, niggas on the farm\nMight gotta rake up a nigga\nI'm way too antsy 'cause my ambition's too frantic\nI might move out to Atlantis 'cause my mind too outlandish\nWe gon' rule the world, we gon' rule the world\nWe gon' rule the world, hmm\nNever gonna stop, never gonna stop\nNever ever gonna stop it\n\n[Outro: T.I.]\nLa Flame says \"Let your ambition carry you\"", "image": "https://images.genius.com/937ebfe41ce59f14c6ecff9976182911.600x600x1.jpg"}], "artist": "Travis Scott"}