{"songs": [{"title": "Dangerous Grounds", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "[Method Man]\nYeah yeah yeah yeah yeah yea yo\nYo yo yo yo yo yo yo\nAll them real live motherfuckin niggas step up front right now\nIt's goin down\nOne love to Long Island Hempstead in my heart baby\nShaolin what?\nCome on, come on, HA!\n\n[Verse 1: Method Man]\nDangerous ground\nTre pound seven spin around for my brethren the clouds come down\nWar and peace, I take it to the street\nLand shark on my lawn chop the thumbs off a thief\nAnd curse his first born, is this thing on?\nSend 'em to the children of the corn we the people\nSee, niggas through the eye of the demon\nMy lethal injection, destroyin evil\nHot Nikkel what, private eye one pistol\nAiming at your brain tissue, do or die\nSaid the spider to the fly, \"Could this one be tasty?\"\nLike momma apple pie goodness, Johnny Blaze me\nOn the job like Dick Tracy\nHit the cure for that ill shit like Ben Casey, M.D\nSymbolic thrill like god he shocked it\nLike a finger in a light socket, too good to be forgotten\nIn the rotten apple\nI kick dirt on your sand castle\nCheck the flavor all natural\n\n[Method Man (Streetlife)]\n(Beat your feet)\nHot Niks son\n(Heat-mizer)\nBefore you get the main course\n(Taste a appetizer)\n\n[Verse 2: Method Man]\nSubmerged in the word\nHeavy headed verbal that smack you\nMentally disturb you, attack you\nThirty-six chamb' once again comin at you\nYoung gun got the body snatch you observe\nWise words you can only see through the third\nI fall way beyond the norm on the verb\nShine on mental nourishment, you can dine on\nTrack yellin at me get yo arrow god\nVictory is hard, regardless to whom or what\nThey all movin targets Allah\nRunnin through your house and your block party, with rap shotty\nAnd hot rock the body body, St. Bernards\nCouldn't save your entourage, rap lobotomy\nLeave ya mentally scarred, numb and possibly\nDumb deaf and blind is it\nI kick the spine out the battery backs\nFuckin with mine keep it movin\n\n[Interlude: Method Man]\nNow everybody just throw your hands in the......(phone rings)\nWhat the fuck?\nPeace - who this?\n\n[Verse 3: Streetlife]\nMind detect mind, I P.L.O. your startin line\nDeep Space Nine\nDesigned for knuckleheads who bust guns and throw signs\nLet's converse snatch the tap from your purse\nBody-surf on the verse head first\nPeep defeat, bitch Street beat you down with the heat\nAnd you spazzed out spittin out teeth ain't nothing peace\nBig boys don't destroy blunted zone pop steroid\n50 men convoy, expensive where's the big toy\nRumble through the wasteland right hand's on the silencer\n40 caliber city slicker Staten Islander\nSynchronized minds combine thoughts that motivate\nDon't perpetrate pass the blunt let it circulate\nStreet politicians on a suicide mission\nCrime vision finger itching from a scope-view position\nDangerous ground\nTre' pound seven spin around for my brethren the cloud comes down\n\n[Verse 4: Method Man]\nYo, keep your eyes open\nLove potion number nine poetry in motion\nKnowledge me the seventh sign\nScopin, connivin, infiltrate is most of mine\nPlay 'em nonchalantly, calmly expose the nine\nPush and get shoved what the fuck Gods thinkin of\nComin in the club wit that screwface, actin up\nIs we men or mice, bad moon risin\nWe wild for the night\nKill a schizophrenic nigga twice cuz-o\nThat's what happened when frontin on the Shaol' borough\nIsland of Staten we in here no fear\nAssault wit intent\nTo kill your whole regiment it's real\nStartin wit yo president, duckin my dart gun\nTear apart son - you don't want it then don't start none\nBlaze one with Jonathon, part man part fly\nHandle my B-I camouflage like G.I\nFat like Joe, a day in the life\nYour money or your life that's the life\nEverybody can't afford ice in the struggle\nTryin to eat right another day another hustle hustle hustle\n(Uh huh uh huh uh huh uh huh uh huh)\nDangerous ground tre' pound seven spin around\nFor my brethren the clouds come down\nWar and peace, I take it to the street\nLand shark on my lawn chop the thumbs off a thief\nMotherfucker", "image": "https://images.genius.com/7bb2fc25db22a3900f489969a9537f35.954x951x1.jpg"}], "artist": "Method Man"}