{"songs": [{"title": "My Life", "album": "We Run This, Vol. 7", "year": "2012-02-13", "lyrics": "Yeah\nYes indeed, got 'em up to speed\nWe got what they need, yeah\nReflection Eternal\nMy life, my life, my life, my life\nThis is my life, my life, my life, my life\nMy life, my life, my life, my life\nThis is my life, my life, my life, my life\nYo, what's the daily word?\nYou ever feel like giving everything up\nAnd buying a boat so you can sail the world?\nAiyyo, what's really hood?\nHe got a gift with the lyrics\nThe beat is lifting your spirit when you ain't feeling good\nSometimes he feel like the whole world is turning on him\nThe people miserable and try to place they burdens on him\nHe revealing the truth like he a portal\nA vampire sucked his blood, now he immortal\nFirst he ignored then he worked the applause\nHe thirsty for more cause they loving how he perfectly flawed\nMost of these rappers softer than the allure of Juicy Couture\nAnd from the start he put his heart in every verse he record\nCaused to perform for the corporation, he made a profit with Satan\nThen got with the Beat Konducta for his Liberation\nAnd for free at last till everybody started selling it\nBut him, he's like I need to see a piece of that\nAnd get right with God, he knows his gift is a phenomenon\nHe catch it when it strike like a lightning rod\nHis rhymes are the spitting image he created us in\nWe getting paid in wages of sin\nTrue, it's like death in a room\nEvery lie we ingest and consume\nIs guaranteed to make us vegetables soon\nSometimes it's so hard, can't go on\nWhere did he lose his focus, where did he go wrong?\nHe should love his life, he got a loving wife at home\nBut still find himself roaming through the club at night\nKiss his children and they hug him tight\nGotta prove his love in family court tomorrow\n'Cause he and they mother fight\nThese other artists really don't know what to make of him\nSo they afraid if him, they ain't breaking him\nIt's been over ten years since he gave you the blast\nThe ones that counted him out, they didn't do the math\nThe fans tell him he under-appreciated\nUnderrated and hated but he thankful they debated\nThankful that he made it to glory while some faded\nThankful that he keep it surreal while some fake it\nThankful for the skills that's keeping the family stable\nThankful for the meals he put on the family table\nHe pay the bills when he able and spend for pleasure when he can\nThis the true measure of a man\nSome things he'll never understand, that's okay though\nHe know we're molded in the image of God like Play Doh\nBut still he wax philosophical like Aristotle\nMaybe one day they'll come up with a better model\nBut till then, he the best there is\nMore than ten-thousand hours in\nSo that make him the specialist\nOh yeah, it's way more than relevance\nIt's classic, original, you remember this", "image": "https://images.genius.com/8740213e0cdc34c6e3e40fae561a8310.500x500x1.jpg"}], "artist": "Talib Kweli"}