{"songs": [{"title": "JFK", "album": null, "year": "2017-09-06", "lyrics": "[Intro]\nIt ain't really shit too\nAnd when it busts to the head nigga\nBoot up, voot up\nMeltFaze productions\nThirty with the dick\nWoke up like, \"where the fuck the dope at?\"\nKnow we fuckin' lit, yuh\nOoh she mad, bitch need milk\nOoh she mad, bitch need milk\nOoh she mad, bitch need milk\nAyy, ayy, ayy, ayy, ayy, ayy, ayy, yuh!\nAyy, ayy, ayy, yuh! Bitch, ayy, ayy\n\n[Verse 1]\nLil Boofy got the .22, let it do-do-do\nAnd I'm with the blade like I'm Puss n Boots 2 (Ayy)\nLouis straitjacket, I'm a fuckin' loose screw (Look at my jacket)\nHad to rob the pesos off my nigga Jesus\nCocaine coat like a fresh mosh[?]\nShawty need some milk gave that bitch a Yoohoo\nPsychedelic mushroom ring I do (Yuh, Yuh)\nAnd I'm running with the Ray Gun, pew-pew-pew\nLike dip, dip, dip, dip (Come here), dip, dip, dip that motherfucker\nFrom the hip, hip, hip, hip, hip, hip, hip pussy boy\nBitch on whoa, bitch on go\nAnd that ass built like some Cadillac doors\nProbably on 6s, probably on 4s, Flyboy done came through\nAnd me and [?] stun those\nLike look at my bezel it's shiny, mm\nShe like the way that I'm rhyming, mm\nLook at them titties I'm signing, mm\nThese niggas stealing my styling, mm\nI last forever like diamond, mm\nShe get me hard as a diamond, mm\nMy wrist whip while it's reclining, mm\nGold on me like I was mining, ayy\n\n[Chorus]\nDrop my top, JFK, yo bitch pussy on my plate\nAll my jewelry, like McFlurry, or a fucking Zebra Cake\nDrop my top, JFK, yo bitch pussy on my plate\nAll my jewelry, like McFlurry, or a fucking Zebra Cake\n\n[Verse 2]\nAll of your diamonds look dirty, mm\nAll of my jewelry look scurry, ayy\nMy diamonds came with a story, hm\nOnce 'pon a time they was buried, hm\nDog in that pussy I Courage, ayy\nNow she talking 'bout a marriage?\nMight come with a blur\nMy diamonds came in like skrrt, okay\n\n[Chorus]\nDrop my top, JFK, yo bitch pussy on my plate\nAll my jewelry, like McFlurry, or a fucking zebra, ayy\nDrop my top, JFK, yo bitch pussy on my plate\nAll my jewelry, like McFlurry, like a fucking zebra, ayy\n\n\n[Outro]\nOoh she mad, bitch need milk\nOoh she mad, bitch need milk\nOoh she mad, bitch need milk\nLike voot up, voot up, voot up, yuh!", "image": "https://images.genius.com/700319c587bb125962c760f3a447b19f.500x500x1.jpg"}], "artist": "Ski Mask the Slump God"}