{"songs": [{"title": "No Wack DJs", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "[KRS-One]\nWord, YEAH~! So we sing\n\n[Chorus: KRS-One]\nMe-don't-wan'-me-don't-wan'-me-don't-wan'-me-don't-wan' no whack deejay-uh\nMe-don't-wan'-me-don't-wan'-me-don't-wan'-me-don't-wan' no whack deejay-uh\nMe don't like what they play, me don't like what they say\nMe-don't-wan'-me-don't-wan'-me-don't-wan'-me-don't-wan' no whack deejay-uh\n\n[KRS-One]\nNew flow, new style, comin in BOOM BAP\nWho now wanna throw down, the crew's wild\nOne flow - you go, two flows - you outta here\nWe pros, three flows, buck through your outer gear\nLet's raise the fahrenheit on these DJ's we don't like\nYou know who I'm talkin about, yo they might come on tonight\nThey never hype, never tight, that's not polite\nAm I lyin? No you're quit right\nSo tonight, I be statin facts, most DJ's are whack\nThey be holdin back, they NBA - Never Broke a Act\nYo I'm hopin that, new DJ's open rap, bring the focus back\nAnd take the crates from these fakes to the lake and throw 'em OVER that\nWe lead 'em to freedom or poetically beat 'em up\nIn conventions like meet 'em, see them, we plan to eat 'em up\nI'm bein MC'in seein and agreein that this here cut\nDEFINITELY will hit them up, so we sing\n\n[Chorus]\n\n[KRS-One]\nI SCREAM on these rappers like directors do actors\nHang with computer hackers on farms and ride tractors\nThug spelled backwards is GUT, drop the H\nIf you ain't got guts and you callin yourself a thug, you a fake!\nNot just the guts to bust off 44 calibre\nCause mad thugs turn bitch when you show that ass algebra\nIt's like... the vexed look, the sex look\nThe checks look, cause brothers be, scared of that textbook!\nYou best look elsewhere, knowledge of self here\nNever no welfare, echinicea for health care\nOutrappin 'em, slappin 'em, ghetto scholar like Pun, Joey Crack and them\nOn spraypaint we put fat caps on 'em (WORD)\nUp in the yard, we go to hittin it harder\nThen return to reprieve as mild-mannered Kris Parker\nThe exec, signin on checks, approvin budgets\nBut if you want it, meet me at any club, we can THUG IT\n\n[Chorus]\n\n[KRS-One]\nN.O.R.E. goes \"WHAT WHAT,\" Cube goes \"YEH-YEAH!\"\nJamaicans go \"BUCK BUCK,\" MC Eiht goes \"GYEAH~!\"\nMaster P goes \"UNGHHH,\" Busta RHymes goes \"YAH YAH\"\nKRS-One goes \"WOOP WOOP\" like cop cars\nCause I pull over pop stars and arrest they guitars\nAnd sentence them to the turntables, cuttin on 8 bars\nShakin 'em up, rippin 'em down, brother whattup? Gimme a pound\nYou diggin the sound I'm bringin around, shakin the ground, never a clown\nYou know that you buggin, but you also know that you love it\nSomethin new and bumpin others be frontin\nThey can't even think about, new flows and techniques\nThey speak when the check speaks but KRS-One is direct heat\n\n[Chorus] with ad libs\n\n[Chorus]\n\nYES!!!", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}