{"songs": [{"title": "Woop! Woop!", "album": null, "year": null, "lyrics": "Chorus:\nWoop-woop!\nThat's the sound of da police!\nWoop-woop!\nThat's the sound of the beast!\n\nVerse One:\nStand clear! Don man a-talk\nYou can't stand where I stand, you can't walk where I walk\nWatch out! We run New York\nPolice man come, we bust him out the park\nI know this for a fact, you don't like how I act\nYou claim I'm sellin' crack\nBut you be doin' that\nI'd rather say \"see ya\"\nCause I would never be ya\nBe a officer? You WICKED overseer!\nYa hotshot, wanna get props and be a saviour\nFirst show a little respect, change your behavior\nChange your attitude, change your plan\nThere could never really be justice on stolen land\nAre you really for peace and equality?\nOr when my car is hooked up, you know you wanna follow me\nYour laws are minimal\nCause you won't even think about lookin' at the real criminal\nThis has got to cease\nCause we be getting HYPED to the sound of da police!\n\nChorus\n\nVerse Two:\nNow here's a likkle truth\nOpen up your eye\nWhile you're checking out the boom-bap, check the exercise\nTake the word \"overseer,\" like a sample\nRepeat it very quickly in a crew for example\nOverseer\nOverseer\nOverseer\nOverseer\nOfficer, Officer, Officer, Officer!\nYeah, officer from overseer\nYou need a little clarity?\nCheck the similarity!\nThe overseer rode around the plantation\nThe officer is off patroling all the nation\nThe overseer could stop you what you're doing\nThe officer will pull you over just when he's pursuing\nThe overseer had the right to get ill\nAnd if you fought back, the overseer had the right to kill\nThe officer has the right to arrest\nAnd if you fight back they put a hole in your chest!\n(Woop!) They both ride horses\nAfter 400 years, I've _got_ no choices!\nThe police them have a little gun\nSo when I'm on the streets, I walk around with a bigger one\n(Woop-woop!) I hear it all day\nJust so they can run the light and be upon their way\n\nChorus\n\nVerse Three:\nCheck out the message in a rough stylee\nThe real criminals are the C-O-P\nYou check for undercover and the one PD\nBut just a mere Black man, them want check me\nThem check out me car for it shine like the sun\nBut them jealous or them vexed cause them can't afford one\nBlack people still slaves up til today\nBut the Black police officer nah see it that way\nHim want a salary\nHim want it\nSo he put on a badge and kill people for it\nMy grandfather had to deal with the cops\nMy great-grandfather dealt with the cops\nMy GREAT grandfather had to deal with the cops\nAnd then my great, great, great, great... when it's gonna stop?!\n\nChorus", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}