{"songs": [{"title": "Language Arts Diss", "album": "Emurge", "year": null, "lyrics": "[Verse 1]\n\nFUCK Language Arts! Yo\nIt's kinda sad to see a fake ass Cassidy\nTrying to drastically murder me when you battle me\nHomie you're not the man you ain't even got no fans\nI beat you over the head with my mama's pots and pans\nYou shouldn't want to rhyme because the only fan you'll ever have is the one you cool off with in summer time\nYou pick me to battle, dog i'm the worst one\nI got your fuckin' mama wishing I was her son\nInstead of you i wish you would leave no residue\nI make a mess of you, You'll be needing treatment that's medical\nSo backing down from this battle is what you better do\nAh fuck it i'll show you how to wreck it dude\nYou put yourself in this situation you piece of shit you anus\nI'll rip you famous and i'll diss you back just to get YOU famous\nWhack mother fucker you can't even hit my ranges\nWhat's wrong didn't think Hopsin could come strong?\nHow you going to be a rapper, you only got one song\nI come with better art\nYour career is like a car with no battery\nHomie it ain't gonna ever start\nI'll shred apart your diss and fill your head with darts\nI'm hella smart whats happening dog? You fell apart?\nWell listen heres a big suggestion\nDon't come online when their disses present, it's a lesson\nBecause the only tight shit you've ever rapped\nWas a mother fuckin' christmas present bitch!\nYou diss my fan base? I'll sock your damn face and\nKick your knee caps in so you can't stand straight\nThis man's fake, now who's for that shit?\nCome on he has a fake New York accent\nLanguage you really thinking you at the top? (yeah)\nHow's that? soundclick voted you as a flop (ha)\nYou stupid by being the first to spit\nI ain't even gotta write another verse to this\nI murked this shit so go ahead and write a diss back\nYour shits whack, when i hear it i just laugh\nHOO-HEE-HA-HA  you're funny man\nThen I saw your picture on the internet, you're ugly man\nYou always talkin' about you're chasing whores\nWith that ugly ass face of yours? man you're faking dog\nI'LL MAKE THE CAUSE TO BREAK YOUR JAW MAKE YOU WALK HOME NAKED WHEN I TAKE YOUR DRAWERS\nNIGGA YOU CAN LICK MY GREAT BIG BALLS I'LL PUT A GUN TO YOUR HEAD MOTHER FUCKER SAY I'M RAW! SAY IT!!\nMan i'm getting tired of doing this\nYour whole career man, I just ruined it\nIt's time for me to go now (go now)\nLet your career go down (go down) OHH WOW\n\nWhooa I hate to break your heart\nBut Hopsin just killed Language Arts\nHeyyy fuck Language Arts\nI really really really hate to break your heart i said\nWhooa I hate to break your heart\nBut Hopsin just killed Language Arts\nHeyyy fuck Language Arts\nI really really really hate to break your heart\nNow sing Ayy yo Ayy yo Ayy yo, nigga you don't wanna step to me\nYou are just a weak MC, acting like you're from the streets\n\nFuck Language Arts!\nBitch", "image": "https://images.rapgenius.com/e1bfaf77577691d74e7db8ef5afed962.650x433x1.jpg"}], "artist": "Hopsin"}