{"songs": [{"title": "Murder By Reason of Insanity", "album": "Mr. Scarface is Back", "year": "1991-10-03", "lyrics": "(Verse One)\nNiggas get stomped when they step with that bullshit\nIf you got a firearm, go ahead and pull it\nCause I'mma put it dead on ya ass when you reach\nI got a little friend on my shoulder that I think you oughta meet\nA 9 millimeter, that'll stop him\nGet his ass in focus, once I focus I'mma drop him\nBoy you should have known not to fuck with me bitch\nBrothers like me are making mortuaries rich\nSo if you got something that you think you wanna prove\nYou better prove it now\nCause you don't get a second chance dude\nOne chance is all you get\nAnd if I beat you to the draw, that's it\nGet your mom a black dress and call your family\nIt's gonna be a murder, my reason? Insanity\n\n(Verse Two)\nI was born with a chip on my shoulder\nNow that I'm older, momma's talking shit but I told her\n\"Mind your fucking business\" I love the girl to death\nBut I don't wanna hear it, save your fucking breath\nI know my time is coming, and I ain't gonna lie\nI may be scared of Jason, but I'm not scared to die\nSo when a nigga talk shit, and I buck 'em\nShoots me in the head, put me in a box, and just say \"fuck him\"\nLater on that day I heard gunshots\nA bunch of niggas running\n(Aye, aye yo, Akshun, yo, Akshun, that nigga got shot!)\nRan to the corner \"What happened my brother?\"\nHe just laid there shaking, bleeding like a muthafucka\nGod damn!! \"Who was that, that offed him?\"\n\"Some niggas from your hood triple crossed him\"\nGet your shit together, we're heading for the village\nI think its time to pay them hoes a little visit\nThem niggas don't understand me\nIt's gonna be a murder, my reason? Insanity\n\n(Verse Three)\nPulled up in a Rider, trailer full of niggas\nMAC-10, TEC-9's, all with fingers on the trigger\nBacked in the bitch like I was staying\nOpened up the trailer, *gunshots* South Park started spraying\nBullets flying everywhere, niggas getting struck\nHad dope in the village, but I didn't give a fuck\nShoot the bitch up, then I'mma leave her\nIf I can't sell my dope, then you can't either\nNow here's a valuable lesson to learn\nYou fuck with mine, you get burned\nHeaded for the nigga who shot my partner\n*Gunshot* Shot his father\nWalking through the living room, tearing up shit\nHe's loading up his pistol, ain't that a bitch\nYou should of had it loaded, he said \"Come on Scarface, hold it\nI won't do it again man\"\nYeah, I know it\nI told you when you take mine, I take yours\nHands in the air, fell to the floor\n\"Please don't shoot Scarface\"\nI looked him in the eye - then I shot him in his face\nA sucka's way out is to steal 'em\nDad said \"Always look a man in the eye before you kill him\"\nIt had to be a murder, them hoes couldn't handle me\n\"What's your reason man?\" - Insanity", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}