{"songs": [{"title": "The Ocean", "album": "Purp & Patron", "year": null, "lyrics": "[Hook: Dr. Dre & Dre]\n(Tryna' find the ocean) It's over here\n(Tryna' find the ocean) Yeah, it's to the left\n(Tryna' find the ocean) Cause we ain't hard to find, follow the sunshine\n(Looking everywhere)\nDo you know where to find me, right under that palm tree island\n\n[Verse 1: Game]\nI'm goin', goin'\nTake a flight like a motherfuckin' Boeing\nAftermath, and faggot like you ain't knowin'\nWe stack Bentleys, drive fast cars\nAnd fuck with multiple minages\nLivin' the largest, nigga we heartless\nHow could you blame us?\nCrooked cops, they frame us\nThey mad cause I'm more famous than Amos, right?\nTaking cookies from these rookies could be dangerous, right?\nSalute your motherfucking city of them Angels, right!\nThat entertain the life, that ain't the life that we livin'\nMost of my niggas is better off in prison\nWishin', missing\nThey fuckin' kids, man, they fuckin' wife, man\nThe double meaning only caught up with that white man\nTurn off the lights, man, put up the lights, man\nLet 'em know we still got it for the right price, man\nAnd you could disappear for the right price, man\nThis the left culture, best know everybody get lost just...\n\n[Alternate Hook: Dr. Dre]\n(Tryna' find the ocean) It's over here\n(Tryna' find the ocean) Yeah, it's to the left\n(Tryna' find the ocean) Cause we ain't hard to find, follow the sunshine\n(Fuckin' everywhere)\nWhere the beaches? Where the bitches?\nYou know, right here, so come on in\n\n[Verse 2: Game]\nWell, I'm gone man\nThey out of Goose, get Patron then\nCan't sell it, move it by the zone and\nThe money talk, only conversate with grown men\nThe paper real basic, like the birds that get flown in\nCalifornia hotties, like furniture in my lobby\nWhere I'm from, don't you know? Nigga, drinkin' ain't a hobby\nI'm bi-coastal, nigga don't make me go postal\nYou know I keep the Glock 9 comfy in my holster\nI'm supposed to ride roasters\nSip bottles on Louis coasters\nFeed bitch niggas to the vultures\nWhat, you mad cause I'm back with the doc?\nMoney, alongside the yacht\nDiamonds inside of my watch, ballin'\nWe all live playin' poker with this rap shit\nGame time chips on the table, you know how I get\nHundred thousand Benz\nMillion dollar checks\nLookin' on my city, kinda hard when you standin' through the clouds and...\n\n[Hook]\n\n[Bridge: Dre]\nWhenever you touchdown in Cali, be prepared\nCause niggas there, might put your life on the line\nPut your life on the line\nPut your life on the line\nPut your life on the line\nIf you wonderin' where I be\nYou know where to find me\nI'll be right by that ocean\nDon't get it twisted\nIt's the fuckin' pacific\nCome and see, I be right by that ocean\n\n[Outro: Busta Rhymes]\nFrom comin' to follow that order\nUnderstood? We comin' from the water\nFrom comin' to follow that order\nUnderstood? We comin' from the water\n(?)\n(Tryna' find the ocean\nTryna' find the ocean\nTryna' find the ocean)", "image": "https://images.genius.com/2ac5b9e1da222cb025aa059f64716e53.500x500x1.jpg"}], "artist": "The Game"}