{"songs": [{"title": "A ’Yo Kato", "album": null, "year": null, "lyrics": "Uh\nThis should go out to my dawg Kato\nRest in piece baby\nHe's the kingpin\nDawgs that I called my friends\nPraying for all my friends\nThings I do for my friends\nWe miss you, Kato! Kato!\nStarted of two dawgs wit the the goals\nNuttin but two dawgs walkin the same road\nTwo different cultures, but had the same heart\nEnjoyed seein the light, but lived in the dark\n5th album bumped heads in the park a lot\nWas a pride brother, didn't like to bark a lot\nCame correct, when he came, he gained respect\nSo I gave respect, we shared the same respect\nTwo names in wreck now on the circles\nTwo brothers with good heart, but if you start, two brothers that will hurt you\nYou know how that dirt, hittin four corners\nEarh! Earh! Earh! Earh!, right back upon us\nGod tried to warn us but sometimes we don't see\nWhen I first heard I'm like \"this can't be, y'all niggas is buggin\nGot the wrong information or suttin, please tell me that these niggas is frontin\nGod No\"\nDawgs that I called my friends\nPraying for all my friends\nThings I do for my friends\nWe miss you, Kato! Kato!\nDawgs that I called my friends\nPraying for all my friends\nThings I do for my friends\nWe miss you,(We miss) Kato! (you) Kato! (Kato)\nDawgs that I called my friends\n(We Miss) Praying (You) for (Kato) all my friends\nWe miss you,(We miss) Kato! (you) Kato! (Kato)\nIf its ok, let me kick it wit you for a minute\nThere left unsaid dawg we wasn't finished\nNever got to say thank you for bein a friend\nDawgs! for Life! and you, will role to the end\nHeld dawg down didn't let a day go by\nEverytime dawg came to the shy (what!)\nI was good, trips out to Phoenix with the scrambling squad\nIf I come back to Phoenix I'm like, damn its hard\nTo accept the fact (Uh), that you won't be comin back (Uh)\nBut I hope your comin back (Uh), cause I won't accept the fact (Uuhh!)\nWhen you came to New York, You had to come to the crib\nAnd vise-versa (Yeah!), that's just how we did\nRemote-contol cars (What!), we would race all day\nIt was adventure, we would chase all day (Yeah!)\nSo I'm not gon say good-bye ma nigga (uh uh)\nInstead I would rather (Rather) focus on the time we spent together\nThat's what matters (for real)\nDawgs that I called my friends\nPraying for all my friends\nThings I do for my friends\nWe miss you, Kato! Kato!\nDawgs that I called my friends\nPraying for all my friends\nThings I do for my friends\nWe miss you,(We miss) Kato! (you) Kato! (Kato)\nDawgs that I called my friends\n(We Miss) Praying (You) for (Kato) all my friends\nWe miss you,(We miss) Kato! (you) Kato! (Kato)\nI need you to save me a spot next to you and the Lord (Aight)\nI don't know when I'm comin but keep checkin the door (Aight)\nBut while I'm here, knock on wood\nI'll make sure your kids remember who they farther was and Val is good (aight!)\nUnderstood how real niggas move, we don't talk (We don't talk)\nBut you gon' always have family in New York, believe that (Yeah)\nWhere you at you can see that\nWe dawgs for life and in death and I mean that, Vato\nDawgs that I called my friends\nPraying for all my friends\nThings I do for my friends\nWe miss you, Kato! Kato!\nDawgs that I called my friends\nPraying for all my friends\nThings I do for my friends\nWe miss you,(We miss) Kato! (you) Kato! (Kato)\nDawgs that I called my friends\n(We Miss) Praying (You) for (Kato) all my friends\nWe miss you,(We miss) Kato! (you) Kato! (Kato)\nYo\nWhere The Hood at is bangin right now man\nThat was your favourate joint baby (We miss you Kato)\nIts goin just like we thought it would baby\n(We miss you Kate) Ye\n(We Miss you Kato)\nI'll always love you K", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}