{"songs": [{"title": "Tearz of a Clown", "album": null, "year": null, "lyrics": "-Tearz Of A Clown (lyric breakdown)-\n\n[Verse 1]\n\"Start from the intro\"\nI can't though, it's gonna be too painful\nTo speak of all the evil obstacles my people came through\n\"Equality?\"\nIs not true, I rush to beat the curfew\nI guess nobody told us that the people gotta eat too\n\"The system?\"\nI laugh, cause I don't see no truth left\nAddicted to that crack or raised too high to fight for Yusef\nCan't blame 'em, they slumber, come here ya Casanova\nJust because Mandela is free don't mean the freedom fight is over\nThe beaches, Howard, Virginia and the others\nYa let 'em lynch the brothers and no one will love the mothers\n\"Confused?\"\nYou shouldn't be, my facts are stated clearly\nBut my raps contain no \"wild thing\" so I guess no one will hear me\n\"They're killin' us?\"\nBut what's new, cause nobody will yell out\nThey're all too busy livin' lavish lives of a sellout\n\"The police?\"\nA big joke, the only time their gun smokes\nIs when they murder brothers after every bone has been broke\n\"Huey?\"\nA hero, although he never tried to be\nDied and since his death he's still a victim of society\n\"Well, what's next?\"\nUnity, respect and love your sisters\nWe joke and call 'em bitches so the crackers try to diss her\n\"We'll kill them?\"\nThat's not the way, it's time to use intelligence\n\"Turn the other cheek?\"\nNever again, it's time for self-defense\n\"How come you're so angry?\"\nCause I'm tired of bein' kept down\nNow it's time to wipe away the tears of a clown\n\n[Intermission]\n\n[Verse 2]\n\"Why ya cryin'?\"\nI told ya, I'm tired of livin' life low\nThe rich can beat the lotto, while the poor stay in the ghetto\n\"The president?\"\nElected, but I don't know how it happened\nBetter qualified for rappin', with his gift for senseless yakkin'\nA day for Martin Luther King, now his soul is put to rest\nTurnin' over in the grave next to him is Malcolm X\nForgotten too quickly, it makes me want to hate them\nForgot about his wisdom, he's the latest fashion statement\n\"Red or Blue, what set ya claim?\"\nDoes it make a difference?\nOne day we're gonna work it out and overcome this ignorance\n\"Education?\"\nPropaganda, taught to me in class\nHow can we control our future if we're kept from our past?\nWe better live a better way or we won't see another day\nYou can heed the words I say or don't and kiss your life away\nNot tryin' to preach or teach, it is my wish to only explain\nSo many died before me, can I let their lives be in vain?\nSo now we've come to this point, it's time to make decision\nDo we live in self-destruction or escape the realism?\nThey ask me why I'm angry, cause I'm tired of bein' kept down\nMy people, let's unite and wipe away the tears of a clown\n\n[Intermission]\n\n[Verse 3]\n\"What ills the children\"\nThe future, for them, I see such sorrow\nThe least that we can do is let them live to see tomorrow\nToo many have been killed, it's time to stand up for our rights\nHow can the people \"Fight The Power\", if they can't fight for their life?\nInstead, they fight their wife, beat up if she's not silent\nTime to fight for principles, the brothers get nonviolent\nThe government is so crooked and liberties a hypocrite\n\"The Star Spangled Banner?\"\nJust some patriotic bullshit\nDestruction of the Panthers another sneak attack plan\nCouldn't stand to see the strength and peace within the Blackman\n\"Where are all the heroes who we thought were so untouchable?\"\nI see 'em pushin' dope and rollin' 'round in BMW\nHow can it not trouble you to see a dyin' species?\nThe world must find peace or find itself ripped up in pieces\nAfflicted with the teaching's, that make ya feel inferior\nSome say the government invents it all, that they just scarier\nPolly want a cracker, but cracker want a sister\nHow come they could see her beauty, but brothers persist to diss her?\nRevolutionary generation on an uprise\nNever will they see another tear from this clown's eye\n\n[Intermission]\n\n[Verse 4]\nLivin' the life I live, I have to be positive\nHell's my reality, I chose not to ride in it\nI did want to live fast, I just wanted much cash\nBut punks were persistent, they hunted with gauge blast\nSo I wasn't the violent type, I had to protect my life\nLovin' my brother, but if he steps, I'mma shoot him twice\n\n(song cut)\n\nPsychotic society\nIt's hard to find love with those who treat us like enemy\nThey call me a lunatic, I say realistic\nBeware of their politics, it's sick as the sick get\nThe son of a Panther, see pain in my mama's eyes\nCause nobody thanked her for givin' them better lives\n\"Assata Shakur?\"\nAnother auntie, I miss her though\nPlease thank Mr. Castro for keepin' her safe bro\nHow many more of us die before we can see the light\nIt's time brothers work it out, unite for a bigger fight\nWe're still in the same hole and now it's the 90's\nSeems everyone's livin' large, but I ain't got mine G\nBut I got a bill for all the ill ya gave me\nSociety slavery, who's gonna pay me?\n\"Has anybody here seen Yusef Hawkins?\"\nI thought I seen him talkin' with Malcolm walkin'\n\"Where, over the rainbow\"?\nNaw, over the track\nAnother murdered brother, now where's the payback\nTears of a clown\n\n[Intermission]", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}