{"songs": [{"title": "Look At Me! (Official Video)", "album": null, "year": "2017-09-12", "lyrics": "Part 1: Look At Me!\n\n[Intro: Dildo Uni]\nBehold my liege, I am your noble steed\n\n[Verse 1: XXXTENTACION]\nI'm like \"Bitch, who is your mans?\" (Ayy)\nCan't keep my dick in my pants (Ayy)\nMy bitch don't love me no mo' (Ayy)\nShe kick me out I'm like vro (Ayy)\nThat bitch don't wanna be friends (Ayy)\nI gave her dick, she amen (Ayy)\nShe put her tongue on my dick (Ayy)\nLook at my wrist, about ten (Ayy)\nJust got a pound of the boof (Ayy)\nBrought that shit straight to the booth (Ayy)\nTommy my Hilfiger voots (Ayy)\nShe said, \"wan' fuck?\" Bitch, I do (Ayy)\nYou put a gun on my mans (Ayy)\nI put a hole in your parents (Ayy)\nI just got lean on my ksubis (Ayy)\nI got a UZI, no Uzi\n\nPart 2: Riot\n\n[Intro: Luke White]\nLuke White on the beat\n\n[Verse 2: XXXTENTACION]\nYou ever seen a nigga hung with a gold chain?\nI'd rather sing about the same things that we claim\nSuch is bashful, but niggas like the task force\nMobbin' on the streets and robbin' stores in ski masks, bruh\nNiggas ask for peace in a riot and bring violence\n'Cause it's a game of cat and mouse and you gon' bleed silent\nWhat's the justice in sayin' fuck it and grab the pump?\nThen kill a woman of many children makes you a chump\nLook at all the stores you wreckin', nigga I reckon\nThink about the people who own it for about a second\nI know you got your problems, but brother, they got theirs\nThis is not a game, quit violence and grow a pair\nBut yo, you'd rather hear me say, \"Fuck black prejudice!\"\n\"Let's murder different races, grow hatred and form irrelevant!\"\nViews and etcetera, knives thrown\nDamage 'em, lives blown, oblivion hole cold, oblivious\nI won't dare say that you should stop the fuckin' ignorance\nMurder ops, killin' shit, I'd enjoy the thrill of it\nBath in blood of officers', different corpses, offin' 'em, Auction 'em, don't you bark at 'em\nMurder 'em, never heard of 'em\nI could preach the peace but say \"fuck it\" and preach the murder\n'Cause this ain't fuckin' life that we livin'\nGo ahead and grab the extension\nGrab another one: uncle, cousin, brother, son\nGlory to all the chosen ones that will rid you of the innocence\nBut in a sense, innocent will soon behold the ignorance\nBlasphemous, killin' our own, murderin' black—\n\n[Outro: XXXTENTACION]\nEquity and equality: the end result we all — the ones that don't want to live in misery, that is — desire.  And naturally we all black and white are schadenfreude or malicious. Here are a few examples\n\nEmmett Till, August 28th, 1955, Mississippi — pulled out of his house in the middle of the night, in front of his mother who had to watch her son be taken from her on the sidelines, for little to no reason at all worth murdering a fourteen-year-old boy.  Castrated, mutilated, but also documented for the years to see\n\nKori Ali Muhammad, black-on-white. Philando Castile, white-on-black.  Now these things never come to or remotely remain in the public eye. And the youth is never inspired to take a stand to make a difference. So I will speak for them. The youth, that is, the ones full of innocence. The ones inspired by the things around them, to matter\n\nI can go on forever about the fact that murder is murder whether you're black or white. You should always feel free to voice your opinion, but to act out on these irrational thoughts in every shape or form is disgusting. You cannot, as black or white, call yourself the supreme race when moved out of your comfort by the opposition's color, their skin color.  That is no form of being or demonstrating being a supreme being\n\nIf you are a supremacist, be unmoved by the opposition. Remain unscathed in the comfort of your own home, in your own realm. Demonstrate care for the youth's future, white or black, black or white. Are you willing to risk your child's future due to your own bigotry? The choice is yours, but your child will not stand for the hate. This generation will be loved, nurtured, heard and understood", "image": "https://images.genius.com/fa375366504b46eef8de1d192c20976b.790x790x1.jpg"}], "artist": "XXXTENTACION"}