{"songs": [{"title": "You Don’t Have To Hide", "album": "Fly Times, Vol. 1: The Good Fly Young", "year": "2019-04-20", "lyrics": "[Intro: Wiz Khalifa]\nYou already know, man\nUh\n\n[Verse 1: Wiz Khalifa]\nI got a deuce, I got an ace\nI got a car for every bump on your dirty face\nIf you ain't gang then you in the way\nNo we ain't the same, diamonds spellin' out my name\nShorty want the pleasure but it come with pain\nHard to tame and blessed with a lot of game\nKeep the kush under a flame\nThe grind was a slow process but well worth it\nNow they nervous, shit get way deep under the surface\nI traveled all around the Earth and never missed a day of work\nYou fallin' off, I'm keepin' it more player\nSmoke one flavor\nParkin' my low riders, pissin' my neighbors off\nBeen in the game way too long and ain't take a loss\nHow you showin' up to work late and think you a boss?\nMy plane takin' off, more money in the bank\nLess time spent on waitin' on someone else\n\n[Chorus: Young Deji]\nYou don't have to hide no more, yeah, ayy\nYou don't have to hide no more, yeah\nYou don't have to hide no more, yeah, ayy\nYou don't have to hide no more (No)\n\n[Verse 2: Wiz Khalifa]\nAlways have and always will be\nThe sickest, my nigga, ain't no remedy\nStay on the grind, ain't no plan B\nYou hustle hard, you understand me?\nRoll up the plants\nStuffin' them hundred dollar bills in my pants\nShe ran out of luck, last chance\nAhead of my time, way too advanced\nWondering what my new shit gonna sound like\nRolling kush by the pound\nAin't tough 'less your niggas is around\nStill underground\nWith thirty mil' a year, how that sound?\nMy son straight so I ain't gotta worry 'bout much\nYou out of touch\nMoney straight, pile it up\nI can buy what I want\nI ain't takin' her out on a date, no way\nSunshades, brighter days\nRollin' kush up, buyin' them J's\nMy flow is more exciting\nYou niggas more into biting\nLess talking, more writing\n\n[Chorus: Young Deji]\nYou don't have to hide no more, yeah, ayy\nYou don't have to hide no more, yeah\nYou don't have to hide no more, yeah, ayy\nYou don't have to hide no more (No, girl)", "image": "https://images.genius.com/25f75d9000a8f2a523b5c3528fe6759b.1000x1000x1.png"}], "artist": "Wiz Khalifa"}