{"songs": [{"title": "Promise", "album": "Da Drought 3", "year": null, "lyrics": "[Verse: Lil Wayne]\nDamn, she bad, damn, she thick\nAnd I may not know her perfect, but damn she it\nAnd she thick and she right, damn, she nice\nYou can be my judge, baby, yeah, I'll do life, give me life\nAnd I know that you be dancing till your toes hurt\nBut I can make your toes curl, I can make your soul jerk\nWe can soul search, and I also got that street credit\nI got more work than any dude you knew\nGirl I am a Blood, soo-woo\nI hear you want somebody you can call \"boo\"\nI will change my name to \"Boo\" and fuck around and call you\nNow what you wanna do?\nBecause whatever that may be, baby, I want do that too\nAnd ooh, I can GPS you, ooh, what you going through?\nLike a pair of wet-and-sticky Vickies, girl, I'm on you\nOkay ma, the mood is so right, light two and take flight\nMy nigga T.I. is the King, I am your Prince, your knight, right\nYou don't need a Superman, you just need a man like Weezy\n(Baby!) And I can make you feel the same way\nWe can postpone and stay home like a rain day\nShe'll have the salad, just put her on Wayne's plate\nWhat you know bout having syrup poured on that pancake\nNasty as I wanna be, or nasty as you like me to\nBe, I hope you like me too, but now you know I like you too\nThree A.M. room service, serve ya\nYou can be my dessert, be my caramel sherbert\nCall your mama, we can make a baby\nAnd the way you work that mic in the video is so (Crazy!)\nAnd that chair or stool move was cool\nYou make me wanna *ooh*\nBut I'mma be cool, I need a moment\nI think you are the finest human on earth\nWe can get together, I can help you with that homework\nTake your ass to school, too, boo\nTeach you all the rules you never knew, we need a moment\nI could be your future, I could be your teacher\nBe your professor, write down this lecture\nYou want some extra credit? Let me check your homework\nI could be your tutor and help you with exams\nNo failing, or it's summertime for you\nYou got them Goodies and I got a sweet tooth\nNow can y'all blame me?\nShit, Hov got Bey, and I just want Ci\nSee, I just want to see if you're taller than me\nNo, really, I want see if you're my Mrs. Carter-to-be\nYeah, I know, this is pretty awkward for me\nBut I jus act like you are talking to me when you say\n\n[Interlude: Ciara]\nAww, I mean everything that I say\nFrom the bottom of my heart\nI would never, never ever hurt you\nI open my heart\n\n[Lil Wayne]\nBelieve that, and I agree that\nOpen up your heart to me and you won't get the key back\nMs. Ciara, you are colder then blue\nAnd baby, I ain't talking to nobody else but (you)\n\n[Refrain: Ciara]\n(There's nothing I won't do) There's nothing I won't do, baby\n(To spend my life with you) To spend my life with you\nI'll give my all to you\nI promise I will never lie, oh\n\n[Outro: Lil Wayne]\nYeah, Weezy F\nWho better? Who else? But me? Haha\nHey, sweetheart, I don't care what nobody say\nReal niggas gon respect it, y'dig?\nAye, darling, you are all that\nWhatever that is, I'd sure like to know\nLet me cut that out man, aye straight up\nI just did this, Mama, 'cause you, you deserve it\nYoung Carter, I'm out!", "image": "https://images.genius.com/82588434bc5c5032b1e49dee6403c736.1000x1000x1.jpg"}], "artist": "Lil Wayne"}