{"songs": [{"title": "You Song", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "[Produced by Cam, Nate Fox, and Peter Cottontale]\n\n[Intro: DJ Drama]\nShout to Chi-Town!\nDedication 5, since '05!\nKnow that!\n\n[Verse 1: Chance The Rapper]\nYou feel like Kool-Aid in a wine glass witchyo' fine ass\nYou fine as two grapes gettin' stomped out by a giant cask\nYou the best dressed with ya breasts showin'\nLike a salad no dressing, take ya to ya favorite restaurant\nAsk for the bread then fuck in the restroom\nThey don't ask for a pass when yo ass waltz in my dress room\nYou the best bride and I'm the best groom\nWedding presents got my best man at the Best Buy\nBuyin' the Best of Fresh Prince for the bedroom\nAnd I'mma buy a summer house, with a rec room\nAnd a car with no backseat and some leg room\nAnd some strawberries and some chocolate\nAnd a fridge and some broccoli\nCause I know you like vegetables even though I don't\nI won't say I won't eat it if you chef it\nFuck it, I'll hire Geoffrey to get a beverage if you should ever get parched\nYou feel like Ruby Dee to me, great and powerful Ossie\nWho's behind the man behind the curtain? Foxy\nCoffee, brown as the bosom I flew in on\nNose round like the wheels that my rims spin on\nLips full like the light on the dash was flickin', oh wait it wasn't\nOh and I forgot I'll take a microwave or oven\nSo we could kick the butler out and we can make a muffin\nMaybe bake a dozen, my homeboy like your sister\nMaybe they can bake some cousins, ooh isn't that sweet\nYou feel like Kool-Aid in a wine glass\n\n[Hook: Chance the Rapper]\nThis is not a love song, this is a you song\nI just happen to love you\nThis is not a love song, this is a you song\nI just happen to love you\nThis is not a love song, this is a you song\nI just happen to love you\nThis is not a love song, this is a you song\nI just happen to love you\n\n[Verse 2: Lil Wayne]\nGive you the world if it was for me\nMy diamond grill make it hard to see, I'm lying through my teeth\nAnd now I'm flying on my PJ, looking at the clouds\nThinking about yo ass and how it look like a big smile\nI get mental flashbacks of your ass crack, lemme get back on track\nYou say I act like I don't miss you, that's because I don't act\nBut anyway, we can role-play or get straight to it\nSorry, my mind in the gutter, better yet, sewer\nAnd when you say I love you, I stutter, \"I-I love you too\"\nIt's Wayne's world, she say, \"What is this world coming to?\"\nAnd she know me and whoever together, she hope we comin' loose\nShe told me that if she ain't the one, she gon' throw up the deuce\nI laughed at her, we took a bath together and splashed each other\nThen she got serious and said, \"Tune I gotta ask you something\nDo you really love me?\" I tried to change the subject\nSo I said some crazy shit to her like\n\"What if you and I were just letters?\nThat'd be unfortunate we'd have to rob a fortune teller\nBut I swear I think I love you, fingers crossed in my pocket\nOkay, that's a dead subject, you bring it up, that's a zombie\nYou remind me of, my memory ain't what it used to be\"\nShe said she ain't trippin', I know, because I move my feet\nAnd when she figure out that she been swindled\nI'll be cleaning that love bird shit off of my window\nI-I love you too...\n\n[Hook: Chance the Rapper]\nThis is not a love song, this is a you song\nI just happen to love you\nThis is not a love song, this is a you song\nI just happen to love you\nThis is not a love song, this is a you song\nI just happen to love you\nThis is not a love song, this is a you song\nI just happen to love you\n\n[Outro: Lil Wayne]\nI mean how many times\nHow many times I gotta\nHow many times I gotta say it for it to count?\nAre you counting?\nI loved the pictures\nI needed that, I swear I did\nI was just thinking about you when you sent them too\nYou don't believe me? I know\nD5, what up 5?\nI-I love you too...I do", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}