{"songs": [{"title": "Miami", "album": "Queen (Bonus Version)", "year": "2018-08-10", "lyrics": "[Intro: Kodak Black]\nI ain't really finna tell y'all how to get away with murder and shit\n\n[Chorus: Nicki Minaj]\nJust the other day I was out in Miami\nGot the low-low on them Percs, low-low on them Xannies\nNigga's know my bitches petty, I ain't talkin' mani's\nPull up with a lot of baddies, don't forget the Addies\nWhen I run up in the town, I ain't chitty-chatty\nGot some real pretty titties, they come with a fatty\nToo much money, I ain't never need a sugar daddy\nI'm La Belle of the ball, you could call me Patti\n\n[Verse 1: Nicki Minaj]\nI flew in from Trinidad, peep this nigga pressin'\nI think that he popped a molly 'cause look how he sweatin'\nI'ma let my niggas rob him as soon as it set in\nNone of you bum bitches can't sit with me and Gretchen\nIt's the biggest, a bitch ain't cough one time, it's the sickest\nI don't never clique up, but they know who the clique is\nFast little bitches, but of course I'm the quickest\nMortal Kombat, ninja Nicki, who ya pick is?\n\n[Interlude: Patty Duke]\nAyo, queen, got the customers out here, man\nThey lovin' this shit, man, they lovin' this shit, man\nWhere you at, man? Where you at, man?\nWe need you here, man, I know you in Miami\n\n[Chorus: Nicki Minaj]\nJust the other day I was out in Miami\nGot the low-low on them Percs, low-low on them Xannies\nNigga's know my bitches petty, I ain't talkin' mani's\nPull up with a lot of baddies, don't forget the Addies\nWhen I run up in the town, I ain't chitty-chatty\nGot some real pretty titties, they come with a fatty\nToo much money, I ain't never need a sugar daddy\nI'm La Belle of the ball, you could call me Patti\n\n[Verse 2: Nicki Minaj]\nYo, you could take all of my bitches out to Abu Dhabi\nLet one of my besties confiscate your Maserati\nYou should throw a party on the yacht for everybody\nIf we fuck your shit up, OMG, I'm very sorry\nYou could call me Barbie, 'cause I look just like a dolly\nYes, I bury them when they come for me, call me Halle\nSince I finished her, my niggas call me the finale\nI'm a busy bitch, I'm filthy rich, no time to Polly\nAyo, swerve to the palace, this the Queen’s like it’s Hollis\nPut 15 million dollars, on it, ask LL, I'm doin' it\nDon't get cute and ruin it, all my skill, I hone it\nI pity opponents, it look easy don't it\n(It look easy don't it, it look easy don't it)\n\n[Chorus: Nicki Minaj]\nJust the other day I was out in Miami\nGot the low-low on them Percs, low-low on them Xannies\nNigga's know my bitches petty, I ain't talkin' mani's\nPull up with a lot of baddies, don't forget the Addies\nWhen I run up in the town, I ain't chitty-chatty\nGot some real pretty titties, they come with a fatty\nToo much money, I ain't never need a sugar daddy\nI'm La Belle of the ball, you could call me Patti\n\n[Outro: Patty Duke]\nYo, Nick, what's good? This ya boy Patty Duke\nMan, you already know we got shit movin' out here, man\nThat these bitches ain't fuckin' wit' you\nThey ain't fuckin' wit' the team, man, all of 'em, man\n'Cause niggas know that bag heavy, boy, that bag heavy\nNiggas get fuckin' dropped 'round here\nQueens get the money, man\nNever fakin' it, always makin' it, ya heard?\nIconic shit, man", "image": "https://images.genius.com/15a79e9b319ecd94a9131a5bc8bbd010.1000x1000x1.jpg"}], "artist": "Nicki Minaj"}