{"songs": [{"title": "Pans In the Kitchen", "album": "Gazing at the Moonlight", "year": "2009-10-27", "lyrics": "[Verse 1]\nStop and listen\nI'll rock it wicked, no competition on the shit\nYou gotta get it, there's nothing hotter than it\nA whack rapper's what Hopsin isn't, I'll kick it\nTo ya if you got a minute you'll bob ya'head like a walking pigeon\nQuit my position, I'm kinda different when rhymes is kickin'\nI got lots of this, I vibe to it as I rock a fitted\nThe amount of people that's feeling me is a high percentage\nThey know I'm tight, but I'll be conceited if I admit it\nI'ma con the game until I'm up at the top of it\nAnd don't be chicken to call me out if you got a problem with it\nUn-silenced shit is gon' get you stuck in some violent shit\nAnd feelings will be hurt so you're better off if you mind your business\nDon't get it started, with that nigga Marcus, that kid retarded\nIt's gon' evolve to some ruckus, he'll prove your shit is garbage\nHe'll be the illest artist, realist on this rap\nAll you niggas out there wanna get him on your tracks\n\n[Hook]\nMama keep the pots and pans in the kitchen\nMama keep the pots and pans in the kitchen\nI be banging on the pans in the kitchen\nSo mama don't be trying to hide the pans in the kitchen\nMama keep the pots and pans in the kitchen\nMama keep the pots and pans in the kitchen\nI be banging on the pans in the kitchen\nSo mama don't be trying to hide the pans in the kitchen\n\nI like playing with the pans in the kitchen mama\nYou gon' let me play with the pans in the kitchen mama\nDon't care what you say about the pans in the kitchen mama\nI'ma prove that I'm the man in the kitchen mama!\n\n[Verse 2]\nI used to push weight on the block\nA fat bitch, she was barely able to walk\nShe was good for one thing, that was taking a cock\nTill she told me she was pregnant, shit I'm thankful to God\nThat she wasn't, 'cause all that shit was making me hot\nI'm happy that she ain't the one to have a baby with Hop\nShe's so obese, I'd take her out and make her stay in the car\nHer body odour always smelling like some bacon and farts\nI'd tell her how I don't eat pork, she took it straight to the heart\nReady to make an assault, she need to make her fucking way to the barn\nCause that's where she belong, better leave me alone\nCalling, asking where I'm at like she need to know\nOh what a surprise, she thinking I'm the love of her life?\nBecoming my wife?\nBitch, take some fucking advice\nYou wanna look nice? Trust me I'm right\nGo to the motherfucking gym and lose the gut and you're fine\n\n[Hook]\nMama keep the pots and pans in the kitchen\nMama keep the pots and pans in the kitchen\nI be banging on the pans in the kitchen\nSo mama don't be trying to hide the pans in the kitchen\nMama keep the pots and pans in the kitchen\nMama keep the pots and pans in the kitchen\nI be banging on the pans in the kitchen\nSo mama don't be trying to hide the pans in the kitchen\n\nI like playing with the pans in the kitchen mama\nYou gon' let me play with the pans in the kitchen mama\nDon't care what you say about the pans in the kitchen mama\nI'ma prove that I'm the man in the kitchen mama!\n\n[Verse 3]\nI'm Marcus and yes I am stupid\nThought I was a smart kid? Guess again, stupid\nI'm a Special Ed student\nGive me a couple of bars and let the man prove it\n'Cause there's evidence to it\nI never knew it, but the rest of my class knew it\nThey must've thought I'd never remember the past to it\nFuck school, man, I never could pass through it\nI never be that student that headed to class who gets an A\nUp on his report card, a nice kid who's so smart\nSeem like when they threw me in Special Ed It got more hard\nEvery year the cycle repeats over again\nMy friends graduate and I'm way older then them\nThen they come to me, nice mugging me, making fun of me\nWhat do these ugly motherfuckers be thinking when they fuck with me?\nThey lucky I don't suddenly go and become something other than me\nLike a fucking psycho, then what's it gonna be?\n\n[Hook]\nMama keep the pots and pans in the kitchen\nMama keep the pots and pans in the kitchen\nI be banging on the pans in the kitchen\nSo mama don't be trying to hide the pans in the kitchen\nMama keep the pots and pans in the kitchen\nMama keep the pots and pans in the kitchen\nI be banging on the pans in the kitchen\nSo mama don't be trying to hide the pans in the kitchen\n\nI like playing with the pans in the kitchen mama\nYou gon' let me play with the pans in the kitchen mama\nDon't care what you say about the pans in the kitchen mama\nI'ma prove that I'm the man in the kitchen mama!\n(Man in the kitchen mama....)", "image": "https://images.genius.com/fb33e7a89a5050dc08095e21c220cc15.1000x1000x1.jpg"}], "artist": "Hopsin"}