{"songs": [{"title": "Gimmie One", "album": "Red Gone Wild: Thee Album", "year": "2007-03-27", "lyrics": "[Redman]\nGillahouse, take it from the top like this nigga\n\n[Verse]\nYo, Redman 'Back in Business' like EPM -\nD whips I drive, I gotta TV'em\nI tore New York down, so B.B. King'em\nFound my way back home like E.T. finger\nI rock the arena, you know the drill\nGet high, get drunk, grab a ho and chill\nEat a meal, then back to the hood for more action\nPromotin' Red Gone Wild with no backin\nDoc get five on the mic like Joe Jackson\nForeign bitches feelin me for my accent\nTalk like a boss, I can't complain\nWhen I do it, it's big like Fulton & St. James\nI got Brick City, even D.C. bitches\nThey all steal for me outta P.C. Richards\nI move like a pimp, but I'm far from one\nLike Lil Weez, I got army guns\nGimmie one, nigga\n\n(Hook)\n1, and here comes the 2 to the 3 and 4\nAnd here comes the 3 to the 2 and 1 (Gimmie one, nigga)\nAnd here comes the 2 to the 3 and 4\nAnd here comes the 3 to the 2 and 1 (Gimmie one, nigga)\nAnd here comes the 2 to the 3 and 4\nAnd here comes the 3 to the 2 and 1 (Gimmie one, nigga)\nAnd here comes the 2 to the 3 and 4\n\n[Verse 2]\nYo, If you don't like me, fuck you, I flex one muscle\nDoc got more effects than Kung Fu Hustle\nI'm uptown, buyin the purp\nLookin cut clean, jeans, Moschin', designer shirt\nRedman fell off, what ya talks about?\nI wasn't lettin y'all swim when the shark was out\nRollin red carpet out, it's Jersey\nMe and them together is like Lil' Seymour and Big Percy\nI knew women from high school that picked on me\nNow I see them, they all wanna lick on me\nI hood down homie, rock like Bon Jovi\nI can work the nightshift like Yvonne Mobley\nBrick City, boy, my flow is on fire\nDisagree, I go in your mouth like botox\nPick up Pete Rock, nigga, we all cool\nHit the highway and ask, \"Is the CL smooth?\" nigga\n\n(Hook)\n\n[Verse 3]\nYour style might be parkay, but mine butter\nThat bitch can't break no bread, then why fuck her\nI'm kinda cocky, homeboy, did I stutter?\nI popped the umbilical cord on my mother\nI jumped out the womb, I became a whale\nThat's hard to harpoon, I need more room\nThe hood love me, so I keep it real gully\nI got handsome, but my flow is still ugly\nTurn the treble out the track and I'll G it\nThe lines in my rhyme are longer than Ikea\nI stay on my grind, but when I come up with an idea\nThen yeah, it's party over here!\nIt's 5 years I disappeared, but I'm back\nAnd tell Nino Brown and them that I'm crack\nGrab my bozack, middle finger is up\nI got your grandma givin it up\nGimmie one, nigga!\n\n(Hook)", "image": "https://images.genius.com/65aa1591ac947b9397141766462ac089.465x465x1.jpg"}], "artist": "Redman"}