{"songs": [{"title": "I’m Bad", "album": "Bigger and Deffer", "year": "1987-06-13", "lyrics": "[Intro]\nCalling all cars, calling all cars...\nBe on the lookout for a tall light-skinned brother with dimples\nWearing a black Kangol, sweatsuit, gold chain, and sneakers.\nLast seen on Farmers Boulevard headed east.\nAlias L.L. Cool J. He's bad...\n\n[Verse 1]\nAaaahhhhhhhhhh\nNo rapper can rap quite like I can\nI'll take a musclebound man and put his face in the sand\nNot the last Mafioso, I'm a MC cop\nMake you say \"Go LL,\" and do the wop\nIf you think you can outrhyme me, yeah boy I bet\nCause I ain't met a motherfucker who can do that yet\nTrendsetter, I'm better, my rhymes are good\nI got a gold nameplate that says \"I wish you would\"\nAnd when rappers begin then I gotta join in and\nBefore my rhyme is over, you know I'mma win\nCool J has arrived so you better make way\nAsk anybody in the crowd, they say the kid don't play\nSlaughter competition, that's my hobby and job\nI don't wear a disguise because I don't owe the mob\nGot a pinpoint rap that makes you feel trapped\nSo many girls on my jock, I think my phone is tapped\nI'm bad\n\nCool J, Cool J, Cool J, Cool J, Cool J, Cool J\n\n[Verse 2]\nI'm like Tyson, icin', I'm a soldier at war\nI'm makin' sure you don't try to battle me no more\nGot concrete rhymes, been rappin' for ten years and\nEven when I'm bragging, I'm bein' sincere!\nEmcees can't win, I make 'em rust like tin\nThey call me 'Jaws,' my hat is like a shark's fin\nBecause I'm bad as can be, got my voice on wax\nSome brothers think he's making records, now he must have relaxed\nI couldn't, I shouldn't, and it'll stay that way\nThe best rapper you've heard is LL Cool J\nKamikaze, take a look at what I've done\nUsed to rock in my basement, now I'm number one\nAnd can happen on time, never standin' on line\nYou wanna try me? First you better learn how to rhyme\nI'm the pinnacle; that means I reign supreme\nAnd I'm notorious; I'll crush you like a jellybean!\nI'm bad\n\n\"Suspect was last spotted with three other members of his group. [?] They are extremely fast, so keep your eyes open. Use extreme caution\"\n\n[Verse 3]\nI eliminate punks, cut 'em up in chunks\nYou were souped, you heard me, and your ego shrunk\nI'm devastating I'm so good it's a shame\nCause I eat rappers like a cannibal they call me insane\nI'm as strong as a bull of course you know why I pull\nI enjoy what I'm doing plus I'm paid in full\nNot Buckaroo Banzai, but bustin' out as I\nSay the kind of rhymes that make MC's with that I'd die\nNever retire or put my mic on the shelf\nThe baddest rapper in the history of rap itself\nNot bitter or mad, just provin' I'm bad\nYou want a hit? Give me a hour plus a pen and a pad!\nMC's retreat, cause they know I can beat 'em\nAnd eat 'em in a battle and the ref won't cheat 'em\nI'm the baddest! Takin' out all rookies\nSo forget Oreos, eat Cool J cookies, I'm bad!\n\nCool J, Cool J,Cool J,Cool J, Cool J,Cool J\n\n[Verse 4]\nNever ever no never\nNever wearin' no Levis, battle me why try?\nI'll treat you like a stepchild so tell mommy \"bye bye\"\nSlaughterin' MC's and I'mma never get whipped\nWhen I retire I'll get worshipped like a old battleship\nLL I'm bad, all the rappers know\nWhen I enter the center they say, 'Yo, yo there he go!'\nMy paycheck's large Mr. Bogart in charge\nNot a puncher or hunter from a raccoon lodge\nThe original Todd, teachin' how to be hard\nTake the skin off a snake, and split a pea from a pod\nYou're a novice I'm noble and I decipher my tongue\nNot Attila the Hun, nor Abdullah his son\nMy vocals exact, like rack and pinion in a Jag\nYou try to brag, you get your rhymes from a grab-bag\nNo good scavenger, catfish vulture\nMy tongue's a chisel and this composition's sculpture, I'm bad!\n\n[Outro]\n(Think I'm gonna need backup)\n(Think I'm gonna need backup)\n\nGimme that walkie-talkie!\nYo this is LL Cool J\nAnd you'll never catch me so don't even try it\nCause I'm too bad for ya, understand?!\nAaaaaahhhh... I'm bad!", "image": "https://images.genius.com/fffc8f647a0ab312a16ec486bc2d9a7e.567x568x1.jpg"}], "artist": "LL Cool J"}