{"songs": [{"title": "Why", "album": "The Sneak Attack", "year": null, "lyrics": "[KRS-One] Class in session. What, is, democracy?\n[student] Yo it's the rule of the people.  The self rule\n[student] It's what the people want!\n[K] That's right. But is this a democracy?\n[s] Nah, democracy is a goal to be attained\n[K] That's right. The character of the people should be reflected\n[K] in the laws and the institution of the state\n[s] Psssh, I don't see my character reflected!\n[K] Tell me\n\n[Hook One: KRS-One]\nWHY, are all the schools they fallin apart\nAnd WHY, the youth not takin no musical art\nAnd WHY, the professionals really don't know where to start\nNo, one, really, cares, about\nWHY, the people ain't trustin the law and the order\nAnd WHY, the hookers from 70's look like our daughters\nAnd WHY, the radio station they help with the slaughter\nNo, one, really, cares, about\n\n[KRS-One]\nThe mind, they usin until it's time they doin a rhyme\nWill ruin what you doin if you crime pursuin\nLet me tell you bout gettin your family out the mean ghetto\nTo green meadows, where you can finally be settled\nThat street level, freak level, pullin out heat level\nEatin meat level, deceit level, that's that beast level\nYou gotta stand upright in a house with three levels\nWhere you don't even see devils unless he shovels the snow\nMany philosophers live on the low\nNever crazy hazy or lazy we get up and go\nWhaddya know, I'm always teaching after the show\nNot messin with hoes, I'm with my wife, changin my clothes\nBlowin my nose, deliverin blows to foes\nWith new flows; then disappear where nobody knows\nCause I got too many questions, too many lessons\nI gotta go, too many people stressin but I gotta know\n\n[Hook Two: KRS-One]\nWHY, these officers gunnin us down on our block\nAnd WHY, the President never steps in on these cops\nAnd WHY, the mayor don't even look like he in shock\nNo, one, really, cares, about\nWHY, the call of the poor is always ignored\nAnd WHY, the senators governors breakin the law\nAnd WHY, they taxin and taxin and taxin the poor\nNo, one, really, cares, about\n\n[KRS-One]\nYou, me, or themselves you can tell, they livin in hell\nBut they come on the TV lookin so swell\nSellin you dreams of schemes of you gettin green and cream\nBut they never explain the work and all it means\nYou got to visualize, close the lid on your eyes\nAnd visualize, minimize lies\nSee yourself bigger in size, quicker to rise up\nWise up climb up, before your time's up but\n\n[Hook One]\n\n[s] The votes\n[K] That's right\n[s] The politics\n[K] That's right\n[s] The government you know!\n[K] Uh-huh, people basically have the government they want\n[s] If people felt dissed, they'd be out rebellin right now", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}