{"songs": [{"title": "Unhappy", "album": null, "year": null, "lyrics": "[Verse 1: Mac Miller]\nYeah, um okay\nUh, I'm stepping out the flux capacitor\nGo to Africa to come back wearin’ jackal fur (woah)\nThis ain't a rap song, it's a massacre, only sacrificing those\nWho know to say the magic words\nStop, somebody get that man a pacifier, y’all ain't shit but the appetizer (no)\nI'm at a diner with a bad vagina sippin' on some red wine, when I die, told her snort my ashes, that's a dead line\nI'm doin' just fine, controlling suicidal thoughts, and when I'm\nRunnin’ out of time then imma buy the clock\n(lemme get that boy)\nLife’s meaning tends to tie the open-minded knots, if it's all a game I’m at the final boss\nYou won't stop us with a diamond cross, this type of demon\nCrucifies the fake who try to floss, and if the rain is just the crying gods, then Utopia's behind the fog\n\n[Verse 2: Delusional Thomas]\nSee, my eyes wide shut, I'm laying down in a field of roses\nWhen sanity is at a distance then we feel the closest\nSociety is all a joke\nTurn the television on and see tomorrow’s hoax\n\n[Verse 3: Mac Miller]\nYou'll fit the picture with a doctored pose, just be like everybody else and never walk alone\nI'm on the phone with the devil speaking monotone, getting bored with all these threats that he throwin' at me\nWhy are we so unhappy?\nYeah\n\n[Bridge: Delusional Thomas & Mac Miller]\nWhy are we so unhappy? (Yeah)\nWhy are we so unhappy? (Yeah)\nWhy are we so unhappy? (Yeah)\n\n\n[Verse 4: Mac Miller]\nOkay, okay\nSo can you, tell the captain that his boat about to sink and Mr. Drummond's wife is somewhere smoking meth on the ship deck\nWe living in a shipwreck, nothin' but some insects, obsessed with sex and this business giving big checks\nBeen ready to die until I realized I haven't lived yet, I haven't made an indent to the Lord to try to impress (praise God)\nI just wish that I was fearless, biking down the mountain start to tremble as the gears switch\nSo hear this hear this, come bathe in my appearance, when life give you a car learn to steer before you crash\nThere's more than cash and there's more than ass, 'cause all those pleasures turn to torture fast (fast), and you can try to fight it but you never win (no), they assemble into evidence to keep you from the truth and the lies (lies)\nWe fall into the glamour like a cancer, the answer is there ain't an answer, bitch\n\n[Outro]\nWhy are we so unhappy? Yeah\nWhy are we so unhappy? Yeah\nWhy are we so unhappy? Yeah\nWhy are we so unhappy? Yeah", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}