{"songs": [{"title": "Ignorant", "album": "Macadelic", "year": "2012-03-23", "lyrics": "[Intro: Mac Miller]\nWhoop!\nHad to throw one of those in there, uhhh\nThis that, motherfuckin' millionaire music, ya feel me?\nChyah\n\n[Chorus: Mac Miller]\nYou can't believe it, this ridiculous, belligerent (Whoop!)\nOh my bad, I'm just killin' shit, I'm killin' shit (Whoop!)\nA girl a girl, a bitch a bitch, a bitch a bitch (Whoop!)\nSmart dude, we gettin' ignorant, this ignorant (Let's go)\nYou can't believe it, this ridiculous, belligerent (Whoop!)\nOh my bad, I'm just killin' shit, I'm killin' shit (Whoop!)\nAnd a girl a girl, a bitch a bitch, a bitch a bitch\nSmart dude, we gettin' ignorant, this ignorant (Whoop!)\n\n[Verse 1: Mac Miller]\nHey, so I just bought another Rollie and that shit is Goldie Hawn\nBetter get it before it's gone cause my shop been open long\nI stay smokin' on that strong, I'm smokin' on that strong\nThen go and take a handful of drugs, what the fuck is goin' on?\nBein' rich? Well that's fun as hell\nThese bitches come like they under spells\nYo Mr. Jobs, you see I'm a Mac\nBut I'm rollin' deep like Adele\nI'm Robert Downey Jr., you more like Steve Carell\nSo get smart, no head starts, put a lion on a gazelle\nYou tryna rhyme 'cause you idolize what I design for myself\nBut it's hard to find these bars of mine so Columbine yourself\nI don't hate ya bitch, just fakin' rich\nI get paper like grades at Cambridge\nI'm best friends with my banker shit\nGave her fifty racks just to make a wish\nBrand new crib, I'm paintin' it\nHalf a mil, just paid for it\nNo Thanksgiving Parade in this\nBut we marchin' like the Saint's came in\nSo run and hide, eyes open wide 'cause this gon' be your jam\nJust burn a dutch and turn it up as I pass it off to Cam, damn\n\n[Chorus: Cam'ron & Mac Miller]\nHmm, hmm, I got that Mac with me\nHmm, hmm, I got that Mac with me\nHmm, hmm, I got that Mac with me\nHmm, hmm, I got that Mac with me\nYo, this ridiculous, belligerent (Whoop!)\nOh my bad, I'm just killin' shit, I'm killin' shit (Whoop!)\nAnd a girl a girl, a bitch a bitch, a bitch a bitch\nSmart dude, we gettin' ignorant, this ignorant\nUh, I got that Mac with me\n\n[Verse 2: Cam'ron]\nYo, we never met before but there'll be a mess for sure\nWhen I was a baby, my crib was Mom's dresser drawer (Yep)\nInfrared, blastin' guns, duckin' shots\nAnother K, another tank, another Glock\nThey smokin' weed, shippin' E, crushin' rocks\nForget the Porsche, they want your baby mother boxed\nAnd you pamper honey, word, he pamper honey\nAnd she suckin' dick for formula and Pamper money\nAnd a real thug don't play that\nLaid back where the Mac and the K at\nYayo turned to the straight crack\nMaybach black with a gat, won't say jack\nSay jack, say jack, say jack, say jack\nSay jack, say jack, I got that Mac with me\n\n[Chorus: Cam'ron & Mac Miller]\nHmm, hmm, I got that Mac with me\nHmm, hmm, I got that Mac with me\nHmm, hmm, I got that Mac with me\nHmm, hmm, I got that Mac with me\nThis ridiculous, belligerent (Whoop!)\nOh my bad, I'm just killin' shit, I'm killin' shit (Whoop!)\nAnd a girl a girl, a bitch a bitch, a bitch a bitch\nSmart dude, we gettin' ignorant, this ignorant\nUh, I got that Mac with me\n\n[Outro: Female Voice]\nWhy are we here?", "image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg"}], "artist": "Mac Miller"}