{"songs": [{"title": "My Lovin’ is Digi", "album": "Bobby Digital in Stereo", "year": "1998-11-24", "lyrics": "[Intro: RZA]\nProtect your girl from Bobby Digital\n\n[Hook: Force MD's] (x3)\nSometimes! I find!\nSomeone, fuckin with my pussy\nMy money and my ride\nTuck my nine inside my hoodie\n\nSometimes! I find!\n\n[Chorus: Ms. Roxy]\nCatch me if you can Lovin'\nRocks laced in a band\nNothin', compares where my niggas from\nRide shotgunin' , Bobby keep the love comin'\nI'm sittin pretty and my lovin is Digi\n\n[Verse 1: Bobby Digital]\nFresh dipped out my laboratory\nJust dropped down bout 40 stories\nHit the ground, you analog cats ain't got nothin for me\nRed and blue mismatched shoe, Havana Joe Wu-Wear bandana\nPlay you Vegas type hoes silly, like Dan Tanna\nBubble Hilfiger Goose, gold rope thick as hangman noose\nShe had the honey blonde hair mixed, with the chocolate mousse\nButterfly tattoo, Boo, let me holla at you\nAnd I'll change that tattoo to a Wu-Tang tattoo\nNew York City ditty bop type slang, girl let's smoke a blantz\nHit the Jack Danz, and after that we could dance\nWith the Black Widow, gold Benz with the chrome griddle\nFat juicy lips, ebony let me taste your spittle\n\nChorus (except last line)\n\n[Bobby Digital]\nHair wrapped like Angela Bassett for Malcolm X\nIce cold golden texts, cassette of Inspectah Deck\nUncontrolled substance, earring inside her belly button\nAnd one inside her Power-U she said she use for nuttin\nSCREAM ON IT, Bobby the black Green Hornet\nGirl DREAM ON IT, I put the Killa Bee sting on it\nRejuvenated, honey kept her throat lubricated\nLet off so much Chi, ginseng couldn't recuperate it\nBack scratchin, eyes squintin, Dusk to Dawn\nQuentin Tarantino type porn, like Lewinsky-Bill Clinton\nSuck it down with no commercial\nGood Power Universal Self Savior Why\nB.O.B.B.Y.!\n\nChorus\n\n[Bobby Digital]\nGirl SCREAM ON IT, Bobby the black Green Hornet\nC'mon DREAM ON IT, the Killa Bee sting on it\nScrew the top off the boilin pot, girl you must be boilin hot\nSit on my unfalling cock, let me strike your G spot\n\nChorus\n\n[Bobby Digital]\nYo, kept a nigga well-fed, put seven braids in my head\nPillow soft as cobweb, Egyptian cotton bedspread\nLyin deep between the legs, I mix the sperm with the eggs\nBust off about a keg, she called it creamy nutmeg\n\nChorus\n\n[Bobby Digital]\nThrow on my high beams\nHer breasts was like two scoops of ice cream\nI scream, you scream, we all want, ice cream\nBone until she fall asleep, she can have a nice dream\nI scream, you scream, we all want the ice cream\n\nChorus + \"and my lovin is Digi..\nAnd my lovin is Digi..\nAnd my lovin, and my lovin\nAnd my lovin is Digi\"\n\nDown-town!", "image": "https://images.genius.com/10f833f6fa5be4455d32a441346e0086.431x431x1.jpg"}], "artist": "RZA"}