{"songs": [{"title": "In Da Club (Remix)", "album": "Renzel Remixes", "year": "2015-11-26", "lyrics": "[Pre-Hook]\nClassic Hip-Hop  shit\nDr. D-R-E\nRozay let's get em!\n\n[Hook: Rick Ross]\nOnly on the Black Market, December 4th\nThe Album is out\nOnly on the Black Market, December 4th\nThe Album is out\nOnly on the Black Market, December 4th\nThe Album is out\nA hustler's dream is a hater's worst nightmare, ya heard?\n\n[Pre-Hook]\nClassic Hip-Hop  shit\nDr. D-R-E\nRozay let's get em!\n\n[Bridge: Rick Ross]\nCaught 'em flippin', put the footage up on Youtube\nI bought a Bentley, went and got that bitch new\nCaught 'em flippin', put the footage up on Youtube\nI bought a Bentley, went and got that bitch some new shoes\nCaught 'em flippin', put the footage up on Youtube\nI bought a Bentley, went and got that bitch some new shoes\nJimmy Ivine crib, when I'm in LA\nRick Rubin, line two, I do the deal with Dr. Dre\n\n[Hook: Rick Ross]\nOnly on the Black Market, December 4th\nThe Album is out\nOnly on the Black Market, December 4th\nThe Album is out\nOnly on the Black Market, December 4th\nThe Album is out\nA hustler's dream is a hater's worst nightmare, ya heard?\n\n[Verse: Rick Ross]\nCaught 'em flippin', put the footage up on Youtube\nI bought a Bentley, went and got that bitch some new shoes\nJimmy Ivine crib, when I'm in LA\nRick Rubin, line two, I do the deal with Dr. Dre\nBullet riddled car that very second, nigga life froze\nBend a corner, hop out on a whip with my ice on\nUntil we leave the club, can't even cut the lights on\nAnd Reebok a quarter with a pair of mics on\nIn the streets, so hard to see I need some M3\nRun up on 'em like a G, wet up your M3\nDo a show at House of Blues just to throw the goons\nRe-up on the ammunition, track next to the Catholic school\nIt's a perfect place and time for them Audemars\nBut if you study over time, this is the art of war\nMaybach zepplin, stretch just like a limousine\nGotta rub it on her titties, then she feelin' me\nYeah, she feelin' me, them percocets be feelin' me\nGo and purchase your momma house or face a penalty\nHeadshots, the bitches screamin' it's hell hot\nCaught a case then I bought it out (?) out\nFree my niggas and the legends still in the jail house\n50 million now they monitor all my whereabouts\nKilo flip in exchange for a casino trip\nMoney launder, we double back and do it once again\nHeavenly Father, please forgive me for all my wrongs\nNiggas murdered over lyrics they're hearin' in my songs\nPop bottles, steve bottles, I'm talkin' bigger cream\nJamaica, Queens, signin' autographs for the fiends\n\n[Outro: 50 Cent]\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into taking drugs\nI'm into having sex, I ain't into making love\nSo come give me a hug if you're into getting rubbed\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into taking drugs\nI'm into having sex, I ain't into making love\nSo come give me a hug if you're into getting rubbed\nDon't try to act like you don't know where we be neither\nWe in the club all the time, so pop, pop of", "image": "https://images.genius.com/26f2cdfc9fdcb22135f837c8ea35c566.1000x1000x1.jpg"}], "artist": "Rick Ross"}