{"songs": [{"title": "Guess Who’s Back", "album": "Strictly 4 My N.I.G.G.A.Z...", "year": "1993-02-16", "lyrics": "[Intro]\nGuess who's back?\n\n[Verse 1]\nDrop the drums, here it comes, only got\nTwo minutes to bounce, and every second counts\nBetter press REC on your deck\nHere we go, set? Pass the Moët\nMy trickery's more slippery when wet\nWicked as I flip, don't trip, get a grip\nIt'll kick, if the bass line's thick, it's a hit\nEverybody's got a mic now, it's like a hobby\nBut more like a job, cause bootleggers tryin' to rob me!\nAnd little man wants to be a rap, star\nMake papes, hit skins, drive a fat car\nIt ain't easy, sleazy even\nDeceivin those we believe in\nNo benefits, just tricks and chicks\nKnock a pig to pick, so here's a stick to lick\nI shoot a gift, til there ain't none left\nAnd if I find that the track sound def\nI catch wreck till I lose my breath\nThat's how it goes in the land of broke\nI dispose of those, rock shows, and collect my dough\nNow I suppose I'm the bad guy, why?\nI say, \"Hi,\" and try to stay high\nLife's a mess don't stress, test\nOf givin but be thankful that you're livin, blessed\nGuess who's back, comin back with the track supplied\nBy Special Ed and Ak, comin right and exact\nI'm fightin it back but now I snap, where they at?\nWhen it's time to go to combat, guess who's back\n\n[Hook]\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\n[Verse 2]\nDrop the drums, here it comes, only got\nOne minute to bounce, and every second counts\nI went from hustlin dicks to makin hits, bustin flicks\nNow I'm sure to be rich for ninety-six\nI pull my 'capes on tapes, and make, papes\nTrace the bass, to the tape with the baddest bass to date\nI try to shake it but the pace is hard to break\nGood thoughts I wait, cause they hate my black tape\nYeah, it's on, and it's packed in the rap race\nBut if ya got a black face, it's a rat race\nI struggle to be rugged and raw, Dukes\nTryin to survive in the trials and lawsuits\nEverybody wants to test me, WHY ME?\nNo lie, niggas cried when they try me\nGivin up the roughness, justice\nI'mma bust as I'm rippin up 'nuff hits\nAnd guess who's back? No longer trapped\nCause I snapped on the ones that held me back, feel the contact\nRide the track, get a grip as I flip\nGhetto wickedness I kick. Guess who's back?\n\n[Hook]\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\"Yes I'm back\"\n\"2Pac is\" .. back!!\n\n[Outro]\n\"Yes I'm back, cause I never did front\"", "image": "https://images.genius.com/fb1da91ac989d8c57dfce412441800da.953x953x1.jpg"}], "artist": "2Pac"}