{"songs": [{"title": "Pussy Monster", "album": "Tha Carter III", "year": "2008-06-10", "lyrics": "[Intro]\nDavid Banner on the beat, bitch\nI got a, I got a, I got a, I got a sweet tooth\nI got a sweet tooth, I got a sweet tooth, I got a sweet tooth\nNow can I eat goo, now can I eat you? Mmm\n\n[Verse 1]\nI gotta taste for you, now what you wanna do?\nGirl, you cold, let me suck out your flu\nGirl, you cold, girl, you cool\nYou heard of Salt N' Pepa? Well girl, you food\nGirl, you hot like a bowl of hot stew\nAnd I just stood over ma stew and just blew\nAnd when there's no more of you, in the soup\nI remove ma spoon and drink your juice\nIf you want to do me, do what cha wanna do\nIf my job is to blow, you can bet she blue\nMic check 1, 2, how about 1, 2\nP-L-A-Y because I don't have a clue\nBut when I find out, I'm a show and tell you\nWhen I lift my top lip, I could still smell you\nWhen I swallow ma spit, I could still taste you\nPut that pussy in ma face every time I face you\nIt goes P-U-S-S-Y\nBecause it's the reason I am alive\nMomma, I need it to stay alive\nIt's like I gotta eat it just to survive\n\n[Chorus]\nHi, I'm the\nPussy monster, the pussy monster\nThe pussy monster, the pussy monster\nAnd you gotta feed me\nPussy, pussy pussy, pussy pussy\nPussy, pussy pussy, pussy pussy\nI gotta, I gotta, I gotta, I gotta\nI got a sweet tooth, I got a sweet tooth\nI got a sweet tooth, I got a sweet tooth\nNow can I eat you? Can I eat you?\n\n[Verse 2]\nNow let me get back to her\nShe call me Dracula, and I'll vacuum her\nCatfish, dat fish, dat cat, tuna\nI'll smack it up flip it like a spatula\nLil' Chris said 'Run It' and I tackled ya\nBaby, can I be the worm in ya apple butt?\nNow go back in her, and if you backin' up\nI'll suck the front of dat pussy from da back of ya\nI'm an urban legend like a black Acura\nMy taste buds set on a black actress\n(Actress) I told her act-shun\n(Action) Da camaras is lookin'\nAnd I hope she make me eat ma word cause my words is\nPussy, pussy, pussy, pussy, pussy, pussy, pussy\n\n[Chorus]\nHi, I'm the\nPussy monster, the pussy monster\nThe pussy monster, the pussy monster\nAnd you gotta feed me\nPussy, pussy pussy, pussy pussy\nPussy, pussy pussy, pussy pussy\nI gotta, I gotta, I gotta, I gotta\nI got a sweet tooth, I got a sweet tooth\nI got a sweet tooth, I got a sweet tooth\nNow can I eat you? Can I eat you?\n\n[Verse 3]\nI got pussy comin' to me, pussy comin' to me, pussy\nShow me dat pussy and I'm a show you where to put it\nYou know I make it rain, I'm the hurricane, son\nAnd you know I could make it rain, wat ma hurricane tang\nLike lala, la, lala, la, lala, la, lala, la, lala, lala, lalala, la\nImagine if I did dat with your pearl on ma tongue, ha\nI make dat pussy talk to me, I could make it jump\nOva her and walk to me\nNow walk it out, girl, now walk it out, girl\nP-U-S-S-Y\nBecause it's da reason I am alive\nAnd I'm a need it to stay alive\nIt's like I gotta eat it just to survive, ha\n\n[Chorus]\nHi, I'm the\nPussy monster, the pussy monster\nThe pussy monster, the pussy monster\nAnd you gotta feed me\nPussy, pussy pussy, pussy pussy\nPussy, pussy pussy, pussy pussy\nI gotta, I gotta, I gotta, I gotta\nI got a sweet tooth, I got a sweet tooth\nI got a sweet tooth, I got a sweet tooth\nNow can I eat you? Can I eat you?", "image": "https://images.genius.com/70a7ef69242915a9cd1c3f68031e4c0a.1000x1000x1.jpg"}], "artist": "Lil Wayne"}