{"songs": [{"title": "Good Nigger Sticker (Freestyle)", "album": "NAGA", "year": "2018-07-05", "lyrics": "[Intro/ Sample]\nOh Bobby\nOh Bobby\nOh God, oh Bobby\n\n[Verse]\nThese are the chronicles of a black magician, left the rap business\nMade some plaques with an unthreatening black image\nBut that's finished, you niggas still ass kissing, catfishing\nBefore I was rap fishing, I had visions of mostly millions and packed buildings\nEverybody's depressed, no happiness\nIt's sad when you find out the world is trash, inn'it?\n(Wa-wait till they discover it's flat)\nIf I ever made me a movie and casted it\nYou wouldn't have to be a dysfunctional black family\nOr single and sad, or sell crack to act in it\nThe crooked enslave you, you sending prayers\nLike Sky Daddy blessing black people with good behaviour like\n\"You're a good nigga (yeah), you're a good nigga (yeah), here's a gold sticker\"\nAnd I swear it's folks going through my house\nWhen they know I ain't home\nIt be your own people, you don't know what I'm on\nChopped it up with Shawty Slim like nigga pick up the phone\nStayed up till 5am just to finish this song\nYou ain't gotta say \"Let's get it\", bitch I got it\nI ain't gotta dumb it down, they just gotta catch up\nI don't need boy scout, bad bitch, I ain't a tiger cub\nFuck you and your entire club, fuck you, bitch, I'm fired up\nI'm the whole entire plug, the way I drive fuck my tires up\nGame over, nigga, time's up, me and my bitch, fuck your bitch, ayy\nYou ain't know she was with the shit, ayy\nYeah, we some thots, no kids, ayy\nWhoa, I'm high as fuck, just a sip, ayy\nBobby Ray Bandz, I'm the shit, ayy\nFake niggas keep jumping ship, how good does good get?\nThere's more to life than being hood rich, you ain't on what I'm on\nYou ain't on what I'm on, you ain't on what I'm on\nChopped it up with Shawty Slim, nigga pick up the phone\nChopped it up with big rich, nigga pick up the phone\nChopped it up with TJ, nigga pick up the phone\nChopped it up with B-Side, lived the real street life\nChopped it up with Playboy Tre, pick up the phone\nChopped it up with London, chopped it up with Havi\nChopped it up with Jacques, chopped it with the money\nChopped it up with T.I.P, chopped it up with Rocky\nChopped it up with Tech N9ne, nigga, who gon' stop me?\nNiggas know I'm mobbin', niggas know I'm not playin'\nWhat's her name, what's her name? Could it be Roxxanne?\nNiggas know I'm the bomb, woah, kemosabe\nRacist white people look at me like Bin Laden\nHow many crisis actors out hear rapping today?\nHow many dick appointments can she make in a day?\nYoung guys think they're cold as can be\nBut even triple OGs get old in the knees\nAlways knew niggas was gon' wake up\nAin't shit to worry 'bout if you ain't trying to opress us\nThe whole hotep club, the whole no flex club\nBut if you had the money, buy a Rolex club (hotep hooray)\nGotta be broke,  to be woke, no check club (ho hey)\nNo sex, no neck  (ho, hotep hooray)\nNo neck, no sex, no sex  (ho hey ho)\nHow much clout? How much clout? How much?\nHow much clout make that ass come out?\nHow much clout make them titties come out?\nHow much clout? How much clout?\nHow much clout make you fakers take a bow? Game over", "image": "https://images.genius.com/a0370f3b55eb19a51f991675764cc669.1000x1000x1.jpg"}], "artist": "B.o.B"}