{"songs": [{"title": "Dead", "album": "Purp & Patron", "year": "2011-01-24", "lyrics": "[Verse 1]\nThis for my nigga C-Murder, locked away\nThis for the nigga conscious that took Pac away\nThis for the niggas scheming on me but not today\nThis for the niggas thinking' I was all Dr. Dre\nThis for the magazine writers with a lot say\nCome to my hood it ain't no good we cock and spray\nKeep it gully like we out at fall Rockaway\nTreat gangsta rap like it's a hood spot for yay\nCome through the hood with a model chick that I got from 'Ye\nAnd rose Phantom limitage just a block away\nSo let the beat knock while you bob your head\nI switch cars jump in the C.L., smoother than Pete Rock\nAir Max 95, flow classic like Reebok\nRemember O1, try lay me down like shirak\nR.I.P to all them niggas and all my niggas\n\n[Hook x2]\nDon't Don't End Up dead\nNigga Don't Don't up Dead\n\n[Verse 2]\nOne thing about me\nAlways keep it real with myself\nLike Nas, I'm Ill Will with myself\nAnd I can feel the pain of Ms. Wallace\nI wish Chris was here, so he could see C.J. blow\nLike the paint on this Impala\nTell Afeni to holla if she need another son that rap\nPac's revenge and I got a gun that clap, like Dr. Dre snares\nBlow chronic like Dr. Dre cares\nI been there, done that\nDr. Dre shares all his bitches and his liquor\nHe ain't call me for Detox, but that's my nigga\nRemember who brought 'em back to Compton\nThe 23 year old me was a fuckin' monsters\nStill niggas say I ain't hood what fuck they talk' about\nLike I won't kiss my sons on the heads and chuck em out\nWhat up 50? let's talk it out\nBut until we talk it out\n\n[Hook x2]\n\n[Verse 3]\nI remember when my older brother wanted to be Rakim\nNow I'm livin' his dream, cause somebody shot him\nAnd left me like Eric B. without Rakim\nStill payed them for like B.B.S. stock rims\nNow I got California locked in\nDip in this Beamer, same model, different year they shot Pac in\nSo whats the \"Top 10\" if you dead\nWho drop this Lamborghini if I'm in the feds\nTo times feeling spelling my nights up in the bed\nBut I'm from Compton so when I'm out its Infrared\nGet my son ready for school and I kiss his head\nSo when you see my face in the mirror\nIf I end up dead bed\nNever wore bullet proof vest and no got bullet proof Car\nYou know me Westside triple O.G\nAnd I'mma tell you like the homie Snoop Dogg told me\n\n[Hook x2]", "image": "https://images.genius.com/2ac5b9e1da222cb025aa059f64716e53.500x500x1.jpg"}], "artist": "The Game"}