{"songs": [{"title": "Role Model", "album": "The Slim Shady LP", "year": "1999-02-23", "lyrics": "[Intro]\nOkay, I'm going to attempt to drown myself\nYou can try this at home\nYou can be just like me\nMic check, one-two, we recordin'?\n\n[Verse 1]\nI'm cancerous, so when I diss, you wouldn't wanna answer this\nIf you responded back with a battle rap you wrote for Canibus\nI'll strangle you to death, then I'll choke you again\nAnd break your fuckin' legs 'til your bones poke through your skin\nYou beef with me, I'ma even the score equally\nTake you on Jerry Springer and beat your ass legally\nI get too blunted off of funny home grown\n'Cause when I smoke out, I hit the trees harder than Sonny Bono\n(Oh no) So if I said I never did drugs\nThat would mean I lie and get fucked more than the President does\nHilary Clinton tried to slap me and call me a pervert\nI ripped her fuckin' tonsils out and fed her sherbet (Bitch)\nMy nerves hurt, and lately I'm on edge\nGrabbed Vanilla Ice and ripped out (C'mere) his blond dreads (Fuck you)\nEvery girl I ever went out with has gone les'\nFollow me and do exactly what the song says\nSmoke weed, take pills, drop out of school, kill people\nAnd drink, jump behind the wheel like it was still legal\nI'm dumb enough to walk in a store and steal\nSo I'm dumb enough to ask for a date with Lauryn Hill\nSome people only see that I'm white, ignorin' skill\n'Cause I stand out like a green hat with a orange bill\nBut I don't get pissed, y'all don't even see through the mist\nHow the fuck can I be white? I don't even exist\nI get a clean shave, bathe, go to a rave\nDie from an overdose and dig myself up out of my grave\nMy middle finger won't go down, how do I wave?\nAnd this is how I'm supposed to teach kids how to behave?\n\n[Chorus]\nNow, follow me and do exactly what you see\nDon't you wanna grow up to be just like me?\nI slap women and eat shrooms, then OD\nNow, don't you want to grow up to be just like me?\n\n[Verse 2]\nMe and Marcus Allen went over to see Nicole\nWhen we heard a knock at the door, must've been Ron Gold\nJumped behind the door, put the orgy on hold\nKilled them both, then smeared blood on the white Bronco\n(We did it) My mind won't work if my spine don't jerk\nI slapped Garth Brooks out of his rhinestone shirt\nI'm not a player, just a ill rhyme sayer\nThat'll spray a aerosol can up at the ozone layer\nMy rap style's warped, I'm runnin' out the morgue\nWith your dead grandmother's corpse to throw it on your porch\nJumped in a Chickenhawk cartoon with a cape on\nAnd beat up Foghorn Leghorn with an acorn\nI'm 'bout as normal as Norman Bates with deformative traits\nA premature birth that was four minutes late\nMother, are you there? I love you\nI never meant to hit you over the head with that shovel (That shovel)\nWill someone please explain to my brain\nThat I just severed the main vein with a chainsaw and I'm in pain?\nI take a breather and sigh, either I'm high or I'm nuts\n'Cause if you ain't tiltin' this room, neither am I\nSo when you see your mom with a thermometer shoved in her ass\nThen it probably is obvious I got it on with her\n'Cause when I drop this solo shit, it's over with\nI bought Cage's tape, opened it, and dubbed over it\n\n[Chorus]\nI came to the club drunk with a fake ID\nDon't you wanna grow up to be just like me?\nI've been with ten women who got HIV\nNow, don't you wanna grow up to be just like me?\nI got genital warts and it burns when I pee\nDon't you wanna grow up to be just like me?\nI tie a rope around my penis and jump from a tree\nYou probably wanna grow up to be just like me", "image": "https://images.genius.com/a34246ca1042010b6859b6f40efff3f6.1000x1000x1.png"}], "artist": "Eminem"}