{"songs": [{"title": "Fuck All Y’all", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "[Sample]\n\"I thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\"\n\n[Ad-lib]\nHa ha ha… hey man fuck all y'all… fuck all y'all\nI don't need nobody\nFuck 'em… fuck all y'all (fuck all y'all)\n\n[Verse 1]\nMoney gone fuck friends, I need a homie that know me\nWhen all these motherfuckin' cops be on me\nI got problems, ain't nobody callin' back\nNow what the fuck is happenin' with my ballin' cats?\nRemember me? I'm your homie that was down to brawl\nSippin' Hennessy, hangin' with the clowns, and all\nWe used to do is drink brew, screw and common knew\nWe had bitches by the dozens, we fuckin' cousins\nYou can throw your middle finger if you feel me, loc\nA nigga just got paid and we still was broke\nIt took time, but finally the cash was mine\nAll the rewards of a hustler stuck in the grind\nLook around, and all I see is snakes and fakes\nIt's like scavengers, waitin' to take a hustler's place\nAnd when you stuck, where the fuck is all your friends?\nThey straight busted and can't be trusted; fuck y'all!\n\n[Sample]\n\"I thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\"\n\n[Collision]\nFuck all y'all\nFuck all y'all\n\n[Verse 2]\nI'm sippin' Tanqueray and juice and what's the use\n‘Cause I'm a hopeless thug\nAin't no love reminiscin' on how close we was\nWay back in the day, before they put the crack in the way\nAnd heeyyy, how much money can you stack in a day?\nIt's gettin' rough, collect calls from my niggas in cuffs\nI recollect we used to ball, now just living's enough\nI stand tall in the winter, summer, spring or fall\n\"Thug For Life\" sprawled all across the wall\nAnd all about my dollars make me wanna holla\nDrop an album, sell a million, give a fuck about tomorrow\nI know it's gettin' crazy after dark, these marks\nKeep on huffin' and puffin', ain't no fear in my heart\nWhat's goin' on in the ghetto? Still struggle and strive\nI still roll with the heater, smokin' chocolate thai\nIn '94, I'll be goin' solo\nToo many problems of my own so I'm rollin' dolo; fuck all y'all!\n\n[2Pac]\nHuh, pardon me!\n\n[Sample]\n\"I thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got..\"\n\n[Collision]\nFuck all y'all\nFuck all y'all ...fuck all y'all\n\n[Verse 3]\nI went from rags to riches\nQuick to socializin' with the baddest bitches\nWent from a bucket to a rag with switches\nI'm seein' death around the corner\nI'm bumpin' \"Gloriaaaa,\" doin' 90 ‘cause I wanna\nI'm gettin' high, and like I said, it was some chocolate thai\nMixed with some Indonesia, watch me fly\nAnd even though I know the cops behind me\nHit the weed and I continue doin' 90\nUntil I get caught, another ticket get to kick it in court\nFuck the law, give a shit, I'm even worse than before\nI know they wanna see a nigga buried\nBut I ain't worried, still throwin' these thangs\nGot me locked in these chains\nAnd hey, nigga, what the fuck is you wailin' 'bout?\nSoon as I hit the cell, I'll be bailin' out\nAnd when I hit the streets, I'm in a rush to ball\nI'm screamin' \"Thug Life!\", nigga, fuck y'all!\n\n[Sample]\n\"I thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\nI thought I had friends, but I ain't got no fuckin' friends\"\n\n[Ad-lib]\nThat’s right fuck all y'all man\nFuck all y’all\nThat is right, I don’t need nobody\nFuck all y’all\nFuck all the hard copies daily news\nFuck the bitches, the tele news, New York Posts, all those motherfuckers\nFuck all y’all\nFuck 'em", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}