{"songs": [{"title": "Children’s Story", "album": "Purp & Patron", "year": "2011-01-24", "lyrics": "[Intro:]\nUncle Chucky, Will you read us a bedtime story please huh please?\n\nAlright... You kids get to bed I'll get the story book...\n\nHere we go...\n\n[Game]\nSlam the impala door hopped out what do you see\nSome niggas hangin' on the fence lookin' at me\nI had phat red laces in my Adidas\nBig chain around my neck like mardi grass\nSo I stepped up to them is there a problem here?\nOne nigga lifts his shirt then he yells out \"yeah\"\nSo I turned around quickly and jumped in my car\nI was about to hit the switch then I thought like \"nahh\"\nSo I reached under my seat, and I grabbed my shit\nIt was a chrome four five with the kung fu grip\nStuffed it inside my dickies as I jumped out the car\nKept my hand on the trigger as I walked to the store\nOne nigga walks in, then here comes two\n\"what did you do?\"\nI shot!\nAre you crazy fool?\nOne nigga hit the ground then the other two scrammed\nNow the cops are outside\nWell i'll be damned\nIt was 7:15 on my rolex watch\nAnd I can't do the time that my rolex got\nAnd like the hands on the clock, I went this way, thatta way\nRan around the corner, and that's when I threw my gat away\nAnd impala passes, its my homeboy clyde\nHe gave me the hand signal, so I jumped in his ride\nIt was a clean six fo, original inside\nWith no key in the ignition\nWhere'd you get this clyde?\nNevermind, I'm out, its a stolen whip\nAnd I'm already runnin' from the cops and shit\nSo I hopped out the car like the Dukes of Hazzard\nThen clyde yells out \"you stupid bastard\"\nStart runnin though traffic and I almost get hit\nI lost one of my shoes, its my airforce, shit\nI'm haulin down the street with one shoe on\nWalked straight into some niggas with all blue on\nI only ran 30 blocks, how I end up in long beach\nCause in california the gangs in arms reach\nHe seen my red strings so he punched and caught me\nSo I knocked his ass out and took his boy out his barklys\nI ain't seen these since 92'\nI'm feelin like a bad boy without the shiny suit\nHere the cops come, shit, so I dash behind a honda\nAnd look who's here my baby momma's friend Rhonda\nIn the car kissin on this dope dealer, Chris\nLittle did he know he was suckin my dick\nI start bangin' on the window, I don't mean to disturb\nBut Chris can you drop me off downtown, on third\nHe said why sure, waddup game hop in\nHe was bangin slick rick then I got an idea\nBefore we get to third drop me off right here\nSo I can walk inside the mall and cop some new gear\nAs I walked in the store they could see I was in a rush\nSo they bought me some jeans, a t-shirt and fresh chucks\nWalked out the store, looked left, oh no\nRan back in the store, here comes the 5-0\nSo I ran real quick, made a move to the back\nAnd knocked a cute bitch into a polo rack\nSaid sorry, jumped over her and fled to the back door\nThen I kicked the shit open, you won't believe who I saw\nIts the nigga chris in handcuffs, pointin at me\nAnd the cops made him chase me before they let Chris free\nOne cop tried to grab me, and the other one missed\nI got away with more time, and they both got pissed\nRan straight out the mall, spotted this blue coupe\n'dogg pound' on the plates, that's gotta be Snoop\nSo I ran up the car and said yo snoop\nThe cops got me on the run need a ride nephew\nHell yeah bigg snoop, little homie hop in\nHe dropped me off in compton, that's when my story ends\nNow this ain't funny so don't you dare laugh\nJust another story about the wrong path\nI had a big day, so I reclined my seat\nIt was a 20 minute ride to the C.P.T\nWalked straight up to the house, pulled out my key\nOpened my door it's my girl playin...", "image": "https://images.genius.com/2ac5b9e1da222cb025aa059f64716e53.500x500x1.jpg"}], "artist": "The Game"}