{"songs": [{"title": "Put That Work In", "album": "Forever King", "year": "2009-07-03", "lyrics": "[Intro]\nYo I'm tired, son\nWe gon' do this last one, then I'm out\n\n[Chorus]\nIt's a natural progression, first you cut a nigga\nThen you gun-butt a nigga, then you pull the trigger\nPut that work in, put that work in\nMake it hot, it die down, do the shit again\n\n[Verse 1]\nYou know my aunt killed my dog and never said sorry\nNiggas broke in my crib and they stole my Atari\nMan, niggas could've asked, I would've let 'em hold a cartridge\nI wasn't fucking with nobody, see how niggas start shit\nInstead selling crack I could've been Tiger Woods\nBut they ain't got no fucking golf courses in the hood\nI said I'm selling dope, I don't regret shit\nI'm selling dope, nigga, that good shit\nI was supposed to be an A student, a valedictorian\nInstead I'm in special ED trying to fuck, I'm horny\nThey didn't like my style, they said they didn't like my style\nThem same bitches want me now\nIn came the cash, out with the cocaine\nVirgin Mary medallion hanging off my rope chain\nFour finger ring, nigga doing his thing\nYou get a couple bitches after you get the bling\n\n[Chorus]\nIt's a natural progression, first you cut a nigga\nThen you gun-butt a nigga, then you pull the trigger\nPut that work in, put that work in\nMake it hot, it die down, do the shit again\n\n[The Carpenters sample]\n\"Can't read notes but I plaaaaay anything by ear\nI made up tunes on the sounds that I used to hear.\"\n\n[Outro]\nWhat the fuck?\nWhat the, who the fuck\nWho would put this on the beat, man?\nThat's it, man\nThis shit is stupid, man\nI'm glad this is the last one because\nFuck that man, I'm out man\nWhat time is it?\nIt's like fucking 4 o'clock in the morning, son\nTuu, for a mixtape, I'm going home, man\nMan fuck that, I'm out\nThis is, they can, this is good enough\n\n[Vincent Price sample]\nAHAHAHAHAHAHAHAHA\nAHAHAHAHAHAHAHAHA! {*gunshot*}", "image": "https://images.genius.com/c43e4058469760b042583905a14fbf35.300x300x1.jpg"}], "artist": "50 Cent"}