{"songs": [{"title": "Reebok Presents: I Am", "album": null, "year": "2014-12-09", "lyrics": "Kendrick Lamar:\nWhat inspired me as a kid really was, uh, illustrating my thoughts on that sheet of paper\n\nLife's to me like a box of chocolates\n(?) something for something, that's the obvious\nFlow's so sick, don't you swallow it\nBiting my style, you (?)\nCome from the same blocks where they pick cotton\nOh, you forgotten, ah, forget it\nThat life ain't sane\n\nYou see gangbanging, drug paraphernalia. You see things from the streets. So what you gon' do? You gon' find something that you love to do and have a passion for it, or you gon' stay, you  know, mingling in the streets until something major happens\n\nSo the moment I defined myself and freed myself was the time I locked myself in the studio and said, \"You need to do music.\"\n\nTonight's for everybody, understand me\nThe plan B is the one in your hearts\nThis here is family, Kendrick Lamar\nWords like a sword in the hands of a Spartan\nMarching on Rosecrans in Compton\nYou can't cause conflict or corrupt my spirit\nI'm on point like period\nI've been there and gone before you get near it\nOoh wee, that boy remind me of a young Martin Luther\nThe way he piece up troopers, then round up shooters\nLike Malcolm X did, I stand for what I believe in\nThat's family, God and honor\nFrom Chicago, my daddy and my momma\nCame into Compton to accomplish one thing: reign supreme\nRaise a king named Kendrick\nI ain't lying, it stand for \"King\" and I am one\nMy unborn son and grandson will live royal\nFrom the coochee to the soil\nThe meek shall inherit the Earth\nWell, I've had this world since birth\nFeel the good kid's hunger\nThe Crips made strong, the Pirus made stronger\nBut it's muscle in my heart\nI stare in the eyes of Mozart and tell him I'm the genius\nI love myself, really love myself\nAnd I means this with all sole\nAnd you can't control greatness 'less you hating\nWith the heart of Satan\nBut even that can't stop it\nI tell 'em, \"Get out my wallet and passion in your logic\"\nPassion in your life, the passion of my Christ is in me\nAnd if you say it ain't, you may offend me\nDamn, that boy good\nI'm bright as Thomas Edison but I'm Gucci Mane in the hood\nI stood alone for so long, prolonged my whole career\nBut now I'm here, you can shoot shots and cheer\nBecause I am, we are Kendrick Lamar\n\nGetting into that success level where you can go back to your neighborhood and people feel like, you know, uh, they look up to you. Sometimes the most riskiest things you can do can end up being, you know, the most important. Yeah\n\nTeriq Tyson:\nMy dream's more vivid than Dr. T's, (?) evolutionary\nReporting live, Centennial High, 2014\n\nKendrick Lamar:\nI am Kendrick. I am Kendrick. I am Kendrick. I am Kendrick", "image": "https://images.rapgenius.com/043b49ad2ce2b5bd9e94ec1b40b423ee.1000x639x1.jpg"}], "artist": "Kendrick Lamar"}