{"songs": [{"title": "The Man Who Has Everything", "album": null, "year": "2018-11-30", "lyrics": "[Verse 1]\nWhat to get the man who has everything?\nTryna fit myself into a schedule and a wedding ring\nTryna eat everything\nI was raised, it come across my plate then I better swing\nTryna turn confederate flags into confetti strings\nI'm tryna back up my baby mama like Kevin Federline\nHeard they got some nice-ass houses out there in Beverly\nNever leave where I came from\nI just need me some stockings and the chimney they could hang from\nPhotos so my kids can find out where they got their names from\nChristmas cards so gorgeous other families wanna frame one\nReal talk, I need a front yard, a backyard\nA side yard, a side yard, inside bar, a dry bar\nNine cars and a garage, and it's on hella acres\nI'm tired of people visitin', takin' the elevator\nWell, we'll keep the elevator\n\n[Chorus]\nLove me forever, that's all I ask of you\nLove me forever, that's all I ask of you\n\n[Verse 2]\nDon't gifts get re-wrapped?\nThat shit could get sticky like tree sap\nI gave you free raps, that shit sound like free facts\nWhich is 'bout as common as free Blacks\nStuck like freeze tag from one of these random police stops\nLook like the treetops soon as the breeze stops\nAnd once the debris drops, the streets 400 degrees hot\nPlease, man, we needin' some freeze pops\nWhat in the world for the man who has everything?\nMan, West Chatham Park could use some better swings\nUsed to be disheveled, I went and shoveled everything\nTell Santa to show up to doors he never ring\nHe never ring\n\n[Chorus]\nLove me forever, that's all I ask of you\nThat's all I ask\nLove me forever, that's all I ask of you\n\n[Verse 3]\nThat baby is a genius\nDon't teach him 'bout Santa 'til you teach him 'bout Jesus\nDon't take him out the snow to try to take him on beaches\nI swear it's enough leisure in this world to get lost\nWhat's the point of gainin' chicken if you lose all the sauce?\nWhat's the point of gainin' chicken if it can't get across?\nLost the cold hard cash, they said, \"Damn, that boy soft\"\nSame niggas lost their souls in a fuckin' coin toss\nI guess I cleaned up, Santa don't miss no names but I miss Fatimah\nIt's been a minute since I've seen her\nThem the type of things I hate to bring up, just like the prenup\nThat shit be see-through like John Cena, Aquafina\nBut like the Christmas tape there's things that I gotta get clear\nLike my papa ask the same question every year\n\"What to get for my boy who has everything?\"\nI said, \"I'll take anything but everything,\" you know?\n\n[Chorus]\nLove me forever, that's all I ask of you\nLove me forever, that's all I ask of you\nLove me forever, that's all I ask of you\nLove me forever, that's all I ask of you", "image": "https://images.genius.com/47c6ebd2bb4bb77ee873d143f0ecb8eb.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}