{"songs": [{"title": "Spark Another Owl", "album": "Cypress Hill III: Temples of Boom", "year": "1995-10-31", "lyrics": "[Intro: Sen-Dog]\nOnce again the powers of the herb open up the mind\nSeek deep inside, tell me what you find\nCome on...\n\n[Verse: B-Real]\nWho be the ones steppin' in the room?\nEverybody welcome to the temple of boom\nBack, let me see ya fat indo sack\nAnd get weeded, somebody, everybody need it\nMari-Juana, Mari-Juana, do ya wanna\nGive me love when I put the flame on ya\nHomie, I'm the one with the shotgun, in the closet\nNext to the Glad bags full of chronic\nPuto, don't ya be steppin', with ya hands open\nAskin' me \"Can I get a hit of what t'cha smokin'?\"\nI ain't got no kind of love for a brother\nWho comes to the party with no bud\nI be smokin' this, indo-blazin', funk buddah\nEverybody, wanted it, now they talk about the hooter\nUp until the summer of '91\nWasn't no mutha fuckas talkin' 'bout smokin' blunts\nFrom the west coast to the east coast\nEverybody be braggin'\nBut , I'm the one who be puffin' most\nFirst it started with the nickel, then the dime\nThen the twenty, spendin' up all my money\nNow, I roll with an elbow\nWith the pound in the pad smokin' up the indo\nJust take a deep breath (ahh)\nHit it then pass it to the left\nYou can keep the muthafuckin' stress\nSmoke it up, just puff it up, oh yeah\nLight it up, then put your spliff up in the air\n\n[Hook: B-Real]\nDo you wanna spark another owl? (spark another owl)\nDo you wanna spark another owl? (spark another owl)\nEverybody spark another owl (the owl)\nEverybody spark another owl (spark another owl)\nI wanna spark another owl (spark another owl)\nI wanna spark another owl (yea, the owl)\nDo you wanna spark another owl? (spark another owl)\nDo you wanna spark another owl? (owl)\n\n[Outro: Sen Dog]\nYea, stroll the ways of the buddah mastas, brings me to the\nTemple of boom, I see people everywhere startin' to understand the\nPoint, when I'm talking about the joint, talkin' 'bout that marijuana\nTalkin' 'bout the sense, talkin' 'bout the kind mota boca loa-loa\nMaui, maui, lugers of work-ready, mexican greenba, cheeba, cheeba y'all\nYeska, humble pound weed, the crypt, the choclate tide, the afgani, the Meefrakan, the indo, the skonka, the bad breath sense (cough)\nHello everyone, I'm Kurt Loaded, we're here at hemp TV, with\nCypress Hill in Amsterdam we're listening to there new album\nI'm stoned, I'm outta here\nGoodbye folks", "image": "https://images.genius.com/05081a10b4aaa2a1d10f8ab1c10a10c8.1000x1000x1.jpg"}], "artist": "Cypress Hill"}