{"songs": [{"title": "Faithful", "album": "Views", "year": "2016-04-29", "lyrics": "[Intro: Pimp C, Drake & Amber Rose]\nCheck, one-two, one-two, bitch\nYou expensive, you know that?\nI'm high maintenance a little bit but not in a\nNot in a negative way\nI just like extremely expensive things\n\n[Verse 1: Pimp C]\nFoot off in their ass is what Ken told me\nNiggas like to play games\n'Cause they feel like they know me (they know me)\nYou don't know me, nigga, I done changed (I done changed)\nSo don't be trying to be putting on shit off in the game (Game)\nThis ain't no motherfucking 91\nWe out here rapping for money, you niggas rapping for fun\nI don't fuck with nobody in this shit but Bun\n(In this shit but Bun)\n\n[Pre-Hook: Drake]\nYou would think it's all mine the way I took it (Yeah)\nYou would think it broke down the way I push it (Yeah)\nYou hate it when I coat things all in sugar\nYou want to hear the real talk, well, girl, who wouldn't? (Yeah)\n\n[Hook: Drake]\nWorking, working, working, working, ain't ya?\nYou don't have no time to lay up\nYou just tryna be somebody\n'Fore you say you need somebody\nGet all your affairs in order\nI won't have affairs, I'm yours, girl\nFaithful, faithful, faithful, faithful\n\n[Verse 2: Drake]\nYou hit me like \"I know you’re there with someone else\" (Yeah)\nThat pussy knows me better than I know myself\nOn my way from the studio, so get undressed\nLet's do the things that we say on text (Yeah)\nI want to get straight to the climax (Straight, straight to the)\nYeah, have you coming all summer like a season pass (Yeah)\nI want to turn you out like pitch black\nWant to watch you do work while I sit back (Yeah)\n'Cause you talk like you got what I need (Yeah)\nYou talk like you got the juice and the squeeze (Yeah)\nTalk like you bet it all on me (Yeah)\nAnd you can't take no Ls off me\nI know you been\n\n[Hook: Drake]\nWorking, working, working, working, ain't ya?\nYou don't have no time to lay up\nYou just tryna somebody\n'Fore you say you need somebody\nGet all your affairs in order\nI won't have affairs, I'm yours, girl\nFaithful, faithful, faithful, faithful\n\n[Verse 3: dvsn]\nHow far we go always seems to get better with time, hey\nWon't ya, outsmart me, no\nTold me that your brain works better than mine\nTell me I should know ya (I'll get to know you again)\nYou want me to show ya (I'm gonna show you again)\nNow we're in the zone, yeah (Gon' let me all in again, ooh)\nAnd now you're coming over\n(Over and over and over and over and over again)\nOver and over again, over and over again\nNow you're coming over\nOver and over again, over and over again\nYou tell me I should know ya (But I'll get to know you again)\nAnd you want me to show ya, uh (I'm gonna show you again)\nWhen were in the zone you (Gon' let me own it again)\nAnd now you're coming over\n(Over and over and over and over and over again)\nNow you're coming over, you're coming over", "image": "https://images.genius.com/6f4b9c41ccb18485cccd6aa364ccc3b8.1000x1000x1.jpg"}], "artist": "Drake"}