{"songs": [{"title": "King Sh*t", "album": null, "year": null, "lyrics": "Oh this a hit nigga\nWith no words on it\n\nI got on two chains, but, no, I ain't Tity Boi\nI'm dream chasin', but I ain't from Philly boy\nBitch bad, and she said that I can get it boy\nThis a hit and I'm a make a nigga feel it boy\nMy flow on range, my swag's insane\nAnd my campaign on ten, I like the bitch\nShe down to fuck, but I'm really into her friend\nHouse up on the hill, got it off of cocaine\nAventador Lamborghini, condo off of Biscayne\nBitch I'm in my lane, fresh as hell, no stains\nRobert jeans with the stones, Giuseppe man's my chain\nI'm different, I was built for this, my bitch only rock Tiffany\nYou rat, you'll sing a symphony and I'm back, city been missing me\nMy watch silly my clock ignorant and I'm the king of my city\nI'm banned up and I ain't in a band\nBut my flow just like an instrument\nBass, feel that, yellow tape of the trizack\nHating is a disease, pussy where they do that?\n\nL.A. Reid cut the check for me\nKing shit and you know what it is\nShawty smell like a pound of that loud, but a nigga look like a hundred mill\nBut I drive Ferrari, fuck the motherfuckin dealer\nPay 10 million for a mansion, that worth more than your opinion\nI got racks all in my cargo pants\nStandard clip with that hollow man, yo' bitch ass\nIf yo bitch bad, she get fucked fast, ain't no romance\nMy diamond dancing in 3D nigga\nLike a bank strip when you see me, nigga\nYour money wrong and my money long\nAnd I'm playing with it like PE nigga\nReal nigga no joke, don't think there nigga no ho\nI got mini Mac-10 and a 100 round drum\nIn the carpet up under my car\nAnd nigga I don't wanna smoke your weed, plain gas the only thing I smoke\nAnd I gotta thank God for the niggas off Bankhead\nShawty, they taught me everything I know\nLike how to whip it, cook it, cut it, deal it\nHand it to your partner let him flood through the city\nReally, we bout that action, you try us and we blastin'\nWe turnt to the max that's a motherfucking fact\nI'm a real nigga, fuck these rappers\n\nDoor up, doors down\nWhen I'm in the club, bitch it's going down\nShawty think it fucked, hand down, hands up, pants down\nDown, down, shawty fuckin head down\nI see my phone blowing up, I know it's going down\nOnce I busted at the rapper, then it hit the town\nCheck the numbers in the city, boy it going down\n\nThis that dope boy academy, them three letters been after me, (Who?)\nThe F.B.I. ever catchin me, my family my witness a tragedy\nShorty open her legs up happily\nI ball hard like an athlete\nYoung black nigga in a big white phantom\nNigga, I look like a referee nigga\nThey blowing the whistle they telling\nI do the clam I'm chilling\nThis bitch turned up making rain\nWhen I'm in the club you yellin\nThey talk about these Bentley's that I'm gettin on the daily\nOne feet in the game and one feet out, swear I barely made it\nI'm a real nigga till the death of me\nNever sing a song like a parakeet\n50 bandz in my pocket just blew 60 grand on that Cherokee\nI be gettin money like a motherfuckin Brinks trunk\nStanding in the kitchen, nigga, trying to build a brick up, uh!", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}