{"songs": [{"title": "Coming to America", "album": null, "year": null, "lyrics": "The royal penis is clean your highness\nThank you, king shit\n\nYeah motherfuckers! Welcome to the United States of America\nTime to roll out the red carpet on y'all bitch asses\nHailin from the filthy, dirty South, where the Kings lay\nLudacris; Disturbin' Tha Peace family. Recognize royalty\nWhen you hear it. The throne has been taken, so kiss this\nNigga's earring. Luda throw some grapes on these bitches!\n\n[Ludacris]\nThese bitches throwin rose petals at my feet mayn!\nThey wanna spoil me, treatin me like royalty;\nWhat I'm 'sposed to do? It's such a sweet thang\nWork that track, whip 'em like Kunta\nThat's why they stay down, they loyal citizens of Zamunda\nBy way of A-T-L; if you disagree\nDon't even look at me ho don't pass go just go straight to jail\nWith no probation or bail, but this ain't Monopoly\nIt's Jolly Green Giants cause we smoke so much broccoli\nUh-oh, Spaghetti-O's! Luda's oodles of noodles\nAnd testin me is like pitbulls put up to poodles\nMy rap career goes back further than yo' father hairline\nIt's Ludacris - I pack more nuts than Delta Airlines\nI'm fly, even when I get high I work cash\nAnd even got my coats bumped up to first class\nI'm boss to all employees - and I'm here to teach the principle\nCause I've been saved by mo' bells than Lark Vorhees\n\nMan fuck that nigga 'Cris man, for real man. I'm tired of\nThis shit man. Man I try to rap for the nigga, I try to get\nA nigga tracks; he ain't hearin my shit. Man for real\nMan my four-year-old son can rap better than that nigga;\nMan that nigga garbage. Man I got talent too, the nigga ain't\nHearin me. Man iii-iiiis this shit on? 'Cris, c'mon 'Cris\n'Cris, f'real man. FUCK YOU NIGGA, MAN FUCK YOU!\n\n[Ludacris]\nFuck you too! What you wanna do, scrawny nigga\nBut I got a arsenal of automatics down to twenty-twos\nKnow how to use 'em, fight dirty as SHIT\nI throw a grenade and all-in-one bury yer CLIQUE\nYou see y'all got it all wrong like women in tuxedos\nAnd comin up shorter than five Danny DeVitos\nI'm on a cool ranch, get laid more than Fritos\nWith five strippers, four wives and three amigos\nI go scuba divin in Bays at Montego\nI find gold links and snatch 'em like I'm Deebo\nBut I'm the light-skinteted version of Mandingo\nI've seen more Beatles and Jagged Edges than Ringo\nI used to run numbers in line they called me BINGO\nCause I'm big, you a little star, you just twinkle\nOld asses like sharpeis, y'all all wrinkled\nAnd I stay with more BULLETS than yo' Billboard singles\n\nHo that is just too much! You just gotta give applause\nHe is definitely all f'real - yaseeI'msayin? Ha ha I be\nFuckin with him all the time, yahhmean? I'm sayin, I used\nTo just (?) now home come through he want filters a purple\nHe want quarters a purple now. I want y'all to trip with it\nMan, I woulda sold him a Coupe (?) we coulda played with\nYaseewhatI'msayin?\n\n[Ludacris]\nYeah, can I get a little hit of that, little nigga with a bigga sack\nSee piece of the bigger trap look at that God be rollin on that\nWhere they kick it at? And a lot of people just don't know\nShady Park you heard just don't go\nQuick to flip the bird up po'-po'\nMakin the way for that rodeo, that rodeo show!\nGotta hit 'em with a reload, I gotta put 'em with the people\nI gotta make a nigga stop, drop, roll - oh no where the beat go?\nBring that, shit back, didn't wanna hear that, clik-clak\nTons of fun with guns\nFuck all the lil' chit-chat get back get that get that\nWho knows, who goes there? Motherfuckers it's Poppa Bear\nStop and stare; pourin out a lil' gasoline and then drop a flare\nI'm on FIRE! And you know I can't stop 'til I re-TIRE!\nOh no, we stay swoll, rollin on Vogue TIRES!\nRight down the avenue, passin you rapidly stackin\nIn the back of the Cadillac and packin emergency action\nCamera, LIGHT LIGHTS, throwin a punch and then FIGHT FIGHT\nPackin a lunch and then BITE BITE, A-T-L stay TIGHT TIGHT\n\nI'm just tryin to save ya shorty. I'ma let you know\nIt's real down heah. When you ride down that two-eighty-five\nAnd you go past Kincaid, get ready to go past that Cambleton Road\nFo' you get it cut free shorty just shave; cause dat where dem\nReal niggas at. I ain't lyin when you in Decatur and you flossin\nDown Clintwood, Cambleton Road or (?) Boulder to shave!\nCause dat where dem real niggas at. When you're goin down that\nOl' Nat Hill and you pass dat second waffle house 'fore you get\nTo the rich niggas daaang, cause dat where dem real niggas at!\nMatter of fact, just shave when ya get to Georgia nigga", "image": "https://images.genius.com/d211edacb8de02968540124c6801063d.1000x1000x1.jpg"}], "artist": "Ludacris"}