{"songs": [{"title": "Who Do I Catch", "album": "Welcome to Strangeland", "year": "2011-11-05", "lyrics": "[Intro]\nNow I'm known by the masses\n'Cause I've grown to make them smashes\nOn this journey, did many back flips\nTo get your attention, now that I caught it\nWho do I catch bitch?\n\n[Verse 1]\nReal rock, rap and not a Xerox\nWeird not enough to make ya fear a lot, from here watch\nI ran scrimmage, and I fought to the damn finish\nAnd I popped eyes open without eating me canned spinach\nMy fans in it, constantly tellin' me I can win it\nIf I stand grimace damaging man every damn minute\nI blended it, expands quick, it slams wicked rhyme\nGrand spittage, H.A.M. with it, fam dig it's, N9ne\nChea! Hard to see me like the background\nYour rap styles coming softer than a cats meow\nRed laces, but booted like I'm Iraq bound\nThat frown'll get you ate by my cannibal from Sac Town\nSo relax pal, pat down, gat down, back down, blackout\nWith a fat smile, I might react foul\nSo don't make this cat growl\nI caught everybody when I spazzed wow, who do I catch now?\n\n[Hook]\nWho do I catch now?\nMaybe those who can't get with the rap sound\nI caught the industry, who do I catch now?\nWho do I catch now?\nMaybe those who told me to put the rap down\nI caught the whole world, who do I catch now?\n\n[Verse 2]\nI caught wreck, AND THEN I caught checks\nAND THEN I caught press, AND THEN I caught sex, YES\nAnd no permanent diseases were caught when I caught that\nNow the games been offset, 'cause I'm strange in a lost mess\nI caught a lot of shit being different, they tried to hinder Tech\nBy calling him devil worshiper, surfaced up on the internet\nMy temper gets grimmer just as winter sets, I'm a venter, yes\nAnd I can't forget when the finger pressed triggers, I can't remember that\nI caught stars attention, N9na had a large ascension\nSo high the lord is squintin', (NOPE), I mean y'all are squintin', (OKAY)\n'Cause I'm tall as Pippen , (NOPE), got a flawless vision, (OKAY)\nOn a lawless mission, (NOPE), 'cause I'm ballish pimpin', (YEAH!)\nBest believe I caught fades\nNever homie soft made, I'm active, no off days\nAnd I got boss paid with music, I caught babes\nAnd I even caught gays before they all caught AIDS\n\n[Hook]\nWho do I catch now?\nMaybe those who can't get with the rap sound\nI caught the industry, who do I catch now?\nWho do I catch now?\nMaybe those who told me to put the rap down\nI caught the whole world, who do I catch now?\n\n[Verse 3]\nI hit a pot of gold, with the harder flow\nYou haters oughta know, that we are the MO\nThis is my land, you in my hand and you's a particle\nAnd I see you marvel over the fact I caught Tha Carter IV\nSo that means I caught Martians already\nAnd you talk shit about that, because often y'all petty\nAnd because you jelly sicklin', its costing y'all Bettys\nTo get tossed in our headache 'cause we lost in tall fetty\nAyy, you catch the vapors 'cause N9na, he catch hoes\nAnd you non believers are funny people, like Seth Rog\nBetter pay attention, 'cause if you simpin' ya get froze\nAnd I'ma leave you with a wet nose, when I'm ripping they catch colds\n\n[Interlude]\nWhen I’m rippin', they catch colds?\nAy, that make sense, don’t it, Ben?\nLyrically, I’m cold blooded\nThey be like “ah-ah-choo!\"\n\n[Hook]\nWho do I catch now?\nMaybe those who can't get with the rap sound\nI caught the industry, who do I catch now?\nWho do I catch now?\nMaybe those who told me to put the rap down\nI caught the whole world, who do I catch now?", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}