{"songs": [{"title": "True Lies", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "{*cameras flashing, Snoop interviewing Bill Clinton*}\nYo, hold on hold on hold on hold on\nStop the cameras, stop the press stop the press\nNow Bill, this yo' nigga, Snoop Dogg\nNow answer me this - did you fuck that bitch or what?\n\n[Bill Clinton]\nThat's actually, not the first time that question's been asked; but\nSince, I believe, and I think any person - reasonable person would\nBelieve, that that is not covered, in the definition of sexual\nRelations I was given - ahh - I'm not going to answer it except to\nRefer to my statement. I had intimate, contact with her that was\nInappropriate - I do not believe any of the contacts I had with\nHer violated the definition I was given; therefore I believe I\nDid not, do anything but testify truthfully on these matters\n\n[Hook One: KoKane]\nWhat's the use of the truth if you can't tell a lie sometimes?\nWhat's the use of the truth if you can't tell a lie..hie..\nWhat's the use of the truth if you can't tell a lie sometimes?\nWhat's the use of the truth if you can't tell a lie..hie..\n\n[Hook Two: Snoop Dogg]\nLies, lies, stories and alibis\nBig Mac in the land of the small fries\nEveryone lies and tries to get by\nSome of us drink while most just get high\n\n[Verse 1: Snoop Dogg]\nYou tryin to cover up the holes in your sneakers\nYou need to put your motherfuckin face to the speakers (ba-bom, ba-bom)\nAnd quit tryin to run from it (holla holla at me)\nAnd c'mere, you big dummy (dumb ass nigga)\nDon't you know you can't run from the Dizzogg\nI'm down with (?)za, the long arm of the lizzaw\nY'all, niggas know what's happening you turn your back again\nAnd I'm bound to get it crack-a-lin I'm back again\nAnd everybody happy for me - ain't that the truth?\nThat's a motherfuckin lie (fuck that fool)\nBlack folks stick together til we die, hmm\nThat'll be the day..\n\n[Hook One]\n\n[Verse 2: Snoop Dogg]\nLiar, liar, pants on fire\nSmoke so much dope they call me Snoopy Pryor (well God damn!)\nWhich way is up I'm tryin to get higher\nI won't stop puffin til I re-tire\nMy bitches, my nigga, they off the wire\nThey love-ly, they love me, call me Sire\nMovie star bitches the ones you desire\nAngela Bassett, Tyra, Mariah, the flyest, the flyer\nSee most bitches like fuckin with a rider\nSlider, to the sider, invite her\nTo a gangsta, party, provider {*laughing*}\nWith a lot of meat by-products (mm)\nAnd beat the puddy-pot and got up\nShe licked the dick from the top to the bottom\n{*woo woo woo woo*} (That's a bad bitch!)\nThen she grabbed me by my nuts, and said \"Hmm I got 'em!\"\n\n[Hook One]\n[Hook Two]\n\n{*KoKane scats and ad libs to the music*}\n\n[KoKane]\nAh what's the use of the truth\nIf you can't tell a lie sometimes?", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}