{"songs": [{"title": "Free Mumia (Vinyl Version)", "album": null, "year": "1995-11-07", "lyrics": "[Intro]\nKnowledge, where the people at?\nFree Mumia!\nChannel Live! (KRS-One)\nHah hah hah hah hah hahaha!\nFree Mumia!\n\n[KRS-One]\nEverywhere I look there's another house negro\nTalkin' about they people and how they should be equal\nThey talkin, but the conversation ain't goin' nowhere\nYou can't diss hip hop, so don't you even go there\nC. Delores Tucker, you wanna quote the scripture\nEverytime you hear nigga, well listen up sista\n\n[Verse 1: Hakim, KRS-One, Tuffy]\nI met up with this girl named Delores, a prankster\nI said I MC, she said, \"You're a gangster\"\nBut she was caught up, she hit the floor like a breakdance\nWrapped her up like the arms in a b-boy stance\nYou'll have money cause I hear you get stars\nShe said, \"Where you from?\"\nI said, \"I was born up in the South Bronx\nBut now I reside across America\"\nShe said: \"You the one who be causing all that mass hysteria\n\nWisdom shall come out of the mouths of babes and sucklings\nBut you blinded by cultural ignorance and steady judging\nBut judge not, lest ye may be judged\nFor the judgment ye judge, ye shall surely be judged, you gets no love\n\nShe said, \"I like it, that's why I jock it\"\nThen I said: \"You only on my dick because I fill brotha's pockets\nCut the bullshit, take me to your pad\"\nShe said: \"Im'a give you the ass because I like the way your pants sag\"\nSpread the legs with the other hand she threw the kitty\nThen I sprayed jizm like graffiti on her titties\nFreestyled all night, no doubt\nThat bitch couldn't get enough cause she was strung the fuck out\n\n[Chorus: KRS-One] x2\nWarner, Elektra, Atlantic equals WEA\nInstead of fighting them why don't you go free Mumia\n\n[Verse 2: Tuffy, KRS-One, Hakim]\nWild recital, I kicks the vital, like the Final\nCall, as I watch, Babylon fall\nI had to Rush Limbaugh, hit that pig with an axe\nTuffy dips to the side, buckin' cannons that phat\nBecause he censored the uses of the metaphor\nYou can get the tip of my dick Gore\nBecause it's you that brings the real horrorcore\nExpenditures forgettin', cut from the poor\n\nWhy sure! Back before we were born, they sold us out\nYeah, J. Jackson, we know what you about\nBack when you was running for the presidencey and competing\nAll rap was dope, you loved every beat and\nBut you took the beating\nYou was using us then, like you're using us now\nIn the National Urban League, I don't know how\nYou figure the Stop the Violence Movement gave you six hundred thousand, nigga\nAnd now you quicker to diss, I get with miss Tucker\nYou better find another you sell-out motherfuckers\n\nHate to be so rough, it could be the White Owls\nHouse niggas are full of shit, like my Colin Powell\nKickin vowels, is how we relieve the tension\nUntil we start to bounce white people like suspension\nYou paint the picture, it's the black man on the corner\nBut tell me, who blew up Oklahoma?\nThe City, ain't no pity, for the beast\nIt's Hakim, that voice from the East\n\n[Chorus] x2\n\n[Verse 3: KRS-One, Hakim, Tuffy]\nBuck-buck! Buck-buck-buck!\nIt sound like gunshots but it could be the cluck of a chicken, definition is what you're missin' and\nListen to your children instead of dissin' em\nSenator Dole doesn't understand the younger\nLike they be sayin', \"Want to\", but we be sayin', \"Wanna\"\nThey gettin' dumber every summer, as they walk the road\nMainly because they cannot understand the code\n\nIn actuality, this Norman Bates mentality\nAlways seems to represent, minus three-sixty percent\nOr degrees full circle, dead from the purple\nRays of the sun I gots melanin so check it\nBag your nuts quick or get sick from being naked\nSuspect it, was it a means for the end\nFor just a few to drive the Benz while you eat the pigskins\nTurned you into mannequins is the trick of technology\nA revelation, revalations\nSensation gives me inspiration of revolution\nThat's my solution, there will be no sequels\nI'm Audi hundred forty four thousand with my people\n\nFrom Caligula to Hitler, and now it's Schwarzenegger\nA lust for the violence is the science of their behavior\nWho enslaved ya (it's the Devil) but the God of virtuosity\nAnd of the world created, could it be mental sodomy\nGot my mind twisted like the blades of fonta leaf\nI sit in disbelief as he crawls underneath\nThe rock cock back the Glock cause I don't trust\nThe Devil, I rebel until Babylon is dust\n\n[Chorus] x2", "image": "https://i.genius.com/b922e34e03439e896b78409fa5a869a43f6ef561?url=http%3A%2F%2Fcdn.discogs.com%2FBJPRuzkCcqSmO4HrrElLOhg3fiE%3D%2Ffit-in%2F300x300%2Ffilters%3Astrip_icc%28%29%3Aformat%28jpeg%29%3Amode_rgb%28%29%2Fdiscogs-images%2FR-219719-1299159757.jpeg.jpg"}], "artist": "KRS-One"}