{"songs": [{"title": "The Ellen Show: On Having More Kids", "album": null, "year": null, "lyrics": "Ellen: How do you think marriage has changed you, if it has?\n\nKanye: I've definitely learned how to compromise more. Which is something you have to understand when you partner with people in business. You know, you can't--\n\nEllen: Beautiful\n\nKanye: And I've learned how to shut up more and, um, I've--yeah. I think--I think I'm a better human being, you know, because of her\nAnd because of my daughter. And I have, you know, always someone to think about going home to and, you know, something for me to, you know, not only be brave for what I wanna do for humanity but also to be more protective of myself for my family too. Cause there's things I've done in the past that were considered negative, but I was really, you know, jumping in front of the tank for other people or for culture in a way. So now I always have to have that in my mind, that I have, like, a family that I have to protect too\n\nEllen: Mm-hmm. Yeah, and I do see that change in you. I see you-- And you are calmer, I think. You know, you don't seem, like, uh... like, uh...angry or--you know? You know what I mean? And I don't know if it was even anger, but it was just the way that you were getting all of your emotions out. And now I think your emotions\nAre grounded in a way that they come out in what you said and protection and love, and--and--they're going-- they're channeled\nIn a different way\n\nKanye: I think I was, like, going through now, like, my version of my terrible twos. My--my daughter, she wants to express herself, but she just doesn't have the words for it. And for me, there's so many things I wanna do with film, with clothing, and I just didn't have the words or the resources or the backing or the perception that I could do it, being that I was a rapper or, you know, all these things. And now, because of this Adidas deal, they allowed me a little bit of oxygen. Because what you have to understand-- The difference between, you know, what people give you about celebrity, the idea of money versus creativity. There's no amount of money that someone can give you to make you not be creative, if you were born to create. So a lot of times people try to block you, block your creativity, control you with money. And Adidas allowed me to make my whole clothing line, which I wanted to do, and it was just like a little bit of oxygen. You guys last year, two years ago, three--whatever. You guys were seeing someone being suffocated by a perception. Being suffocated by people in a position that could\nBlatantly see like, \"Wow, the \"Yeezys\" did really good. He was this influential. All those albums did this. But we're not gonna give him\nA shot in something else.\"  And there's a lot of people who, like, were really calm about that. But the definition of crazy is trying to do the same thing and expecting a different result. So I tried something different over the past couple years. And I actually got some really good results from it too, so...\n\n\nEllen: Well put. Well put. And that is true. I mean, I think we all try to express ourselves. And you do, you keep doing the same thing and saying the same thing and saying the same thing. It doesn't get\nThe result you want until you try a different way of expressing yourself or whatever it is, and then you get the result because you've shifted. We have to take a break. And then we're gonna show the world premiere of your new video, which I absolutely love. I love this song so much. You actually played it for me in our living room, and I just was blown away how beautiful the song is\n\nCut\n\nEllen: So, uh, more kids?\n\nKanye: Yeah, we're trying\n\nEllen: Really?\n\nKanye: Yeah, yeah\n\nEllen: I thought I'd slip that in there. I mean, that baby is so adorable, and, I mean, she is precious. She's so-- And smart as can be, right?\n\nKanye: Mm-hmm\n\nEllen: Yeah, she's-- Oh, look at that. So you're gonna have more? How many do you want, like a bunch? Like a Brad and Angie bunch? Or, uh--\n\nKanye: I just want whatever Kim wants\n\nEllen: Wow. Um... That's--that's a good answer, whether it's true or not. And what is the name of the CD?\n\nKanye: I don't know yet. We're still trying to find it. Trying to find the vibe. You know, this transition from what I felt when I did \"Yeezus\" to what I feel now, and, you know, we're just creating. So we haven't found it yet\n\nEllen: Okay. What about \"Ellen's My Friend\"?\n\nKanye: Yeah. I think that's pretty good\n\nEllen: Okay, think about that", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}