{"songs": [{"title": "Freestyle - Mister Cee", "album": null, "year": "1999-01-01", "lyrics": "Yeah\nYou're now entering the mode of the Notorious Biggie Smalls\nJunior M.A.F.I.A. clique, representing\nThis one going out to Brooklyn\nYa'll know what time it is\nIt's going out to all the gangsters\nAll the pimps, players, hoes and bitches\nYa'll know what time it is\nSo this what I want ya'll to do\nI want ya'll to grab your Dutch Masters\nAnd ya'll White Owls and ya'll Phillies\nUmgh, get you a fat sack, pint of Hennessy and lay back\nGonna do this one for my man Mister Cee, representing all day, every day\nAnd all you other tape niggas and bootleggers, stay in the house\nCause Brooklyn got this shit locked down\nSo any time you're ready Mister Cee\nWe gonna get hardcore on these homos\n\nLike I said before, Junior M.A.F.I.A. clique, hard-core\nUh, representing, Biggie Smalls in the house, uh, check it, uh\nBiggie Smalls is the wickedest\nNiggas say I'm pussy, I dare you to stick your dick in this\nIf I was pussy I'd be filled with syphilis\nHerpes, gonorrhea, chlamydia, getting rid'a ya\nGot it locked like the penitentiary\nNiggas mention me for MC execution\nWho ya choosin, the wack MC\nOr the Black Fat MC\nJack Dempsey will start shaking\nAll it's taking, is some marijuana and I'm making\nMCs break fast, like flap-jacks and bacon\nBack spins, the windmills, who's still the gin-drinker\nIll-thinker, exploding when the paper hits the ink-ugh\nTake the Gangster Chronicles, turn to page 6-6-6\nHolocaust, B.I.G. the merciless\nNiggas press they luck-and\nThey get a butt-fuckin\nStraight up the ass\nRaw dog with the rash\nAnd I don't fuck with the condoms\nThe condoms is a problem from the AIDS getting sprayed\nDiseases, B.I.G. pleases\nMCs across the seas is just the way, I crush my prey, hey\nI'm crazy and deranged\nBlowing niggas out the frame, simple and plain\nBut getting back, to the black rhinoceros of rap\nB.I.G. took a loss, how preposterous is that, nigga\n\nRecognize\nNotorious Biggie Smalls, '94 Ready To Die", "image": "https://images.genius.com/accf2df97375292b16f399ff6ec71e6e.500x500x1.png"}], "artist": "The Notorious B.I.G."}