{"songs": [{"title": "Sixteen", "album": "God Forgives, I Don’t", "year": "2012-07-30", "lyrics": "[Intro: Rick Ross]\nJ.U.S.T.I.C.E. League\nHuh! This is special\nExtremely special\n\n[Hook: André 3000]\nWhen 16 ain't enough\nWhen 16 ain't enough\nOoh, yeah\nAw yeah-eah-eah-eah-eah-eah-eah\nWhen 16 ain't enough\nWhen 16 ain't enough\nOoh, yeah\nAw yeah-eah-eah-eah-eah-eah-eah\n\n[Interlude: Rick Ross]\nIt's funny because, it's been on my mind lately\nHaving a dope beat, a dope idea\nSixteen bars ain't enough!\nHow the fuck, can I squeeze my whole life into a 16-bar verse?\nYou know, so many different levels, to living your life and\nDepicting, with your wordplay\nExactly what life means to you, and sixteen ain't enough\nI know y'all gonna feel me on this one\nYou gotta feel me on this one, huh!\n\n[Verse 1: Rick Ross]\nIt's funny how things change, funny how time fly\nMore than my feet travel, the more that I feel fly\nMore that I make now, the more that the chicks smile\nShe call me a local nigga, I opened a Swiss account\nEisenhower status, Etta James on the dash\nSmooth as John Coltrane cruising in the Cadillac\nSeville, feel my life on the real\nWe the Last Poets so this is a world premiere\nRolling like Mick Jagger, the women just getting badder\nAll I see is the money, cream, Eric Clapton\nAnd all I wanted was one, 16 ain't enough\nTalking that fast money, 15 every month\nWhen your people labelled poor, that motivated me more\nEverything I ever wore was once worn before\nRoll with the punches now it's box office numbers\nDressed like Sammy Davis, steaming my marijuana\nDouble M G's, double M fees\nWe in every hood, nigga: government cheese\nYacht to Yachtmasters, Ol' Dirty Bastard\nFloor seat for the Heat, paper that I'm stackin\nBetter put away a penny for the rainy days\nPick and roll, give and go, fuck a fade away\nLiving like Scottie Pippen, dribble riddles for vittles\nStarted off with a scribble, now I'm flowing a river\nShe say my heart cold, I'm naming my son December\nWhitney died night before the Grammys – damn, what a memory\nTrump Tower and I started with a 10 speed\nBorn broke, had to use a nigga's instincts\nNow I get a hundred racks for the 16\nWaking up to turkey bacon and my thick queen\nNiggas hating, I'm just watching on the big screen\nThree Stacks on the beat and the kicks mean\n\n[Hook: André 3000]\nWhen 16 ain't enough\nWhen 16 ain't enough\nOoh, yeah\nAw yeah-eah-eah-eah-eah-eah-eah\nWhen 16 ain't enough\nWhen 16 ain't enough\nOoh, yeah\nAw yeah-eah-eah-eah-eah-eah-eah\n\n[Interlude: André 3000]\nYou know how sometimes you got so much to say but\nThey on-, they only give you 16? Hehehe\nMan it's like, I mean, I got so much to say\nThe world has said so much to me\nAnd I just wanna give right back to 'em\nBut, I only get 16, that's like a cage, you know?\nI really can't say what I wanna say, you know?\nIt's just a glimpse, that's all\nJust one uh, one little single glimpse, just a page\nBut I guess I'm defeating the purpose of doing all this talking\nAight\n\n[Verse 2: André 3000]\nSummer '88, or was it '89?\nOr was it wintertime? Aw never mind\nI'm in my room, booming\nDrawin' LL Cool J album covers with Crayolas on construction paper\nI'm tryna fuck my neighbor, I'm tryna hook my waves up\nI'm tryna pull my grades up, to get them saddle lace ups\nBefore lil' Marc was Jacob, before them girls wore makeup\nBefore my voice would break up, before we'd tour them shake clubs\nBefore my mama wake up, before my crumbs would cake up\nBefore they tell me they love me and we'll never break up\nBefore the time she makes love to someone that I thought was my homeboy\nBut boy, was I wrong now\nI don't budge, don't want much, just a roof and a porch\nAnd a Porsche, and a horse and unfortunately but of course\nAn assortment of torches that scorches the skin\nWhen they enter, intruders whose tutors did\nA lousy job, how's he God if he lets Lucifer let loose on us?\nThat noose on us won't loosen up but loose enough to juice us up\nMake us think we do so much and do it big\nLike they don't let us win, I can't pretend\nBut I do admit, it feel good when the hood pseudo-celebrate\nHence, why every time we dine we eat until our belly aches\nThen go grab the finest wine and drink it\nLike we know which grape and which region it came from\nAs if we can name 'em, hint hint, it ain't, um, Welch's\nHell just fell three thousand more degrees cooler\nY'all can't measure my worth\nBut when you try, you'll need a ruler made by all the Greek gods\nBecause the odds have always been stacked against me when back's against the wall\nI feel right at home, y'all sitting right at home\nAll Kelly green with envy while I'm jelly beans descending\nInto the palm of a child, looks up at mama and smile\nWith such a devilish grin, like \"Where the hell have you been?\"\nShe's yelling, \"Selling’s a sin\", well so is telling young men\nThat selling is a sin if you don’t offer new ways to win\nA dolphin gon shake his fin, regardless if he gets in\nOr out of water, most important thing for him is to swim\nAnd Flipper didn’t hold his nose, so why shall I hold my tongue?\nI miss the days of old when one could hold his gal on his arm\nAnd not set off these alarms, when camera’s snap-snap-snap\nReturn fire, pap-pap-pap pap pap-pap pap pap\nThey’ll learn why, mere privacy, so essential\nThey won't make no laws, I break their laws 'til they see out our window\nI take the fall to make them all treat human kind more gentle\nForsake them all, I hate them all, don’t like em, don’t pretend to\nYeah something tells me, we ain’t in Kansas anymore\nAll that shit that used to be cool ain’t cool anymore\nAll the women we were pursuing, now they want more\nAnd they deserve it all, don’t settle for what ain’t yours\n\n[Hook: André 3000 & Rick Ross]\nWhen 16 ain't enough\nWhen 16 ain't enough\nOoh (Lord!) yeah (oh Lord!)\nAw yeah-eah-eah-eah-eah-eah-eah\nWhen 16 ain't enough\nWhen 16 ain't enough\nOoh, yeah (when 16 ain't enough)\nAw yeah-eah-eah-eah-eah-eah-eah (when 16 ain't enough)\nBreakdown, breakdown\n\n[Breakdown: André 3000 & Rick Ross]\nDoes your mama know you see me? Does she know you're freaky?\nDoes she ever wonder if it's 'bout ya I am speaking?\nDo you ever ponder where I'm at when you get sleepy?\nHow the hell I'm gonna tell the youth don't be me? Yeah\nHahahahah, hahahah, I love it\nDoes your daddy think you perfect? Does he know for certain?\nDoes he know how you act when you pull back all them curtains?\nDo he think I'm 2Pac cause I'm black and put the words in?\nDoes he know his daughter might have caught a real merman? Yeah\n\n[Outro: Rick Ross]\nHahahah, it's funny because, because you're a changer (huh!)\nBut because we love you, we go that extra mile\nBreak it down for 'em, André, huh!\n(Guitar solo)\nNext level, amazing", "image": "https://images.genius.com/52547754f795d4ff94def40716ed3a2e.1000x1000x1.jpg"}], "artist": "Rick Ross"}