{"songs": [{"title": "Norwegian Breakfast", "album": "OIL:710", "year": "2013-07-10", "lyrics": "[Verse 1]\nIf you could see the world through my corneas\nThe corner of my eye, I block out the erroneous\nSometimes I wish they made these contacts with euphoria\nThen maybe I could bear to open my eyelids more accordingly\nUnderage kids pour Georgi Porgi\nAnd get grooved up til four in the morning\nWith four tenderonis off one orgy\nAt the crack of dawn, get the crack at the Don Corleone\nAnd I'm feeling like I got it made man\nThey smell the bait all on me and ask \"what you made man?\"\nBut that don't really count if you ain't saving\nThey enslaving my people straight to the grave and\nMinimum wage at war, ask what we fighting for\nNeed more oil? Sure of course\nJust grab a piece of the pie, three-point-one-four\n159 lives hit the floor and break celestial walls\nPer second\nAnd these niggas think it's rap that got me stressing\nIt's about to be a rap when I pick the Smith and Wesson up\nCause these words ain't enough to be defending us\n\n[Hook]\nBut I try\nI try\nI try\nI try\n\n[Verse 2:]\nAn eye for an eye make the world go 'round\nAn eye for a guy make your girl go down\nShe sip the shit like it's liquor\nBut coming out my god body, it's like elixir\nShe trying to prolong life, I'm trying to prolong my dick and shit\nI give it to her quick, that's a sad predicament\nI swear I hate predicting shit, she said it taste magnificent\nSour like piff, but sweet like black licorice\nBitches, money, and weed, same shit, just ignorance\nBut how you expect me to act? Less black, less niggerish?\nFuck that, money control all my niggas shit\nAnd the white man stay trying to get a nigga rich\nAnd turn us on each other, like, what we fighting for?\nNeed more whores, another Porsche, of course\nJust grab a piece of the pie, three-point-one-four\n159 dimes hit the floor and break they jaws\nMake that kushy applause\nPer second\nIf only these niggas knew it's rapping that got me stressing\nBitches popping off like my Smith and Wesson\n\n[Hook:]\nCause I try\nI try\nCause I try\nI try\n\nAin't trying hard enough...", "image": "https://images.genius.com/47f2f93787e09badd3f6f304a7fa9394.700x700x1.jpg"}], "artist": "Joey Bada$$"}