{"songs": [{"title": "It’s Over", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "[Intro: Ghostface Killah]\nYo... aiyo this joint right here is about\nWhen you goin' through mad shit\nAnd it just seem like you get out of it, nowhere and shit\nYou thinkin' you puttin' your shit in and you thinkin'\nYou gettin' over, and doin' all this other shit\nBut before you know it, your whole world just caved in on you, pa\nCheck the joint, it's... uh-huh, yeah, I walked into the place\nVerse one...\n\n[Hook: David Poter sample]\nOver, and then my life (the masquerade)\nI know it's over... (the masquerade)\nUh-oh, over (over) my my my good day is over\n(Over) the masquerade is over (over)\nUh-oh-oh, it's over... (over)\n\n[Ghostface Killah]\nAiyo, back in '95 when I was jugglin' bitches\nPumpin' coke out the spot, smackin' fiends in the kitchen\nAll around dick sucks whenever, blowin' chronic out of Philly's\nGettin' flusty in the Cub' Link era\nNiggas tellin' me my spot is hot\nThey like I think any day now, playboy, shit gon' pop\nBack then I was the phat Ghost, them came March 1st\nMy eighth platoon got murked, got burnt for all our work\nAfter the funeral, I played low, countin' my last ten g's\nThree weeks later, yo, I'm back in the P's\nGatherin' up information, checkin' faces\nKeepin' a forty-five auto' loaded like it was bases\nWhen it get dark, venom will leave my mark (over)\nI heard a voice through a bullhorn, a white man he said \"Yo, Starks!\nYou're surrounded, put down your gun, look at the rules\nThere's nothin' but cops, nigga, you better not run\"\n\n[Hook]\n\n[Interlude: Ghostface Killah *during Hook*]\nYeah... you see how that went right?\nThat episode got deep and all of that\nKnawhatimean? Then it just go on and\nIt just don't stop... I don't care what town you from\nWhat hood you from, it just all goes in, yo, check this episode\nVerse two\n\n[Ghostface Killah]\nAiyo, aiyo, 11:40 A.M. in the best Western\nI'm with my bat, blew her ass back and chest in\nSlob my knob, yeah no question, this my main bat\nShe thorough like that, so we don't use protection\nBut the night before, my wiz must of check my phone\nHow the fuck she get the codes... I don't know\nNext thing, she layin' in the 'tel lobby, spotted me\nTippin' the doorman, holdin' hands with my bitch besides me\nMy heart drop, everything stops, scared to death\nTold my broad to keep it moving, cuz I just got knocked\nDon't turn around, as soon she did, she bust a shot\nPlus she talk, security drop when she touch the Glock\nI had the gum-face on, long face on\nDidn't say shit, not even cough or spit, my bitch was gone\nThere goes the car, house, rhyme boats or jewelry\nCourt date judges, my shorty tried to screw me\n\n[Hook 2X]\n\n[Interlude w/ Hook: Ghostface Killah]\nUh... you see, sometime it don't pay\nWhat goes around comes around in\nIn many different ways and\nYou can guess what happened\nThat's right ya'll, you know how it get down\nIf anybody got it locked, it's God, that's right\nWord...\n\n[Skit: Solomon Childs (Ghostface Killah)]\nHey Kimmy, how you doing? What up Keisha\nDamn girl, your hair looks so nice\nYeah, I got my shit done at Tasha's\nYou know I don't even fuck with that bitch\nYo, son, I think Ghost fuckin' one of them bitches, man\nAnd can you believe this son told them bitches that he can cook, man\nYo, I can't believe this, these bitches don't know where to fuckin'\nPut a salon up in the fuckin' hood, son I can't even make no money no more, man\n(Yo, son... maybe you need to tell them bitches that\nIf they could put a Ms. Pac-Man or somethin' in the back\nMaybe we could get some money back, maybe we could get some money back there)\nSon, you know I don't even FUCK with them bitches like that, nig', come on, man\n\"Come on sugar, hold me tight\" ... - sample", "image": "https://images.genius.com/360645cf4e6ca4db043d3db30426872f.500x500x1.jpg"}], "artist": "Ghostface Killah"}