{"songs": [{"title": "In Your Head", "album": "Revival", "year": "2017-12-15", "lyrics": "[Intro: The Cranberries]\nWhat's in your head, in your head\nZombie, zombie, zombie-ie-ie\nWhat's in your head, in your head\nZombie, zombie, zombie-ie-ie, oh\n\n[Verse 1: Eminem]\nI'm packin' up my shit, as much shit in the car as I can fit\nAnd I'm just drivin' as far as I can get\nAway from these problems 'til all of my sorrows I forget\nWhat's tomorrow like? 'Cause tonight I'm startin' life again\nGet to the corner and stop, fuck am I goin'?\nBesides psycho when I fantasize startin' my whole life over\nYeah right, oh and I might go and\nGet hypnotized so I don't even recognize no one\nI try to look alive but there's nothin' like holdin'\nYour head up high when you're dead inside and I just hide, so in\nCase you're wonderin' why are my insides showin'\n'Cause I done spilled all my guts and those are mine, so I'm\nPickin' 'em up and stuffin' 'em back\nFuck it, I've done enough in this rap shit\nRecovery brought me nothin' but back\nTo right where I was and perhaps\nThis coulda been my victory lap, if I wasn't on the verge of relapse\n\n[Chorus: The Cranberries]\nWhat's in your head, in your head\nZombie, zombie, zombie-ie-ie\nWhat's in your head, in your head\nZombie, zombie, zombie-ie-ie, oh\n\n[Verse 2: Eminem]\nIt seems to be the reoccurring main theme\nThe shit I would daydream as a kid, I was eighteen\nI went from an irate teenager to still raging\nAs an adult, amazing: back then I put anything\nInto the rhyme, whether it was sad, mad, happy or angry\nI spit it, the mainstream, I hit it\nYay me, I did it! …Did what?\nHailie, baby, I didn't mean to make you eighty\nPercent of what I rapped about\nMaybe I shoulda did a better job at separating\nShady and entertaining from real life\nBut this fame thing is still the hardest thing to explain\nIt's the craziest shit I\nEver seen, and back then it was like I ain't even\nBothered taking into consideration\nYou one day being older and may hear me say things\nI didn’t (A) mean and (B) just ain’t me\nOkay, so ladies and gentlemen\nLet's strip away everything and see the main reason that I\nFeel like a lame piece of shit, I sound cranky and bitter\nComplain, beef and bicker 'bout the same things\n'Cause when I look at me, I don't see what they see\nI feel ashamed, greedy\nAnd lately I've been contemplating\nEscaping to get away and go wherever this road takes me\nIt's making me crazy, what's in my—\n\n[Chorus: The Cranberries]\nWhat's in your head, in your head\nZombie, zombie, zombie-ie-ie\nWhat's in your head, in your head\nZombie, zombie, zombie-ie-ie, oh", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}