{"songs": [{"title": "Teriyaki Joe: Neo-Harlem Detective (Chapter Six: Dressing)", "album": "Teriyaki Joe: Neo-Harlem Detective", "year": null, "lyrics": "[December 8, 2013:]\n\nChapter 6: Dressing\n\nShe laughed at me at first. I caught her leaving the diner on her way to work.\n\nShe stopped laughing when I showed her the high side of a million Units for her troubles if she so volunteered for the task at hand.\n\nHer body was perfect. Her timing was perfect. Everything had a symmetry. It all fit together with no excess. Seamless. I knew better.\n\nThis was all somebody's chess. Lotta thought went into it. Big thinking too. Either I'm underestimating someone or they are me.\n\nEither way I'm on the board now and I feel that the games just getting started. She's gonna know somebody that knows somebody. She did.\n\nShe's gonna ask for more money. She does. I'm gonna hard nose. I did. She's gonna say \"Well baybee you won't cha Mambo Queen or not?\" I did.\n\nShe's a real looker. She knows. All part of the plan. Beauty & trouble always come together & if the beauty is this big then the trouble...\n\n---Have A Look Inside The Diner Mr. Teriyaki (It's Joe!!)\n\nI look in through the diner window & see people shaking violently & collapsing.\n\nI ask her did she eat anything in there. She says no somewhat startled at the scene taking place back in the diner. I rush in.\n\nThe waitresses are motionless, horrified. People grab at their own necks in chaos and last gasps before dropping to the floor lifeless.\n\n---4 Days Mr. Teriyaki...Godspeed---\n\nSon of a bitch. 39 dead. Poisoned. Food Pills. Messy. Poor bastards. Talk about motivation. Shit.\n\nI take Pricele$$ back to my office. She's shook. All kinds of shook. She sits down on the couch and manages to steady herself.\n\nI don't tell her how what just happened @ the diner is connected to our little vacation down to Neo-Orleans or that in the light her eyes...\n\n\"What you know about sum Rick Ross?\" She motions to the antique poster on the wall. Small talk to take the mind off the massacre.\n\nI like the old school I tell her. Old fashioned. Old music. Old guns. One foot in and one foot out. She remembers something and smiles.\n\n\"I like both feet in the pool baybee.\" She says while pulling two real cigarettes from her small purse. She walks one over to me.\n\nWe have a moment. I dont remember lighting it. She's back on the couch now. Wisps of smoke spiral toward the ceiling. Everything is cool.\n\nNext train 2 Neo-Orleans leaves in an hour. Just enough time 2get a proper disguise. A guy could really stick out in a city full of women.\n\n------End of Chapter 6-----", "image": "https://images.genius.com/2c3df61679d5348d24cc5a0dc865540b.533x533x1.png"}], "artist": "Lupe Fiasco"}