{"songs": [{"title": "Fuckin’ wit’ D", "album": "It’s Dark and Hell is Hot", "year": "1998-05-19", "lyrics": "[Intro]\nGrrrrrrrrrrrrrrr\n\n[Verse 1]\nWhat's on y'all niggas minds, fucking with me\nY'all know somebody has told you about fucking with D\nStuck in a tree is what you will be like a cat\nAnother dog at the bottom looking up, now what's that?\nYour worst nightmare 'cause I take it right there\nYou got niggas coming? Where they at? Right where?\nI make 'em like air, floating away\nWouldn't tell what he was thinking so I opened a way\nLeft him broken away, you know he hurt before he died\nMakes you wonder if he lost his shirt before he died\nOnly two knew the answer and one of us is dead\nSo anyone who seeks the truth can get it straight to head\nThen you and him can discuss what I did\nYeah it was wrong, dog, but I slid\nI'll repent one day, just not right now\nYou hear my shit all on the street, I'm kinda hot right now\nCome on\n\n[Hook]\nI don't give a fuck about\nY'all niggas cause y'all ain killing nothing\nI don't give a fuck about\nY'all niggas cause y'all ain killing nothing\n\n[Verse 2]\nI wanna break bread wit' the cats that I starve with\nWanna hit the malls with the same dogs I rob with\nWanna be able to laugh with the niggas that I cried with\nWhen it's over be like these is the niggas that I died with\nWhat do you do when you find out in the hall there's a rat?\nWhat do you do when you find out that your dog is a cat?\nShit, all niggas pack, can't hold but two\nSo while you getting more gats I'm putting holes in you\nA snubnose will do, break 'em off real propa'\nNeed to keep spittin' and I ain't gonna stoppa'\nCocka, unlocka, let'em go!\nGive it to his man, just to let him know\nAll things considered it was real for' a minute\nGot what was yours and tried to steal something with it\nNow feel something hit it, your chest that is\nThe best that is, is probably the best that slid\nDon't stress that kid!\n\n[Hook]\nI don't give a fuck about\nY'all niggas cause y'all ain killing nothing\nI don't give a fuck about\nY'all niggas cause y'all ain killing nothing\n\n[Verse 3]\nWhen niggas hear that dog bark, they better run\nWhen police hear that dog bark, they better come\nThey expect to save their lives, but they lives will be lost\nThere is a price to pay, how many lives will it cost? (come on)\nSince I run with the devil, I am one with the devil\nAnd I stay doing dirt so I'm a come with the shovel\nIs you on a level of a madman whose mind's twisted?\nMad niggas dreams caught the last train, mine's missed it\nListed as a manic-depressive with extreme paranoia\nHey dog, I got something for ya\nHear my name, feel my pain\nNiggas wanna steal my fame, but first, feel my reign\nKnow what it's like to suffer, never have enough of\nShit, starting off hard then only getting rougher!\nTougher, but then came the grease\nSo if you wanna save the peace, tame the beast", "image": "https://images.genius.com/8314b41ccd0d9cc7825bc168024bdec2.630x630x1.jpg"}], "artist": "DMX"}