{"songs": [{"title": "This Time Of Night", "album": "Fuck Da City Up", "year": "2012-01-01", "lyrics": "[Hook: Nelly]\nWe showing up, it's going down\nShe know it's us, I let her know it now\nIt's three, four, five in the morning\nOne thing's for sure is, this time of night\nAin't nothing open but legs, shawty\nAin't nothing open but legs, this time of night\nAin't nothing open but legs, shawty\nAin't nothing open but legs, this time of night\n\n[Verse 1: T.I.]\nAss looking on swole\nLong hair, pretty toes\nFlat stomach, nice face (Okay, she say she wanna)\nRide out to my place\nShe wanna bring a friend if it's alright\nOnly if we get it in with her all night\nWe got them bottles on chill, everybody on pills\nIn the air with them hands, girl\n\n[Hook]\n\n[Verse 2: T.I.]\nWhat's that, excuse me, look, shawty, who are y'all\nLook like that booty fat and I'm on booty call\nDon't approach me if you don't wanna do it all\n'Fore you know it, have your clothes and your shoes off\nIn the penthouse, getting turnt out\nCurtain closed, candles burning 'til they burnt out\nWe turned up that bullshit, we ain't concerned 'bout\nDick her down, pull her weave, sweat her perm out\nIs you scared, mama? Well, say it then\nIs you ready, mama? Okay, then\nIt's three, four, five in the AM\nIf you got the game, we'll play then\n\n[Hook]\n\n[Verse 3: Nelly]\nAy, you ever kicked it with a superstar?\nI'll pick you up in a half a million dollar car\nLay it up in the five-star\nButt-naked, got you bent over the mini bar\nYeah, cause I do it, baby, exactly how you thought it go\nCall me Mr. Paper Man or call me Mr. Lotta Dough\nA lotta dough, you ain't gotta worry\nI can take my fucking time or I can do it in a hurry\nI'm a freak, and you know it\nPut a candle between your ass and I'll blow it\nI'm talking Cool Whip, apple pie, chocolate cake, or ice cream\nSpread across your inner thigh, right up to your nahmean\n\n[Hook]", "image": "https://images.genius.com/c4a42649ba1a4f401f2ed78317e312fc.1000x1000x1.jpg"}], "artist": "T.I."}