{"songs": [{"title": "Guinnesses", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Intro Skit]\n(Narrator): Running desperately low on food, they were forced to turn back\n(Interjection): Well I'll be!\n(Interjection 2): What's that villain doing?\n\n(Voice 1): Princess, your voice sounds familiar\n(Princess): Well it should. You see, DOOM wants me to marry him. But after seeing what he has done to our peaceful world, I despise him. He intends to destroy all of us if I persist in refusing him, even now\n\n[Verse 1: Angelika/StaHHr]\nSheitan never came so ill, he got skill\nMet a brother from the grill that gave my spine chills\nAll thirty three nerves controlling my curves\nCommon sense just swerved every time I got served\nStress, frustration, empty rhetoric\nCold as winter in Connecticut, compassion lacking deficit\nThought it was love like, sent from above, you not a soulmate\nMore ways and actions of a primate\nWho by low and census coming faker than extensions\nPissed away all good intentions, outta here sister was missin'\nIntuition, maybe it was me, I couldn't see\nHolding onto fantasy, getting bitten by reality\n\n[Hook: 4ize]\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming! Take cover, hit the dirt\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n[Verse 2: Angelika/StaHHr]\nI shoulda deaded it from genesis instead of hittin' the Guinnesses\nNow I'm free falling, cursing at the street, bawling\nHe ceased calling, no appetite for feast darling\nSo deep all in, I bet he never stop balling women\nForsake God for the scent of a man\nSacrifice a whole life for a slice, overstand?\nMaybe it's a lack of pigment, loneliness imagine figment\nOnly got the car tinted to pull extra G's in it\nDamn Jody, comin with the okie doke, pokie poke\nSteady rockin boats, got me aimin for ya throats\nSniper scope, weren't we supposed to elope?\nPropose then ya froze, I don't think that I can cope\n\n[Hook: 4ize]\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming! Take cover, hit the dirt\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n[Verse 3: Angelika/StaHHr]\nConstant frustration, stemming from a no-win situation\nRushing lust and fornication adding to the complication\nPatience is a virtue, pain run deep when love desert you\nListenin' to whisperin', choosing chaos over discipline\nSimpleton, life should really be a piece of Entenmann’s\nRelationships strengthening, flower essence: Penstemon\nGentlemen, my favorite shit, so I've never forsaken it\nI persevere, make it fit, sculpting and reshaping it\nTaking sips off a fifth of it, passionate, intense\nIncense candles lit, scandalous\nEmotional bandages, why would he abandon this?\nGuess he couldn't handle it, the boss is magnanimous\n\n[Hook: 4ize]\nWar wound, purple heart, love veteran\nMorphine, pain killers, drugs and medicine\nAnything just to forget the hurt\nIncoming! Take cover, hit the dirt\nOn the front-line, there's casualties in the mind\nAnd the POW's get left behind\nMentally scarred for life, love is war\nAnd some chicks are just too hard to wife\n\n[Outro Skit]\n(Interjection): Oh boy here we go!\n(Voice): How come all you college boys wear them faggotty-looking white shoes, the look funny as hell. Ah looks like she got burnt laces\n\n(Bert): You didn't wash your neck. Sometimes we don't wash our necks, but that's ok\n(Ernie): Oh I washed my neck. Take-take a look at my neck\n\n(Misc. Voice): Hold it right there you!\n(DOOM): Where you are going, there are no jokes\n\n(Spiderman): I'm beginning to think that armor plated Gargoyle doesn't like me", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}