{"songs": [{"title": "Long Night", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "[Intro: Usher]\nIt's gon' be a long niiiiight (drop)\nUr-sher baby (oh-ohh) yeah\nYeah man! (oh-ohh)\nThis is a, J.Lack, track, man\nYeah (oh-ohh, oh-ohh, oh-ohh)\n\n[Nelly] + (Usher)\nOhhhhhh, girl you know how to find me (when you need a fix)\nBut you know when you call me (make sure time ain't a issue)\nListen, I keep a strategy for attackin yo' anatomy\nAnd I hope you don't get mad at me - but I had to say it!\nYou know rushin ain't a option, baby stoppin's not a topic\nYou know daddy gon' be bringin it home (bringin it home)\nYou know girl once I'm in it girl I'm in it so forget it, I ain't quittin\n'til I touch every square inch of your walls (inch of your walls)\nShorty here we go (go go go go)\nTake your clothes off slow (slow slow slow slow)\nGive your boy a little show (show show show show)\nGirl, cause (you know what I) like\n(Don't put up a) fight (ohh!)\n\n[Hook: Usher]\nJust give it to me girl I promise I'mma keep it steady\nCause I been lookin at you baby and I know you ready\nCut off your phone, it's gon' be a long niiiiight\nI can't hold it for long baby cause it's gettin heavy\nLet me beat it out the frame, I'm tired of lookin at it\nI'm just tellin you, it's gon' be a long niiiiight\n\n[Nelly] + (Usher)\nUhh, yeah\nYou see girl I'm talkin hours, he just talkin minutes\nHe gon' put you in his black book, I'll put you in the Guinness\nBook of World Records, shorty I'm already in it (me too!)\nI already did it, in the bed of +Menace+ (in the bed of menace)\nSome call me Dennis (yeah) cause my +Rod-man+ diggin in (diggin in)\nLeave 'em all screamin out (screamin out daaaaamn)\nDamn, a Scorpio so ma you know just how I (ammmmm)\nNow girl you know who I am - quit playin! (so baby let's go)\nNow shorty let's go (go go go go)\nTake your clothes off slow (slow slow slow slow)\nGive your boy a little show (show show show show)\nGirl, cause (you know what I) like\n(Show me where to) bite, you (ohh!)\n\n[Hook]\n\n[Nelly] + (Usher)\nListen, by the time I'm done with you (done with you!)\nAin't gon' be nothin left to do (left to do)\nI'mma take my time when I put it on you (put it on you)\nI'mma make sure you touch every inch of this room (this room)\nStartin from the bed (AYY) to the floor (OHH) to the couch\nTo the stairwell, kitchen counter, clear it out (clear it out!)\nFrom there we goin straight to the balcony (balcony!)\nShow you what you never seen (never seen!)\nWho you know do better than that? (better than that ayyyy!)\n\n[Hook] w/ ad libs\n\n[Outro: Usher]\nOh-ohh (yeah)\nOh-ohh (yeah)\nYeah man! Oh-ohh\nIt's a long niiiiight\nOh-ohh, oh-ohh", "image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg"}], "artist": "Nelly"}