{"songs": [{"title": "Get 2 Know Ya", "album": "Boss’n Up", "year": "2004-09-12", "lyrics": "[Intro: Snoop Dogg]\nHey girl, what's your name? No, for real?\n\n[Hook: Jelly Roll]\nI wanna get to know ya oh baby, get to know ya I gotta\nGet to know ya oh baby, I gotta\nGet to know ya baby, get to know ya I wanna\n\n[Verse 1: Snoop Dogg]\nI really can't lie to you\nA nigga wanna be inside of you\nSo open up your mind for me\nAnd make a little time for me\nYa heard I've been on your hills and thangs\nI'm here to remove your bills and thangs\nSplurge with you\nMy whole hands walking on the curve with you\nEven hit the earth with you\nYeah, I wanna explore that\nAnd take you to the store that, the rich and famous shop at\nKick back relax you are with a top cat\nIf I was in a tax I bust the top hat\nYou slip into some silk, yeah, I got that\nDogg's gonna get ya, a nigga gonna hit ya\nIf it's alright with ya\n\n[Hook: Jelly Roll]\nI wanna get to know ya oh baby, get to know ya I gotta\nGet to know ya oh baby, I gotta\nGet to know ya baby, get to know ya I wanna\n\n[Verse 2: Snoop Dogg]\nWhat is your favorite?\nAnd how long you been saving it\nTell me what your flavor is\nAnd can I know when your birthday is\nWhat's your sign? Oh you want me to tell you mine\nWell I'm a libra, and I'm a dare devil like Evil Canival\nAnd girl, yousa a diva\nThat's on the real\nDo you do what you want or do what you feel\nCan you cook a meal, can you close a deal\nYou like the Neptunes, oh for real?\nCome by the studio and meet Pharell\nThat's how cool I am\nBut I need you in my program\n\n[Hook: Jelly Roll]\nI wanna get to know ya oh baby, get to know ya I gotta\nGet to know ya oh baby, I gotta\nGet to know ya baby, get to know ya I wanna\n\n[Verse 3: Snoop Dogg]\nWhat kind of movies you like to see\nEverything is alright with me\nDo you like a whole lot of company?\nOr do you do it like me and roll sucker free\nI'd like to get close to ya\nI really wanna do something to ya\nYou like when a man call you baby boo?\nTell me what you like to do\nTell me where you wanna go\nWhere you never been before\nDream on ya\nPut the ice cream on ya\nI can tell you gotta a good heart\nYou see we are off to a good start\nI'm anxious patiently waiting\nWhen we gonna get to the good part\n\n[Hook: Jelly Roll]\nI wanna get to know ya oh baby, get to know ya I gotta\nGet to know ya oh baby, I gotta\nGet to know ya baby, get to know ya I wanna", "image": "https://images.genius.com/abf472197691b4497e371a2101e52446.599x845x1.jpg"}], "artist": "Snoop Dogg"}