{"songs": [{"title": "Breaker 1/9 (Slope Remix)", "album": null, "year": "1993-01-12", "lyrics": "[Intro: Twilite Tone]\nCheck it, for the record\n(\"Breaker 1/9, breaker 1/9, mayday\")\nOw, Ynot, I gots the breaker\nNo I.D., he's got the breaker\nCommon Sense, he's got the break, like this\n\n[Verse 1: Common & (Twilite Tone)]\nCheck it, a weeby weeby wobble gobble gobble, ooh, the turkey\nLord have mercy, mercy mercy me\nYou see I'm tryin' to get the punani\nBut you just wanna block me (Bo!), ah-eh-eh, ah-eh-eh\nYou see I'm tryin' to get the punani\nBut you just wanna block me, hey (Booyaka!)\nSo get your rattle rattle thundercloud and broom broom broom\nBecause I gotta gotta get some, el, bow, room\nSo I can Bang-kok, better yet, knock Italy\nBut raindrops keep fallin' on my couch, tryin' to sit with me\nTamperin' up my program, I play another slow jam\nIt's not an ancient Chinese secret, you should know man\nBut you insist on stay and playin' Genesis\nI gotta put an end to this, baldergash, EEE haul ass\nAnd don't come knockin' my door, with the cockle-doodle-doo\nI'm talkin' the his and his and hers (Three's Company too)\nSo step to the step to the rear\nAnd don't come back now, hear?\n\n[Sampled Chorus: Erick Sermon & Phife Dawg]\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must be erect\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must be, be erect\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must be erect\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must b-be erect\")\n\n[Verse 2: Common & (Twilite Tone)]\nThe CB's, the CB's, they'rrrrre here!\nI'm checkin' my mirror from the rear -\n- locks are closer, than they appear\nThe time is near for you to drop your beer and get your nuts in gear\nBut ain't no haps (UH-UH) your dils isn't there\nYou're thinkin' that, \"Oops, I made a mistake\"\nYou say, \"Forget Nell Carter, c'mon Jimmy, give me a break\"\nYou made a mistake on the first take\nTryin' to break a leg for take two\nYou shoulda ate your Wheaties\nAnd Petey mighta made a breakthrough\nYou say to hope that things might bloom, so you assume position\nWishin' he would listen, so you start to kissin'\nIt's alive, and up goes, and up goes you're adrenaline\nYou aimed, you fired, THERE YOU GO, limp again\nSo you take vitamins then play the role of friend and talk\nTry to tell her it's her fault, but Jack your Bean wouldn't Stalk\nBaby Bubba youse a goner, ahh, youse a goner\nIt's messed up when Your dils Is Playin' Tricks On Ya\nSo you pop fizz, what a relief, beef, stroke it off, my man\nGot your thing in your hand, sayin', (\"I think I can!\")\nDamn, this never happened before, yeah sure, that's what they all say\nUh-oh you better get Maaco, 'cause old girl is salty\nWhat was sweet to eat, has now dried up and rotted\nIt's a pop if you pick up your glove and say, (\"Yo, I got it!\")\nHopin' you won't drop, you thought you had it made like Katie\nWhat more could go wrong - you got the right one, baby!\nUh-huh, let you tell it, everybody and their momma knows\nThat you came quick, quicker than a pizza, from Domino's\n\n[Sampled Chorus: Erick Sermon & Pete Rock]\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"Gimme room so I can speak about the skinz\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"Gimme room so I can speak about the skinz\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"Gimme room so I can speak about the skinz\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"Gimme room so I can speak about the skinz\")\n\n[Over Chorus: Twilite Tone]\nYo, forget this, yo\nFreak this 2 pc. DRK style, you know what I'm sayin'\nCheck it out\n\n[Verse 3: Common & (Twilite Tone)]\nChigga-chigga, ooh, aah, ooh ahh, OH NO! Catch me, I'm fallin'\nWhy do fools fall? To the break, to the break, bye-bye-bye-bye-bye-bye, y'all\nMmm-hmm, unh-uh, what's really happenin' *woo-psch*, baby, I got back in effect\nCatchin' wreck, on the breaker to the 19\nI got Mack like a truck and push up like ICE CREAM!\nDo fries come with that shake?\nRattle and roll, but these are the breaks\n*coughs* Where broads try to Blow my game like Kurtis\nWord is bond, they'll do it, they'll do it\nThat's them c-c-c-c-cock blockers\nYou know the flava, so leave Com' Sense alone, knocka\nWith the cockle, doodle, doo, they want you to stay\nBut I say that you go\nSlob me up, they robbin' ya, when you try to get your sex on\nNext you reflect on, the list, yo, I get pissed\nIn the midst of a bone and somebody comes home\nNow it's like, me, you, and uh, Mrs. Jones\nFemales be waitin' to excel and tell their friends\nSomethin' bad about the men, yo, I'm gettin' clipped again\nAnd that shit is wrong, but it's like, I'm a man, I'm a man\nSo I'ma be a'ight, the...\n\n[Sampled Chorus: Erick Sermon & Phife Dawg]\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must be erect\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must be, be erect\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must be erect\")\n(\"Breaker 1/9, breaker 1/9, mayday\")\n(\"And before I get the butt, the jim must b-be erect\")\n\n[Outro over Chorus: Common]\nLate Show in the house y'all\nUAC, the true B-boys\nProfessor Not, RMCA y'all, Second Dimension\nRaider sho' in the house, too intense, check it out\nHa ha, it's like that, Chicago, the South Side\nComin' outta nowhere to go where, boy, uh!", "image": "https://images.rapgenius.com/75757ee546607258d827e1b012a2b46c.400x399x1.jpg"}], "artist": "Common"}