{"songs": [{"title": "UKNOWBIGSEAN", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2009-04-16", "lyrics": "[Intro]\n(G.O.O.D.) (Press play, press play, press play)\nYeah\nAy\n\n[Verse 1]\nI bounce back in this bitch like a reflex\nIt’s obvious they trying to stop Sean like an eclipse\nI’m laughing out loud to the point I might cry\nCuz nobody blocking mine like a nigga 9-9\nSee I am a phenom, you are a feline\nYou are a bitch, boi! Sweeter than key lime\nD-Town\nThe bullets and the people seem to ménage\nHit you in your shirt, now your chest look like a collage\nThis is not a fairy tale or facade\nNiggas tripping to the point, nowadays I’m yelling “Bon Voyage”\nSo in and so forth, I go in and go hard\nAnd when it’s time to go on, bet everybody go off\nYeah, I know you niggas can’t stand my city\nHow they feel to hear a “Big” this good still living?\nI came from the bottom\nRemain at the bottom\nSo long, I probably made a stain at the bottom (at the bottom)\nYeah it floods when it rains at the bottom\nBut my dynasty reign bitch, rain till we drowning\nAnd you’re broke until you realize something\nThat money’s like fucking, yup, money’s like fucking (ok)\nYou grind hard enough then bitch’ll keep cumming (yeah)\nI’d rather keep coming in the set and see nothing\nThey like how he make something, when they ain’t give him nothing\nHow he stay proactive and kept the shit bumping (yeah)\n\n[Verse 2]\n\nI hop on top of tracks and just start Forrest Gumping (Gumping)\nLabel full of stars like the fucking flag or something\nEverytime we do a show it’s like a hip. hop. summit\nA beast ontop of beats, bitch my studio is haunted (is haunted?)\nPlease believe me boy, cuz I will ghostwrite your shit like a Ouija Board (yeah)\nYou hang with niggas draped in Louis Vuitton\nI hang with the niggas who make Louis Vuitton\nWe running this shit with a baton, I promise (what)\nIma bring it home, designated driver\nAnd all we want was money and power\nSome niggas moved powder, baked, without flour (without flour)\nTill they see our money rose like flour\nResort to violence cuz we can’t afford Islands (Amen)\nDamn reverend we need money and a blessing (a blessing)\nJust call it Creflo Dollars\nMissed church service (uh huh)\nMy grandma say I’m reckless\nShe mad that I’d rather rock Jesus on my necklace (Amen)\nBig cars, big cribs, big bills\nAlways was a big deal way before the big deal\nAnd that’s real", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg"}], "artist": "Big Sean"}