{"songs": [{"title": "Whole Lotta", "album": null, "year": "2018-08-01", "lyrics": "[Intro: Young Thug]\nDun Deal, C4, fuck nigga\nNiggas drop salt and rice\nFuck 'round and hop out 'Gatti\n4 Bombs Baby, brrr\nDun Deal, ay, Migos\nKnow what I'm sayin everything we do is mafia, you know\nEverything we ta-talk is saucy, you know\nEvery bitch we fuck with bossy, bossy, bossy, you know\nYou hear me darlin'? (Yea! Yea!)\n\n[Chorus: Young Thug]\nYeah I got a whole lotta syrup (Uh)\nAnd we got a whole lotta molly (Lotta molly)\nToday I put some red in a sprite (Some red)\nAnd I got a whole lotta Jolly's (Huh!)\nAnd I got my dogs all with me (grr!)\nAnd you know they all spoiled rotten (Woo)\nAnd I got some reading glasses on (Woah)\nAnd I seen right through ya body (Cold heart)\nRide it 'til you catch a child (Child, child)\nHow the hell a snake drop spiders?\nPockets filled up like the wallets (Uh)\nSmokin' OG fuck broccoli (Uh)\nShe asked me \"did I ever fuck shawty?\" (Uh)\nShe asked me 'bout some head in the 'Rari (Oh)\nDid she ever hide in the closet? (Uh, uh, uh)\n\n[Verse 1: Young Thug]\nPour me up syrup, pop perc, man flow loss urban run into the herbs\nI'ma try to swerve 'cause the fuckin' Rolls Royce so big gotta park it on the curb\nAnd I gotta real big bag off a whole lotta pounds and a whole lotta birds\nAnd I gotta whole lotta gangstas, and a whole lotta killas and a whole lotta nerds, yeah\nAnd I gotta whole lotta money and I count that shit like a  mufuckin' clerk (oh yeah)\nI done fucked a whole lotta hoes and I hope made everyone of 'em squirt, yeah\nAnd I seen the Migos today, yeah\nAnd they said Culture for life, yeah\nAnd they got the number one album, ou\nAnd I told 'em all I'm excited, ouu\nAnd I told 'em all that they righteous, ouu\nAll you gotta do is be with Christ (Facts!)\nNiggas drop salt and rice (Damn)\nAll it did was make me precise (Okay)\nNigga done gone all red\nNow a nigga feelin' like Yachty\nNigga got drips on drips, yeah\nFuck round and hop out the 'Gotti (Yeah!)\n\n[Verse 2: Quavo]\nYeah I got ice on ice (Yeah)\nThen I put a bitch on white (Yeah)\nTold the bih to ride my pegs (Yeah)\nTold the bih to ride my bike (Ride)\nAnd I got money in the streets (Yeah)\nMomma gotta keep it on fleek (Mama)\nCoupe got suede in the seats (skrr, skrr)\nFishtail glazing the streets (skrr, skrr)\nClear frames on, Urkel (Ay)\nTwo styrofoam, purple (Yeah)\nNone of my niggas workers (Ay)\nGangstas all in the circle (Oh yeah)\nShoot at your shell, turtle (pff, pff)\nShoot at your body and head, hurtle (pff, pff, pff, pff)\nI got the molly and percocets, serve em (Serve)\nI got the molly and percocets, serve em (Serve)\nBig bills, big way (Big bills)\nCook it up, soufflé, (Cook it up)\nBeat it up, by Quay (Beat it up)\n3K, Andre (Three thou')\nMy bitch she slay (Bitch)\nAK don't play (brrrp)\nOn top, too paid (Top)\nBig tab, I pay\n\n[Verse 3: Lil Yachty & Takeoff]\nLil Boat, Lil Boat, Lil Boat, Lil Boat, uh\nAll of my brothers got 30's, uh\nLeft hand squeeze like Curry, uh\nMy niggas bossin' not workers (bosses)\nTwo cup drank we're dirty, uh\nCatch a lil' bitch that's from South Alabama, I told her that pussy so perfect (so perfect)\nShe tried to fuck me, no condom (hell nah)\nThat's how I know that bitch dirty (Lil Boat, Lil Boat)\nAcross the border, my phone got no service, you barely just touchin' the surface (brrp)\nI put that bitch on the perky, her titties is perky, I got that bitch suckin' for certain\nNone of my niggas is hurtin', uh\nAbout them Franklins like Kirk did, uh\nYoung nigga flexing on purpose, uh (flex)\nBallin' so hard with no jersey on\nHey, chopper style, you got one night make it worth your while\nHey, Gun 'em down, hundred round drum [?] what's now\nHey I'm 19, ay, fuckin' on a hoe with the same age child (Lil Boat)\nThrow the towel, fuck nigga bite Mike Tyson style\n\n[Verse 4: Duke]\nPoured a whole four in the Fanta\nMe and lil' freak and lil' bih with no manners\nPrivate jet, clear port, you know where we landing\nShe suckin' that dick and she callin' me daddy (suckin)\nSend me the skirt and I'm kickin' her box (send me the skirt)\nI fuck on that bitch and I'm kickin' her out (kickin' her out)\nHope I get fucked? dont give fuck bout no drought\nWe get them lows and then we get 'em out (we get 'em out)\nDon't gotta tell 'em they know what we 'bout (know what we 'bout)\nCame from the block tryna fold me a knot\nAnd I'm aim that nut right in her mouth\nPull up my pants and I'm skrrting right out (skrr)\nWhy you stand at the store with the bomb? (the bomb)\nThe trap pullin' up and they know I'm around (know I'm around)\nHow you can't cannot trap without the guns (without the guns)\nStart throwin' hunnids I ran outta ones", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}