{"songs": [{"title": "Bleed the Same Blood", "album": "Year Of The Dragon", "year": "2012-08-21", "lyrics": "[Hook: Anthony Hamilton]\n(Yeah!) We all bleed the same blood\n(Yeah!) And we beat on the same drum\n(Yeah!) It's not about where ya at\n(Yeah!) It's about where you come from\nAnd I'mma keep on thuggin 'til the day I DIE!\n(Yeah!) Oh yeah (Yeah!)\n(Yeah! Yeah! Yeah!)\n\n[Verse 1: Maino]\nUnstoppable, yo, Maino!\nRan up in Atlantic, told 'em let me go\nSmack my A&R and grabbed him by his throat\nPlayin with my life'll get you yellow-taped\nRunnin in and out of church like I'm the yellow Ma$e\nAll-black fleet like when Obama get in\nMissiles aimed at yo' building like Osama livin\n\"Fuck 'em all\" is what I'm screamin from that Mase' seat\n(How About Some Hardcore) like it's '93\nThink deep, feel the pain in my homie's face\nAnd only then you'll understand why my homies bang\nStrapped up, this is us, fuck a deal nigga\nGun boys be like \"Maino is a real nigga\"\nYeah, me and Bust bleed the same blood\nHandcuffed to the bus, we the same thugs\nNever fear, just know that I'mma ride for ya\nAll black baby welcome to my mafia\n\n[Hook]\n\nI gotta tell somebody yeahhhhh\n\n[Verse 2: Busta Rhymes]\nI'm passionate about gettin this money\nHandlin those that be plottin on takin it from me\nSome of these niggas forgot I be makin it funny\nWe're spendin like my fingers rotten then papercut bloody\nIn case you ain't knowin we back dominatin the country\nUntil I make these niggas black with the strength of a monkey\nBalenciaga boss, bitch address me as Mister\nEat salmons and tortellini down at the Bella Vista\nWe move in silence bitch you better whisper\nAnd sizzle the street with the heat until it hella blister\nSo much bottles, got 'em for every drinker\nSo much head I be callin mami a heavy thinker\nVictorious like a nigga conquered another nation\nBuyin bottles and drinkin to drown the sufferation\nCould give a fuck about your plan, watch how I handle that\nIf it ain't YMCMB or Conglomerate, cancel that!\n\n[Hook]\n\nI gotta tell somebody, yeahhhhhhhh\n\n[Verse 3: Busta Rhymes]\nSo inspirin when a nigga doubt\nLook around and see how niggas try to count me out\nOnly if niggas stepped in my shoes and took a walk\nAnd thought of shit I sacrificed I wouldn't have to talk\nAnd I'm like a bitch's blouse on a clothesline\nAnd treatin how I stumbled on another goldmine\nWhile embracin what God be havin for me\nYou can never stop what is destined, I hope you're happy for me", "image": "https://images.genius.com/c45e2fd5ac84651b718230013703e247.500x496x1.jpg"}], "artist": "Busta Rhymes"}