{"songs": [{"title": "Never Gonna Give it Up", "album": "D.O.E. Limited Edition - Volume 1 (Death of Escobar)", "year": null, "lyrics": "[Intro: Nas]\nMan, we love you man, you hear me?\nThis is coming from the General man, Nas man\nBravehearts love you man, this is to all of ya niggas\nWho been using my name from day one to make yourselves famous\nWhether you shouting me out on your records\nWhether you try to come at me on your records, or whether you just you know...?\nYou know... you know how you dick riding man? This goes out to ya\nCause we love you man, I've done made a lot of niggas famous man\nBut I'm gon' make you...I make you make the papers, this one's for you\nAyo, word up\nIt been a lot of times when a nigga ain't wanna fuck with this rap shit no more\nFuck this shit, but you know...? Through the year I started to see shit, you knowamsayin?\nNigga see niggas driving around with fancy cars, diamonds, all that shit\nNiggas thinking a nigga chilling\nGot to go through a whole bunch of big shit, all that bullshit\nBut you know what? Fuck that shit, you know how I feel? Yo\n\n[Chorus: Nas]\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's the life baby, you gots to understand it's life baby\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's the life baby, you gots to understand it's life baby\n\n[Verse 1: Nas]\nI got the mansion and the nice ride\nPlatinum chain, and an ice watch\nAll this fame in my life's hard\nI entertain in so many places\nSee so many different faces\nThey look the same from the stages\nAfter the concert, hours of long work\nHome sick from the road, smoking my lungs hurt\nEven though now I'm recording songs\nIt's better than, when I was peddling, doing wrong\nI brought the crew along, we thugging\nFucking married bitches; they go to their husbands\nBitches ain't shit, we laughing with them\nCan't even role the streets now, without the heat\nI bust the nigga off impost, that shit is weak\nOn trial, what I'ma tell the judge\nHe don't give me no smile, he don't give me no love, nor the jury\nThat's when I need celeb status and the blackness\nThis motherfucker's hate rappers, what a life\n\n[Chorus: Nas]\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's my life baby, you gots to understand my life baby\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's my life baby, you gots to understand my life baby\n\n[Verse 2: Nas]\nMy girl hate when I'm with my boys\nThink I'm cheating, every morning knocking at my door\nState policeman, give him a reason, but I don't give it to him\nThey said they heard a disturbance, and I just listen to him\nSee, I cooperate until they push me\nCops hate when you know the law, you ain't pussy\nYou not fake, can't explain how much I miss the block\nWhen we was slinging with my niggas, screaming \"Fuck the cops!\"\nNow when I'm dreaming I can see my dead friends smile\nWake up, I get some air, hit the mall for a while - pick up some gear\nI'm going to the studio; my engineer put the track up from \"out west\"\nAnd he told me spit it clear\nAnother hit just made, another album\nSo ones again we getting paid, and now we wilding\nGet hype to shoot the video, all in the city yo\nI'm hoping that a nigga blow, but ya don't hear me though\n\n[Chorus: Nas]\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's my life baby, you gots to understand my life baby\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's my life baby, you gots to understand my life baby\n\n[Verse 3: Nas]\nThe haters say I ain't shit\nHope I fall, but I can't slip\nGot to ball, got to bank chips\nOld ladies hate my moms cause their kids ain't amount to nothing\nCatch my moms on the bench fronting\nI got to stay awake, got to pray today\nGlad I'm still alive, fuck what them haters say\nSo many times I ain't wanna rhyme\nWanted a normal life where I ain't Nas all the time\nSo many problems too, do what I got to do\nAs long as my moms say, \"Boy, I'm proud of you\"\nI keep laying hits, winners never quits\nPlus if I stop, how would I stay legit?\n\n[Chorus: Nas]\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's my life baby, you gots to understand my life baby\nI'm never gonna give it up, fuck that\nI made a mil', but that ain't good enough\nOcean and a beach so I can really live it up\nSee, that's my life baby, you gots to understand my life baby", "image": "https://images.genius.com/21543b38d82541ca63e97417b956b30f.550x539x1.jpg"}], "artist": "Nas"}