{"songs": [{"title": "Losing My Mind", "album": "Bad Season", "year": "2010-12-23", "lyrics": "[Intro: Tech N9ne]\nI'm just gon' spit some shit\nI wanted somebody else to do the hook, but I ain't got nobody here\nSo I'm gonna do it\n\n[Hook: Tech N9ne]\nLosing my mind, yes I'm\nUsing my 9 this time\nOr should I decline and press rewind?\nLosing my mind, yes I'm\nUsing my 9 this time\nOr should I decline and press rewind?\n\n[Verse 1: Tech N9ne]\nEver since November hit, I can't remember shit\nUnless I was in your chick when I picked her, she was a limber bitch\nShe say I sent her quick and treated her as cold as Denver get\nThat wimper shit's for simpers, don't enter this cause I'm winter, trick\nAnd I like my hoes cold, young, dumb, lungs done\nNow she's an old soul, ate her like Lambert's throwed rolls\nShorty come and shorties go, this skinny chick orgy blows\nHorny bro, looking for a thicky, hunt her down like Laurie Strode\nI'm plum stark buck naked in my white socks\nMight pop my top and hype the block when the light stops\nJust call me cyclops, I see what others might not\nThe white cops are on me, oh, man, we’re in a tight spot\nIt's ironic though I’m bad, yep my mama grow the lad\nWho rob the Conoco for cash up in Monaco\nI’m half native got a relative named Jeroni-ho\nAnd this persona's \"Fuck the drama, only honor dough\"\nI know who died plus and who did it\nKansas City Cyrus, can you dig it?\nCut off your arm and fan you with it\nSome listen to me and say “Damn, you wicked”\n\n[Hook]\nLosing my mind, yes I’m\nUsing my 9 this time\nOr should I decline and press rewind?\nLosing my mind, yes I’m\nUsing my 9 this time\nOr should I decline and press rewind?\n\n[Outro]\nYates! Strange Music, and the fans\nMade Tech N9ne, the number one\nIndependent rapper in the motherfucking world!\nMuch love\nTo DJ Whoo Kid and XXL\nFor gettin' on this Bad Season\nA gift from me to you, yeah\nAnd if you don't know about Tech N9ne, now you know\nAll these motherfuckers can't be wrong\nYou feel me? We all over the world doing this baby\nSellin' out shows everywhere in the U.S. and overseas\nDoing all the festivals and everything\nAnd if you ain't up on it you need to get up on it\nHow the fuck I won a MTV award last year\nYou know what I'm sizzlin' I ain't really on MTV\nThe people speak! It's all about that\nThis is independent dollars baby Strange, Music\nRepresentin', Tech N9ne and Travis O'Guin baby\n'Bout to take over the world, act like you know baby\nWhat I'm 'bout to do right now I'm 'bout to give you two songs\nI'm 'bout to give you one of my album Anghellic called \"This Ring\"\nThat started a lot of the Tech N9ne hoopla\nThen I'm 'bout to take you to my album Everready, and give you \"The Rain\"\nEnjoy this baby this is from me, to you\nI love you, Tech N9ne!", "image": "https://images.genius.com/0fb56636df878a9df9d4417d6e65d406.1000x1000x1.jpg"}], "artist": "Tech N9ne"}