{"songs": [{"title": "So Hoody", "album": "Trap God 3", "year": "2014-09-17", "lyrics": "[Intro]\nZaytoven\nGuwop\n\n[Verse 1: Gucci Mane]\nGucci in this bitch man I'm right back ballin'\nGold grill shawty but I'm not from New Orleans\nI need a new iPhone these hoes keep calling\nCall me midnight black cause I keep a Glock 40\nMidnight came three times still she ain't callin'\nHow you 'gon hold me down you can't even hold water\nSmokin' more weed than the nigga Quincy Carter\nRollin' up trees like my nigga Bob Marley\nForgiatto's on the coupe like a baby start crawling\nGot a baby young nigga with a baby hand chopper\nCatch rabies if I sent my fuckin' goon dogs on ya\nYou's a fake-ass Moon Pie eatin' ass nigga\nI'm a real chef fish scale soup cookin' nigga\nCall 911 cause my neck gettin' sicker\nSee my old girl and she said my dick got bigger\nSaid she can't get with me cause her ass too little\n\n[Hook: Gucci Mane]\nBall so hard I can't get up\nWent to sleep late been drankin' that 'tuss\nSmokin' on kush, hit a lot of puss\nAnd homeboy still a bitch nigga my book\nGucci good looking\nWhat you got cooking? (dope)\nCooking up a deuce and it smell so good\nCan it feed the hood?\nGot a whole bag of goodies\nGucci Mane Laflare nigga I'm so hoody\nI'm so hoody, I'm so hoody\nMe and Zaytoven man we so hood\nI'm so hoody, I'm so hoody\nCamouflage pant with the camouflage hoody\n\n[Verse 2: Gucci Mane]\nBaby how you get all that in them jeans?\nYeah how you get all the cash in them jeans?\nI ain't talkin' ass man I'm talkin' 'bout green\nDirty Sun Valley nigga but my watch so clean\nGucci cooler than some jewels but his goons real mean!\nSpent two-hundred-thousand for just one ring though\nAK with a jagged edge on it like Wingo\nIf granny was still living one mil to play bingo!\nNine bricks in that bag imma shoot you like Rico\nYour man went broke man he just like T.O\nGot my top let up like a hat on Neyo\nImma fuck the bitch, I ain't gotta call Cleo\nYou know I rock with Rich the Kid man that's Pee Wee folk\nAnd if I ever go broke I can borrow Z.T. dough! (Zae)\n\n[Hook: Gucci Mane]\nBall so hard I can't get up\nWent to sleep late been drankin' that 'tuss\nSmoking on kush, hit a lot of puss\nAnd homeboy still a bitch nigga my book\nGucci good looking\nWhat you got cooking? (dope)\nCooking up a deuce and it smell so good\nCan it feed the hood?\nGot a whole bag of goodies\nGucci Mane Laflare nigga I'm so hoody\nI'm so hoody, I'm so hoody\nMe and Zaytoven man we so hood\nI'm so hoody, I'm so hoody\nCamouflage pant with the camouflage hoody (Wop)", "image": "https://images.genius.com/dd1eeef8b6076a56ad90f7c5b87f2a1c.500x500x1.jpg"}], "artist": "Gucci Mane"}