{"songs": [{"title": "When I Was Water Wippin", "album": "Trap God 2", "year": "2013-02-12", "lyrics": "[Verse 1]\nI talk so much shit I wake a dead man up\nAnd I'm the meth man, you better call Redman up\nI'm by myself man, and yes I ran my bread back up\nYou'll have better luck tryna rob a Brinks bank truck\nEight ounces and a Crush soda\nLast month I damn near smoked a Range Rover\nI buy a pint, crack the seal, and put a straw in it\nI'm drinking raw out the jar, caviar sipping\nI might need a new prescription\nThese young hoes fucking senior citizens\nDad, your little sister is granddaddy mistress, sad\nSecretary sucking politicians, you mad\nYou know that Mr. cheating on his Mrs\nRemember when I could just take a bitch to Wendy's\nBut now these hoes say they wanna go to Sicily\nBut bitch you must be silly, wanna go to Piccadilly\nCause I really feel you fake as hell, like Milli Vanilli\n\n[Hook]\nThese hoes, must of these niggas go broke for these hoes\nBig bad bully but he beat for these hoes\nMarried thirty years but he sleep with these hoes\nSpending all this money, going out to eat\nM.O.B. means money over bitches\nThese niggas say they real, but they just a bunch of bitches\nFuck the bedroom, point me to the kitchen\nBaby girl, where you was when I was water wippin'\nWhen I was water wippin', when I was water wippin'\nBaby girl, where you was when I was water wippin'\nWhen I was water wippin', when I was water wippin'\nFuck the bedroom, point me to the kitchen\n\n[Verse 2]\nFuck the bedroom, point me to the kitchen\nSo many chickens in my kitchen got my palms itching\nYou sucking a rich nigga dick, you in a good position\nYou say your baby daddy broke? Bitch you really tripping\nWhat's wrong with you, what kind of life you living?\nYou wanna ball, hit the mall, or just eat Church's Chicken\nGucci be really pimping, I need just thirty minutes\nAnd if you cool baby we could fuck every Wednesday\nBut you must pay attention, baby you got to listen\nThe first rule, that you cannot have hoes in my business\nYou know I ball relentless, pull up in Benz and Bentley's\nAnd I don't wanna meet your daddy, I ain't fucking friendly\nI had three-hundred-fifty-thousand, I was only twenty\nYour baby daddy broke, I bury his ass in fucking twenties\nYeah I'm a fat nigga, but all I ride is fucking skinny's\nAnd I don't wanna fuck that bitch cause she too fucking skinny\n\n[Hook]\nThese hoes, must of these niggas go broke for these hoes\nBig bad bully but he beat for these hoes\nMarried thirty years but he sleep with these hoes\nSpending all this money, going out to eat\nM.O.B. means money over bitches\nThese niggas say they real, but they just a bunch of bitches\nFuck the bedroom, point me to the kitchen\nBaby girl, where you was when I was water wippin'\nWhen I was water wippin', when I was water wippin'\nBaby girl, where you was when I was water wippin'\nWhen I was water wippin', when I was water wippin'\nFuck the bedroom, point me to the kitchen", "image": "https://images.genius.com/6f5bc65f6cb881521a8455261cd3fda9.475x475x1.jpg"}], "artist": "Gucci Mane"}