{"songs": [{"title": "Sucka for Love", "album": "Undisputed", "year": "2012-09-11", "lyrics": "[Intro]\nDoing me like you do, cause I know that's what you do (x 5)\n\n[Hook: DMX]\nNever been a sucker for love\nSo if it come down to you and me you know\nI don’t give a fuck, hit the next bitch like wassup\nCause at the end of the day\nYou ain’t never been nothing but a nut\nI ain’t never been a sucker for love\nSo if it come down to you and me you know\nI don’t give a fuck, hit the next bitch like wassup\nCause at the end of the day\nYou ain’t never been nothing but a nut\n\n[Verse 1]\nListen boo, you’s a bitch, you been a bitch\nYou know how niggas do\nRun up in a bitch, fuck her well\nAnd the bitch, you call them bitches\nBut then in a week or 2, fucking all them bitches\nA nigga gotta fall back and take a breather\nShorty suck a mean dick but in the morning\nGotta leave her, wasn't trying to deceive her\nI just wanted my dick sucked\nShe cute as a motherfucker\nAnd she got a big butt\nNow I'm like, what do I do from here\nCause she’s acting like she ain’t trying go nowhere\nI ain't really trying to get attached to this bitch\nShit it's friday, I just want some ass in the bitch\nCan’t be mad at me, I'm just doing what niggas do\nGot kids by him, and you wanna be a nigga's boo? What!? Really!?\nOh you think it’s like that?\nOk! I’ll be right back\n\n[Hook]\nI ain't never been a sucker for love\nSo if it come down to you and me you know\nI don’t give a fuck, hit the next bitch like \"wassup?\"\nCause at the end of the day\nYou ain’t never been nothing but a nut\nI ain’t never been a sucker for love\nSo if it come down to you and me you know\nS don’t give a fuck, hit the next bitch like \"wassup?\"\nCause at the end of the day\nYou ain’t never been nothing but a nut\n\n[Verse 2]\nIt was summer time, I was in the slumps\nSeen that chick from before, I was like wassup\nRemember me? I was that kid\nIt was you, her and me, we just did what we did\nHow you expect me to respect you\nWhen I know a police file of other niggas that you gave your sex to\nI ain’t never been a sucker, so if you think so\nYou got the wrong motherfucker\nWhat’s my name? Ah ah, bitch! What’s my name?\nYou know what the fuck it is\nI’m a real nigga, that’s gonna handle his\n\n[Hook]\n\n[Verse 3]\nI like the way you beat hits, oooh, that's that street shhh\nShorty can you keep a secret? (\"Yes...\")\nYou know what I’m trying to creep with\nCome on, cars outside, hotels up the block\nJump in the ride, you and me for the rest of the night\nIt’s all good, click, (\"Turn off the lights\")\nBack it up like that girl, ooh, that ass fat girl\nWe almost there baby, oh shit yeah baby!\n\n[Hook x2]", "image": "https://images.genius.com/5e36caac869327ad8b5a01792f569aac.500x500x1.jpg"}], "artist": "DMX"}