{"songs": [{"title": "Yessir", "album": "Streetlights  ", "year": "2010-04-20", "lyrics": "[Pity the child....pity the child]\n\nNow, why should I play around?\nLay it down like most of y'all and lay around?\nI'd rather gather hollow heads and lay ya' down\nBut I'm a little too old to play around\nYou still bangin' Dr. Dre and Dogg Pound\nSnoop is still the hottest motherfucker out\nYessir! We still around\nYessir! We still world renowned\nI caught silence, I silence sound\nI'm under the radar, stuff silent sound\nI'm here, my dude, I am born again\nWe saber-toothed tigers, y'all Cornish hens\nY'all cornball ballas, we presidents\nWith presidential-acquired hidden residents\nYessir! We residents\nAnd controllers of secret soldiers and regiments\nYessir! We ball out\nYessir! Till we fall out\nWe get high [get high], we don't have to try\nWe don't have to look and we don't have to buy\nWe don't have to make ends meet to get by\nWe don't have to try, I am that guy\nYessir! I am that guy\nYessir! I am that fly\nI can't help it and I can't stop\nAnd I won't stop and I don't stop\nI'mma take the top and put it where the bottom drop\nThen I'mma reverse it and make the bottom hit top\nSee this is what they all call the top spot\nThen I'mma show the top where the bottom stop\nI am everything that is anything\nI can't sing a note so I let the semi sing\nSend 'em out on a mission, see what the semi bring\nBack home to your selected and newly-elected king\nNow that's gangsta {x5}\nSee that's gangsta\nNow that's gangsta\n[Keepin it gangsta wit'chall]\nNow that's gangsta [gangsta]\nGangsta {x11} [gangsta]\n\nYessir! I am that guy\nYessir! I am that high\nRollercoaster, this whole movement's over\nGivin' ya west coasters, the cold shoulder\nI am ready, yes, I am here\nI am back, Jack, the spinner of the year\nLet's get one thing here real crystal clear\nWe reappear, their hopes disappear\nEvaporate, dissipate, your folks disappear\nAnd if you were smart you wouldn't be here\nNow that's what I call a double whammy\nI don't need the white folks, I get ghetto Grammys\nYessir! I get ghetto Grammys\nYessir! My women's eye candy\nI can't help it and I can't stop\nAnd I won't stop, that's why I don't stop\nI'm similar to Biggie, similar to Pac\nSimilar to Snoop, similar to Doc\nSimilar because they all taught me something, ock\nFirsthand, like cock and pop before a nigga talk\nI'm airborne, you're grounded\nLike you hid your report card and your mama found it\nYessir! I found it\nMy drrr-ream to go far as God allows me\nThe sky's the limit\nIt's in my arm's reach\nSo I'mma reach as far as my arms reach\nGangsta {x15}\n[Now that's...gangsta]\n[Keepin' it...gangsta wit'chall]", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg"}], "artist": "Kurupt"}