{"songs": [{"title": "Face Down (Quality Control Version)", "album": null, "year": "2018-06-07", "lyrics": "[Chorus: Kanye West & Quavo]\nWhy all bad bitches keep they phone face-down?\nBad girls always keep they phone face-down\nI love you when you face-down (ayy, ayy, yeah, yeah, yeah)\n\n[Verse 1: Quavo]\nQuavo\nFace-down the only time you come around (yeah, face-down)\nFace-down the only time you come around (yeah, face-down)\nYoung nigga came from that Bobby Brown (Whitney)\n(Metro Boomin want some more, nigga)\nAll my money came out that mud or ground (yeah)\nThey can't be real (no), her act can't be real (no)\nBut I like how I feel (I do), I like how I feel (I love it)\nI gave her a deal (ayy), I gave her a pill (ayy)\nNow she worth a mil' (yeah), now she worth a mil' (million)\nIce all on me (ayy), these racks all on me (yeah)\nYou can walk all on me (uh), you can skate all on me (yeah)\nNiggas ain't homies (woah), but you can wait on it (grah)\nYou can wait on it (woah), I bet I'ma eat my opponent (argh)\nI'ma need some manners (ayy), I'ma need some more cameras (flash)\nI'm too hot to handle (ah), blow money like candles (phew)\nRiding on camels (yeah), in Dubai riding camels (oh)\nWanna buy me a camel (oh), but I want and bought panorama (ay)\nYeah-yeah, higher than fighter jets (high)\nFace-down now she soaking wet (face-down)\nYeah, I really wanna ride with her (ride)\nBut the pussy got mileage (mileage)\nYeah, I'm dabbing and styling (styling)\nI wanna hold her up for hostage (hostage)\nBut she end up outsmarting me 'cause she did four years in college (damn)\nAyy, ayy, yeah, she did four years in college (damn)\nYeah-yeah, I'ma gon' give her this molly (damn)\nYeah, I was gonna give her this molly (damn)\nYeah-yeah, have her face-down on a island (yeah)\n\n[Chorus: Kanye West & Quavo]\nWhy all bad bitches keep they phone face-down?\nBad girls always keep they phone face-down\nI love you when you face-down (ayy, ayy, yeah, yeah, yeah)\n\n[Verse 2: Lil Yachty]\nI'll never trip over you (no), it's more fish in the sea (yeah)\nSoon, I promise you'll see\nYeah, you the one who need me (uh-huh)\nI can't convince you if you ain't gon' listen\nI ain't going on no damn-damn mission (oh)\nFlipped your phone, you had phone calls missing\nWho the fuck is this nigga named Tristan?\nThese bitches are so stupid\nAll your life, have you been a groupie?\nNo morals, there's no sorrow\nYou must like peasants, you coulda been with the Pharaoh\n\n[Outro: Lil Yachty]\nOh, oh-no, oh-no, oh", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}