{"songs": [{"title": "Omni Hood", "album": "Back to the L.A.B. (Lyrical Ass Beating)", "year": null, "lyrics": "[Chorus 2X: Vocalist] + (KRS-One)\nI know that you don't like\nThings that I like\nBut just because I write\nThe things that'll take your mind to sky-high\n(I write about life, I write about death\nI write about strife, I write about stress\nI write about the strong and the weak\nI write about the hood and the street\nI rhyme about my beefs)\n\n[KRS-One]\nOkay, here I go with a flow that be thumping the show\nIt's the Teacha KRS-One if you didn't know\nMan I speak to the streets over beats every week\nForget crime, peace of mind, that's what you seek\nMan I'm back with the heat, I keep rapping\nCause when people look at Hip Hop today, they be like \"What happened?\"\nHere's what happened, one side is chilling\nThe other side, they already sold out their children\nThey want millions, forget nation building\nIf this was really the mob, we would've took them out and killed them\nBut this the Gospel, we fulfil 'em\nI'm Hip Hop, I'm good, I'm omni hood, Kris rocks every block\nRise up, the lights up when I'm up\nChallengers, you know exactly where you wind up\nThis the hand that fed you, I don't hate y'all\nSome of y'all make me sick, it's more like a \"hetchoo\"\nI bring life to your dead crew\nMy real name is love, and love's gonna get you\nI got the TEC too, but it ain't about the TEC\nIt's about whether the owner of the TEC respects you\n\n[Chorus]\n\n[KRS-One]\nWhat you wanna hear bout central booking for?\nHip Hop, that's exactly what you looking for\nIf you don't represent the name, what you took it for?\nI spit rhymes so raw, you need to cook it more\nI'm from the Wild Style, Beat Street breaking\nNope, you're not the king, that seat's been taken\nYou young'ns on some crazy shit\nMe, retire? Why dude, I made this shit!\nSo yo, get to spitting, freestyling or written\nThe clock is ticking, stroke your kit and you'll get broken and bitten\nAin't no coke in my kitchen\nI got that fish, wheat, bread and chicken, y'all leave limping\nI put out more cartoons than the Simpsons\nYou got them sucker emcee symptoms, look around\nYou don't even know your english, your verb or noun\nYou just a sucker emcee, you sad-faced clown\n\n[Chorus]", "image": "https://images.genius.com/7124063b9019b7aa2798bff144643c27.500x500x1.jpg"}], "artist": "KRS-One"}