{"songs": [{"title": "Hey!", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Produced by MF DOOM]\n\n[Intro: MF DOOM + sample]\nGood evening, ladies and gentlemen\n(\"Hey!\")\nI'd like to thank you all for joining us this evening\nLet me know if y'all with me, y'all\n(\"Hey!\")\nJust a couple of things I wanna say\n\n[Verse]\nI only play the games that I win at\nAnd stay the same with more rhymes than there's ways to skin cats\nAs a matter of fact, let me rephrase:\nWith more rhymes than there's ways to fillet felines these days\nWatch the path of the black one: Supervillian\nHe wrecks clubs for delf in a drunken stupor, chillin'\nReady and willin' to inadvertently foil that\nPlan of any rhymer, whiner or spoiled brat\nWho got more snottier flows than snotty nose?\nAnd holds mics like he knows karate body blows?\nNobody knows the trouble I see\nFrom the MPV fly dirty tailin' the eye bubble eye thirty\nFor the record; this is some shit I just thought of, y'all\nScience fiction that's not admissible (\"Hey!\") in no court of law\nI live to rock mics 3-D\nThe only reason I seek to stop—to snuff the TV\nI heard beats, they sound like karaoke\nWith monkey rhymers on a leash like don't have this fairy choke me\nHit 'em with a penny so we can get these peanuts\nAnd I thought we was nuts, I used to get free cuts\nThey locks Lex Luthor up in Green Haven\nSince when a nigga never really been too clean shaven\nMisbehavin' rap stars need Listamint\nCall me Mista Bent\nI'm at where your sister went\nIntelligent, used to write and be well spoke\nNow all a nigga wanna do is fight and sell—(\"Hey!\")\n—tell a joke\nThis could lead to catastrophe\n'Bout to stop the violence right after these last of three\nShots from the black bat got me at headlock\nHoldin' on to sanity, by strands of that dreadlock\nShe told me, \"Get off,\" I said, \"Bitch!\nLet me set this shit off so I can get rich right quick\"\nThen it hit me like the point of intoxication\nNigga, come out and rock this nation like (\"Hey!\") ox defacin'\nA lot of niggas out is rusty like oxidation\nIn this world's strangest, most dangerous occupation\nBut you could do it, you the Super like in your building\nVillian like trife Kinder is in All My Children\nPlottin' and it sure to pay ends\nWith some real mature womens, and more of they friends (\"Hey!\")\nAnd when bad men roll tight, it's actual true\nLike a pack of Big Bambú, with natural glue\nWho grip necks of Becks to triple X?\nHe just came in 4-D: Follow the ripple effects\nAnd it'll lead you right to him\nOh, snap!\nIt seems you walked into a trap, through rap\nZoinks!\nThis place is filled with pretender willies\nOne false move, and get broke off like end of Phillies\nTrue believers\nAin't nothin new to a\nCrook with special powers like how to tell the future uh-uh-\nRhyme of the month two page long\nBustin' off two gages with my cape on wrong\nSon, it's on, remind me of a Raekwon tape song\nWith a fleet of super bad... Status: Rae Dawn Chong\nLet me know if y'alls with me, y'all! (\"Hey!\")\nNational and geographic down to the titty-bar\nRep Monster Island City, y'all!\nTo all my brothers who is doin' unsettlin' bids\nYou could have got away with it if it was not for them\nMeddlin' kids!\n(\"Over here!\")\n\n[Outro: Sample]\n\"Hey!\"\n\"Hey!\"", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}