{"songs": [{"title": "N.Y. State of Mind Pt. II", "album": "I Am...", "year": "1999-04-06", "lyrics": "[Produced by DJ Premier]\n\n[Intro]\nUhh.. yo\nWhattup? Whattup?\nIt's time man (word, it's time?)\nStraight up (it's time, man)\nAight, set that shit off (set it off then, nigga)\nSet it off (set if off)\n\n[Verse 1]\nBroken glass in the hallway, bloodstained floors\nNeighbors look at every bag you bring through your doors\nLock the top lock, momma should've cuffed me to the radiator\nWhy not? It might've saved me later from my block\nN.Y. cops, hookers crawlin' off the stroll, coughin'\nStitches in they head, stinkin' and I dread thinkin' they be snitchin'\nBut who else, could it be, shook at these, unmarked vans\nParked in the dark—NARC's, where's your heart?\nHustlers starve—they bust a U-ey, I jog\nTo my building—come out later wearin' camouflage\nSee the sergeant and the captain—strangle men\nNiggas gaspin' for air 'til they move no more and just stare\nWith dead eyes—tired of riots, shit is quiet\nSimple-minded fools infiltrate grimy crews\nOvercrowded cribs, uncles home from bids, sisters pregnant\nFathers on drugs, moms is smokin', beds is piss-infested\nHad 8 partners growin' up, 8 turned to 7\n7 turned to 6 niggas, got 2 in heaven\n6 of us holdin' it, now it's 5 rollin' thick\nThe 6th one's parole flipped, 5 niggas went to 4 quick\nWhen he went O.T., college life\nConverted into gangbangin', 4 niggas still hangin'\nYears passin' and slang changin'—3 of us now, 4th nigga ain't around\nWe all thought he was real—he did the snake shit\nFake shit—beat his ass down\nYo his mouth could've got us all wasted, what a fuckin' clown\nAll I got left in the end is 2 of my best friends\nAnd we all goin' out to the death for these ends\nWhat?\n\n[Chorus (repeats in bridge)]\nNew York, New York (New York state of mind)\nNew York, New York (New York state of mind)\n\n[Bridge]\nYou heard about it, you see about it\nYou read about it, it's in your papers\nIt's in your daily news (\"Get money!\")\nNew York chronicles, every day\nThe crime rate, the murder rate\nThe money rate, the paper chase (aight?)\nYou know what I mean?\nNew York state of mind, baby (oh, yeah)\nCheck it out (yeah)\n\n[Verse 2]\nI'm at the gamblin' spot, my hands on a knot\nNew York Yankee cap cover my eyes, stand in one spot\nI take a nigga dough, send him home to a shoebox\nYou lost that nigga I put your dollar in the jukebox\nHear my favorite song, all these niggas sing along\nAll the cigarette smoke's cloggin' my lungs\nHoodrats flashin' they tongue\nYoung thugs blastin' they gun, we got reputations\nBitches and niggas both on parole or probation\nShit is sick, niggas got gats, army fatigues\nI got my eyes glued on whoever walk in or leave\n'Cause I ain't playin', niggas'll run up in here and shoot up this shit\nStick yo' ass up, niggas'll find the loot in your kicks\nBunch of triple-cross niggas, just New York niggas\nLift you off your feet when they was just talkin' with you\nSome of these dudes the Feds be on 'em, you knew 'em for years\nBe the type when you walk in a pub, they offer you beers\nThat ain't gangsta, niggas is up North with tatted tears\nYour name's on the affadavit, you ratted kid\nFaggot-ass niggas that be scared to do they bids\nFuck you, we run you out of N.Y, you can't live\nGot your quiet niggas, that relocated down South\nComin' back to floss, then you got the jealous loudmouths\nAll of a sudden we got Crips and Bloods, D.T.'s\nRunnin' round quick to split your mug, it's easy\nTo score but it's hard to get the shit off\nNiggas fightin' over hundred sales, jump in the car and drive off\nWhen the fiend come around the block, happy as hell\nNiggas mad 'cause they ain't get a piece of that sale\nCutthroat connivers, universal, ghetto survivors\nGo to any hood that's live and make it liver\nA lot of niggas schemin', some real, some niggas frontin'\nBut I'm a big dreamer, so watch me come up with somethin'\n\n[Chorus]\nNew York, New York\nNew York, New York", "image": "https://images.genius.com/73b36e02ac974c8ab4a3cd49a9cf1794.1000x1000x1.jpg"}], "artist": "Nas"}