{"songs": [{"title": "The Grain", "album": "Supreme Clientele", "year": "2000-02-08", "lyrics": "[Intro: Rufus Thomas Sample]\nDo you wanna see it?\nDo you wanna see it?\nI'm gonna do it for ya\nI'm gonna do it for ya\nI'm gonna do it for ya\nI'm gonna do it for ya\nNew Ghostface!\n\n[Verse 1: Ghostface Killah]\nYo deep in the trenches\nWig, young black green beret\nChrome laser guns blazing at spades\nWallabies, cherry noose, kool-aid\n10 niggas call it Tai-Chi\nBlack blades, one hundred dollar seats\nHold up, we at the opera, Queen Elizabeth rub on my leg\nHad ketchup on her dress from a whopper\nChunky ass necklace, must be her birthstone\nJohn Paul cop the biggest stones outta Rome\nSo Charles, eyes up on her prince, fucking with Diana\nTwo rows across, Dirty giving hickeys to Vianna White\nFingering Pamela Lee, we on the balcony\nDare one of ya'll to Malcolm X me\nSomebody might catch a Kennedy\nYo let me adjust my lens through these binoculars\nI paid 5 g's sliding off like Kid Vitamin\nViking, patriot of Broad Street\nBet you think I'm laying like a hyphen\n\n[Verse 2: RZA]\nTony Starks make the narc's dogs bark\nWith the Benz parked, up against the boulevard\nStarks had the bone sparked\nOne cop tapped the window glass like a cymbal crash\n\"What the fuck son! You trying to break glass?\"\nHe flashed his badge; \"License and registrations\"\nAt that moment, his fat partner started chasin'\nChicken heads they was racing wit' they hearts pacin'\nFor snatching gold, trying' to dip into the god's basement\nOur location, lead steel shed spread\nCracked shorty head, left sweetie there for dead\nGhetto poodles, fingers sticky from cheese doodles\nStarving' for a 50 cent bag of Oodles and Noodles\nNeighborhood sick wit' it, Clinton 'bout to cut WIC\nMaybe one ya'll rich rap niggas need to politick\nReach for the sky, they throw bleach in your eye\nDon't teach you why, you be keeping 'em high\nDipped like an Oreo cookie in cold milk, bold silk\nGold-filled cap, Wu wear hat, low tilt\nTrue Islamic, we speak verbal rhyme phonics\nWhy ya'll trying to change this hip hop to technotronics?\n\n[Chorus: RZA]\nDon't go against the grain (the grain)\nDon't go against the grain (the grain)\nDon't go against the grain (the grain)\n\n[Bridge: Ghostface Killah & RZA]\nGirl, because of you I'm hurting\nWithin my, within my heart\nI know it's not right to be flirting\nBut a relationship has to start\nYou're the one that I'm clocking\nIt's time for you to start jocking\nDon't want you to see me cry\nThis is why this is why this is why\n\n[Coda: RZA &  Ghostface Killah]\nI met this girl named Rhonda from way down yonder\nHey yo god don't fuck with her\nI met this girl named Liz she was all in the biz\nHey yo lord don't fuck with her\nI rocked a ho named Tina from the heart of Medina\nHey yo kid don't fuck with her\nYea that girl Kit Kat, she got the good poody-cat\nHey yo nigga you better fuck with her!", "image": "https://images.genius.com/f0013dbd91dff7fd77352a0283ad6ec5.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}