{"songs": [{"title": "Rat-Tat-Tat-Tat", "album": "The Chronic", "year": "1992-12-15", "lyrics": "[Intro: Roger E. Mosley + RBX]\nYou really don't understand, do you?\nHey man, don't you realize that, in order for us to make this thing work, we gotta get rid of the pimps, and the pushers, and  the prostitutes then start all over again clean\nNigga, is you crazy?\nOnce again, the mighty Death Row organization committin' mass murder, and we ain't askin' for shit, nigga—we takin' it! So Dre, blast they ass, nigga!\n\n[Verse 1: Dr. Dre]\nRat-tat-tat-tat late at night with my gat\nOn the streets of L.A\nWonderin' where the pussy at\nStraight player, looking for a ho\nHangin' out, rollin' in my '64\n16 switches for the niggas in my hood\n17 shells so I make it understood\nStay back, lay back, way back in the cut\nYa come outside nigga ya gettin' fucked up\nBut I told ya, Creep, Creep ya best move\nLike Luther Vandross, I'm fuckin' up the west coast\nI'm right back up in ya when ya nut\n1-2-3 nut, from the D-R-E but\nThis is for the hoes that I used to know\nWhen I didn't have my '64 and a lot of dough\nI keep it like this and like that\n\n[Hook: Dr. Dre + Snoop Dogg]\nAnd I never hesitate to put a nigga on his back\nRat-tat-tat-tat tat ta tat like that\nAnd I never hesitate to put a nigga on his back\nRat-tat-tat-tat tat ta tat like that\nAnd I never hesitate to put a nigga on his back\n\n[Skit: Assailants + Assailed]\nOh, wait, that's that nigga that owe you that grip\nYeah, there that fool is\nWell break him off proper then\nWhat's up?\nWhat's happenin'?\nNigga, you delinquent, can I get those ends?\nAye nigga, pay this nigga, he ain't trippin'\nI ain't got your money\nWell, yo, check this out, nigga\n(Sounds of slapping)\nWhat's up, fool? What's up?\nWhat's up? Yeah, motherfucker\nI'll be back, yo! I'll be back!\nOh yeah? You ain't never comin' back!\n\n[Hook: Dr. Dre + Snoop Dogg]\nNever hesitate to put a nigga on his back\nRat-tat-tat-tat tat ta tat like that\nAnd I never hesitate to put a nigga on his back\nRat-tat-tat-tat tat ta tat like that\nAnd I never hesitate to put a nigga on his back\n\n[Verse 2: Dr. Dre]\nCreepin' and peepin', we can get with these\nThe Chronic, slangin' fat ki's from my block\nAnd it don't stop\nTell me where you wanna go\nTo the strip, or take a trip ballin' with the row\nMy shit off in ya system attacks\nIndo smoke in ya lungs, like that\nYou get lifted, calm, and if it's the bomb\nTaken away like Calgon, Vietnam\nCalifornia, back and on a mission, provin' a point\nIn my game, ain't no fuckin' competition\nThey wishin' but run up on reality\nC-P-T, C-A-L my locality\nIt's strange how I re-arrange and change the business\nBy droppin' shit like this\nDope, niggas can't cope with the real\nI peal, penitentiaries still, when I kill it goes\n\n[Hook: Dr. Dre + Snoop Dogg]\nRat-tat-tat-tat tat ta tat like that\nAnd I never hesitate to put a nigga on his back (yeah)\nRat-tat-tat-tat tat ta tat like that (you know I-)\nNever hesitate to put a nigga on his back\nRat-tat-tat-tat tat ta tat like that (and I-)\nNever hesitate to put a nigga on his back (hell yeah)\nRat-tat-tat tat ta tat like that\n(you know I-)\nNever hesitate to put a nigga on his back\nRat-tat-tat-tat tat ta tat like that\nAnd I never hesitate to put a nigga on his back\n\n[Outro: Snoop Dogg]\nStraight up. Now you niggas know where my homie comin' from. So quit the chit-chat, before you find yourself flat on your bizzack, fool. It's 9-duce, Dr Drizzay, is sittin' on tizzop! It don't stop. Treatin' buster's like a punk-ass cizzop! Biatch!", "image": "https://images.genius.com/f069b7a57cd614d79e5dba8ee92f08f8.944x937x1.jpg"}], "artist": "Dr. Dre"}