{"songs": [{"title": "You’re Welcome", "album": null, "year": "2008-02-28", "lyrics": "[Intro: Mary J. Blige]\nTurn, turn me up a little bit, when that music comes in it gets loud\n\n[Jay-Z]: Swizzy!!!!!!\n\n[Swizz Beatz] (Jay-Z) (*Mary J. Blige):\nYES!!!!!!!! Hands up! Hands up! Hands up high!\nHands up! Hands up! Hands up high! (*La dee da da da!!!)\n(It be very different now, Swizzy)\nHands up! Hands up! Hands up high! Hands up! Hands up! Hands up high!\n(*Oh oh oh!)\n(I need everybody put your hands up, wave from side to side right quick for me)\nSlow down Hov, you're killing 'em\n\n[Verse 1: Jay-Z (Swizz Beatz)]\nYeah, you would think I was on 'roids\nI been hitting so long and I'm a big headed boy\nNah we ain't on HGH\nThough I might pick up some weight when I'm running through your state\n(Running through your state) Nah, nah, nah, we ain't on the clear\nWe on the runway in back to back Lairs (in the air)\nYeah Yeah, it's Ms. No More Drama\nAnd Barack Obama rhymers, feel honored (talk to 'em Hov)\nI put my life on these tracks\nYou act like y'all don't wanna pay me for the facts\nLuckily my therapy is to rap\nI just bare my soul I don't expect nothing back (get it up)\nYou're all welcome, long as you felt them\nI was gon' get mine, you know where the hell I'm from\nI'm from the bottom, so I do this from the diapers\nQuick fast, turn the Big Apple into cider\nI do this, I'm a writer and a rider\nSpew it 'cause I'm nicer, but I do this for the lifers (tell 'em again Hov)\nI'm a writer and a rider\nSpew it 'cause I'm nicer, but I do this for the lifers, you're welcome\n\n[Hook: Mary J. Blige]\nTo all of y'all keeping y'all in health\nJust to see you smile and enjoy yourself\nYou're all, you're all\nYou all are welcome\nYeah, now everybody get yo' hands up\n\n[Swizz Beatz]\nHands up, hands up, hands up, high!\nHands up, hands up, hands up, high!\n\n[Mary J. Blige] (Swizz Beatz)\nYou're all, you're all\nYou all are welcome\nSlow down Hov, you're killing 'em\n\n[Verse 2: Jay-Z (Mary J. Blige) (*Swizz Beatz)]\nYeah yeah, you probably never see again\nSomebody so deadly via the pen (no, never, no)\nViva Hovito, my nino, muy bien\nBig up to Biggie and Pac, I do it for them\nUntil I reach Colleek, I do it for him\nDo it for those who can't do for self due to the pen\nMay these bars reach through your bar\nAnd Ma, when Mary sing it heals your heart (*hands up!)\nGod so Lisa Stansfield you are\nLove Is A Battlefield, we all get scarred\nI put my heart into this\nThis is much more than marketed music\nThe reason I got a market to do this\nAs there's people going through pain, I'm just walking 'em through this\n(I'm here for you) This ain't no marketed music\nPeople going through pain, I'm just talking 'em through it, you're welcome\n\n[Hook: Mary J. Blige]\nTo all of y'all keeping y'all in health\nJust to see you smile and enjoy yourself\nYou're all, you're all\nYou all are welcome\nYeah, now everybody get yo' hands up\n\n[Swizz Beatz]\nHands up, hands up, hands up, high!\nHands up, hands up, hands up, high!\n\n[Mary J. Blige] (Swizz Beatz)\nYou're all, you're all\nYou all are welcome\nSlow down Hov, you're killing 'em\n\n[Verse 3: Mary J. Blige (Swizz Beatz)]\nIf it wasn't for your love it would all be a dream\nAnd you made our dreams come true\nThat's why y'all don't need to thank us\n'Cause we do this all for you (talk to 'em Mary!)\nWe know what you were going through\nBecause we were going through it too\nWhen no one seems to understand\nWe were always there to hold your hand\n\n[Verse 4: Jay-Z] (Swizz Beatz)\nSure I taught you 'bout watch brands and watch bands\nI also said, \"Watch the man hopping out of vans\"\nI ain't only teach you about Evisu\nI told you how to fish and not let other niggas feed you, you're welcome\n\n[Hook: Mary J. Blige]\nTo all of y'all keeping y'all in health\nJust to see you smile and enjoy yourself\nYou're all, you're all\nYou all are welcome\nYeah, now everybody get yo' hands up", "image": "https://images.genius.com/3d672301d6676f83729b6fda2226ca5b.594x397x1.jpg"}], "artist": "JAY-Z"}