{"songs": [{"title": "Sandwitches", "album": "Goblin", "year": "2010-10-08", "lyrics": "[Intro: Tyler]\nNigga had the fucking nerve to call me immature\nFuck you think I made Odd Future for?\nTo wear fucking suits and make good decisions?\nFuck that nigga, Wolf Gang\n\n[Verse 1: Tyler]\nWho the fuck invited Mr. I Don't Give a Fuck\nWho cries about his daddy in a blog because his music sucks? (I did!)\nWell, you fucking up, and truthfully I had enough\nAnd fuck rolling papers, I'm a rebel, bitch, I'm ashing blunts (Sorry)\nFull of shit, like I ate that john\nCome on kids, fuck that class and hit that bong\nLet's buy guns and kill those kids with dads and mom\nWith nice homes, 401k's, and nice ass lawns\nThose privileged fucks got to learn that we ain't taking no shit\nLike Ellen DeGeneres clitoris is playing with dick\nI'm jealous as shit, cause I ain't got no home meal to come to\nSo, if you do, I'm throwing fingers out screaming \"fuck you\"\nI got ten of these Kennedy's\nNot Dom, but if I was a Dahm, I would be Jeffery\n'preme hat the color of a leprechaun with leprosy\nI'm fucking 'bout it, 'bout it, like I'm Master P in '96\nIt's fucking immaculate, the way your daughter smacking dicks\nSurprised she hasn't taken gymnastic dick inside her alley oop\nThe Golf Wang hooligans, is fucking up the school again\nAnd showing you and yours that breaking rules is fucking cool again\nI'm going harder than a midget jumping over me\nChronic youth, I'm shoving blunt wraps in bitches ovaries\nPunches to the stomach where that bastard kid supposed to be\nFuck a mask, I want that ho to know it's me, ugh\n\n[Chorus]\nWolf Gang, Wolf Gang\nIt's the Wolf Gang, Wolf Gang\nWolf Wolf Gang, it's the Wolf Gang\nIt's the Wolf Gang, Golf Wang\nIt's the Wolf Gang, Wolf Gang\nWolf Gang, triple six crew\nIt's the Wolf Gang, Golf Wang\nWolf Gang kill them\n\n[Verse 2: Hodgy]\nMy love is gone for you mami, you could ride in hearses\nI'm sick in the brain dumb bitch, can you nurse this?\nYou told me life would never, ever, ever get this perfect\nThen you smoke a J of weed, and take his kids to the churches\nUh, fuck church, they singing and the shit ain't even worth it\nIn the choir, whores and liars, scumbags and the dirt, bitch\nYou told me God was the answer\nWhen I ask him for shit, I get no answer, so God is the cancer\nI'm stuck in triangles, looking for my angel\nKill me with a chainsaw, and let my balls dangle\nTriple six is my number, you can get it off my Tumblr\n\n[Chorus]\nWolf Gang, Wolf Gang\nIt's the Wolf Gang, Wolf Gang\nWolf Wolf Gang, it's the Wolf Gang\nIt's the Wolf Gang, Golf Wang\nIt's the Wolf Gang, Wolf Gang\nWolf Gang, triple six crew\nIt's the Wolf Gang, Golf Wang\nWolf Gang kill them\n\n[Verse 3: Hodgy]\nIt was hilarious, well it ain't fucking funny now\nI'll push this fucking pregnant clown into a hydrant stuck in the ground\nI step through the stomach, replace the baby with some fucking pounds\n\"My baby daddy shoot bricks, the nigga also shoot rounds\"\nCause if I shoot blanks, oops, thanks\nI'm right back in it dead yummy and her mildew stank\n\n[Tyler]\nFree Earl, that's the fucking shit\nAnd if you disagree, suck a couple pimple-covered dicks\nUm, Wolf Gang, that's the fucking clique\nGolf Wang kill them all nigga, triple six\nFuck 2DopeBoyz, all them niggas bitches\nWe don't need y'all, The Fader's who we really fucking with, bitch\n\n[Outro]\nAnd we don't fucking make horrorcore, you fucking idiots\nListen deeper than the music before you put it in a box, Wolf Gang", "image": "https://images.rapgenius.com/f19692963c532940ab3b1ed9116e7260.800x800x1.jpg"}], "artist": "Tyler, The Creator"}