{"songs": [{"title": "It’s the New", "album": "The Bar Exam 2", "year": null, "lyrics": "[Intro: Royce da 5'9\"]\nLet's go (Bar Exam 2, nigga!)\nOh! Yeah\n(Green Lantern) Hoh! Hoh!\n(It's a fucking invasion, you bastards!)\nThis ain't 'Ye, it's more like AIDS\nThis ain't James it's more like a trade and you more like Wade\nAnd I ain't playin', I'm more like Cuban\nNot the cigar, Mark; introducing...\n\n[Hook: Jay-Z sample]\n(It's the new!) Best rapper alive, best rapper alive\nBest rapper alive, best rapper alive\n\n[Verse 1: Royce da 5'9\"]\nNaw, this ain't Wayne, it's more like Pain\nAnd I ain't talkin' bout with T-dash in front\nI'm more like needin' rehab for months\nHock and spew lyrics\nOn Dr. Drew's spirit until he has the mumps\nDrunk, that's if I can put it in one word\nMy niggas that ain't with all the drinkin', they want herb\nSo even though the car plush\nThe ashtray full of dark butts\nLike we rollin' up lookin' for Yung Berg\nTop off, bitch in the front, domin' me up 'til my rock soft\nEither that or she gon' get lockjaw\nStop? Naw! If she come up for air, I cut her of\nLike Jesse Jackson with a hand on Barack's balls\nAhh-aww! Nigga, it's me!\nJumper movie in the flesh straight from It'ly\nFive series, six series Benzes\nFuck them little C's, I'm on some ole Maino shit\nThrow everything at you but the kitchen sink till I plug you\nIt's goin' down, I'm on some ole Draino shit (Oh!)\nI'm the Rich Po, not so, the flow spells gospel\nBook you for a show and turn your hotel to hostel\n(It's an invasion!) This ain't Luda, it's more like Shooter\nBetter yet, Shot Ya, Pac or Big Poppa?\n\n[Hook: Jay-Z sample]\n(It's the new!) Best rapper alive, best rapper alive\nBest rapper alive, best rapper alive\n\n[Verse 2: Royce da 5'9\"]\nThis ain't Jay, it's more like sprayed\nThe kind that confuse kindness with polite play\nMy bitch got two midgets in the bra\nAnd a nose like a vacuum, she live by the Snow White way\nFuck Forbes, fuck money till they put some black heads\nIn them motherfuckers like they come from pores\nHip-hop is alive, my nigga, come for yours (Yes!)\nI got the hood open, attached to jumper cords (Yes!)\nAlone in the mirror, rub-a-dub-dub\nI ain't the game (I ain't the game)\nEven though I don't belong in this era (Green Lantern!)\nI'm tryin' to take shit past Nas, Jay, Shady & Dre shit\nShout out to the Doc, I'm tryin' to find patience (Woo!)\nLookin' like I'm pacin', like hello, say hello to me\nI elbowed my way into niggas' conversations\nI don't write rhymes, I commit death threats\nThis my new name if you ain't guessed yet!\n\n[Hook: Jay-Z sample]\n(It's the new!) Best rapper alive, best rapper alive\nBest rapper alive, best rapper alive\n\n[Verse 3: Royce da 5'9\"]\nYeah! (Yes) This ain't Fif, it's more like a gift\nA bottle of Cris, on side of a sip or a quality lick (Ahh!)\nI'm the shit, you try to be sick\nI be ridin' with silenced machine guns\nWhile you be tryna be Tip (Ahh!)\nI'm still hood, I move, minus the bus pass (Yeah)\nOut with the poverty in with the new deluxe pad\nThis black nina told me I'm a black leader (Uh-huh)\nThat's why I be preachin' like David Banner\nMinus the mustache (Haha)\nBut I ain't runnin' from nothin' as long as rappers is runnin'\nThey receive death from a sentence like capital punishment\nThe flows is mean, I make a nigga lean\nLike puttin the word \"meth\" in between \"pro\" and \"-zine\"\nYour bitch sprung right after my dick, go fish\nI leave her numb like a tongue after a coke kiss (Yeah!)\nI'm focused, I spit madness, you niggas is borin'\nYou at a level orange with your bitch-ass-ness (How?!)\nPlots is thickenin' and I care about rappers\nBout as much as I care to see Terrance and Rocski bickerin'\nWatch is sickenin', Glocks specifically hot\nI'm trippin', is you with me or not?\n\n[Hook: Jay-Z sample]\n(It's the new!) Best rapper alive, best rapper alive\nBest rapper alive, best rapper alive", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}