{"songs": [{"title": "Nothing Like Me", "album": "Dark Horse", "year": "2014-08-12", "lyrics": "[Intro - Gritz]\nHe don't do the things like I, do he?\nHe don't make you feel like I, do he? Do he?\nHe don't drive the car I drive, do he?\nHe ain't gettin money like I, do he? Do he?\n\n[Verse 1 - Twista]\nEvery minute I be in it\nEvery minute I be in it, I be killin competition\nWatch I break 'em from the start to the finish\nI make 'em start to diminish and body anybody\nMakin’ a comment about me the way I don't like\nDisgruntled motherfuckers and suckers, today we call 'em haters\nI'm so major, hoes on me and they wanna fight\nThey wanna bite ’cause I'm original like Bobby Digital\nMy style is critical and yours intermediate\nI'm just a rappin legacy, I got the recipe\nFor cookin up and servin, and they likin the ingredients\nI’m mackin’, I'm a genius, a flow of horror, I could peep your\nAura and see what your inner feelings might be\nNiggas talkin shit ’cause they ain't used to bein’\nIn the same room with a legendary nigga like me\nSome of 'em really wanna be me and they want my car, ho\nAnd they flow like me\nNiggas wanna take away my style, they can get it how I get it\nBut they money never grow like me though\nHow I live it is exquisite and the picture is so vivid that the riches\nAre not only monetary but within the body and the mental\nSpectacular graphics in back of a plethora of energy\nVocally vibratin rhythms through a instrumental\nSpit and tellin niggas you don't really want it\nBitches you don't really want it\nThink I'm dissin even when it's hypothetical and I ain't really on it\nI'm known to body my opponents\nShould I say opposition, in my position I'm expected to be venomous\nI beat 'em down verbally the way I rap\nLike it was multiples of me, I fuck 'em up like it was ten of us\nAnd this ain't even strenuous\nTwista\n\n[Chorus - Gritz]\nHe don't do the things like I, do he?\nHe don't make you feel like I, do he? Do he?\nHe don't drive the car I drive, do he?\nHe ain't gettin money like I, do he? (Ain't do it like me) Do he?\nHe don't do the things like I, do he?\nHe don't make you feel like I, do he? Do he?\nGive a fuck 'bout how you feel nigga (feel nigga)\nShe gon' pop the thang for real nigga, nigga\n\n[Verse 2 - Twista]\nEvery second I be intimate\nEvery second I be intimate with the music\nAs I get into it and every ryhthm in the instrument\nIntelligently ignorant the way I spit it\nAdmit it, I'd be admitted into the hospital\nIf I didn't know how I spit'll be the conversation of lyricists\nCongregation'll fit with this, I'll leave you volatile\nIf you got a style you prob’ly got it from hearin Twist\nA certain section of my '97 patterns\nMy 2004 lyrics, how they copy\nCadences and mannerisms, I can tell it when I hear it\nI can tell it when I hear it\nAnd I'm never specific ’cause if I do\nA nigga gon' take it the wrong way\nI'll fuck him up for whatever he gon' say\nDependin on who he be I'm thuggin like I'm PeeWee Longway\nBlowin after a long day\nAnd I want my haze, kush\nAnd my diesel too\nHow you ain't gon' have nothin to roll up with me\nIf you gon' fuck with me if I be blowin weed with you though?\nOld fake-ass niggas, they be the reason I don't fuck with them\nAll over the dick when they see the Gucci\nI just roll one up and say rest in peace to Doe B\nBlowin for when they free my lil' brother and free Lil Boosie\nTwista\n\n[Chorus - Gritz]\nHe don't do the things like I, do he?\nHe don't make you feel like I, do he? Do he?\nHe don't drive the car I drive, do he?\nHe ain't gettin money like I, do he? (Ain't do it like me) Do he?\nHe don't do the things like I, do he?\nHe don't make you feel like I, do he? Do he?\nGive a fuck 'bout how you feel nigga (feel nigga)\nShe gon' pop the thang for real nigga, nigga", "image": "https://images.genius.com/5a82462c7648c262cd242217da588ea0.500x500x1.jpg"}], "artist": "Twista"}