{"songs": [{"title": "They Say", "album": "Be", "year": "2005-03-24", "lyrics": "[Chorus: John Legend]\nThey say \"What's happenin'?\"\nWe say the facts and if, they lie\nWe comin' back for them\nThey might say... but they don't know!\n(They say, they say...)\nThey don't knowwwww\n\n[Verse 1: Common]\nThey say a nigga lost his mind\nBut in the scheme of things I never lost a rhyme\nThe thin line between love and hatred\nI'm the black pill in the Matrix, the saturated life\nThey say life is what you make it\nSo I wait quick on a spaceship so I can take it\nAs high as the stakes get when paper get low\nI be tellin' Derick, \"Tell Cara get us a show\"\nLittle Com, I make righteous bitches get low\nThe richest man ain't necessarily the nigga with dough\nThey say \"You ripped\" \"Wow...\" Yea, that's what they say\nMy niggas couldn't tell it was me, like Jamie in Ray\nPaintin' a day, wit focused crime, broads, and good wine\nThey say \"Dope is sour so it's homework and hood crimes\"\nI stood mine, for forever and a day so goodbye\nThey never could say - tell 'em, J\n\n[Chorus: John Legend]\nThey say \"What's happenin'?\"\nWe say the facts and if, they lie\nWe comin' back for them\nThey might say... but they don't know!\n(They say, they say...)\nThey don't knowwwww\n\n[Verse 2: Kanye West]\nAhh... The sweet taste of victory\nGo head and breathe it in like antihistamine\nI know they sayin' \"Damn, Ye snapped with this beat!\"\nFuck you expect? I've got a history\nGroupie love now, gotta be them wheels!\nHaters back down, gotta be that steel!\nI know they can't wait till ya outta ya deal!\nLook how they did D'Angelo ask him how do it feel!\nMy best friends worry bout me\n'Cause they know when you famous\nAnd you had made cash\nThe media aims at us\nAnd you be up so high\nIf you ever fall off, it feel like a plane crash\nBut God don't ever give me nothin' I can't handle\nSo please don't ever give me records I can't sample\nSo I could vacate where it ain't no channels\nBut it's quite okay for a gangsta to wear sandals\nThey say because of the fame and stardom\nI'm somewhere in between the church and insane asylum\nI guess it's messin' with my health then\nAnd this verse so crazy when I finish\nI'm just gon' check myself in - again\n\n[Chorus: John Legend]\nThey say \"What's happenin'?\"\nWe say the facts and if, they lie\nWe comin' back for them\nThey might say... but they don't know!\n(They say, they say...)\nThey don't knowwwww\n\n[Verse 3: Common]\nThey say \"Dude think he righteous\"\nI write just to free minds, from Stony to Rikers\nAmongst the lifeless, in a world crazy as Mike is\nOn my paper, whether its weed or Isis\nThey say \"life is a game,\" so I play hard\nWritin for my life 'cause I'm scared of a day job\nThey say \"Sef kept the hood together\"\nI tell the young, \"We can't play the hood forever\"\nPlay my cards right, they say I went too left\nThey showed me strange love, like I was Mr. F\nPlayed chess in this game of, pawns and knights\nNow I claim \"King\" like Don, or Frank White\nThey say my life is comparable to Christ\nThe way I sacrificed, and resurrected, twice\nThey say \"The crochet pants and the sweater was wack\"\nSeen the corner, now they say \"That nigga's back,\" uh\n\n[Chorus: John Legend]\nThey say \"What's happenin'?\"\nWe say the facts and if, they lie\nWe comin' back for them\nThey might say... but they don't know!\n(They say, they say...)\nThey don't knowwwww", "image": "https://images.genius.com/af231bd3cefe10a3d898842a54af3d3f.1000x1000x1.jpg"}], "artist": "Common"}