{"songs": [{"title": "Toss It Up", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Segue from \"Hail Mary\"]\n\n[Intro: 2Pac]\nThe money behind the dreams\nMy right hand, my other Capo in this big motherfuckin' war we got\nMy other Capo in this big-ass\nConglomerate called Death Row\nSnoop motherfuckin Dogg, Tha Doggfather\nAnd who we hear comin' through right now?\nMakaveli the Don\nFeel this, Killuminati\n\n[Verse 1: 2Pac]\nLord have mercy, father help us all\nSince you supplied your phone number, I can't help but call\nTime for action, conversating, we relaxing, kicking back\nGot you curious for thug passion, now picture that\nTongue-kissing, hand full of hair, look in my eyes\nTime to make the bed rock, baby look how it rise\nMe and you moving in the nude, do it in the living room\nSweating up the sheets, it's the Thug in me\nI mean no disrespecting when I tongue-kiss your neck\nI go a long way to get you wet, what you expect?\nLate night, hit the highway, drop the top\nI pull over, getting busy in the parking lot\nAnd don't you love it how I lick your hips and glide?\nKiss you soft on your stomach, push my love inside\nGot you lost in a love zone, stuck in the lust\nI got the bedroom shaking, back-breaking\nWhen we're tossing it up\n\n[Verse 2: Danny Boy & Jojo]\nFeel this baby, I like the way it's going down\nWhen nobody's around, slip-slide ride\nGiving me that nice smile\nFemale I like, what I want to give all night\nYou and me alone, everybody's gone, toss it up\nBaby let's get it on!\nI like the way you please me, baby\nThe sexy way you tease me, shorty\nThe way you move your body\nIt really drives me crazy\nYour body hypnotizing, your smell is so exciting\nSo baby come on home with me\nI like the way you give it to me, baby\n\n[Chorus: Danny Boy & JoJo]\nI like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\n\n[Post-Chorus: Danny Boy & JoJo]\nPlay on, play on, play on, play on\nPlay on, play on, play on, play on\nPlay on, play on, play on, play on\nPlay on, play on, play on, play on\n\n[Verse 3: K-Ci & Aaron Hall]\nOh, it's K-Ci baby, mmm, that want you lady\nOh, don't act so shady\nBaby, your taste as fine as gravy\nThe way you move that thing\nYou make me wanna sing\nGirl, you make my bells ring\nMake them go ting-a-ling!\nNasty man, I'm here again\nDon't want it to ever end\nIt's feeling too good\nGimme some more, oh lady, lady\nYour body the kind I like, a\nBig booty, titillating delight\nBack it up, yo, let me in there\nToss it up for me\n\n[Chorus: K-Ci & Aaron Hall]\nI like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\nI like the way you give it to me\nLet me see you toss it up\nSo won't you play on\n\n[Verse 4: 2Pac]\nHow do you want it? What's your phone number? I get around\nCali Love to my true Thugs, picture me now\nStill down for that Death Row sound, searchin' for paydays\nNo longer Dre Day: arrivederci!\nBlown and forgotten, rotten for plotting child's play\nCheck your sexuality, as fruity as this Alizé\nQuick to jump ship, punk trick, what a dumb move\nCross Death Row, now who you gonna run to?\nLaugh at you suckers 'cause you similar\nPretending to be hard, oh my God, check your temperature\nScreaming \"Compton\", but you can't return, you ain't heard?\nBrothers pissed 'cause you switched and escaped to the burbs\nMob on to this new era, 'cause we untouchable\nStill can't believe that you got 'Pac rushing you\nUp in you, bless the real, all the rest get killed\nWho can you trust? Only time reveals\nToss it up\n\n[Outro: 2Pac, K-Ci & Aaron Hall]\nOn and on, yeah, and on\nLet me see you toss it up (Toss it up)\nWon't you toss it up (Yeah, no doubt)\nWon't you toss it up, yeah (Let me see you toss it up)\nPlay on player, play on\nYeah (Let me see you toss it up)\nLet me see you toss it up\nHow can some non-players do a song about tossing it up\nAnd then want to do a player song?\n(You so fat, you and Lil' Kim need a weight scale to lay down in bed\nWe are not little kids, you fat ass, you feelin' threatened)\nHow can non-players do it? (You know who I'm talking bout)\nTeddy Riley, who? Puffy? who?\nPuffy, I read your little interview buddy, c'mon\nYou still ain't touching us, all that peace talk\nI don't care if you kiss my ass from here to across the street, boy\nIt's on! Toss it up, we took you on\nAnd we took y'all beat (Toss it up)\nYou know who beat we took, and we took y'all beat\n'Cause you wasn't rocking it right! (Toss it up now)\nTired of suckers rocking beats that don't belong to them, toss it up, it's on, it's out there now, it's our beat now\nYeah, toss it up now!", "image": "https://images.genius.com/a56fe8dfeaff5da83b79b138df0d1092.600x595x1.jpg"}], "artist": "2Pac"}