{"songs": [{"title": "Dogg House", "album": null, "year": null, "lyrics": "Dogghouse\nGimme some of that G shit Goldie Loc\nYeah, that's what I'm talkin' 'bout\nYeah, check this out y'all, uh huh huh\nWe got Snoop Dogg in the house tonight with the homeboy Tray Deee\nWaniac, Trip Loc and Goldie, 4 Tay from the bay, what you say\nWhat you say, huh?\n(We do this like everyday)\nWe got Snoop Dogg in the house tonight with the homeboy Tray Deee\nWaniac, Trip Loc and Goldie, 4 Tay from the bay, what you say\nWhat you say, huh?\n(We do this like everyday)\nDid ya get the dank, did ya get the dank?\nYeah, I got the dank, you got the gas in the tank?\nV.I.P. status, don't need an apparatus\n'Cuz the niggas I fuck wit, they all about the cabbage\nDown in yellobrick road my destination, the DoggHouse\nToastin' Remy's, fillin' jimmies, we goin' all out\nLookin' for the wizard, creepin' through the fog\nGot some bad ass bitches, headed to the player's ball\nThey gon' be strippin' and wigglin' ass\nHope you brought your play a pass\nTray Dee, Goldie half dead, the twins blaze sacks\nBigger than big everyday in L.A\n4 Tay representin' for the whole damn yea, Beeyotch\nDoggHouse, turnin' it out, and if you ain't dope you got to get\nThe fuck out, that's on the O G D P\n(Say what)\nAnd that's how it is when you fuckin' wit me\nDon't matter how you come, use all angles\nTies become tangled when the cutthroat strangles\nMy hookup, long rangers\nBetter float like a nationwide sky pager\nThem hoes save us, talk about being play as\nOn the real we can deal wit you play a haters\nWe hit the spot, every city got a block\nWhat you making when you take it to a different type of level that it pops\nKnow the Dogg keep the hip rocks, steady banging\nHoes steady sang in from the gang that we claiming\nYo, it's Waniac, the maniac\nTrip Loc, won't you spit that rap?\nPark my shit and jump out, I'm at the homies spot\nTo see if he floatin' with me up to the DoggHouse\nHit the weed he lightin', outside little niggas is fightin'\nThis bomb, I'm likin'\nHolla at my folks I know up in the complex\nNigga ready to ride as soon as he get dressed\nNow we ready to roll, hit the store, then the carpool lane\nOnce again it's on, big chiefin'\nRemind me of the noisiest place\nLadies all over the place, and niggas super laced\nHow we like it, saggin' in my 5 0 1\nKillin' my lungs, keeping these homies and bitches on one\nWe got Snoop Dogg in the house tonight with the homeboy Tray Deee\nWaniac, Trip Loc and Goldie, 4 Tay from the bay, what you say\nWhat you say, huh?\n(We do this like every day)\nWe got Snoop Dogg in the house tonight with the homeboy Tray Deee\nWaniac, Trip Loc and Goldie, 4 Tay from the bay, what you say\nWhat you say, huh?\n(We do this like every day)\nMan I got warrants, bad tax, still saying fuck it\nHeaded up to DoggHouse swerving in a bucket\nPuffin on some bomb from my comrade Blue\nAnd got my little bitch catch a contact too\nHouse shoes with the blue khaki suit and my locs on\nSwooping to some Soopafly, getting my smoke on\nNigga Goldie Loc got the heat on roast it\n4 Tay on the way plus the twins is posted\nBout to set it off bet it's off the hook\nStraight crooks, getting money off the books\nMaking nothing but that gangsta shit that niggas loving\nThuggin' at the house party, fuck goin' clubbin'\nDoggHouse, turnin' it out, and if you ain't dope you got to get\nThe fuck out, that's on the O G D P\n(Say what)\nAnd that's how it is when you fuckin' wit me\nLet me hear you say pimps, banks, hustlers\nLet's all get the money then murder these motherfuckers\nCocksuckers, they can't stop us\nNow put up your choppers, just in case they rolling wit them coppers\nI shut 'em down, Dogg Pound for them bitches\nI be seeing you with snitches every time I'm hitting switches\nIce skating over ditches\nI'm true to the game, plus I'm out to get them riches\nI be mobbing down the road trying to bag up my bags\nI'm saggin so hard I'm tearing up the back of my khakis\nI'm trying to reach my Dogg Dirty Red\nBut this hoe won't let me know, which way to go\nI'm moving slow\nMy chucks only come wit a hundred miles of walking\nHundred miles of running smelling funny and I'm gunning nigga\nDogg Pound gangsta crip for life\nAnd we gon party in this motherfucker all damn night\nWe got Snoop Dogg in the house tonight with the homeboy Tray Deee\nWaniac, Trip Loc and Goldie, 4 Tay from the bay, what you say\nWhat you say, huh?\n(We do this like everyday)\nWe got Snoop Dogg in the house tonight with the homeboy Tray Deee\nWaniac, Trip Loc and Goldie, 4 Tay from the bay, what you say\nWhat you say, huh?\n(We do this like everyday)", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}