{"songs": [{"title": "Get a Light", "album": "Tha Blue Carpet Treatment", "year": "2006-11-21", "lyrics": "[Intro: Snoop Dogg] + (Damian Marley)\nSay man.. lemme-lemme get a light homey (Yeah!)\nAye.. aye Timbo.. this yo' crippin cousin Snoop Dogg cuzz! (Yeah!)\nI told you we gotta get gorilla on this one right here man\nTake 'em to the zoo!\nTo the L.A. zoo, take these niggas to the L.A. zoo\nA hah! Yeah nigga.. 'bout to get..\nAin't shit crazy in here in a long time (Snoop Dogg!)\nDig this... uh..\n\n[Snoop Dogg]\nI need a light, let me step up in this motherfucker 'til I get it right\n(Get it right Dogg!)\nI need a light, let me lean, make it bright, everythang is dynamite\n(Ahhhh true!)\nBust a bitch, tryna feel like a pimp would\nIt's Snoop D O Double G, I'm in ya neighborhood\nI make it crack-a-lack, do it just like that\nTake a sip of this, nigga have a puff of that\nYou had enough of that? Yeah, give it right back\nNow lay ya head back and roll in the Cadillac\nHow we do what we do, what it is, where it's goin down.. and the\nMotherfuckers flip it\nRip it, get specific, and dip it and then they drip it\nCause you know we like to pop it cause you talkin so different\nFix your Focus and ride.. I want the bangers to bang\nOr get hyphy with my niggas up north by the Bay\nTryna twist in my whip, I got the big body Benz\nCause I'm rollin with my nephew and we smokin again\n\"Turn your music down low, man yo' shit too loud!\"\nWhat the fuck you talkin 'bout, I put my gun in yo' mouth nigga! (in yo' mouth!)\n\n[Hook: Snoop Dogg]\nNiggas better get it right\nLet me get a light, nigga let me get a light! (Get it right Dogg!)\nYeah, better get it right\nNigga let me get a light, homey let me get a light!\n\n[Hook: Damian Marley]\nTo get it tight they gotta get a light\nWell, to get it tight they gotta get a liggghhht! (Get it right Dogg!)\nTo get it tight they gotta get a light\nNo, to get it tight they gotta get a liggghhht!\n\n[Snoop Dogg]\nHip-Hop! I ball like a split end, I'm all like I been in\nI'm tryna put my bid in\nRip ride and try to keep it all hid in\nSlide to the left and let yo' G homey get in\nGloccs of Velveeta, yep I'm off the meter\nRide by and see ya with my hands on a heater\nWanna be like the O but you act like a ho\nGotta lot of Patron, with a shot of the malt\nWanna be's wanna beef like nine-ninety nine\nYou wanna battle me? You better learn how to rhyme\nBoys stop tweakin 'fore I light up the place\nWhat he say? Who you talkin 'bout? I'm right in ya face\nAye! Aye! Baby girl you know we hit the coot a lot\nMe and my nephews, yeah, we stayin true to life\nThey get the party live, Dogg is the motivator\nRockin the block socket and knockin down the player haters\nYeah nigga.. you better know, it's incredible, unforgettable\nYeah, I bet I'm slow and I bet I'm low\nWe at the L.A. zoo, I'm whylin out like an animal!\n\n[Hook] + [Hook]\n\n[Snoop Dogg] + (Damian Marley)\nLemme get a light nigga! (Snoop Dogg and Jr. Gong)\nLemme get a light man! Real talk man..\nIt's yo' uncle, Snoop D O Double G, bangin down yo' do' with my nephew Timbo! (Yeah!)\nYou know how we be! I.. indo, ooohhhwee, somethin brand new.. y'know what I mean?\nGet it right nigga! (*\"Get it right Dogg!\"*} Real spit cuzz...\n\n[Hook] - 2X\n\n[Snoop Dogg over Hook]\nBeatin down yo' do' for the '06\nComin back with some gorilla shit\n\nBeatin down yo' do' for the '06\nComin at you niggas with gorilla shit\nYeah nigga.. some gorilla shit\nYo... see ya!\n(Get it right Dogg!)\nWest, west y'all! {*echoes*}", "image": "https://images.genius.com/9eeff8d4aa3579798c6d6f74d21fad47.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}