{"songs": [{"title": "Scary Movies", "album": "Nuttin’ to Do / Scary Movies", "year": "1999-10-01", "lyrics": "[Intro: Eminem + (Royce Da 5'9\")]\nWhat's your favorite scary movie?\nYo, Slim Shady (Yo, Royce 5'9\")\nY'all wanna make a movie? (What, what?)\nWe got the film right here\n\n[Verse 1: Royce da 5'9\"]\nYeah, I'm one of them pretty rappers\nBuck if I really have to, I really slap you\nKing of Detroit, who they namin' the city after\nScandalous partners whose grammar hammers the hard shit\nInto your heart with content, yo, who wanna start with?\nExpert, Bad & Evil is comin' soon\nMCs get stuck, head first back in they mother's womb\nThis shit is written, in my eyes I'm the illest MC spittin'\nLeavin' all of you cats shittin' kittens\nI gotta diss you, my niggas be cockin' pistols\nShot and split you, fuck splittin' the profits with you\nSix percent of y'all niggas is just pretend\nCliques with clits, pussy niggas stink with dicks\nNiggas act bully and blast for the fast penny\nMy auto is fully, plenty of niggas packin' semi\nSpeak darts — yo, you get paid?\nRhymin' about it is the sweet part\nYou can't be street smart with a cheap heart\n5'9\", a street nigga with deep feelin'\nI keep illin', my steez willin' to keep killin'\nFuck rap! A lot of y'all all is just acts\nTrust that, you rhyme all wack on rough tracks\nBust and then we all black when you get bust back at\nFuck that, you get blast at, you get laughed at\nAnd I'ma spit thunder, stick to my guns\nNiggas is finished before they gimmicks: one-hit wonders\nWhat? Big balls, that's why when I spit, your clique stalls\nI'm a pitbull, I'm just dog, I'm just raw\nSplit y'all, holler, \"It's on!\" – then I diss y'all\nAll of y'all niggas get pissed on claimin' you pissed off\n\n[Hook: Eminem & Royce Da 5'9\"]\nY'all want drama? Wanna make a scary movie?\nRappers comin' in with their team and carry toolies\nYou can jump right out of the screen and barely move me\nWe hard-hittin', directin' and starrin' in it\nY'all want drama? Wanna make a scary movie?\nRappers comin' in with their team and carry toolies\nYou can jump right out of the screen and barely move me\nWe hard-hittin', directin' and starrin' in it\n\n[Verse 2: Eminem]\nThe one man on the planet that'll drive off of the Grand Canyon\nHop out of a Grand Am and land in it handstandin'\nAny man plannin' to battle'll get snatched outta his clothes\nSo fast it'll look like an invisible man standin'\nI'm headed for Hell, I'd rather be dead or in jail\nBill Clinton, hit this — and you better inhale!\n‘Cause any MC that chooses to go against me\nIs gettin' taken advantage of, like Monica Lewinsky (Leave me alone!)\nCame home in a frenzy, pushin' a ten speed\nScreamin' to Aunt Peg\nWith three spokes stickin' outta my pant leg\nFuck a headache! Give me a migraine, damn it, I like pain\nYou should be anywhere that a mic ain't\nYou rap knowin' you wack\nYou act up and I'm throwin' you down a flight of steps\nThen I'm throwin' you back up them\nIf they don't like the track, fuck 'em! The rap struck 'em\nHarder than gettin' hit by a Mack truck and then backed up on\nAnd any half-assed known rapper to trespass\nBetter be ready for the second Celebrity Deathmatch\nSo tell the medic to bring the medication and quickly\nI'm sicker than a 2Pac dedication to Biggie\nI'm free-fallin' feet first out of a damn tree\nTo stampede your chest 'til you can't breathe\nAnd when I'm down to my last breath\nI'ma climb the Empire State Building\nAnd get to the last step and still have half left\n\n[Hook: Eminem & Royce Da 5'9\"]\nY'all want drama? Wanna make a scary movie?\nRappers comin' in with their team and carry toolies\nYou can jump right out of the screen and barely move me\nWe hard-hittin', directin' and starrin' in it\n\n[Outro: Eminem + (Royce Da 5'9\")]\nBad, the Bad (Uhh, when the Bad meets the Bad, yo)\nThe Evil (Take the Evil with the Evil)\nPut 'em together (What? Nine-nine)\nTwo times, Slim Shady, Royce da 5'9\"", "image": "https://images.genius.com/ea6b18623746fe7fa4ec54a079b99a0b.600x600x1.jpg"}], "artist": "Bad Meets Evil"}