{"songs": [{"title": "N.O. Nigga", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nDrought 3 (Yeah)\nAin't shit safe\nHahaha (Bitch)\nOh Streets, Snack, let me get 'em\nYeah\n\n[Hook]\nYou know we strap all day and ride all night\nThis is the life of a, the life of a\nN.O. nigga, N.O. nigga, N.O. nigga\nYou know nigga\nSince the hurricane came, shit ain't been right\nIf you visit my city you could lose your life in the\nN.O., nigga, N.O., nigga\nN.O., nigga, N.O., nigga\n\n[Verse]\nCome fuck with this flow, nigga, not my flow, nigga\nNo nigga, no young, no old nigga\nI'm cold, nigga, ice cold, nigga\nGod flow, I spit Bibles, nigga\nRifles, nigga, chop-chop, bitch\nYou pop and lock it and my gun'll lock and pop, bitch\nMy shit poppin', like I'm Chris\nNo Chris Brown, bitch, this Uptown, bitch\nThat Uptown shit, like, what now\nShut up and shut down, bitch, now sit down, bitch\nWe gets down, bitch, now sit down, bitch\nDon't make a sound, bitch, like a clown, bitch\nThat red dot cover ya nose like a clown, bitch\nSo don't run 'cause I'mma gun you down bitch\nBitch, don't I smell, don't I sound rich\nI'm like Stunna, I'm blowin Out the Pound, bitch\nI don't need help, I ain't gon' drown, bitch\n'Cause in the pool, I'm on the ball, like the round tip\nYeah, Eight-ball, side pocket\nI leave the club with two bitches in my pocket\nNaked pictures to my Sidekick\nTell ya bitch quit sending them pictures to my Sidekick\nAnd quit instant messaging my IM\nMyspace Tom, them bitches acting like I'm him\nAnd fuck the best, nigga I'm him\nBitches wanna fuck like they're me and I'm them\nYeah, they share me like oxygen\nI got game within the game I got 'em in\nI'm talking championship rings, I gotta win\nWe talking championship rings? I got ten\nI'm on my champion shit, man, it's looking slim\nFor them, ha\n\n[Hook]\nNow pack y'all K's, and leave y'all knives\nThis is the life of a, this is the life for us\nGorillas, coke dealers\nDope dealers, we go-getters\nA body today and a body tonight\nThis is the life, nigga, this is the life of a\nN.O. nigga, that 5, nigga\nThat 0, nigga, that 4, nigga", "image": "https://images.genius.com/82588434bc5c5032b1e49dee6403c736.1000x1000x1.jpg"}], "artist": "Lil Wayne"}