{"songs": [{"title": "Jump Biatch", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Verse 1]\nWhat's up it's glad to meet you, you say yo' daddy beat you?\nPour out your heart, before you start let me grab some tissue\nOkay, here you go, now let it go\n(I wanna die!) Listen here pathetic ho\nWant us to kill him for you? (No) I got some pills, you want 'em?\n(Uh-uh, I don't need 'em) Ah, aiyyo I feel you want 'em\nThey called happy pills, here, swallow 'em up (okay)\nThere's some water right there, go 'head gobble the cup\nThat was Bacardi, wasn't it? It starts the party, doesn't it?\nI know your mind is like \"no,\" but your body's lovin it\n(What's the pot for?) Aren't you hot whore?\n(Yeah, kinda) Come with me to the top floor\nWatch your step there (let's go, I'm scared!)\nOf what?! All this fresh air?\nTired of beatings by your stepdad crackhead?\n(Yeah) All you gotta do is jump over that ledge (okay)\n\n[Hook]\nJump bitch, jump bitch, jump bitch, jump bitch\nJump bitch, jump bitch, jump bitch, jump bitch (juuuuuuuuump bitch!)\nJump bitch, jump bitch, jump bitch, jump bitch\nJump bitch, jump bitch, jump bitch, jump bitch (juuuuuuuuump bitch!)\n\n[Verse 2]\nWhat is you scared of? It could be worse\nI tell you what I'd jump too if you go first\n(Would you do that really?) Nope, that's no lie\nCross my fingers and hope that you die (okay)\nFuck this world bitch, let's get it over with (what?)\nPlus I'm soberin and I can feel how cold it is (brrr)\nYour daddy rape you too, what did he make you do? (this)\nNo shit, shit demonstrate on Mr. Proof\nOh it feels great, yo it's real late\nAnd when you jump, yo try not to hit them steel gates (okay)\nInch you on the edge, now just move your legs\nWhat's the matter? (Proof, I can't!)\nDo it the easy way, load a gun and go to high school (mm-hmm)\nOr jump cause nobody in the world likes you *gasp*\nI've done it twice already, look I'm alive\n(Really?) Yeah just think of a swan and dive (okay)\n\n[Hook]\nJump bitch, jump bitch, jump bitch, jump bitch\nJump bitch, jump bitch, jump bitch, jump bitch (juuuuuuuuump bitch!)\nJump bitch, jump bitch, jump bitch, jump bitch\nJump bitch, jump bitch, jump bitch, jump bitch (juuuuuuuuump bitch!)\n\n[Verse 3]\nYou startin to bore me Lori, got people waitin for me\nAnd you scared to jump a little fuckin fourteen stories?\nThe fuckin nerve of you (I'm sorry Harry!)\nIt's too late, I hate you, don't even bother Sherry!\n(My name is Nikki though) Bitch, what's the difference?\nCut the small talk, and let's conduct some business\nGet to fuckin jumpin, or I'm pushin somethin\nI'd call a lifeline but my cell phone wouldn't function\n(The E punched in!) Do you see somethin? (yeah)\nThere's your boyfriend on the edge, you should be huggin (hey)\nYou wanna kiss him, go and feel his ass\n(I want to!) Three seconds later you feel some grass\nSee I'm not scared to stand up here\nNow come on and hold my hand up here\n(Do I wanna die? The answer's in my head)\nBitch quit thinkin, look I'm dancin on the ED-AHHHHHHHHHH.. (damn!)\n\n[Hook]\nJump bitch, jump bitch, jump bitch, jump bitch\nJump bitch, jump bitch, jump bitch, jump bitch (juuuuuuuuump bitch!)\nJump bitch, jump bitch, jump bitch, jump bitch\nJump bitch, jump bitch, jump bitch, jump bitch (juuuuuuuuump bitch!)", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}