{"songs": [{"title": "World Wide Mob Figgaz (OG)", "album": null, "year": null, "lyrics": "[Goodfellas sample]\n\"For us to live any other way was nuts. Uh, to us, those goody-good people who worked shitty jobs for bum paychecks and took the subway to work every day and worried about their bills were dead. I mean they were suckers. They had no balls. If we wanted something, we just took it. If anyone complained twice they got hit so bad, believe me, they never complained again.\"\n\n[Verse 1: Big Syke]\nPicture me soundin' like the world wide mob figure\nWhoo-riders this Syke, call me that nigga\nThe wigga, connection flex from Ingle-Watts to Texas\nRidin' coast to coast heated in a Lexus\nOut the gutter, born to smuggle\nK-ball sag so much you can see my drawers\nLet me ball if I can, I know I can-can\nIf somebody ask you tell 'em that you the man\nCongregation expand across thug lands\nBuilt an army, so don't ever try to harm me\nSucka free, suga flee, want it be\nPlease stay the hell away from me\nI don't want to cheat no mo'\nBut you did when yo ass was broke and po'\n\n[Goodfellas sample]\n\"[Anthony:] Tommy, no, you got it all wrong —\n[Tommy:] Oh, oh, Anthony. He's a big boy, he knows what he said. What did ya say? Funny how?\n[Anthony:] You're right\nHenry: Just —\n[Tommy:] What?\n[Henry:] Just, ya know, you're funny\n[Tommy:] You mean, let me understand this, 'cause, ya know maybe it's me, I'm a little fucked up maybe, but I'm funny how? I mean funny like I'm a clown? I amuse you? I make you laugh, I'm here to fuckin' amuse you? What do you mean funny? Funny how? How am I funny?\n[Henry:] Just... you know, how you tell the story — what?\"\n\n[Verse 2: E.D.I. Mean]\nNow when you say, \"world wide,\" please understand it\n'Cause we got a whole nation of homies and Outlawz that we mash with\nCash respect, in a large abundance and the G's I roll\nCome with the game to maintain the funk gets\nHandle [?] soldiers dismantle the road of this\nWhat happened to the women's who be jaw jackin'?\nPaper stackin' is accomplished by putting out bomb shit\nOn top of our game is where we stay forever poppin'\n\n[Scarface sample]\n\"[Ribera:] Just remember, last year this time we were in a fucking cage, okay?\n[Montana:] You remember. I like to forget that\n[Ribera:] I say be happy with what you got, You be happy\n[Montana:] Me, I want what's coming to me\n[Ribera:] What's coming to you?\n[Montana:] The worId, chico, and everything in it.\"\n\n[Interlude: 2Pac]\nWorld wide motherfucking mob figures\nWeed smoking, gun toting, drinking\nRiding on our motherfucking enemies\n\n[Reservoir Dogs sample]\n[Nice Guy Eddie:] Have you lost your fuckin' mind?\n[Mr. White:] Joe, you're making a terrible mistake. I'm not gonna let you make it\n[Mr. Pink:] Come on, guys! Nobody wants this! We're supposed to be fucking professionals!\n[Nice Guy Eddie:] Larry, look. It's been quite a long time. A lot of jobs. There's no need for this, man. Let's just put our guns down, and let's settle this with a fuckin' conversation\n[Mr. White:] Joe, if you kill that man, you die next. I repeat If you kill that man, you die next.\"\n\n[Verse 3: Kastro]\nEver since a tod it been evident to me\nRunnin' the block would be heaven sent and very relevant\nThat was better then, that's a won't be, never now\nDon't be jealous now, I'm on a world wide level\nBeing told it's on after I flow across the globe\nMobbin' like Robin Hood, for my gold, like it's Oak\nI hold my load down all the way like the brown\nWorld wide mob figure on a ride me and my niggas clown\n\n[Reservoir Dogs sample]\n\"[Mr. Orange:] What happens if the manager won't give you the diamonds?\n[Mr. White:] When you're dealing with a store like this, they're insured up the ass. They're not supposed to give you any resistance whatsoever. If you get a customer, or an employee, who thinks he's Charles Bronson, take the butt of your gun and smash their nose in. Jumps right into the floor. Everyone jumps. He falls down screaming, blood squirts out of his nose, freaks everybody out, nobody says fucking shit after that.\"\n\n[Verse 4: 2Pac]\nKnown for doing scandalous deeds, no handlin' me\nAnd nah, it ain't the drugs, it's the straight thug nigga in me\nI swoop down and cause havoc\nMy rapid delivery is automatic, lettin' niggas have it\nI've been labelled as a thug nigga\nSince they don't sell my shit to white folks\nShip it to the drug dealers\nAnd catch a—catch a nigga world wide\nA fuckin' mob figga West coast, who-ride\nWhen we rob niggas money make my squad bigger\nBut we ain't sell our souls\nBustin' on my enemies, murder my foes\nAt my shows I'm a nut, lights camera time for action\nNow get to clappin' to my cuts, a world wide mob figga", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}