{"songs": [{"title": "Jump", "album": "M.I.C. (Make it Count)", "year": "2004-10-26", "lyrics": "[Intro]\nYou know I really don't get it\nMotherfuckers\nAct like they want me in the game one minute\nOut the game the next minute\nFuck do ya'll want?\n\n[Female Singer]\nFirst you want me in\nThen you want me out\n(Ya'll niggas is too fickle)First you want me in\nThen you want me out\n\n[Verse 1]\nYou a hop, skip, and a jump\nFrom poppin' shit to the one\nRidin' the dick of the one\nWho rides sick wit' a young\nFly chick and a gun\nInside the whip when he come\nShine lyrically dope\nMy ability stroke the Todd Bridges at those\nA fly mix with a toast\nOf my niggas who jump (jump!)\nFrom my side to run in with my enemies (punks!)\nKeep on temptin' me\nI'm just a hop, skip and a jump\nFrom goin' ballistic, so nigga go and diss if you want\nGo and mention me homie, you gon' eventually jump\nYou gon' switch when it comes to that chrome click\nAnd then one of your own hit\nYou just a hop, skip and a jump (jump!)\nFrom not listenin' to me like my shit don't exist\nTil I spit and you jump back on the dick of the one\nAccurate wit' a gun\nMathematician wit' funds\nMinus a fifth of that rum\nDivide it with the hunger\nTimes it with the times you fronted on my shit, on my dick\nIf one of them lines stick to your brain\nYou now witness the pain\nOf my addition of rain\nThe sun without the distance between\nNone of what God gave you\nThe shade is now taken away, today\n\n[Female Singer]\nDo you want me in?\nDo you want me out?\n(Just like pussy)\n(You remind me of a cunt)\nDo you want me in?\nDo you want me out?\n\n[Verse 2]\nI'm just as underground as it gets\nYou can come down in this ditch\nI'm hidden a mile deep\nThe mummy without stitchin' but I don't sleep, I pump\nWithout snitchin, I'm simply about gettin' this money\nI don't just dive in to what would be my end if I jump\nThe politics of this game\nNiggas be followin' names\nThey ride with who the hottest, and criticizin' the same\nYou lil' Nas's and Jay-Z's, we got on the scene\nNot only make me wait for the remix, but sick\nMake me squeamish\nMake me think later that one of ya'll can be who the fake king is\nOne of ya'll can be on the good label of Push\nFive mics in the Source cuz of who pulled a favor\nArrogant as a fuck, and you may have been just as humble\nTo now fussin' bout who, sharin' the cover this month\nMan please\nThis nigga's diseased comin' wit' better throwaway rhymes\nThen every one of your keepers, punks (punks!)\nDo you listen at all?\nIt's fools that's winnin battles bought by the label, on cable\nAnd never gettin' the call\nTen tapes at a time, you send it off to the label\nAnd wait at the mailbox\nWhile they make up they minds\n\n[Female Singer]\nDo you want me in? (Yeah)\nDo you want me out?\n(Ya'll try me, knowin' that ya'll niggas is punks)\nFirst you want me in\nThen you want me out\n(Yeah!)\n(Is this what you want?)", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}