{"songs": [{"title": "Life in the Fast Lane", "album": "Grip It! On That Other Level", "year": "1989-03-12", "lyrics": "[Scarface]\nLife in the fast lane, no time for the slow\nSome people slang 'caine, thinkin the money'll flow\nBut brothers gangbang, robbin people for dough\nGet out the chain gang, or your freedom'll go\nStand on the sidewalks, with a fistful of crack\nWatchin the guys talk, your boys watch your back\nThis game is dangerous, you're livin in fear\nYou pack a 9 for insurance to give the geekers a scare\nHe needs a 20, sell him a 10 and a half\nAnd he'll be fiendin and dreamin you'll take his 20 and laugh\nContinue slangin, makin all you can make\nYou hear a {*sirens*} that's the laws-gotta break\nHop in the Beemer, and roll up the glass\nYou put your car in reverse to make your getaway fast\nNow they're suspicious - how could he be clean?\nHe packs a beeper, drives a Beemer, and he's only 19\nYo let's harass him, to see what he's got\nWhat started off as a game ended the lives of 2 cops\nLife in the fast lane\n\nAnother hot spot, you screech to a halt\nYo look what I've got, then reach for the wall\nThey find the product, and the cops'll say OHHHHHHH~!\nThey'll put your butt in the bump\nRoll to the station, yo captain whassup?\nI caught this brother on the cut, we gotta lock his butt up\nStraight to the jail cell, no 9 or a clip\nAnd the ones you triple-crossed'll want revenge so get hip\nOut in an hour, on your way to the pad\nA copper starts to trail you, now you're sweatin bad\nTurn on his flashers, you stop Tommy Tucker\nHe stuck his head in the window so you shot him like a sucker\nFell to the pavement, blood pourin on the cement\nThere's witnesses standin by and you knew that he seen it\nBack on the run again, and the boys on your block\nWas blabbin all to the cops about the people you shot\nDid you get nervous, well why continue your route?\nWhen you know that normal folks don't chill with blood on their suits\nTook off his jacket, flung to the back\nGrabbin a pull from the pack, I gotta break I' get back\nRight to his rock spot, before the brother got shot\nHe tried to sell 2 ki's to Tony that was filled full of sheet rock\nBumped off~! They ain't let him slide\nNow his family's tryin to figure out the reason he died\n... But that's the name of the game\nWay he died was a shame, pushin 'caine\n... ... Life in the fast lane\n\nI remember fast times, sellin dope was my pastime\nLife in the fast lane, while countin cash I'd\nSit back and wonder, what would become of me\nThe fiends would see the Beemer comin, and then they'd run to me\nStep out the vehicle, yo what you need Joe?\nI need a 20 and a nickel bag of weed bro\nMake the sale then I'd bail out\nNow it's time to get the hell out\nEvery day was the same thing, dopefiends named me\nBig Crack Ak cause I sold 'caine mainly\nOut of the big I had the biggest\nRocks on the block, so check it out yo money dig this\nIt was the purest in the rock form, the only way I sell it\nNo cuts, uh-uh, no B-12 to swell it\nI got lucky made it out of the game\n... Life in the fast lane", "image": "https://images.genius.com/70353434f413cc254d7d1bea0c45a23e.320x313x1.jpg"}], "artist": "Scarface"}