{"songs": [{"title": "Want My Love", "album": "Back to the Basics", "year": "2013-12-10", "lyrics": "[Hook: DJ Victoriouz x4]\nGirl I know you want my love (want my love)\nGirl I know you need my love (need my love)\n\n[Verse 1: Twista]\nNow, everything that I want in a woman\nWhen I be lookin' at her body and her mind that's you\nMe bein' able to give you what you want or what you need\nWhen I'm becomin' a love, that's true\nPlease pose because when you do that\nI know I could never say that the romance is through\nD. Rose when I be comin', the whistles send you to a victory of an orgasm too\nHave her with me when I kick back\nWhen she roll one, I lit that\nShe a cold one the way she lick that\nWhen I hit that she hit back, AOWWW!\nWhen I give it to her how she wanna get it'll be the way to make her crazy\nAnd every time that she see me on the TV screen she like \"There go my baby\"\nCause I be fuckin' her, she like the way I'm freakin' her, how I'm freakin' her\nI'm the one I know she wanna be with\nMake the call, what time you want me to pick you up? (you up)\nTell him you got somethin to do when I hit you up - because\n\n[Hook: DJ Victoriouz]\n\n[Bridge: DJ Victoriouz x2]\nGirl I know you want it, girl I know you want it\nGirl I know you need it, girl I know you need it\n\n[Verse 2: Twista]\nHow I'm mackin' you could tell that I want yours\nI can see that it's obvious that you want mine\nThis could be reality far from folklore\nWhen I look at your body and you be so fine\nLike a coke line, the way she after me gotta be somethin else I could tell she addicted\nAll on me like an methamphetamine but a better fiend\nShe was thick as hell so we kicked it\nShe became a follower, but she was a swallower\nGot up with her cause I wanna see when she go bottoms up\nThe way she turn her bottle up - oh you a nasty girl\nAnd you know that I'm the same way, and you like that shit, so don't give up\nCause we gon' fight, and we gon' fuck\nYou ain't goin nowhere because\n\n[Hook: DJ Victoriouz]", "image": "https://images.genius.com/5a82462c7648c262cd242217da588ea0.500x500x1.jpg"}], "artist": "Twista"}