{"songs": [{"title": "Still Ballin’ O.G.", "album": null, "year": "1995-12-18", "lyrics": "[Intro]\nStraight motherfuckin' ballin'\nPart two, still ballin'\nKurupt up in this motherfucker\nWestside!\n\n[Verse 1: 2Pac]\nNow ever since a nigga was a seed\nOnly thing promised to me was the penitentiary, still ballin\nRidin' on these niggas 'cause they lame\nIn a 6-1 Chevy, still heavy in this game—can you feel me?\nBlame it on my momma I'm a thug nigga\nUp before the sun rise, quicker than the drug dealers\nTell me if it's on, nigga then we first to bomb\nBust on these bitch-made niggas, hit 'em up, WESTSIDE\nAin't nobody love me as a broke nigga\nFinger on the trigger, Lord forgive me if I smoke niggas\nI love my females strapped, then fuck her from the back\nI get my currency in stacks, California's where I'm at - right?\nPassed by while these niggas wonder why\nI got shot but didn't die, let 'em see who's next to try\nDid I cry? Hell nah, nigga tears shed\nFor all my homies in the pen, many peers dead, nigga\n\n[Chorus: 2Pac]\nStill ballin, 'til the day I die\nYou can bring your crew but we remain true, motherfucker\nStill ballin', niggas wonder why\nYou can bring your crew but we remain true, motherfucker\nStill ballin'\n\n[Verse 2: Kurupt]\nThis for all y'all motherfuckers\nThey done did it, let the dogg out the cage\nI'm pumped dump with the gauge\nI done did it all, everywhere I go, I ball\nPrecise, keep my game tight, or for sure I fall\nI'm the invincible, and since the top principal's loot\nLike the Heat to them all, who got the heart to shoot?\nI get stitches, play the game of BB Britches\nWhen I was young, dreamin' 'bout money, fame, and bitches\nI like fat asses, fat money bags of cash in masses\nSlowly as time passes, I found nothing but money rules time and space\nAnd in this realm of thoughts\nWhere all the fucking murders take place\nAnd I'm in it to win it; I'm out to get paid\nGot all these bitches on my dick from all the money I made\nIt's a trade I've acquired, growing up inspired\nNaturally, I don't give a fuck, a murderer for hire\nStill ballin'!\n\n[Chorus: 2Pac]\nStill ballin, 'til the day I die\nYou can bring your crew but we remain true, motherfucker\nStill ballin', niggas wonder why\nYou can bring your crew but we remain true, motherfucker\nStill ballin'\n\n[Verse 3]\n[2Pac]\nNow everybody wanna see us dead\nTwo murdered on the front page, shot to death, bullets to the head\nNiggas holla out my name and it's similar to Raid\nMotherfuckers know I'm comin', so they runnin' to their graves, watch\nSwoop down with my nigga from the Pound\n'Cause Kurupt don't give a fuck, where you coward niggas now, blast\nKeep pumpin', ain't worried 'bout nuttin'\nBusters thought we was frontin', so reload and keep dumpin'\n\n[Kurupt]\nI feel heat, everywhere niggas see me up in the streets\nI don't tweak, keep a straight .38 under the seat\nMash, mission mode, my thoughts are cold\nPlots and plans for scams, money bags of gold\nRoll and collide, homicide vibes inside\nThug Life and Dogg Pound on this midnight ride\nEver since we hit the Row\nWe got stationed, with no hesitation\nMake moves, nigga, Mr. Too Smooth, the elaborate\nYou're slow like motion, focus on the money that's made\nAnd sip on this poisonous potion\nGlamour get you got, too much heat, too hot\nGet shanked, get shot indulging in this poisonous plot\nFame and fortune, fortune from game\nWeed and zags, illicit amounts of cash\nJags, its all the same, ain't shit ever gon' change\nAs long as there's money to exchange, NIGGA!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}