{"songs": [{"title": "Goodbye", "album": "Year of the Dog... Again", "year": "2006-08-01", "lyrics": "[Intro]\nLet us pray for those that we've lost\nWe know that we miss them for selfish reasons\nOh Lord my God, indeed you I put my trust\nSave me, from all them that persecute me\nAnd deliver me, in Jesus name, GRRRRR\n\n[Hook]\nCause we all go anyway, I'mma say goodbye today\nCause it could be any day, I'mma say goodbye today\nWe've grown in so many ways, but I'mma say goodbye today\nCause it could be any day, I'mma say goodbye today-ayayyyy\n\n[Verse 1]\nI'mma say goodbye today, cause I don't know when\nWe gon' cross paths again, until then\nI'mma be that, and see that, speaks the truth\nBelieve that, I'mma see that, to reach the youth\nMy suffering will not be in vain (NOT)\nNeither will yo' pain ever since you passed to hear yo' name\nRest in peace to Autumn - we all know cancer cells kill\nBut if they caught 'em, they could've fought 'em\nIf you'd still be here, right here with us\nWe'd have plenty time before death came to get us\nBUT, what is death like?  Should I really care?\nAfter looking at it, was life really fair?\nDid you burn any bridges?  Did you make amends?\nDid you ask God for forgiveness for your sins?\nWhat is Heaven like?  If you could come back, should you?\nIf you could communicate for a moment there, would you?\n... Just questions that we ask ourselves, every day (wanna know)\n\n[Hook]\nCause we all go anyway, I'mma say goodbye today\nCause it could be any day, I'mma say goodbye today\nWe've grown in so many ways, but I'mma say goodbye today\nCause it could be any day, I'mma say goodbye today-ayayyyy\n\n[Verse 2]\nSo young, so gifted\nDirection of life was uplifted, when the wind shifted\nAnd took a turn for the worse, with the blessing come the curse\nA nigga stressing took the dog into the hearse\nMy nigga Divine was way too young to die\nFell out the nest and was way too young to fly\nBut that didn't stop fate from happening\nIdle time make the Devil—HATE WHAT'S HAPPENING!\nGod no!  Why did it go that way?\nComing from his fans away, why did he go that day?\nLightly, I dare say, life goes on\nDonuts, Trey and Jerz I say, please be strong\nHe was supposed to be on the road with me\nI wish somebody WOULD'VE came to get me\nAnd niggas would've had to hit ME\nBut until then, MY FRIEND\nI'mma say goodbye today, cause you never know when\n\n[Hook]\nCause we all go anyway, I'mma say goodbye today\nCause it could be any day, I'mma say goodbye today\nWe've grown in so many ways, but I'mma say goodbye today\nCause it could be any day, I'mma say goodbye today-ayayyyy\n\n[Outro]\nGoodbye today, I'mma say goodbye today\nGoin away hey (uhh) goodbye today, I'mma say goodbye today\n(It's okay) And I say (let us pray)\nGoodbye today (and I say) say goodbye today\nGo on your way (and I say when you're, gone) I'mma say goodbye today\nI'mma say goodbye today (gotta say before you move on) HEY!\nYes (yeah!)\nI mean, this is life (yeah, say goodbye)\nWe are born, to die, so LET ME FLY! (know what I mean)\nLet me fly, we are born, to die (be good)\n{\"Sometimes the pain is too much to bear\" - repeat to end of Outro}\nCause I'm in a better place ('til we meet again)\nI'm in a better place (I don't know what form)\nSee you soon baby! (we'll meet again)\nHa ha! .. (But we will meet again)\n...\nSpread your wings (they gon' shed a tear on this one!)\nFly, I'll try not to cry, it'll be hard\nI just, miss, not having you here\nEven though I know you're in a better place!\nI just miss not having you here\nKinda selfish when you think about it\nThat's nature, that's life\nSpirit, never dies, as lessons begin", "image": "https://images.genius.com/3843bd8bdb5f681116b197d8a9226af4.300x300x1.jpg"}], "artist": "DMX"}