{"songs": [{"title": "Unforgivable Youth", "album": "Food & Liquor II: The Great American Rap Album, Pt. 1", "year": "2012-09-25", "lyrics": "[Chorus: Jason Evigan]\nThis world, my heart, my soul\nThings that I don't know\nThe icicles they grow\nThey never let me go\nScars are left as proof\nBut tears they soak on through\nThings I've done\nMy young\nMy unforgivable youth\n\n[Verse 1: Lupe Fiasco]\nWith land on the horizon and passion in their eyes and\nWhat they think are islands are much more in their size and\nBountiful and plentiful and resource to provide them\nSupplies slim, morale once so heavily inside them\nNow steadily declining\nReturn is not an option as necessity denies them\nWith this they choose to dive in\nNow along the shore and so aware of their arriving\nAre the children of this land prepared to share in their surviving\nA pageantry of feathers stands his majesty with treasure\nNot the material things of kings that could never last forever\nBut secrets of the spirit world and how to live in harmony together\nUnbeknownst to him his head would be the first that they would sever\nAnd stuck up on a pike up along the beach\nKept up as a warning to the rest to turn away from their beliefs\nAnd so began it here. And for five hundred years\nTorture, terror, fear 'til they nearly disappear\n\n[Chorus: Jason Evigan]\nThis world, my heart, my soul\nThings that I don't know\nThe icicles they grow\nThey never let me go\nScars are left as proof\nBut tears they soak on through\nThings I've done\nMy young\nMy unforgivable youth\n\n[Verse 2: Lupe Fiasco]\nWays and means from the trade of human beings\nA slave labor force provides wealth to the machine\nAnd helps the new regime establish and expand\nUsing manifest destiny to siphon off the land\nFrom native caretakers who can barely understand\nHow can land be owned by another man?\nWarns, \"One can not steal what was given as a gift;\nIs the sky owned by birds and the rivers owned by fish?\"\nBut the lesson went unheeded, for the sake of what's not needed\nYou kill but do not eat it\nThe excessive and elitists don't repair it when they leave it\nThe forests's were cleared, the factories were built\nAnd all mistakes will be repeated\nBy your future generations doomed to pay for your mistreatments\nFoolishness and flaws, greed and needs and disagreement\nAnd in your rush to have the most, from the day you left your boats\nYou'll starve but never die in a world of hungry ghosts\n\n[Chorus: Jason Evigan]\nThis world, my heart, my soul\nThings that I don't know\nThe icicles they grow\nThey never let me go\nScars are left as proof\nBut tears they soak on through\nThings I've done\nMy young\nMy unforgivable youth\n\n[Verse 3: Lupe Fiasco]\nAs archaeologists dig in the deserts of the east\nA pit a hundred meters wide and a hundred meters deep\nThey discover ancient cars on even older streets\nAnd a city well preserved and most likely at its peak\nA culture so advanced, and by condition of the teeth\nThey can tell that they were civil, not barbaric in the least\nA society at peace. With liberty and justice for all\nNeatly carved in what seems to be a wall\nThey would doubt that there was any starvation at all\nThat they pretty much had the poverty problem all solved\nFrom the sheer amount of paper, most likely used for trade\nEverything's so organized. They had to be well behaved\nAssumed they had clean energy, little to no enemies\nVery honest leaders with overwhelming sympathies\nReligions kinda complex. Kinda hard to figure out\nBut this must be the temple\nThis White House\n\n[Chorus: Jason Evigan]\nThis world, my heart, my soul\nThings that I don't know\nThe icicles they grow\nThey never let me go\nScars are left as proof\nBut tears they soak on through\nThings I've done\nMy young\nMy unforgivable youth", "image": "https://images.genius.com/379173777569ae56b01f75924aa6ba0d.500x500x1.jpg"}], "artist": "Lupe Fiasco"}