{"songs": [{"title": "Backwards", "album": "Delusions of Grandeur", "year": "2019-06-13", "lyrics": "[Intro: Gucci Mane]\nZaytoven\nGucci Mane, Gucci Mane, Gucci Mane, Gucci Mane, Gucci Mane, Gucci (Yeah)\nWizop, the Wizop, the Wizop, the Wizop, the Wizop, the (Wop)\nGucci, the Gucci, the Gucci, the Gucci, Guwop and the Gucci (Wop)\n(Hah, it's Gucci)\n\n[Verse 1: Gucci Mane]\nGod keep coverin' me with drip, I think he tryna smother me (On God)\nThey stopped me at the border, had too many felonies\nI'm splashin', I ain't even drippin' (Splashin')\nLaughin', I ain't even trippin' (Haha)\nI'm crashin', I ain't even dissin' (Crash)\nHeard you drop some', I ain't even listen\nNo one realer, triller, street gorilla\nI pull up like Chauncey Billups\nNigga don't gas me, I don't need a fill up\nPick her up and make her suck my dick 'til she hiccup\nWop lookin' slim like a bicycle rim\nBut his bank obese, and the pockets on chubby\nHe'll play head coach just like Lovie\nThuggin' in public, these hoes love it\nI double and triple, quadruple your budget\nBaseball money like David Justice (Money)\nWhole load sold, I ain't even touched it\nUnderarm kush, damn, the room so musty\nMost of you rappers all style, no substance\nBig old rocks on, they disgust me (Burr)\nNiggas talk but never touch me (Nah)\nBroke haters can't tell me nothin'\n\n[Verse 2: Meek Mill]\nFuck 'em (Who? Who? Who? Who?)\nYeah, this that Meek Mill, Gucci Mane (Gucci Mane)\nYoung niggas swingin' through F&Ns\nThey gon' come right back to you like a boomerang (Brr)\nLouis and Saint Laurent drip, ooh (Drip)\nPimp on these bitches like Pootie Tang (Pimpin')\nHe wanna beef 'bout a bitch\nBut we all fuckin' her, so he don't know who to blame\nShe wanna check from me, huh (Check)\nShe got a check for me, huh (Check)\nFuckin' the two baddest bitches off Instagram, they on that ecstasy, hey\nDiamonds like Voss, and I got the sauce, I mix up the recipe, woah\n'Fore all this rappin' shit, I was a trapper, the plug gon' invest in me, woah\nJumped off the porch, I got a Porsche\nToo many hitters, they can't extort\nI take a mil' to the table, no fork\nThen split it up with my dawg like divorce\nThey shot at us, it was by force\nWe shot at them, they went to court\nI don't wan' be with these niggas no more\nI can't even beef with these niggas no more\nShorty said she only fuck trappers (Trappers)\nEnd up fuckin' with a rapper (For real?)\nDamn, bitch, how you go backwards? (Damn)\nDiamonds on froze like Alaska (Freezin')\nThat ain't even none of my business (Business)\nPut your face down and your ass up (Face down)\nI ain't preachin' to you like the pastor\nI'ma keep runnin' these bands up, yeah\n\n[Interlude: Gucci Mane & Meek Mill]\nBands up, bands up, bands up, bands up\nBands up, bands up, bands up, bands up\nAll these diamonds on me make me handsome\nShawty fuckin' on me like a dancer\nBands up, bands up, bands up, bands up\nBands up, bands up, bands up, bands up\nWent from a trapper to rapper\nDamn, bitch, how you go backwards? (Hah)\n\n[Outro: Gucci Mane]\nWow, I thought I was proud of you, but I take it back\nYou went out sad\nWhere your whips at? Where your titles at? Huh?\nWhere your shooters at?\nThought you had a plug, but you had a scrub\nDamn", "image": "https://images.genius.com/8b154b3137c0831d0cd164369d2be084.1000x1000x1.jpg"}], "artist": "Gucci Mane"}