{"songs": [{"title": "Sleep Freestyle", "album": null, "year": null, "lyrics": "[Intro]\nYou on the internet and shit and uh... these motherfuckers be posting videos of songs like: \"Uh, oh, uh, this the motherfucking blame it on the throne freestyle\". Nigga, that wasn't a fuckin' freestyle, nigga, you pre-wrote that shit and just spitted it on a fucking camera. I don't really get why these motherfucking rappers just like... they, they don't wanna freestyle no more, it's like, you ain't got no more niggas that can really fucking spit of the top of the dome. So this nigga Left Brain gave a fucking beat, alright, i really liked this shit, I'll just fucking freestyle on it and this nigga fucking Hodgy Beats, i don't know why the fuck he's in here but he just gonna fucking nail it. So uuuhhh...\n\n[Verse 1]\nYo, (yo), yo, (yeah), yo, (yo)\nYour bitch pretty, she pretty\nAnd now she's screaming, now i fill her up with semen\nAll she see is sea man\nNow you hear her voice, no pro-choice\nNo odd pro-abortion on this boat\nBitch calm down, down\nKrusty The Clown will make you laugh\nLaugh, finger in your ass\nNow you like \"woah, hold up\nMister, I don't know your name\"\nBitch, shut the fuck up, you're on a train\nJust to death chop your body up and put it in the freezer\nBleed her\nBefore i kill her, fuck her just to please her\nNo condom, I just might disease her\nAnd if that fucking happen, fuck it\nShe'll be dead, chopped up in my motherfucking freezer\nYou can fuckin' get the vanilla, Manelly Lisa\nAlisa, here you wanna sample, nigga, try it\nKinda like a printer, nigga fire, I'm the dentist\nNiggas looking at me\nHair nappy, here's a brush\nBut she don't wanna rush\nCuz if I fucking bust, quick\nShe's gonna be pissed\nBut then I pull out, fuck, I can't have blue balls\nSo bitch start sucking my dick\nAnd then she fucking lick\nI bust up on her face, now she looking like Michael, Jackson\nJackson, now I sound like Toni Braxton\nDeep voice, motherfucker\nFuck, I had her sucking on my wrapped lollipop\nLike it's a sucker, motherfucker\n(Bitch)\n\n[Verse 2]\nBack for round two, i found you\nYou tryna run, but i found blue\nYellows over there\nAnd the motherfucking field where\nThe niggas wear colored pants, jerking, pop pills\nI'm on the other side\nWhere all the niggas ride, the niggas skate\nBut we take indy bitches with high GPAs up on a date\nWhere niggas smoke blunts and sniff coke\nWhere the motherfucking freestyles are never wrote\nOr written, i'm livin'\nNigga shittin' while i'm pissin'\nOn they face, mace\nHere you call the cops\nHere's my phone, i'll catch your case\nBut i got a good lawyer so my fucking record erase\nJust like a fucking pencil, I mental\nLeft Brain laced this instrumental, with some shit that’s so illegal, that\nHe gon have to go and fly over seas like an eagle\nIn the Winta, Decemba, Imba, Limpa\nKick him in the leg now he limpa, IMPA\nNiggas rollin round, Nipsey Hussle in the Impala\nLookin at me while I style on ya\nOh, you mad cause I’m styling on you?\nPlus the call is on me?\n4-5in on em\nGnolly tricks on ya bitch, girl-boy lookin clean cause\nYou already know my hat green, and that shit staying Supreme\nUh\nYou can’t fuck with it, you little H-B\nYou hate me, A-C, L-B, H-B\nC-V, Super 3 and Bran’doom DeShay\nWith my Nigga Domo the Gene’says, you\nHate on the O-F, that’s the best letter in the world\nAnd I’m better better, than your better girl\nShe the best I’ve ever had. I--*cough cough*\nAsthma- *cough* Fuck it, I’m coughin\nThis the re’free- *cough cough* oh shit\n*cough cough* I’m bout to hit it back. *cough.*\nI said, This the re-freestyle\nNo written\nI spit all my shit from the dome\nHome like a motherfucker nigga leavin his college, for good\nIn the Hood\nI’m from Ladera, not from Anglewood\nHawthorne couple times, go the city where I be\nEven up in Hollywood, you could find me\nI’m not a fucking cliche\nE-Shay, E, A, ohhh fuck it i’m over it\nI got work tomorrow\nLeft Brain let me get a beat to borrow\nJust so I could spit the shit quick\nBitches with some big lips, yeah she got some big lips\nA nice small tongue, for this over-sized big dick\nSize 12 in the Shoe, 32 in the jeans\nSkinny as fuck motherfucking t-shirt a 2X, yes\nAnd you could ask anybody here that’s daily\nBitches feel me, fucking iPods wanna play me\nAsk me why I cuss so much\nFuck, shit, cunt and dick\nNow shut the fuck up bitch\nEat a fucking dick in a blanket\nI be on that stank shit\nFuck everybody here\nWhat the fuck I look like thankin'?\n\nOhh shit, the beat ended, fuck", "image": "https://images.genius.com/610384882ca6311db99de4fbfcdf2b46.421x421x1.jpg"}], "artist": "Tyler, The Creator"}