{"songs": [{"title": "So Ambitious", "album": "The Blueprint 3", "year": "2009-09-08", "lyrics": "[Intro: Pharrell Williams & Jay-Z]\nYeah, haha, Blueprint shit\n3 in the morning on the Westside highway\nTop down baby, fuck y'all\nThe motivation for me, it's the Blueprint baby\nIs them telling me what I could not be, oh well\nHey! Uhh, yeah, hey! Ohh! Hey! Hahaha\nAy, this a special dedication, thank y'all\nHey! I wanna thank you for the fuel, no really thank you\nHey! Y'all gotta hear this shit!\nHey! Hehehe, hey!\n\n[Verse 1: Jay-Z]\nI felt so inspired by what my teacher said\nSaid I'd either be dead or be a reefer head\nNow sure if that's how adults should speak to kids\nEspecially when the only thing I did was speak in class\nI'll teach his ass, even better's what my uncle did\nI pop my demo tape in start to beat my head\nPeaked out my eye, see if he was beating his\nHe might as well say beat it kid, he's on the list\nIt's like I'm searching for kicks like a sneaker head\nHe gon' keep pushing me until I reach the ledge\nAnd when I reach the ledge I'll tell 'em all to eat a dick\nTake a leap of faith and let my eagle wings spread\nSpread, spread\n\n[Chorus: Pharrell Williams]\nThe motivation (word up) for me\nIs them telling me what I could not be, oh well\nHey! Hey!\nI'm so ambitious (hey!)\nI might hit two sisters (hey!)\nHey I'm on a mission (hey!)\nNo matter what the conditions (hey!)\nForget personal issues (hey!)\nWhen you go what I been through (hey!)\nHey if you believe it (then be)\nThen you could conceive it (you, see?!)\nYeah, yeah, yeah\n\n[Verse 2: Jay-Z]\nI had to lace up my boots even harder\nFather is too far away to father\nFurther-more all the kids either smoke reefer\nOr either move white, there's few writers in my cypher\nSo they made light of, my type of\nDreams seem dumb, they said wise up\nHow many guys-a, you see making it from here\nThe world don't like us, is that not clear? Alright but\nI'm different, I can't base what I'm gon' be\nOff of what everybody isn't, they don't listen\nJust whispering behind my back\nNo vision, lack of ambition, so wack!\n\n[Chorus: Pharrell Williams]\nThe motivation (word up) for me\nIs them telling me what I could not be, oh well\nHey! Hey!\nI'm so ambitious (hey!)\nI might hit two sisters (hey!)\nHey I'm on a mission (hey!)\nNo matter what the conditions (hey!)\nForget personal issues (hey!)\nWhen you go what I been through (hey!)\nHey if you believe it (then be)\nThen you could conceive it (you, see?!)\nYeah, yeah, yeah\n\n[Verse 3: Jay-Z]\nHad a couple of meetings no offers yet\nMaybe I ain't good enough for these offices\nBack to the drawing board ducking officers\nIt's all good 'cause the streets is A&R'ing this\nSo with or without any of your involvement\nWe coming for all of this, respect my conglomerate\nI went from pauper to the President\n'Cause every deal I ever made set precedent\nNiggas probably thought I'd fall without old buddy (hehehe)\nOh buddy, what I do is make more money\nDear Teacher, your probably somewhere near a speaker\nI'm balling outta control, can you hear my sneakers\nFuck y'all\n\n[Chorus: Pharrell Williams]\nThe motivation (word up) for me\nIs them telling me what I could not be, oh well\nHey! Hey!\nI'm so ambitious (hey!)\nI might hit two sisters (hey!)\nHey I'm on a mission (hey!)\nNo matter what the conditions (hey!)\nForget personal issues (hey!)\nWhen you go what I been through (hey!)\nHey if you believe it (then be)\nThen you could conceive it (you, see?!)\nYeah, yeah, yeah\n\n[Outro: Pharrell Williams]\nYou see, the motivation for me\nWas them telling me what I could not be", "image": "https://images.genius.com/ff10a6a0a94d002a374623bb49818293.1000x1000x1.jpg"}], "artist": "JAY-Z"}