{"songs": [{"title": "Throw Sum Mo (Demo)", "album": null, "year": "2014-02-01", "lyrics": "[Chorus: Swae Lee]\nAss fat (uh, bust it), Yeah, I know\nYou just got cash? (Mm, bust it) Blow some mo' (word)\nBlow some mo' (bust it), blow some mo'\nThe more you spend it (yeah, bust it), the faster it go (yeah, go)\nBad bitches (bust it) on the floor (uh huh)\nIt's rainin' hundreds (bust it), throw some mo' (okay)\nThrow some mo' (yeah, bust it), throw some mo' (word?)\nThrow some mo' (yeah), throw some mo'\n\n[Verse 1: Slim Jxmmi]\nSlim Jxmmi (yeah)\nHi, bye, hater (hater), I flood the club with paper (paper)\nShorty got a ass, some for now and some for later (delicious)\nLet me sit with you (do it), dancin' like Maliah\nI'm throwin' all this money, I'ma fuck around and buy her (woo)\nI can flick the money all night 'til my wrist tired (tired)\nIf you put in work, this the night you gon' retire (yeah)\nYou a bad bitch, I ain't even gon' deny her (no)\nShe told me \"throw that money,\" I said \"make it worth my while\"\nI'm 'bout to empty out the ATM (throw it, throw it, throw it)\nShe doin' tricks that make a nigga wanna spend (blow it, blow it)\nGirl, you know you got me fascinated (uh huh)\nJust keep on dancin' 'til I'm outta paper (never)\n\n[Chorus: Swae Lee]\nAss fat (uh, bust it), Yeah, I know\nYou just got cash? (Mm, bust it) Blow some mo' (word)\nBlow some mo' (bust it), blow some mo'\nThe more you spend it (yeah, bust it), the faster it go (yeah, go)\nBad bitches (bust it) on the floor (uh huh)\nIt's rainin' hundreds (bust it), throw some mo' (okay)\nThrow some mo' (yeah, bust it), throw some mo' (word?)\nThrow some mo' (yeah), throw some mo'\n\n[Verse 2: Swae Lee]\nFranklins (hunnid) rainin' on your body (yeah)\nRainin' on your body (hunnids), rainin' on your body (yeah, yeah)\nWon't you do what I say? Start rubbin' on your body\nYou like hundreds on your body? (Hunnids on your...)\nGirl, you need to get naughty\nHold up, hold on\nHer eyes on me, is that your ho?\nIf so I'ma get her 'fore the night's over\nDJ play my shit so I'm finna crank up off in the VIP zone\nSee the money go up and she dance on sight\nBy the end of the night, she on indo\nLemme see you make it clap on tempo\nLemme see you get low like limbo (word)\n\n[Chorus: Swae Lee]\nAss fat (uh, bust it), Yeah, I know\nYou just got cash? (Mm, bust it) Blow some mo' (word)\nBlow some mo' (bust it), blow some mo'\nThe more you spend it (yeah, bust it), the faster it go (yeah, go)\nBad bitches (bust it) on the floor (uh huh)\nIt's rainin' hundreds (bust it), throw some mo' (okay)\nThrow some mo' (yeah, bust it), throw some mo' (word?)\nThrow some mo' (yeah), throw some mo'", "image": "https://images.genius.com/20aa0e429bf8b5a47f46c6ff455b8eeb.515x515x1.jpg"}], "artist": "Rae Sremmurd"}