{"songs": [{"title": "I Ain’t Coming Down", "album": "Success Is Certain", "year": "2011-08-09", "lyrics": "[Chorus]\nI'm floating away without leaving the ground, ground\nThey asking me what's it like up there? I tell 'em I ain't coming down\nI'm tryna stay up and I don't wanna touch down, down\nThey asking me what's it like up there? I tell 'em I ain't coming down\nNo no, I ain't coming down, no no, I ain't coming down\nNo no, I ain't coming down, I ain't coming down\n\n[Verse 1]\nNow that my vision's more clearer\nThis is for the hate on Royce in Detroit era\nI know y'all had a good time but that was your time\nBut that was your error, now look at you and look at me\nCompare us, you can do it easily\nThis ain't when Royce was looking stupid on that beef DVD? Uh-huh\nShout out my niggas D-Twizzy, I'll admit when I was wrong\nI remember thinking and I should probably hit my nigga Von\nYou talking shit about me at your barbershop? You obviously politicing wrong\nNiggas need to stop PMSing\nI hope y'all barbers give your ass the same hairline as me and DMX’s\nI wait from wishing Trick-Trick was gone\nFor picking which bitch that wishing I could TwitPic my home\nAnd as far my nigga Trick before we was brothers\nI think we really just need to get to know each other, I'm off\n\n[Chorus]\nI'm floating away without leaving the ground, ground\nThey asking me what's it like up there? I tell 'em I ain't coming down\nI'm tryna stay up and I don't wanna touch down, down\nThey asking me what's it like up there? I tell 'em I ain't coming down\nNo no, I ain't coming down, no no, I ain't coming down\nNo no, I ain't coming down, I ain't coming down\n\n[Verse 2]\nI gotta say this shit one time\nWhen have you ever known me to get in the way of one's grind?\nCause even when that dark cloud hovered above me\nI went from signed to unsigned, then I found my own sunshine\nNow let me say this shit one more time\nWhen have you ever known me to get in the way of your grind?\nCan you find one hip hop listener around the globe\nWho don't know that Nickel Nine is from Motown?\nThese cats say, \"He's whack\nHe ain't even from the D so why he got that D tat?\"\nThen their friends run to me like my friends\n\"Saw you cyphering on BET but he ain't like it cause you ain't have no D hat\"\nMake up your mind you whining niggas\nRyan in business schools to talk, bought shoes for shawties\nBought coats for the kids while you niggas choose to floss\nAnd y'all wanna nail who to the cross? Y'all niggas soft, I'm up\n\n[Chorus]\nI'm floating away without leaving the ground, ground\nThey asking me what's it like up there? I tell 'em I ain't coming down\nI'm tryna stay up and I don't wanna touch down, down\nThey asking me what's it like up there? I tell 'em I ain't coming down\nNo no, I ain't coming down, no no, I ain't coming down\nNo no, I ain't coming down, I ain't coming down", "image": "https://images.genius.com/7ef2ea2d0242f3b7c5b03da3554a04b1.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}