{"songs": [{"title": "Scandalous", "album": null, "year": "2019-04-09", "lyrics": "[Intro]\nUh\nAye man, this some real deal, uh\nThis London on the beat by the way, you know what I'm sayin'\nOne of my muhfuckin' producers, he got signed\nI gave him his first lump some of money, nigga\nKnow what I'm sayin', that's on God, yeah\nNow I got a lot of 'em\nAnd I got a lot of artists, you know what I'm sayin'\nAnd we 'bout to take off, Nassau\nYou dig? Swag, listen up, peep this\n\n[Verse 1]\nWhy not?\nMy brother died and left a brand new [?]\nI got it parked up at my bitches spot, ha\nIn every city, we bring all hookers out\nYou can't beat it, you better join it or watch\nI bet they run off with the swagger, just watch\nI got these niggas wearin' diamonds with watches\nIf you try to mess with invaders, just watch\nWe aliens and we beatin' these cases, we bosses\nShe know I'm an obstacle\nMinus the guns, the war and the violence\nI'm nice and I'm kind, yeah\nFly you out private, Chanel with the plains on her\nI got that bag for you, same cloth as a towel\nYou materialistic, but I'm ridin' with you\nRidin' with you till the wheels fall off, hey\nAnd she my business boy, you better not piss shawty off, hey\nI don't give a fuck about you cause I build with my bro\nIf a nigga try to latch, I'm shoot 'em all off\n(Ch-ch, pew, pew, pew, pew, pew, pew)\n\n[Chorus]\nRollie icey timeless (Rollie)\nAll these bitches, they scandalous (Scandalous)\nAll these fuck niggas just ridin' dick (Ridin' dick)\nCash on delivery-very (Oh)\nI'm livin' reckless, them VVSs (Hey, hey)\nI'm livin' treacherous, them VVSs (Woah woah-oh-oh)\nThe goldies, the gold teeth (Gold teeth)\nSome Dickies, some icey weeds (Oh God)\n\n[Verse 2]\nThe Molly, the Percy, I'm itchin', I'm scratchin'\nI buy it, I whip it, I flip it, you get it?\nMy dash, is digital, I spent me some digits\nDon't play, lil bitches, I'll flip you, you frigid\nI'm in the middle of nowhere and I'm gettin' my dick sucked on\nI'm not scared of lions nor bears man, I'm on my ape shit homie\nDon't think you escapin' homie, you can't escape this homie\nFight for my kids right now, I put my patience on it\nI got some cake on homie, I got a bakery on me\nYou bet' not date nothin' homie, you bet' not cake nothin' homie\nYou bet' not do it, naw nigga, unless I say so homie\nThey can approve who's [?], they can't escape them homie\nSlide, ride ride ride, you can not be us guys\nI can play Popeyes eyes, you can be Popeye's wife\nI beat it down all night, I got a early morning flight\nI can assure with your life, if you protect my life\nIf you protect my life, I can assure your life\nIf you protect my life, I'll give a mil' to your wife\nIf you ever ever thought, I got your kids for life\nI got your kids for life, got your kids for life\n\n[Bridge]\nAye man, if you protect me, if you make sure I'm good, how the fuck I'm not gon' make sure you good, fool?\nWhat is you thinkin' nigga? I'ma [?] get you\nKnow one thing nigga\nI don't talk much, so I probably [?], but know one thing nigga, if I'm not with you\nIf you don't feel like I'm with you\nI just want you to just know that I'm not against you, know what I'm sayin'?\nMake sure you, uh, remember that, yeah\n\n[Chorus]\nHey, Rollie icey timeless\nAll these bitches, they scandalous\nAll these fuck niggas just ridin' dick\nCash on delivery-very\nI'm livin' reckless, them VVSs\nI'm livin' treacherous, them VVSs\nThe goldies, the gold teeth\nSome Dickies, some icey weeds", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}