{"songs": [{"title": "Animal Pharm", "album": null, "year": "2013-01-01", "lyrics": "[Verse 1]\nQuiet as a kitten\nReply as silent as a Raphael-given instrument for stickin'\nOr maybe riot as a lion\nWould he tie in tiger for attention?\nTiggers and Poohs, niggas and jews\nMr. Opulent Christopher Robinson too\nReversal like\nWhen that predetermined term expires on a turtle's knife\nWhat of Korea, are you scared?\nOr is something not there, like a Welsh rabbit full of hares\nAnimal farms and imaginary bears\nThe body is a house like a kangaroo pouch\nOr an oyster-hoisted cow over crescent moons as it looms low in the night sky\nPlatoons of coons stand ready for the drive-by\nSteady as the medley booms from the Akai\nAffirm as in \"Aye aye\"\nLike it the second\nLike a junior, like a third, like a eye\nLike a observe from the view of a bird as it fly high\nSitting heavy like spaghetti in the belly of a wise guy\nWho let these G's out the PI_STY?\nSeems they taking cues from The Wire\nOkay decorum, and keeping you from wanting to buy it\nBut you still buy it like you never left its sight\nAnd like a slow gunfighter gun: unfired\nCow dung walls, hermit crabs in the mall, sting ray from the stars and barnyard laws\nThese are\n\n[Hook: Atoms for Peace sample]\nHey hey, just cause I got thumbs, that don't mean everybody is dumb, huh huh?\nJust cause I got one, that don't mean that they not dumb, what what?\n\n[Verse 2]\nQuiet as a mouse in the House of God\nIn the jaws, like tyrants in the mouths of mobs\nRipping it to pieces like a picture and a preacher\nIf a cricket was a speaker, it's its own chicken bones on the garbage can top\nUgly mother freakers is predator, opposite, on top of it, to make it fox\nSo if similar appeal, administer the seal to make it real\nElephantine but never mind\nHalf-ton gorillas in a midst, they'll never find\nHungry as a hippopotamus, gobble it 'til your bottom and your body is as wobbly as Skrillex\nEeyores and Piglets, blind bats nailing tails to a riblet\nTime only limited(ed) if you make it\nBlind rat's nails hold tales of Unseeing Eye selves\nOut is out, so they only seeing thy shells\nGhost Dog\nOh lawd\nThese are\n\n[Hook 2: Atoms for Peace sample]\nHey they not dumb\nI ain't smart just cause I got thumbs, what, say what?\nHey hey, just cause I got one\nThat don't mean I'm better cause they got none, say what, say what say what?\n\n[Verse 3]\nThe butcher says to the bovines\nYou're all just pastrami when it's showtime\nCowboy co-signs, attack the cat samples\nOwn worst enemies\nChop down the trees, we need the axe handles\nLike a heel in a sandal saying \"hell no\"\nOr you trapped like the yells of a nail in the shell-toe\nClever as a fishbowl on a sailboat\nLandlocked as a ham hock on a railroad\nSandbox by the swimming pool\nTwo times as clever as a fishing school\nPills for the pressure\nBroken seals on the pills for the pleasure\nIf you feeling ill, whatever\nAnimal farm, you're all dumb\nTickle 'em with your articulated thumb\nA tapeworm will never play the drums, but um\nThese are\nThese are\n\n[Hook 3: Atoms for Peace sample]\nHey hey, just cause I got one\nThat don't mean I'm smart cause they got none\nW-what, w-what\nAm I not an animal cause I got thumbs?\nThat don't make me smart cause they got none, say what?\nW-what, w-what\nHere we come\nAm I not an animal cause I got thumbs, say what?\nSay what, say what?", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}