{"songs": [{"title": "Good Girls Go Bad", "album": "The R.E.D. Album", "year": "2011-08-19", "lyrics": "[Verse 1: The Game]\nSince Big ain't here, I'm about to do it for T'yanna\nAnd put roses on the grave of Kanye's mama\nThis for all the lost girls locked up in the pen\nAll the girls that hold it down, getting beat on by they man\nRespect women, I don't care if they a 2 or a 10\nWe don't beat on Kat Stacks, we just bring it to an end\nAnd we don't wanna see Nicki fighting Lil Kim\nThere’s missing women out there, let’s just focus on them\nThis song is dedicated to Natalie Holloway\nI feel for her daddy so I wrote this on father's day\nI know she gone, but she ain't far away\nI just had a daughter, pass me that cigar 'Ye\nI'm 'bout to tell a story, everybody parlay\nSit back listen while I kick it, the Compton Boulevard way\nMy daddy used to beat up on my mama all day\nSo I took my Chronic album and slept in the hallway\nI learned this the hard way, when police came our way\nMy daddy had his act on like it never happened (Broadway)\nPlus I was kinda scared to keep it real with you\nNow my mama good, nigga she ain't gotta deal with ya\nYou want some money nigga? I ain't get a deal with ya\nYou ain't saying nothing, you like a still picture\nYou better thank God you still breathing air\nCause you coulda went out like your boy Steve McNair\n\n[Hook]\nDon't make the good girls go bad, no\nDon't make the good girls go bad, no (I won't)\nIf you don't, you gon’ really love us  (I said I won't)\nPlease don’t use us, dooon’t\n\n[Verse 2: Drake]\nGood evening, I'm in Chicago at the Elysian\nWith some girls that say they models but umm, I don't believe 'em\nWho's still getting tested?\nWhere's all the women that still remember who they slept with?\nWhere's all the girls too busy studying to make the guest list\nBut when you do go out, you still working what you was blessed with?\nDo it girl, I'll be the king to your Queen Latifah\nI love your ass like Milhouse loved Lisa\nI love your ass like the Ninja Turtles love pizza\nIronically enough, you something I want a piece of, you got it girl\nThis song remind me of Cat from Philly, a girl I used to love\nUntil she started acting silly, her heart's a little chilly\nShe a little too carefree in 10 years\nWho's paying for all that therapy? Umm, nigga not me, yeah\nI'm probably not the man you take me for\nBut I bet I could be if you make me yours\nMost of the shit I say is true\nWhen I’m done with bad bitches, know I’m coming straight to you good girl\n\n[Hook]\nDon't make the good girls go bad, no\nDon't make the good girls go bad, no\nIf you don't, you gon’ really love us\nPlease don’t use us, noo\n\n[Verse 3: The Game]\nDrizzy, I'm sitting here watching Basketball Wives\nLike, \"uhh, them is basketball wives?\"\nOnly cute one, Gloria, that's my nigga Matt Barnes' chick\nCan't swim in that poon fool, that's a crucial conflict\nNever sleep with the wife of niggas you eat with\nAnd never buy a chick a bag on the first date\nI pop a bottle with her on her birthday and tell her ass \"get on!\"\nDisrespect my chick, that type of shit'll get you spit on\nI don't hit on girls, I just hit on girls\nLike \"hey lil mama, come in Game and Drizzy's world\"\nGet busy girl, drink that rosé 'til you're dizzy girl\nShe walking around the club all lost, like where is he girl?\nHe on the top of the charts, next to Beyonce\nRight under Kanye, so let the Don spray\nThat’s your girl? Nigga go on and make her cry\nSoon as you do, I'm pulling up in that Porsche like \"let's ride\"\n\n[Hook]\nDon't make the good girls go bad, no\nDon't make the good girls go bad, no\nIf you don't make the good girls go bad, no\nDon’t make the good girls go bad, no\nIf you don't, you gon’ really love us\nPlease don’t use us, nooo\n\n[Verse 4: The Game]\nWord on the news stand, Alicia got herself a man\nAnd thats my nigga Swizzy, know you see Game and Drizzy\nSurrounded by them diamonds, I'mma cold mackin\nNigga its a cold climate, don’t ask me where the crime went\nJust tell me where them dimes went\nSo I can get em fitted, let em beat a bridesmaid at the wedding for my niggas\nYeah I’m married to the game\nAnd she married to my chain, watching Boyz n The Hood\nLets take a drive down memory lane", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg"}], "artist": "The Game"}