{"songs": [{"title": "She A Trip", "album": "#IDGAF", "year": null, "lyrics": "[Sample: Conversation between couple]\n\"Why haven't I heard from you?\"\n\"I been busy.\"\n\"Well, have you at least thought about what we talked about?\"\n\"Yeah, about leaving with you? Yeah, I THOUGHT about it...\"\n\"Why are you trippin'?\"\n\n[Intro: Ludacris]\nOh you talkin bout Ol’ girl from up the street right?\nYeah nigga I did, I heard about that bitch man\nShe a trip, I be like\n\n[Verse 1: Ludacris]\nI be like damn she got a way about her\nAnd everybody always got something to say about her\nShe so fine, she so classy, but that bitch mean\nEverybody wanna throw a little dirt up on her, but that bitch clean\nQuit hatin’ on her, recognize her from a mile away\nWhen she be walkin’ man it be hard to find the words to say\nWhen she be talkin’ disrespect it pay no nevermind\nShe just grill em' dressing up she known to take her time\nThen go a kill him, go hit the club and make these bitches sweat\nNot even trying, turning heads just off a silohutte\nAnd I ain't lying somebody taught her well\nShe never slip and I think she’s out here casting spells\nI’m trying to tell ya\n\n[Hook: Mac Miller]\nShe a trip (trip, trip, trip)\nShe a trip (trip, trip, trip)\nThat bitch a trip (trip, trip, trip)\nThat girl a trip (trip, trip, trip)\n\n[Bridge: Mac Miller]\nYeah girl, all I get is pussy stay wet\nFuckin’ keep her in check\nMoney have her impressed, she wanna ride on your jet\nShe a trip\nShe wanna ride on your jet\nShe a trip\n\n[Verse 2: Ludacris]\nNow matter what she always on her grind\nShe seems just to know what to do to stay on my mind\nShe send me pics of her naked posin’ like in a magazine\nI wanna hit like a drum whenever she go and shake it like a tamborine\nYeah that percussion and always got the latest bags\nHer shoe game stupid and she never fights and never nags\nShe’ll keep it movin’ got no time for games, lames, false claims\nCallin’ out names, Dames, all on the same thang mayne\nEnd of discussion, what you thought she’ll throw you for a loop\nKnow what's expected? you might even let her drive your coupe\nShe’ll never wreck it, she respect the finer thangs, diamond rangs, diamond chains\nDown to carry Vera Wang get a grip\nShe a motherfuckin trip\n\n[Hook: Mac Miller]\nShe a trip (trip, trip, trip)\nShe a trip (trip, trip, trip)\nThat bitch a trip (trip, trip, trip)\nThat girl a trip (trip, trip, trip)\n\n[Bridge: Mac Miller]\nYeah girl, all I get is pussy stay wet\nFuckin’ keep her in check\nMoney have her impressed, she wanna ride on your jet\nShe a trip\nShe wanna ride on your jet\nShe a trip\n\n[Verse 3: Ludacris]\nThat bitch a trip if I ain't never seen it\nI get up in the guts, she be tellin’ me to beat it like I fuckin’ mean it\nI can't believe it, got a nigga thinkin’ maybe I’da met my match\nSo I put her in a track, and yes in fact you’ll catch me spendin’ stacks\nAll up in Saks and I ain't never been one to trick\nLike what am I doin? but it's something ’bout the way she ride that dick\nMy mind is ruin and she using it to her advantage\nShe love that I’m grown but I think she got some other victims\nI’m not alone, who thought this bad bitch was out here pimpin\nCatch a nigga slippin’, rippin tags off the latest clothes and bags\nShe so bad that she can't go nowhere without a bunch of niggas\nTrying to holler but she all bout that body dollar\n\n[Hook: Mac Miller]\nShe a trip (trip, trip, trip)\nShe a trip (trip, trip, trip)\nThat bitch a trip (trip, trip, trip)\nThat girl a trip (trip, trip, trip)\n\n[Bridge: Mac Miller]\nYeah girl, all I get is pussy stay wet\nFuckin’ keep her in check\nMoney have her impressed, she wanna ride on your jet\nShe a trip\nShe wanna ride on your jet\nShe a trip", "image": "https://images.genius.com/59084ad168e65b54e99e3d6e138cdf83.500x500x1.jpg"}], "artist": "Ludacris"}