{"songs": [{"title": "We Are Not Afraid (Remix)", "album": null, "year": null, "lyrics": "[The Notorious B.I.G]\n\nAfter realizin, to master enterprisin\nI ain't have to be in school by ten, I was in\nBegan to encounter, with my counter... parts\nI holla burn the block apart, break it down into sections\nDrugs by the selection, some use pipes, others use injections\nSyringe sold separately, Frank the deputy\nQuick to grab my Smith & Wesson, like my dick was missin'\nTo protect my position, my corner, my layer\nWhile we out here, say the hustlas prayer\nIf the game shakes me or breaks me\nI hope it makes me a better man\nTake a better stand. Put money in my moms hand\nGet my daughter this college plan, so she don't need no man\nStay far from timid\nOnly make moves when your heart's in it\nAnd live the phrase Sky's The Limit\n\n[Hook]\n\nWhy do you keep\nOn whispering\nTalking with your face turned away\nYou say that love\nDon't come easy for you\nWhat makes you think I'm not afraid?\n\n[2Pac]\n\nEver since I met you I could beat the pressure\nIt's like your man don't understand\nAll he does is stress ya\nI can see your state of misery from the introduction\nIt ain't about no suckin' and touchin', just harmless discussion\nMaybe we can see a better way, find a brighter day\nLate night phone conversations would that be OK?\nI don't wanna take up all your time, be the next in line\nTell me your size, let me find you things with you in mind\nI can see you're cautious and I'm careful not to scare you\nBut anticipation of love making got you shaking when im standin' near you\nNews of precision will prepare ya in case you get scared\nJust ask the man in the mirror\nNow the picture's gotten clearer all he does is hit you hard\nI tell you to leave him and you tell me keep my faith in God\nI don't understand, I just wanna bring ya home\nI wonder should I leave you alone and find a woman of my own\n\n[Hook]\n\nWhy do you keep\nOn whispering\nTalking with your face turned away\nYou say that love\nDon't come easy for you\nWhat makes you think I'm not afraid?\n\n[The Notorious B.I.G]\n\nA nigga never been as broke as me, I like that\nWhen I was young I had two pairs of Lees, besides that\nThe pin stripes and the gray (Huh huh)\nThe one I wore on Mondays, on Wednesdays\nWhile niggas flirt, I'm sewing tigers on my shirt and alligators\nYa wanna see the inside, huh, I see ya later\nHere come the drama, oh, that's that nigga with the fake, huh, BLAOW!\nWhy you punch me in my face , stay in ya place\nPlay ya position, here come my intuition\nGo in this nigga pocket\nRob him while his friends watchin'\nThat hoes clocking, here comes respect\nHis crew's your crew, or they might be next\nLook at they man eye, BIG man they never try\nSo we roll with em' , stole with em'\nI mean loyalty, niggas bough me milks at lunch\nThe milks was chocolate, the cookies, buttercrunch\n\n[Hook]\n\nWhy do you keep\nOn whispering\nTalking with your face turned away\nYou say that love\nDon't come easy for you\nWhat makes you think I'm not afraid?", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}