{"songs": [{"title": "Carved in Stone", "album": "Insomnia: The Alchemist vs. The Cousin of Death", "year": "2003-12-02", "lyrics": "[Intro: Prodigy]\nWe gettin’ our burn\nHere we go again\nI bet y’all saying to y’all self: “The fuck these niggas last so long, man?”\nAnd my response to that is, I palms don’t ever stop itching, nigga\nYou know, it’s about that you hear it right now, so…\n\n[Verse 1: Prodigy]\nWe back, people, for more money, more jewelry, more vehicles\nLess hangers on, tag-alongs, and leech dudes\nWe back minus that weak label trying to hold us back\nNow we gettin’ more profits every unit shipped\nYou gettin’ returns, your album ain’t movin’ shit\nWe gettin’ our burn in places we don’t even live\nWe learn you niggas on this game and how to stay afloat\nWe teach you clowns about some things that y’all don’t know\nLike how to bang out songs for 12 years straight\nAnd that’s not all—they all gotta be gangsta\nConsistent anthems, put us up against whoever\nWe got a thing for competition, only make us better\nAnd better and better, I know you can’t believe your ears\nYou pinching yourself, but doggie, this is all real\nConvincing yourself that we Cell Block 4 thugs\nMan, that’s how the last nigga got bucked\n\n[Verse 2: Havoc]\nHomie, don’t get it twisted, I been gettin’ money since ’90\n‘Fore Magic retired and Lakers head coach was Pat Riley\nI bone a bitch then bounce, baby girl, don’t mind me\nIf you mad, take it up with God, that’s how designed me\nI’m multi-talented—fuck you think Jive signed me?\nThe only thing grimey is that pen that you write with\nGot your main hoe two-waying me on my Sidekick\nTalking how she fuck you but she really don’t like it\nAbout my paper when it come to that hustle, I all-night it\nIf I ain’t been through it, yo, Havoc won’t bite it\nI can’t keep it real for shit, but everything happens for a reason\nSo I won’t wifey the wrong bitch\nI’m a bastard, pimpin’ in a Caddy 16\nI’m a bastard, pimpin’ in a Caddy 16\nY’all know nothin’ ‘bout it, make the Maybach look weak\nWith compartment secretly designed to stash the heat\n\n[Hook: Havoc]\nYo, these niggas know my style—fuck is wrong with you, doggy?\nKnow these cannons’ll blast off and make this place foggy\nHave everybody in this bitch cramped in the door\nI just introduce myself and let the hammer applaud\nYo, niggas know my style—fuck is wrong with you, doggy?\nKnow these cannons’ll blast off and make this place foggy\nHave everybody in this bitch cramped in the door\nRunning for life, amazing how you could move the crowd with the 4", "image": "https://images.genius.com/1021aef37ee8310ae6a31c1d044210e5.457x457x1.jpg"}], "artist": "Mobb Deep"}