{"songs": [{"title": "Hell In A Cell", "album": "Cruel World - EP", "year": "2015-02-24", "lyrics": "[Intro]\nAye, aye, sit down, Ski, Ski\n\n[Verse 1]\nI got some dope, that's hard to get, like the Da Vinci code\nKicking harder than heroin, yeah, flamingo mode\nI hop up in your bitch, like, \"Where the fuck my feelings go?\"\nI hop up in the whip, like, \"Where the fuck the ceilings go?\"\nBack up, 2014, I was collecting souls\nStick with that metal, like my body just turned magnetical\n'Cause if I slide with that kettle, then I'ma let it go\nFeel like Steve Austin, how I'm still cold up in the summer, so\n\n[Bridge]\nThis the motherfucking children of the corn\nI got a blade, it's not a statement, it's a warning\nI said, \"I'm gone with the wind, I'm in the forest\"\nFour door Tauris, your body stolen\nShe call me the blade, that's just for intercourse\nI cast a spell on that bitch, a rigor mortis\nShe give me slow head, resemble a tortoise\nHad better days used to flying like lotus\n\n[Hook]\nWhat would you do for some money?\nI live my life by the Newport\nNo one can tell, that I'll never fail\nI feel like I'm Kane, bitch, hell in a cell\nWhat would you do for some money?\nI live my life by the Newport\nNo one can tell, that I'll never fail\nI feel like I'm Kane, bitch, hell in a cell\nHell in a cell\nHell in a cell (Aye, aye)\nHell in a cell\nHell in a cell (Aye)\n\n[Verse 2]\nCome with the blade so it's murder, she shook\nMask up like when the cops ask the witness, \"Well what he look like?\"\nHad tiny shirt, tiny pants, Bathing Ape but then he shook like\nMoving work, working shit in my tongue just like a poltergeist\nI am the phantom, no, I am the killer\nI am Finale like Thrilla Vanilla\nHannah Montana, I play with vanilla\nI laugh like Chucky when I come and kill you, but\n\n[Bridge]\nThis the motherfucking children of the corn (Sit down)\nI got a blade, it's not a statement, it's a warning (Sit down)\nI said, \"I'm gone with the wind, I'm in the forest\" (I'm in the forest)\nFour door Tauris, your body stolen (Aye, aye)\nShe call me the blade, that's just for intercourse (Si, si)\nI cast a spell on that bitch, a rigor mortis (Rigor mortis, rigor mortis)\nShe give me slow head, resemble a tortoise (Resemble a tortoise)\nHad better days used to flying like lotus\n\n[Hook]\nWhat would you do for some money?\nI live my life by the Newport\nNo one can tell, that I'll never fail\nI feel like I'm Kane, bitch, hell in a cell\nWhat would you do for some money?\nI live my life by the Newport\nNo one can tell, that I'll never fail\nI feel like I'm Kane, bitch, hell in a cell\nHell in a cell\nHell in a cell (Aye, aye)\nHell in a cell\nHell in a cell (Aye)", "image": "https://images.genius.com/665535aac007b49149934ffe0a37e3eb.500x500x1.jpg"}], "artist": "Ski Mask the Slump God"}