{"songs": [{"title": "Call Her a Bitch", "album": "Blow the Whistle", "year": "2006-08-29", "lyrics": "[Too $hort]\nOne thing's for sure...\nYou will get called a bitch... bitch\nSo motherfuckin' fast - bitch\nShort Dog's in the house... beotch!\n\nWhat's up bitch, you the cut up bitch\nFuck somethin' bitch, suck somethin' bitch\nLook out bitch, watch out bitch\nYeah I fucked you bitch then got out, bitch\nCatch out bitch, fuck that shit\nMotherfucker gettin' mad, fuck that bitch\nSo bitch, pay me bitch\nYou can love me bitch, you can hate me bitch\nStraight up bitch, save a bitch\nThen pay a bitch, I don't play that bitch\nCause a bitch is known to get outta line\nAnd a bitch don't understand, I'm on the grind\nYou lil' bitch, I'm all about the paper\nWhen I leave bitch tell 'em all about a player\nGo on bitch, c'mon bitch\nRun home bitch, get front on bitch\nThat's right bitch, fuck off bitch\nYou get off bitch when you suck all them dicks\nGet cut off bitch when I come home bitch\nShit ain't right? Get the fuck on bitch\nSpeak up bitch, say what bitch\nWanna pull me down, I'mma stay up bitch\nSo what bitch, do what you wanna do\nA nigga like me don't want nothin' with you\nI want a bitch, a real ass bitch\nYou can feel that bitch when she kill that grip\nHundred dollar bills bitch, I'mma still get a grip\nAnd I won't feel shit when I get a new bitch\nLil' bitch, back up bitch\nWhen I say you fine don't act a bitch\nI'll slap a bitch, get smacked up bitch\nWanna get in my way when I stack up chips?\n\n[Hook]\nI'll call her a beotch!...\nBeotch!...\nCall her a beotch!...\nBeotch!...\n\n[Too $hort]\nYou know what?\nA bitch is a once-a-month funky cock bleedin'\nBitch fell in love but she won't stop cheatin'\nReal dumb with low self esteem\nFuck a nigga she just met and won't be able to see him\nLater on when she wanna get fucked some more\nI said \"Bitch, why you such a stupid ho?\"\nYou lil' bitch, you never could fuck with this\nAnd every bitch that don't like it, she can suck my dick\n20 years later, still settin' it off\nStill talkin' bad 'bout them pregnant dogs\nThey ask me \"Short Dog, why you talk so bad?\"\nBitch disrespect me, get off in her ass\nI'm pullin' ho cards (time to learn a lesson real quick)\nAsk me, \"What's the definition of a bitch?\"\nA real bitch - she gon' know she one\nSuck the dick, drink the nut, and say she owe me one\nDamn bitch, you that bitch, can you do that bitch?\nMove back bitch, say who that bitch... I don't know you ho\nI don't sniff cocaine, I don't want no blow\nBitch you a dummie - bitch, junkie\nBitch, funky bitch, punkass bitch\nJump out bitch, get the fuck out bitch, get cussed out bitch\nCause a bitch is known to get on my nerves\nAnd a bitch don't really know when I'm on the swerve\nI'm like \"Bitch, miss me\", \"Bitch don't kiss me\"\n\"Bitch, just lick me bitch\"\nYou's a bitch, knew it when I heard the beat\nBitch ain't nothin' but a word to me\nI told you ten times, all she gon' get is pimp lines\nI'm Short Dog -\n\n[Hook]\nI'll call her a beotch!...\nBeotch!...\nCall her a beotch!...\nBeotch!...", "image": "https://images.genius.com/a946f356e20bac26df64ff8cca250ed8.500x500x1.jpg"}], "artist": "Too $hort"}