{"songs": [{"title": "Problems", "album": null, "year": "2010-07-29", "lyrics": "[Verse 1]\nDear Mrs. Bill Collector\nI know you just doing your job\nDon’t mean to disrespect you\nBut we’ve been going through this thing since way back\nI told you when I get the dough I would pay back\nBut I got problems baby yeah if you only knew\nI got bigger problems baby, yeah, hey\nSo why you talking about the money that I owe\nLike as if I didn’t know man\nIt don’t mean nothing to me\nCause right now I got my little boy crying\nAnd my grandmother dying\nCould you please stop fucking with me\nListen here, I ain't looking for no tears\nBut my brother got a year\nAnd my Momma keep smoking that shit\nOn top of that, I’m broke\nPlease put that in your notes\nFor the next one to call me up talking that shit\nAnd then ahana...\n\n[Verse 2]\nHey\nDear, Mr. Policeman\nAy am I wrong, ain't you suppose to keep the peace man?\nI coulda swore that I was driving pretty peaceful\nSo why the hell is you pulling over me fo'?\nIs it this black Mercedes?\nOh naw I get it, I get it, I get it\nOr cause I’m Black, hmmm maybe?\nYeah, hey, tell me why my hands start sweating\nAnd I hold my breath every time that you get behind me\nI turn my music down so you won’t hear a sound\nMan I’m nervous like I got a couple pounds on me\nYou pulled me over, you frown on me\nWith your flashlight, tell me what do you see\nThug niggas, drug dealers, it's a trip\nEvery nigga in this whip gotta motherfucking college degree\nAnd then ahana... unh\n\n[Verse 3]\nYeah, my middle finger to the law\nI'm busting off, tryna touch the sky\nMy teacher said impossible but I’mma fucking try\nPlus how he gon’ tell me, he don't make the rules\nThere’s niggas dying every day man we don’t make the news\nInstead they talking bout some thunderstorm, cyclones\nTimmy got his bike stole\nTop story: Tiger Woods be fucking all these White hoes\nAnchorman stop snitching\nCut to commercial, he be texting all his side bitches\nHey my goodness, how ironic\nOn trial for possession of some chronic\nMy lawyer came to court, man he was higher than a comet\nHey your honor, is you kidding\nHow you sit above me\nAre you perfect motherfucker\nHow you finna judge me?\nWhen you home you don't cuss, drink and puff like us?\nThese cops is bad boys, baby just like Puff\nThey hate they jobs and they days be fucked up like us\nAt the end of the day you niggas just like us\nYou niggas just like us", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}