{"songs": [{"title": "Shake This", "album": "Street Hop", "year": "2009-03-17", "lyrics": "[Intro]\nBeing enlightened is no longer enough, you must apply\nBeing willing is no longer acceptable, you must do\nMake it count\n\n[Pre-Chorus]\nNa-na-nah!\nI gotta shake this\nNa-na-nah!\n\n[Chorus]\nI gotta shake this jail shit off me\n\"He ain't gon' never sell, he gonna fail\" shit off me, I\nI gotta shake this, weak shit off me and keep shit off me\nAnd leave it in the streets like, \"Bitch, get off me!\"\n\n[Verse 1]\n1977, July 5th\nConceived immaculately was me, my mom's gift\nUnwrapped right there in a room like Christmas\nMy mind has been designed to do like distance\nRun whole laps around y'all with my thoughts\nYou ain't hold back on yours, nah that's my fault\nNow picture me falling\nAll the way to the bottom and I'm laying there calling\n\"Somebody come help me,\" find my strength\nTo stop drinking this poison, 'fore I drown my gift\nAnd yeah it's prolly unhealthy, 'cause I went so hard\nAnd woke up sober, I lost my good friend & broke up soldiers\nLoco, going hard as a locomotive, self-loathing\nLike I ain't chosen, shows to bless souls get exposed\nJust know that I ain't folding\n\n[Chorus]\nI gotta shake this, shake this\nI gotta shake this jail shit off me\n\"He ain't gonna never sell, he gonna fail shit\" off me\nI gotta shake this weak shit off me and keep shit off me\nAnd leave it in the streets like, \"Bitch, get off me!\"\n\n[Verse 2]\nSeptember 18th, 2006\nI roll up in the court thinking, \"This should go quick\"\nOn some couple-thousand-dollar-suit-type shit\nFrom behind thousand dollar Cartier 'scrips\nI witnessed my world tumble down like bricks\nTwo words she slurred and they sounded like this\n\"One year,\" traveled through the room\nLike moonlight, through the darkness\nOoh, it's heartless, how could I beat two felonies\nThen turn around and lose, and lose like this?\nMy lawyer’s saying stay calm, people saying, \"Pray for him\"\nThey locking my black ass up like Akon\nMy wife at the crib going crazy\nPregnant, yelling, \"I ain’t having no more babies!\"\nPeople saying Preem ain’t fucking with me no more\nNiggas in the pen looking homo, no, no!\n\n[Chorus]\nI gotta shake this, shake this, na-na-na\nI gotta shake this jail shit off me\n\"He ain't gonna never sell, he gonna fail\" shit off me\nI gotta shake this weak shit off me and keep shit off me\nAnd leave it in the streets like, \"Bitch, get off me!\"\n\n[Verse 3]\nFresh outta jail feeling like Christopher Walken\nThe king of my city, swinging my dick as I’m walking\nUp to the 750, I open the door\nMy cuz and like several bitches make up the décor\nI look in he got a cup and he pours\nI tell him, \"Nah, I’m good,\" I would’ve chugged it before\nI’m a new man but I could fuck with a whore\nNigga, my dick so hard it’s prolly touching the floor\nRiding 'round in the back of a black luxury toy\nGetting sucked, like niggas cannot fuck with me, boy\nWhen I look in the mirror, all I see is the real\nYour nigga shouldn’t be here, R.I.P. if you will\nI’m the moment of truth, I’m the only significant thing\nRoaming the scene, soon as I go in the booth\nI'ma do it this time, I'm feeling really defined\nUnsigned to signed, nigga the city is mine\n\n[Chorus]\nI gotta shake this, shake this, na-na-na\nI gotta shake this jail shit off me\n\"He ain't gonna never sell, he gonna fail\" shit off me\nI gotta shake this weak shit off me and keep shit off me\nAnd leave it in the streets like, \"Bitch, get off me!\"\nI gotta shake this jail shit off me\n\"He ain't gonna never sell, he gonna fail\" shit off me\nI gotta shake this weak shit off me and keep shit off me\nAnd leave it in the streets like, \"Bitch, get off me!\"\n\n[Outro]\nBitch, get off me!\nGet off me!\nBitch get off me!\nNow do that make me a liar?\nGet off me!\nGet off me!\nGet off me!", "image": "https://images.genius.com/13187be577e518c77f5c6ac278ec366a.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}