{"songs": [{"title": "​outside", "album": "Birds in the Trap Sing McKnight", "year": "2016-09-02", "lyrics": "[Chorus: Travis Scott]\nAll my niggas outside\nAin't goin' in, yeah\nWe been hangin' outside\nAin't goin' in, yeah, yeah, yeah\n\n[Verse 1: Travis Scott]\nYeah, yeah, automatic, yeah\nAlways got it on me baby, automatic, yeah\nWhere I'm at is static, but it ain't got traffic, yeah\nPush up on me, them boys make you do a backflip\nBalance on the beam, yeah, balance on the beam, yeah\nDo some shit I've never seen\nWon't you come ride with the team, yeah\nYeah, you might just win a ring, yeah\nWhile they home on they homescreens\n\n[Chorus: Travis Scott]\nAnd all my niggas outside\nAin't goin' in, yeah\nWe been hangin' outside\nAin't goin' in\n\n[Verse 2: Travis Scott]\nWe been hangin' outside, goin' in\nOutside, not goin' in\nPull up in a Lambo or just with the Benz\nChecking out, never checking in\nWe been outside, not goin' in\nHope you had a mattress when you sleepin' on me\nHope you got some backup if you creepin' on me\n'Cause just last week I Rest In Peace'd a homie\nWhy you do it? Why you switch up? (Ooh)\nWas it for the image or for the pictures? (Ooh)\nYou always seem to show up when I'm at the mixes\n'Cause you know I'm not myself when I'm off the liquor\nOff the lean, it's always better off the lean\n\n[Chorus: Travis Scott]\nAll my niggas outside\nAin't goin' in, yeah\nWe been hangin' outside\nAin't goin' in\nAll my niggas outside\n\n[Verse 3: 21 Savage]\n21, 21, 21, 21\nAll my niggas outside\nPillow talkin', sneak dissin', get a nigga jaw wired\nBeat your baby momma throat so long she say her jaw's tired\nYoung Savage get a nigga whacked cause I got mob ties, I'm a wise guy\nAll my niggas in the field\nI'm draped in Avianne, I ain't got a deal\nSlaughter Gang and PDE, we killin' shit for real (21, 21)\nTen bad bitches suckin' dick and eatin' pills (What?)\nAnd I keep that Tommy, nigga, I ain't talkin' Hil (21)\nAnd I be on mud, I get mad if it spill (Yeah)\nBitch, I know your baby daddy probably wanna kill (Kill)\nI'm a real nigga, fuck niggas can't feel (21)\nPlus I get inside that bowl and scrr, scrr, scrr, scrr\nHit it from the back pull up her skirt (21)\nI just copped that Bentley truck, I skrt, skrt, skrt (21)\nBitch, I'm outside on the percs, percs, percs (21, 21, 21)\n\n[Chorus: Travis Scott]\nAll my niggas outside\nAin't goin' in, yeah\nWe been hangin' outside\nAin't goin' in\nAll my niggas outside", "image": "https://images.genius.com/c9c8a92af16b73c835c2731f75294a82.1000x1000x1.jpg"}], "artist": "Travis Scott"}