{"songs": [{"title": "About Me", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "1995-09-08", "lyrics": "[Intro: Busta Rhymes & Raekwon]\nAiyo, Shallah, what up?\nYeah, you know how we do it\nTurn me up, kid, let's get it popping\nCrazy, let's go get 'em killa\nYo Dre, good looking on this coke, man\nThis shit is official\n\n[Verse 1: Raekwon]\nAyo, it's back to business, making them diskettes, pushing sixes\nRocking wild animals on jackets are sickening\nHear me? From here to Rockaway to Cali, we flipped this\nBroad day, Chef'll saute, his lyrics is crispy\nNow I got Dre up in the kitchen, Rae stuck in position\nBout to flame broil his coke and get busy\nWhat? Politics, pop collars and drive violent whips\nStay fly, hungry and wise, you know the code, honor it\nSit back, yelling it's nothing, unless his buttons get pressed\nWe don't stress nothing, we only get dressed\nStretched out, moving professional, frying more fish\nI heard it in slurs, them niggas is blessed\nWhile we ball to the maximum, give me the floor, for real\nI show off and let my money get stretched\nTake it to a new level, new bezzle, few rebels\nFew wolves with medals on, you know we get test\n\n[Hook: Raekwon & Busta Rhymes]\nMe, nigga, me, that's who, Cash Rule\nHah, better slow it down, niggas'll smash you, homie, uh\nMe, nigga, me, pass through, rascals\nHah, half gorilla, half ape in them track suits, black, come on\nMe, nigga, me, capsules, birds, whips\nOunces and fifths, no licking the glass, duke, yeah\nYeah, yea-yea-yeah, yea-yea-yeah, yeah, yeah\nI'm here, so it's there, yea-yea-yea-yeah, yeah\n\n[Verse 2: Busta Rhymes]\nHere comes the, a lethal presentation taking you places you never been\nDeadlier than the combination of coke and heroin\nI see the weakness in most of you niggas that be hollering\nSo I toned it down, so these words be piercing your lower obdomen\nWhat I meant to say abdomen, keep on listening and following\nWhile I'm ditecting a German, hateful niggas, chicks be swallowing\nAnd if you look funny to me, and there's a problem then\nI put you under an ultraviolet light or a halogen\nAs if I was busy deciphering counterfeit dollars and\nHoes in like some kind of Biblical figure, King Solomon\nHah, just for the record, what we do is essential\nWhile I captivate the masses and keep the moments eventful\nDoc Dre, Bust, Shallah Rae, see the vision?\nMost you niggas still in disbelief, just came into fruition now\nPop the cork up off this bottle and you pour it\nSo euphoric, document this moment, shit is so historic\n\n[Hook: Raekwon & Busta Rhymes]\nMe, nigga, me, that's who, Cash Rule\nHah, better slow it down, niggas'll smash you, homie, uh\nMe, nigga, me, pass through, rascals\nHah, half gorilla, half ape in them track suits, black, come on\nMe, nigga, me, capsules, birds, whips\nOunces and fifths, no licking the glass, duke, yeah\nYeah, yea-yea-yeah, yea-yea-yeah, yeah, yeah\nI'm here, so it's there, yea-yea-yea-yeah, yeah\n\n[Verse 3: Raekwon]\nKing of kings spit blood, all on my apron\nWash a nigga's face with the MAC, smoke them like Steak Umm's\nYeah my dynasty's brolic for real, we hunt, eat, catch the rat\nBlow his waist, float in the stream\nYou know we all-pro with it, anti auto-tune\nBoom, my flow fire, sit by the stove, hit it\nReal niggas, official as listeners, gangstas and visitors\nStep in the shit, we all prisoners\nMight take the hammer from you, know I'm the animal\nRock a spur fur hat, no niggas in sandals, boo\nEveryday get money and dress rugged, these are the times\nKeep a nine on you, blow off in public\nAnd I will surely feed my niggas the streets\nCop the hottest things to get, and haters they can eat and then preach\nAnd while it go down, worldwide, this the team, this the theme\nMe, Dre, Rhymes, my money makers is mean, what?\n\n[Hook: Raekwon & Busta Rhymes]\nMe, nigga, me, that's who, Cash Rule\nHah, better slow it down, niggas'll smash you, homie, uh\nMe, nigga, me, pass through, rascals\nHah, half gorilla, half ape in them track suits, black, come on\nMe, nigga, me, capsules, birds, whips\nOunces and fifths, no licking the glass, duke, yeah\nYeah, yea-yea-yeah, yea-yea-yeah, yeah, yeah\nI'm here, so it's there, yea-yea-yea-yeah, yeah", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}