{"songs": [{"title": "Ten Crack Commandments", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Chuck D]\n1, 2, 3, 4, 5, 6, 7, 8, 9\n\n[Intro]\nIt's the ten crack commandments, what?\nNigga can't tell me nothing about this coke\nCan't tell me nothing about this crack, this weed, for my hustlin' niggas\nNiggas on the corner I ain't forget you niggas, my triple beam niggas\n\n[Verse]\nI've been in this game for years, it made me a animal\nThere's rules to this shit, I wrote me a manual\nA step-by-step booklet for you to get\nYour game on track, not your wig pushed back\nRule Nombre Uno: never let no one know\nHow much dough you hold cause you know\nThe cheddar breed jealousy 'specially\nIf that man fucked up, get yo' ass stuck up\nNumber 2: never let 'em know your next move\nDon't you know Bad Boys move in silence and violence?\nTake it from your highness\nI done squeezed mad clips at these cats for they bricks and chips\nNumber 3: never trust nobody\nYour moms'll set that ass up, properly gassed up\nHoodied and masked up, shit, for that fast buck\nShe be laying in the bushes to light that ass up\nNumber 4: I know you heard this before\n\"Never get high on your own supply\"\nNumber 5: never sell no crack where you rest at\nI don't care if they want a ounce, tell 'em \"bounce!\"\nNumber 6: that goddamn credit? forget it\nYou think a crackhead paying you back, shit forget it!\n7: this rule is so underrated\nKeep your family and business completely separated\nMoney and blood don't mix like two dicks and no bitch\nFind yourself in serious shit\nNumber 8: never keep no weight on you!\nThem cats that squeeze your guns can hold jums too\nNumber 9 shoulda been Number 1 to me:\nIf you ain't gettin' bagged stay the fuck from police\nIf niggas think you snitchin' they ain't tryna to listen\nThey be sittin' in your kitchen, waiting to start hittin'\nNumber 10: a strong word called \"consignment\"\nStrictly for live men, not for freshmen\nIf you ain't got the clientele, say \"hell no!\"\nCause they gon' want they money rain sleet hail snow\nFollow these rules you'll have mad bread to break up\nIf not, 24 years on the wake up\nSlug hit your temple, watch your frame shake up\nCaretaker did your makeup, when you passed\nYour girl fucked my man Jake up\nHeard in three weeks she sniffed a whole half a cake up\nHeard she suck a good dick, and can hook a steak up\nGotta go gotta go, more pies to bake up, word up\n\nCrack King, Frank Wiz-zhite\n\n[Premier Scratching]\n(1, 2, 3, 5, 6, 7, 8\n1, 1, 2, 3, 4, 5\n1, 1, 1, 1, 1, 2, 3, 4, 4, 5\n1, 2, 3, 4, 5, 6, 7, 8, 9\n10.......10)", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}