{"songs": [{"title": "PRIDE.", "album": "DAMN.", "year": "2017-04-14", "lyrics": "[Intro: Bēkon]\nLove's gonna get you killed\nBut pride’s gonna be the death of you and you and me\nAnd you and you and you and me\nAnd you and you and you and me\nAnd you and you and you and me and—\n\n[Chorus: Steve Lacy & Kendrick Lamar]\nMe, I wasn't taught to share, but care\nIn another life, I surely was there\nMe, I wasn't taught to share, but care\nI care, I care\n\n[Verse 1: Kendrick Lamar]\nHell-raising, wheel-chasing, new worldy possessions\nFlesh-making, spirit-breaking, which one would you lessen?\nThe better part, the human heart, you love ’em or dissect 'em\nHappiness or flashiness? How do you serve the question?\nSee, in a perfect world, I would be perfect, world\nI don't trust people enough beyond they surface, world\nI don't love people enough to put my faith in man\nI put my faith in these lyrics, hoping I make a band\nI understand I ain't perfect, I probably won't come around\nThis time I might put you down\nLast time I ain't give a fuck, I still feel the same now\nMy feelings might go numb, you're dealing with cold thumb\nI’m willing to give up a leg and arm to show empathy from\nPity parties and functions of you and yours\nA perfect world, you probably live another 24\nI can’t fake humble just 'cause your ass is insecure\nI can’t fake humble just 'cause your ass is insecure\n\n[Chorus: Steve Lacy & Kendrick Lamar]\nMe, I wasn't taught to share, but care\nIn another life, I surely was there\nMe, I wasn't taught to share, but care\nI care, I care\n\n[Post-Chorus: Kendrick Lamar & Anna Wise]\nMaybe I wasn’t there\nMaybe I wasn't there\nMaybe I wasn't there\nMaybe I wasn't there\n\n[Verse 2: Kendrick Lamar]\nNow, in a perfect world, I probably won't be insensitive\nCold as December but never remember what winter did\nI wouldn't blame you for mistakes I made or the bed I laid\nSeems like I point the finger just to make a point nowadays\nSmiles and cold stares, the temperature goes there\nIndigenous disposition, feel like we belong here\nI know the walls, they can listen, I wish they could talk back\nThe hurt becomes repetition, the love almost lost that\nSick venom in men and women overcome with pride\nA perfect world is never perfect, only filled with lies\nPromises are broken and more resentment come alive\nRace barriers make inferior you and I\nSee, in a perfect world, I'll choose faith over riches\nI'll choose work over bitches, I'll make schools out of prison\nI'll take all the religions and put 'em all in one service\nJust to tell 'em we ain't shit, but He's been perfect, world\n\n[Chorus: Steve Lacy & Kendrick Lamar]\nMe, I wasn't taught to share, but care\nIn another life, I surely was there\nMe, I wasn't taught to share, but care\nI care, I care\n\n[Post-Chorus: Kendrick Lamar & Anna Wise]\nMaybe I wasn't there\nMaybe I wasn't there\nMaybe I wasn't there\nMaybe I wasn't there", "image": "https://images.genius.com/d25e7043f51c2de6acaf6c39caa60da2.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}