{"songs": [{"title": "No More For Me", "album": "Kon the Louis Vuitton Don", "year": null, "lyrics": "[Intro: Kanye West]\nLong Beach, stand up! (Plain Pat, what up?)\nIt's your hometown boy Mark Spitz and uh\nNow I've been getting fucked up all night long\nThis weed and this drink I got is almost gone\nAnd I've been doing wrong my whole life long\nSo here's my song\nHere's my song\n\n[Hook: Mark Spitz with (Kanye West)]\nFive pounds of dro\nFive rounds or mo'\nTore from the flo'\nTwo sets of hoes\nK. West to go\n(Okay no more for me\nOkay one more for me)\n[X2]\n\n[Verse 1: Mark Spitz]\nLet me talk on this\nLet me walk on this\nMark Spitz extra clips of hollow tips\nI'm full throttle with Chicago trips\nHits model chicks without the bread\nMoet bottles flip, I'm out my head\nYeah\nOkay no more for me\nFuck it, one more for me\nSend another round around for all my Gs\nQuarterback in the streets\nThrow a zip for three\nMr. MC on the beats that still spin when I freeze\nIn the city by the sea, bitch\nFeel the breeze\nHot head, I got steel to squeeze\nSee easy\n\n[Bridge: Mark Spitz]\nThe west is on my back, K. West is on the track\n'kay?\nNow we fiend to get it jumpin' like the jacks\nDimes and hoodrats, get down on the flo'\nAnd pop that ass 'til it's time to go\n\n[Hook: Mark Spitz with (Kanye West)]\n\n[Verse 2: Mark Spitz]\nI came to the club with a gang of niggas\nBut I left from the club with a gang of bitches\nJust got my pimp cup now my name is Bishop\nIn a money green suit, ice cane and lizards\nThe P chain still hangs but it's changed to Spitz\nThe blues always authentic gangsta shit\nNow take this and run with it\nGo have fun with it\nBut make sure you bring it back when you're done with it\nLong Beach done done it again\nIt's been ten\nAnd we've been it since then as little kids\nYou niggas can't tell me shit on how to sell with this\nI'm hot as hell, we done done it again\n\n[Bridge: Mark Spitz]\n\n[Hook: Mark Spitz with (Kanye West)]\n\n[Interlude: Kanye West]\nDon't worry Chi-town\nIt's ya boy Kanye To The\nI got this!\n\n[Verse 3: Kanye West]\nYou at the bar tryin' to ask what that Hypno hit fo'\nIf you gotta ask that you can't afford to get mo'\nDawg, slow down you can't afford to sip Mo'\nLeave the club now, come back when you get dough\nMany hoes, many many many many many hoes\nCenterfolds, especially I'm in the Go\nCadillac back to back, red, black to indigo\nTell me that I ain't pimpin' yo\nEspecially they in a row?\nKeep a least two, that can't keep they cool\nCause I stay G'd up like the first week of school\nBroke girls, I take 'em to the Section 8\nWhere I pass the dick around like a collection plate\nWhite girls said, \"La Di Da Di, we love to party\"\nAnd that bitch ain't broke so that mean she sniff coke\nAnd she only 17 so that mean she can't vote\nSo if we do anything, that mean you can't quote\n\n[Hook: Mark Spitz with (Kanye West)]", "image": "https://images.genius.com/b7758602aa6883d6e056a8f30703a549.591x591x1.jpg"}], "artist": "Kanye West"}