{"songs": [{"title": "Thug N U Thug N Me (Remix)", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: 2Pac]\nAy come on JoJo ('Pac.. hahaha)\nYeah that type of shit (maybe it's the thug in me)\nYou know what time it is (maybe it's the thug in me)\n\n[Verse 1: 2Pac]\nBy age thirteen I was buckwild, good at my knuckle game\nMade it through a tough childhood never be the same\nWalked in my daddy's shoes\nNo time to be a peaceful man had to shatter fools\nThat's 'til I put my eyes on you\nGod damn, sweetheart you got some thighs on you\nNow I can't wait to get you home, get you all alone\nIn my bedroom, baby can we bone, and get it on\nTell me lady how you like me\nAnd if you want it harder baby, come and bite me\nBut do it lightly; cause that excites me to let it pop\nAnd if you lick me right, I'll do it all night\nOnly got fucked by a drug dealer\nNever felt the real passion of a thug nigga (haha)\nThough I like the way you scream when you lovin' me\nI'm goin' deep, it's the thug in me\nSo whatchu sayin' girl?\n\n[Hook: K-Ci & JoJo (2Pac)]\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me (Maybe it's the thug in me)\nThat I wanna put in you (maybe it's the thug in you)\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me (Maybe it's the thug in me)\nThat I wanna give to you girl (Maybe it's the thug in you)\n\n[Verse 2: 2Pac]\nMoan baby when we bone it's on\nIt's so strong niggas in the next room'll cum\nI got ya head swingin'\nTongue kissin', as I hit it from the back with the bed ringin' (haha)\nGive me space, as I lick ya face, stick the place\nSynchronize so I drive when they kick the bass\nLove fuckin' in tha mo'nin'\nI get ya wet and bust a sweat, then I'm gone\nLeft you on yo' own girl\nTell me what you feel like\nBlindfolded, I'm cold do it real nice - that's if it feel right\nMaybe it's the thug in me\nI pull ya hair while we fuckin' in the chair, when ya lovin' me\nUp against the wall, you can have it all; just try\nBet my kiss, to get you high, don't pass by\nGrab me by my nuts when I'm lovin' you\nNow open up and let me put the thug in you\n\n[Hook: K-Ci & JoJo (2Pac)]\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me (Maybe it's the thug in me)\nThat I wanna put in you (maybe it's the thug in you)\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me (Maybe it's the thug in me)\nThat I wanna give to you girl (Maybe it's the thug in you)\n\n[Verse 3: 2Pac]\nSay baby what's your phone number?\nBe warned, I'm like a storm with my own thunder\nI make the room rumble, in and out long stroke\nHold ya breath now, close your eyes deep throat\nDid you like it?.. Oooh I'm excited!\nCause it's a party in my bedroom, you're invited\nC'mon now, let me see ya shake your rump\nTell me, how long will it take to cum\nHavin' fun, do it one on one and we can all get involved\nFirst y'all do me, then I'll fuck y'all\nWhen you call me the next day\nTo get sexed by a nigga in the best way\nYeah baby it's a price to pay\nOnly play in the fast lane\nWhen you a hustler, motherfuck a cash came\nI gotcha goin' wild, cause I'm lovin' you\nDrugged out with this motherfuckin' thug in you\n\n[Hook: K-Ci & JoJo (2Pac)]\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me (Maybe it's the thug in me)\nThat I wanna put in you and you\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me (Maybe it's the thug in me)\nThat I wanna give to you girl (Maybe it's the thug in you)\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me\nThat I wanna put in you and you (Maybe it's the thug in you)\nA thug nigga like me, I need a thug lady like you\nI got a lot of thug in me (Maybe it's the thug in me)\nThat I wanna give to you girl\n\n[singing]\nGotta be a thug in ya (thug in me)\nA little bit of thug in me, a little bit of thug in ya\nA little bit of thug in me\nI hold a lot of thug in me, you hold a lot of thug in ya\nI hold a lot of thug in me\nI hold a lot of thug in me, I hold a lot of thug in ya\nI hold a lot of thug in me\nNow c'mon, I hold a lot of thug in me\nHold a lot of thug in you, hold a lot of thug in me\nC'mon, hold a lot of thug in me\nGotta be some thug in ya, gotta be some thug in me\nC'mon, hold a lot of thug in me\nI gotta be some thug in ya\nCan you feel it?\nI hold a lot of thug in me, I gotta be some thug in ya\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nDo you want it?\nI hold a lot of thug in me, feel like some thug in ya\n\n[Collision over singing]\nI don't wanna talk, I don't want no explanations\nI don't got no motherfuckin' explanations, y'knahmsayin?\nIt's the thug in me\nDon't be askin' why I'm pullin' your hair\nAnd why I fuck so motherfuckin' thuggish\nThat thug passion, y'knahmean?\nBitch, no mercy\nWhat you scared of? Didn't you come over here to get fucked?\nYou ain't come over here for me to be\nStrokin', and all that bullshit\nYou came over here to get fucked\nShit, if I ain't fuck you thug style\nBitch you'd leave my house talkin' bout, \"2Pac can't serve me\"\nWon't have me crossed up in that bullshit, hahaha\nTurn over! maybe it's the thug in me! ..", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}