{"songs": [{"title": "Head to the Sky", "album": "Prince of the City 2", "year": "2008-02-01", "lyrics": "[Intro: Wiz Khalifa]\nI represent rostrum records\nI represent heavy hustle records,\nI represent G.O.V\nI represent pittsburgh man! Its a whole movement\nIt's alot of niggas out here grinding, we all doing are thing so we have to support ourselves and come together\nShoutout to ID Labs, Shoutout to ID management\nWe gonna do this shit like a fucking prince of the city\n\n[Hook X2]\nI got my ear to the streets, head to the sky\nNiggas wanna hate and I don't understand why\nI'm just tryna get money, Money!\nAnd have the whole world remember me\nSo touch mine and become a memory\n\n[Verse 1: Chevy Woods]\nThey ain't heard about me, although they got to be dead\nWith no soul in they body cause this how I lives\nWe middle finger cops like who y'all rolling on\nStraight conversation I ain't with that holding on\nYou see me ho, I'm gone yeah that's that ray I roll\nAnd ten patron shots, I'm way outta control\nJust like a bad defender I'm way out of my zone\nAnd this is what I tell 'em\nUgh, like what the fuck you yelling 'bout\nThis music shit will be the only time I'm selling out\nNo I can't sell you shit, your phone bling crazy\nI keep them magnums I ain't trying to hear \"that's Kev's baby\"\nI'm on my griz a couple shooter kids\nI guarantee you hear some shots\nU fuck would knock there I ain't knocking shit\nU hear me knocking , cops coming nigga let me in!\n\n(Hook)\n\n[Verse 2: Wiz Khalifa]\nYeah! You see im fly like a bitch drunk like a mothafucka\nHigh as a kite bout to roll me up another one\nBought a couple stacks So team came to blow something shorty why u shaking like that go and show something\nYoung but im stuntin know I stay bossed up ho I got game fuck around and get crossed up\nShe ain't believe me so I did her like hot sauce left her in the wind and her friend got knocked off\nA lot of niggas gettin mad cause im out here making large amounts of paper but it ain't gonna stop\nI'm either on the road makin money or the lab with Kev Tha Hustla, sledgren, lonnie or my nigga young knock\nGetting stupid cash call this a dumb knock,im living that life little nigga your not\nInstead of worrying about me could be getting more gwap,bitch I got mines, u should get yours, you dug\n\n(Hook)\n\n[Verse 3: S. Money]\nKeep my ears to the streets, head to the sky, niggas keep hating and they must wanna die\nMad cause I get it and they hate that im fly my shoes say Gucci ride 745\nIm all about the money, u can see it in my eyes I'mma always keep it real I ain't mever told a lie\nYour boy speak the truth everytime I spit a rhyme\nMy finger on the trigger keep the paper on my mind\nPGH where im from niggas stay on the grind\nMy city ain't safe niggas stay clappin iron\n412 we on the map now baby and money off music spitting raps all crazy\nStill rolling blunts yes I stay hazy\nYour dude 8 sticks now my eyes all lazy\nI was real nigga so how could ya hate me\nKing of the pitt so why try to play me", "image": "https://images.genius.com/68cfefda5eadd906284dd844e0bf9b61.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}