{"songs": [{"title": "Papa Luv It a.k.a Poppa Luv It", "album": null, "year": null, "lyrics": "[Intro:]\nI do this for you baby\nPapa luv it do', y'knowI'msayin\nMmm\n(Do you want to be a player) Yeah\n(Then you got to have that flavour)\nMore of that Mr.Smith flavour, bust ya brain right quick, y'know\n(Do you got to be right) Second move y'knowI'msayin?\n(at all times?) Yeah, all the time, all good\n\n[Verse 1:]\nUhh, that's the sound of the man\nWorkin with the mic in my hand\nReady or not here I come\nIt's another one (Damn, not another one) Yeah\nWe bring it just like dat (like dat)\nDroppin triple platinum flavour on the drum tap\nDog a donut nice and crafty\nPoke your lips out sassy when you ask me\nSpecial request is granted (aah)\nHead all slanted, (uhh) the gym has planted\n(So what you tellin me you're too smooth to pop?)\nIf it pops should I stop 'fore it drops?\nWho knows? Who goes? Who flows?\nMe and you? (Yeah) just remember boo\n(I promise I'll remember) Everything I do girl\n(I promise) I do it for you, word is bond (I know) word is bond\n\n[Chorus:]\nPapa luv it way she does it\n(Do you wanna be a player?) Uh\nPapa luv it way she does it\n(Then you got to have that flavour) Yeah\nPapa luv it way she does it\n(Do you got to be right)\n(at all times) Papa luv it way she does it\n[repeat]\n\n[Verse 2:]\nFeel it, hold out your hands (and) open up (damn)\nNow let it flow from both cups (aw man)\nIs he good? (No doubt) All the time, miss\nIs he right? (No doubt) One of a kind, miss\nNow tell me what you really talkin bout in three words or less\nLadies (get it out) like this\nI luv it when I give it to you raw, baby\nHate to hurt but hurtin makes you crazy (crazy)\nIt's my duty to dig booby\nMake a video (Yo, you mean my own movie) Yup\nYou can star, here we are\nThere's ya blow, let it flow, you already know\nUndress slow, I drop a lil' French on ya\nThen GERONIMO!\nYou wanna bed debut\nTake your time, do it slow, just remember boo\n\n[Chorus]\n[Interlude:]\nThis is that skin music, that midnight-rub-you-right skin music [x3]\nTop choice if ya choose it\n\n[Chorus/Outro:]\nPapa luv it way she does it\n(Do you wanna be a player?) Yeah it's everything I luv\n(Then you got to have that flavour)\nMake it right for ya baby, y'knowI'msayin?\nPapa luv it way she does it\n(Do you got to be right) Take you to the next level, word is bond\n(at all times?)\nPapa luv it, I take you to the next level baby, I'll take you there\nPapa luv it way she does it\nYou see a lot of brothers is afraid to do things like this\nYouknowI'msayin?\nPapa luv it way she does it\nBut I ain't scared to be smooth, baby\nI ain't afraid of love, y'knowI'msayin? I'll take you there\nI'm willing to go there, papa luv it way she does it, word is bond\n(Do you wanna be a player?) It's that flavour I love, y'knowI'msayin?\nI like to bring it like that (Do you wanna be a player?)\nI love bringin it, Ha ha, I love bringin it\n(Do you wanna be a player?) It really is sick, y'knowI'msayin?\nTodd know what I mean (Do you wanna be a player?)\nBig Cole know what I mean\nHuh, Flash know what I mean, my man Zel know what I mean\nWord is bond, papa luv it baby, yeah", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}