{"songs": [{"title": "Talkin’ Shit", "album": "Chase the Cat", "year": null, "lyrics": "[Too $hort]\nThat's all I do is talk shit, no doubt\nYeah I got my nigga B-Legit in the house\nBad Ass Anthony Banks, doin \"Big Thangs\"\n$hort Dog, always representin, always talkin shit, big shit\n(That's what we do)\n\n[Ant Banks]\nIt's been about 15 long years, macking, profiling\nWorking up in the booth off some top shelf Long Islands\nThe big Bad Ass in this motherfucker, see y'all niggas know the half\nStill representing the O, homey the East side, nigga 100th Ave\nUnfuckwittable, see all we bust is rhymes and nuts\nOh yeah you'd probably be fucking with them\nBut nigga you'd never be fucking with us\nMe, $hort Dog and B-Legit; see first of all homey we the shit\nAnd all that other nonsense you other niggas pop is irrelevant\n\n[B-Legit]\nI rock the shit that's hot but got the ice to cool it down\nIn the town when I screw around nonbelievers laying down\nStill activated but low, I'm seldom seen\nWith light green and other things that glow, man whattup dog?\n(?), take no marine time peace\nThen I mack a straight dime piece\nHave her name on everything that a nigga lease, a savage\nI keeps the deeds pink slips and cabbage, silly rabbit\n\n[Too $hort]\nBitch what you thought?\nDis a once a month funky cock-bleeding bitch, you gets NOTHING, yeah!\n\n[Hook: Too $hort]\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nFuck you, you stupid ho\nTell me just what you know\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nI talk the shit 'til I'm old\nSo mother fuck you bitch God damn asshole\n\n[Too $hort]\nI talk big shit, big spit\nI do it on the microphone and get rich\nBitch I'm so God damn mother fucking cool\nSee me and you drool like you're nothing but a fool\nRiding down the strip with B-Legit and Big Ant\nDrinking big gin, smoking big plants\nMy nigga big Bad Ass and B-Lah do it big\nDrink the whole bottle bitch and give you a swig\nBut don't take it personal, that's just how we kick it\nPull out a big dick quick and make you lick it\nAnd after you finish, make sure you do my nigga\nSwallow all the cum bitch, and then you get a swigga\nSomething that'll quench your mother fucking thirst, head first\nTalk about your ass in a verse\nWhat's worse, if I put your name in a rap\nOr get all in your face while I snap, bitch?\n\nOh you hoes better watch what you doing\nCause niggas around here, we talk bad about bitches, for real\n\n[Hook: Too $hort]\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nSo much game, when a homie's tough\nI make a bitch blow who never sucked\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nSo check it out, freak nasty\nYou think you're fine but you look like Lassie beitch!\n\n[B-Legit]\nI bust a bad bitch daily afternoons\nStop by hair saloons, and make the sad bitch pay me\n180, in the middle lane, I pop bottles\nExpensive models, do their damn thang\nClaim they got a little game, it ain't strange\nTo live tucked away, with no sidewalks, so bitch stay the fuck away\nAnd you can go play, with your momma or something\nFar as drama or something you punk nutting\n\n[Ant Banks]\nWe got top notches, so holler when you see 'em\nWe keep our hoes on display at the pimp museum\nWe sport fly-ass suits, ain't gotta rent no tux\nWe mack bitches everyday, they yelling Pimps'R'Us\nNow we frequently heard but seldom seen\nAlways making these hoes fulfill our dreams\nWe keep bitches on they toes, you know they need it\nAnd niggas be still spit this old shit cause we O.G.'d it\n\n[Too $hort]\nYeah man, big shit, that's what we talking\nPutting hoes in headlocks nigga\n\n[Hook: Too $hort]\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nI just laugh, over and over\nWhen a bitch drink sperm like it's a soda\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nA straight start aiming, whoops I missed\nGet back bitch we'll never kiss\n\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nI'm that nigga you'll answer to\nIf I say, \"Bitch jump\", that's what you'll do\nYou know I kept talking shit\nMother fuck you damn shithead bitch!\nI'm Too $hort Baby, way too cold\nMother fucking shit, god damn asshole!\n\n[Too $hort]\nStupid ho\nTell me just what you know\nI'm talking shit 'til I'm old\nSo mother fuck you bitch god damn asshole\nBeitch, fuck you - bitch!", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}