{"songs": [{"title": "Walk This Way", "album": null, "year": null, "lyrics": "What chu wanna do wit em on this one man?\nThe Pimp Squad Click gotta spit'sum pimp shit\nI dunno if I got it in me\nGot to\nWell I tell you what this as close to some pimp shit I can get\nInna pitch black six, kicked back lettin' the purp blow the\nFire from the dro make the middle of my shirt glo'\nThinkin how I mighta loss the one I always searched fo\nOne to make me stay at home and one to go to church mo\nMoney and the bundles it ain't nothin we can hurt fo\nBlow a hundred thou at will what chu wanna work fo?\nKeys to the crib what chu worried bout a skirt fo\nYou the one I put all them women out da vert fo\nEveryday I spent wit chu I swear it make the earth\nSo much mo'worth livin' nah you gone and it hurt so\nBad, and it's sad but it's cool I ain't mad\nI still got love fa you boo\nIm jus glad that u found what u need\nBut I adored u believe me\nAstounded cuz i neva believed you'd leave me\nIn this million dolla crib 13 karat ring\nWhat it cost me to drive\nImma king witout a queen\n\n(chorus)\nCome back this way\nCan't spend anotha day without you\nWalk this way\nDont you like our life\nI see about you\nPlease say yes\nDarlin' please say yes, tonight\nAnd for the rest of your life\nNah imma bout to tell you all the things that I won't do\nStayin up all night worried tryna call you\nMindin ya business tryna find out what cha into\nAskin stupid questions tryna aggravatin ya mental\nI got muh own business and i got muh own friends too\nI jus hope the money and the fame dont change you\nLet dat good shit go to waste it be a shame too\nDats jus like cuttin off the wings of an angel\nHundred thousand songs like this couldn't explain you\nThe best trainer known to da' world couldn't tame me\nI jus kinda figured out cha name when i came thru\nMoney ain't a thang shit i ball wit the best boo\nBehead her like some like some purple thrax hold it in your chest boo\nThank about u layin in muh arms as I caress you\nLet cha self go mattbonie will protect you\nIts best you weigh out all yo options cuz im chosin u\n\n(chorus)\nCome back this way\nCan't spend anotha day without you\nWalk this way\nDont you like our life\nI see about you\nPlease say yes\nDarlin' please say yes, tonight\nAnd for the rest of your life\nIm sayin baby\nI call you every damn day\nAnd you always give me the same excuse\nYou know, you gotta go to work\nYou gotta excercise (God damn bitch)\nYou gotta go yo homework\nIm sayin tho baby\nJust answer me this one thang\nWhen do you fuck?\n\n(chorus)", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}