{"songs": [{"title": "The Deep Web Tour Blog - Part 1", "album": null, "year": null, "lyrics": "RAP GENIUS NOTE: We suggest you first read this blog on blog.thedeepwebtour.com for the full authentic experience. This page is a tool for further exploration\n[Page 1]\n[Page 2]\n[Pages 3-7]\n[Page 8]\n[Page 9]\n\nAll i do is see bars, u should\nHandcuff 'em\nScreamin \"jesus\" while i'm in\nHer, that's the second cumin...\n\n\n...i'm going to hell\n[Page 10]\n[Page 11]\n[Page 12]\n[Page 13]\n\nThe DEEP WEB TOUR started\n\nOakland was hard because we didn’t play.  which was weird.  people were mad.  but then someone got married, rather engaged, outside so people got happy again and forgave.  it was the computer’s fault tho\n\nWe talked about getting a tour pet.  stefan is unofficially the tour pet\n\nIt’s very cool to see people use the DEEP WEB app. people draw dicks and swastikas\n\nIn santa barbara, we got to play outside.  i had a burrito for breakfast that morning. it was fun cause fam and i wore backpacks to blend in to the crowd on campus to get there.  someone said “that nigga think he childish gambino”. i did think that\n\nWhen we get to stop at a hotel,  we call down and tell the concierge to check on our children at 9pm because “we’re going out to a cocktail party and they should be in bed by that time”. and when they go up there, steve and swank (two grown men who are probably smoking blunts and listening to young scooter) are up there. the reaction is always enjoyable.  we’re trying to find an older white couple to come downstairs and tell the concierge for us, to really sell it. but we haven’t found someone willing to yet\n\n\n\n“you’re gonna miss every moment of this…of everything.”\n\nSometimes i feel like i’m already gone/ahead and i’m just vividly remembering everything that’s happening in the moment. fur real. sometimes everything feels too familiar to be just happening for the first time. the shows feel like that sometimes. you can’t understand something totally and enjoy it at the same time, i think. but it’s fun to not know all of it.  everybody wants some magic.  something they can’t quite figure out\n\nSomeone put girl scout cookies in the freezer. hot damn\n\n\n\nUNOFFICIAL BUS PLAYLIST\n\nNothin important than money – young scooter\nFall in love – phantagram\nThis song i’ve been working on when im given a moment – me\nWhat you won’t do for love – bobby caldwell\n(the second half of) lost queen – pharrell\nStranger in moscow – tame impala\nThis song she hasn’t released yet, but it’s really good - jean deaux\n[Page 14]\n\nME: are you wearing that?\nRAY: Yes. I forgot. I didn't think it would get this cold\nTHE BUS DRIVER: ...It's always winter on the road\nWe stand there for a sec\n[Page 15]\n[Page 16]\n[Page 17]\nWe would never\nWork in real life\n[Page 18]\n[Page 19]\n\nI'll be right by your side...\nUntil 30058797214379100\n87665892420987640...\n[Page 20]\n[Page 21]\nI make sense\nThat's my angle\n- Steve\n[Page 22]\nThere are no possessions on the road - Fam\n[Page 23]\n[Page 24]\n\nRush Hour is playing on the bus TV\nME: This movie is so good\nFAM: Chris Tucker man, Chris Tucker\nME: (As Chris Tucker) \"Korben. Korben, my man\"\nSWANK: Who's a better actor Will Smith or Jamie Foxx\nME: Will Smith\nFAM: Jamie Foxx\nSTEVE: That's kinda like a Prince Michael Jackson thing\nThey're different things entirely\nWe talk until it's stupid...\n[Page 25]\n[Page 26]", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}