{"songs": [{"title": "Getta a Grip", "album": "That’s My Work, Vol. 1", "year": "2012-12-02", "lyrics": "[:Intro]\nHa ha\nYea\nUh\nReal shit\nCheck it out yo\n\n[:Chorus]\nGet a grip, get it fast\nMore smoke, more cash\nDPG with the blue flag\nOne ratchet ho with a fat ass\nCategory, set it free, west coast\nMotherfucker let it be\nGet a grip, get it fast\nMore smoke, more cash\n\n[:Kurupt]\nGet it good, get it fast\nAll spark, all ass\nHit it 2 times, puff puff pass\nBig Snoop, big Daz\nYoung Gotti, get it Gotti\nSomebody in here smellin like hot karate\nAnd that’s the way you comin up in this\nNo homo, and you expect to crack a bitch\nGame for ya, good to ya\nThen it’s still ‘fore you crack a bitch and let er spoil\nMan I got bitches by the dozen tho\nDidn’t know it, fucked er wrong and cracked my cousin’s ho\nSuperficial, so official, like a referee’s whistle\nTest the G, test to me, next to be test the pistols\nComing off the deep dark circle of the VP\nGray and blue since you knew a Snoop ’92 or 3\nThis is how the motherfucker west is won\nOx cock to knock out his oxygen\nCuz we get it good, get it fast\nMove, dance, everybody sag\n\n[:Chorus]\n\n[:Snoop Dogg]\nUhh, what a nigga really know about getting money out of this?\nTo the house, turn ‘em out, real shit\nGave a bitch real dick, that’s it, what a pity\nNow she workin at sin City, poppin it, droppin it for cash\nHow long this shit gon last?\nI move fast, grab me another ho\nYellow and thick, I’m drinking on tequila\nDrapped in all feela, rollin my weed up\nClick on seeder, straight off the meter\n3 stripes for life, I’m paid my Adidas\nFly senioritas, good time to meet us\n4-20 after dark, down by seritas\nHome of the Steelers, cat feelers and dealers\nOr I’d own a bitch, no lane, for whip up hillas, killas\nThey kill in the day time, wanna be seen\nI’m on a bad bitch, with a purse full of green\nWe grew up on the same blunt but we’re not the same kind\nGame over, nigga it’s game time\nI swing mine like a 6 deuce turnt up\nTil it get loose I’m on the blunt, she on the pill you bitch\nYou…\n\n[:Chorus]", "image": "https://images.genius.com/c130e782c1dcee0d745ccec5e8e07f40.500x500x1.jpg"}], "artist": "Snoop Dogg"}