{"songs": [{"title": "Made Myself a Boss", "album": "Streetz Calling", "year": "2011-09-11", "lyrics": "[Intro]\nStreetz Calling!\nFuture, future\nWhoa, whoa!\nWhoa, whoa, whoa, whoa, ay!\n\n[Hook]\nI walk on Jimmy, got the smoke on loud\nI got perfect attendance, bring that work to yo town\nCause I made myself a boss I made myself I made myself a boss\nI made myself a boss, I made myself a boss\nI paid my grandma rent, and got my lil sister a house\nI keep a pocket full of money any time I'm stepping out\nCause I my made myself a boss, I made myself a boss\nI made myself a boss, Yeah I made myself a boss\n\n[Verse 1]\nI'm walking on a stack of tens, so every step is immaculate\nAll this fucking cash I count, you gon' think I inherit it\nI’m a free band nigga on a heroship\nAll we do is inherit bricks\nCome and get some water whips\nI’m on cancun on a water trip\nI’ll take that cash and flip that cash\nGo to 5th and I’ll spaz\nVersace, (?) Bally bags\nGot a phone book inside my pants\nGot racks in left and right pocket, you know we call them football pads\nWhen I re-up, got to use a ladder when I count them bands\nAy! I talking to Diego, I need 20 I'm in Clay Co\nThey gon go in like an hour\nMoney, cars, bad bitches, good powder\nWith a good connect, you can jug 100 thousand\n\n[Hook]\nI walk on Jimmy, got the smoke on loud\nI got perfect attendance, bring that work to yo town\nCause I made myself a boss I made myself I made myself a boss\nI made myself a boss, I made myself a boss\nI paid my grandma rent, and got my lil sister a house\nI keep a pocket full of money anytime I'm stepping out\nCause I my made myself a boss, I made myself a boss\nI made myself a boss, Yeah I made myself a boss\n\n[Verse 2]\nI dress up in Jimmy, and got it cheap like Wendy\nAin’t got a driver that ending, Ima push to the limit\nI take highway chances, with these rap advances\nI got mouths to feed and I ain’t leaving them stranded\nI go head on with the that paper like a bull\nI get hungry every time when I get full (I get money)\nBitch I’m Tony in my city I got pull\n55 Chevy and it got them doors\nI don't wanna drive it, got he stack put up\nI'm an antique owner, and I'm as hot as a sauna\nComing straight from the corner selling kush marijuana\nPut my hood on TV, look at those shoes on me\n\n[Hook]\nI walk on Jimmy, got the smoke on loud\nI got perfect attendance, bring that work to yo town\nCause I made myself a boss I made myself I made myself a boss\nI made myself a boss, I made myself a boss\nI paid my grandma rent, and got my lil sister a house\nI keep a pocket full of money any time I'm stepping out\nCause I my made myself a boss, I made myself a boss\nI made myself a boss, Yeah I made myself a boss", "image": "https://images.genius.com/7317e7abac3ca19d05f474a34f3a8dce.500x500x1.jpg"}], "artist": "Future"}