{"songs": [{"title": "We Will Rob You", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "1995-09-08", "lyrics": "[Intro: Sample + Slick Rick]\n\"Who in the hell teaches you kung fu?\nYour master must be an ignorant idiot as well!\"\n(Uncle Ricky, would you read us a bedtime story?)\nNah, kid, but I'mma give you one them old Raekwon crime joints\nFeel me? We will, we will\nWe will, we will—here we go\n\n[Verse 1: Raekwon]\nWell it was late one night, walking through the park\nWith my leathered down coat and Wallabee Clarks\nGetting my step on, big shit, big six, big wrist\nSo much excitement in the air, I was crisp\nMoney suitcase, Louis joint\n(yo, Rae, I'mma get some shit just like yours!)\nGo make it happen, black God and get rich\nSaw the D's fly by, in a New Yorker, yup, tints and shit\nThey made a right on me, them last two dicks\nKnow I seen 'em, Max loaded, jog right back to the car\nThey spun around again and blast their shit\nI dropped a Backwood, a puff and then a 6-4-5\nYou'se a live nigga, you almost smashed your shit\nI'mma don my way out the bitch, moving through the car\nNice and slow, two hoodies on and a golden pit\nNigga had a white eye, they both blacked down\nWhat's the clown shit for? The dog jumped in the whip\nIt was a trained one, wops pointed at me (yo, nigga, freeze)\n\n[Verse 2: GZA]\nI told the Chef Raekwon, pump the brakes\nSlow it down, you know these C-Cypher Punks scanned your plates\nRelease the seatbelt off the shoulders, a mile ahead\nThen the vibe got a lot colder when the marksman said\n\"Black niggas in the Jeep, get the fuck out the car\"\nPut your hands where my eyes can see or suffer a scar\"\nHe was a veteran, who kept, pepper spray in the canister\nDonut shop lounger, thirty eight brandisher\nOn top of that, the blunt smoke just rang a bell\nOf his bloodhound who had an acute sense of smell\nBeef tripping, saliva dripping from razor sharp teeth\nThat was pointy as the daggers of the Indian Chiefs\nSame cops known for extorting pimps and booking whores\nAimed Glocks at me and Rae, cause they was looking for\nA few MCs wanted for a string of break-ins\nLast seen, wearing long minks and snakeskins\n\n[Hook: Slick Rick]\nWe will, we will, rob you\nWe will, we will, Glock you\nWe will, we will, what? who? (not you)\nHere we go\n\n[Verse 3: Masta Killa]\nYou know my Clan done ran from Japan to Atlanta with stamina\nPeace to Chef, Mr. Meth\nMove it on your left, with the Iron Lung breath\nGhostface Kill', U-G ill\nDeck so real, Dr. Ason Unique, the medic\nAhh, Allah Just, The Abbott, y'all niggas can't forget it\nYou might catch a Cap if your shit ain't Street\nAllah Mathematics make the cypher complete\nSee knowledge is the foundation of existence\nTo know starts the spark of the flow\nWisdom activation of the Nation moving\nWise words, show and prove or understand the 13 letters\nAnd the Masta, culture be the way of life\nFreedom is reward, who will pay the price for the power\nSpending hour after hour, preparing his self\nFor the hour, now look how refined\nWhen the mind and body is one, every part of me\nSupreme equality, manifest the nature of self\nG-O-D, now build and add on to the truth\nDestroy the bullshit, born incomplete", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}