{"songs": [{"title": "Opposites Attract (Tomorrow W/O Her)", "album": "Overly Dedicated", "year": "2010-09-14", "lyrics": "[Produced by Willie B]\n\n[Intro: Kendrick Lamar]\nWe hurt people that love us, love people that hurt us\nHurt people that love us, love people\nI'm inspired, so get inspired\n\n[Verse 1: Kendrick Lamar]\nAnd so he said \"Why you gotta be so kind-hearted?\nWhy you couldn't be a con artist? Why you couldn't?\nWhy you couldn't be mischievous or just a lil' devious\nThe moment that we first started?\nWhy you never ask for nothing, just a lil' time?\nWhy you let me use yours cus I don't got mine?\nWhy you always lift me up, when I'm completely giving up\nOr when niggas holla, \"What's up?\" you give a dry response?\nWhy you giving me your last knowing you ain't got it?\nWhy you always buy me something when you going shopping?\nWhy you tell me that you love me, Why you always thinking of me\nWant my company rather than going club hopping?\nWhy you treating my momma like she your momma too?\nWhy you making promises that you'll forever do?\nWhatever just to make me happy, wanting us to have a family\nThese are exactly the reasons why I cheat on you\" (Sometimes)\n\n[Chorus: Kendrick Lamar]\nWe hurt people that love us, love people that hurt us\nWe hurt people that love us, love people that hurt us\nWe hurt people that love us, love people that hurt us\nWe hurt people that love us, love people that hurt us\n\n[Bridge: Javonte]\nSometimes I, sometimes I feel we share\nNothing in common, it ain't fair\nBut where do we seem to fall\nWhere do we seem to fall\nTender love and care, once upon a time\nOnce upon a time, we was there\n\n[Verse 2: Kendrick Lamar]\nAnd so she said \"Why you gotta be so mean to me?\nWhy you don't know what you mean to me?\nWhy you always playing games? Why I feel like you ashamed\nOut in public curse me out and make a scenery?\nWhy you got other bitches rolling their eyes at me?\nWhy text messages popping up saying, \"Hi, Daddy\"?\nWhy you treat me like I'm nothing? Why you always at a function?\nI be wanting to go out but you don’t ever ask me\nWhy you slip and say her name when we having sex?\nWhy you always assuming that I still like my ex?\nEvery time we get into it, I'm the one that's feeling stupid\nYou don't need me, you gon' leave me, that's ya favorite threat\nWhy you never know how it feel to be lonely?\nWhy I feel I'm the last option after ya homies?\nWhy you always gotta know that I will never let you go\nEven tho you get violent and put your hands on me?\" (Sometimes)\n\n[Chorus: Kendrick Lamar]\nWe hurt people that love us, love people that hurt us\nWe hurt people that love us, love people that hurt us\nWe hurt people that love us, love people that hurt us\nWe hurt people that love us, love people that hurt us\n\n[Bridge: Javonte]\nSometimes I, sometimes I feel we share\nNothing in common, it ain't fair\nBut where do we seem to fall\nWhere do we seem to fall\nTender love and care, once upon a time\nOnce upon a time, we was there\n\n[Outro: Lamont Carey]\nShe says she loves me\nShe says she loves me\nSo she clings to me, even when I want to be left alone\nBut she's beautiful\nLike, sometimes, when I have things on my mind, she's the perfect person to listen\nAnd she only gives advice, she says, when I give her a cue\nShe says she loves me\nLike when I wake up in the morning, she's sitting on the edge of the bed with a plate of food, wanting to feed me\nShe says she needs me\nShe says she loves me\nOr like when I'm stepping out of the shower, she's standing there with the towel, wanting to, wanting to dry me off\nShe says, she says she loves me\nSo instead of admitting that she has made another mistake\nShe says she loves me... and I don't know about love", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg"}], "artist": "Kendrick Lamar"}