{"songs": [{"title": "Tears of Joy", "album": "Teflon Don", "year": "2010-07-20", "lyrics": "[Intro Skit: Bobby Seale]\nDo you know what we are going to do? We are going to defend ourselves because Huey P. Newton says that, \"Power is the ability to define phenomena and make it act in a desired manner.\" Power is the ability to define phenomena and make it act in a desired manner. Power: if we have the ability to define it, the only next thing to do is get organized. So when a pig walks up to you, or when a pig gets to jiving with the people you be so organized you be learning some tactics, you be learning some revolutionary principles, you be having some guns hid out somewhere, you have some proper tactics that when the pig gets to jiving with you, the pig is wrong, you whip your guns out on him, blow him away, and then you have made the ability, in fact, you have made that pig act in a desired manner\n\n[Intro: Rick Ross]\nSmokin' a fat spliff in a brand new Benz\nNo I.D. on the track, let the story begin, begin\nHah, yeah\n\n[Verse 1: Rick Ross]\nLookin' in the mirror but I don't see much\nStill runnin' the streets so I don't sleep much\nWatchin' the snakes so they don't creep up\nBut the way I'm gettin' this money, niggas can't keep up\nYou niggas can't keep up\nNiggas got beef but it can’t be much\nI'm still walkin' through the crowds like I can't be touched\nTop back all black, Gretzky puck\nIce skater lil' later might let me fuck\nDamn, she might let me fuck\nLast night I cried tears of joy\nWhat did I do to deserve this?\nVacheron on my wrist a year ago\nI didn't even know the bitches exist\nQuarter milli for the mothafucka\nNo insurance on the mothafucka\nAin't life a bitch?\nBut you gotta keep her wet\nKeys open doors so I gotta keep a set\nEverybody know that I'm a lotta people's threat\nBiggie Smalls in the flesh livin' life after my death\nYesterday I read my horoscope\nTell me Lord will I be poor and broke?\nTell me Lord will I be dealin' dope?\nI wanna take my momma to the Poconos\nBut only Lord knows\n\n[Hook: Cee-Lo Green]\nGoodbye, to all the loved ones I leave behind\nAt least they can't see me cry\nAnd I ask, when someone wants to be me, whyyyy\nThought havin' everything would ease my mind\nIf you could read my mind\nMy God, I'm scarred, I have tattoo tears of joy\n\n[Verse 2: Rick Ross]\nLast night I cried tears of joy\nWhat did I do to deserve this?\nYoung rich motherfucker still uneducated\nBut dammit a nigga made it\nGoddamn a nigga made it\nCrib bigger than a church, Lord know I'm blessed\nFive different lawyers, Lord know I’m stressed\nA punch in the face get you 300K\nAsk Vlad, now he back to makin' minimum wage\nAnother victim of my criminal ways\nI wanna walk in the image of Christ\nBut that bitch Vivica nice\nAnd I'm still swimmin' in ice\nI'm just livin' my life\nI'm just livin' my life\nLease a Lamborghini for your pussy rate\nLife is just a pussy race\nSnatch a bitch take her back to your place\nNext morning I can tell you how the pussy taste\nI got expensive taste\n\n[Hook: Cee-Lo Green]\nGoodbye, to all the loved ones I leave behind\nAt least they can't see me cry\nAnd I ask, when someone wants to be me, whyyyy\nThought havin' everything would ease my mind\nIf you could read my mind\nMy God, I'm scarred, I have tattoo tears of joy\n\n[Verse 3: Rick Ross]\nLast night I cried tears of joy\nWhat did we do to deserve this?\nNot to dwell on the the past but to keep it real\nI gotta represent for Emmett Till\nAll the dead souls in the field\nLookin at my Rollie it's about that time\nWhite man had a problem with mine\nAnd we suppose to be shy?\nThe revolution's televised\nBobby still on the rise\n\n[Hook: Cee-Lo Green]\nGoodbye, to all the loved ones I leave behind\nAt least they can't see me cry\nAnd I ask, when someone wants to be me, whyyyy\nThought havin' everything would ease my mind\nIf you could read my mind\nMy God, I'm scarred, I have tattoo tears of joy", "image": "https://images.rapgenius.com/21f98d27036e0a6bfd95a7c1ed9b7036.1000x1000x1.jpg"}], "artist": "Rick Ross"}