{"songs": [{"title": "I’m A Go Getta", "album": null, "year": "2009-12-11", "lyrics": "[Intro]\nMichael Phelps, this for you, baby!\n\n[Verse 1]\nI'm goin' for the gold, my heart is in control\nMy mind is on succeed and I am in the lead\nDon't buy into the schemes, the science or strategy\nJust giant N-U-Ts brings triumph and belief\nI'm a lion or a dean, inspired by the green\nNever tired or fatigued, never defiant to my team\nNever lying on the thing until I'm lying on the thing\nHooked to wires and things; I'ma die as a king\nIf I don't do it now, I'ma try it again\nAnd when I do accomplish it, I'ma try it again\nI'm a riot, insane; I'm a lion, my mane\nHangs down to my strings and they're tied to the game\nI stay dry when it rain, I'm tired of the fame\nGot everything to gain and I'm proud of the pain\nThe pride and the plain, the wise and the strange\nDenied by the sane; besides, we're the same\nWho's guiding the train? Who's flyin' the plane?\nWho's driving the lane? Who dies when it bang?\nWho fires when it bang? Who lies in the aim?\nTwo lives in the drain; who cries when they sang?\nYou hide but you can't; you high but you ain't\nI advise you to think; you'll find what you can't\nRevive what you taint, survive what you paint\nSuper-size what you shrank: the fries and the drank\nAdmired as a saint, defined by my rank\nCombined with my strength, my time and my length\nI'ma iron out the kinks; yes, I'm on the brink\nAnd in the eye of my wink, I'ma retire in the bank\n\n[Chorus]\nYeah, and I'm no quitter\n'Cause I'm a go, I'm a go, I'm a go getta\nAnd I'm no quitter\n'Cause I'm a go, I'm a go, I'm a go getta\nYeah, I'm gon' get it, I'm gon get it\nYeah, I'm gon' get it, yeah\n'Cause I'm a go, I'm a go, I'm a go getta\n\n[Verse 2]\nVictory consistantly\nTrain all year to be the enemy's misery\nNo stress visibly, neither does it enter me\nI think positively; you can't harm me mentally\nNot physically, not spiritually; you'll never get rid of me\nI am the epitome of \"this is what you did to me\"\nNothin's what you did for me, nothin's what you give to me\nI take whatever I'm visualizing, now break all of the limiting\nNow shake all of the gimicking, the fakery, the trickery\n\"Nurse, how sick is he?\" \"Worse, I am sickening!\"\nI'll be at the finish line first, \"how quick is he?\"\nI'ma make sure they mention me for the next century\nI ain't with the bickering, I am full of dignity\nI am full of energy, pull out the inner me\nOr bull after dinner meat, I stood in the winter heat\nIt could be the end of me, but good be defending me\n\n[Chorus]\nYeah, and I'm no quitter\n'Cause I'm a go, I'm a go, I'm a go getta\nAnd I'm no quitter\n'Cause I'm a go, I'm a go, I'm a go getta\nYeah, I'm gon' get it, I'm gon get it\nYeah, I'm gon' get it, yeah\n'Cause I'm a go, I'm a go, I'm a go getta\n\n[Verse 3]\nI'm allergic to cheatin'\nI hate failure and I'm in love with achievement\nAbove and beneath it, a hug when I greet it\nMy eyes on the prize and I love when I seek it\nDone with the speakin', begun with the preachin'\nNow pray, until I am one with the deacon\nNow play, until I have won whatever we win\nI play, until I have won, and then I re-win\n\n[Chorus]\nYeah, and I'm no quitter\n'Cause I'm a go, I'm a go, I'm a go getta\nAnd I'm no quitter\n'Cause I'm a go, I'm a go, I'm a go getta\nYeah, I'm gon' get it, I'm gon get it\nYeah, I'm gon' get it, yeah\n'Cause I'm a go, I'm a go, I'm a go getta", "image": "https://images.genius.com/cea8e06429d17ecf72edf44b6e2dfa85.500x500x1.jpg"}], "artist": "Lil Wayne"}