{"songs": [{"title": "The Tape Intro", "album": "The Odd Future Tape", "year": "2008-11-15", "lyrics": "[Intro]\nAnd I present to you\nTo you all\nThe Odd Future compilation\nFuck, give it up\nStarring\nCasey V, Hodgy Beats, Left Brain, Super 3, and Tyler, the Creator\nGive it up! Give it up for ‘em!\nWill y'all shut the fuck up?\nDamn, I’m here\nAlright, let me configure this\nGet this ready\nAlright, let’s go\n\n[Tyler, the Creator]\nNigga seventeen his own fucking magazine\nAnd of course his Hunger Force is Aqua Teen by all means\nFuck a deal, signature is legible\nI'm the reason why niggas is heatin' up they vegetables\nFrom being bullied in the sixth, to being dissed by any bitch\nThat can breath, please throw me in a ditch\nAnd I hope I sell a copy of this disk\nFuck Hope, I am one short, a miracle of wish\nWhether you nigga or ese, the magazine is great\nBecause the articles an essay\nHalf you dumb niggas can't even write an essay\nCause all of ya'll some stupid asses, S.A\nYou motherfuckers in denial\nI'm the square just like the tile, right down the fucking isle\nMusic was my only friend, ever since I was a child\nI make niggas frown, just to give myself a smile\nMother was my father, the nigga didn't bother\nTo send a kid a dollar, my only role model was\nNiggas that record and that could play keyboards\nAnd wild piano chords make me happy\nDr. Suess more important than Jesus\nY'all immigrants to depression, nigga give me a visa\nWe sick, the same lames that sneeze us\nMade us turn to Jazz now, because the black kids would tease us\nI need a fucking chain, I need to make it rain\nI need some fucking rims, a car that I can rent\nA verse about swag, jeans sagging off my ass\nNo I don't, fuck that, I am not a fucking fag\nI rhyme and I'm still scared of guns\nIn the marching band but I bang my own drums and\nSing my own song, all of my wrongs are right\nNever got into a fight, hit me\nBass, drum, snare, let it go\nDisappear like good music in the past year\nAnd everybody do the same thing, I hear the same shit\nAll the time, like the radio is queer\nThis isn't a mixtape, it's more of ear rape\nBy kids who think you other niggas suck\nIt's very offensive, you niggas defensive\nIf you can't take the heat then get the fuck out the kitchen, listen\n\n[Outro]\nTyler the Creator, Hodgy Beats, Super 3, Casey V, Left Brain\nEnjoy the show, good night, thank you, and fuck you", "image": "https://images.genius.com/95006fc0c5c08dc0b6ea167151ba467a.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}