{"songs": [{"title": "Is She Gon Pop", "album": "Born Sinner (Deluxe Version)", "year": "2013-06-18", "lyrics": "[Intro]\nYeah\nYeah\n\n[Verse 1]\nArt of seduction, hoes jump like Vince Carter\nBackstage like they a part of production\nWe talked about her dreams, you gotta start off with something\nHer momma went to college but yet her father was hustling\nFound it funny 'cause now they daughter is stuck in\nA similar predicament, I'm askin' where her nigga went\nShe said \"Your guess is good as mine\nDropped outta school now he run the streets like all the time\nLeft me alone with this baby I don't hear from the nigga\nAnd to keep hundred with you I don't care for the nigga\nWell, movin' on\nFunny 'cause I only know a couple of your songs but I love when they come on\"\nWord?\n\n[Hook]\nI'll take it, baby I'll take it\nWhy I'm starin' at you 'cause I'm picturing you naked\nKnow what's on your mind, embrace it, do not fake it\nTonight is what you make it, take it, do not waste it\nTake a shot, you not wasted\n[mumbling]\nI'm in a small ass town with a superstar chick\nThis is superstar dick, girl how could you not taste it?\n\n[Verse 2]\nThat's a little ego—\nTistic, my amigos be hocking in Toledo\nNiggas winning off me, it's all G 'cause he know\nBitches can't get the Michael so they settling for Tito\nWe know, yeah nigga we know\nHot bitch fell in my lap like cappuccino\nNiggas so thirsty it irks me\nYou keep on putting bitches over money but that ain't my cup of tea though\nNah nigga, the game is to get\nA bunch of paper just to change your fucking neighbors and shit\nI swear if niggas put half of what they put in chasing ass\nInto a craft, by now you'd be famous and rich, huh\nBut I get it, you rather lay with a bitch\nWhile you play with her pussy, and let her play with your dick, huh\nShe thinking she got a first round pick, huh\nShe thinking 'bout all the things she can get, huh\nShe thinking you got a Range for a whip\nAnd a fly ass cribbo, but it's not that simple 'cause\nAll you got is a phone full of bitches\nAnd they just like her\nMeanwhile I'm stacking paper up, my word\nHad more hoes coming than a bus driver\nGot a full grown woman wanna fuck my word\nWanna ride my nouns, let her suck my verbs\nAye\n\n[Hook]\nI'll take it, baby I'll take it\nWhy I'm starin' at you 'cause I'm picturing you naked\nKnow what's on your mind, embrace it, do not fake it\nTonight is what you make it, take it, do not waste it\nTake a shot, you not wasted\n[mumbling]\nI'm in a small ass town with a superstar chick\nThis is superstar dick, girl how could you not taste it?", "image": "https://images.genius.com/963939859e3141f31cdf1b3d92cac677.1000x1000x1.jpg"}], "artist": "J. Cole"}