{"songs": [{"title": "You Can Tell How I Walk", "album": "Paperwork: The Motion Picture", "year": "2014-10-21", "lyrics": "[Hook. T.I.] (x2)\nYou can tell how I walk, I'm a boss (I'm a boss)\nYou can tell how I speak, I'm a king (I'm a king)\nYou can tell how I walk, you can tell how I walk\nYou can tell how I speak, I'm a king\n\n[Verse 1: T.I.]\nWhen I'm walkin' up, I'm bossin' up\nAnd not even on purpose bruh\nYou talk too much, you soft as fuck\nYour type I've seen it all too much\nYou don't want no boss, uh, and we knew it\nAnd life for you or we make you cough it up, and keep going\nI welcome you to danger zone\nNow you continue on at your own risk\nAnd I ain't with the scary shit cause when it's on, it's on\nAnd I ain't gonna be backing down for shit\nI'm ridin' chrome, going home with Hawaiian chick\nI ran a major operation, you shit minor a bit\nI walk like this designer cool cat around this bitch\nAnd when I speak to you, King shit is all you get, nigga\n\n[Hook] (x2)\n\n[Verse 2: Rick Ross]\nWho fuckin' with fat boy, I traffic my body weight\nSo much cake in the club damn near caught me a fair case\nMy old school is running Gatorade in my Chevy\nMy money is safe, I'm runnin' last [?]\nWe barricaded in front, the waterfalls in the back\nEnough crack for a month, you smell it all in my raps\nNiggas wanna be famous, I want the luxury tax\nNot one of my checks look like my company facts\nI'm pumpin' my gas comin' down Cleveland Ave\nHow much a nigga worth? Ho don't even ask\nTen mill with Diddy, I'm getting money with Tip\nWhen you see me in the city then it's money we get\n\n[Hook] (x2)\n\n[Verse 3: T.I.]\nHe in more shit, sure get the call he know\nHe go too far, twenty west he better holla at them\nA nigga catch [?], Hustle Gang at ho\nSay Trae The Truth gon' cut the fool, give 'em fifty to go\nYou the [?], we don't mention it though\nTold you before who about that action but you weren't listening though\nI'm in the BM got you [?]\nShe fucked 3 ho bust in her throat then she one homie proposed\nWe in the Lambo raising the dough\nActing like an Atlanta nigga never made it before\nWe actin like we never made it before\nIn case I ain't say it before , 2014\nTill I got a .40 Cal and 2000 in my jeans, nigga\n\n[Hook] (x2)", "image": "https://images.genius.com/0aedeee6f38d44bf87bbee70cb36cca3.640x640x1.jpg"}], "artist": "T.I."}