{"songs": [{"title": "They.Resurrect.Over.New.", "album": "Tetsuo & Youth", "year": "2015-01-20", "lyrics": "[Verse 1: Lupe Fiasco]\nDark matter with the sparks scattered up above, velvet hands in the upper glove—touch\nLike bad double dutch, and two Amsterdam's ain't enough—D.R.U.G.S. \n\"Don't ruin us,\" God said—DROGAS—too much pride we electric slide\nWe should be closer, like soca, not a chain, but a choker\nI see the sun then the clouds then the vultures, pay respects in my sensei's sculpture\nHigh as the angel on Dikembe's shoulder, eyes looking like MKUltra\nRedacted vision through these dark shades, bad dreams through the screens of an arcade\nHangin' on the joy like the residues of heartbreak, park full of art, arteries full of parkay\nBeating it, like new games, easily defeating\nOr two gangs meeting for the evening, or two feet on a Riesling (Yeah!) slow wind\nMeditate until there's no mind, decorate me with shine till I go blind\nBDSM dominated it with no bind, safe word is \"Don't stop,\" both, or don't go no times\n\n[Chorus: Lupe Fiasco]\nProceed to the next level\nT.R.O.N\nProceed to the next level\nT.R.O.N\n\n[Verse 2: Lupe Fiasco]\nCoolest, tulips; flowers, fall from the towers\nLike balls from Galileo to lay low, ignorance is that the world isn't ours—the gall!\nGive them all showers, Tony found the fountain of youth, in the mountain of powder\nTo only find truth in the fountain, drownin' in power, surrounded with dollars\nThe moon surrounds us like spoons moving chowder—cut—that's a misdirect\nTo stir the soul with diseffect, names don't last like Mr. X, unless you Galilee\nDroppin' bowling balls on the discotheque, with a disco ball hanging 'round your neck\nDance—it's a new year, every time I open my hands\nThoughts moving circles and the thoughts universal, yokozunas throwing salt in the circle\nSumo you up off off your turf boy, tsunami you up off your surfboard\nMidas turn Medusas into gold, 'fore Versace turned words into turquoise\nMedusa turned coke into stone with a hand on her thigh, she looked me in the eye and said—\n\n[Bridge: Lupe Fiasco + Troi + Ab-Soul]\n(Proceed to the next level)\nCome so far, seen so much\nT.R.O.N\nI cannot settle for good enough\n(Proceed to the next level)\nSo I'll sweat and I'll climb\nT.R.O.N\nUntil I reach my prime\nThe forces rise and fall again\nThrough it all, I'll reach the end\n(Proceed to the next level)\nIn my eyes, there's a fire\nAnd it takes me high\nUh!\nYeah\n\n[Verse 3: Ab-Soul]\nSoulo! Shoot for the moon, even if you miss, you'll be among the stars (Space)\nBackstroke in my pool of thought but don't mind the sharks (Wavy)\nAb-Solar-system—intergalactic soldier (Uh)\nLupe say I'm a stoner—I said that I'm much bolder (Yeah)\nTrapped in a game where the trap is the game, yeah (Word)\nScope this horror, Aquariuses make it rain here\nNo love for Your honor—only God can judge us, if you're Islamic, Allah (God!)\nI've had it up to my collar with these niggas castin' stones like this Mancala (Uh)\nProceed to the next level, dig that with a platinum shovel—Black magic (Black magic)\nMatter of fact—if matter is fact? A matter-factory is in the makin', perhaps\nUh, erase your database, we race against time, no time to set a date\nTetsuo & Youth-induced, too cool for school, unloose the noose and—\n\n[Chorus: Lupe Fiasco + Ab-Soul + Troi]\nProceed to the next level\nSoul!\nT.R.O.N. (T.R.O.N.! T.R.O.N.! T.R.O.N.!)\nProceed to the next level\nT.R.O.N\nProceed to the next level\nT.R.O.N. (T.R.O.N.! T.R.O.N.! T.R.O.N.!)\nProceed to the next level\n(T.R.O.N.! T.R.O.N.! T.R.O.N.! T.R.O.N.! T.R.O.N.!)\n\n[Outro: Troi]\nWe're going up, we're going up\nNext level, next floor\nI'm ready for it, I've been waiting all my life\n(T.R.O.N., T.R.O.N.)\nWe're going up, we're going up\nNext level, next floor\nI'm ready for it, I've been waiting all my life\n(T.R.O.N., T.R.O.N.)\n\n[Produced by DJ Dahi & Blood Diamonds]", "image": "https://images.genius.com/8c9f45d15475bdce48998bef15fad39d.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}