{"songs": [{"title": "Still Dope", "album": "Born Like This", "year": "2009-03-24", "lyrics": "[Verse 1]\nI'm still dope even if the bag ain't Coach\nEven if I don't smoke till the hydro roach\nI'm still dope, rock a thrift store coat\nAnd a fresh pair of moccasins\nComfortable for walkin' in\nNo A&R marketin'\nThis is my reality\nStill dope, power walk, burning off the calories\nFact and not fallacy, Metal Face family\nImminent fatality, taking us too casually, I--\nGot it, it's cool, just\nPart of the school, and I'm\nAcing the lesson, it's time, so quit stressin'\n\n[Bridge]\nStill dope, vibrant, natural game:\nNo ring, no chain, still bringin' the pain\nStill dope, got no choice but to cope\nListen, take notes, I'm showin' you the ropes\nStill dope, very high dosage\nMy approach is lights out, \"Buenos noches.\"\n\n[Verse 2]\nHold my glasses so I can get Riddick\nSend 'em home tail tucked, holdin' they fitteds\nCold as a Guinness--\"One pint miss!\"\nYo Chill, watch the table a fish might flip!\nCrack jokes spit--\nPop mad shit--\nThat's what it's made for, cop that quick\n\"Drop that, vic!\" Butterfingers, oopsie\nSigned away your publishing for Jordans and a loosie?\nThe old one-two, see; solo not groupie\nAll over they ass like sweats by Juicy\nCats is puss like Sagwa and Morris\nStay spittin' lines, there is no chorus\nDeploying the troublesome, sleep in bubblegum:\nThat's a double dumb, hum if you feel where I'm comin' from\nDo it till ya lips are numb, you gotta go for it\nI stay moving forward; I'm baby bear porridge\n\n[Verse 3]\nKnick-nack paddywack, fuck ya'll critics\nThis dime on the grind when it come to the spinach\nConquered the Id, Vicious like Sid flow\nNot a nympho, IMpress Official!\nShe rock mikes; you wait to exhale\nShe rock shows like DMC rock Cazals\nShe rock shells, manicured nails\nRock for every belle with a spliff to inhale\nHoldin' she own cone of homegrown shrubbery\nWon't go hungry: the flow too lovely!\nLeavin' grills dented on a SUV rented\nClassic as vintage Impalas that's all tinted\nRaw bidness: like how them wifeys get hitted\nAuthentic, the track is so love, I'm all in it\nAww quit it, of course I'm inclined to shine, did-ick\nLine for line wit it, climbin' infinite\n\n[Verse 4]\n¿Tu no sabe? Yo soy una bien mala madre\nConfident aren't we? Playin' it smartly\nWord to Dios, Estrella is lethal\nFlow muy frio, roll the dice chico\nLive crazy decent insanely frequent\nStrangely sleep wit' one eye open not jokin', outspoken\nProvokin' and chokin', ego strokin' is lame\nWord bonder than James, four alarm wit' the flame\nWay ahead of the game, still playing the same\nRoyalty in my veins, it'll always remain\nForever doin' my thing, solo or crew I can hang\nLike ylang and ylang, bring the Yin to the Yang\nThey got placenta for brains, testing my venomous slang\nFools get fitted for bangs and rented for change\nSome people think I'm deranged, others a little bit strange\nJust trying to rattle my cage, cause I'm way outta they range", "image": "https://images.genius.com/01edf9d69a6ac635d7ca4d452539e8ce.1000x1000x1.jpg"}], "artist": "MF DOOM"}