{"songs": [{"title": "Pistol To My Head (Remix)", "album": null, "year": "2017-03-13", "lyrics": "[Intro]\nIs there a heaven for a baller?\nPistol to my head - every time I call her\nPistol to my head - they wonder if I'm hellbound\nCan't be worse than this, 'cause I'm in Hell now\nPistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head\n\n[Verse 1]\nThey wanna bury me, I'm worried, I'm losin' my mind\nLook down the barrel of my nine and my vision's blurry\nFallin' to pieces, am I guilty? I pray to the Lord\nBut he ignores me unfortunately 'cause I'm guilty\nShow me a miracle, I'm hopeless, I'm chokin' off\nMarijuana smoke, with every toke it's like I'm losin' focus\nFallin' to sleep while I'm at service, when will I die?\nForever paranoid and nervous because I'm high\nDon't mention funerals I'm stressin', and goin' nutty\nAnd reminiscin' 'bout them niggas that murdered my buddy\nI wonder when will I be happy, ain't nothin' funny\nFlashbacks of bustin' caps, anything for money\nWhere am I goin' I discovered, can't nothin' save me\nMy next door neighbor's havin' convo with undercovers\nPut a surprise in the mailbox, hope she get it\nHappy birthday bitch, you know you shouldn't-a did it\n\n[Chorus]\nEverybody dying - I'll be back\nPistol to my head - reincarnated as a MAC\nPistol to my head\n'Cause in heaven there's no shortage on G's\nMotherfuckers don't know me\nI put the pistol to my head\nIs there a heaven for a baller?\nPistol to my head - every time I call her\nPistol to my head - they wonder if I'm hellbound\nCan't be worse than this, 'cause I'm in Hell now\nPistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head\n\n[Verse 2]\nEverybody's dyin', am I next? Who can I trust?\nWill they be G's, and they look at me before they bust?\nOr will they kill me while I'm sleepin'?\nTwo to the head while I'm in bed\nLeakin' blood on my satin sheets\nIs there a heaven for a baller?\nI'm gettin' suspicious of this bitch\nThe line's busy everytime I call her\nNow she's tellin' me to visit, who else is home?\nI check the house before I bone, so we all alone\nAfter I nut I hit the highway -- see ya later!\nTo all the players, watch the fly way a nigga played her\nThe bitch is tellin' all her homies that I can fuck her\nLike no other now them other bitches wanna bone me\nI'm under pressure, gettin' drunk, somebody help me\nI drink a fifth of Hennessy, I don't think it's healthy\nI see my enemies, they creepin', don't make me blast\nI watch the 5-0's roll, the motherfuckers pass\nBy me like they know me, smilin' as they laugh\nI put up my middle finger, then I dash\nNiggas don't like me, ‘cause I'm thuggin'\nAnd every day I'm a hustler lookin' to get paid\n\n[Chorus]\nEverybody dying - I'll be back\nPistol to my head - reincarnated as a MAC\nPistol to my head\n'Cause in heaven there's no shortage on G's\nMotherfuckers don't know me\nI put the pistol to my head\nIs there a heaven for a baller?\nPistol to my head - every time I call her\nPistol to my head - they wonder if I'm hellbound\nCan't be worse than this, 'cause I'm in Hell now\nPistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head\n\n[Verse 3]\nThey wanna bury me, I'm worried -- no need to lie\nI pray to God I don't scream when it's time to fry\nNowhere to rest, I'm losin' homies -- ain't that a bitch?\nWhen I was rich I had clout, now a nigga's lonely\nI put the pistol to my head, and say a prayer\nI see visions of me dead, Lord, are you there?\nThen tell me, am I lost? ‘Cause I'm lonely\nI thought I had friends, but in the end a nigga dies lonely\nNowhere to run, I'm in terror, and no one cares\nA closed casket at my funeral and no one's there\nIs there a future for a killer? I change my ways\nBut still that don't promise me the next day\nSo I stay thuggin' with a passion, forever blastin'\nI'm bustin' on these motherfuckers in my madness\nThey wonder if I'm hellbound\nWell, Hell can't be worse than this, ‘cause I'm in Hell now\nDon't make me hurt you, I don't want to, but I will\nSeen motherfuckers killed over phone bills\nNever will I die, I'll be back\nReincarnated as a motherfuckin' MAC\n-11, ‘cause in Heaven there's no shortage on G's\nI'm tellin' you now: you motherfuckers don't know me\n\n[Chorus]\nEverybody dying - I'll be back\nPistol to my head - reincarnated as a MAC\nPistol to my head\n'Cause in heaven there's no shortage on G's\nMotherfuckers don't know me\nI put the pistol to my head\nIs there a heaven for a baller?\nPistol to my head - every time I call her\nPistol to my head - they wonder if I'm hellbound\nCan't be worse than this, 'cause I'm in Hell now\nPistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head\n(Pistol to my head)\n(Pistol to my head)\nI put the pistol to my head", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}