{"songs": [{"title": "Release Yo’ Delf (Prodigy Remix)", "album": "Tical", "year": "1994-11-15", "lyrics": "[Verse 1: Method Man]\nCheck it, I'm the fucking man, who they mention\nNoticed that other niggas rap styles is bogus\nDoo-doo compared to this versatile voodoo\nBlazing, the stuff that ignites stimulation\nInside ya, cause I be that hell sure provider\nProviding the rhyme that be deep as the Poseidon Adventure\nNiggas need to test they freaking tincture\nFor the sickness that be spreading with the quickness\nRemedies, cousin I be doing on my enemy\nPenalty, then I drink forties to they memories\nEmotion, coursing through your town street vicinity\nBlunt smoke in the air reveals my identity\n\n[Chorus: Method Man]\nWhat's that rhythm, what's that sound?\nParty people getting down\nWhen it hit no doubt about\nJust release, yo delf!!\n\n[Break 1: Method Man]\nKeep it movin', baby, we be movin', uh\nAnd keep it movin', you know we keep it movin', uh\nKeep it movin', baby, we be movin', uh\nAnd keep it movin', you know we keep it movin', uh\nAnd keep it movin', baby, we be movin', uh\nAnd keep it movin', you know we keep it movin', uh\nAnd keep it movin', baby, we be movin', uh\nAnd keep it movin', you know we keep it move\nRHARHHH!\n\n[Verse 2: Method Man]\nMy God, somebody said it's on, if it is then I'll be set\nTo blow a nigga up with my \"Five Fingers of Death\"\nI bring it to his whole damn fam, understand if you fronting\nOn any man down with the Clan, I be coming\nFor the headpiece you can't cope\nFor my brother, I bring it to the Pope, word to mother\nSerial killer style from the Isles of Stat\nMy peoples are you with me, where you at?\nShit's getting deep in here, I mean like thick\nNiggas looking all in my face like they want dick\nIt's about to hit the fan, hit the floor\nThat's all I can stands, and I can't stands no more\nWhat is it? Niggas think they bigger\nBecause they got their finger on the trigger of a biscuit\nThey don't know I'm wicked when I start to kick it\nEat they raw sound, wash it down with a Mistic\nBetter yet a Snapple\nNigga want the juice but he don't want the hassle\nSo we're trying to overthrow the castle\nBetter yet the temple I'm coming to your town black down\nThe rental car, the pistol cocked\nIf you don't want to burn from the Glock\nThen beware, I buck shots, meaning what?\nThe buck stops here, no more dough will be made\nUnless it's being made by who?\n\n\n[Chorus]\nWhat's that rhythm, what's that sound?\nParty people getting down\nWhen it hit no doubt about\nJust release, yo delf!!\n\n[Break 2: Method Man]\nKeep it movin', baby, we be movin', uh\nAnd keep it movin', you know we keep it movin', uh\nAnd keep it\nMovin', baby, we be movin', uh\nAnd keep it movin', you know we keep it move\nRHARHHH!\n\n[Outro: Method Man]\n\"And keep it\"\n\"And keep it\"\n\"And keep it\"\n\"And keep it movin', baby, we be movin', uh\"\n\"You know we keep it\"\n\"We keep it movin'\"", "image": "https://images.genius.com/e8eea98eab886487258b11bd4e1cca4b.1000x1000x1.jpg"}], "artist": "Method Man"}