{"songs": [{"title": "Same Hoes", "album": null, "year": "2016-06-16", "lyrics": "[Intro: Rick Ross]\nWe likin' these hoes\nPics and all that\nAnd we all fucking the same hoes\nThe basketball niggas\nThe acting niggas\nFucking the same hoes\nThe same ones my nigga\nBounce\n(Maybach Music)\n\n[Hook: Rick Ross]\nMe and Pusha T fuckin' the same hoes\nMe and TIP, we fuck the same hoes\nMe and Chris Brown, we fuck the same hoes\nThe same hoes\nThe same hoes\nMe and Justin Bieber fuck the same hoes\nMe and Snoop Dogg, we fuck the same hoes\nMe and Yo Gotti fuck the same hoes\nThe same hoes\nThe same hoes\n\n[Verse 1: Rick Ross & (Puff Daddy)]\nMe and Steve Harvey fuck the same hoes\nMs. Universe, they all the same hoes\nForget they name nigga, know the saying goes\nBut I put her on her feet in that new Range Rov\nMe and Mayweather fuck the same hoes\nMoney team, money green, mean Lambo\nMe and P. Diddy fuck the same hoes (that's right)\nCause rich niggas always fuck the same hoes\nMe and Russel Simmons fuck the same hoes\nBeen runnin' through the shows since the payphones\nTop down at the light, you know the word out\nHe get them turned out up at the absurd house\n\n[Hook: Rick Ross]\nMe and Pusha T fuckin' the same hoes\nMe and TIP, we fuck the same hoes\nMe and Chris Brown, we fuck the same hoes\nThe same hoes\nThe same hoes\nMe and Justin Bieber fuck the same hoes\nMe and Snoop Dogg, we fuck the same hoes\nMe and Yo Gotti fuck the same hoes\nThe same hoes\nThe same hoes\n\n[Verse 2: Rick Ross & (P. Diddy)]\nMe and Kevin Hart fuckin' the same hoes\nI'm 'bout to shoot a movie usin' all the same hoes\nBouncin' through the college for the campus hoes\nPromise them I'm a scholar, always gotta sample those\nRun your credit shopping cause I need a favor\nI got broads in Atlanta, trappin' in the Decatur\nMe and David Beckham fuckin' the same hoes\nApartment in Tribeca on the third floor\nMe and Busta Rhymes, we fuck the same hoes\nThree days later, seen them in the hat and change clothes\nThey fuck with me but they say their favorite artist is J. Cole\nAin't trippin' baby, this is how the game goes\n(Let's go nigga)\n\n[Hook: Rick Ross]\nMe and Pusha T fuckin' the same hoes\nMe and TIP, we fuck the same hoes\nMe and Chris Brown, we fuck the same hoes\nThe same hoes\nThe same hoes\nMe and Justin Bieber fuck the same hoes\nMe and Snoop Dogg, we fuck the same hoes\nMe and Yo Gotti fuck the same hoes\nThe same hoes\nThe same hoes", "image": "https://images.genius.com/03398537a5dd538e1387b361a9ce9d72.300x300x1.png"}], "artist": "Rick Ross"}