{"songs": [{"title": "Baby Come On", "album": "Tical 0: The Prequel", "year": "2004-05-18", "lyrics": "[Intro: Method Man]\nUh.. that's right, oh yeah\nBack with some nasty shit, right there\nNasty, nasty, girl, nasty girl, baby come on\nThink you a nasty girl, yea\n\n[Method Man]\nPretty young thing like to bone\nAnd she hate to spend her nights alone, baby doll you in the zone\nWhy not call me on the phone, and invite me home\nCome on, now, baby, come on-on\nKnow what I mean, take a real queen to fuck with me\nTrustin' me, and give it up for free\nNext time, feel free to hit me up, anything you wanna puff a tree\nCome on, now, baby, come on-on\nWhats shaking yo, stop stallin', what you waitin' for?\nYou know we both ain't got no place to go\nSo roll it up, and lay low\nEverytime I say, yes, baby, you say no\nCome on, now, baby, come on-on\nNow-now, now-now-now, you don't have to stay\nIt's ok, there's the dough, you can walk away, why make we wait\nTil tomorrow, when you can break me off today\nCome on, now, baby, come on-on\n\n[Hook: Kardinal Offishall]\nYeah! Gal dem we love, and gal we need\nShe crush up me things and light me weed\nWe see dem shotgun, and watch me speed\nMe need a pringy one or pon we need it\nGal dem we *ugh*, and gal we screw\nWhen we need the girl, up one night po' half me crew\nAnd lick on my collection, and what to do\nMe need a nasty girl, it could be you, eh!\n\n[Method Man]\nI won't lie, I love P-U-S-S-Y, (why?)\nCuz I never let it walk on by, or any slice of the american pie\nCome on, now, baby, come on-on\nGirlfriend, you know it's half past two A.M\nYou got a friend, but you ain't really trynna fuck with him\nAight, then, hit up Batty, I'll gladly come and tuck you in\nCome on, now, baby, come on-on\nScream at your frog, all's fair, love & basketball\nShe remind me of this chick that used to fuck with Dirty Bastard, ya'll\nHeard that she could suck a ball through a plastic straw\nCome on, now, baby, come on-on\nKnow what I'm sayin', kid, she get it poppin' off and half the time\nA little, candlelight, a little glass of wine\nI'm thinkin', another drink and that ass is mine\nCome on, now, baby, come on-on\n\n[Hook]\n\n[Method Man]\nIf you girl come knockin' at my door, it's my duty\nTo give her what she came here for\nI'm try'nna knock it down, but I ain't try'nna claim that dough\nCome on, now, baby, come on-on\nThat's what's up, start the fire, Buddha, light things up\nThe only nigga puttin' ends on some rims for his ice cream truck\nPick a flavor, I'll come and scoop your whole team up\nCome on, now, baby, come on-on\nThat's how it be, don't trip, but girl you put a hurtin' on me\nOh shit, hope other chicks don't take it personally\nBut ma, you killin' her, murder in the first degree\nCome on, now, baby, come on-on\nOkay, okay, can the ladies come out and play with Mr. Meth\nI ain't trynna take you out your way\nWhy break me off tomorrow, when you can break me off today\nCome on, now...\n\n[Hook]\n\n[Outro: Method Man]\nMe need a nasty girl, it could be you, eh, eh, eh, eh, eh, eh\nBig up to, super producer, Fafu, one love to Kardinal Offishall\nAnd the whole T-Dot, oh!", "image": "https://images.genius.com/b570b137bfca42564ca115c745cf3a4c.500x500x1.jpg"}], "artist": "Method Man"}