{"songs": [{"title": "I Wanna Fuck", "album": "The Trials & Tribulations of Russell Jones", "year": "2002-03-19", "lyrics": "[Intro: Ol' Dirty Bastard]\nYo, I got love for you girls\nAll my Sweet Sugar Pies\nThis is dedicated to you\n\n[Verse 1: Royal Flush]\nHey baby what's your name? Look at your whole frame\nCompliment me on my chain, she bling it so I did the same\nWhere we goin' from here? Lets smoke and drink in Belvedere\nAskin' me about my peers, where I been for all these years\nStarin' at my car yeah, notice money round here\nPlease baby show your speed, nuff talk about me\nWhere you work? What's your hobby?\nMarried, or got kids to some bonnie\nFamous for karate\nWhat's your number, call you probably\nWaited for a week ot two, didn't see what we gon' do\nCame through, new car XL on them 22's\nKnock and marry, straight to her I wanna hit it badly\nThen she startin' barkin', said \"first we gotta get married\"\nI hate this bitch, all I wanna do is hit the nappy\nGassed her head up, tell her anything tha make her happy\nStraight to the hotel, she suck dick and fuck well\nAsked me for my house number, I gave her Ol' Dirty's cell\n\n[Hook]\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?\n\n[Verse 2: Ol' Dirty Bastard]\nIf a girl is a slut, with a hole in her butt\nWho used to be a meaty-bone puppy cow little mutt\nCame to my house smellin' like trout\nI said, \"Doggie doggie get the fuck out!!\"\nLet me tell you about the rash from the neck\nIt's enough to put the ring around the collar in check\nShe's nothin' but a bitch other known as a witch\nWith an irritating itch from trying to switch\nStrung out ass, foggin' up glass\nTellin' all the niggas tell that the bitch first class\nSmoke a bag of hash from all the shit she stashed\nFirst she had to play the collar just to made that cash\nPull down her panties then scratch that rat\nTear up the whiff, that appear [?]\nTryna get slayed, got the Tabernacle Prayer\nThe only thing holy was her shitty underwear\n\n[Hook]\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?\n\n[Verse 3: Royal Flush]\nHead anytime I want it, C-O 600\nWorld my state stuttin', girls come in diamond dozen\nFuck hard, niece and cousins, doin' what your niggas wouldn't\nFattin' like the white guttin', 85 I put my foot in\nBuck Scotties still pimpin', stay puttin' long dick in\nWhite pussy our commission, hit it while you when out fishin'\nDog I be fuckin' bitches, while you be duckin' stitches\nAnd don't think cause I'm a mack I won't buck at bitches\nMad cause my chain is bigger, rims look a little thicker\nLifetstyle's alot richer, you actin' like low hitchin'\nGet a heater on my strippers, maybe y'all gon' hit it\nNo rhymin', dance in a minute\nCause everybody that I popped tonight at least had 3 E's in it..\n3 E's in it\n\n[Hook]\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?", "image": "https://images.genius.com/8aae5961ee3d6894e7d2abaab7f8fc11.772x768x1.jpg"}], "artist": "Ol’ Dirty Bastard"}