{"songs": [{"title": "All Gold Everything", "album": "Catastrophic", "year": "2012-12-21", "lyrics": "Ayo, why you niggas wanna try to complicate shit?\nWhy y'all niggas wanna try to ask me questions now?\nY'all know what the f*ck I do, man\nDon't ask me shit, man\nGold all in my chain, gold all in my ring\nCold all in my watch, don't believe me just watch\nDon't believe just watch\nDon't believe just watch\nDon't believe just watch\nDon't believe just watch\nGold all in my chain, gold all in my ring\nCold all in my watch, don't believe me just watch\nGet up off my block, nigga\nSee the gold Musson drop top, nigga?\nPinky ring make a bitch fart, nigga\n30-karat yellow canary rock, in her\nLook, you got nerve lil' nigga\nKing Tut ready, to the curb, lil' nigga\nI hope you listenin' to every word, lil' nigga\nFull course comin', this the hors d'oeuvre, lil' nigga\nThree-kilo gold Cuban on my neck, homie\nThree dice roll Cee-Lo when I bet only\nAll gold uniform like my name Kobe\nAll gold unicorn pendent on my trophy\nWorld champ of this whole shit, niggas know me\nSo much gold niggas bitches call me Goldie\nDid so much for the game, niggas owe me\nFor the co-sign I'm the one you gotta go see\nBefore you niggas try to approach me\nJust know I'm in the corner, kinda busy where the hoes be\nI'm the coke layin' under where they nose be\nYou the joke, niggas laughing at you low key\nNow get to know the way the bro live\nDerek Lam gold frames up on my nose bridge\nGold Ace bottles fillin' up my whole fridge\nShowcase models, nails, toes did\nSolid gold, kid\nGold all in my chain, gold all on my wall\nNot only do I kill verses, but I wrote all of your favourite songs\nChris Brown, Jamie Foxx, killer rollin' in tank\nYeah I got plaques all on my wall, and I got stacks all in my bank\nNigga, nigga, nigga\nHow the f*ck can you hate, ungh\nWhen I'm just doin' my thing? Aye!\nWhat other nigga you know, write pop songs, rap and make base? None\nI am original, these other rappers sound typical\nI got it locked in the figure-four\nAnd they could never see me, I'm invisible\nAnd I got...\nGold chain on my frame with the gold Jesus\nWhole bank in my jeans I'm a gold Visa\nGold bling in my ring like a Saints helmet\nGold rappers on my dick then your girl pelvis\nF*ck, boy... we don't f*ck with no broke dudes\nMy jewelry game is bicoastal\nAnd my piece is on my stomach like soul food\nYour homie snitchin', he so fool\nOver bread I'm a show him what the toast do\nSeein' lines in HD like Pro Tools\nThen hit the Hamptons and throw on my boat shoes\nCruise the Atlantic, stoppin' out in Trinidad\nMake a movie, turn a island into Cinemax\nGold album would appear from a pen and pad...\nAssemble that...", "image": "https://images.genius.com/b64a509fcfb92ec8935231089436682e.500x500x1.jpg"}], "artist": "Busta Rhymes"}