{"songs": [{"title": "Warning", "album": "Playtime is Over", "year": "2007-07-05", "lyrics": "[Nicki Minaj]\nWho the hell is this?\nCalling me at 12:47 in the night\nWhile I'm watching the fight\nLooking at the phone, it's no name in sight\nBlocked ID, knew something just wasn't right\nIt's my girl Kandi from out in Miami\nTelling me that my man with some bitch in a Camry\nCar seat in the back like he started a family\nYo Kan, stop playing, what the fuck is you saying?\n\n[Kandi]\nRemember them chicks from the Bricks 'round nine six\nThat we seen when we hit a lick by the project?\n\n[Nicki Minaj]\nOh, you mean Leah, little sister Maria\nI used to go see her in front of the pizzeria\n\n[Kandi]\nI didn't say them\nThey schooled me to some bitch that you knew from back when\nSome bitch named Kim\nLight skinned, slim, used to rock a low brim\nFollowed them to the crib, but the lights real dim\nThey hit me on the chirp, warning me, now I'm warning you\nWhat's it gonna be Nicki, tell me what you wanna do\n\n[Nicki Minaj]\nDamn, I'mma have to send her to her maker\nDamn, I'mma have to send her to her maker\nDamn, I'mma have to send her to her maker\nI'mma send her to her maker\nI'mma send her to her maker\n\n[Kandi]\nThey heard about his good sexing, long erections\nNice complexion, Magnums for protection\nThey even heard about his tongue game\nHow the nigga give brain, ain't stop 'til the cum came\nBut that's words of Hip Hop\nI popped the bitch top, like a Corona\n\n[Nicki Minaj]\nCall a coroner, it's gonna be a lot of black dresses and chest vest-es\nIf I find out he got a next Mrs\nWhat you think all the goons is for\nTwo by the door, a few more out in New York\nAnd I feed 'em curry chicken, I'm all about my green nahmean?\nGot some fat bitches in the kitchen\nI got a spot like ox and we cook oxtail\nGot a scale for what's in the mail\nI got whatever on my nigga bail, But if the nigga bail\nI'll have him sleeping with some killer whales\nDamn bitches wanna fuck with my man\nOn the other hand, things ain't always what you plan\nIt's the ones up in your prom picture, salon wit'cha\nNow they wanna creep in your man's jeep\nI bet you Nicki won't sleep\nCause I'mma put the heat to your beak, You'll bird like tweet tweet\nAnd watch you smoke like a cigarette\nShould've left the bitch a pack of Nicorette\nLeave all them foul bitches wet\nI give a fuck about you and your bum crew\nMami I'm the truth, they salute when I come through\nI'm not running bitch, I bust my gun, hold on I hear somebody coming", "image": "https://images.genius.com/b256017f3b831150266cf5131d761bfe.600x599x1.jpg"}], "artist": "Nicki Minaj"}