{"songs": [{"title": "Friend of the People", "album": "Friend of the People: I Fight Evil", "year": "2011-11-24", "lyrics": "[Intro: Lupe]\nFriend! Friend!\n\n[Verse 1: Lupe]\nLu, coupe, no, more doors\nPorsche or, no, more doors, sedan\nHmmm, 4-more, no, more doors, more doors than that\nLord of the Rings, that Frodo went to war for, you'll see more war than\nWorld War 4 or Lord of War when Nicolas lost his brother\nBrougham, no, man, too slow for my program\nNeed punk rock, not slow jams, mosh pits not hold hands\nOr slow dance, or romance, I'll take this bitch like Lo Pan\nPut her right into Do’s hands, tell her how this gon' go, man\n\n[Hook: Dosage]\nAnimals, animals, we are more like cannibals\nFollow rules, what rules? We don't ever answer to\nNo King Tuts, no presidents, this is more like a ritual\nWhat am I scared of death for? Life is just an interlude\n\n[Verse 2: Dosage & Lupe Fiasco]\nLet's begin this interview, I know they got a lot of questions\nI dont have on a unitard, but I can answer the detective\nNone of these dicks can trace me, I don't go that direction\nThis is the beginning of a massacre, I'm tired of getting treated like a step-kid\nThis where I step in, cause this Dosage from Philly and he so sick\nAnd he my friend, so he yo friend, it's who Lupe Fiasco with\nThey wanna know if I'm insane, I just don't accept defeat\nBut since I'm nominated this is gonna be my acceptance speech\nYour big bro requestin' me 'cuz I'm a friend of the people and I'm next to be\nIn the game, I don't hear the referees whistling technically\nDixie, let me sing!\n(\"I wish I was in the land of cotton, old times, they are not forgotten! Look away! Look away! Look away!\") I forever see\nDon't go back or forever be a slave to the nation\nTouché, Lupe, this is history in the making\n\n[Verse 3: Lupe]\nWe so in Smithsonians when the story ends\nWe was there when the story started, making history before we's artists\nYou know we's targets: Tar-get, we always start shit\nOr shall I say hot-wired, ride around reckless and double-park it\nLook how many fines that the car get\nTake the boots off it, throw the tickets in the garbage\nThen go to court just to get up on some smart shit\nTell the motherfucking judge it's all ours, bitch", "image": "https://images.genius.com/519da23233c0aee9cd94e2ea433cf9d8.320x320x1.png"}], "artist": "Lupe Fiasco"}