{"songs": [{"title": "Stimulate", "album": "Straight from the Lab", "year": null, "lyrics": "[Intro]\nPsst, hey, listen\nLa la la la la la la la la laaaa\nI love my job\nMakes me feel like Superman!\nLa la la la la la la la la laaaa\nCan you fly? I can, wanna see?\n\n[Hook]\nI'm only entertainin' you, my\nGoal is to stimulate, makin' you high\nAnd take you and I\nTo a place you can't see, but I believe you can fly\nI don't mean nobody harm, I'm just partyin'\nI'm not your dad, not your mom, not your guardian\nJust a man who's on the mic\nSo let me entertain you\n\n[Verse 1]\nMy lyrical content is constantly under fire\nNo wonder why I constantly bomb back\nTo combat attacks with constant concepts\nWhen lyrics are constantly took outta context\nFailure to communicate with Congress has\nBeen a problem for the longest, I guess\nBut maybe one day we can make some progress\nFood for thought, see how long it takes to digest\nFeelin' good when I should be ashamed\nShit, I really shoulda fell but I stood, see, I came\nLike a flame in the night\nLike a ghost in the dark\nThere's a ray, there's a light\nThere's a hope, there's a spark\nBut when planets collide they'll never see eye to eye\nUntil they decide to set the differences aside\nAnd this is why only one of us will survive\nSo children, follow my lead and feel the vibe, because—\n\n[Hook]\nI'm only entertainin' you, my\nGoal is to stimulate, makin' you high\nAnd take you and I\nTo a place you can't see, but I believe you can fly\nI don't mean nobody harm, I'm just partyin'\nI'm not your dad, not your mom, not your guardian\nJust a man who's on the mic\nSo let me entertain you\n\n[Verse 2]\nMy music can be slightly amusin'\nYou shouldn't take lyrics so serious, it might be confusin'\nJust tryin' to separate the truth from entertainment\nIt's stupid, ain't it? I get sick of tryin' to explain it\nSee, I could sit and argue with you, but it goes beyond\nJust being a snot, pointy-nosed bleach-blond\n'Cause I came here to uplift, let your woes be gone\nTell 'em to get fucked and just mosey on\nConstantly movin', constantly usin'\nThe Constitution as a form of restitution\nBless the children, nothin' less than brilliant\nLet me entertain you like Robbie Williams\nI'll be here when y'all are gone, rebuildin'\nWorld revolvin', still evolvin', still Slim\nHow many kids will copy? Prob'ly millions\nBut I'ma do this as a fuckin' hobby till then, 'cause—\n\n[Hook]\nI'm only entertainin' you, my\nGoal is to stimulate, makin' you high\nAnd take you and I\nTo a place you can't see, but I believe you can fly\nI don't mean nobody harm, I'm just partyin'\nI'm not your dad, not your mom, not your guardian\nJust a man who's on the mic\nSo let me entertain you\n\n[Verse 3]\nMy lyrical content contains subject matter\nThat sucks up all these fucked up young kids\nAt an alarming rate; common denominate\nAdd it up and you'll see just why I dominate\nI try to stimulate, but kids emulate\nAnd mimic every move you make, \"Slim, you great!\"\nBut wait, can't you see I'm only here to entertain?\nI gotta be the one to go against the grain\n'Cause man, I see it, feel it, live it, but it's inhumane\nFor me to see you be influenced and pretend you ain't\nBut they don't understand that I've been through pain\nIf you get to know me I could be a friend you gain\nBut you can't just stand there and try to judge\nIt hurts but your jealousy probably tears you up inside as much\nAnd it's such a pleasure, every button that I touch\nI treasure every glutton that I punish in my lust, but—\n\n[Hook]\nI'm only entertainin' you, my\nGoal is to stimulate, makin' you high\nAnd take you and I\nTo a place you can't see, but I believe you can fly\nI don't mean nobody harm, I'm just partyin'\nI'm not your dad, not your mom, not your guardian\nJust a man who's on the mic\nSo let me entertain you\n\n{Backmasked}\nI'm not here to save you\nI'm only here for the ride\nSo let me entertain you\nAnd everything will be fine", "image": "https://images.genius.com/8dd03ebbf724e2b4d4bafbddf8c3c2f1.1000x1000x1.png"}], "artist": "Eminem"}