{"songs": [{"title": "Heartz of Men", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro]\nHey, Suge, what I tell you, nigga?\nWhen I come out of jail, what I was gonna do?\nI was gonna start diggin' into these niggas' chest, right?\nHeh, watch this!\nHey, Quik, let me see them binoculars, nigga, the binoculars!\nHahahahaha! Yeah, nigga, time to ride!\nGrab your bulletproof vest, nigga\n'Cause it's gonna be a long one\nNow, me and Quik finna show you niggas\nWhat it's like on this side—the real side\nNow, on this ride there's gonna be some real motherfuckers\nAnd there's gonna be some pussies\nNow, the real niggas gonna be the ones with money and bitches\nThe pussies gonna be the niggas on the floor bleedin'\nNow, everybody keep your eyes on the prize\n'Cause the ride get tricky\nSee, you got some niggas on your side\nThat say they're your friends, but, in real life, they your enemies\nAnd then you got some motherfuckers that say they your enemies\nBut in real life, they eyes is on your money\nSee, the enemies will say they true\nBut in real life, those niggas will be snitches\nIt's a dirty game, y'all\nY'all gotta be careful about who you fuck with\nAnd who you don't fuck with, 'cause the shit get wild, y'all\nKeep your mind on your riches, baby\nKeep your mind on your riches\n\n[Verse 1]\n9-1-1, it's an emergency, cowards tried to murder me\nFrom hood to the 'burbs, every one of you niggas heard of me\nShit, I'm legendary, niggas scaried and paralyzed\nNothin' more I despise than a liar, cowards die\nMy mama told me when I was a seed\nJust a vicious motherfucker, why these devils left me free?\nI proceed to make 'em shiver when I deliver\nCriminal lyrics from a worldwide mob figure\nThug niggas from everywhere, Mr. Makaveli\nNiggas is waitin' for some thug shit, that's what they tell me\nSo many rumors, but I'm infinite, Immortal Outlaw\nSwitchin' up on you ordinary bitches like a southpaw: you get left\nAnd every breath I breathe until the moment I'm deceased\nWill be another moment ballin' as a G\nI rip the crowd, then I start again, eternally, I live in sin\nUntil the moment that they let me breathe again\nThe hearts of men\n\n[Chorus]\nThe hearts of men\n\n[Verse 2]\nMy lyrical verge with so much pain, to some niggas, it hurts\nMy guns bust, if you ain't one of us, it gets worse\nBitch niggas get their eyes swoll in fly mode\nI'm a homicidal outlaw, and five-o\nGet your lights on, the fight's on\nTonight's gonna be a fuckin' fight so we might roll\nMy own homies say I'm heartless\nBut I'm a G to this until the day I'm gone, that's regardless\nRide by, niggas bow down, thought I'd rot in jail\nPaid bail, well, a nigga's out now\nThrow up your hands if you thugged out\nFirst nigga act up, first nigga gettin' drugged out\nI can be a villain if you let me\nA motherfucker if you do upset me\nTell the cops to come and get me\nRip the crowd like a phone number, then start again\nDon't have no motherfuckin' friends\nNigga, look inside the hearts of men\n\n[Chorus]\nIn the hearts of men\n\n[Verse 3]\nTo all my niggas engaged in makin' money in the fifty states\nKeep your mind on your chips and fuck a punk bitch\nNo longer livin' in fear, my pistol close in hand\nConvinced that this is my year like I'm the chosen man\nGive me my money and label me as a don\nIf niggas is havin' problems, open fire and bomb\nI died and came back, I hustle with these lyrics\nAs if it's a game of crack, thuggin' is in my spirit\nI'm lost and not knowin'\nScarred up but still flowin', energized and still goin'\nUhh, can it be fate, that makes a sick motherfucker break\nOn these jealous-ass cowards 'cause they evil and fake?\nWhat will it take? Give me that bass line, I'm feelin' bomb\nDeath Row, baby, don't be alarmed\nThe homie Quik gave a nigga a beat and let me start again\nRepresent, 'cause I've been sent, the hearts of men", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}