{"songs": [{"title": "Some X Shit", "album": "Ryde or Die Vol. 1", "year": "1999-04-27", "lyrics": "[Left and right DMX parts simultaneous]\nWhoo whoo! Dog ni-gga\nWHAT?\nWhoo whoo! Dog ni-gga\n\n[Swizz Beatz]\nUhh, Ruff Ryders, WHAT?!\nVolume One, Swizz Beats (WHOOO!)\nWHAT?!\nUhh, uhh, (WHAT?!) all aboard!\n\n[Verse 1]\nIf I thought y'all niggas really wanted drama\nI woulda been pulled out the armor, word to my momma\nI'mma -- hit y'all niggas with somethin that you ain't never felt (WHAT?!)\nHit y'all niggas for frontin you caught up in that hell (WHAT?!)\nIf I thought that half the shit that bitches said was true\nI'd be spitting lead at you, to dead your crew\nBut -- if you know a bitch, you don't listen to that bitch\nYou don't argue with that bitch, all you do is fuck that bitch!\nIf I listened to all the snake niggas that's runnin they mouth\nI wouldn't be in the crib, I'd be loadin up, to run in your house\nBut -- you can't fuck with cowards, cause a coward'll be a coward\nHe'll end up killin these cowards, and I'm not feelin these cowards!\nIf I let the niggas around my way tell me how to feel about me\nI guess I really, wouldn't be D\nBut I'm the best that ever did it, the best at it because I live it\nHow many niggas eat it and shit it, you cats want it? Come and get it!\n\nChorus: DMX (repeat 2X)\n\nGrrr, ARF ARF, woo woo!\nGrrr, ARF ARF, woo woo!\nTell me how you feelin now (WHAT?!) I know you illin now (WHAT?!)\nTell me how you feelin now (WHAT?!) I know you illin now (WHAT?!)\n\n[Verse 2]\nIt's not like me to have my back turned to open places\nI wanna SEE it when it's comin, so I can open faces\nOpen cases got me PAYIN to stay out of jail (WHAT?!)\nWhile these streets, got me to prayin to stay out of hell (C'MON!)\nSlipped, and I fell, got back up -- slipped again\nBut no matter what it's been, niggas never got a win\nIt's a thin line I walk, everyday but I'm good with it!\nProject nigga all my life, but wouldn't say the hood did it!\nKnew what I was doin, everyday that I've been doin it (okay)\nSeein niggas havin a good time, so I'mma ruin it (yeah)\nFuck you, and fuck your man, both y'all niggas is puss!\nFrontin like you out the jungle but ain't never seen a bush!\nWhen push comes to shove, whatever love we had take it witchu\nNow peep what I just said and see how long it takes to hit you\nEverybody knows you can talk all day (YES)\nBut when it's on what you gonna do - walk away? (YES)\n\nChorus\n\n[Verse 3]\nMan, I told you I lock jaws, carry a Glock four\nClose my eyes on y'all niggas, the bullets'll watch yours\nThen I gotta open up another can of ass-whippin\nY'all niggas better pucker up, time for some real ass-kissin\nI'm a simple man, I lead a simple life, I mean simple like\nI don't need much to be aight, live off the land, eat atnight\nHandle whatever's comin when I get there, but I'm good (WHAT?!)\nDismantle whatever's comin, y'all niggas sit there and put up hoods!\nHow my niggas feelin? (GOOD!) How my niggas like it? (ROUGH!)\nWhat my niggas want? (BLOOD!) We stay callin niggas bluff\nBut if it's got to be, then it's gon' be, c'mon let's eat\nWhatever my niggas want from me, is what my niggas gonna get from me\nAnd if I ever.. let the words, of another nigga bother me\nI might as well.. let the sperm, of that other nigga father me\nBut they know, like I know, the black Rhino\nNiggas rippin through em and let the nine blow\nNigga die slow! Oh.. oh oh!!\n\nChorus 3X\n\n[DMX]\nBounce, bounce, bounce, bounce\nWhat? Ruff Ryders, Volume One, the compilation\nDMX, Swizz Beats, uhh, double up\nWhat? Double up, y'all gotta feel us\nY'all GOTTA feel us\nRrrrr, ARF ARF, woo woo!", "image": "https://images.genius.com/fa6e35a806fb842aa784d01023da38fa.632x632x1.jpg"}], "artist": "DMX"}