{"songs": [{"title": "Pick It Up", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "[Hook]\n(Get on down)\nPick it up, pick it up\nPick it up, pick it up\n(Get on down)\nPick it up, pick it up\nPick it up, pick it up\nIf you find a bag of weed on the floor motherfucker\nWhat the fuck you gon' do?\n(Get on down)\nPick it up, pick it up\nPick it up, pick it up\n(Get on down)\nPick it up, pick it up\n\n[Verse 1: Redman]\nWhile I crack a cold Beck's and keep the hoes in check\nThe double-S vest nigga wreck the discotheque\nSit back relax and while my Squad kick tacks\nThen tap your man back and be like \"Did you see that??\"\nAhh yes, comin from the North South East West\nHold your nose and take a deep breath, recess\nWe bless, mics, three times a day\nThree times a night, it all equals subliminal sequels\nStrictly laughing at MC's\nLyrics for years that run more than ten deep\nNiggas be like \"Ahh he changed his style up\"\nShut the fuck up, ya still a dick-ridah\nIt's '96 so get wit' it\nKeep that back-in-the-day shit when that other Squad was Hit-tin\nListen, must we forget, I originated\nAll that wild shit, that rrraahh rrraaoowww shit\nThat jump up and ready to fuck shit up now shit\nBrick City!! Is where I get down kid\nPeace to all my buddah smokers on Prince\nFuck what ya heard, Brick City runs shit\n\n[Hook]\n(Get on down)\nP.P.P. got the Glocks and tecs\nAnd Def Squad always got some fly shit on deck\n(Get on down)\nSay what? Got some fly shit on deck\n(Get on down)\nSay WHAT? Got some fly shit on deck\nP.P.P. got the Glocks and tecs\nAnd Def Squad always got some fly shit on deck\n(Get down)\n\n[Verse 2: Redman]\nFirst of all, MC's be on my balls, straight up\nPubic hairs and everything, lick the whole plate up\nBay Area, roll up your Las Vegas\nTo all MC's, I love it that you hate us\nDrop skills that might send wind chill factors\nBack through Patterson, J.C\nAnd Hacken-sack\nStep uncorrect and get blackened\nThe assassin, find da MC's by the jazz men\nI don't tote guns I tote funds\nWhile you still puzzled how my antidote runs\nYour whole vocabulary's played out, admit it\nStill wack if it came out my mouth and I spit it (Get on down)\nYou remind me of school on a Sunday\nNo class, beatin all King's down\nDoin over seventy, in a Hyundai, blast\nGive em a good reason to open Alcatraz back\nNobody got the Red shook\nBeen a weirdo ever since the doctor said PUSH\nDef Squad skills make it hard to overlook me\nThat's why the hardcore promoters still book me\nYou shook G... word up... hah hah...\n\n[Hook]\n(Get on down)\nIf you see a bag of weed on the floor motherfucker\nWhat the fuck you gon do\nPick it up, pick it up\n(Get on down)\nIf you see a bitch passed out on the fuckin' ground\nWhat the fuck you gon do\nPick her up, pick her up\n(Get on down)\nI keep it fly y'all\nFly fly y'all (5X)\n(Get on down)\n\n[Verse 3: Redman]\nAiyyo, don't ride the dick of these real MC's\nWe pull Joints like Spike and blow crews to degrees\nThen we buy G's with a half a pound of dope MC's\nWe bag for cheese just to get weed\nSmoke indoneez I'm milky like Magnese\nOh-seven-one-oh-three, rest them car thieves\nGuzzlin quart for sports of all sorts\nNonchalant spark buddah on the front porch\nAt courts, F-U-N-K-D-O-C\nS-P-O-T, feel the Solo type remedy\nThen freeze.... (Get on down) hah, ha-hah\nWhere was I? Oh yes\nSippin on Cristal with fingers up your bitch dress\nDon't play close cause jealousy make folks act loc\nAnother nigga smoked from impression\nSecond guessin my verbal weapon, you're lettin\nSpit, sixteen bits, come equipped\nAnd I still walk around with the hooked up\nMotorola flip on my hip, fuck the government\nDrop shit, it's a microscopic topic\nHow I stay mo' bent than McDonald arches\nAnd uptown got the la-la spots\nAnd bad ass hoes with 54-11 Reeboks\nBut still, I walk around with the grill\nCause niggas be blinded by this hip-hop shit for real\nI ain't havin that, I'm clappin shit\nFuck this rappin shit, I cause accidents\nTo any, MC who wonder what got in me\nTo get busy, it's simply Ginger and Remi\nIt don't stop, Def Squad crew is hot\nFillin up your brain with supreme octane, and it's on\n(Get on down)", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}