{"songs": [{"title": "How Ya Feelin’", "album": "A Son Unique", "year": null, "lyrics": "[Intro: Ol' Dirty Bastard (girl)]\nOh yeah...\nWhat what, got your money\nWhat what, (dirty), what what\nWhat what, (dirty), yeah, yeah\n\n[Ol' Dirty Bastard]\nMy niggas better raise it up, fruit punch in my cup, so what?\nOl' Dirty, I served my time, now I'm out and gonna have a good time\nMy new account is kinda different, cuz I'm 'ready spendin' all my dimes\nWhat what, give me a check for 9, zero, zero, zero, zero\nCount count 'em, muthafucka, this mine\nNow, I just better finish my rhyme\nBefore my muthafuck' appeal come, what the fucking due line\n\n[Hook: Ol' Dirty Bastard]\nNo, sip-ping, alco-hol, at all (no way)\nNo, smo-king, Phil-ly, blunts, or Backwoods (no way)\nNo, lea-ving, the state, of New York (stay home)\nIt's, all good, long as I can, still feel some breasts\n\n[Hook 2X: girl (Ol' Dirty Bastard)]\n(And how ya feeling, Dirty?) I feel good!\n(I'm glad you are) Yeah, me too!\n(I wanna love you, Dirty) I wanna love you back!\n(Can I get a..) baby, just, baby just, wiggle that booty!\n\n[Bridge: girl]\nAhhhhh, a wiggle-wiggle, a wiggle-wiggle\nDirty...\n\n[Ol' Dirty Bastard]\nI never will forget the way\nDame Dash, send a limo for me\n(What what), signed me up for the team\nVH1, caught me doing my thing\nI had bitches in the limo actin' like they fucking rolling with king\nShopping sprees on Fifth Ave., backrubs, bubble baths\nOl' Dirty fucked, come, clean my ass\nNow I'm straight, gotta spit for my chips\nWith nothing in my system that would get me incarcerated\n\n[Hook]\n\n[Bridge 2X]\n\n[Hook 2X]\n\n[Bridge 2X]\n\n[Interlude: Ol' Dirty Bastard]\nSing this song\nDirt, Dirt, Dirt, Dirt McGirt, Girt, Girt, Girt\nStraight from Wu, Wu who?, Wu who? Wu who?, ahh\nDirt, Dirt, Dirt, Dirt McGirt, Girt, Girt, Girt\nStraight from Wu, Wu who?, Wu who? Wu who?, ahh\nDirt, Dirt, Dirt, Dirt McGirt, Girt, Girt, Girt\nStraight from Wu, Wu who?, Wu who? Wu who?, ahh\n\n[Bridge]", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}