{"songs": [{"title": "Loud Noises", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro]\n“Loud noises!”\n\n[Verse 1: Eminem]\nLife handed me lemons, I jumped back in the public eye\nAnd squirted lemon juice in it, by now, you just wish I’d fuckin’ die\nBut I electrify, get electrocuted, executed by the execution\nOf my flow, too quick for the human eye to detect zoomin’ by\nChoom chigga choom choom choom choom waa\nYep, yep—guess who, what’s happenin’, guy?\nThey told me to shit, I fell off that pot\nHopped right back on that crapper and I\nSaid, “Fuck it,” with a capital I, look who’s back to antag-g-onize\nYou don’t like it? You can eat shit, fuck off, little faggot, and die\nYou right back like a magnet on my dick grabbin’ at my\nShit, better get to the back of the line\nIf you wanna get your shot at me, what kinda crap is that battle?\nWhat kind of rapper would I be\n'Fore I let another rapper think he’s hot?\nI'll bury my face in his stinky twat and go... (Licking noises)\nGirl, my head space is limited\nAin’t even room in the back of my mind\nThat’s why I ain’t thinking about you, I don’t got time\nI done told you a thousand times\nSo how can I find the time to put\nAn alkaline battery in Royce’s back\nAnd at the same time put juice in mine?\nGoddammit, Slaughterhouse is signed!\n\n[Chorus: Crooked I]\nSlaughterhouse!\n\n[Verse 2: Crooked I]\nI’m a menace villain, my pen is sick and spillin’, my lyrics killin’\nThen I let you witness shit when it hit the ceilin’\nA nigga’s willin’ to give the listeners the sickest feelin’\nLike mixin’ some Benadryl and penicillin, then I’m fillin’ the clip\nWith a written (Pow!), can you picture my pistol drillin’?\nA million women and children when I’m illin’ but it isn’t real\nIt’s a rap, on the real, it’s a wrap, how could you possibly\nStop the Apocalypse when I’m atomic bombin’ the populace?\nShock the metropolis, hostile as a kid\nPoppin’ the Glock at his mom’s and his pop’s\nThen he hops in his drop with his iPod\nRockin’ his slaughter-ish documentation of lyrics\nI write with confidence, write like a columnist-slash-novelist\nI’m in this game to demolish it\nEstablish my dominance over prominent rappers\nYou poppin’ shit ’til ya opposite, I can spit ominous so spit politics\nNow I’m Haile Selassie, Gandhi and Pac\nOf this hip hop genre, bitch!\n\n[Chorus: Crooked I]\nSlaughterhouse!\n\n[Verse 3: Royce da 5’9”]\nLyrically, I’m a cocaine Altoid\nAbility so brain, it’s a no brain bow, boy (Fresh)\nPhysically, I’m literally a cocaine cowboy\nWait-wait, did I just go almost four bars\nWithout talking about my big dick?\nThe other day me and your thick bitch\nHad a great date and we ate cake\nAnd then we walked and then she tried to jack me off but she lost\n’Cause she couldn’t handle my Shake Weight\nI swear, the irony of Ryan is I am bipolar while I’m rhyming\nStanding beside a big ol’, (Big ol’) white bear\nNeither one of us fight fair\nYou are literally looking at Woody and Wesley\nIn a movie where the white boy ain’t got to jump\nNowhere ’cause I’m here\nNigga I’m on fire, yeah and I’m every bitch’s dream\nOne, two I’m coming for you, I’m a big ol’, (Big ol’) nightmare\nNigga, this the slaughter, step it up\nI’ll pretty much slap your ass and tell you to shut the fuck up\nAfter that, I’ll slap your ass again\nAnd tell you to shut the fuck up shutting up\nAnd that’s how you body a fucking beat (Goodbye)\n\n[Chorus: Crooked I]\nSlaughterhouse!\n\n[Verse 4: Joell Ortiz]\nUh, I should be the one that goes slow\nNah, get a stopwatch, clock my flow, hit the button on top\nWatch your jaw drop, oh-oh, dot-dot, oh, Yaowa\nWhen I drop, I go outer space\nBlackout like Darth Vader’s face placed in a molten shower\nSay something and get done proper\nMama, Poppa pouring out vodka, mama mia\nEm, pass me the scissors\nThere’s visitors in the Slaughterhouse casa\nBetter jet, boy, go home, better jet, boy, G4 Chrome\nBetter jet, boy, Mark Sanchez, Santonio Holmes\nI’m not your any old homeboy\nJust sitting in the lab picking up a pad, I be spitting bad\nI’mma get you mad with this gift I have\nLittle ducks sufferin’ succotash when the trigger blast\nI’ma put your beak on your fitted hat\nWhere the liquor at? Sip a yac bad bitch and a vicious track\nI relididax slide Pro-Dools to both\nSo smooth I coast to the West like where Crooked living at?\nNew York, here’s a piggy back ride\nTo the motherland, hold on, brother man\nOn the other hand, get down, I’m gutter, fam\nGun butt you with the Eagle handle Cunningham\nI don’t wanna talk, I just wanna beef, I don’t want a piece\nI want it all, baby boy, I don’t wanna eat, I wanna feast\nStuff my cheeks with rough beats and shit\nYou done, weak, I’m the one, capisce?\n\n[Chorus: Crooked I]\nSlaughterhouse!\n\n[Verse 5: Joe Budden]\nUh, insane what they call us, how you married to the game\nBut you probably shouldn’t have came to the altar\nEvery bar like propane for the sawed-off\nYou shoulda hang and they’ll fault ya\nEminem, Mr. Porter, slaughter my sentiments, eminent torture\nAll of you feminine marauders\nThey’re swimming that water, men will assault ya\nTommy’s and bats to resemble Lasorda\nKidnap your trembling daughter\nAt least a quarter, I’m a menacing supporter\nIt’s got an aura more like Sodom and Gomorrah\nNormally, something’s wrong with me\nBlame it on quantity of the porn I see on the pawns to me\nWhen I fix the game, y’all think shit came with a warranty\nHow the fuck are they gonna stop what I was born to be?\nCorner me, shit belong to me\nTwo choices, you can get along with me\nOr sit your faggot ass right there in dormancy\nWait, all he missing is heels to be RuPaul\nAin’t nobody that’s real ever knew y’all\nAnd I’m second to none and I’m dealing with bums\nWhose time'll never come, now deal with the blue balls\nYou ain’t gotta fear me but you respect me\nNiggas who never met me threaten me, want to Gillette me\nComin’ to a sword fight against a machete\nSwinging spaghetti like it’s heavy\nSome said he deserve an ESPY, in a Chevy like Andretti\nPut the desi where his chest be\n\n[Chorus: Crooked I]\nSlaughterhouse!", "image": "https://images.genius.com/e46d8c5b81dd5cfba852666c93111bef.1000x1000x1.jpg"}], "artist": "Bad Meets Evil"}