{"songs": [{"title": "Our House", "album": "Off The Wall", "year": null, "lyrics": "[Intro: Eminem]\nHere's the story, of a little boy\nGrowing up in a suburban home\nTrying to cope with everyday life\nWho lives in a little house\nThat was built, in the middle of the street\n\n[Verse 1: Eminem]\n\"Hey, Mom! 2Pac's on the jukebox\"\n\"So what, he shot two cops\nAnd raped a little girl while two dudes watched\"\n\"Nuh-uh! They were tryin' to frame him\"\n\"You and that Tupack Shaker...\"\n\"No! That ain't how you say his name, mom!\nYou're so lame, don't you know anything?\"\n\"Yeah! I know that you'll probably go and join in a gang,\"\n\"Yeah, right. I'm out. Where's my fuckin' Walkman at?\"\n\"Stop cussin' at me!\"\n\"Shut up, bitch!\"\n\"Quit talking Black!\"\nWell, slammed the door and I'm out\nNow, what? It's probably warm in the house\nFuck, I forgot my jacket, forgot it was winter\nI'm gettin' thinner, I'm hungry\nIs Mom cookin' dinner?\n\"Mom! Let me back in! I forgot my coat\nMom, come on, I'm not playin', it's cold!\nAlright, sorry, I need a jacket\nMom, look, my 2Pac tape, I just cracked it\nMa, please let me back in\nIt is Tupack Shaker, I just asked him\"\nI'm freezin', I'm sneezin'\nI'm breathin' too much cold air, I'm wheezin'\n\"I ain't did nothin' I didn't say 'I'm leavin'\"\nI said \"I'm goin' on the front porch to get somethin'\"\n(scissors cutting) \"Alright, here take your damn coat and leave,\"\n\"Fine, I'll le— Mom, you cut off the sleeves!\"\n\n[Hook: Fred Durst]\nOur house\nIn the middle of the street\n\n[Verse 2: Eminem]\nOne, two, three\nMy teacher's two-faced, went to lower all my school grades\nSince last Tuesday I had a toothache from Kool-Aid\nSo Mom kicked me out, and all I had in my suitcase\nWas one shoelace, a tube sock, and a tube of toothpaste\nSometimes it was cool cause I could go to Fred's\nCrash there, fool around and just skip school\nBut other times I'd rather just be home\nIn my own room alone beat my shit and nobody would know\nMy little brother sucked on a bottle 'til he was six\nSo I'd hide it inside the couch and say\n\"I don't know where it is\"\nBut as soon as Mom found it I would either be grounded\nOr kicked out of the house a thousand weeks and still countin'\nEven when I was underage\nMom was tellin' cops I was tryin' to run away\nI told her \"Someday, bitch, you're gonna pay\"\nPlease, Mom, please, Mom, please, I wanna stay\n(Let me stay)\n\n[Hook: Fred Durst]\n\n[Verse 3: Eminem]\nMy brother's incoherent, Mom's a single parent\nWho ain't carin', starin' through me\nLike I'm transparent, made it clear\nThat I was just there to run her errands\nTold her friends I was a son from her last marriage\nSent me up to the corner store with a little note\n\"Please, sell my step-son some cigarettes so I can smoke\"\nOne time I tried to fake sick to get attention\nBack-fired, Mom sent me to school with a vengeance\nMy life's the worst thing that could ever happen to me\nI go to class and every teacher's always laughin' at me\nAnd Mom says white rappers are laughed at\nNot only that, she heard me upstairs\nI can't rap, and I'm stupid\nI'll never make it averaging a D+\nI need to sit on my ass and sue people like she does\nOne time, I got food poison from a hot dog\nMom sued and got $2,000 from Ballpark\n\"Hey, Ma. You got a dollar?\"\n\"I don't think so, now keep an eye on your brother\nI'm goin' to bingo.\"\n\"But, Mom, you said you were broke.\"\n\"Who said? You got your ears messed up\nFrom that damn rap music.\"\n\n[Hook: Fred Durst]", "image": "https://images.genius.com/ac33929e6a8fb0324648e8eb9ba496b0.715x715x1.jpg"}], "artist": "Eminem"}