{"songs": [{"title": "Jump Off the G4", "album": "Pre-Release Therapy: The Truth Will Set You Free", "year": "2006-09-19", "lyrics": "Jump off the G4 we can meet out side\nWhat you gon’ do?\nJump off the G4 we can meet out side\nWhat you gon’ do?\nJump off the G4 we can meet out side\nWhat you gon’ do?\nJump off the G4 we can meet out side\n\n[Ludacris]\nI say look up in the sky it’s a bird it’s a plane\nIt’s Luda and a hawk at 700 getting brain\nAutomatic pilot automatic dough\nJump off the G4 we can meet out side\nI said look up in the sky it’s a bird it’s a plane\nIt’s Luda and a hawk at 700 getting brain\nAutomatic pilot automatic dough\nBitches on assignment automatic hoes\nPress the start button let the games begin\nReal recognize real let the lames pretend\nWhat you see is what you get when Luda’s rapping\nIf I say then I've done or it’s about to happen\nBut I've said that before now I’m back to snapping\nI’m an eight figure nigga and that’s just off rapping\nSo Imma tell you something different and I just might slap’em\nPour belvy on the nigga then I just might jack’em\nGet it?\nA little deeper than the average mind\nMy watch lasts a little longer than the average time\n‘Cause I never been average I’m further above\nIf you've got chicks on your dick mines are further in love\nYou got a crew that be snapping? Yeah me too\nNigga you like rapping? Yeah me too\nYou got a wad full of cash? Yeah me too\nGot a blunt full of hash? Yeah me too\n\n[I-20]\nYou keep a squad in the hood nigga? Yeah me too\nYou got a dash full of wood nigga? Yeah me too\nYou got a pocket full of stones nigga? Yeah me too\nYou keep on repping for your zone nigga? Yeah me too\nDealer bitch yeah I’m back ignorant rap shit\nAnd I got hype man but they ain’t here to do adlibs\nSo go ahead and judge a nigga ‘cause I say I so white\nLife’s a craps game I stay screaming out hold dice\nTell G bet the house on me you heard what I said\nTell these niggas down on border man I can cover the spread\nYea they coming for my head but I ain’t made it that big\nI got a hair trigger nigga that can split your wig\nRight! Ya’ll the et cetera whatever I can brag about\nAll that local bullshit ya’ll love to hear us rap about\nNiggas got a drought so ya’ll can’t serve it at home\nTell ya shooters we can cover it we got us a zone\nAnd yea I’m good with this fucking shorty that’s no lie\nI make a straight girl cry, turn a dyke bitch bi\nTwenty-eight no backpacking but I’ll flip this pack\nMy desert eagle is a puncher ‘cause it push shit back", "image": "https://images.genius.com/e52e99bd3b0df0885e2062779b5d5814.600x596x1.jpg"}], "artist": "Ludacris"}