{"songs": [{"title": "Snoopafella", "album": "No Limit Top Dogg", "year": "1999-05-11", "lyrics": "[Verse 1]\nOnce upon a time, in the L.B.C\nOn the Eastside, off of 2-1 Street\nThere lived a young man, Cinderfella's his name\nTo make it interesting it's me, peep game\nI lived in a house with my cruel step-dad\nAnd two step-brothers who treated me bad\nI cooked, I cleaned, I scrubbed the floors\nAnd I was like an errand boy runnin to the stores\nMy brothers, they used to boast and brag:\n\"We've got Fubu, and you've got rags!\"\nAnd even worse than that, to make me feel low\nThey gave me a skateboard, while they had low-lows\nGirls used to say, \"Snoop, you're so cute\nBut you gets no rap with that to' up khaki suit\"\nWelllll, one day, up the Avenue\nThere was a man, surrounded by the Dogg Pound crew\nHe said ah, \"Hear ye! Hear ye! Come one, come all!\nThe princess is having a royal ball\nIf you can rap, also dress fresh\nYou might win a date with the sweet princess\"\nWell I, um, ran home when I heard the newsflash\nI bust through the door, straight to my step-dad\nI said, \"Step-dad, may I?\"\nAnd before I could finish, \"Hell no!\", he replied (Cinderfella!)\nMy brothers were goin, they were gettin down\nEven Pops was goin for a piece of the crown (Cinderfella!)\nThey flaunted, they haunted, they knew what I wanted\n\"We can and you can't,\" is what they taunted (nana-nana-nah-nah)\nThey all stood there, laughin in my face\nAnd as they walked out they said, \"Clean up this place!\"\n\n[Chorus]\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n\n[Verse 2]\nWell I shrugged, I hissed, they all tried to diss\nAnd I'd get them back if I had one wish\nBefore I could make my thought a phrase\nThere appeared a man from a puff of haze\nHe said, \"What's up, Dogg? My name is Herb\nI'm your fairy Doggfather, you know it, word!\nNow I've came here with the main purpose\nOf granting you your fondest wish\"\nI said, \"Herb, my man, just make me fresh\nAnd I'm sure that I can handle, all the rest\"\nWith a snap of his fingers sparks began to shoot\nAnd I was jumpin in my body: a slick silk suit\nOn my feet was some white tube socks\nAnd a fresh pair of Chucks from the Foot-lock\nI showed him my sack, and don't you know\nWith a snap, the sack became some doe-doe\nOnce again his hands began to flow\nThen he changed my skateboard into a six-fo' (damn!)\nHe checked me over, passed me the keys\nAnd said, \"One more thing before you leave...\nYou must return before the stroke of twelve\nOr you'll turn back into your old self\"\n\n[Chorus]\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n\n[Verse 3]\nI jumped in the low-low and went on my way\nI got to the party 'bout ten, I'd say\nIt was after eleven when I rocked the mic\nAnd by the time I left the stage, the people were hyped (well alright!)\nThe princess was starin, while holdin a drank\nReflected from her eyes was gold tank\nShe waved her hands like, \"Hello! Hi!\"\nThen gave another gesture like, \"Come here, guy!\"\nI left the stage, girls came in flocks\nThe bitch was swingin from the hard knocks\nI heard a sound, not a tick nor tock\nGong! First bell before twelve o'clock\nNo time to waste, I broke out in haste\nThe princess followed in a futile chase\nA quick steady pace is what I kept\nLost one of my Chucks on one of those steps\nFor the six-fo' I continued my stride\nAbout this time I heard gong five\nI was down the block when I heard gong eight\nAnd the princess screamed out, \"Wait! Wait! Wait! Wait!\"\n\n[Chorus]\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n\n[Verse 4]\nI was almost home when my luck ran out\nAnd there went my suit, my doe sack and clout\nMy fresh low-low, also went too\nAnd there was no denyin that my night was through\nThe one All-Star, the freshest thing I sported\nJumped on my board, for home I skateboarded\nMade it to my pad, no time at all\nWent to my room, or better yet the far wall\nHid the shoe away, still feelin pleased\nThen jumped in my cot to catch some Z's\nEarly the next mornin, when I awoke\nI threw on me old slippers with me old housecoat\nSlid into the front, my family stared at me\nSayin, \"Wasn't that you? Nah, it couldn't be\"\nThey kept askin me if I did my chores\nMy butt was saved by a knock at the door\n\"Who is it?\", that's what my brothers barked\n\"The princess,\" this sweet voice remarked\nShe said she was lookin for a certain man\nWho could bring her the shoe like the one in her hand\nThe family ran around with their heads in the air\nBringin her shoes from everywhere\nShe just shook her head, a nod of relief\nAnd said, \"No, that's not the one that I'm lookin' for, Chief\"\nI ran in the room and got my shoe\nAnd said, \"Is this the one you're referring to?\"\nWell she said, \"Yes, and you're so cute\nBut where's your doe-doe and slick silk suit?\"\nI put on the shoe, then there came a flash of light\nAnd I was wearin shit, from just last night\nLooked out the window, saw the six-fo'\nYelled to my family, \"I've GOT to go!\"\nWe drove up the Avenue, the princess and I\nAnd in back of me, I heard my family cry...\n\n[Chorus]\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n(Cinderfella Doggy Dogg!)\nAnd I'm the rapper Doggy Dogg you love\n(Cinderfella Doggy Dogg!)", "image": "https://images.genius.com/96262525a2f5c48018386a9b9ec0e619.500x498x1.jpg"}], "artist": "Snoop Dogg"}