{"songs": [{"title": "Stay Wide Awake", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro]\nYo, yo, follow me\nCome with me to the dark side of the force\nNo man would boldly go to this place\nThe devil only knows of this world\nSo dark and, oh, so cold, it's, oh, so cold\nOh, so cold, oh\n\n[Pre-Chorus]\nSoon as my flow starts I compose art like the ghost of Mozart\nEven though they all say that they're real, I know that most aren't\nBoy, you think you're clever, don't ya? Girl, you think you're so smart\nCome with me to another side in a world so cold and so dark\n\n[Chorus]\n(Stay wide awake)\nA world so dark, a world so cold\nA world where on-ly some will go\n(Stay wide awake)\nBut none return, when will they learn?\nWhere do they go? God only knows\n(Stay wide awake)\n\n[Verse 1]\nFe-fi-fo-fum, I think I smell the scent of a placenta\nI enter Central Park, it's dark, it's winter in December\nI see my target, put my car in park, and approach a tender\nYoung girl by the name of Brenda, and I pretend to befriend her\nSit down beside her like a spider, hi there girl, you mighta\nHeard of me before, see whore, you're the kind of girl that I'd a–\n-ssault and rape, then figure why not try to make your pussy wider\nFuck you with an umbrella then open it up while the shit's inside ya\nI'm the kind of guy that's mild but I might flip and get a little bit wilder\nImpregnate a lesbian, yeah, now let's see her have triplets, and I'll di–\n-sintegrate them babies as soon as they're out her with formalde–\n-hyde and cyanide, girl, you can try and hide, you can try to scream louder\nNo need for no gunpowder, that only takes all the fun out of\nMurderin', I'd rather go vinn-vinn, and now you see just how the\nFuck I do just what I do when I cut right through your scalp, uhh\nShit, wait a minute, I mean skull, my knife seems dull, pull another one out, uh\n\n[Pre-Chorus]\nSoon as my flow starts I compose art like the ghost of Mozart\nEven though they all say that they're real, I know that most aren't\nBoy, you think you're clever, don't ya? Girl, you think you're so smart\nCome with me to another side in a world so cold and so dark\n\n[Chorus]\n(Stay wide awake)\nA world so dark, a world so cold\nA world where on-ly some will go\n(Stay wide awake)\nBut none return, when will they learn?\nWhere do they go? God only knows\n(Stay wide awake)\n\n[Verse 2]\nSo dark and so cold, my friends don't know this other side of me\nThere's a monster inside of me, it's quite ugly and it frightens me\nBut they can't see what I can see, there's a vacancy in my tummy\nIt's makin' me play hide-and-seek like Jason, I'm so hungry\nShe's naked, see, no privacy, but I can see she wants me\nSo patient, see, I try to be, but gee, why does she taunt me?\nPulls the drapes and she goes right to sleep and I creep right through the front, see\nSo blatantly, but silently 'cause I know that she's sound 'sleep\n\"Who's wakin' me so violently, and why's he on top of me?\"\n\"He's rapin' me,\" she tries to scream, \"Somebody please get him off me\nHe's tapin' me, he's bitin' me, he's laughing like it's funny\"\nShe's scrapin' me, she's fightin' me, she's scratchin' like some dumb freak\nEscapin' me, no dice, you see, I might just be Ted Bundy\nOr Satan, gee, what a sight to see, I'm dancing in my red panties\nI'm crazy, but it's alright with me, man, life can be so empty\nStay away from me 'cause I'm dancing to quite a different drum beat\n\n[Pre-Chorus]\nSoon as my flow starts I compose art like the ghost of Mozart\nEven though they all say that they're real, I know that most aren't\nBoy, you think you're clever, don't ya? Girl, you think you're so smart\nCome with me to another side in a world so cold and so dark\n\n[Chorus]\n(Stay wide awake)\nA world so dark, a world so cold\nA world where on-ly some will go\n(Stay wide awake)\nBut none return, when will they learn?\nWhere do they go? God only knows\n(Stay wide awake)\n\n[Verse 3]\nBetter try to stay wide awake or you might end up found dead by the lake\nSoon as you lay me down to sleep, bitch, your soul I'mma try to take\nPray for light of day right away, why do they try to fight today?\nI must make them pay twice as much, might as well put the knife away\nNow I use power tools, how 'bout now, are you in the shower?\nScour you for six hours 'til outage of power outlets\nHow did you figure out I was down in your basement? Now ya\nMust've just heard the sound of my stomach growlin' from down there\nProwler, there's no one fouler, bound ya, that's how they found ya\nFace down in the tub, I drown ya with piles of downers around ya\nSuch nostalgia and power, such prowess, look how you cower\nJump out on you now like I was a Jawa from fuckin' Star Wars\nJabba the Hutt, biddy-bye-bye, biddy-bye-bye, it's time to die-die\nOught to not even bother to scream, it don't even matter\nAmazing when grazing skin with these razor blades he waves at ya\nNot ya everyday Damien, bathe me in holy water\nNothing like Son of Sam, so please understand there's no gun in hand\nWhere's the thrill in the hunt? There's no fun in that, here I come with axe\nFun to act like lumberjack when I'm hackin' 'em up with that\nWhat was that? Dial 9-1-1, someone's comin' in from the back\n\n[Pre-Chorus]\nSoon as my flow starts I compose art like the ghost of Mozart\nEven though they all say that they're real, I know that most aren't\nBoy, you think you're clever, don't ya? Girl, you think you're so smart\nCome with me to another side in a world so cold and so dark\n\n[Chorus]\n(Stay wide awake)\nA world so dark, a world so cold\nA world where on-ly some will go\n(Stay wide awake)\nBut none return, when will they learn?\nWhere do they go? God only knows\n(Stay wide awake)", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}