{"songs": [{"title": "Mo’ Money Mo’ Problems", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Produced by Stevie J, Diddy, Nashiem Myrick and 6 July]\n\n[Verse 1: Ma$e]\nNow, who's hot, who not?\nTell me who rock, who sell out in the stores?\nYou tell me who flopped, who copped the blue drop?\nWhose jewels got rocks?\nWho's mostly Dolce down to the tube sock?\nThe same old pimp, Mase\nYou know ain't nothing change but my limp\nCan't stop till I see my name on a blimp\nGuarantee a million sales, call it love or luck\nYou don't believe in Harlem World, nigga, double up\nWe don't play around, it's a bet, lay it down\nNiggas didn't know me '91, bet they know me now\nI'm the young Harlem nigga with the Goldie sound\nCan't no Ph.D. niggas hold me down\nCudda schooled me to the game, now I know my duty\nStay humble, stay low, blow like Hootie\nTrue pimp niggas spend no dough on the booty\nAnd then you yell, \"There go Mase!\", there go your cutie\n\n[Hook: Kelly Price]\nI don't know what they want from me\nIt's like the more money we come across\nThe more problems we see\n\n[Verse 2: Puff Daddy]\nI'm the D to the A to the D-D-Y\nKnow you'd rather see me die than to see me fly\nI call all the shots, rip all the spots\nRock all the rocks, cop all the drops\nI know you thinking now, \"When all the ballin' stops?\"\nNigga never home, gotta call me on the yacht\nTen years from now we'll still be on top\nYo, I thought I told you that we won't stop\nNow what you gon' do with a crew\nThat got money much longer than yours\nAnd a team much stronger than yours?\nViolate me, this'll be your day, we don't play\nMess around, be D.O.A., be on your way\n‘Cause it ain't enough time here\nAin't enough lime here for you to shine here\nDeal with many women but treat dimes fair\nAnd I'm bigger than the city lights down in Times Square\nYea, yea, yea\n\n[Hook: Kelly Price]\nI don't know what they want from me\nIt's like the more money we come across\nThe more problems we see\n\n[Verse 3: Notorious B.I.G.]\nB-I-G P-O-P-P-A\nNo info for the DEA\nFederal agents mad ‘cause I'm flagrant\nTap my cell and the phone in the basement\nMy team supreme, stay clean\nTriple beam lyrical dream, I be that\nCat you see at all events bent\nGats in holsters, girls on shoulders\nPlayboy, I told ya, mere mics to me\nBruise too much, I lose too much\nStep on stage, the girls boo too much\nI guess it's ‘cause you run with lame dudes too much\nMe lose my touch? Never that!\nIf I did, ain't no problem to get the gat\nWhere the true players at? Throw your Rolies in the sky\nWave 'em side to side and keep your hands high\nWhile I give your girl the eye, player please\nLyrically, niggas see B.I.G be flossin’\nJig on the cover of Fortune, 5-double-O\nHere's my phone number, your man ain't got to know\nI got the dough, got the flow down pizat\nPlatinum plus like thizat\nDangerous on trizacks, leave your ass flizat\n\n[Hook repeats till end]\nI don't know what they want from me\nIt's like the more money we come across\nThe more problems we see", "image": "https://images.genius.com/d7c37bfa91c155503ffd68a2339826b1.1000x1000x1.png"}], "artist": "The Notorious B.I.G."}