{"songs": [{"title": "Extacy Pill", "album": "World War 3, Vol. 1: Lean", "year": "2013-08-13", "lyrics": "[Hook 1]\nEcstasy pill, Miley Cyrus\nAutomatic, big as a wheel, 4-door 'Rari\nNigga play with sticks in them chicks, we like bodies\nEverybody 'round me got m's, like the Cosbys\nPussy niggas know that I dare 'em\nThugga, these niggas know that you dare 'em\nI treat her good cause I know that she care\nI paint her face just like fuckin' mascara\n\n[Verse 1]\nAll my niggas talk realistic, all my niggas play with digits\nAll my niggas fuckin' friends-es, all my niggas fuckin' titties\nShit, all my niggas' finger itchin'\nAll my niggas pass a chrome hard, you know all the windows tinted\nI come through yo' block and make a fuckin' mess\nIn big white minivan with choppers and TECs\nThese bitches know I got now, fuck who got next\nI pay her attention, she pay me with sex\nYour bitch is a mag, I call her Complex\nMy kush out the grass, it's tall as a leg\nI just be like \"uh\" like her name Alexis\nI be leanin' like a Texas\n\n[Hook 2]\nEcstasy pill, Miley Cyrus\nAutomatic, big as a wheel, 4-door 'Rari\nWe just play with sticks in them checks, we like bodies\nEverybody 'round me got m's, like the Cosbys\nPussy niggas know that I dare 'em\nI swear these pussy niggas know that I dare 'em\nI treat her good cause I know that she care\nI paint her face just like fuckin' mascara\n\n[Verse 2]\nWhoa, whoa, whoa\nLil mama put a couple poles in her throat\nI'm tryna save her like a float on a boat\nHer mama muggin' cause I fucked all her folk\nI'ma put a hundred bands in her pants like \"I wish a nigga would\"\nI ain't talking 'bout no toilet but you know she from the hood\nI ain't buying no stilettos, red bottom with the wood\nGetting head while sitting at the bottom with the woods\nGotta give it to you bad, why the fuck I wouldn't? Why the fuck I couldn't?\nGod damn, that head like a golden spoon, just for my pudding\nI'ma buy that bitch a Benz with the top gone, let me feel this breeze\nYou know I'll buy that bitch a new whoadie\nI got a fo' of Act' inside my styrofoam, who wanna lean?\nThis nat nat know I'm not big Rocko\nBut you know I got nachos, nachos, nachos!\n\n[Hook]\nEcstasy pill, Miley Cyrus\nAutomatic, big as a wheel, 4-door 'Rari\nNigga play with sticks in them chicks, we like bodies\nEverybody 'round me got m's, like the Cosbys\nPussy niggas know that I dare 'em\nThugga, these niggas know that you dare 'em\nI treat her good cause I know that she care\nI paint her face just like fuckin' mascara", "image": "https://images.genius.com/2363c8d759c5b9334226a57823c9c00e.894x896x1.jpg"}], "artist": "Young Thug"}