{"songs": [{"title": "City of Stars", "album": "The Incredible True Story", "year": "2015-11-13", "lyrics": "[Verse 1]\nI know that you think this song is for you\nI used to long for you and adore you\nMy life was just fine way back before you\nNow when you reach out I just ignore you\n\n[Hook]\n'Cause this ain't a love song (Whoa)\nThis is, \"So long\"\nYou did me so wrong for so long\nFor so long, for so long\n\n[Verse 2]\nNo, I never thought I could live my life without you\nAll you ever seem to do is scream and make it all about you\n\n[Refrain]\nAnd so I doubt you\nI doubt you even know what's on my mind\nI said, I doubt you\nI doubt you even know why I left you behind\n\n[Interlude]\nI know that I've been living\nI know that I've been living\nI know that I've been living\nI know that I've been living\nIn the city of stars, where there's flying cars\nA brand new home for everyone and even life on Mars\nIn the city of stars, where there's flying cars\nA brand new home for everyone and even life on Mars\n\n[Hook]\nThis ain't a love song (Whoa)\nThis is, \"So long\"\nYou did me so wrong for so long\nFor so long, for so long\n\n[Refrain]\nAnd so I doubt you\nI doubt you even know what's on my mind\nI said I doubt you\nI doubt you even know why I left you—\n\n[Verse 3]\nYeah, uh, yeah\nMuch love to Def Jam, even though they under shipped me\nDid me like Bobby did Whitney, but the fans was with me\nKnow my name around the world but it still ain't hit me\nAll the talent in the world and they still don't get me\nI didn't talk about my race on the whole first album\nBut black vs. white bullshit was the still the outcome\nHow come these motherfuckers can't seem to let it go?\nJudging rap by race instead of the better flow\nWho gives a fuck who made it? I penetrate it and innovate it\nWhile they emulate it, give a fuck if I'm hated\nI'ma do it 'til I get it, fuck a nominated\nBitch, I dominate it\nYeah, emails from Rick Rubin, dinner with No ID\nChilling with B-I-G D-A-Double-D-Y K-A-N-E\nNot many get to do what I do, and now enemies\nThinking they slick as fuck like the finna befriending me\nBut let's get back to the music, I'm gone\nOutside of this solar system, I'm searching for paradise\nLivin' the life, bitch, I've been a vet\nFuck all these cats on the internet\nI love hip-hop and I hate hip-hop\n'Cause people that love Pac hope that Drake get shot\n'Cause he raps about money and bitches, for heaven's sakes\nPac did the same shit, just on a drum break\nNow, I ain't wanna name names, I'm just droppin' this game\nWe all people, all equal—now let me let off, yeah\nNow let me let off\nTougher than raw denim, my flow you can't identify\nTalib said it best back in the day, we just tryna get by\nTwo words, Mos Def, in my headphones\nBlack on one side, now I'm in another zone\nSwitch flows, fuck 'em up—play the game, run 'em up\nYeah, I sold a couple records but people don't give a fuck\nAll the people want is real, guess that's why Logic appeal\nAll the power in the world; hold that, tell me how that feel?\nRacism on television and magazines\nPaying taxes so soldiers don't run out of magazines, god damn\nCountry don't give a fuck who I am\nJust a youngin' on the rise with a mic in my hand\nAnd I am, here's to the Roc\nThe .45 Glock that my older brother pop—shot\nAnd I am, finally on top; too high up, not a drop\nStop, we gettin' guap, gettin' guap\nI am, livin' like I ain't got it\nSpit the flow so robotic, man, who gives a fuck about it?\nMaryland 'til I die, but I had to get the fuck up out it\nI love it and hate it, you probably don't know, man, I doubt it", "image": "https://images.genius.com/b9b6844bdd8ebfbe10235ad54d885cfa.960x960x1.jpg"}], "artist": "Logic"}