{"songs": [{"title": "Wishing On A Star (D Influence Remix)**", "album": "In My Lifetime, Vol. 1", "year": null, "lyrics": "[feat. Gwen Dickey]\n\n[Chorus: Gwen Dickey]\nI'm wishing on a star to follow where you are\nI'm wishing on a dream to follow what it means\n[Jay-Z]\nUh huh-uh-huh, yea\nJigga\nTrackmasters, yea\nRide\nTake it back, let's take it back, uh-huh\n\n[Verse 1: Jay-Z]\nCheck, you can catch me on top now (top down), playin a club\nThrowin a shot down, tryin to stay above\nGround, another ground-breakin day in the club\nSurrounded by my own thoughts, playin a cut\nReminiscin' on days I ain't have a pot to piss in\nNo watches to glisten, no V's with hot systems\nMissin my homies that passed right in front of my eyes\nDue to the fast life we told wonderful lies\nOn how we would live forever, time proved us wrong\nHad to get ourselves together and move it along\nHad dreams of being Big niggas, Jig niggas\nDrivin the hottest cars, movin out with our moms and I'm\n\n[Chorus: Gwen Dickey]\nWishing on a star to follow where you are\nI'm wishing on a dream to follow what it means\n\n[Verse 2: Jay-Z]\nWas interrupted by this chicken that I used to cluck wit\nBack in the days when I was movin much shit, \"What up chick?\"\nMaintainin, it's the same old thang\nA little stress, a little bullshit, ain't too much changed\nI see you kept it movin, you see I kept improving\nShe nodded her head in agreement\nRemember when I used to walk up and down the cement, puttin it down\nKnew the +Streets+ was +Watchin+, stay hooded down\nJust to earn a rep, but what good is it now?\nShe said \"Damn I just stopped to say Hi.... Bye\"\nI was too deep for you from day one\nThats why we never had relations, continued in my own zone\n\n[Chorus: Gwen Dickey]\nI'm wishing on a star to follow where you are\nI'm wishing on a dream to follow what it means\nAnd I wish on all the rainbows that I see\nI wish on all the people who really dream\nAnd I'm wishing on tomorrow praying it will come\nAnd I'm wishing on all the loving we've ever done\n\n[Verse 3: Jay-Z]\nWe used to play tap-tap for rap tracks\nRun, catch, and kiss in the back park until it got dark\nWanted to be like the older males, sneak and drink old champ-ale\nDangerous games we played on the third rail\nFiend for the summer breeze\nHopped out the Lee's Dungarees\nInto the Hawaiian shorts, relying on sports\nTo take us away from here, but I cut too much\nSo I had a plan B used to rhyme with a brush\nIn the mirror\nMy sinners used to back me up\nLike Doug E. Fresh and Ricky D., Eric, Mickey and Me\nAll my niggas is you with me, each of ya'll\nLet's reach for the stars now... Jigga!\n\n[Chorus: Gwen Dickey]\nI'm wishing on a star to follow where you are\nI'm wishing on a dream to follow what it means\nAnd I wish on all the rainbows that I see\nI wish on all the people who really dream\nAnd I'm wishing on tomorrow praying it will come\nAnd I'm wishing on all the loving we've ever done", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg"}], "artist": "JAY-Z"}