{"songs": [{"title": "Wannabes", "album": "Tha Blue Carpet Treatment Mixtape", "year": "2006-11-18", "lyrics": "[Hook: Nate Dogg]\nWannabes, wannabes\nGangsters, hustlers, killers, riders\nRappers, singers, Real G’s\nWannabes!\n\n[Verse One: Snoop Dogg]\nWanna dress like, wanna talk like us\nWanna be like, wanna walk like us\nNigga used to be soft, now you wanna be tough\nUsed to be in your video, shaking like Ugh?!\nYou motherfuckers be doing too much\nWanna be hating now you wanna be us\nI oughta really be clapping at y'all\nBut instead I’m straight laughing at y’all\nThen a nigga had the nerve to say fuck snoop dogg\nCuz got a perm and he just brought a coupe ya’ll\nTattooed L.B.C. on him and every little G in the streets want in\nThey talking about Cuz ain’t from the set\nAnd when they catch him in the hood, he gon get checked\nYoung G you better be where you say you’re from\nWhere you from, cuz? Wannabes\nNiggas gon hit you up, what it do Crip?\nNiggas want everything, even your bitch!\nUsed to be jewelry, and just your whip\nNowadays everybody is in it for the chips\nMy Grandmamma living in the south\nUnderstand me she even had to tell me what it’s about\nSay the white kids on the block wanna get a flex\nSay they love me like Elvis, ain’t that a bitch?\n\n[Hook: Nate Dogg]\nWannabes, wannabes\nGangsters, hustlers, killers, riders\nRappers, singers, Real G’s\nWannabes!\n\n[Verse Two: Young Jeezy]\nYou niggas wannabe’s I was raised by these streets\nEx-d-boy I did my thang in these streets\nWent out of towns on so many licks\nOn everything I love, wrapped so many bricks\nCatch me in the coupe with my hat sitting low\nIn a rental car wit the mac and the snow (haha)\nOr In a prizewinner wit the mac and the blow\nA half a mil a trip and I put that on Crip\nInglewood homies and they so Piru\nAnd So a nigga love every time I come through\nThe big homie told me Go on get em Nephew\nMake it do what it do, these niggas ain’t you\nNo wordplay, ad-libbed yo, yeaaaah!\nOutta line, pull a half clip yo\nSend em back to the lab, a lot of braggin’ going on\nTry and sound like ya boy, a lotta bank going ***\nJust one problem, that ain’t your life\nNigga just two problems, that ain’t your ice\nTold y’all niggas and I showed y’all niggas\nFuck around and make me expose ya’ll niggas\nWho me? I went rock for rock\nThen I stacked it all up and went block to block\nThey got that Yayo money, lay low money\nCold-blooded killer, better pay yo money", "image": "https://images.genius.com/b50520c49ea0b4c1554b6bce9fd66912.600x600x1.jpg"}], "artist": "Snoop Dogg"}