{"songs": [{"title": "Crime Story", "album": "It’s Dark and Hell is Hot", "year": "1998-05-19", "lyrics": "Mnn\nMan, uh\nShit stay happen\nYa know\nIts crazy dog\nIts off the hook\nBut you know\nReal niggas survive\nNo regardless\nCause I'm heartless\n\n[Verse 1]\nWho is this I see, coming through, its like 3 in the a.m\nI'ma rob this nigga, and when I'm done, I'ma slay him\nFor being stupid like, comin' through after 1 or 2\nAnd havin' a gun that he couldn't get to, yeah, that one'll do\nFoolish niggas learn the hard way, then I teach 'em\nBe in the wrong place at the wrong time, then I leach 'em\nLike Jigga said, niggas test you when your gun goes warm\nSo I keep 'em scattering like roaches, when the light turns off\nFrom night to dawn, right from wrong holds no weight\n3-57 slugs with a snub nose, dray eight\nSettin' all you bitches straight (what) squashing all beefs\nTo the point where the police be blockin' all streets\nGot me trapped up in the building, but you know how that go\nI stay fucking with the hood rats and I run up in the rab hole\nRun through the hallway, see police, face to face\nAnd being I'm telling you this story, means I caught another case\n\n[Interlude]\nIts either you or me\nAnd more than likely, its gonna be you, than me\nAiight? Feel me, O\n\n[Verse 2]\nDay 2 of the saga, this fucking drama continues\nWaking up like every 2 hours, looking out my window\nPlus I keep the 4-4 pointed at the door just in case\nWhen they bust in, I bust them and I'm gunning for the face\n\"What a waste of potential\" is what my teachers used to tell me\n\"You can always get a job\" and cheap shit they tried to sell me\nGot me no where but broke and fucked up in the game\nBut now I got a name, and niggas know my name\nKnock of the door \"Police! We're looking for a man\nKilled a couple of cops last night and the reward is ten grand\"\nI play like a bitch \"Its just me here, and I'm not dressed\nAnd that guy sounds kind of dangerous, I hope you make an arrest\"\nThat was a close one, now I know I gotta get outta the city\n'Cause I know I'm hotter than lava, I'll holla tomorrow\nGot my dog on the horn, he like \"Fuck, you done did?!\nThey done ran up in my crib, nigga, patting down my kid!\"\n(dial tone)\n\n[Verse 3]\nPut the harness on the dog, load up the weapons\nMurder's on my mind, no half steppin'\nMotherfuckers want war, you can get it\nCause I'm tired of running, remember me as the nigga that died gunning\nKamikaze mission, C-4 strapped to the chest\nRun up in that joint, raw dog; fuck the vest\nThey can keep theirs, cause it won't be the slugs that'll kill 'em\nIt'll be the roar of the C-4 as I'm bringing down the building\nWhen I go, taking a bunch of the motherfuckas with me\nI ain't sitting around waiting for them faggot niggas to come and get me\nI bring it to 'em, service with a smile; what nigga?\nDidn't know a dog with rabies was up in the cut, nigga?\nNow that you finally finding out what this shit means\nI'm at the precinct, 116th\nRun up in there, open up my jacket \"You motherfuckas looking for me?\"\n\"Well here I am! Now you coming with me!\"\n(Explosion)\n\n[Outro]\nMan, that shit is crazy, baby\nCan you dig it, can you dig it, can you feel it, is you with it\nIt's off the hook y'all", "image": "https://images.genius.com/8314b41ccd0d9cc7825bc168024bdec2.630x630x1.jpg"}], "artist": "DMX"}