{"songs": [{"title": "Sweet Revenge", "album": "Disturbing tha Peace", "year": "2005-12-13", "lyrics": "(phone rings)\n\n[Ludacris]\nHello?\n\n[Woman]\nBaby you will not believe this\nThis nigga ain't been home in three days\nHis kids runnin all over my house\nI don't know what to do\nHe comes in and out the house all times of the night\nHis girls keep calling my phone\nThey blowing it up calling back and forth wanting to cuss at me\nI can't take this no more\nI'm not sittin up in this house no more\nHe can have this\nI need to come see you baby\nCan I please come see you baby?\n\n[Hook: Ludacris]\nOne, here's what you do\nNow my name's Ludacris but please meet my crew\nTwo, say, there's no time to play\nBring a box of Magnums and get blown away, hey\nThree, there's no changing me\nI'm a pimp for most and it's plain to see\nFour, I'm so glad if he made you mad\nI know a way to get back that'll make you glad, you heard?\n\n[Ludacris]\nHello?\n\n[Woman]\nCris, I just caught this motherfucker cheating with my best friend\nI cannot believe this shit\n\n[Verse 1: Ludacris]\nOh, it's no time to fret\nCome quick with my favorite bra and panty set\nYep, oh, bust through the door\nSlide off the mink coat and throw it on the floor\nOh, yep, climb up the stairs\nKeep your high heels on and let down your hair\nYep, oh, let me grease them thighs\nThen turn it on around and get a back massage\nOh, yep, cause I aim to please\nWe can take our little time it ain't a thang to me\nYep, oh, I'm just along for the ride\nSo turn this way and let me kiss down the side\nOh, yep, and then it's off with your garments\nAnd please hold on while we shake the apartment\nYep, oh, and pop a bobble of bub\nAnd before we go again we can jump in the tub, yea\n\n[Woman]\nThank you baby, I needed that\nSo when we gonna do this again?\n\n[Hook]\n\n[Ludacris]\nHello?\n\n[Woman]\nCris, this nigga's stressin me\nI gotta get away\nI just need some time away right now\nBoo, can you please come see me?\n\n[Verse 2: Ludacris]\nWait, no need to explain\nI got a first-class ticket, just get on the plane\nYep, oh, and do your gangster strut\nThere'll be a stretch limousine that'll pick you up\nOh, yep, bring it straight to me\nI'll be on the top floor, hit the penthouse suite\nYep, oh, come on out your threads\nAnd get wet, the shower got about fifty heads\nOh, yep, blow a sack with me\nAnd head come on outside to the balcony\nYep, oh, you're a popular girl\nBut I'd like to introduce you to the top of the world\nOh, yep, and let the games begin\nDon't you love the way the breeze just hits your skin\nYep, oh, before we do it again\nHold tight and I can call up a couple of friends, yep\n\n[Woman]\nThank you baby\nYou're always there when I need you\nI love you for that\n\n[Hook]\n\n[Ludacris]\nHello?\n\n[Woman]\nAy, estoy cansada ese negro\nSolo que perder este pendejo\n\n[Verse 3: Ludacris]\nOh, wipe your tears away\nGive your boy 10 minutes cause I'm on my way\nYep, oh, and quit the whoopty whoop\nCause I bet you never rolled in a Bentley coupe\nOh, yep, the inside is snug\nTake your boots off and baby put your feet on the rug\nYep, oh, and put the drinks aside\nJust lay back kick it and enjoy the ride\nOh, yep, let the speakers bleed\nAnd I hope you don't mind if I increase the speed\nYep, oh, feel the engine thrust\nLet it flow through your body, your adrenaline rush\nOh, yep, I know it turns you on\nFeeling like you're in a place where you really belong\nYep, oh, go and grab your clutch\nAnd I can make you come again without a single touch, uh\n\n[Woman]\nAy, gracias por todo papi\nAy, te amo papi\n\n[Hook]", "image": "https://images.genius.com/ca7a724b4b53a52595efa79bde19ff2e.1000x1000x1.jpg"}], "artist": "Ludacris"}