{"songs": [{"title": "Make a Lot", "album": null, "year": "2016-01-12", "lyrics": "[Hook]\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\n\n[Bridge]\nI make a whole lot of money\nI blow a whole lot of paper\nWe fit each other right, like a Blazer\nYeah, yeah, yah\n\n[Verse 1]\nWe argue, we fight, and we fuss\nAnd we fuck and we muggin' each other\nI eat it, I lick it\nI treat it, I don't wanna leave it defeated\nCome on and fuck on me\nRun from me, buck on me, yeah\nPut luck on me, pull up on me\nFeel ups on me, suck gifts on me\nFuck is you hatin' for?\nI am so different, come have a tour\nI caught him disturbin' the peace\nAnd I left him extinct, like a dinosaur\nDrownin' in that mud like a muh'fuckin' rhinoceros\nI didn't think that she was a freak, but she kinda was\nYeah, she was a freaky little bitch\nI didn't get a chance to even eat that little bitch\nDo you mind if I keep that little bitch\nI'm gone, when I fuck a bitch, I'm straight outta the trenches\nDo you mind if I need that little bitch?\nDo you mind if I feed her to the clique?\nIf you mind, I don't ever wanna be rich\nAnd I'ma rip that money up with my clique like a pick, yeah\n\n[Bridge]\nI make a whole lot of money\nI blow a whole lot of paper\nWe fit each other right like a Blazer\nYeah, yeah, yah\n\n[Hook]\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\n\n[Verse 2]\nRacks on racks, on racks on racks, on racks on racks, on racks on racks\nHit it from the back and I can't see nothin' like a cataract\nYeah, yeah, yeah, yeah, yeah, yeah, yah\nStandin' back, lookin' like I'm bammin' it\nSmokin' packs, lookin' at you runnin' that\nI'ma die lookin' at your humble ass\nCome in, baby, that's my mama, baby\nMy heart racin', and I'm so impatient\nCall Metro and let leak Speed Racer\nCook that dope up, but no Easy Baker\nI swear to God, I only fucked I didn't cake her\nI was too busy buyin' acres\nThat's my bitch, nigga, that's my bitch\nShe can never come fuck you if she's my bitch\nGold VVS', I go Mitch\nAnd I swear you gon' get hit if it's a hit\nBitch, I've been the boss of ever since\nAll my fuckin' cups dirty like a ditch\nI'm in beast mode, like Marshawn Lynch\nAnd if it don't make dollars, then it don't make sense\nBut me? I swear...\n\n[Hook]\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\nI make a lot of money\n\n[Bridge]\nI make a whole lot of money\nI blow a whole lot of paper\nWe fit each other right like a Blazer\nYeah, yeah, yah", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}