{"songs": [{"title": "Seven Day Hustle", "album": "Adrenaline Rush 2007", "year": null, "lyrics": "Toxic China White Productions\n\n[Intro: Twista]\nUhh, yeah, ay\nSellin this here dope on these streets\nIt's a seven day thang, knowhatI'mtalkinbout?\nWe out here all day e'ry day hustlin\nYo Toxic, tell 'em what we talkin 'bout\nCheck it out\n\n[Hook: Toxic] + (Twista)\nCall my connect {\"On Monday\"}\n(What you got? Now what you got for me?)\nI pick it up {\"On a Tuesday\"} yeah\n(Bring it back, now bring it back for me)\nOhh, I cook it up on {\"On Wednesday\"}\n(Go to the kitchen, get the pots, hit the stove nigga)\nShut them niggas down {\"On a Thursday yeah\"}\n(Y'all can't serve around here, you gotta go nigga)\nYeah, we on the tip {\"Come Friday\"} yeah\n(Cash them checks, uhh, we on the set, uhh)\nPolice tried to sweat me {\"That Saturday\"}\n(They let us go we hit the sto' then hit the club nigga)\nWe still tippin {\"On Sunday\"} yeah\n(Seven days a week, that's how we do it cause we gots to eat)\n\n[Twista]\nThe rap for the hood, if you want 'em I gram 'em\nI'm Twista, I came back with the hustler's anthem\nAnd these are crack hooks that I spit, I hope my customers chant 'em\nSpit for niggas in Caprises that can't pull up in the Phantom\nThat's real - like rocks and blows when I'm rockin them shows\nOn the blocks with them O's when I'm droppin them flows, cockin the low\nWhen the Twista hit the scene and that's like BLAKA explode\nThese lyrics to the tracks is like workin them pots on the stove\nThat's real\n\n[Hook: Twista]\nI got cocaine if you really wanna {\"buy buy\"}\nI got ounces if you really wanna {\"buy buy\"}\nI got 'dro if you really wanna {\"buy buy\"}\nRocks blows if you really wanna {\"buy buy\"}\n\n[Hook]\n\n[Twista]\nGive me a look-up, I got the good hook up on cook up\nIf you low I'll front you to try to help you get a foot up\nPolice on my ass so I had to move a little bit quicker before I get shook up\nShit it's all the way I had to book up\nMakin money for my good ki with a good cut\nI spit that Cali kush, in the alley you can push\nAnd the ki I stay low-key so Detective O'Malley won't look\nEverybody be watchin my shows, everybody be rockin my flows\nGot yayo and that's the way shit goes nigga, O's nigga\n\n[Hook] - 2X\n\n[Interlude: Toxic]\nIt's a seven day thing man\nWe do it all week e'ry week, we hustlin\nLet me tell you how it goes again, aight?\n\n[Hook]\n\n[Hook] - echoes at the end", "image": "https://images.genius.com/37a0e3023180b834b869e6ad5b51b224.500x500x1.jpg"}], "artist": "Twista"}