{"songs": [{"title": "Keep It G", "album": "LIVE.LOVE.A$AP", "year": "2011-10-31", "lyrics": "[Intro: Chace Infinite]\nFuck the bullshit, my nigga. Y'all niggas started this shit. A$AP started it, y'all finish it. Don't let these mothafuckin' devils come between y'all. They start tryna separate shit, make this shit they shit or something that it's not. Y'all niggas got the mothafuckin' plan. Build the mothafuckin' plan, keep the team straight and keep that shit G. Don't let these mothafuckas come in between y'all. Y'all got the power, keep the power in y'all mothafuckin' hands. Fuck these niggas man, go get it. Ya feel me? Keep it G\n\n[Verse 1: A$AP Rocky]\nThis is music for the villains, sophisticated children\nA$AP in the house, now we're finna run the building\nWorking never chilling 'til I get a million\nTo the ceiling, now my niggas gunning for a billion\nThey ask me how I'm living, I say I'm gold grilling\nNiggas acting different, mothafuck' a friendship\nThese bitches is persistent, talking 'bout I'm distant\nLost my mind a long time ago to find it, need forensics\nFor instance, I get-get my dick licked\nRed bone, complexion like a piglet, kiss-kiss\nFuck Ace, we sip Cris, afford it cause I'm getting it\nDrip-drip, the thought of it is ignorant, isn't it? (hahahah)\nI'm ticklish, stunting is my business\nSwagging on you hoes and I'm shitting on you niglets\nSo little homie, peep game\nCause these other rappers lame and don't care to do the same\nYoung blood\n\n[Chorus: SpaceGhostPurrp & (A$AP Rocky)]\n(Hey, young blood) Stay true to the game\nFuck them lames, keep it mothafuckin' G\n(Hey, young blood) Nigga I'mma tell you\nLike a mothafuckin' G told me\n(Hey, young blood) Stay true to yourself\nEvery day, low-mothafuckin'-key\n(Hey, young blood) Cause at the end of the day\nFuck what you say, nigga I'mma keep it G\n(Uh, uh, uh)\n\n[Verse 2: SpaceGhostPurrp]\nWell, let me tell you 'bout a nigga like me\nI be smoking, choking, black locing with the OE\nShe wanna take a dick ride, we slide\nStraight to the telly, shaking her jelly with my dick inside\nHit it in motion, in slow motion, hit it\nNigga, she's open, nigga I'm poking, split it\nWith it, get it right there in the bed\nOpen up your legs, let me beat that pussy red\nFuck what you said, I'mma still do me\nGroupies, be sucking and fucking, porno movie\nDo we have a problem in here\nLook a nigga in the eye as I notice the fear\nI am severe, my style is hella sharp, like a spear\nAll I do is sit back and think with a 40 beer\nAnd you gotta feel the funk\nWhile the bass plays loud booming all in your damn trunk\n\n[Chorus: SpaceGhostPurrp & (A$AP Rocky)]\n(Hey, young blood) Stay true to the game\nFuck them lames, keep it mothafuckin' G\n(Hey, young blood) Nigga I'mma tell you\nLike a mothafuckin' G told me\n(Hey, young blood) Stay true to yourself\nEvery day, low-mothafuckin'-key\n(Hey, young blood) Cause at the end of the day\nFuck what you say, nigga I'mma keep it G\n(Uh, uh, uh)", "image": "https://images.genius.com/5fb9bbbba50174ef41a0dd1f68902363.500x500x1.jpg"}], "artist": "A$AP Rocky"}