{"songs": [{"title": "The Amazing Mr. F**k Up", "album": "DIME TRAP", "year": "2018-10-03", "lyrics": "[Intro: Victoria Monét]\nI loved you\nWhen there was nothing\nAnd now look what you've done\nTo me\n\n[Chorus: Victoria Monét & T.I.]\nIt's amazing how\nYeah, yeah\nYou hurt me so\nGoddamn, yeah\nHow could you do this again?\nYou must work really hard to fuck up this much, uh\nThat shit is amazing, I swear (I say, ayy)\nIt's amazing how\nYeah, yeah, yeah, yeah, yeah\nYou hurt me so\nGoddamn, man, you fucked up again?\nOver and over again\nSheesh, how the fuck you keep up with this shit\n(Damn) You never cease to amaze me, man\n\n[Verse 1: T.I.]\nIt's a, amazing all the shit I done\nSuch examples I've been setting for my son\nAll she did was stay down and have my kid\nAll the time just to realize I ain't shit\nSuch audacity that I must have\nTo get in men company and slap on ass\nDamn, if I must say in my defense\nI think should get credit for the asses I resi-\nWhat? Goddamn, now she get upset\nHuh, hang up in my face and block my number and shit\nThinkin', 'you fucked that up again, man, why don't you just apologize?'\nFor all the time you done got caught out in all the lies\nFor all the time that shawty put in on this long ride\nI'm 'posed to show her compassion, I show a lot of pride'\nThen when she looked at me, told me, \"You runnin' out of time\"\nBut this gon' feel different on the other side, it's gon' be amazing\n\n[Chorus: Victoria Monét & T.I.]\nIt's amazing how\nYou hurt me so\nYeah\nHow could you do this again?\nI swear, man, uh\nJust when I think you can't fuck up no more (I say, ayy)\nIt's amazing how\nHere this nigga go again, yeah\nYou hurt me so\nI can set my watch off for you\nOver and over again\nFuck is wrong with you, dude?\n(Ayy) You ain't shit, you know that, my nigga?\n\n[Verse 2: T.I.]\nI—I say\nIt's a, amazing how far I've come\nHomicide, fed time, auto-gun\nI used to take girls gettin' work on the run\nCut to the day and, man, I get in trouble flirtin' with one\nGoddamn, like the one we love, hurt her the most\nBroken promises and broke your heart, fill up the boat\nMake it too heavy when the water deadly\nHoller at your capture, tried to tell you but you're hardheaded\nThey all meddlin' in your business, 'cause they all messy\nAnd I don't let them bitches stress me that be y'all headache\nGot all my life to make you happy, this a small delay\nDon't sweat the small shit\nSaid I'd be dead in my twenties, I bet they all pissed\nDrippin', spendin' eighty in Venice, same at the dentist\nHopin' the gifts'll change your perception of me\nLook how I went from kissin' and lovin' her\nTo bein' just a nigga that she suffer for, damn, that's amazing\n\n[Chorus: Victoria Monét & T.I.]\nIt's amazing how\nMan\nYou hurt me so\nYou really fucked that up, bro\nHow could you do this again?\nNobody could'a did that like you, man, congratulations, man\nNever cease to amaze me, man, it's just amazing\nIt's amazing how\nI tell you, for a brilliant motherfucker you plum dumb sometimes\nYou hurt me so\nLook at what Mr Fuck Up has fucked up again\nOver and over again\nRound of applause for Mr Fuck Up, please. Everybody stand up\n\n[Post-Chorus: Victoria Monét & T.I.]\nHow could you, how could you hurt\nYeah\nHow could you, how could you hurt me\nJust when we think\nNo one can fuck up as much as they fucked up before, he is, he set the new standard\nHe's raising the bar, this shit's a—fucking—mazing people\nHow could you, how could you hurt\nPay homage where homage is due\nHow could you, how could you hurt me\nYou can learn a lot from anybody, man\nEven a motherfucker who show you exactly what not to do, you know?\nAnybody in life, man, you know what I'm saying?\nHow could you, how could you hurt\nFuck a role model, get a real model, man\nSomebody who gon' be real with you all the time\nHow could you, how could you hurt me, oh baby\nGood or bad, you know?\nA role model just playing a role, you know?\n\n[Outro (Sampled): Lauren London & T.I.]\nLONDON: Give me back my necklace!\nT.I.: No\nLONDON: Give me my damn necklace back!\nT.I.: Why should I?\nLONDON: 'Cause it's mine... and it means something to me\nT.I.: Man, watch out", "image": "https://images.genius.com/056bb25c4cca4f11a2abe45fbd57a9e6.1000x1000x1.jpg"}], "artist": "T.I."}