{"songs": [{"title": "Hip Hop Flashback", "album": null, "year": "2011-02-07", "lyrics": "Kenny Lee on the track\nThe way I'm flowin'\nKeep it goin\nI rip up the beat then I sew it, back together\nRap forever, its Philly\nWhilly, Now tell your favorite rapper that I'm tryna kill him, Really\nI'm in the porsche drop, 911 Porsche box\nThey can never eat me like a muslim and a pork chop\nOf course not, I'm dunkin' until the court drops\nLike B. Grif, I eat shit and hoarse blocks. HA!\n\nFlame Spitta you a lame nigga\nYou can't compare a G4 to a Plane nigga\nThats like versing a peddle bike into a train nigga\nLike Earl Boykins and letting Lebron James stick him HA!\nIt don't make no sense\nHow your label kick you out like you ain't paid no rent\nAlways been a star player, I ain't play no bench\nLet these hoes be hoes\nI dont say no bitch NAH!\n\nI be going rambo\nPaws on the pork, but I be going HAM though\nRiding on the beat like a mother fucking lambo\nHard Like X with, a '98 Cam flow\n\nSigel on the Roc, Nas on illmatic\nI'm still at it\nNo matter my choice know Phil back it and cool with it\nStill to the jab I move with it, I'm cool fritted\nFlyer than most but goon with it and still hood\n\nHonor roll swag real good\nDiamond all on your neck but your album is stillwood\nMoney my medicine, It be making me feel good\nThey lock me inside a cell, ain't matter I still stood\nAs tall as Yao Ming, Gasol, Bynum, and Shaq\nI'm rocking with rozay, Now they know that I'm back\nI'm whippin' in '62 and I ain't talking about crack\nI'm talking about that thang 360 stacks\n360 Days with 5 more I grind on\nOn my [???] bag get my shine on\nBail money only thing I dropped a dime on\nI tell them to get on the level that I'm on\n\nWas tellin' you how I'm moving out\nSomeone call the fireman just to cool me out\nI'm hot smokin' really I'm not jokin'\n[???]\nRapping automatic cause really they not smokin'\nPut them in the booth kapoof Hokus Pokus\nI make magic, Like the Lake Magic\nBut them in the water I drown em lake placid\n\nAnd I got bars like I took the jail with me\nWhen they let me out of prison I just took a cell with me\nI ain't got to drop an album, do a tape to sell 50\nI be blazin' in the booth tell your artist trail with me\nThey got a nigga on trial, they said I murdered the beat\nThey feel my pin and my pad my finger prints on the sheet\n[Fades out while still rapping]", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}