{"songs": [{"title": "No Omega", "album": "Let the Rhythm Hit ’Em", "year": "1990-05-22", "lyrics": "[Verse]\nI'm the Alpha with no Omega\nBeginnin' without the end, so play the\nIronside, no extended version\nNext episode'll be smooth as a Persian\nRhymes everlastin', there'll be no part 2\nKnowledge is infinite, once I start to\nDraw a better picture for your third eye, if you're blind\nYou know with a mic, I'm a black Michaelangelo\nI'm the brother who ideas are colorful\nGivin' 'em insight, but givin' 'em trouble to\nComprehend 'cause their thoughts won't blend in\nThey're pretendin', while I'm extendin'\nYou bite like a parasite, static when you attach\nBut you won't strike 'cause you ain't no match\nYou need more light 'cause yours got dim\nThen you get sparked by the Lord Rakim\nWhat's the matter, G? Check your battery\nGo get charged up, then come battle me\nYou try hard and die hard, you ain't ever ready\nWhen they check your pulse, you'll be dead as Freddie\nShop in Sears for new ideas\nCheck your engine and ask your engineers\nTo equalize it, try to disguise it\nIf that don't work, yo, then Midasize it\nYou need more power, better bring Battlecat\nBut this ain't Grayskull, and you ain't rippin', Jack\nDon't drop the mic and jet for your tooley\n(\"Bring it to me!\")\nWe can go rhyme for rhyme til the mic stop workin'\nThen I'mma leave you behind the Iron Curtain\nAnd you'll remain backstage\nYour book is over, I ripped your last page\nChanged the endin', at least you went out rappin'\nNow, I'mma tell 'em what happened\nI filled the mic with explosives and lit it up\nIt was too heavy to hold, he couldn't pick it up\nPass the mic, let him try to get paid\nHe hit the stage, it went off like a hand grenade\nNow, scrape him off the floor and off my list\nI ain't a soloist, I'm an arsonist\nSprayed him, he said he was gonna do what?\nPlayed him, MC Grand Pooh-Butt\nStole his lady, and drove her crazy\nYou asked me why, 'cause her man tried to play me\nI sent her back a nervous wreck\nAnd tried to put her back in check\nMy specialty is masterin' the female species\nI specialize in her, until she sees\nWhere I come from and why I came\nI tame and train til she manifest my name\nFill her with life until she burst with energy\nThen leave her restless, 'cause a lot of women be\nTryin' to drain us, and leave us stripped dry\nPut holes in our pocket, but you ain't that fly\nI clipped your wings and bring you down to Earth\nAnd tell you what life is worth\nIt ain't rings and things that's materialistic\nYou wanna pip on, imperialist with\nFood for thought, 'cause I'm your shelter\nI'll be your clothes, keep you warm and help ya\nNot to be hot to trot, why haunt?\nAnd why do y'all got to flaunt?\n(\"We gonna use what we got to get what we want\")\nCool, I heat you up like a black mink coat\nHug your neck like a fat gold rope\nWords I speak and my DJ's cuts will warm your ears\nLike mink earmuffs\nSo, Eric, show 'em how fast your hands'll go\nSo the people in the stands'll know\nThat you don't scratch your cuts engrave\nMoves in waves to my rhyme displays\nFloat, evoke, my tempo jets\nExpressions express when you kick steps\nKeep 'em energetic, so let it\nPound in your head til what I said is embedded\nDon't forget it's copacetic, set it\nAnywhere you want, your poetry's pathetic\nYou gets no credit til you get it straight\nLet's motivate\nNo intermissions 'cause it ain't commercial\nIf you wanna break, then I'll reimburse you\nI won't let go so my mic won't drop, 'cause...\n(\"I can't stop!\")\nVocabs is endless, vocals exist\nRhyme goes on, so no one can stop this\nEspecially when I start to say the\nRhymes with no Omega\n\nNo Omega\nNo Omega\n\n(\"I can't.. stop!\")", "image": "https://images.genius.com/7b516fdbbeea74e888da567eaf7416a1.1000x1000x1.jpg"}], "artist": "Eric B. & Rakim"}