{"songs": [{"title": "Hennesey N Buddah", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "(Intro)\nDPG, is down with us\nX to the Z, is down with us\nD-R-E, is down with us\nMy nigga Kokane, is down with us\nEastside gang is, down with us\nNiggas talkin shit, I'm gettin ready to bust\nI'm number one (one, one, one)\nWith a bullet motherfuckers\n\n\n[Hook: Kokane]\nI got this Henn in my cup\nAnd this Buddah got me stuck\nI'm just trying to compose myself (compose myself)\nI don't know why I act this way\nI just wanna be left alone\nI'm just trying to enjoy myself (enjoy myself)\n\n\n(Verse 1)\nAww naw (who is it?)\nIt's motherfuckin' Snoop Dogg\nI live the fast life, WHILE ya keep ya cash tight\nIn broad daylight, walkin' wit ya flashlight\nAddin' up what ya brought in from last night\nShe mad tight with mad bite (is that right?)\nBad lil bitches on my tizeam (tizeam)\nNigga, that's the American drizeam (wha-wha-wha-what)\nPussy broke the President (yeah it did)\nAnd pussy made a pimp rich (yeah it did)\nI live like I'm both as I smoke on my dope\nOn my boat...thumbin' through c-notes\n\n\n(Bridge)\nNow here's a toast to the coast\nCuz we doin' it the most (we doin' it the most)\nPlaya playa high costs\nUno, dos, I'm bout to get ghost\nStackin what ya mackin D-O-double G\nThe shit ya doin' is so lovely\nThe haters hate cuz they will never be\nThere ain't no limit to this melody (melody)\nYou niggas sippin on that jealousy (jealousy)\nI pour a tall glass of Hennesey (want some?)\nDo you wanna have a sip with me?\nOr would you rather try and trip with me? (trip with me?)\nPut ya cups on the table and your hands in the air\nAnd touch your brim to the side, that's only if you a player\nAnd all the ladies in this motherfucker acting up\nDon't hurt nobody when you back it up\nCuz we came here to have a good time\nMe and my niggas in the sunshine (sunshine)\nOn 3 wheels with one 9 (ya know)\nIt's time to shine, the world is mine (the world is mine)\n\n\n(Verse 2)\nI never ever dropped a dime (shiiit)\nNigga might cop a dime\nNever hesitate to pop a 9 (bah!)\nAnd always come up with the proper line\nStick to the script bitch I'm hurtin shit (hurtin shit)\nLet me show you motherfuckers what I'm workin with\n(what you workin with?)\nDon't need no water to go with your order\nAnd you ain't got to smuggle the shit up over the border\nAffordable, sportable, unbelievable, feasible, and reasonable\nWe leavin' 'em low\nCuz me and my loc, keep big leaves of smoke\nGallons of Hennesey and 16 liters of coke\nHe done drank and she done smoked\nThe meters are broke, we put the V to the note\nI brought the weed to smoke\nAnd Dr. Dre, he hooked the beat up, indeed it was dope\n\n\n(Bridge)\nStackin what ya mackin D-O-double G\nThe shit ya doin' is so lovely\nThe haters hate cuz they can never be\nThere ain't no limit to this melody (melody)\nYou niggas sippin on that jealousy (jealousy)\nI pour a tall glass of Hennesey (Hennesey)\nDo you wanna have a sip with me? (sip with me?)\nOr would you rather try and trip with me? (trip with me?)\nPut ya cups on the table and your hands in the air\nAnd touch your brim to the side, that's only if you a player\nAnd all the ladies in this motherfucker acting up\nDon't hurt nobody when you back it up\nCuz we came here to have a good time\nMe and my niggas in the sunshine (sunshine)\nOn 3 wheels with one 9 (ya know)\nYeah\n\n\n[Hook]\n\n\n(Outro)\nShaquille O'Neal, is down with us\nLil 1/2 dead, is down with us\nMy nigga Mel-Man, is down with us\nAnd eastside Watts, is down with us\nThe whole crip car, is down with us\nMy niggas on the four yard, I'm givin it up\nWe number one (one, one, one)\n(Gunshot) With a bullet motherfuckers", "image": "https://images.genius.com/8aab261cf0b0b7fefbc91b0a13ee9b3d.300x299x1.jpg"}], "artist": "Snoop Dogg"}