{"songs": [{"title": "I Hear Voices Pt.1", "album": null, "year": null, "lyrics": "To my Metal Face bros with stomachs of cast iron\nWho been in to win and blast to the last siren\nOn the slow-mo the calm artist with the so-so chick\nChased them all like how he did to Slobodan Milosevic\nAnyhoo, how 'bout them Yankees?\nOnce I leave off-stage the party people thanks mee's\nIf I may speak freely nasty like the freaky-deeky\nAt your local sleazy speakeasy\nFor any fan of the limelight\nIn the mic stand was left a lit stick of dynamite\nIt's risky business like hand-to-hand crack sale\nWith rappers who's better off on the cover of Black Tail\nJumpin Jehoshaphat, who's that?\nWho cats who do magic like \"Tell me how you do's that\"\nHeck no, especially those who cop pleas like gecko\nThought I might do techno\nHa ha, betcha bust out laughing at the vet\nFor no reason he get cussed out like Tourette's\nYet tight flow to make her bad ass stutter\nOr even crack a smile from a mad fast cutter\nBut uh... word play since third grade age\nBack when we used to play \"Bang! Open bird cage\"\nHip hop Benny Hill, Sip Henny straight\nGet every penny, wait, then he chill, at any rate\nMy metal face hoes with tongue or 'least eye ring\nDo yourself, I will continue to do my thing\nLike Kung-Fu fighting everybody was biting\nThen the super-villain struck again like lightning\nIn the same spot (bzzz!) now what's the chance of that?\nAnd a name drop like pick the name out the hat\nThat's a known drop from the, liver conniver\nWho vote player out the rap game like Survive while I\nDrop degrees like a nerd cat wheeling ten speed\nSo way back spin your back and then freeze\nWhile I play high-ball, low-ball, to zero\nSo called rhymers, go call Cleo\nWhile I, steal the show like \"thought so, try hikin\"\nSuper-duper stars need Ortho Tri-Cyclen\nSometimes the men, mostly from the women\nI hear voices saying that's the super-villain\n(Uhh, I hear voices)\nMostly from the women, I hear voices... super-villain", "image": "https://images.genius.com/263743633b6e58854e753b25dca6beab.430x430x1.jpg"}], "artist": "MF DOOM"}