{"songs": [{"title": "Quit Hatin’, Part 2", "album": "What’s My Favorite Word?", "year": "2002-09-10", "lyrics": "[Intro/Chorus: Lil' Jon - repeat 2X]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Verse 1: Lyfe]\nI got the call, stuck at the crib, hoe I'm ready for war\nCall your boy I got the deals and I'm hittin the do'\nI got some niggas with them figures waitin at the club\nGettin jigga with a swigga while I'm sittin on dubs\nLookin fake as hell, I keep my nails ready to fight\nClub closed, powdered nose, I'm on one tonight\nI keep them hatin bitches up so they can mimic the game\nWatch yo' back cause if he gangsta then I'm takin yo' mayne\nHaha, y'all bitches ain't keep shit real\nY'all bitches ain't got the wheel\nY'all bitches done clappin ya traps and don't even know the fuckin deal\nY'all just some hatin ass hoes, mad cause these real niggas chose\nY'all bitches be poppin that shit gon' get popped in ya fuckin nose\nCause this shit big shit bitch, I'm down with that player shit\nY'all over there talkin now but you really just wanna suck his dick\nY'all bitches is scared and y'all been dared to make a move hoe\nIt's Joan of Arc, pullin guns on y'all hatin hoes\n\n[Chorus: Lil' Jon]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Verse 2: Pimp C]\nMy baby momma butler hooked me with thirty-six\nSo many games cookin whippin down 55 in this bitch\nNiggas thought that I was slumpin I was steadily pumpin\nNiggas talkin bout a drop but man I ain't dealin nothin\nI'm a self made nigga on the grind in the skreets\nI ain't really wanna do it but my baby had to eat\nFrom sales to hotels and dough from pote(?)nail\nPay everybody bail, ain't no spendin time in jail\nBeen around the world, y'all niggas ain't seen all the shit I seen\nThem girls, send them to Essence cause they sixteen\nI'm comin through a couple bars to pimp them nipplezeens\nIn Southern Benz, S-Class, know what the fuck I mean?\nA pimper, a stankin shriver(?) a Jack Tripper\nA candy sweet dipper playin with cock and suckin on nipples\nEvery day my game get thicker, gettin good head from champagne sippers\nRapper the bird flipper, man, a motherfuckin nigga\n\n[Chorus: Lil' Jon]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Verse 3: Lyfe]\nHaters can't get it cause I ride with thugs, killers\nCan only date the millionaires and drug dealers\nTakin notes from Scarface and Goodfellas\nStraight gangsters or them motherfuckein hoodfellas\nPretty and still gritty, like Frank Nitti\nAnd I, flaunt my titties like I'm on \"Sex and the City\"\nSo here we go again, daddy short, why they hatin?\nCause ain't none bitch this rich and hit makin\n\n[Chorus: Lil' Jon]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Too $hort having convo that starts over Chorus]\nWhat's up Todd?\nWhat's up with you girl, what's goin on?\nAhh shit, the usual, fly from here to there\nDoin a little bit of change, legal money - ha ha ha\nLike that? Guess what, you know you on my album right?\nWhat? So what are you saying Todd?\nHe he he, I'm sayin that, it's goin down right now baby\nThe song is called \"Quit Hatin',\" and I just wanna know\nWhat would you say to the haters in yo' life?\nNiggas hatin.. bitches hatin.. fuck 'em!\n\n[singer - repeat to fade]\nYou ain't gotta hate me so much\nJust show me some love, when I pull up on dubs\nAnd you ain't gotta pay me to fuck\nJust show me some love, when you see me at the club", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}