{"songs": [{"title": "2 of Amerikaz Most Wanted", "album": "All Eyez on Me", "year": "1996-05-07", "lyrics": "[Intro: 2Pac & Snoop Doggy Dogg]\nUp out of there\nAin't nothin' but a gangsta party\nEh, light that up, Snoop! Why you actin' like that?\nAhh shit, you done fucked up now\n(Ain't nothin' but a gangsta party)\nYou done put two of America's most wanted\nIn the same motherfuckin' place at the same motherfuckin' time?\n(Ain't nothin' but a gangsta party)\nHa, ha, ha, ha, y'all niggas about to feel this\n(Ain't nothin' but a gangsta party)\nBreak out the champagne glasses and the motherfuckin' condoms\nHave one on us, a'ight?\n(Ain't nothin' but a gangsta party)\nA toast to the gangsters\n\n[Verse 1: 2Pac]\nPicture perfect, I paint a perfect picture\nBomb the hoochies with precision, my intention's to get richer\nWith the S-N double-O-P, Dogg, my fuckin' homie\nYou's a cold-ass nigga on them hogs\n\n[Verse 2: Snoop Doggy Dogg]\nSure 'nough, I keep my hand on my gun\n'Cause they got me on the run\nNow I'm back in the courtroom, waitin' on the outcome\n\"Free 2Pac\" is all that's on a nigga's mind\nBut at the same time, it seems they tryin' to take mine\nSo I'ma get smart and get defensive and shit\nAnd put together a Million March for some gangsta shit\n\n[Verse 3: 2Pac]\nSo now they got us laced\nTwo multi-millionaire motherfuckers catchin' cases\nBitches get ready for the throw down, the shit's about to go down\nMe and Snoop about to clown\nI'm losin' my religion, I'm vicious on these stool pigeons\nYou might be deep in this game, but you got the rules missin'\nNiggas be actin' like they savage, they out to get the cabbage\nI've got nothin' but love for my niggas livin' lavish\n\n[Verse 4: Snoop Doggy Dogg]\nI've got a pit named Petey, she Nigerina\nI've got a house out in the hills right next to Chino\nAnd I think I've got a black Bimmer\nBut my dream is to own a fly casino\nLike Bugsy Siegel, and do it all legal\nAnd get scooped up by the little homie in the Regal\nIt feels good to you, baby-bubba\nYou see, this is for the G's and the keys, motherfucker\n\n[Verse 5: 2Pac]\nNow follow as we ride\nMotherfuck the rest, two of the best from the Westside\nAnd I can make you famous\nNiggas been dyin' for years, so how could they blame us?\nI live in fear of a felony\nI never stop bailin' these motherfuckin' G's\nIf you got it, better flaunt it\nAnother warrant, two of America's most wanted\n\n[Chorus: Daz Dillinger & 2Pac]\nAin't nothin' but a gangsta party\nAin't nothin' but a gangsta party\n(Nothin' but a gangsta party)\nAin't nothin' but a gangsta party\n(Nothin' but a gangsta party\nIt ain't nothin' but a motherfuckin' gangsta party)\nAin't nothin' but a gangsta party\n(Nothin' but a gangsta party\nIt ain't nothin' but a motherfuckin' gangsta party)\nAin't nothin' but a gangsta party\n\n[Verse 6: 2Pac]\nNow give me fifty feet\nDefeat is not my destiny, release me to the streets\nAnd keep whatever's left of me\nJealousy is misery, sufferin' is greed\nBetter be prepared when you cowards fuck with me\nI bust and flee, these niggas must be crazy, what?\nThere ain't no mercy motherfuckers who can't fade the thugs\nYou thought it was, but it wasn't, now disappear\nBow down in the presence of a boss player\n\n[Verse 7: Snoop Doggy Dogg]\nIt's like Cuzz, Blood, gang-bangin'\nEverybody in the party doin' dope-slangin'\nYou gotta have papers in this world\nYou might get your first snatch before your eyes swirl\nYou doin' your job every day\nAnd then you work so hard 'til your hair turns gray\nLet me tell you 'bout life and 'bout the way it is\nYou see, we live by the gun, so we die by the guns, kids\n\n[Verse 8: 2Pac]\nThey tell me not to roll with my Glock\nSo now I got a throw-away\nFloatin' in the black Benz (Bitch), tryin' to do a show a day\nThey wonder how I live with five shots\nNiggas is hard to kill on my block\nSchemes for currency and dough-related\nAffiliated with the hustlers, so we made it\nNo answers to questions, I'm tryin' to get up on it\nMy nigga Dogg wit' me, eternally the most wanted\n\n[Chorus: Daz Dillinger & 2Pac]\nAin't nothin' but a gangsta party\nAin't nothin' but a gangsta party\nAin't nothin' but a gangsta party\nAin't nothin' but a gangsta party\n(Nothin' but a gangsta party\nIt ain't nothin' but a motherfuckin' gangsta party)\nAin't nothin' but a gangsta party\n(Nothin' but a gangsta party\nIt ain't nothin' but a motherfuckin' gangsta party)\nAin't nothin' but a gangsta party\n(Nothin' but a gangsta party\nIt ain't nothin' but a motherfuckin' gangsta party)\nAin't nothin' but a gangsta party\n(Nothin' but a gangsta party\nIt ain't nothin' but a motherfuckin' gangsta party)\nAin't nothin' but a gangsta party\n\n[Outro: 2Pac]\nBitch! Where you at? Where you at?\nAin't nothin' but a gangsta party\nYeah, Death Row", "image": "https://images.genius.com/e47c72fcb1f2756daafc49dc5167d814.1000x1000x1.jpg"}], "artist": "2Pac"}