{"songs": [{"title": "Look At Me Now (Remix)", "album": null, "year": null, "lyrics": "[Intro: Chris Brown]\nI don’t see how you can hate from outside of the club\nYou can’t even get in\nHahaha l'ego!\n\n[Verse 1: Chris Brown]\nYellow model chick\nYellow bottle sippin'\nYellow Lamborghini\nYellow top missin'\nYeah, yeah\nThat shit look like a toupee\nI get what you get in 10 years, in two days\nLadies love me; I'm on my Cool J\nIf you get what I get, what would you say?\nShe wax it all off, Mr. Miyagi\nAnd them suicide doors, hari-kari\n\n[Hook: Chris Brown]\nLook at me now, look at me now\nOh, I’m getting paper\nLook at me now\nOh, look at me now\nYeah, fresher than a motherfucker\n\n[Verse 2: Chris Brown]\nLil nigga, bigger than gorilla\nCause I’m killing every nigga that can try to be on my shit\nBetter cuff your chick if you with her, I can get her\nAnd she accidentally slip and fall on my dick\nOops, I said on my dick\nI ain’t really mean to say on my dick\nBut since we talking about my dick\nAll of you haters say hi to it\nI’m done\n\n[Interlude: Twista]\nNow let a track go past like this and Twista not fuck with it\nY’all done lost your mind\nLet me show y’all how I do it\nCheck it\n\n[Verse 3: Twista]\nI could hit you with the automatic flow\nI could do any rhythm and any pattern that I wanna do, the harder that it go\nYou could see blood spilling out from my body right in front of you, and I'ma get the dough\nNow the way I be shinin' be havin' everybody lookin' at me\nFuckin' them up when I buck and I'ma step and get off\nI do a murder when I'm trigger happy (like)\nI got the intricate patterns to kill her for currency when I'm be at 'em but I'mma be making ‘em holler 'cause I'ma get dollars when I'm attackin' the beat I'm a scholar 'cause I'm a personification of God so you better honor (what!?)\nMr. Immaculate, I’m gonna wreck it, I'll [?] your lyricist\nI’ll be here forever\nHaters wanna hate on me because they wanna hear whatever\nI could spit a rhythm to a bitch and get her pussy wetter\nPimpin' on a bitch and tell her I could get her pussy cheddar\nSo I get the camera then go and make a movie\nMe up in the back of her, tappin' her, gets the booty\nDidn’t wanna show my face even though she was a cutie\nNine millimeter and spillin' millions of milliliters of life out a nigga if he talk shit\nC.E.O., step into my office\nComing with the awkward flow like I'm sick\nGo get your momma to bring a thermometer\nMy temperature's hot\nCome up with a flow that would kill a industry, and I could pick anything that I want off the lot\nNever compatible 'cause I be intricate, when I be serving you\nWhen I be doin' it at a place, I know they can't leave me\nThink Twista could kill 'em on a track with Busta and Breezy, Weezy? Easy!\n\n[Hook: Chris Brown]\nLook at me now, look at me now\nOh, I’m getting paper\nLook at me now\nOh, look at me now\nYeah, fresher than a motherfucker\n\n[Verse 4: Lil Wayne]\nMan, fuck these bitch ass niggas, how y’all doin’?\nI’m Lil Tunechi, I’m a nuisance, I go stupid, I go dumb like the Three Stooges\nI don’t eat sushi, I’m the shit, no, I’m pollution, no substitution\nGot a bitch that play in movies in my jacuzzi, pussy juicy\nI never gave a fuck about a hater, got money on my radar\nDress like a skater, got a big house, came with a elevator\nYou niggas ain’t eatin’, fuck it, tell a waiter\nMarley said shoot ‘em, and I said okay\nIf you wanted bullshit then I’m like olé\nI don’t care what you say, so don’t even speak\nYour girlfriend a freak like Cirque Du Soleil\nThat’s word to my flag, and my flag red\nI’m out of my head, bitch I’m outta my mind, from the bottom I climb\nYou ain’t hotter than mine, nope, not on my time and I’m not even trying\nWhats poppin’ slime? Nothin’ five, and if they trippin’ fuck ‘em five\nI ain’t got no time to shuck and jive, these niggas as sweet as pumpkin pie\nCiroc and Sprite on a private flight, bitch I been tight since Guiding Light\nAnd my pockets right, and my diamonds white\nAnd my mommas nice and my daddy’s dead\nYou faggots scared cause I’m too wild, been here for a while\nI was like fuck trial I puts it down\nI’m so Young Money, if you got eyes look at me now, bitch\n\n[Hook: Chris Brown]\nLook at me now, look at me now\nOh, I’m getting paper\nLook at me now\nOh, look at me now\nYeah, fresher than a motherfucker\n\n[Outro: Chris Brown]\nOkay, okay\nIs that right?\nI’m fresher than a motherfucker", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}