{"songs": [{"title": "Young & Black", "album": "C4", "year": "2009-01-30", "lyrics": "[Intro]\nSoundwave, I feel we, put together\nSome of the most beautiful music my nigga\nReal talk, feels so good\nLet's get this money\nI feel like rapping tonight people\nCan I rap a little?\nDon't be mad..\n\n[Chorus]\nCuz I'm young and I'm black and my hat's real low\nIf you don't like my lyrics you can press fast forward\n\n[Verse 1]\nLook, why I always feel that I'm hot?\nWhy I always feel I should drop another jewel\nLike Martin on Blue Streak while you dudes get tattooed\nWith permanent scars, I'm always bullying y'all\nI'm always righteous to think that life is what you make it\nI'm always thinking of R&B bitches butt-naked\nI'm always on point, like a snitch on the go\nBut I never snitch my car's the only thing I towed on\nI'm always keeping it moving, middle finger up\nLike I practice celibacy, I don't give a fuck\nJust wait, I'm at they heads like a toupee yeah\nIt's like that, your cranium never survive titanium bars\nHarder than my dick when the tip gets licked, quick\nRun for cover like winter's here then listen here\nK. Dot you'll never shake me loose\nLike a tied knot off the goose, you mad at me too?\n\n[Hook: Jay-Z & Kendrick Lamar]\nCause I'm young and I'm black and my hat's real low (I can't front)\nIf you don't like my lyrics you can press fast forward\nI can't front, I can't front sometimes I feel like..\n\n[Verse 2]\nYo, why you always critiquing my shit\nWhy don't you hop on your own dick like Marilyn Manson\nI'm dancing with 2 brains, so if I got shot in the head\nI won't die I'll just lose more game, propane walking\nYou could sell my words at an auction for the right price\nAnd be rich your whole life, straight up\nI wanna see the world by 35 but for right now I'm Compton bound\nHit Rosecrans with a pocket full of dividends\nBig truck speed through the light, run over civilians\nPimp cut bitch on my right, hat low like a stripper ass\nWhen she hit the floor, doing my thing, why you complain?\nCause I'm young and I'm black and I rap like a nigga got a\nAngel on his back, wait a minute I means business\nYou homosexual with it, I give you straight lyrics\nNow that's an emcee, that's why you mad at me?\n\n[Hook]\nCause I'm young and I'm black and my hat's real low\nIf you don't like my lyrics you can press fast forward (Fuck Ya!)\nCheck me out..\n\n[Verse 3]\nWhat I write is a like a bomb device, press play\nAnd you can die tonight\nShook ones don't exist whenever that K. Dot spit\nOff the chain like fast pedaling while riding a bike\nI gets my ride on, you ride too\nBut like Scion, now that's a damn shame\nI'm hogging up both lanes\nPlay your part, styles like Kevin Hart\nThey're so plain\nI'm choking while I'm smoking on this strongest hocus pocus\nChocking with Punch\nHe sarcastic laughing cause I said that I can freestyle better than Kurupt\nNow that's a statement that hopefully I can back up\nSee Kurupt is a legend, that's where I get my shit from\nStraight lab rat, spit it once run it back\nLike a punt return, they tell me wait my turn\nSo that's what I'mma do, lay in the cut like a 2 shot Dillinger\nKilling these niggas in high pursuit waddup\n\n[Hook]", "image": "https://images.genius.com/8b626036c563b0aefa7a5b83f1fb9302.750x750x1.jpg"}], "artist": "Kendrick Lamar"}