{"songs": [{"title": "Barbershop", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: Kon Artis]\nThis time we're gonna do our thing (Huh)\nIs that aight wit' y'all? (Yeah)\nIt's gotta be 'cause we gon' do it anyway\nAin't that right fellaz (Yeah)\nFellaz ain't that right (Yeah)\nHaha\n\n[Hook: Kon Artis]\nTell ya people, that I'm the man\nI can't be faded, there's been a change of plans\nYou can meet me at the barbershop (At the barbershop)\nAt the barbershop (At the barbershop)\nYou can meet me at the barbershop (C'mon, where?)\nAt the barbershop (At the barbershop)\n\n[Verse 1: Kon Artis]\nWell, it's Friday afternoon and I just woke up (*burp-fart*)\nThat's right I just woke up\nFrom an excruciating evening at work, woman so what\nThat it's two-thirty-PM, I'm grown dammit straight up\nAnd know when through my finger either I think it is time we bust, you know\nLeave the premises less you planning to cook, I mean it's\nThree o'clock and I gotta gimme a cut for that\nBig party tonight thrown at K-P Productions\nAnd I don't wanna lose my spot\n'Cause everybody know \"Big O\" got the tightest fans on the block\nSo I got to be in that seat at Four o'clock\nShoot I need me some crispy-ones to go with my new outfit\nSo tell ya people\n\n[Hook: Kon Artis]\nTell ya people, that I'm the man\nI can't be faded, there's been a change of plans\nYou can meet me at the barbershop (At the barbershop)\nAt the barbershop (At the barbershop)\nYou can meet me at the barbershop (C'mon, where?)\nAt the barbershop (At the barbershop)\n\n[Verse 2: Kuniva]\nUnderstand me now, I'm cool as a breeze (Wassup playa, wassup)\nOn the black hand side, gimme some grease (Alright)\nI want a line-up and I don't want you to fate me (Nope)\nA ghetto girl with an attitude to come and braid me\nSo what's happening, the hood's seeing in\nI get the scoop on everyone in the ghetto so let's begin\nWho got shot? (Mike) Who got jumped? (Eric)\nWho got ganked? (Shay) Who got robbed? (Dee)\nWho went to jail? (Chuck) Who got saved? (Rick)\nWho's getting money and who's broke as a joke\nAnd hear about your lady called me that started smoking that dope\nYou get it all at this little dusty place\nLet me be still, she getting out the razor from my face\n\n[Hook: Kon Artis]\nSee tell ya people, that I'm the man\nI can't be faded, there's been a change of plans\nYou can meet me at the barbershop (At the barbershop)\nAt the barbershop (At the barbershop)\nYou can meet me at the barbershop (C'mon, where?)\nAt the barbershop (At the barbershop)\n\n[Verse 3: Bizarre]\nYou heard of me, the fat guy that raps\nNow it's time for Bizarre to take off his shower cap\nIt's been five days, I patiently waited\nSaturday morning, it's time to get faded\nAnd I mean get faded, \"I mean get faded\"\nDamn at four o'clock, I didn't almost make it\nMy barber's name is Sarah, she don't really know how to cut\nBut she got some nice teeth and big ol' butt\nSo two days a week, I get faded for no reason\nSame old haircut, keep it low and even\nIf you see me in a barbershop, go on and run\n'Cause I'm probably getting a perm and my toe-nails done\n\n[Verse 4: Proof Kon Artis]\nGot here full grip, but can't call the cops\nI gotta get the script from the lips to the barbershop\nJump in the seat \"Yo, give me the line and\"\nAnd tell me who came through shining\nMy homeboy scooped up, in a new truck\nGave everybody a cup and gave me a few bucks\nThen he started bragging 'bout his last lick\nCut me a design along with his address\n\n[Verse 5: Swift]\nYou can have a million dollar suit on, shining with your karats up\nBut it don't mean nothing if ya flogging in your haircut\nNow who next? (Um, I just want my son to get a tape-up)\nWhat about you sweetie? (So what you trying say?)\nI'm just playing with you baby (Hey, he do this all the time)\nAnd all you do is whine, and drink wine (Hahaha)\nYo, you know that Cho-chie got knocked out? (Man) (When?)\nEarly at Le'mott's house (Again?)\n(I wouldn't let that man sit on my couch)\n(You was wit' him yesterday)\n(Man what are you talking 'bout?)\nI'm just about ready to throw y'all out\n(No you ain't, I'll be here for 'bout a hour)\nYou know I'll raise up the rates\n\n[Hook: Kon Artis]\nTell ya people, that I'm the man\nI can't be faded, there's been a change of plans\nYou can meet me at the barbershop (At the barbershop)\nAt the barbershop (At the barbershop)\nYou can meet me at the barbershop (C'mon, where?)\nAt the barbershop (At the barbershop)", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}