{"songs": [{"title": "Bring It Back", "album": "Rhyme & Reason (Original Motion Picture Soundtrack)", "year": null, "lyrics": "Ha, hahaha!\n(\"Bring it back, that old New York rap\nBring it bring it back, that old New York rap\") -- repeats in background\nThe only reality\nIs now...\nYo!\n\nVerse One:\n\nI rock slow and easy like soul\nThe New York flow, is strictly for the pro\nHip-hop! Ladies and gents\nSo you can know, every word yo, of the sentence\nHey la, like De La, I got Common Sense\nSave the compliments for after I commence\nTo evidence of MC's, rockin under false pretense\nYes they get burned like incense\nMyrrh and frankencense, you know the consequence\nWhen you rock with KRS and don't make sense\nKris represents all MC's, that rock with ease\nI'm not conceited, I got confidence in my abilities\nAgility's my credibility\nOratorical artillery in all facilities\nIt Takes a Village like Hillary\nWhen killin me, KRS has wide range capabilities\nOn the microphone, in the combat zone\nMC's get eaten like the ozone layer\nHey ya, I'm not a playa I'm a teacher\nBut if I wanted your girl\nYou'd be Living Single like Latifah\nAction Uptown like Monifah\nI hit like a beeper, and hot like the bunny on Easter\nLyrically let me freak ya\nWith moves like Scoob and Scrap\nRock Stready, Stretch, Al and Kiko\nI warm up any room like a heater\nBringin a New Balance to the speaker like a sneaker\nStill a teacher, prove it, like medicine squared\nThis Garden of Eden, keeps the party movin\n\n(\"Bring it back, that old New York rap\nBring it bring it back, that old New York rap\") - repeat 2X\n\nVerse Two:\n\nI'm interested in skill and how we build as a culture\nI don't eat off old material like a vulture\nRepeatin myself for wealth is bad for my health\nEveryday I express myself with a dope lyric\nFrom my inner spirit, then I share it with others\nAs they hear me, enhancin\nEast and West, overseas, brothers and sisters\nSons and daughters transcended all borders\nI deal with mind expansion\nAnytime you aimlessly dancin, and romancin\nIt's your life that you be chancin\nNot that I wanna sound gloomy\nBut I don't rhyme about Judy Judy, cutie and shake your booty\nWhen you gonna grow up and be GOD?\nInstead of making a rap a full time job\nYeah, it's a job and not an art\nThey only rhyme to get money;\nCause true self-expression takes heart, and guts\nRhymes, and cuts\nTight minds and not tight butts\nReach your goal, like a puck\nI wish you good skill and not good luck\nCause only skills put you up out the gutter so I utter\n\n(\"Bring it back, that old New York rap\nBring it bring it back, that old New York rap\") - repeat 2X\n\nVerse Three:\n\nThat old New York flow means wrote for fun\nAnd if the money come, THEN THE MONEY COME\nBut today and everyday, KRS speaks the truth\nWe dealing with unemployment in the city black youth\nUsin rap, to put clothes on they back\nNo culture, or disciplined, way to act\nBut soon yo, we'll take care of alla that\nWe're huntin fi de power help supress people tracks\nThat keep the culture intact, and soon you will see\nIn the black community, black unity\nNot black nudity, after black puberty\nFor every crew to see, to breakin down the black community\nThe only one to blame is you and me\nFor not takin responsiblity for our artillery\nVerbally, you heard of me, Knowledge Reigns Supreme\nOver Nubians Everywhere, I kick it cause I care\nThe end isn't near, it's way over there\nBLAOW! The only reality is now\nBut when I say bring back the old flava\nThat means bring back the ORIGINAL MC behavior\n\n(\"Bring it back, that old New York rap\nBring it bring back, that old New York rap\") - repeat 2X\n\nVerse Four:\n\nNow I got to show you how the BX rocks\nMC's, are jumpin out shoes and socks\nBody body rock body body rock\nI'm the king of rock'n'roll, ahh yeah\nThrow your guns in the air! Glocks down\nWho the hell is this, pagin me at 5 o'clock in the mornin\nWhere you gonna be, because...\nFresh is the word, many money missin many\nJenifa, oh Jenny\nWe make up all these rhymes inside our head!\nYo, let's connect politic ditto", "image": "https://images.genius.com/03f8a7ed79d180b1d1fa9cad7ca98ba3.598x598x1.jpg"}], "artist": "KRS-One"}