{"songs": [{"title": "Yessir!", "album": "Born Like This", "year": "2009-03-24", "lyrics": "Live! In stereo\n\n[Intro: Raekwon]\nYessir! This what I wanna hear my nigga, yeah\nYeah yeah\nYou don't even know that's the official word up in the town\nYou heard? Ha ha ha\nGet that swing, yessir! Get it in man\nThat's the official shit kid, mmhmm\nWord up, we gon' take it back to the big park 'n shit\nYeah, when niggas was rhymin hard and comin crazy\nElectrifying and vivid, yo\n\n[Verse: Raekwon]\nI'm like a rabbi, fresh new mag and I'm mad high\nStolen black Jag I brag fly, yeah\nYo a project thug, political gangster, starving Langston Hughes\nThe Jews want the crib when the God dies\nI'm deadly, metaphors'll dog you while I'm in the Forbes\nFirst 500 niggas who raw live\nYo B, the nigga Shallah, he low-key\nBut he O.G., half of his niggas gone or in hidin\nFederallis'll sneak, police, holdin my old piece\nHeard the young policeman died\n58 carats of glass, the Aston—blueberry black\nWhere I keep my ices and knives at\nOne of the force rawest, yo we're British aware\nWho get money shoot dice in his fortress\nMocknecks and stragglers, eightball jackets the hagglers\nOf the rap game, post up surprise\nI want that spot, coolin with the Supervillain team\nAll you other playboys is twats\nNiggas be down for the murder game\nRun in the church, grab the rifle, put one in a nigga frame\nI'm thirsty, hungry like a Somalian\nPolly with them niggas with the waves in they dome like tsunami\nAll we do is get fresh and fuck ma\nProbably yo' baby ma gave me head in Barney's while I calmly\nAnd I got giants in armies\nWhile we rock mean colored clothes and don divas\nYeah Chef back, some call him Louis Smith\nSlash Lex Diamond and his chick sell crack\nWe rep bananas, beat this, legend of Stan Smith\n700 dollar jeans, keepin your man distance\nYeah son, gimme your ear son\n\nYo yo yo, yo yo get the fuck away from the ropes man\n\n[Outro]\n{*beep beep beep beep beep beep beep beep*}\nDoom, the warning signal again\nSomebody approaches!\n\nWhat manner of creatures are these?\nThere they are again, FIRE!\n\n\"A gunshot from inside the house, forces a change of plans\"\n{*monster roaring*}\n\"A straightforward entry, has turned into what appears to be\"\n\"A barricaded standoff\"\n\n\"POLICE DEPARTMENT! COME TO THE FRONT DOOR!\"\n\"Anything you say, cracker\"\n\nAs the funky beat continues..", "image": "https://images.genius.com/01edf9d69a6ac635d7ca4d452539e8ce.1000x1000x1.jpg"}], "artist": "MF DOOM"}