{"songs": [{"title": "The Trillest", "album": "Dreams Worth More Than Money", "year": "2015-06-29", "lyrics": "[Chorus]\nWas the money good?\nWas em bitches bad? Was they fuckin' good?\nDid your hood show you love? Did the hoes say you fly?\nIf your friends say you're loyal, throw your rollies in the sky\nFor the trillest, for the trillest\nAs the champagne pours and the campaign roars\nAnd the lights shine bright every night they applaud for the trillest\n\n[Verse 1]\nSee my momma cry too many tears\nAnd we been broke like too many years\nIt ain't too many kids, a couple homies, there ain't too many there\nAnd they all gotta eat, they got too many kids\nTo many kids with no fathers, doing too many bids\nToo many bids, judge gave 'em kids too many years\nAs soon as you get that money, that's as soon they appear\nAssuming you 'em  owe something, they assuming you’ll share\nAnd yeah, I've been losin' touch with my family, it ain't the same\nI should've gave my sister some money, but I made it rain\nI should've hit the crib with my son and played a game\nBut instead I ended up at the jeweller to make a chain\nIt's a sad saying when you make money it make you change\nLike four quarters, the fourth quarter, I make a lane\nShit, I had to walk for it they talkin' 'bout takin' trains\nAnd takin' planes, I put the work in and made the name\nBut the question is\n\n[Chorus]\nWas the money good?\nWas them bitches bad? Was they fuckin' good?\nDid your hood show you love? Did the hoes say you fly?\nIf your friends say you're loyal, throw your rollies in the sky\nFor the trillest, for the trillest\nAs the champagne pours and the campaign roars\nAnd the lights shine bright every night they applaud for the trillest\n\n[Verse 2]\nI never wanted to be like Mike, I wanted to be like Mitch\nNow all the lil niggas wanna be like this\nI wear my chain in any city, let you see my shit\nCause I earned that, it's on me, I'mma keep my shit\nI got blood on my money, ether in my soul\nDo you know the feeling durin' Easter with no clothes?\nNow it's stars in the ceiling, bringing ether out the Rolls\nWith the curtains on the windows, I'm just peekin' at my goals\nMoney made me iller, already was realer\nYoung kings killin' young kings over skrilla\nThat's why I ride around mac on me like I was Miller\nOr Reggie when I shoot for that three\nThey drop fetty, that's good money\nCome to my city, we talk heavy and die young\nWhen we get some paper, we cop Prezis and ride rim\n20 inch rims for the dope boy\nSellin' that coke boy, trappin' on your note boy\nGot that buy it all money, fuck I need a note for!?\nIn them school hallways, \"fuck I need a note for!?\"\nWe ain't wanna go to class, we was sellin' coke raw\nThe principal was coppin' too, hit him with a snowball\n\n[Chorus]\nWas the money good?\nWas them bitches bad? Was they fuckin' good?\nDid your hood show you love? Did the hoes say you fly?\nIf your friends say you're loyal, throw your rollies in the sky\nFor the trillest, for the trillest\nAs the champagne pours and the campaign roars\nAnd the lights shine bright every night they applaud for the trillest\n\n[Verse 3]\nLookin' for the intro\nI was at the dealer lookin' for another Benzo\nMatching kicks with my Kenzo, young nigga\nHeart of a lion, hungry as hippo\nWhen I was on my last, nobody ain't tell me shit though\nFlow slicker than Crisco, niggas talkin', I get low\nDo my thing, they jump back, know how that shit go\nAnd they say I'm arrogant\nI'm still eatin' steak with the asparagus\nWhen I get that money like I married it\n1 milly, 2 milly, 3 milly, buried it\nSince they say I'm underground, I run that bitch like Harriet\nRolls Royce pushin' real slow like a chariot\nPull up on them niggas that doubted me, shit embarrassin'\nI'mma real nigga with money, never cherish it\nYou a fake niggas with money, it's no comparison\nTold me that I couldn't get signed when I was rappin' it\nAnd told me I couldn't do songs when I was battlin'\nThey told me that I couldn’t be trapper, I started trapping' it\nNever listen to 'em, oh well, shit is immaculate\nI'mma just go sit up in this Bach again\nSmoke the weed and laugh at them\nMake a couple million by accident\nCouple niggas dropped on Twitter, they say they back again\nCouple months later on Twitter they say us laxative\nShitted on 'em, Nicki voice, did it on 'em Benjamins\nPlently of 'em Benjamins, semi on him and he on a\nWhole 'nother level from before now\nTell my niggas when I see a hundred mil its going down\nWhen I made my first mil, I was like \"it's on now\"\nThen I made my second mil, money on the floor now\nThen I made my third mil, I'm like \"I need more now?\"\nI got in my zone and that money started pourin' down\nEvery time I hit the booth, microphone torn down\nWe couldn't get a pair of Pumas, we up in the store now, bitches!", "image": "https://images.genius.com/1a5cda77113ea2b18bfbec0f3ffbaf69.1000x1000x1.jpg"}], "artist": "Meek Mill"}