{"songs": [{"title": "How Bad Do You Want It", "album": "Bootleg Volume C (Mixtape) ", "year": null, "lyrics": "[KRS]\nYo, my man, how bad do you want it?\nYou know how many cats I threw the pitch, and they never caught it?\nI told them to bring they lyric, but they never brought it\nScared to get ripped off, cheated, deleted, rejected and shorted?\nYo, how bad do you want it?\nFearóI ain't got no time for it\nIf you want it, yo there's the trackóput your rhyme on it!\n\n[Peedo]\nThis hunger inside of me's unexplainable, Kris\nThe struggle we put in this box will be put into disc\nBirth and ever, these family problems is hurtin'\nBoth of my sisters is pregnant, fuckin' feel like murkin'\nAll I have is my word and my balls\nAnd my fam and my music speaks for them all\nIt's the Dominican animal ready to damage, you puttin'\nPressure to rappers that think they can challenge you, Kris (uh huh)\nWe been through it all, the grimiest days, this earth ain't\nReady for my brain, comin' to face (word)\nEveryone plus everyone\nDo you hear me, KRS-One?\n\n[KRS]\nWell listen\nYou grimy and hungry?\nBut how long you gonn' trust me?\nYou really down for this cause or just chasin' the money?\nI be up in them spots to be hot, so dusty and ugly\nNothin' be funny, it's all dark, nothin' sunny\nCan you walk with me? Talk with me? Pop the cork with me?\nWhen we in other cities, will you rep New York with me? (yeah!)\nI need respect and honor\nDiscipline and no drama\nHow bad you want it, poppa? (with all my…)\n\n[Peedo]\nLoyalty is the key to it all (remember)\nGet used to my face, we the winners of all\nBy mi gente, yo I go low to say-ah\nReal like them Washington Heights\nNiggas there (say yeah!)\n\n[KRS]\nAfter you rap, will you stab my back? (never)\nYou gimme a track, will you take that back? (never)\nI give the word, yo you bustin' your Gatt? (whatever)\nRespect from your crew? They livin' like that? (they better)\nThis is no game! Why should I make you popular?\nYou know I'm the philosopha\nHow bad do you want it?\nHow bad do you need it?\nIf you see it, you can believe it, perceive it, retrieve it and flaunt it\nHow bad do you want, doggone it, there's the track, if you want it\nYou got to put your rhyme on it!\n\n[Peedo]\nHow bad do I want it? I'm ready to die like Big\nA serious man with blood in my eyes for this\nSuccess doesn't come overnight\nIt's gonna be dark a while until I see light (that's right!)\nWhat is it?\n\n[KRS]\nThis is no game, why should I do it?\nKRS-One, me and Peedo runnin' through it\nI saw you down the street in FedEx\nYou said you had the beats was comin', like \"I Got Next\"\nSo we went upstairs, my man Choco hooked it up\nThis is KRS-Oneóturn my voice up! Whaó (wha-,wha-)\nHow bad do you want it?\nHow bad do you see it?\nHow bad do you hear it?\nHow bad do you BELIEVE you can be it?\nIf you doubt, then you're out\nIf you believe, you can achieve\nI got the city on lock, but I'm gonna hand you the Keys like Alicia\nYou know my style, you know I'm the teacha\nPhilosopha, minister, emcee, Hiphop's spiritual leader\nWith the heater\nYou comin' with me? You runnin' with me?\nIn the spirit Scott LaRock, JMJ and Pun is with me\nYo, cats be steppin' to me ALL the time\nWith the rawest rhyme\nBut two weeks later, they fall to crime\nIf you listenin' to this song, and you want to be put on\nYou must be loyal to the cats that made you strong\nIt could be your friend, your father, you sister, your mother, your brother\nOr some other\nJust remember the days when YOU was under!\nBefore the Hummer, before the Benz\nBefore the hundreds, before the fifties, the twenties and tens\nWhen you was thirsty, remember the living water, and who poured it\nNow ask yourself, how bad do you want it?", "image": "https://images.genius.com/0ae7fd1de79ff5822b37cf264aa778ab.370x370x1.jpg"}], "artist": "KRS-One"}