{"songs": [{"title": "Hold You Down", "album": "I Love You (A Dedication To My Fans)", "year": "2011-05-23", "lyrics": "[Intro: Jadakiss]\nI Love You! Muah! EH HEH!\nUh! Yeah! Yo!\n\n[Verse One: Jadakiss]\nLot of square feet choppin speed is the minimal\nTalk all subliminal in love with a criminal\nIt's all comin back to the pot no chemicals\nShe can get hired on the spot no interviews\n(WOO!) No carbs just vitamins, minerals\nRidin shotgun in the Coupe with the general\nYo go hard for the kid so I'm into you (Yeah!)\nHold you down, that's what I'm fittin to do\n\n[Hook: Emanny] (*Jadakiss)\nNo girl will ride, like you do for me baby\nGirl, I'll, hold you down! (That's why I) Hold you down!)\nThem girls on the side! Ain't got what I need baby!\n(That's why I) Girl, I'll, hold you down! (That's why I) Hold you down!\n(*Yeah! EH HEH!)\n\n[Verse Two: Jadakiss]\nYeah! Cash comin rapid and chicks comin after me\nHere cause I wanna be, not because I have to be (Uh Uh!)\nYou the one I wanna be with ma actually (Yep!)\nI knew you were special cause we hit it off naturally\nHad your guard up at first now you attached to me\nGot to give you all of me, can't give you half of me\nYou can take your girl we 'gon move carefully\nThe hot bath water (Uh Huh!) The meals you prepare for me\nWhen nobody else was, you were always there for me\nAnd I love mysel fjust need you to care for me\nYou done more than enough I owe you now (I got you!)\nSo it's only right that I hold you down\n\n[Hook: Emanny] (*Jadakiss)\nNo girl will ride, like you do for me baby\n(That's why I) Girl, I'll, hold you down! (That's why I) Hold you down!\nThem girls on the side! (*Hey!) Ain't got what I need baby!\n(That's why I) Girl, I'll, hold you down! (That's why I) Hold you down!\n\n[Bridge: Emanny] (*Jadakiss)\nI doubt that I, let this one get away (Get away) (*Uh Huh!)\nShe's what I'm wantin (Wantin) And ain't no comparin to you girl (*Nah!)\nI'll never play, with, you, not with those silly games (*Nah!)\nNo need for lookin (*Uh Huh) Cause there be, none, that's, like, you, girl!\n\n[Verse Three: Jadakiss]\nYo! Listen I ain't tryin to play with you I'm tryin to stay with you (Uh!)\nNah mean, spend forever and a day with you (Yeah!)\nNever mind them side chicks and they issues (Never mind)\nThat ain't nothin but bad luck that they wish you\nIt ain't about them though It's 'bout the two of us (True!)\nThey can't stand to see us doin us (Uh!)\nAnd I told you, this is what I go through\nBut words can't explain this no I gotta hold you..down\n\n[Hook: Emanny] (*Jadakiss)\nNo girl will ride, like you do for me baby\n(That's why I) Girl, I'll, hold you down!\n(That's why I) Hold you down! (*I got you!)\nThem girls on the side! (*Don't sweat that!)\nAin't got what I need baby! (*Hey!)\n(That's why I) Girl, I'll, hold you down!\n(That's why I) Hold you down! (*I got you!)\n\n[Outro: Jadakiss]\nTrust me! You in good hands! We 'gon be aight! Ha Ha!\nI love you! MUAH!!!", "image": "https://images.genius.com/2a0fbea6220144ee9e467410d8edb303.1000x1000x1.jpg"}], "artist": "Jadakiss"}