{"songs": [{"title": "Funeral", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro]\n\"I know what happens to you, me and everyone else\nWhen they supposedly die\nIt's this passage around the great loop\"\nYeah, yeah, can you turn up my headphones?\nYeah, yeah, yeah\nThis music go with my funeral, yeah, yeah\nMusic go with my funeral, a-hem, yeah, I said\n\n[Verse 1]\nSaid I was raised inside this gritty city, riding through, you probably miss me\nMy bicycle fell, I hit the road, the mailman almost hit me\nAll this sins be more than shitty, I just pray the lord forgive me\nDoing drugs is just a war with boredom but they sure to get me\nMy side-bitch is sort of pretty but she got enormous titties\nKnow I'm worth a fortune, she just want a brand new Porsche or Bentley\nHad a few abortions, unfortunately, I forced them\nLord knows I turn a child to an orphan when I'm touring\nI'm more than what I think of myself, I really have to be\nSit at home and drink by myself, my thoughts harassing me\nActually, as a matter of fact, she ain't getting back to me\nA shame that my tragedy my masterpiece, yeah\nTrapped inside these dreams of mine\nJust trying to get some peace of mind, yeah\nI've been trapped inside these dreams of mine\nSo you'll never get a piece of mind\n\n[Chorus]\nThis the last (last) day (day)\nOf my life (of my life, of my life, of my life)\nParty like it's the last (last) day (day)\nOf your life (of your life, of your life, of your life)\nThis the motherfucking last (last) day (day)\nOf my life (of my life, of my life, of my life)\nParty like it's the last (last) day (day)\nOf your life (of your life, of your life, of your life)\n\n[Verse 2]\nYeah, yeah\nSee we swallowed in this web of lies, never tried to exercise\nYou used to be a fantasy but now I guess it's televised\nI heard the legends never died, oh this lonely hell of mine\nThere never was a better time to better myself\nForever I melt, and float away like waves in the ocean\nStaring inside of Heaven's eyes, the gates will never open\nI'm smoking on this field of hope, waiting 'til my deal gets closed\nI keep getting hotter but all I seem to feel is cold\n22 don't feel so old, but I think I'm 82\nYou mean to tell me God took seven days and all he made was you?\nI'm out here with the kangaroos, making danger, break the rules\nCelebrate my date of birth with acid, get the days confused\nHappiness I take from you, searching for the naked truth\nI'm not awake, I'm in a lake, I'll swim away with you\nBitch, check out the butterfly\nIf you the truth then what the fuck am I?\nYeah\n\n[Chorus]\nThis the last (last) day (day)\nOf my life (of my life, of my life, of my life)\nParty like it's the last (last) day (day)\nOf your life (of your life, of your life, of your life)\nThis the motherfucking last (last) day (day)\nOf my life (of my life, of my life, of my life)\nParty like it's the last (last) day (day)\nOf your life (of your life, of your life, of your life)\n\n[Outro]\nSo where are you going?\nWhere are you headed?\nWhere are you going?\nCan I come? Can I come?", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}