{"songs": [{"title": "Bring Our Boys", "album": "The Underground EP", "year": "1997-03-02", "lyrics": "[Intro: Bizarre]\nEmceeeeeeees, RUN!\nOr get hit with my verbal gun!\nThis mic weighs a ton!\nDozen battles for fun\nI'll disrespect you and your crew\nHere comes MC Eye-Kyu!\n\n[Verse 1: Eye-Kyu]\nYour fakeness is atrocious\nPost this deep in yo' hypnosis\nThen focus, roll this and smoke this\nLike L's of that bomb-ass herb that's guaranteed to rock bells\nA hip-hop ReFugee like Prazwell\nTravellin' cities pimpin'\nBabblin' biddies game trump tight to solidify\nComputerized to get rid of spies - know what I do to guys\nShootin' and spittin' lies?\nI'm banishin' existance\nJust vanish any instances, brandishin' sentences\nProvin' repentence is the only way to see me, don't miss these\nMe and my crew smoke so many trees that I piss leaves\nNever bammer bitch please, but keep smoke in my system\nRoll blunts- it's all tight\nOn a off night, I still smoke like exhaust pipes\nAnd bust a universal flow to blow your wig back\nLike niggas with toupees drivin' a convertible\nAnd furthermore I run the board\nYo' shit is played\nAnd the way you fell off, you couldn't bounce back with a bungee cord\n\n[Hook x4: Bizarre]\nBring your boys and, we can bring the noise and\nYou don't wanna fuck with Dirty Dozen!\n\n[Verse 2: Bizarre]\nMy crew is like amazed, put in fear like ex-slaves\nWho wanna step to this microphone and think that they BRAVE?\nDozen always startin' the fuckin' beef\nI don't give a fuck if you from Kansas, I'm still the fuckin' chief\nBack the fuck up I'm releasin' my dum-dums\nTell your whore stop pagin me, 9-1-1\nI'm a star that they call Bizarre\nSmokin' blunts with Mel Farr in my brand new car\nWhat nigga in their right mind wanna see me?\nIf I was in Arizona, I'd still request iced tea\nBizarre don't give a shit about you\nOn top of the mountain - ain't nuttin' your bitch-ass crew can do\nSick MC that they call Peter\nTreat your crew like an unexpected meter reader\nTalkin' more shit than Howard Cosell\nButt-fuckin' jezebels in nasty hotels\n\n[Hook x4]\n\n[Verse 3: Proof]\nHow you think yo' crew sound compared to this?\nIt's the team that yo' entire clique is scared to diss\nDemandin' attentions when the Glock sound\nY'all niggas to be murdered like Jeffrey Dahmer's on lock down\nI'm Brown like Bobby, pullin' hoes like Whitney\nTake your title, kill your moms- so you won't forget me\nLips sealed; nigga, I might blow important plots\nWhoever front is gettin' done like Michael Jordan pops\nYo I'm number one translator, mic famed Dirty D\nY'all niggas gettin' hung like this was 1933\nGot word of me- now flee, cause you ain't got a chance\nDeath is three easy steps, so now we gotta dance\nSo look away; don't play with the style master\nI love killing' beef, so I kill a whole cow pasture\nLyrically, I'm sick ill, everything but sober\nMy nickel-plate, pack the disc-tray\nJack and fool get fucked over - BRING IT!\n\n[Verse 4: Eminem]\nDirty Dozen is the clique so walk right over and lynch ya'\nRip the ass right out ya' pants like a Doberman Pinscher\nLike the cobra and ninja, my intention's to injure\nAnd prevent ya from enterin' from an inch of my center\nOr get your motherfuckin' pants split at the creases\nFuckin' you intellectually\nGivin' you mental sexually transmitted diseases\nMy duty is to keep a stranger barred\nI guard my sector like a Saint Bernard and this ain't your yard\nBringin' the noise like a trigger happy gun slinger\nDroppin' your whole clique with one finger 'til none linger\nBeware of my dogs attackin' like a pack of Great Danes\nChargin' like freight trains through the great plains\n\n[Hook x4]", "image": "https://images.genius.com/7a40a5dcf4af48c56e2c80bf3d485197.900x900x1.jpg"}], "artist": "D12"}