{"songs": [{"title": "Clear the Air (Remix)", "album": null, "year": null, "lyrics": "[Intro: Busta Rhymes]\nAiyyo Dready!!! What you do this for man?\n\n[DJ Talking in the background] (Akon):\nBOOM BOOM BOOM BING!!!!! Original!) Testing one, two, three\nHey hold on, di dance nah done now yuh know! (I wanna clear the air)\nYuh dun know yuh know, mi nah tell yuh now!!!\nMi nah tell yuh how di dance done now!!\n\n[Hook: Akon] (Major Mackerel)\nI wanna clear the air (EH NEH!!!!!!!)\nWith the medal that's known to divide the whole atmosphere\nAnd I love to share (EH NEH NEH NEH!!!!!!!!)\nThem bullets come a dime a dozen I kept two so I could have spare\nCause you never know, make no mistakes about it I let it gooooooo!! (EH NEH!!!)\nAnd don't get too close, make no mistakes about it I let it goooooooo!!!!!!!!!\nAnd clear the air\n\n[Verse 1: Majoe Mackerel]\nEH EH EH EH EH EH EH EH EH NEH!!! Champion!!!!\nEH NEH EH NEH EH NEH EH NEH!!! Mackerel a veteran!\nEH NEH!!!! WHEEL!!! Busta a big man!\nEH NEH! NIDDY! NOW! NOW! NOW!\nWell if I bun oonu a Bus a mek we buss it up (BO! BO!)\nAnd a life we a live we waan live it up\nAnd if a love yuh waan give yuh fi give it up\nAnd if a guy waan dead yuh know a fridge it up\nMajor Mackerel inna di place we a go pack it up\nAnd if a dancehall a key we a lock it up\nInna di place people deh yah dem a pack it up\nBusta deh yah mi seh Busta a rock it up\nMavado inna di place and him a mash it up\nAkon deh yah lawd him fabulous\nShabba Rankin bad and him dangerous\nMajor Mackerel..EH! NEH NEH!!!!\n\n[Hook: Akon] (Busta Rhymes)\nI wanna clear the air\nWith the metal that's known to divide the whole atmosphere (RAH RAH!!!)\nAnd I love to share, them bullets come a dime a dozen\nI kept two so I could have spare (YEAH! YEAH! YEAH!)\nCause you never know (A long time mi a wait fi dat one yah!)\nMake no mistakes about it I let it goooooooo!!!!!!!!!\n(History inna di makin) And don't get too close\nMake no mistakes about it I let it goooooooo!!!!!!!!!\nAnd clear the air (Busta Bus now!!!)\n\n[Verse 2: Busta Rhymes] (*Bounty Killer)\nTrust mi tell oonu every time we a shine, we design, now mi find\nWe a climb up to di mountain top\nMek sure yuh hear weh mi seh, oonu fi know we don't play everyday\nCock mi nine and watch a bwoy get dropped\nMi seh yuh must be a fool, oonu fi know when fi cool\nWhenever mi release tool one a dem start flop\nNuh matta how dem a talk, whenever di gun spark\nBetta know in di dark di infrared caan stop\nEverybody know that I gotta come and bring it back\nHit them inn the head with another classic while I kill the track\nPull up in a Lamborghini black (*BULLET!!!!) Selecta bring it back\nPeople packed up inside of the place watch how the streets react\nSee them ach when I pull out and cock it you don't wanna compete with that\nSee the fact is that I'll get it poppin like we in Iraq\nPlenty ratchets in my whip while I ride like a diplomat\nThen we mek di whole a dem run\nCau when we step inna di place yuh know seh dat di dance dun!\nOk! Let's go!\n\n[Hook: Akon] (Mavado)\nI wanna clear the air\nWith the medal that's known to divide the whole atmosphere\nAnd I love to share (Anywayyyyyyy!!!)\nThem bullets come a dime a dozen I kept two so I could have spare\n(New gun) Cause you never know, make no mistakes about it I let it goooooooo!!!\n(Ahhhhhh!!!!!! Murda dem!!!!!!!!)\nAnd don't get too close\nMake no mistakes about it I let it goooooooo!!!!!!!!! (Ahhhhhhhhhh!!!!)\nAnd clear the air\n\n[Verse 3: Mavado]\nDem seh dat mi a rise crime, when mi rise nine in di middle day or night time\nOh Father Divine, dem neva see nobody my kind, mi sick inna mi damn mind\nMi tek it to di next level, dem seh mi a di next devil\nMi buss mi gun well flexible\nBwoy body find, now dem fi diss Busta Rhymes, shot chop up every dutty mind\nLongtime! Every step it neva sorrow\nMi a start di war and we nuh come out betta tomorrow\nSome bwoy a hype wid dem gun dem borrow\nMy gun mi haffi push inna whell barrel\nAnd, mi know seh dat dem fake, and.....\nDem caan war american, african and jamaican\nShots strip dem like bacon, mi call Akon, Ahhhhhhhhhhh!!!!!!!!!!!\n\n[Hook: Akon] (Shabba Ranks)\nI wanna clear the air\nWith the metal that's known to divide the whole atmosphere\n(This a di Busta Rhymes gunshot nail him!!!)\nAnd I love to share\nThem bullets come a dime a dozen I kept two so I could have spare\n(Shabba! Bun it!) Cause you never know\nMake no mistakes about it I let it goooooooo!!!!!!!!!\n(So explosive! Fully loaded!)\nAnd don't get too close\nMake no mistakes about it I let it goooooooo!!!!!!!!! (bombs away!)\nAnd clear the air\n\n[Verse 4: Shabba Ranks]\nSeh dat mi a rev it up tear it up mek people cheer\nBusta come fi mash it up buss it up and clear di air\nAkon, Konvict dominate and people participate\nYes! In this a musical fair\nYes mi come rev it up tear it up mek people cheer\nBusta come fi mash it up buss it up and clear di air\nAkon, Konvict dominate and people participate\nYes! In this a musical fair\nI swear! We three be killin dem out there\nDust off we tool and we love di hardware\nRub off this a chat yah like guerilla warfare\nCome well prepared inna this musical affair\nIt's time inna this atmosphere\nAkon deh pon di drum, Busta Rhymes deh pon di snare\nNo competition can neva come near\nWe damage di fool dem beyond repair\n\n[Hook: Akon] (Shabba Ranks)\nI wanna clear the air\nWith the medal that's known to divide the whole atmosphere\n(Gunshot nyam him!!)\nAnd I love to share\nThem bullets come a dime a dozen I kept two so I could have spare\n(Mi a tell yuh, a wah do dem?!)\nCause you never know, make no mistakes about it I let it goooooooo!!!!!!!!!\n(Flipmode! Konvict! RAH!!!!!!)\nAnd don't get too close, make no mistakes about it I let it goooooooo!!!!!!!!! (Bomb!)\nAnd clear the air", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}