{"songs": [{"title": "Don’t Body Ya Self (Remix)", "album": "Ghost Unit", "year": "2007-01-01", "lyrics": "Don't body ya self\nDon't body ya self\nDon't body ya self nigga\n\n[Verse 1: Nas]\nYeah, yeah\nEverybody get low niggas\nDedicated to the 'Fuck Nas' coalition\nTouch my dough I'm lettin .40 cals blow nigga\nNot cows with four legs\nBut cals with more lead\nThat add up more dead\nIt's on nigga\nI'mma bury them\nNiggas don't want beef, they vegetarian\nScared of pussy, you climbed out a Cesarean\nI'll push ya grown ass back in your mother's womb\nYou need nine more months\nYour crews nine more punks\nYou rhyme on stuff and claim I ain't sign y'all up\nIf I sign y'all, I'm on dust\nYeah, we from the same hood but nigga what?!\nWhen y'all was trying to rap, y'all was making me proud\nMan now you fucked up, down on your luck, runnin' your mouth, man\nWhy don't be a real man, say you need a lil help\nAnd I might help your ass off the shelf\nBut noooo, you're being disrespectful\nThinking son so cool that he won't check you\nStand down, the king is home\nQueens is on, NASDAQ, Dow Jones\n\nDon't body ya self\nCrazy\nTake it slow man\nSlow down\nTake it slow motherfucker\nDon't body ya self\nLet's listen\nLet's just listen\nDon't body ya self\nListen\nSlow down though man\nSlow down\nY'all gotta take it slow\n\n[Verse 2: Nas]\nI am DeNiro after Am.Ex. commercials and \"The Fockers\"\nWith Martin Scorsese after \"Gangs Of New York\" could rock this\nBack together with the master plan\nThe rebirth of Langston Hughes, I'm that man\nI'm in the streets like old graffiti\nI'm hearing wankstas talking greasy\nWhether broke or rich my friend\nNasir bring that career to an end\nAnd I'm bored with you MCs, B\nY'all beneath me\nAnd my raps bring horror like a board of a Ouiji\nOf course I'm the king, get my shine on and I blind y'all\n'Cause they call me \"The Lord of the Rings\"\nPinky heavy man, big stones in the wedding band\nSmell of brimstone, back from Hell again\nNext verse gets worse from God's son to Devil's sin\n\nY'all need to take it slow\nDon't body ya self\nMotherfucker act like ya know (05')\nMotherfucker better take it slow\nDon't body ya self\n\n[Verse 3: Game]\nMe and Nas like Ether and anthrax makin' killin' statements\nShootouts with fags in front of the radio station\nYou ain't Superman, the S stand for snitch on your cape\nAnd since I'm signed to the Doc you tryin' to test my patience\nCommit lyrical homicide fly through the windshield\nYour soul can't escape because of the wind chill\nI weather the storm, raindrops trickle off your Timberlands\nDeath becomes the faggot ass nigga that made \"Many Men\"\nMr. Potato Head, I'll take that title\nDrop it off at your son's recital then read a quote from the Bible\nI'm suicidal, this ain't a rap war, this survival\nThe beat is a grenade, the flow a automatic rifle\nSo send your soldiers home, I wrap 'em like Iraqis\nSend ashes home in a package without dirt on my khakis\nThis nigga gonna beef with a rapper then go run to the captain\nTake it slow 'fore that bullshit you asked for happen\n\nY'all need to take it slow\nDon't body ya self\nMotherfucker act like ya know (05')\nMotherfucker better take it slow\nDon't body ya self\n\n[Verse 4: Nas]\nThey say Jada defeated him\nJoe too street for him\nWhat's next? I guess it's for Nas to Ether him\nY'all awaiting an MC burial\nThis is ethereal, FM stereo to XM radio\nWhat does it mean, ethereal? Hmm.. either heavenly or spiritual\nExtreme, delicately light in a way that seems too perfect for this world\nMan that is righteous, faithful and keeps law\nWill surely live declares the sovereign Lord\nAnd you are none of the above\nSee, you a sucka for death if I'm a sucka for love\nAnd ya wanna know why I don't gotta answer niggas\n'Cause I truly understand these niggas\nScared of me so they talk about family members\nLike I can't point out your grandma to niggas\nDamn, you was my man like crew, dog\nDon't make me change your body frame to blue fog\nThe Q is the borough of true dons\nAny disrespect, nigga, we choose arms\nWill it be Gilmore or Crowes?\nNigga act like ya know\nYeah\n\nYa betta take it slow\nMotherfuckers act like ya know\nMess around and body ya self\nDon't body ya self", "image": "https://images.genius.com/8024cdd6806066555424f236d22aa443.641x640x1.jpg"}], "artist": "The Game"}