{"songs": [{"title": "The Pound (Intro)", "album": "Pound Syndrome", "year": "2015-07-23", "lyrics": "[Intro]\nRah! I'ma hit a mothafucka with the pound, pound, pound, pound\nIt's the Pound Syndrome\nGood God the pound, the pound, the pound, the pound\nUn-unbelievable Pound Syndrome\nCan you, can you, ca-can you believe it?\nThe Pound, the-the-the-the-the\nThe pound, the pound, the pound, the pound, the pound\n\n[Verse]\nIf you're looking for trouble then you found it, the new album\nOf two-thousand-and-fifteen, I'm too violent\nThis shit seems like I'm cooped out with lucid dreams\nI'm a new route for these emcee's\nThis is a drought that's coming\nI'm about to sprout to start a new style's full of envy\nI need to cool down what is in me\nEverything I had bottled up pukes out when the pen bleeds\nYou drown from a 16, who's doubtin' the sick steeze?\nI could spit a wild verse without taking a breath\nThen crowd surf, who's helping this kid breathe?\nThe worlds against me so I gotta come harder than the average\nThink smarter than the masses\nEverybody's on the move, ain't no time to get caught up in the traffic\nWhen shit goes down I got the heart of an assassin\nThis here's harder than my last shit\nGotta do it now, no luck in tomorrow if it crashes\nIf I do die before I awake, I don't think too many will feel sorrow for my ashes\nWith this song I've frozen time, don't skip this, don't rewind\nThe throne is mine, close your eyes as I provoke the mind\nThis was bound to happen before I wrote the lines\nAnd it's so divine the way my influence multiplied\nIt's like I created a cult inside this rap industry\nPlease don't look so surprised\nI'm at the top, I ain't throwing down a rope to climb, come on\n\n[Outro]\nPound, pound, pound, pound\nIt's the Pound Syndrome\nGood God the pound, the pound, the pound, the pound\nUn-unbelievable Pound Syndrome\nCan you, can you, ca-can you believe it?\nThe Pound, the-the-the-the-the\nThe pound, the pound, the pound, the pound, the pound", "image": "https://images.genius.com/e4079e5e3fa49647b0a22cad37ceae57.1000x1000x1.jpg"}], "artist": "Hopsin"}