{"songs": [{"title": "Rise Like Smoke", "album": "Rise Up", "year": null, "lyrics": "[8 seconds instrumental]\n\n[Chorus: B-Real]\nI'm a go hardcore what I believe in\nAnd NO! - I'm not gonna slow down!\nThey try tell me what it is what I can or can't be\nI gotta family that I gotta hold down!\n\n[Bridge: B-Real]\nSo I'm gonna rise like - smoke!\nSo I'm gonna rise like - smoke!\nSo I'm gonna rise like - smoke!\n'Till the day they put me underground!\n\n[B-Real:]\nI gotta break these chains. - Take these reins!\nIgnore these pains; no pain, no gain!\nI gotta hard move like like a muscle car\nGet ahead of the pack. - Hit like a double-R!\nI never loose sight, only to too tight!\nOnly to get away - too many will lose right\nKill right now you got your head in the clouds\nScreaming your name! - Nothing can bring you down!\nEverybody got a dream; hurry up and go get it!\n'Till it gone; [? ] and gone!\nYou singing the same song. - You ain't in tune!\nTellin' yourself - \"I'm gonna get mine, soon!\nIt's a race to the limelight - and the pack is running\nCan you keep up and tell us that you want it!\nWhen you get it tell us what you're gonna do with it (do with it!)\n'Cause I got mine, I'm a show you how to move with it!\n\n[Chorus]\n\n[Bridge]\n[Sen-Dog:]\nStill lookin' for the gusto, desirin' to hustle!\nDeep on the street with Soul Assassin muscle!\nStill motivated! (MOTIVATED!) - Still upgraded! (STILL UPGRADED!)\nStill updated and always on fated! (AND ALWAYS ON FATED!)\nThought we come again? - Watch we roll up\nWith the real channel 13 stone us!\nNever rest! - Gotta keep moving!\nAnything less put my shoe in it!\nWhat you want holmes? - Yeah, we got some!\nBest believe it's the motherfuckin' box, son!\nI'm still hungry but that's the sex!\nAin't done yet like broadway brick!\nAin't no question, that's why I'm a threat! (I'm A THREAT!)\nI'm getto raised right out the projects! (PROJECTS!)\nNow you know that I'll be done when I wanna go (WANNA GO!)\nAnd for real until that Death thing come and go! (COME AND GO!)\n\n[Chorus]\n\n[Bridge]\n[17 seconds instrumental]\n\n[B-Real:]\nWhen the lights go on and the mic turns on!\nFind someone it's so live, it's wrong!\nYou wanted more then your typical common hit\nFeels good when the fans bounces kinky shit!\nRight after the show, after the flow\nOn the grounds in the back then get out the door!\nLook the shorty is! - She wanna ride with the band!\nShe screamin': \"Guys I'm your biggest fan! \"\nRunnin' through. - Whatever she can\nAnd she's - lookin' at you like a bride in day\nShe's - sweatin' hard, she won't resist\nWhen you ask: \"Why? \" She plays just like this:\n\n[Chorus: Female]\nI'm a go hardcore what I believe in\nAnd NO! - I'm not gonna slow down!\nThey try tell me what it is what I can or can't be\nI gotta family that I gotta hold down!\n\n[Bridge: Female]\nSo I'm gonna rise like - smoke!\nSo I'm gonna rise like - smoke!\nSo I'm gonna rise like - smoke!", "image": "https://images.genius.com/f469b84836527dfec52206e182dfacce.220x220x1.jpg"}], "artist": "Cypress Hill"}