{"songs": [{"title": "Matter of Time", "album": null, "year": "2012-01-01", "lyrics": "[Intro: Ron Jeremy]\nYo\nWhy the fuck did you let that crazy mother fucker Fury\nOn this CD\nYou know all he's gonna do is break shit\nAnd fuck the other rappers moms right?\nOh I see, I see\nIt's because Hopsin and Lental are on this song to\nWell i'll be damned\nIt was only a matter of time\nBefore hollywood Hopsin\nHopped on a U.G.H\nYo Marcus\nWhen are you gonna host one\nHit up your uncle Ron Jeremy my man\n\n[Verse 1: Hopsin]\nKid stars they're so dismantled\nWhat happens when the show gets canceled\nLet's think up and example hmmm\nBoth the Olsen twins turned into damn fools\nTheir childhood got torn out\nI heard the girl from Family Matters does porn now\nShe ain't nothing but a whore wow\nBut as crazy as that shit is it gets more wild\nHow?\nCause i've been on disney\nRaven before she was a big bone bitch freak\nI never knew the shit was so risky\nYou can even check it out it's on this week\nHey surprise!\nI've been paid the price\nNow I'm an MC that hates his life\nI represent raising blades and knives\nSo you can't deny that disneys they reason I have rage inside\nCome on\n\n[Hook]\nIt's only a matter\nOf time x2\n\n[Verse 2: Fury]\nI, Never been in the Mickey Mouse Club\nI was brought up ?\nPushin' me to be at the stage my mom was\nI'm just tryna get behind the TV of my childhood\nConsisted of me being a ? by third grade\nKids would always pick on me it hurt in the worst way\n?????\nNever hit the big time\nNow I spit rhymes wishing I could get the shit right\nNever got a script assigned to me\nThese fucking bitches lie to me\nThey're just tryna get me in the bed so they can grind on me\nI tried to leave but they held me\nSwitched sides on me it ain't healthy\nI'm tryna be what they tell me\nOnly a matter of time fore they sell me\n\n[Hook]\n\n[Verse 3: Lental]\nI never was a kid star needed more time and\n46 down but I'm still going in my prime\nI played a few shows had a role in a movie\nI wrote a whole book but still no groupies\nNever had a box smash\nWasn't in a boy band\nDid a little TV maybe get a couple fans\nPick up my guitar and start a mosh pit\nStill to this day I ain't never had a pop hit\nPlayed in front of thousands felt like millions\nWait till I'm on scotch ?\nWait till I get money rolling in the dough\nNever reach show ?\nWait till I blow like a ticking time bomb\nWhen you come around to see this that ? I'm on\nI spread my wings like a black swan\nYou'll miss me when I'm gone\n\n[Hook]", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}