{"songs": [{"title": "It’s Your Life", "album": "Short Dog’s in the House", "year": "1990-09-11", "lyrics": "[Hook, Too $hort]\nIt's your life, don't be stupid though...\n(Your funk is the best. Take-take my body and give it the mind)\n'Cause when you waste it...\nIt's your life, don't-don't be stupid though...\n(Your funk is the best. Take-take my body and give it the mind)\n'Cause when you waste it..\n\n[Verse 1:]\nNowwwwwwwwwwww I come from, the Oakland town\nTask force roll and rock, cold cracked down\nYoung brothers my age makin dollars so long\nDrive a brand new Benz with a cellular phone\nSee his diamonds and gold, call him Big Bank Bob\nGot a ring for each finger and he can't get a job\nThis is not a song I made about crack\nIt's all about losin' what you can't get back\nCause the name of the game is to control yo' life\nAnd all the things you do you must do them right\nIt's not my life, it's on you baby\nWhat's really goin on is that cash money\nHow you make it, it doesn't matter to me\nWork at McDonald's or just slang them ki's\nOr you can be like me and go straight legit\nDrive a brand new Benz and they can't say shit\n\n[Hook:]\n\n[Verse 2:]\nPartners in your face, ain't even your friend\nProbably have to blast him if you see him again\nAnd if you don't blast him you'll get shot in the head\nSeven days later you'll be buried and dead\nI can't be like that, the only thing you fear\nHomeboy you can't see it but you know it's there\nIt's called tomorrow, whatcha gonna do with that\nCut school, sell a few dopefiends crack?\nIt's not a one-way street, it's more like a dead-end\nSo if you take it, you better turn back my friend\nI know a lot of young brothers don't think things through\nThey really don't know what they wanna do\nWhen you lag, you lose, you start payin your dues\nYou can't kick back and let your bankroll stack\nYou'll be stuck on stupid, for smokin a friend\nTen years from now you'll still be in the pen\n\n[Hook:]\n\n[Verse 3:]\nI got my eighteens pumpin, ridin the five\nPeople lookin at me like I stole the ride\nAm I a gangster, player, makin them G's\nCocaine dealer with the Z's and V's\nCan't tell em nothin, so I say, \"Whassup?\"\nThey get mad, I don't give a fuck\nI keep ridin, sidin, whippin and dippin\nLook at all my homeboys trippin\nThey'll knock you out, one punch like the champ\nGoin to jail is like summer camp\nWe shake hands one day, kill each other the next\nAnd if you don't like it it's just like that\nCause I come from, the city of dope\nIt couldn't be saved by John the Pope\nBut since I have the chance, I'll say in the rhyme:\nWe have to stop the killin sometime (soon)\n\n[Hook: 2x]", "image": "https://images.genius.com/354fed0b5f5b1d6e18186fae903238d6.930x927x1.jpg"}], "artist": "Too $hort"}