{"songs": [{"title": "Letter To Lil Wayne", "album": "Beam Me Up Scotty", "year": null, "lyrics": "[Verse 1]\nDear Wayne, if this shit ever gets to you\nListen to me, there’s some things I should have said to you\nFirst of all, every rapper need to bow to you\nAs a fan man, I really am proud of you\nSecond of all, I gotta say thanks\nYou really did alot for my out of state banks\nWith that being said, let's get down to the real\nI still don’t understand what went down with the deal\nAnd I been waiting on you just to give me the word\nYou know, a couple nouns and a couple of verbs\nI do it for them girls that be flippin' the bird\nTryna get up out the hood and get into the ‘burbs\nBut everything you said, was it just pretend?\nMaybe it was all a game like ESPN\nI don’t really care if they hate on you\nI be turning down meetings just to wait on you\nBut what I don’t understand is why you told them you signed me\nIf you wasn’t ready to get totally behind me\nI mean honestly, how could you deny me?\nYou know you’re Harry and I’ll always be Hermione\n\n[Chorus]\nI've been lonely, I've been waiting for you\nI'm pretending, and that's all I can do\nThe love I’m sending ain't making it through to your heart\n\n[Verse 2]\nDear Wayne, I'm writing another letter 'cause\nYou never did respond, it's been a couple months\nSee when I speak I say what people wanna hear\nSo this will be the last thing that they gonna hear\nBut this will be the realest shit that I ever wrote\nYou see me falling, why you never sent down a rope?\nI woulda climbed up, but now my times up\nI swear to God man, I thought you had it lined up\nBut if the Lord had a head of thorns\nWho am I but a broad with some metaphors?\nKnockin' on a set of doors\nKnockin' on heaven's doors\nLet's play a game, just for pretend\nCould we play a game?\nLet's act like you coming to me\nLike you laced up your shoes, started running to me\nAnd you was running out of breath but you kept going\n‘Cause you finally realized what you slept on\nIf you take your own life are you a sinner?\nI made you dinner\nBut you better be a hell of a sprinter\nIf you're reading this letter, I done pulled the trigger\nI done pulled the trigger\n(If you're reading this letter, I done pulled the trigger)\n\n[Chorus]\nI've been lonely, I've been waiting for you\nI'm pretending, and that's all I can do\nThe love I'm sending ain't making it through to your heart\n\n[Outro]\nI'm wait- I'm waiting\nI'm waiting\nSaid I'm wait- I'm waiting\nI'm waiting\nI'm wait- I'm waiting\nI'm waiting\nI'm wait- I'm waiting\nI'm wait-eh-eh-eh-eh-ay", "image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg"}], "artist": "Nicki Minaj"}