{"songs": [{"title": "Like Me", "album": "Based on a T.R.U. Story", "year": "2012-08-14", "lyrics": "[Chorus: The Weeknd & 2 Chainz]\n'Cause girl I'm just a bird\nDon't make me make you fall in love\nDon't make me make you fall in love with a nigga like me\nLike me\n'Cause girl, I'm just a bird\nDon't make me make you fall in love\nDon't make me make you fall in love with a nigga like me\nLike me\n'Cause girl I'm just a bird\nGirl, I'm just another bird\nDon't make me make you fall in love with a nigga like me\nLike me (yah, uh, 2 Chainz!)\n\n[Verse 1: 2 Chainz & The Weeknd]\nThey ain’t never seen a nigga like me (uh)\nShe ain't never seen a nigga like me (uh)\nChance of that is unlikely, 2 Chainz on my white T\nI wipe her down and I pipe her down\nI give my girl money to go out of town\nYou give your girl money to go to Niketown\nAnd I one-night her, you must like her\nKill niggas with one-liners, all I need is one lighter\nCounting so much money (so much money) I got arthritis\nSo cold I frostbite 'em, no Pig Latin but I hog-tied 'em\nIf she gets this dizick then I (make her fall in love)\nWith a nigga like me I’m killing this beat\nSkeet, skeet, skeet, skeet, skeet on my sheets\nOn top or from the back, I thundercat like (ho!)\nMy girl got a big purse with a purse in it\nAnd her pussy so clean, I can go to church in it!\nOh Lord, O-M-G, I am the O-N-E\nHow ya like me now? It’s cool but she want mo' D\nMoet by the fireplace, this is how desire taste\nAnd I’m bout to buy a case (le'go)\n\n[Chorus: The Weeknd & 2 Chainz]\n'Cause girl, I'm just a bird\nDon't make me make you fall in love (yeah)\nDon't make me make you fall in love with a nigga like me (uh)\nLike me (I mean that ain't just doing it like that, baby)\n'Cause girl, I'm just a bird\nI'm just another bird (T.R.U.)\nDon't make me make you fall in love with a nigga like me (uh)\nLike me (yeeeeeah!)\n\n[Verse 2: 2 Chainz & The Weeknd]\nBon apetite, they obsolete\nYou know talk is cheap so don't say a word\nCheep, cheep, chicken talk, I’m flipping birds, fuck y'all\nMustard, ketchup, I take pills, expert\nKitchen all pyrexed up, if my dick talked, it would say \"Next up!\"\nMe and yo girl networked, now she wanna know my net worth\nWood grain, chestnut, titty fuck, chest nut!\nMove shit, UPS truck, pull a lil' out n out the rest up\nCompetition need to rest up (make her fall in love)\nI aim at ya head, put the vest up, matter fact put the vest up!\nThis shit I’m shootin is penetrating, you don’t want this situation\nTall nigga with a short temper\nI do this for niggas who never had shit\nAnd now I got me a bad bitch\nThat got a bad bitch that got a bad bitch\n\"T.R.U. Story\", high like, two stories\n2 Chainz and Tity Boi, nigga, that’s two stories, who want it?\nHair Weave Killer, they like \"you want it\"\nI go swimming in that pussy, 'bout to throw a pool party\n\n[Chorus: The Weeknd]\n'Cause girl, I'm just a bird\nDon't make me make you fall in love\nDon't make me make you fall in love with a nigga like me\nLike me\n'Cause girl, I'm just a bird\nGirl, I'm just another bird\nDon't make me make you fall in love with a nigga like me\nLike me", "image": "https://images.genius.com/0855f72cd21e5220ad89c1cc26c16d73.957x957x1.jpg"}], "artist": "2 Chainz"}