{"songs": [{"title": "Why", "album": null, "year": "2018-12-12", "lyrics": "[Intro]\nAye my little homie in the booth you know what I'm saying, she still popping tags in this bitch (hello)\nI mean it is us\nIn swag we trust, you know (hello)\nWheezy Beatz\nTurn me up, turn me up, turn me up\nYeah turn me up, nigga turn me up\nTurn me up, turn it up, yeah\nAye you know the shit they call, uh, blue hundreds?\nThat shit in around this way for real, uh\nAye!\n\n[Hook]\nI, I never, never, never, never lie to my niggas about bitches\nI never, never, never, never play with my niggas about hoes, nah\nI never, never, never, never do my niggas wrong\nNo, no bitch yeah I don't\nWhy these fuck niggas lie to they bros?\nWhy? (oh why?)\nWhy the fuck these niggas lying to each other?\nThey supposed to be brothers, why?\nWhy did my brother get gunned down?\nA couple streets from my mama's spot?\nWhy the fuck did someone leave him on the ground leave blood in the parking lot?\nWhy the fuck the ambulance took a hundred years to pick him up, nigga, why?\nAnd why these bitches falling for these niggas even though they just some suckers then they die\n\n[Bridge]\nHey, why these hoes?\nWhy these hoes?\nWhy these hoes, why these hoes, why? why?\nYeah, baby you ain't gotta kick it like that\nYou ain't gotta lie about this, bout that\nBaby you ain't gotta do it like that, goddamn\nI was just starting to believe what you say\nI was just starting to believe you ain't playing\nI was just believing you didn't know my mans, man\nBut you knew em' all\nYou probably sucking hella balls\nBecause I know you fucking hella jawns\nAnd I know they onto hella broads, oh\n\n[Verse]\nThugger!\nWho that bomboclat blood boy wanna touch me baby?\nImma shoot him in the head, no no dreads little baby\nWho you trying to rob little boy?\nDon't play around little boy\nI just wanted to maintain, yeah I just wanna feel the pain yeah\nI just wanted white cocaine, I just wanna lose the pain yeah\nI just wanna protect my stain, yeah i don't wanna lose non' yeah\nI just want what I already got, I don't wanna lose again, yeah\nI'm a rude boy from my birth, to my death, aye\nAnd I ain't standing on no money nigga don't step, aye\nImma speak this shit into existence not for my health, aye\nImma speak this shit into existence not for my health (aye, yeah)\nFrom the heart not for my health (aye, yeah)\nSwear to God not for my health (aye, yeah)\nDo it for you, not for myself (aye)", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}