{"songs": [{"title": "Freestyle Freestyle", "album": "Red Gone Wild: Thee Album", "year": "2007-03-27", "lyrics": "Redman in the house, ya don't stop\nGilla House in the house, ya don't stop\nDef Squad in the house, ya don't stop\nWu Tang in the house, ya don't stop\nHip-Hop in the house, ya don't stop\n\nRedman gotta light that green\nPeople always say, \"What the hell does that mean?\"\n\nWussup homeboy I'm a muhfuckin' rider\nCustom made Airs and my shoes never tied up\nHardcore shit, do it eazier than wider\nWhile you sittin' home gettin' baby mama drama\nJersey, Uptown - go pick my weed up\nBroke? I ain't turning your C to a D cup\nBitch I'm a G! I never give my keys up\nNot even half if you didn't sign a pre-nupt\nWatch how we thump\nI'm 'bout my bid-ness\nYou about to go downtown like the shiznit\nWitness! Yeah boy\nI get ya dumb like white people lookin' for weird noise\nHood down, got B. Smalls on my white tee\nAnd my chain look like an italian icee\nRedman nigga\nGrind like brakes\nCause I'm after that cake\nLike Steadman nigga!\n\n[Hook]\nFreestyle, Freestyle, Freestyle\nFreestyle, Freestyle, Freestyle\nAnd everywhere I go I kick a freestyle\nAnd every time I move these women freestyle\nFreestyle, Freestyle, Freestyle\nFreestyle, Freestyle, Freestyle\nRedman gotta light that green\nPeople always say, \"What the hell does that mean?\"\n\nOkay yo, I got Bricks in the building\nYoung kids out here, flip ya like Wilson\nPilgrim! There it is\nThe block is Tina Marie, yeah I'm on my square biz\nTurn up the kid like volume ten\nAnd you could brown-nose me 'til the album in\nYou was hot when your style was in\nNow ya lookin' at Gilla, \"I wish I was down with them\"\nNo time to turn back, I keep my eyes focused\nSlow like I'm on the I-95 smoking\nLike Ocean's Twelve\nWhen I'm postin' smell\nMy zip lock when the red line open\nFat girls like, \"Yo that's my hero.\"\nEnough of them to pull a Five-Five-Zero\nIncog-negro, after the cream\nI'm in your hood like (WatchTime?) magazine\nI mean, for bullshit my nose keen\nAnd only takes one hit to get in those jeans\nIt's not your ass, girl it's your brain\nNow when I hit it I keep the chicken lo mein\nBack on the train like \"Who the hell are you?\"\nI'm Doc, I bring heat like number 32\nBrick city niggas, yeah yeah a rider\nLa-La-La don't steal my damn lighter\nSee I'm on point, never catch me slippin'\nStorch on the track, watch how Reggie rip it\nSniff it, you'll know it's on again\nWalked in this muhfucka like I own da bitch\nI'm not in Cancun\nI'm out in Grant tomb\nOn one wheel throwing it up like, \"Man move!\"\nBack on my grizzly, yeah take that\nYou want the crack\nI prepared it ASAP!\n\n[Hook]\n\nWussup homegirl we a muhfuckin riders\nMet her outside of the Copacabana\nFar from a sucka, pull out the 'lama\nAnd tell on myself like, \"Yo well your honor...\"\nSee, I blast on sight when I move\nThat battery pack on my back stay full\nI ain't no joke, I keep y'all steppin'\nDoc got next nigga drop y'all weapon\nScreen on my mic got hash tar resins\nEngineer fucked up, laughing all reckless\nI'm like, \"Shutup! Gilla house got this.\"\nArms grew longer for my short pockets\nStop it? I wish I can\nI'm trying to be building green like MGM Grand\nGet it? Redman, who the fuck are you?\nGot weed? Let me bust a U nigga!\n\n[Hook]\n\nGilla, Gilla, Gilla, Gilla", "image": "https://images.genius.com/65aa1591ac947b9397141766462ac089.465x465x1.jpg"}], "artist": "Redman"}