{"songs": [{"title": "When the Moon...", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "{*applause and shouting*}\n\n[KRS-One]\nYeah, YEAHHH, yeah... word\nFor my next number I'd like to bring up a young lady named Courtney Terry\nAnd uh, my name is KRS-One\nIt's gonna go like this\n\n[Chorus: Courtney Terry]\nWhen the moon is filled with those that died\nAnd you prefer the style of KRS-One\nMC's around the planet\nHas loved the styles you brung - hit 'em dunn\n\n[KRS speaking over Chorus]\nFeel this, feel it\nC'mon! Now get your hands up\nUh, uh, uh, c'mon, c'mon\nYeah, c'mon, yeah, yeah\n\n[KRS-One]\nOpen up the door let me come in the place\nBefore you recognize the raw yo it's right in your face\nJust a little taste, yo I'm kind of nuts like Planters\nBehave and your save your money cause this album is bananas\nI'm flashin just a little style, for a LITTLE while\nBeen flowin like the Nile from when you was just a child\nNow it's '98, and I will NOT hesitate\nYou be floatin in the lake, you not no heavyweight\nYou're lightweight, I devestate, on a equal basis\nNo I'm not a racist but no race could really face this\nI hate this - no I don't; you face Kris - no you won't\nYou know you broke, cause what you wrote, ain't really dope\nLike a billygoat, I'll ram your set like BLAOW~!\nWho CARES how you like me now, you underground\nBoogie Down, let me make one thing clear\nBX baby, this is our year\nTry here and die here it's too fly here\nAs I drew my spear near, think what to do my dear\nI'm new and clear, my clarity's amazin\nStill blazin, play the low on occasion\n\n[Chorus]\n\n[KRS speaking over Chorus]\nYou know the deal!!\nYeah, c'mon!\nUhh... c'mon, c'mon!\nUh-huh, yeah, yeah, yo, yo\n\n[KRS-One]\nI'm small and not bigger, drink water not liquor\nSo I smart outquick ya lyric makin move like a ninja\nI'm all up in ya like blood\nMy whole style is devestatin you're renovatin like HUD, what?\nYou'd expect when I'm on the set don't forget\nI'm givin and catchin wreck, you still ain't ready yet\nBetter yet when I connect ALL Y'ALL HIT THE DECK\nHeck, you might as well sign over that publishin check\nYou ain't worthy, my style is ugly and dirty\nIf you ain't close to 30 you really haven't heard me\nBut don't worry, hurry into clubs I get wit 'em\nGot styles for the 80's 90's and the new millenium\nOnly sucker MC's be like \"KRIS DOESN'T SHIT WIT 'EM\"\nCause they can't get with him, only the best sit with him\nCops don't be friskin him, gangs be enlistin him\nNations be missin him, you really think you dissin him?!\n\n[Chorus]\n\n[KRS speaking over Chorus]\nCourtney tell 'em, c'mon!\nShowbiz represent\nUh-huh, uh-huh\nYo, yo, yeah, c'mon, c'mon\n\n[KRS-One]\nStraight to your mental it's the style of the Temple\nWorldwide representin the microphone and the pencil\nLike BROOKLYN BROOKLYN be always funky fresh\nDope hooks and dope rhymes, that's always KRS\nTheir words can't hit me, they dogs can't sic me\nTheir knives can't stick me, it's GOD~! Think quickly\nFor those that have picked me and picked me cause I'm witty\nI thank you; others, I simply outrank you\nYou make me laugh B - battle? Don't gas me\nYou should ask me to make your style more crafty\nRockin for decades a hip-hop and reggae medley\nAlways right when I write like Betty\nBoop, together with a ready loop, and many troops\nKickin better letters with extras like veggie soup\nSmashin any group or solo\nYou better go yo, my style is def, your style is so-so\n\n[Chorus]\n\n[KRS speaking over Chorus]\nUh-huh, uh-huh, c'mon!\nUHHH, KRS-ONE!\nYeah, yeah, and\nUh-huh, yo, yeah, yo, now get your hands up~!\n\nShowbiz - now get your hands up!\nKRS - now get your hands up!\nCourtney Terry - now get your hands up!\nYo yo - now get your...", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}