{"songs": [{"title": "Some L.A. Niggaz", "album": "2001", "year": "1999-11-16", "lyrics": "[Intro: MC Ren]\nYeah nigga, MC Ren up in this motherfucker\n(West West y'all)\nYeah, L.A. niggas\nL.A. niggas rule the world nigga\nY'all niggas gotta recognize, yaknahmsayin?\nNiggas don't wanna peep game, yaknahmsayin?\nBut this shit come all the way back around here\nMy nigga Dre, droppin' heat box on y'all bitch-ass\nYaknahmsayin? You gotta recognize\nL.A. niggas, connected all over the motherfucking world, nigga\nRecognize this; peep game\n\n[Verse 1: Time Bomb]\nNow in my younger days I used to sport a rag\nBackpack full of cans plus a four-four mag\nG'd up from the feet up\nBlue'd up from the shoe up's how I grew up\nLoc'n, smokin' and drinkin' til we threw up (until we threw up)\nAt Leimert Park, taggin', hittin' fools up\nDitching my class, just to fuck yo' school up\nYou don't wanna blast, nigga tuck yo' tool up\nBut don't sleep, y'all niggas quick to shoot you\nNow there's another motherfucker with no future\nBut Time Bomb much smoother when I maneuver, dope like Cuba\nGot 'em jumpin Disciples to the Hoover\n\n[Verse 2: King T]\nI'm coming \"Straight Outta Compton\" with a loose cannon\nSmoke big green, call it Bruce Banner\nWatch your manners, at last another blast from the top notch\nFrom way back with the pop rocks, I pop lock witcha\nPicture this, Dr. Dre twisting wit Tha Liks\nAnd Hittman bought a fix\nDon't trip, it's a Time Bomb in this bitch\nHere it tick tick tick tick boom\nWait a minute it's on, I tell it like a true mackadelic\nWeed and cocaine sold separate, check it\nFrom sundown to sunup, clown and run up\nThe Aftermath'll be two in your gut, nigga what?\n\n[Hook: Knoc-Turn'al & Kokane]\nWe roll deep, smoke on weed drink and pack heat\nRequirements for survival each day in L.A.!\nIt don't stop, we still mash in hot pursuit from the cops\nAnalyze why we act this way in L.A.!\n\n[Verse 3: Hittman]\nGimme that mic fool, it's a West coast jack move\nThey call me Hitt 'cause I spit like gats do\nCock me back\nBust caps for my Macz Crew, at Fairfax\nWho used to wear Air Max shoes, that's true\nBut I grew up where niggas jack you, harass you\nBlast you, for that set you claim (where you from?)\nMash on you for your Turkish chain, C.K. B.K\nBlue'd up or flame, I ran wit a gang\nI helped niggas get jacked for they Dana Dane's\nMy pants hang below my waistline\nI look humble wanna rumble? (yeah yeah)\nI bang though, like Vince Carter from the baseline\nDon't waste my time\nFuck a scrap in killa Cali, AK's and 9's\nOne-time's, sun-shines, and fine-ass bitches\nHawaiian Thai, drive-bys, six-fo's on switches\n\n[Verse 4: Xzibit]\nI was raised in the hood called WHAT-THE-DIF'\nWhere the brothers in the hood, refused to go Hollywood\nSlugs for the fuck of it\nAnybody hatin' on us can suck a dick\nIf I catch you touching mine you catch a flat-line, dead on the floor\nBetter than yours, driving away gettin' head from a whore\nIt's AvireX-to-the-Z\nFuckin' with me might get you banned from TV\nCassette and CD it's all mine the whole nine the right time\nMultiply, we don't die, the streets don't lie\nWhat, so neither do I, I'm bad for your health\nLike puttin' a pistol up to your face and blastin' yourself\n\n[Verse 5: Defari]\nFive in the mornin', burglars at my do'\nGlock forty-five in my dresser drawer\nLet 'em come in BOW, he see the thunder roll\nRoll with niggas, who buy fifths by the fo'\nAnd brews by the case\nSlap you in the face with the bass, Dr. Dre laced\nLikwit Kings with Sedans and gold rings\nHaters scope the style, but can't find no openings\n\n[Hook: Knoc-Turn'al, Kokane]\nWe roll deep, smoke on weed drink and pack heat\nRequirements for survival each day -- in L.A.!\nIt don't stop, we still mash in hot pursuit from the cops\nAnalyze why we act this way -- in L.A.!\n\n[Outro]\nIn L.A\nThat's how we ride\nThat's how we ride\nThat's how we ride\nThat's how we ride", "image": "https://images.genius.com/f9713af0f8164e90022b622002fda842.600x596x1.jpg"}], "artist": "Dr. Dre"}