{"songs": [{"title": "Where U Been", "album": "B.O.A.T.S. II #METIME", "year": "2013-09-09", "lyrics": "[Verse 1: 2 Chainz]\nI keep my hoes in check, you buy Nike for yours\nSay they want that loud, I'mma bring that noise\nCheck my watch on a flight, yeah, I call that airtime\nMurk 'em in the middle of the street, that gon' be his deadline\nYeah, you gon' respect mine, got a body on my Tec-9\nSay you nobody 'till somebody gon' body you, flatline\nPocket full of dead guys and you know I'm anti\nAnti-social, anti-lame, but ain't I cool nigga, ain't I?\nYou looking at a star that's spaced out\nTrying to take my style then take off\nI go to work with no days off, everything all paid off\nShawty pussy hair shaved off and she did it just for me, nigga\nWould skip you like a spacebar, but I much rather delete niggas\n\n[Hook: 2 Chainz]\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nBought a new crib just to fuck you in\nBought a new crib just to fuck you in\nBought a new crib just to fuck you in\nI been getting to the money, where the fuck you been?\n\n[Verse 2: 2 Chainz]\nGucci hat (Gucci hat), Gucci belt\nIf you wrote a autobiography, you'd have to sue yourself\nYo' lying ass, codeine in my wine glass\nI know you had a wild past, I ain't fucked you in a while with yo' wild ass\nI get high and I fly past, I don't know nothing 'bout iChat\nI'm working this iPhone, they need an app called iTrap\nI trap, shining like a night lamp\nI just hit my girlfriend and asked her where her wife at\nWhite cup, white hat, laying on a white couch\nGot that presidential in a residential white house\nNigga saying \"who?\" (who) like a white owl\nYou can see me shinin' (shinin') with the light out, come on\n\n[Hook]\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nBought a new crib just to fuck you in\nBought a new crib just to fuck you in\nBought a new crib just to fuck you in\nI been getting to the money, where the fuck you been?\n\n\nVerse 3: [Cap-1]\nTurn five to a ten to a twenty to fifty\nTo hundred, my niggas get money, I want it\nRide through the city, my niggas got choppers\nMy bitch, she's so pretty, that's my Pocahontas\nEverything on me, I shine like a trophy\nRun up a check while they watch out for police\nVersace my pinky, a brick on my Rollie\nThat Cali Ferrari, I'm feeling like Kobe\nT-R-U, that's to the death of me, nigga\nKillers on the right and left of me, nigga\nMy destiny, nigga, to get all this money\nI can't, I can't share that whole recipe with ya\nMy nigga told me \"Get 'em, get it?\" I got 'em\nStand on that couch and just drink out the bottle\nThat .40 got hollows, that bitch, she gon' swallow\nGet to that money, I'm King of Chicago\nBought a new crib just to fuck you in\nBought that Benz just to fuck your friends\nGiuseppe's 900 with the gold bars\nEverything about me raw like a dope charge\n\n[Hook]\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nI been getting money, where the fuck you been?\nBought a new crib just to fuck you in\nBought a new crib just to fuck you in\nBought a new crib just to fuck you in\nI been getting to the money, where the fuck you been?", "image": "https://s3.amazonaws.com/rapgenius/UMG_cvrart_00602537507474_01_RGB72_1500x1500_13UAAIM70647.1200x1200-75.jpg"}], "artist": "2 Chainz"}