{"songs": [{"title": "Watch Ya Step", "album": "The Last of a Dying Breed", "year": "2000-10-03", "lyrics": "[Scarface]\nWatch ya step... watch ya step...\nWatch ya step... watch ya step...\nWatch ya step... watch ya step...\nWatch ya step... you better watch ya step...\n\n[Verse 1]\nAnd ya don't stop, so I guess it's on once again\nThe Natural Born Killaz in a zone again\nI'm different type of special men not known to man\nI refuse to loose, I was born to win\nA street nigga, the stand up type, never to fall\nI've been programmed to run in and get it, take it all\nSit back and capitalize off mistakes you made\nBeat yo ass into submission, and make you pay\nI got battlescars from fuckin with this, I gotta have it\nWhat's my reason for quotin this shit? I gotta have it\nLike the Roy Jones - you see this money get me hungry like a wolf\nAnd when a nigga hungry I'm a wolf\nThat's when I start my rage, and attack from the neck up\nCatch you being careless, make these hoes respect us\nSurvival here, that's the name of the game\nIt's the jungle in this bitch and ain't a damn thing changed\nWatch ya step\n\n[Hook]\nLet's get it on y'all, to the beat y'all\nFuck a bitch y'all, I'm from the streets dawg\nSo what it is huh? What it look like?\nI'm a G fool, you the bitch type\nYou got yo strap dawg, I got a strap too\nI'm from the Southside, we act a damn fool\nYou ain't the real ho, youse a real ho\nI keeps it real ho, for real though\n\n[Verse 2]\nListen close to the story I'm about to tell\nNiggas is sellin they soul for an ounce of yell'\nAnd a few leave, but this is a house of jail\nTwenty-five year bids, without the bail\nI know some niggas in the tank, stuck, lost and thowed\nStill boss turnin ya status from false to hope\nOnly a few niggas stand up strong and don't whine\nWhen the time get passed around huh?\nI'm tellin you dawg, that even if you gettin released\nHow the fuck is you gon' live on these streets?\nYou got that jacket on ya back\nYou a rat and you done spilled ya guts\nYou a bitch and now you live to fuck\nAnd you a nigga I ain't even gotsta feel to touch\nI got some niggas on the inside to stick and seal you up\nIt's all good for you out here, gettin yo mail\nBut the minute you get popped you gonna snitch in jail\nWatch ya step\n\n[Hook]\n\n[Verse 3]\nThey say that music is a therapy to ease the mind\nBut see therapy to me, is to squeeze a nine\nRight between ya eyes, while I squeeze ya throat\nChuck you off the side of my boat and watch you float\nThe animal they sent here to seal ya fate\nTie ya hands behind ya back and feel ya face\nAin't no hope for ya partner Joe, he broke the rules\nIn the jungle if ya weak, we gotta smoke ya fool\nAin't no love for motherfuckers who done crossed the line\nCocked dice don't pay nigga, now roll ya five\nYou wanna play the gun game with me, then pull ya shit\nI know you'd love to try to punk me if you could ya bitch\nBut I'm a diehard nigga, I was sworn to silence\nAnd if I got to go, then I (?)\nSo fuck you, and them niggas that you run with fool\nI'll do the same shit to them, that I did to you\nWatch ya step\n\n[Hook]", "image": "https://images.genius.com/2361572b4ea20d3eff0b970b4f5f5a1e.1000x1000x1.jpg"}], "artist": "Scarface"}