{"songs": [{"title": "​untitled 01 | 08.19.2014.", "album": "untitled unmastered.", "year": "2016-03-03", "lyrics": "[Intro: Bilal]\nCome here, girl\nOh, you want me to touch you right there?\nOh, like a little lamb, play in your hair\nOh you want it? Oh you want it right now\nLike that? I got you baby\nAll on you baby\nPush it back on daddy\nPush it back on daddy baby\n\n[Verse: Kendrick Lamar]\nI seen it vividly jogging my brain memory, life is...\nI seen it vividly jogging my brain memory\nLife no longer infinity this was the final calling\nNo birds chirping or flying, no dogs barking\nWe all nervous and crying, moving in caution\nIn disbeliefs our belief's the reason for all this\nThe tallest building plummet, cracking, and crumbling\nThe ground is shaking, swallowing young woman\nWith a baby, daisies, and other flowers burning in destruction\nThe smell is disgusting, the heat is unbearable\nPreachers touching on boys run for cover, the paranoid\nRapists and murderers hurdle alleys\nValleys and high places turn into dust\nFamous screaming in agony\nAtheists for suicide, planes falling out the sky\nTrains jumping off the track, mothers yelling \"he's alive\"\nBackpedaling Christians settling for forgiveness\nEvidence all around us the town is covered in fishes\nOcean water dried out, fire burning more tides out\nTabernacle and city capital turned inside out\nPublic bathroom, college classroom's been deserted\nAnother trumpet has sounded off and everyone heard it\n(It's happening) no more running from world wars\n(It's happening) no more discriminating the poor\n(It's happening) no more bad bitches and real niggas\nWishing for green and gold the last taste of allure\nI swore I seen it vividly\nA moniker of war from heaven that play the symphony\nThunder like number four, then I heard\n\"What have you did for me\"\nI fell to my knees, pulled out my resume\nThat dated back to June 17th, 1987\nMy paperwork was like a receipt\nI was valedictorian, I was fearful of judgment\nBut confident I had glory in all my past endeavors\nClose my eyes, pray to God that I live forever\nDark skies, fire and brimstone, some of us sent home\nSome of us never did wrong but still went to hell\nGeez Louise, I thought you said that I excel\nI made To Pimp a Butterfly for you\nTold me to use my vocals to save mankind for you\nSay I didn't try for you, say I didn't ride for you\nI tithed for you, I pushed the club to the side for you\nWho love you like I love you?\nCrucifix, tell me you can fix\nAnytime I need, I'mma start jotting everything in my diary\nNever would you lie to me\nAlways camaraderie, I can see, our days been numbered\nRevelation greatest as we hearing the last trumpet\nAll man, child, woman, life completely went in reverse\nI guess I'm running in place trying to make it to church\n\n[Outro]\nYoung nigga act an ass\nYoung nigga act a fool\nYoung nigga get yo' cash\nYoung nigga do what it do\nYoung nigga go, young nigga go\nYoung nigga go, young nigga go\nWhatever makes all of you happy in this bitch\nJust take it all back before the light switch", "image": "https://images.genius.com/45790022edf45dc9796e781a40cabb42.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}