{"songs": [{"title": "Is It Me", "album": "4:21... The Day After", "year": "2006-08-29", "lyrics": "[Intro: Method Man]\nUh... yeah, y'all, guess whose back?\nHeh... cauli' flavored, momma crack\nYeah... yeah... Scott Storch (Return of the great)\nMr. M-E-F (aww shit) know what I said\nBlack people don't use the T-H, yo (got it fucked up now)\nYo, yo...\n\n[Method Man]\nGuess who back though, crack dough, yes, eyes is hat low\nStash 'dro, pimp on the side, you know how that go\nRap flow, major, taste the flavor, all natural high\nY'all gotta love it when the track go (track go)\nAsk Def Jam what's hot, three letters, M-E-F Man\nBeen stopped, that's off top, young, fresh to death\nAnd you're not, no matter what the job, I'm the best man\nRap C.E.O. minus the yes-man (yes-man)\nI know that's right, so act right, Staten on the map\nLike fuck y'all, get stuck, y'all and have a bad night\nAs I brush off my shoulder, that's right\nMy nigga Scott Storch keep bringing it back like (back like)\nOh boy, dig it, I talk about it and I live it\nBeen there, did it, shitted and wiped my ass with it\nThese critics saw the train for brains and must of missed it\nIf they ain't got the shit, they'll never get it (never get it)\n\n[Hook: Method Man]\nIs it me, or is it these, niggas in it for cheese\nIs it me, all my enemies, hating on Killa Beez\nIs it me, or is it me, that ain't feeling M.C.'s\nWith the top down, wheeling the v, feeling the breeze\nIs it me, or is it these, niggas spitting the same\nIs it me, all my enemies, throwing shit in the game\nIs it me, or the industry that really got to change\nOnce again, it's Wu-Tang, in case y'all forgot the name\n\n[Method Man]\nI spit germ, early bird gets worm, now\nNow that it's his turn, clowns don't get turns, now\nFuck with a chick perm, when she get hot, you get burned\nYou see I'm not kidding, knowing these kids learn (kids learn)\nAnd and I'm that dude, ahh-choo, and allerging to wake jewels\nBlast if I have to, and y'all don't give me no hassle\nWho rep Rotten Apple to death and get natural\nMake hard beats pound like the track do (track do)\nIf you ask me, this raspy voice nigga is nasty\nKhaki's hanging off of his ass, eyes is glassy\nThat's fucked, that's us, niggas know where to catch me\nAt 1-800 GET-AT-ME, (get at me)\nMy, flow's, no holds barred, Holy Jahad\nIt's the head nigga in charge, Meth, back on the job\nLike back in the days, back when, the game was hard\nAnd when they reminiscenced over Wu, my God\n\n[Hook]\n\n[Method Man]\nUntil these rap niggas stepped up, checked up, man this game is messed up\nNext up, you know what it is, don't get it f'd up\nMeth, what? F.Y.I., you need a heads up\nAnd I don't mean to beat you in the head, but (head, but)\nWhen you spit that, forget that, I eat these niggas food\nAnd the shit wrapped, where Cliff at? Tell 'em Mr. Meth got his shit back\nThe gift back, sign, sealed, delivered and gift wrapped\nAnd when you hear that click-click (click-click)\nThat's real talk, some niggas will talk to the cops\nGet killed off, man how did you get caught with all the rocks\nAnd still walk, no matter what you mix with a pig\nYou still pork, and money is still forced (still forced)\nYeah, that was right on cue, new and improved\nAll these dudes try'nna walk in my shoes, doing my moves\nBut that's cool, cause I'mma make it do what it do\nWith this W, like I can I get a \"suu\" motherfuckers?\n\n[Hook]\n\n[Outro: Method Man\nW-T-R-B...\nWu-Tang Radio, Bitch...", "image": "https://images.genius.com/3ddccdf6d7612b941c3c9dfb5048829a.1000x1000x1.jpg"}], "artist": "Method Man"}