{"songs": [{"title": "No Feelings", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "Hook:\n\nNigga I ain't got no feelings\nWhat the fuck you think this is?\nI got no reason to live\nSo make your mind up\nWhat you wanna do?\nI make your family be missing you\n\nNigga I ain't got no feelings\nWhat the fuck you think this is?\nI got no reason to live\nSo make your mind up\nWhat you wanna do?\nI make your family be missing you\n\nVerse 1: Slop & Patacico\n\nDustin' you off like dirty finger prints on evidence\nBattlin' me ya dead like presidents\nI'm Fresh like Prince, Jazzy like Jeff\nThe man just like Meth\nCrazy like Left plus jams is like Def\nWid a pen I'm king like Kurupt\nWhen I throw a style you betta duck\nIf you don't yo ass is outta luck\nDon't fuck, wid the masta\nIf I have to, the I'll blast ya\nThen go to church to see my pastor\nWhy ya have to be like this\nMe and the mic's tight like\nGladys Knight and the Pips\nThis year my son turned six\nYo style's wack and you need to get that shit fixed\nRepresentin' Jersey my raps hittin' harder than bricks\n\n[Patacico]\n\nI'm iller, realer\nThan ya local drug dealer\nCome to my villa\nMeet the nine milla\nLettin' off\nWhere I stop you gettin' off\nMake you feel it juts like Latifah's kiss in Set It Off\nYou want war come on\nPut on the boxing gloves\nPeople call me an artist in the canvas\nCause I draw blood\nThat's what's up\nWid the shit I manouver\nHit the losers wid a Luger\nThan lay up in Aruba\nI'm gon' be rappin' till you motherfuckas get sick ah me on the mic\nI'm sicker than ten niggas wid HIV\nTracy, had the cico, the freako\nHoldin' heat somewhere on Wall Sreet wid Sloppy Joe\nYou hear me though?\n\nHook\n\nVerse 2: Slop, Patacico & Kurupt\n\nMy name is Stephen\nI eat MCs for no apparent reason\nIt in you if you skeezin' I'm pleasin'\nThose who dare\nI advise you not to stare\nYou be assed out like a flat tyre widout a spare\nI declare war before I had to even the score\nYou got me hot like sand on the shore\nI'm runnin' the floor, like a ballerina\nI go back like Flava Flav in cold Medina\nI get honies to make you say \"You seen her?\"\n\n[Patacico]\n\nI'm pregnant, but only in my mind\nHopin' my baby rhyme grows up to be a triple platinum album\nI fell on, using the steel to do crimes\nSmoked so many niggas they put up no smoking signs\nCharismatic asthmatic, ballin' like Madden\nCream, automatic attractive like a magnet\nSpeedin' like car racin'\nCream like carnation\nBurned out my Playstation while cats be scar facin'\nHey old lady, sorry's all I can say\nBy bills got me lookin' at pocket books, in a different way\nFox got the bubbled eye Benz-o\nI'm in the back of Kurupt flex truck playin' 64 Nintendo\n\n[Kurupt]\n\nGet peeled, skills in the fields\nRaw dog raw deals\nNiggas either ill, fake or real\nPenetrates I only heard ah tens and thirty eights\nRide as the niggas turnin' states and flippin' crates\nGet lift like weights\nBust and radiate spreadin' infections\nMurderous mafia connections\nI wanna feel touched like feelings\nStart drillin' start ampin' out\nHittin' wid autos campin' out\nWid autos innovative calculative creative\nTouched nigga, hectic, wid a couple seconds\nA bust nigga, from a distance I can peep a fuck up\nYou on the Ave wid nuthin' but cash to get stuck up\nMan them diamonds y'all got is nice, hot\nNever seen cowards wid so much ice\nI got blocks to get all that's got behind the scenes\nSellin' Glocks, tech nines, sixteens and magazines\nZines, zines, zines.......", "image": "https://images.genius.com/a7652517cf446c15e882aa0bc85229b3.594x594x1.jpg"}], "artist": "Kurupt"}