{"songs": [{"title": "My Niggas", "album": "Dreams Worth More Than Money", "year": "2015-06-29", "lyrics": "[Intro: Meek Mill]\nI pray to God man that we ball for a hundred summers\nYou know me, I did it for my niggas man\nAnd I want everything my niggas want\nYou feel me?\n\n[Verse 1: Meek Mill]\nI want everything my niggas want\nExcept for the hoes they fucking\nBut if they happen to fuck my hoes\nThen I fuck their hoes and it's nothing\nCause we all living life and we stuntin'\nMy niggas was there when they wasn't\nAnd these bitches be there when you buzzing\nAnd now that we here all these bitches be fucking\nAnd all of a sudden these niggas be hating\nThey told me I never would make it\nMy niggas was down when these niggas was faking\nNow we run the town and they mad that we made it\nBut we wasn't mad when these niggas was on\nFuck y'all thought we was doing\nWhen I was putting in all that time\nGrind hard nigga you gon' shine\nLike a diamond in the sky\nAnd these words I can't describe\nHow I miss my niggas that died\nI'll war with the reaper to see them two times\nMy brother's my keeper, it's never two sides\nIt's DC or nothing nigga\nAnd all these haters screaming fuck us\nCause they hoes fucking with us\n\n[Chorus: August Alsina]\nI gon' ride with my niggas\nEven if a nigga ball or fall\nI know I'mma be alright with my niggas\nIf we keep grinding, tell 'em where to buy me or find me\nEverything my niggas want\nI want everything, I want everything\nI want everything my niggas want, everything\nI want everything, I want everything\nAnd I want everything my niggas want, everything\nI want everything, I want everything\nI want everything my niggas want\nEverything my niggas want, I want everything\n\n[Verse 2: Meek Mill]\nI want everything my niggas want\nBuy a foreign, give my nigga one\nHundred thou, give my sister some\nBought momma crib, get her a bigger one\nThis year for my day ones\nThat stayed down when we ain't get to run\nFlying jet and fucking hoes\nEverybody can't get to come\nEverybody can't be the boss\nKeep your head up, you gon' see the stars\nPut your head down, you gon' see the ground\nOn the tour, they got to see me now\nAll this food, they got to eat it now\nWhat all you haters forgot?\nWhat you forgot that I paid all my dues?\nI was like twenty, I purchased a watch\nBack when I prayed to God to get a brick, nigga\nPrayed to God to be a rich nigga\nPrayed to God to get the brand new Rollie\nAll flooded on my wrist, nigga\nTiming is everything\nI love all my niggas and my family is loyal\nI'm buying them everything\nPut Papi through college and everything\n\n[Chorus: August Alsina]\nI gon' ride with my niggas\nEven if a nigga ball or fall\nI know I'mma be alright with my niggas\nIf we keep grinding, tell 'em where to buy me or find me\nEverything my niggas want\nI want everything, I want everything\nI want everything my niggas want, everything\nI want everything, I want everything\nAnd I want everything my nigga want, everything\nI want everything, I want everything\nI want everything my nigga want\nEverything my niggas want, I want everything\n\n[Verse 3: Meek Mill]\nAll of my niggas is all of my niggas\nI swear we won't fall out for money or hoes\nAll of my niggas is all of my niggas\nWe busting them down if they come by the load\nDown by the code\nGet it, you flip it, you bag it, you add it, divide it, subtract it\nYou niggas is spending your cop money profit\nThe fuck is you doing? Hustling backwards\n\n[Outro: Meek Mill]\nHow you gon' get money like that? I just talked to my nigga on the phone\n\"He said, Meek Milly, you did for the team again\"\nWe gon' ball for a hundred motherfuckin' summers\nOne time for the Chasers", "image": "https://images.genius.com/1a5cda77113ea2b18bfbec0f3ffbaf69.1000x1000x1.jpg"}], "artist": "Meek Mill"}