{"songs": [{"title": "Kid Cudi Freestyle Diss", "album": null, "year": "2015-11-27", "lyrics": "And I'mma give out every edition\nAnd put out every mission\nAnd make sure you hear everything that I say\nAnd make sure that listen to every rhythm that I be spittin'\nUnconditionally written\nP.S to all my enemies you are now forgiven\nExcept Kid Cudi\nCause that's not my motherfuckin' buddy\nIf I see him in the streets it's getting motherfuckin' ugly\nNow I know you might be a fan\nAnd me and him share similar shit and you like \"damn\"\nBut that don't matter\nWe ain't gonna give nothing to the chatter\nWe gonna stick to what's at hand\nI said \"Did you heard that?\"\nThey said \"what?\"\nI said \"You didn't heard the thing\nAbout how they gave sixteen shots to McDonalds\nWhile he was on the ground right outside of Burger King?\"\nThey said \"How could it?\"\nI said \"You ain't see it?\"\nHe said \"Nah, they erased the footage\"\nSounds like the motherfuckin' police\nThat's why sometimes to protect them kids\nYou gotta keep them pigs on a real short leash\nBut they protection, for your section\nMake sure you have discretion, learn your lessons\nCount your blessings, don't be no bitch\nDon't be no hoe, but don't be out here stressing\nYou got a connection\nMake sure you protected\nMake sure you count your blessings\nMake sure that you don't stress\nRight, feel me Blake?\nBlake you gotta keep shit straight\nIt's Blake, sometimes these niggas be fake\nBlake, sometimes they say that they cold but really them niggas a cake\nBlake, you feel me?\nYou gotta watch out, keep your grass cut low to watch out for the snakes\nBlake and if you see they're vampires\nAnd they man's a liar\nMake sure you aim at their motherfuckin' heart with them stakes\nYou feel me Blake? Straight\nShit sound great\nSuperman flow I should have a motherfuckin' cape\nI don't take hoes\nDog I give you my bitch and you can take her on a date\nJust make sure you bring her ass back around eight\nYou feel that Blake?\nStraight\nI ain't even trying to top that shit\nBlake, you know how to do it\nDrop that shit", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}