{"songs": [{"title": "No Flex Zone (Remix)", "album": "Catastrophic 2", "year": "2014-06-06", "lyrics": "[Hook: Swae Lee]\nNo Flex Zone, No Flex Zone\nThey know better, they know better\nNo flex zone, no flex zone\nThey know better, they know better\n\n[Verse 1: J Doe]\nI ride back on it, it's yo boy Yung Freshie\nWabbin' at the door, no guess me\nThese hoes lookin' at me desperate\nHate niggas betta find an exit\nPockets full of dollars on my check list\nWobble like a muthafuckin' fresh prince\nBroke niggas ain't want respect then\nAnd these hoes only get rejection\nI got yo bitch last night\nAnd tomorrow I'm ready for the next one\nI'm next, yo dawg, yo bitch, she off it\nShe see me, she fall, these hoes ain't loyal\nWhen a rich nigga want her\nAnd a rich nigga need\nThat only leave one spot for 'er\nThat broke nigga to beat, hold up!\n\n[Hook]\n\n[Verse: OT Genasis]\nThese niggas be talkin' that shit\nLike I won't pull a pistol out and make them 'yeee'\nInitially mane, cause I'm in the game\nSo niggas is like 'who is he?!'\nFinnessin' and juggin', you're damn right I'm cookin'\nDeath to the suckheads, the federal lookin'\nRoll with the burner, cause we don't play fair\nTwo on yo head like we countin' yo hair\nBitch, I am tellin' you niggas\nYes, I am your father, you trip, I'mma pop (praaa)\nI'm holdin' my bandz with diamonds that's blue\nAs the white, now you think I'mma cop\nDamn right I'mma cop, I'mma cop me a benz\nCop me a who?! Cause I don't do friends\nShe don't do right, then I'm fuckin' her friend\nThat's what happen when it ain't one hunit with G\nNo flex zone, cause I'm all about mill\nYou can't go Hollywood in Beverly Hills\n\n[Hook]\n\n[Verse 3: Busta Rhymes]\nShe did a flex so hard until a bitch gil'\nEverything about me is a big deal\nLay yo ass down and flex that pussy\nOn a dick shatter, tell me how the dick feel\nWhen I'm in the building, shit done get real\nDo you think I need to tell ya click chill?!\nYou and yo whole team, ain't like niggas who got and get served?!\nOn the strip, cause you niggas pop pills\nYou got milk? Well, I got mills\nYou niggas got a deal? Well, I got deals\nCut the mansion, put it on top of the mountain\nBought another one up in the hills\nNo flex zone, two techs, chrome\nQuadruplex homes, you vexed? So...\nWho's next? Those\nWho think that you the best? No\nSuplex hoes, tryna flex in a no flex zone\nWith the dick\n\n[Hook]", "image": "https://images.rapgenius.com/e349da8eaab5525d3c330d3a3d72482a.500x500x1.jpg"}], "artist": "Busta Rhymes"}