{"songs": [{"title": "Backseat", "album": null, "year": null, "lyrics": "[Hook: Gucci Mane]\nMan I'm riding round 1 deep, yup, yup , yup, yup\nWith that choppa on the back seat\nBall, ball, ball, ball\nAnd I ain't worry bout you fuck niggas, squad, hahaha squad!\nMan I ain't worry bout you fuck niggas, you know!\nBow, bow, bow, bow\nI said I'm riding round 1 deep, you know\nWith that choppa on the back seat, you know! yeah!\nSo I ain't worry bout you fuck niggas, nah yeah!\nSo I ain't worry bout you fuck niggas, Nah Bow, bow\n\n[Verse 1: Gucci Mane]\nI got a AR-15 on the back of the seat\nKnock your head out clean to the back of the Jeep\nAnd since I'm Gucci baby giving me the 3rd degree\nBitch I ain't nothing these rappers serve more Junies than me\nSo much today's hottest stars ain't got more money than me\nThey told me Gucci step up your bars\nI told 'em step up this CHEESE!\nI'm bout to really go sheae just like drew breeze my nigg\nAnd everytime I do a feature, 50 pounds of meat\nMe and flocka twin choppas, we pop bottles and lick\nI see your contract my nigga, that ain't no money to live\nGot me fucked up, down to sleep and under the bridge\nI'm eating good, fuck food, 60 bricks in the fridge, it's Gucci!!!\n\n[Hook: Gucci Mane]\n\n[Verse 2: Waka Flocka Flame]\nOne deep in the gold just weed and a choppa\nMake your frame came you that's the power of the dollar\nYour niggas wild, but my niggas wilder\nGot an army of killers, no coing power\nExtendos in my handguns, 100 rounds spent now 1\nShooting best friends and loved ones\nWe shooting nigga, no feel ones\nPoint a nigga out, we fill one\nCan't walk a mile in my air ones\nHunned goons, I wish one\nPut 50 bands in your grand son\nSend a picture back with a ransom\nI need a million dollars shawty and some\nI'm the wrong nigga to put hands on\nDown industry we hands on\nI'm from clayton county, riverdale\nBlack ski mask, no clientelle\nThis Jurrasic Park, welcome to hell\nYou seen the threats we ring the bells\nFront door, service, make 100 goons feel like no help\n2 possy Glocks till the barrel melt\nMake your son feel the same pain I felt, bastard!\n\n[Hook: Gucci Mane]\n\n[Verse 3: Chief Keef]\nGot green like churanchulas\nYou don't want my cancer bra\nI smoke you but I don't know you bra\nBout to get your benzes up\nI'm manning up, banding up\nDummy don't get damaged up\nI done did all kind of stuff\nSelling dope, robbing stuff\nTek under my seat\nWish a fuck nigga try me\nRoom full of killers move by me\nAnd they move in silence\nGetting head from a bitch that's Chinese\nCouple killers behind me\nAll my niggas grimey\nAnd you know where to find me, Bitch I'm\n\n[Hook: Gucci Mane]", "image": "https://images.genius.com/6f0a4980c8ef838036229e1d4dcd036c.408x408x1.jpg"}], "artist": "Gucci Mane"}