{"songs": [{"title": "Black Tequila", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Produced by Frank Dukes]\n\n[Intro: Ghostface Killah]\nWhere's my horns? Andale! Andale! Yo\n\n[Ghostface Killah]\nThrow me in a mosh pit, I'm live, will start shit\nMelt the place then break out like an arsonist\nClassified to get it for a classic killing\nIf I turn my back and walk, that means I'm chilling\nGot bitches in mi casa, boiling fresh lobsters\nBut I don't do the shellfish, I'mma just eat pasta\nTurkey, Italian sausage, chopped up kielbasa\nDoing hits from home, like an elite mobster\nLove my onions iced up, real little, wifed up\nGotti trench men is real brittle, Poconos is where I go with the capos\nEleven Sammy the Bulls, ready to wake those\nI'm half black, yo, half oregano\nThat's half Ital', yo, who he, I'm from that Island, yo\nStaten, crushing niggas like aspirins\nCommissioner Kelly, ya'll kill ya captain\nThat's word to my bitch that's laid off\nThat little patch in the pussy, word, I ate it off\nTeam move with hands in the air like Adolf\nHand me a big joint, bet I spray it off\n\n[Interlude: Cappadonna]\nToma, toma, mira, big kid\nPoppy Wardrobe, Poppy Wardrobe, right here, Poppy Wardrobe!\nMaricon! Yeah...\n\n[Cappadonna]\nLa Cosa Nostra, La Familia\nWhat, violate my family ties and I'mma kill ya'll\nMi amor, dami un beso, El Capitan, I'm ghettio\nHot sauce, on my Spaghetti-O's\nPoppy Wardrobe, Mexican, handle a hose\nAll my gutter gang crew, got border patrol\nLights on when I come through, black Soprano, what\nTwo in the holster, my code name Darryl\nRide off in the sunset, sparking the barrel\nLong boots on, my horse named White Boy John\nRide that side of that bitch, straight Mexican song\nAsh hanging off the blunt, don't ever look at me wrong\nIn my heart piece stolen, Julio, I'm dirty\nUp in the Arizona desert, where the shit get ugly\nAll my Staten Island riders, ride or die honchos\nGet CREAM all day, leave our poncho\nWe bull fighting niggas, wrestle with broncos\nAnd my team stay tight like Silver and Tonto\nCarry a long whip, ya'll whip ya ass\nHard head Mexican dope, mixed with hash\nMachete behind dough, with a rip in the slash\nDesperado kids, me and Ghost, back at last\n\n[Interlude: Cappadonna]\nToma, toma, Poppy Wardrobe\nPoppy Wardrobe, Poppy Wardrobe\nBring it...\n\n[Trife Diesel]\nYeah, Cinqo de Mayo, imported guns from Cairo\nGot bagged with the toaster, beat the charge like rhinos\nThis bitch who's Albino, I met her out in Chi-Town\nWhile I was out in Greek town, ordering gyros\nThe bad bitch keep a tool and a bible, quick to murder her rivals\nAnd her pops was a gangsta disciple\nHe killed about a thousand vice lords, guns and knife wars\nThe feds came for him, so slick to the night ward\nDown in the N.O., and right before he left\nHe wrote his daughter a memo, left stacks in the Benzo\nIt got hot, niggas selling, giving out the info\nHe paranoid, every 20 seconds out the window\nBlow it in the limbo, he spazzed on Lorenzo\nAnd smashed him in the head with his own son's Nintendo\nAbout a week later, the boys came and rushed him\nKicked down his door, while he sleeping and cuffed him", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}