{"songs": [{"title": "The Stomp Part II", "album": "A Son Unique", "year": null, "lyrics": "[Intro: Ol' Dirty Bastard]\nDirt, Dirt, Dirt...\nDirt, Dirt, Dirt...\nThat's what I'm talking about\n\n[Ol' Dirty Bastard]\nSoon as she slurp the mic, here comes the herpes light\nPeople at church be like, friends, at work be like\nShe is the thirsty type, a nigga McGirt be like\nLook, it ain't workin' right, it will convert my life\nNow she's an earthly type, pure, and worthy type\nCatch her in early nights, smile with pearly whites\nSippin' Bacardi's like, she's back in perverted life\nYou know how these birds be like, that's why you can't treat them right\nMy brother he eats it right, cheat, and beat his wife\nIke and Tina fight, this Medina life\nThe crack and nina like, block and fiending like\nCop subpeona like, giants and beams of light\n\n[Hook: RZA (Ol' Dirty Bastard)]\nStomp, stomp, stomp! (Dirt, Dirt, Dirt, that's what I'm talking 'bout)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp!\n\n[Ol' Dirty Bastard]\nThings ain't the same today, this is the game they play\nDirt, the name, they say, throwin' the blame my way\nSo they can change my face, take and claim my space\nBut I remain the ace, always maintain a space\nCoke, the 'caine, the base, Henny without the chase\nThen it come out to lace, pussy all in my face\nYou know where the Dirt be at, where the skirts be at\nMoney and work be at, pull and squirt the mac's\nYou fake aristocats, where your pistol at?\nWeak ballistic caps, I'm firing missiles back\n\n[Hook: RZA (Ol' Dirty Bastard)]\n(That's what I'm talking 'bout)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp! (Dirt, dirt, dirt)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp!\n\n[Ol' Dirty Bastard]\nThree years, I'm out the gate, waiting, my clients deflate\n(What, what) chain plate, bitch, I'm goin' state to state\nBitch, I sniff them eights, muthafucka, make these papes\nWatch that ho get raped, nigga, I'm going ape\nThis is part two, the Stomp, you niggas in the slump\nUzi's all in my trunk, nigga, you hear the thump\nFill you with holes and lumps, rocks all in my fronts\nCock and feel the Monk, pussy everyday of the month\nDo what the fuck I want, bitches, you shake your rump\nNiggas you ain't no comp, let me see you jump\n\n[Hook: RZA (Ol' Dirty Bastard)]\nStomp, stomp, stomp! (Dirt, Dirt, Dirt, that's what I'm talking 'bout)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp!\n(Dirt, Dirt, Dirt, McGirt) get, the, fuck, off, your, ass, nig-ga!\nStomp, stomp, stomp! (That's what I'm talkin' bout!)\nLet, me, see, you, stomp, stomp, stomp!\nGet, the, fuck, off, your, ass, nig-ga!\nStomp, stomp, stomp!", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}