{"songs": [{"title": "Dead or Alive", "album": "Short Dog’s in the House", "year": "1990-09-11", "lyrics": "I heard there was a rumor Too $hort was dead\nWalked in the house and got shot in the head\nI know you don't believe it, if you do you're wrong\nHow can I die and rock it all night long?\nI'm Too $hort baby, spit that rap\nI put Oakland, California on the map\nIt's so hard, got you telling lies\nCan't hold me back so you say I died\nIt's incredible, I came back to life\nI never let 'em bury me without my mic\nI keep breathing, don't stop that breath\nNow everybody's talking about Too $hort's death\nAm I a zombie, or something close?\nI'm not Casper, I mack all the ghosts\nOaktown style is the only way\nI catch a new freak every day\nIt's not the Yellow Brick Road, it's called the Foothill Strip\nStand on your toes, make your heels go click\nThree times, it's no place like home\nSo why you wanna bury me all alone\nI bring a new meaning to underground rap\nDead or Alive, I'm still Born to Mack\nAlways on the pop charts, straight rapping\nI'm not dead, I'm just macking\n\nSo as the word turns, I'm a living soul\nI even heard a rumor that I overdosed\nI'm not a reincarnation of something old\nLike King Tut I was buried in gold\nWhy you wanna cry when I'm still living?\nWord got out and the rumors started spreading\nMy momma, called one night\nSaid \"Todd, are you all right?\nThe whole family's got the Too $hort blues\nI heard it last night on the evening news\"\nAnd that's bad, it's not even true\nI told my momma like this \"Let's sue\"\nSo many times, I heard I died\nI guess I'm like a cat and I got nine lives\nWell I'm the P-L-A, Y-E-R\nI lay bunnies, like Hugh Hefner\nI'm her flavor, kinda saucy\nI lay back and let the young freak toss me\nEven if she don't like serving a pimp\nI'm still living, so let's do it again\nI keep rapping, hard as hell\nCause your rumors make my records sell\nIf you continue, I'll soon be rich\nRiding around town going \"Biiiitch!\"\n\nPeople always say \"Too $hort can't rap\"\nNow I drive a Benz and my bank is fat\nIt's like crap, put a \"c\" on a rhyme\nAin't nothing left homie but a scandalous crime\nI'm the best damn rapper you could ever hate\nSay I died on the freeway in the earthquake\nSay I'm washed up, say I'm through\nBut the fact still stands I'm better than you\nYou got rhymes? Well I got more\nI take you on a trip to my rappin' store\nYou find rhymes and raps, poems and caps\nWay more raps than any rapper could rap\nCause if you rap like me, he wouldn't have to be\nWeak on the mic like my boy MC\nIt don't stop, to the funky beat\nI know you like dancing with a real big freak\nI can't dance, but I sure can rhyme\nI sold a million, in '89\nAnd if you didn't know baby, it's the 90's now\nOld Short Dog got a new breakdown\nI went to Miko's, fresh candy paint\nNow I'm doing things that the suckers can't\nIf I was dead, they'd call it \"Dead Man's Rap\"\nBut on the real, Short Dog is back\n\nFunk funky, off the Parliament\nI'm still living, so let's do it again\nIt's incredible, even if I die\nI never let 'em bury me without my mic\nI bring a new meaning, to underground rap\nDead or alive, I'm still Born to Mack\nI say \"What's up\" to my homies in Santa Rita\nRight about now I know you need a\nToo $hort rhyme to get you through the day\nOaktown style is the only way\nI came up, and now I've sworn\nTo rock this mic til I can't no more\nAnd that's game, straight pop the most\nMC rapper from the West Coast\nToo $hort, dead or alive\nI still chill on the Eastside\nCause I remember how it all began\nHouse parties in East Oakland\nNow it's on the pop charts, still rapping\nI'm not dead, I'm just macking", "image": "https://images.genius.com/354fed0b5f5b1d6e18186fae903238d6.930x927x1.jpg"}], "artist": "Too $hort"}