{"songs": [{"title": "Rock N Roll", "album": "Black on Both Sides", "year": "1999-10-12", "lyrics": "[Mos Def]\nMake me wanna holla!\n\"Ah.. ah-ah, ah-ah.. ah-ah, ah-lert the squad..\"\nRock and roll\n\n(Huh) My grandmomma was raised on a reservation\n(Huh) My great-grandmama was, from a plantation\nThey sang - songs for inspiration\nThey sang - songs for relaxation\nThey sang - songs, to take their minds up off that\nFucked up situation\nI am, yes I am, the descendant (yes yes)\nOf those folks whose, backs got broke\nWho, fell down inside the gun smoke\n(Black people!) Chains on their ankles and feet\nI am descendants, of the builders of your street\n(Black people!) Tenders to your cotton money\nI am hip-hop\n\"It's heavy metal for the black people\"\nI am rock and roll (rock and roll, rock'n'roll)\nBeen here forever\nThey just ain't let you know (HA!)\n\nI said, Elvis Presley ain't got no soul (huh)\nChuck Berry is rock and roll (damn right)\nYou may dig on the Rolling Stones\nBut they ain't come up with that style on they own (uh-uh)\nElvis Presley ain't got no soul (hell naw)\nLittle Richard is rock and roll (damn right)\nYou may dig on the Rolling Stones\nBut they ain't come up with that shit on they own (nah-ah)\n\nGuess that's just the way shit goes\nYou steal my clothes and try to say they yours (yes they do)\nCause it's a show filled with pimps and hoes\nTrying to take everything that you made or control (there they go)\nElvis Presley ain't got no soul\nBo Diddley is rock and roll (damn right)\nYou may dig on the Rolling Stones\nBut they ain't the first place the credit belongs\n\n[Hook]\nSay whoa-oh (don't take it)\nOh-we-oh (black music)\nWhoa-oh (don't take it)\nOh-we-oh (black music)\nWhoa-oh (Jimi Hendrix say)\nOh-we-oh (black music)\nWhoa-oh (Albert King and)\nOh-we-oh (and Motown)\n\nI ain't trying to diss\nBut I don't be trying to fuck with Limp Bizkit (\"The fuck is on your mind?\")\nWhen I get down in my zone\nI be rockin Bad Brains and Fishbone\nI ain't tryin to slow your groove\nBut that ain't the way I'm trying to move\nI don't turn on Korn to get it on;\nI be playing Jimi Hendrix 'til the dawn\nThat's my word is bond\nSitting up on my front lawn\nGot the volume turned to ten\nPlaying Albert King the best again (black)\nWhen the morning in the cooker\nGot to turn on some John Lee Hooker\nWhen I want some rock and roll\nGo to Otis Redding to get some soul\n\nSay, James Brown got plenty of soul\nJames Brown like to rock and roll\nHe can do all the shit fo' sho'\nThat Elvis Presley could never know (black people)\nSaid, Kenny G ain't got no soul\nJohn Coltrane is rock and roll (uh-huh)\nYou may dig on the Rolling Stones\nBut they could never ever rock like Nina Simone\n\n[Hook]\nSay whoa-oh (don't take it)\nOh-wee-oh (black music)\nWhoa-oh (don't take it)\nOh-we-oh (black music)\nWhoa-oh (don't take it)\nOh-we-oh (black music)\nWhoa-oh-oh-oh-oh-oh-oh-oh-oh-oh\n\n\"ah-lert the squad\"\n\n{*Music picks up pace and gets louder*}\n\nWho am I, huh!\nGet your punk ass up\n\nElvis Presley ain't got no soul\nJimi Hendrix is rock and roll\nYou may dig on the Rolling Stones\nBut everything they did they stole\nElvis Presley ain't got no soul\nBo Diddley is rock and roll\nYou may dig on the Rolling Stones\nBut we send their punk ass home\n\nWho am I? (Rock and roll) (x10)\n\nSay, rock and roll!\nWho am I? Rock and roll! (x6)\n\nGet your punk ass up\nCompany, move\nFor Harlem, Fort Greene, Compton\nEast St. Louis, Detroit (BO BO)\nChicago (BO BO) Bed-Stuy (BO BO)\nFlatbush (BO BO) Brownsville (BO BO)\nEast New York (BO BO) Newark New Jersey (BO BO)\nIlladelphia Cincinnati Atlanta the Dirty South\nAll towns GET YOUR PUNK ASS UP!!\n\"Rock and roll for the black people\"\nHi ma\n\n\"Well that was just wonderful\"", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}], "artist": "Yasiin Bey"}