{"songs": [{"title": "Woo-Hah!! Got You All in Check (DJ Scratch Albany Projects remix)", "album": null, "year": null, "lyrics": "Yah-yah-yah-yah-yah-yah-yah-yah-yah-yah\nYah-yah-yah-yah-yah-yah-yah-yah-yah-yah\nYah-yah\n\n(Chorus)\nWhen I step up in the place, ayo, I step correct\nWoo-hah! I got you all in check\nI got that head-nod s**t that make you break your neck\nWoo-hah! I got you all in check\nAnd you know we come through to wreck the discotheque\nWoo-hah! I got you all in check\nThrow your hands up in the air, don't ever disrespect\nWoo-hah! I got you all in check\n\n(1st verse)\nBusta Rhymes up in the place true indeed\nYes, I catch wreck and that's word on my seed\nI'm guaranteed to give you what you need\nOne blood everybody like Junior Reid\nWake up every morning, yo, I must succeed\nNationwide ruckus make the world stampede\nYou really let me roll some w**d\nMad charged n***a, now I must proceed\nYo, we 'bout to make moves; set speed\nPeace to Baby Mike, Q-Tip, Ali Shaheed\nWatch me knock you out like Apollo Creed\nBody blow bustin' your s**t making you bleed\nJust feed off dynamic flows and take heed\nNeed more information homeboy then just read\nAya! You can read all about the pure breed\nDo the bogle dance I'll do the pepperseed\n\n-Chorus-\n\n(Verse 2)\nHow dare you ever try to step on my suede shoes?\n\"Top Gun\" shut down your firm like Tom Cruise\nPlease let me get down and blow a fuse\nActin' fool breakin' s**t down to molecules\nYo let me hit you with my ill street blues\nBusta Rhymes always headlines the street news\nWoo-hah!\nYo, baby girl don't be confused\nSail my seven seas and enjoy my boat cruise\nI know you really want to know who's comin' through leaving bloodstains and residues\nSorry, homeboy, but your flow sounds used\nGotta pay your dues, baby, you know the rules\nWhenever I travel the world, I landcruise\nIf you choose to f**k around, you get bruised\nNow I got you gassed on super unleaded fuels\nGive me room, give me some space, yo excuse\n\n-Chorus-\n\n(Rampage) You now rockin' wit the best the boy scout is who I be\nFlipmode is the sqaud Hah\n\nYah-yah-yah-yah-yah (8x)\n\n(Verse 3)\nYo, which motherf**ka stole my flow?\nEenie, meenie, miney, mo\nThrow that type of n***a right out my window\nBlast your a** hit you with my direct blow\nBo! Coming through like G.I. Joe\nStar Wars movie deal like Han Solo\nMake you bounce around like this was calypso\nAlways shine cause I got the high pro glow\nYou think that you can hide you think you can lay low\nRoll up on your a** like Hawaii 5-0\nMad out with my dreads in my kangol\nForget the Moet n***a just pass the Cisco Yo!\nTake a trip down to Mexico\nCome back with that shit that might make you psycho\nMaximum frequencies through your stereo\nSorry this is it but homeboy I got to go\n\n-Chorus-\n\nHah Yo Yo Yay Yo Yay Yo Yo Yay . ..\nYay Yo Yay . .. Yay", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}