{"songs": [{"title": "Tranquillo", "album": "DROGAS Light", "year": "2017-02-10", "lyrics": "[Verse 1: Lupe Fiasco]\nPeace, no material possessions shall cloud my judgement\nAs I reach, in an ethereal direction to provide my substance\nLove is not found but resides insides me, I manifest this\nI will respect myself and wear serenity as my necklace\nI will replace what I take and have tranquility as my breakfast\nShed a new light on a new path\nI will gain rhythm and lose wrath, attain wisdom and refuse graft\nAnd build upon what I built on and wisely regulate time I do have\nCause what is defeat? But just the evidence of my haste\nLack of preparedness, in my waste, so I wait\nSurround myself with nutrition, wholesomeness and true livin'\nUse natural codes of conduct to remove schism when the rules missin'\nI will pursue felicity, find value in simplicity\nAltruism and empathy will be the first thing extended to my enemy\nClarity will be the trademark of my friendships\nJust invest in my business and appreciative of the rarity of my existence\n\n[Hook: Lupe Fiasco]\n'Cause I got chillin' by the million, tranquillo by the kilo\nNigga, nigga, what, and I got kilos by the speedboat\nAnd I ain't talkin' 'bout them drugs\nI'm talkin' 'bout that love\nFor myself and all my niggas\nAll my bitches and all my thugs, what's up?\n'Cause I got chillin' by the million, tranquillo by the kilo\nNigga, nigga, what, and I got kilos by the speedboat\nAnd I ain't talkin' 'bout that work\nI'm talkin' 'bout that worth\nOf myself and all my niggas\nEvery diamond came out the dirt, nigga\n\n[Verse 2: Rick Ross]\nI got bitches on bitches, all my dreams and my visions\nI remember me fishin' out of canals in the trenches\nNow a nigga be flossy, Rolls Royce lookin' glossy\nQuick to put down a demo to get these haters up off me\nI like to smoke to myself, I just try to improve\nLet my son hold my strap while I swim laps in the pool\nTold my daughter the rules which we all must abide\nYour daddy was far from perfect, things we did to survive\nI just wanted to fly, they always lookin' down on us\nSchool district full of killers, I mean these niggas ferocious\nOnly violence and drugs, there was nothin' for us\nAll I had was this music, I couldn't afford to do much\n\n[Hook: Lupe Fiasco]\n'Cause I got chillin' by the million, tranquillo by the kilo\nNigga, nigga, what, and I got kilos by the speedboat\nAnd I ain't talkin' 'bout them drugs\nI'm talkin' 'bout that love\nFor myself and all my niggas\nAll my bitches and all my thugs, what's up?\n'Cause I got chillin' by the million, tranquillo by the kilo\nNigga, nigga, what, and I got kilos by the speedboat\nAnd I ain't talkin' 'bout that work\nI'm talkin' 'bout that worth\nOf myself and all my niggas\nEvery diamond came out the dirt, nigga\n\n[Verse 3: Big K.R.I.T.]\nYoung nigga say, ball\nCause he ain't really livin' life 'less he's down to roll the dice\nPut it all on the line for a couple dollars\nAnd a bad bitch that only think about him if he, call\nIs it really worth the time and the effort?\nChasin' woodgrain and the leather\nPuttin' pressure on the pedal, I don't want the devil\nHopin' he, fall\nFeed him to his nonsense, mothafuck a contract\nYou don't need a handout, they gon' bring the bands out\nChoppas make 'em stand down, good Lord\nBut you don't wanna be another nigga chasin' figures\nThat never really add up, white folk pass your\nFace dyin' in the grass cause they wouldn't call the, law\nCause your hood is black and they think you're sellin' crack\nMaybe so, you don't give a fuck in a rut nigga\n'Til those in the street got you stuck nigga, what nigga?\nBuck buck nigga\nBuried your partner just the other day knowin' he was too young\nHad a tool, tryna roll on the folk\nLet it go on the folk but he wasn't down to shoot one\nThough the time dead and gone, is YOLO what we on?\nI heard different, it's never too late to listen and be reborn\nYoung nigga, young nigga, young nigga, go be reborn\nPeace and understandin' is what you should be on\nMy nigga just, ball\n\n[Hook: Lupe Fiasco]\n'Cause I got chillin' by the million, tranquillo by the kilo\nNigga, nigga, what, and I got kilos by the speedboat\nAnd I ain't talkin' 'bout them drugs\nI'm talkin' 'bout that love\nFor myself and all my niggas\nAll my bitches and all my thugs, what's up?\n'Cause I got chillin' by the million, tranquillo by the kilo\nNigga, nigga, what, and I got kilos by the speedboat\nAnd I ain't talkin' 'bout that work\nI'm talkin' 'bout that worth\nOf myself and all my niggas\nEvery diamond came out the dirt, nigga", "image": "https://images.genius.com/df21a5c133cedab6f30681d3578b81a2.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}