{"songs": [{"title": "See Me", "album": "Something Else", "year": "2013-07-30", "lyrics": "[Intro]\nThis, this, this, this one of them ones\nYeah, Tech N9ne!\nTurn me up a little bit more, Ben, so I can rock this the right way, brother\nIf you got 20/20 vision\nYou can see Nina handling this music with precision\nIf not, then it's fine with me\nJust know this movement is vivid enough for the blind to see, Yates\n\n[Verse 1: Tech N9ne]\nHow in the hell can you miss me\nWhen I'm counting my mil' making hist'ry\nTrip the splits be that 50/50\nSo we rip the script swiftly and zip through chips quickly\nWhen the trash, mail and pizza man see me\nThey get a fever and cheesy when they see the man Neezy\nI'm easily beast and my hand is in my belt\nWhat? I'm independent and I'm feeling myself\nA flunk I won't be\nI bumps the trunks see\nThe ladies pop the monkey and drop the donkey\nThey want to flaunt me\nMy songs be funky\nSteady getting that cheddar forever\nBut some people acting like they don't see\n\n[Chorus: B.o.B]\nI'm top dog, something like a CEO\nI'm calling shots, call it Don Julio\nBut they don't really see me though\nBut they don't really see me though\nAll night, life like a video\nPrime time, something like a Super Bowl\nBut they don't really see me though\n\n[Verse 2: Wiz Khalifa]\nWith contact lenses say he don't smoke\nI'm rolling up and let the contact get him\nHe even choked\nMy approach was to never to be broke\nKept my real niggas close\nNow the player turned to coach\nI hear people saying why so many changes?\nWhy so many watches? Why so many chains?\nI'm mixing Kush with all these different strains\nRiding in my Porsche listening to Purple Rain\nSo much knowledge I came up on, you just a Hollywood insider\nThe inside of my crib look like a gym\nSpeaking of gym, I'm in the game, you're just a bench rider\nYou ride the bench that mean you ain't playing\nYou understand, hella fans\nBunch of hands, hundred grands that's the plan\nWizzle Man!\n\n[Chorus: B.o.B]\nI'm top dog, something like a CEO\nI'm calling shots, call it Don Julio\nBut they don't really see me though\nBut they don't really see me though\nAll night, life like a video\nPrime time, something like a Super Bowl\nBut they don't really see me though\n\n[Verse 3: Tech N9ne]\nI'm truly blessed\nI do request for all of you people to listen\nI do see checks and movie sets\nAnd never been a stranger to vixens\nPick up the pen, its in my gut to win\nI got a motive and I’m in it with a mission\nYou know what I'mma get it when I dip into it\nI've been through it, I've been a fighter with a vision\nYou can cover your eye, brother but why?\nCause your lady just discovered that my\nBig rubber defies your lover blubber\nSo you utter replies with a tougher disguise\nCause my payday done caught the nose of your lady\nI'm at the beginning of my hay-day\nY'all better Wrekonize like ¡Mayday!\nI don't know why jokers just won't let their eyes notice\nDeep in my vocals they keep yelling that I'm doper\nAnd i'll choke ya if your lips deny flow\nSo just buy jokes\nYou know couldn't see me with bi-focals\n\n[Chorus: B.o.B]\nI'm top dog, something like a CEO\nI'm calling shots, call it Don Julio\nBut they don't really see me though\nBut they don't really see me though\nAll night, life like a video\nPrime time, something like a Super Bowl\nBut they don't really see me though\n\n[Outro]\nEarth!\n[\"No more silence in the church\" whispered repeatedly behind the words:]\nPriest... monsignor... bishop... archbishop... cardinal... pope", "image": "https://images.genius.com/9d1e1c938850d53aa216f2bec0e2ef9c.1000x1000x1.jpg"}], "artist": "Tech N9ne"}