{"songs": [{"title": "Draggin’", "album": "Trap House 5: The Final Chapter", "year": "2015-04-06", "lyrics": "[Intro]\n\nMake this shit nigga just spaz out, fly\nBurr!\nOK. CEO Gucci checking in\nTime to go hard or go home\n\n\n[Verse 1: Gucci Mane]\nRiding round the city in a two-seater\nGot enough ice on for two people\nKush, near my two liter\nNo shirt on just a wife-beater\nQuicker on the draw than an art teacher\nTalking out loud like proud preachers\nPistol in my arm-reacher\nKing-sized swisher with some nice reefer\nHood are a-smashing the white people\nMe on your track, that's a nice feature\nTats on my face like nine needles\nScratch like a nigga got nine heaters\nNo national, the Grand National\nBitches sucking me like Dracula\nFlipping these hoes like spatulas\nComing down the hill, it's spectacular\nControl the rock and unload the crop\nAnd get it out soon as you hit the loading dock\nBarbershop, cause of the shady boss\nBitch I'm back so good you couldn't tell or not\nYou can smell the knot, you can tell I'm hot\nSnitching-ass niggas running to the feds a lot\nPardon, man, cause the hoes give head a lot\nBut if a nigga find out, he getting read about\n\n[Hook]\nMy dogs be dragging them hoes\nMy dogs be dragging them hoes\nMy dogs be dragging them hoes\nMy dogs be dragging them hoes\nMy dogs be dragging them hoes\nMy dogs be dragging them hoes\nMy dogs be dragging them hoes\nMy dogs be dragging them hoes\n\n[Verse 2: Gucci Mane]\nNiggas on the outside, looking. They trying to peep in\nMe I'm on the inside, cooking or trying to sleep in\nKitchen full of raw ass chickens, like it was Church's\nHood full of clown-ass niggas, this shit's a circus\nWho thinking Macs not hot? I be the leader\nPark my shit in front of the school like I'm the teacher\nTrying make this dope get hard, that's an erection\nOnly thing a nigga need now is a connection\nWest on the mean \"You Gucci? I'm cooking fishes.\"\n\"Pounds in the trashbag. Gucci, go do the dishes.\"\nMoney on my mind, that summer job shit was petty\nI'm thinking this summer what color I'll paint the Chevy\n\n[Hook]", "image": "https://images.rapgenius.com/f2114f75ae5ddb8ae934a01e54c306a6.320x320x1.jpg"}], "artist": "Gucci Mane"}