{"songs": [{"title": "Rock & Roll Nigga", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro]\nGimme some guitar, K.Lloyd!\nYeah, I like that, keep going mayne\nRock and roll, baby!\nYo, we gon' get real drunk to this one\nSo, if you wanna get knocked over\nGet the hell out the mosh pit, baby\n'Cause we 'bout to go, okay\n\n[Verse 1]\nI like big booty bitches, rappin' and Lynyrd Skynyrd\nCases of beer cold as a Kansas City winter\nDrink to get drunk then find a chick and put dick off in her\nThen make her take me shopping for kicks at Harold Pener\nMy family gave me rock, my family gave me rap\nThe streets gave me guap, the streets gave me straps\nBlack bitches fuck me, white bitches love me\nTrust me I do 'em both at the same time rough as rugby\nDo 'em both to Bon Jovi and then to Public Enemy\nEnergy in me definitively, I'm on Hennessey, then I'm on Jimmy B\nI used to have red spikes at raves\nThen turn around havin' blue and red fights with K's\nYour parents got a cold shiver\n'Cause a pot of gold hit a father gorilla, that's a dollar go-getta\nAnd he's an awesome flow spitter\nYour daughter goes with a guy who loathes millers\nWhy?\n\n[Hook]\n'Cause I'm a rock and roll nigga\nThey don't understand me, God naturally tanned me\nYou don't like it, I can be a nigga\nRockin' 600 diamonds, black and white bitches cryin'\nWhen they eyes hit this rock and roll nigga (Hell yeah!)\nAnd I ain't changin', got my Slipknot bangin\nAnd I swear to God I ain't never ever giving up\nFried chicken wings and Coors Light, nigga what?\n\n[Verse 2]\nHigh school hung with a white bruja\nCame home then I went straight to Jumu'ah\nThen after that I put back on my red puma\nThen bark at a chick the same height and color as Uma\nAnd we get the lead out to Zeppelin we blow the bed out\nGot a call from one of the homies in trouble so yo we sped out\nGot to the hood and found a rivalry took his head out\nWe had to show them evil motherfuckers what that red 'bout\nUntil we find the killers you know we will search\nFor those who kill first we gon' let the steel squirt\nAnd this mentality's valid because we real hurt\nTo ease the pain I listen to Geddy, Alex and Neil Peart\nGrowin' up it was a chore, 'cause I gravitated towards stuff the homies ignored\nLike trippin' off Bad Brains when on my skateboard\nEven more, I named my gangsta rap label after The Doors!\n\n[Hook]\n'Cause I'm a rock and roll nigga\nThey don't understand me, God naturally tanned me\nYou don't like it, I can be a nigga\nRockin' 600 diamonds, black and white bitches cryin'\nWhen they eyes hit this rock and roll nigga (Hell yeah!)\nAnd I ain't changin', got my Slipknot bangin\nAnd I swear to God I ain't never ever giving up\nFried chicken wings and Coors Light, nigga what?\n\n[Verse 3]\nMy momma made me, raised me, played me 80's, made me crazy\nMy father played me crazy, made me aid me vaguely praised me\nBut I'm a real with a lot of will\nRemember I would kill for a dollar bill\nBut that all changed with Strange, man I gotta deal\nLike every scholar in the game, got a lot of mill\nStill a riot maker fuckin' bring the house down\nWho that gang bangin' rocker with the loud sound\nThat's Tecca Nina with the shit that make them broads hound\nTelekinesis with my speeches get them drawers down\nAnd that goes for the grand dragon daughters too (Whoah)\nAnd the Neo-Soul conscious chicks they wanna swallow who? (N9ne!)\nThe show gritter and yo little low wigger\nBetter not be caught with no sitter\n\n[Hook]\n'Cause I'm a rock and roll nigga\nThey don't understand me, God naturally tanned me\nYou don't like it, I can be a nigga\nRockin' 600 diamonds, black and white bitches cryin'\nWhen they eyes hit this rock and roll nigga (Hell yeah!)\nAnd I ain't changin', got my Slipknot bangin\nAnd I swear to God I ain't never ever giving up\nFried chicken wings and Coors Light, nigga what?", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}