{"songs": [{"title": "Somebody Done Fucked Up", "album": "4:21... The Day After", "year": "2006-08-29", "lyrics": "[Intro: Method Man]\nYeah... one-two, one-two, it's Big M-E-F\nThe phenom from Vietnam, fresh out of rehab, yo\nOn my way the weedspot, haha, what's good?\nFuck that, what's hood? Staten Island Advance\nBig up to my man Magic down in MIA, what up cuzo?\n\n[Hook: Method Man]\nKnock-knock, who is it, ah shitted\nHot peas and butter, come and get it\nSomebody done fucked up, now\nMeth spit it, I comes with it\nQuick to tell these critics, eat a did-ick\nSomebody done fucked up, now\nY'all done did it, done stepped in it\nNow run and tell them niggas who the realest\nSomebody done fucked up, now\nCan you dig it, you'll never stop the kid up in the fitted\nLive with it, somebody done fucked up\n\n[Method Man]\nLook, I'm cutting corners on these clowns, marijuana and pounds\nFound with Staten Island niggas that run up on you with rounds\nTake a drag, pass it around, guess who back in your town\nAnd the crowd vict', with Officer Brown patting him down\nShit's thick, thick as harmony grits, cuz with some thugs\nAin't no, harmony bitch, them niggas probably snitch\nY'all be the judge, look what happened to Cocheese\nWhat happens when your co-d's is talking to police, you dig?\nHalf a cig, let me fuck with ya wig, although you loving the style\nThey're ain't a pedophile could fuck with the kid\nNow that I'm back up on my, feet, take it back to the streets\nIn the GM with your BM, in the passenger seat\nRiding hood, by my hood, ain't no hike in the wood\nLife is good, it's so good, live it twice if I could\nMan, it's me, once again it's that Wu-Tang\nCrushing the shit that you bring, you know how we do things\n\n[Hook]\n\n[Method Man]\nYo, pulling my shoes up, scuffing my Timbs, back to when?\nPuffing again, who stunting, cops fucking with them\nFeeling the blow, goosebumping the skin, and on the scale\nOf nothing to ten, a ten, man, it's nothing to him\nSee you can tell by how I'm clutching my pen, like Mae Weather touching her chin\nShe stunting, going up in her friend\nTell the label give me something to spin, and every light got a price\nYou want a slice, but we ain't cutting you in\nMan, these fiends know my past work, held a monkey until they back hurt\nMoney talking, wonder what that's worth\nAnd MCF, mean Cash First shit, picture the kid\nOn the beach in Hawaii, minus the grass skirt\nBlast first, ask questions last\nBlack herse, nigga, stretch yo ass, y'all niggas know what this is\nIt's New Yitty, this ain't just a fad\nIt's M-E-F, and I ain't Biggie, but I'm just as Bad, Boy\n\n[Hook]\n\n[Outro: Method Man]\nYeah, Big M-E-F, Staten Island Advance, motherfuckers\nWord up, don't ever count me out, just count me the fuck in\nI'll be back for more...", "image": "https://images.genius.com/3ddccdf6d7612b941c3c9dfb5048829a.1000x1000x1.jpg"}], "artist": "Method Man"}