{"songs": [{"title": "Cocaine", "album": "The Perfect Storm", "year": "2010-11-09", "lyrics": "[Chorus]\nCocaine. Forget it by the quarter\nBring it by the pound, straight through the border\nCocaine. Bring it 'cross the water\nWhen it touch down, serve it on the corner\n\nThey taste it, they taste it they coming right back\nComing right back, yeah they coming right back\nYou taste it, you taste it, you coming right back\nComing right back yeah you coming right back fo' da\nCocaine\n\n[Verse 1: Twista]\nThis for them white girl movers\nBig dreams of making a million offa users\nCar and the money the same color of mucus\nGo get it his self they call 'em ghetto Frank Lucas\nCocaine. He got it by the boulder\nGot it by the bird and he got it by the quarter\nCocaine. So he keep one in the holster\nColombian connects, so they call him Lil' Sosa\nGotta try ta' catch the six o' clock morning rush\nI bet them niggas down the street ain't serving more than us\nThey look like 20's but I'm charging the customer 10\nThey give-aways just to lure a few customers in\nCocaine. That’s why its Bentley Coupe time\nDamn, them niggas tipping, look at the soup line\nAll day they be serving them 50 packs, came to the table and count about 50 stacks\n'Cos I know somebody who can come right over the border that be the reason why they get it right back\nAnd so they got...\n\n[Chorus]\nCocaine. Forget it by the quarter\nBring it by the pound, straight through the border\nCocaine. Bring it 'cross the water\nWhen it touch down, serve it on the corner\n\nThey taste it, they taste it they coming right back\nComing right back, yeah they coming right back\nYou taste it, you taste it, you coming right back\nComing right back yeah you coming right back fo' da\nCocaine\n\n[Verse 2: Twista]\nThis lil' nigga think he Pablo\nThe whole thing in the panel of the car door\nCocaine. And even though we from Chicago\nSome kinda way he can get that overseas cargo\nAnd if you stop the connection he got, then he has others\nTwins from Miami, I call 'em the Diaz brothers\nGot a killer squad, in the mob he the boss\nHow you want it? 'cos he got the hard and the soft\nCocaine. They call him Shawty Blanco\nJunior El Chapo, in that Murcielago\nCocaine. That right connection to them poppy seeds\n'Cos he know someone that'll go wherever poppy be\nCocaine. And no the knot don’t stop\n'Cos these niggas is go get it from the doc to the block\nAnd these tips gon' be open and these hypes gon be floating\nI don’t put too much on it, so it can stay potent, I got that...\n\n[Chorus]\nCocaine. Forget it by the quarter\nBring it by the pound, straight through the border\nCocaine. Bring it 'cross the water\nWhen it touch down, serve it on the corner\n\nThey taste it, they taste it they coming right back\nComing right back, yeah they coming right back\nYou taste it, you taste it, you coming right back\nComing right back yeah you coming right back fo' da\nCocaine\n\n[Verse 3: Yo Gotti]\n[?]\nY-O-G-O-TTI, fuck nigga play wit me get shot\nPow-pow-pow from a coupe to a drop BEEP\n(cocaine) big guap, nigga 18 bands will get 1008 grams of that block\nFresh up out the pot, I call it water whipped\nHit it with the soda make that dope do a karate flip\nFive turn to ten, now that’s a Maserati flip\n240 months, now that’s a whole lotta years\nM6 Camaro, now that’s a whole lotta gears\nHit him wit the choppa make his family shed alotta tears\nI'm a North Memphis nigga, we weighed everything\nSend them boys in Chi-town they like to gang bang\n[?] know the flo' do too, nigga, imagine what I been through\nShawty shot at niggas who, went to war wit me & my crew\nGotti them niggas ain't pimp like you, they ain't real like you, they ain't trill like you\nThey ain't selling no bricks, they ain't shot no pistol, niggas ain't on a song wit Twista\nHey...\nI'm Yo Gotti!\n\n[Chorus]\nCocaine. Forget it by the quarter\nBring it by the pound, straight through the border\nCocaine. Bring it 'cross the water\nWhen it touch down, serve it on the corner\n\nThey taste it, they taste it they coming right back\nComing right back, yeah they coming right back\nYou taste it, you taste it, you coming right back\nComing right back yeah you coming right back fo' da\nCocaine", "image": "https://images.genius.com/b1b74202bc3fa82e3dcce1439a67e984.500x500x1.jpg"}], "artist": "Twista"}