{"songs": [{"title": "Cold Hearted ll", "album": "Championships", "year": "2018-11-30", "lyrics": "[Intro: The Weeknd]\nWoah, don't you, baby, hey\nIt won't matter, baby\nDon't you know?\nDon't you know?\nWoah, don't you, baby, hey\nIt won't matter, baby\nDon't you know?\nDon't you know?\n\n[Verse]\nUh, make it out the hood, they say you Hollywood\nHow dare you niggas tell me that I got it good\nGotta check and treat these niggas like I'm Robin Hood\nWhen it was time to stand up for me, see, nobody stood\nAnd I was lookin' at you niggas, all the ones I fed\nHad me grindin' all them nights when you was going to bed\nAnd if you think I owe you something, nigga gon' ahead\nTreat you like I never knew you, put it on your head\nAnd I got Papi on my line like, 'When you comin' home?'\nMy mama see it in my face, she know that somethin' wrong\nBodies droppin' in my city all summer long\nOut on bail but I still gotta keep somethin' on\n'Cause I can't let 'em take my life, you might get left you make that right\nWhen he got left it wasn't right, but he was tryna live that life\nI call up Coon to book that jet, we like three deep, we take that flight\nUsed to land in California to play that studio all night, we stayin' down\nFor the love of them millions, ain't layin' down\nLeft you in the hood, what you sayin' now?\nAnd niggas wanted the smoke, you said, \"Stand down,\" uh\nCold heart, never get cold feet when the pressure come\nIt was beef, I had to tell niggas, \"You better come\"\nSister said they gettin' over, it's like you lettin' them\nSome shit I had to learn my lesson from, uh\nCheckin' in, checkin' out, I just had to check you out\n2012, it was 50 niggas when I'm steppin' out\nForgot the time you asked me for a check and I ain't lend it out\nI ain't even know you was upset, that's what this shit about?\nA green piece of paper can turn you to a hater\nWhen you can't bring up one time you returned me for a favor\nSo I pray these niggas real close, talkin' closer than my neighbors\n'Cause I know the signs when niggas switch sides, catch them vapors\n\n[Chorus]\nUsed to be my dawg, you was in my left titty\nScream, \"Ride or die,\" I thought you would ride with me\nFound out you was jealous, you wouldn't even grind with me\nAnd when I copped the 6 you wanted the 550\nUsed to be my dawg, you was in my left titty\nScream, \"Ride or die,\" I thought you would ride with me\nFound out you was jealous, you wouldn't even grind with me\nAnd when I copped the 6 you wanted the 550\n\n[Outro]\nSee, I look at it like this\nWhat I'm supposed to spend a thousand nights in the studio rappin' my lights out?\nGoin' city to city, can't take my son to school when I want to, can't see my mama, my family when I want to\nThey give a nigga my money, then act like he hangin' with me\nI ain't never been sweet\nFar as I can remember, every time I went to jail I had to stand up in that bitch by myself\nI ain't never even think about a nigga callin' my baby mama to pick my son up to take him to the movies\nGo play basketball while I'm doin' this time in the cell\nActin' like I owe you somethin'\nSee, it hurt my heart to see some of my closest friends turn their back on me about that attention needle\nOr a green piece of paper with a slave master on the front of that shit\nI used to hear niggas, niggas that I was feedin', I heard 'em whisperin', \"Meek Mill finished\"\nI was like, \"And damn, I was feedin' you, bro\"\nAll I did was keep grindin'\nThrough the storm, nigga, I'm like Derrick Rose on a 50-point night on a daily basis, nigga\nFor the love of the millions, royalty over loyalty, never get it confused\nI got real friends and family that'll never turn their back on me for the love of the money\nI got a homie that's doin' life—he can't offer me no money, he can't offer me nothin' but a friendship and a relationship\nI talk to him seven days a week\nSo don't come to me talkin' 'bout no money shit, nigga\nSo if you feel some type of way about my money, we goin' to the furthest extent to protect that plate that goes in front of my son on the table, nigga\nOne love to all my family and friends that stayed down through all the madness\nWhile I had to sacrifice and put it all on the line\nOne time for my mom and sister that never changed on me, even before I had money\nRide or die, no matter what\nDreamchasers for life, you dig?\nUh, I told niggas stop askin' me where niggas at\nIf you don't see 'em in the pictures with me, that mean they faded away\nI got niggas I distanced myself from, we love each other, it's all love but everybody can't make it\nNiggas wanna burn a bridge and expect you to send a yacht, huh? Where they do that at?", "image": "https://images.genius.com/74622f434a6e852420ea522d6aae36f1.1000x1000x1.jpg"}], "artist": "Meek Mill"}