{"songs": [{"title": "Woke Up", "album": "Life", "year": null, "lyrics": "[KRS-One]\nY'know\nThere's a difference between dreamin, and visualizin\nWhich one are you doin?\n\n[Verse 1]\nFood gone up, gasoline up\nFull-time employment passin me up\nBills pilin up, really this sucks\nI need a couple bucks, really I'm stuck\nHere comes a truck, pullin right up\nIt says Brinks, now I'm thinkin what's up\nBut nah, what I'm thinkin about, yo duck\n20 30 40 shots at the truck\nI'm duckin runnin jumpin lookin for what?\nSome cover for this brother, everything's nuts\nBut yo, I can see some others with gats\nBrinks firin, they firin back\nRat, ta-tat-ta-ta-tat-ta-ta, tat\nThen I woke up...\n\n[Verse 2]\nDoctor help me out, what's this all about\nWhat's this condition I gotta figure out\nAm I really out, that I really doubt\nGive me the remedy, what is the amount?\nWhatever you tellin me sellin me compellin me\nYo the light in me ain't out\nAnyway I enter cats remember\nKnowledge I sent ya forever they shout\nSouth Bronx, South Bronx\nSouth Bronx, South Bronx\nThen I woke up...\n\n[Verse 3]\nWell I guess I'm out on my own\nWith this condition it won't be long\nBefore for sure my little sanity's gone\nI'm livin off of nuttin, losin my home\nKids in the street, wife alone\nI want to sell this very microphone\nBut then my friend the light was shown\nIt came through my inner cellular phone\nGet up and get out my spirit will shout\nCommitment is what love is really about\nNo down and no out, just up and about\nI think I'm gonna take the spiritual route\nThen I woke up....\n\n[Verse 4]\nThen I realized I'm out of my purpose\nOut of my purp', not doin my work\nI went on a search, inside of myself\nFor true health, love awareness and wealth\nI went to the Temple and opened my mental\nI learned that I'm the cause of all that I been through\nYour whole environment is really within you\nReach inside your heart and write a new menu\nI'mma be the change that I want to see\nNow I can see, that I'm really free\nEverything is really always somethin else\nTell yourself a different story 'bout self\nDo you have the courage to be you\nAll that talk, that you talk, is it really you?\nOh silly you, oh silly me\nYour tongue is killin YOU, not killin me\nI'm feelin free, to be, just what I wanna be\nEasily, you see, cause I woke up...\n\n[Verse 5]\nWhen I woke up, my debt went down\nMy locks broke up, my rent went down\nMy stocks went up, my car sped up\nMy pockets swell up, my life I found\nI'm not so fed up it's time to get up\nA clear mind switched my life around\nNow I can see where the help is at\nThe health love awareness and wealth is at\nCause I woke up...\nCause I woke up! I woke up!\nWhen I woke up, I woke up\nThat's when I woke up\n\n[Outro]\nPlay that back", "image": "https://images.genius.com/12162bd5dc20dab4c0cbb67190522d80.500x493x1.jpg"}], "artist": "KRS-One"}