{"songs": [{"title": "Letter To Da Rap Game", "album": "T.R.U. REALigion", "year": "2011-11-01", "lyrics": "[Hook-2 Chainz]\nThis my letter to the rap game\nHip hop, I'm a product of the trap mane\nCrack came, I didn't know how to act mane\nI did what I had to do when the pack came\nThis is my letter to the rap game\nHip hop, I'm a product of the trap mane\nCrack came, I didn't know how to act mane\nI did what I had to do when the pack came\n\n[Verse 1: 2 Chainz]\nChef what's happenin', Ghost what's up\nWu Tang Clan, they ain't nothin to fuck, wait\n2 Chainz ain't nothing to fuck with\nNeed search warrants cause these niggas is suspects\nAll I talk is money so Chainz is the subject\n\n[Hook]\n\n[Verse 2: 2 Chainz]\nCame in this motherfucker hundred grand strong\nTwo to be exact, grinding the kush pact\nRide with the roof back, live with a suit act\nKilling em, so I am dying my suit black\nDear rap game, you are ill homie\nHavin me thinking we were gon' make some real money\nCame from the streets, I'm a beast, capiche?\nLike my dick in the mailbox when the bills come, oh!\nAnd hey rap game, the real comin'\nThe way I'm murking these niggas hope your will comin'\nAnd when you're numb, it's kind of hard to feel somethin'\nI'm the type to get rich and still hustle, yeah\nAnd before I leave let me say this, play this\nHave my niggas dead or in jail like Asics\nFace it, back to the basics\n2 Chainz on them bitches, looking like Vegas, the greatest\n\n[Hook]\n\n[Verse 3: Dolla Boy]\nMy worlds coming to an end, speaking philosophical\nSix's on the coupe, when they said it was impossible\nGot the type of guns to make the city feel uncomfortable\nAnd we breaking bricks down, till the last molecule\nCherish the horizon, sun blessed party, hey\nThinking 'bout this business, and it's time that I gave away\nTrying to make a plan today, niggas on there way\nLocked in confinement, gotta learn to levitate\nAnd on the inside, my instinct, I survive\nAll I got left is pride, touchdown, I'mma ride\nI was raised as a boss\nDamn, I let a nigga take me off\nAnd let him tell Josh that his pops was soft\nMothafucker\n\n[Hook]\n\n[Verse 4: Raekwon]\nRocking blood diamonds, cooling in the hood with the goonies\nGambling and scrambling, trying to buy us some guchi's\nIt's a movie made, regardless, my crooks is the hardest\nBuying crazy pots and pans, stay in apartments\nBank roll was all we ever needed\nWhile niggas was weeded, playing spades, and pumping crack in adidas\nJust fly young with heart, I sift in the park\nMade sales, blazed a few shells, yeah fuck who you are\nGuns on us, I make you cry like onions come through\nStay in your lane, peep the name and we done it\nI was legend yet, now my papar stretching, yeah, that's it\nGo ask the Rocky Glass, \"I class act?\"\nVillas, movie-making gorillas, the willas\nThe guest-star gun fights, squeeze on the squealers\nDon't come near me, nigga\nIf you don't got no money, fear me\nMatter fact, move it, ya hear me?", "image": "https://images.genius.com/c09ed4b9190576260459880172143b0f.1000x1000x1.jpg"}], "artist": "2 Chainz"}