{"songs": [{"title": "Amen (Dedication 4)", "album": "Dedication 4", "year": "2012-09-03", "lyrics": "[Verse 1: Lil Wanye]\nGangsta Grillz ya bastards!\nThere's a couple married bitches in the building: fucked them!\nI get that mouth I get that pussy:...The End\nI see you niggas got no life.. Sixth Sense\nShe said she wanna fuck my brains out\nBut she gon have to suck this dick first!\nPreach! Fucking right I'm geeked\nShe sat on my dick, she sat on my face\nI told that bitch she got good seats\nMan, these niggas softer than fleece\nShoot these niggas in they obliques\nYou talkin' shit, I knock you out, now go ahead and talk in your sleep\nBitch you know the motto!\nIt's Young Money over hoes\nLying to these bitches, they call my dick Pinnochio\nGettin' to the money, now the money getting to me\nShe say my vert-dick is hung like a jury\nI'm on the track: DOA\nSome of these niggas be DEA\nMoney tall: NBA\nBroke niggas: SMH\nHit it like Canseco\nWhile she say \"you No way Jose!\"\nI got an O of that white\nWhat you call that? OKKK!\nEvery night I go hard\nShe blow me like Boston George\nShe like it in her ass, mouth and pussy: 3 car garage!\nThese niggas is false alarms\nThey don't mean no fuckin harm\nHey baby let's make a porn!\nBa-bum! Devil horns\nYou know that I ain't got no ceilings!\nThe money changed me, I'm making chameleons\nOnly God can judge me, can't appeal it\nIn the name of the Father, Son, and Holy Spirit\nAmen! Tell them alphabet boys it's a \"G\" thing\nI've got a street sweeper.. do you need your street cleaned?\nYoung Money bitch! We colder than a ski team\nRed beam, if you scared, muthafucka go to church!\nPreach! Security breach\nI'm on that grass harder than cleats\nI'm on that gas, and y'all on E\nNigga my cash out of your reach\nI run shit like the reverend\nShe get on her knees and pray to this dick\nThen swallow all of them blessings\nChurch!\n\n[Verse 2: Boo]\nJust a way of life\nBought my mama a crib\nBought my daddy a car\nLet them both meet Tune\nNow they think I'm a star\nDamn I love this life wouldn't trade it for nothing\nMost theses rappers is falling cause they ain't standing for nothing\nI smoke that loud so I don't hear haters talking\nPlus these bitches be stalking trying look for a fortune\nIn the Chi we say church when the pussy gets purchase\nGot a bitch so bad she make a player get nervous\nNow good ain't good enough and my hood is hood as fuck\nI be praying for them shorties trynna get their dollars up\nSwag so dope you probably think I'm dealing\nAnd I only give head if baby girl swallow children\nBoo ain't got a ghost and bitches still be catch the holy ghost\nShe say she want to get high I hit her with that overdose\nPimpin' so cold put that on my overcoat\nOnly ride foreign\nWe don't do 100 spokes\nWhen broke niggas talk that's 100 jokes\nHa Laughing at you fuck boys\nSkate gear I'm a truck boy\nOn my truck right I don't give a fuck boy", "image": "https://images.genius.com/1cca3a7cb35e2d8b6baa82593cc9844d.525x525x1.jpg"}], "artist": "Lil Wayne"}