{"songs": [{"title": "Niggy Nuts", "album": "10", "year": "2002-10-15", "lyrics": "It's for the ghetto..\nFor the ghetto (uh) for the ghetto (yeah)\nIt's for the ghetto (uh) man it's for the ghetto (yeah)\nIt's for the ghetto (uh) it's for the ghetto (yeah)\nIt's for the ghetto (uh) man it's for the ghetto (yeah)\n\n[LL Cool J]\nLeanin dipped in rocks, pump the joint on the block\nBehind the Dolce Gabbana shades, peepin the spots\nFrostbit and I'm turnin blue, that's why I'm so hot\nPut the hustle down majorly and never get knocked\nWho can grind for this? Momma taught me to swerve\nRent the presidential suite out, snatch ya bird\nMy motto is dough or die, peace sign in the sky\nIn the brand new 'lectric blue Bentley ridin by\nHurt these clowns, anybody that want it\nLet you borrow my crown, tell me why would you flaunt it?\nDon't you know you can get it, have your wig-piece splitted\nMeth asked me to spit it, see my coupes is kitted\nAnd my minks is fitted, lyrically I'm sid-dick\nHoney frontin when you around, I always hit it\nThe boss is home, regulatin on chrome\nTell Russell it's line one, LL's on the phone\n\n[Hook]\nGet off my niggy niggy nuts! (ha ha, ha ha-hah ha)\n(ha-hah, ha-hah-ha, ha ha-hah) Get off my niggy niggy nuts!\n(ha ha, ha ha-hah ha)\n(ha-hah, ha-hah-ha, ha ha-hah) Get off my niggy niggy nuts!\n\n[LL Cool J]\nGet them niggy nuts, now here's wiggy what\nY'all need to do, when I come through, give it up\nPaper stackin, daddy get it crackin\nChains might be gold, the joints always platinum\n(And rims) always chrome (jeans) always pressed\n(Loot) always right (cut) always fresh\n(Gear) always dipped (honey) always bangin\n(You hot?) Always, my niggy nuts always hangin\nHold it down, rocks by the pound\nThe new 2002 b-boy sound\nHoes stand back, I'm shakin up the game\nYou shoulda never tried, to SLIDE in my lane\nGuaranteed-to-blow-the-block-up\nWhen-I-ease-this milky white drop up\nWanna bang ya, that's all you need to know\n50 deep in Summer Jam, I closed the show\n\n[Hook] w/ variations\n\n[LL Cool J]\nNuts, y'all, baby - stay flowin!\nHit Big B, tell him bring the Mo' in (bring it in)\nUhh - we rockin to the rhythm (all night baby)\nUncut raw, what we give 'em\nHell yes - bounce to the music! (bounce)\nWhen the joint come on, everybody lose it\n(This year) leave the bar, hit the floor\nRepresent, let these clowns know who you are\nWhen it's bangin like this, why stop? (Why stop?)\nAsk me why I pop Cris', why not? (Why not?)\nThe flow of the century\nGot your Belve splashin to the melody, what you tellin me?\nThis is fresh - 'til the day I die\nLeavin momma with a tear in her eye\nYou was frontin for a minute, now what?\nYou snapped when the joint dropped\n\n[Hook] - repeat 2X\n\n{Neptunes ad lib for a bit}", "image": "https://images.genius.com/4f8b990045f8d7f5532831376c6d5cbc.500x500x1.jpg"}], "artist": "LL Cool J"}