{"songs": [{"title": "Mansion", "album": "Along Came Joyner", "year": "2015-04-05", "lyrics": "[​​​Chorus]​​​\nAnd what the fuck do I gotta do go to and buy me a mansion? (Huh?)\nFuck is this? (Fuck is this?)\nI wasn't supposed to be broke for this long damnit (What a bitch)\nAnd my manager told me, \"Nigga, you gon' be rich\" (Nigga, you gon' be rich)\n\n[​​​Verse 1]\nThat was last year\nNow I'm living in the ghetto with the crackheads\nWorking at McDonald's as a goddamn cashier\nAin't this a bitch? (Ain't this a bitch?)\nLiquor got me lightheaded (Yeah)\nSippin' to the light red and\nI ain't go to college, I ain't good at nothing else\nSo if this don't work out then I wonder where my life headed\nI ain't got shit\nTired of being stranded\nGotta go and get it\nLiving in hell, that's a heaven full of bitches\nAnd I'm scared to fall in love but I never will admit it\nShit, I never could'a did it (never)\nPoint me to the door, I gotta leave\nReal cocky to them hoes that say hi to me\nLike I'm the best thing you heard\nBitch don't lie to me, don't you lie to me\nI tried to play the lottery\nMaybe I can hit the Powerball\nCop 50 fly cars, and then drive them all\nJust so I can feel like a rich nigga got it all (This nigga got it all)\nBitch you ain't shit, and these broads ain't loyal\nHoes won't relate but these songs ain't for you\n\n[Pre-Chorus]\nAnd the game ain't the same, so along came Joyner\nStanding around like you don't get the fuckin' picture\nLet me paint it for you, I ain't playin' witchu\nWaiting for the Illuminati just so I can get a check\nHere's my soul let me trade it to you\n\n[Chorus]\n'Cause what the fuck do I gotta do to go and buy me a mansion? (Huh)\nFuck is this? (Fuck is this?)\nI wasn't supposed to be broke for this long, goddamnit (Shit)\nWhat a bitch (What a bitch)\nI said my manager told me, \"Nigga, you gon' be rich\" (Said you gon' be rich)\nYeah right, I need a mansion on the water\nAnd a yacht for my momma\nThrowing party while we're bumping Barry White\nNigga, I just want a mansion (Look where he's from, I'm tired of this man)\nI just want a mansion (I can't eat, I'm broke nigga, I'm broke, and you got the power to change that)\n\n[Verse 2]\nYo, what the fuck do I gotta do to go and buy me a mansion? (Huh?)\nFuck is this? (Fuck is this?)\nI wasn't supposed to be broke for this long, goddamnit (What the fuck?)\nWhat a bitch (What a bitch)\nAnd my manager told me, \"Joyner, you gon' be rich\" (Nigga, you gon' be rich)\nA year later, now I'm living in the ghetto with the haters\nWorking at Denny's as a motherfucking waiter, nigga\nAin't this a bitch? (Ain't this a bitch?)\nLiquor got me lightheaded\nSippin' to the light red and\nI ain't really got no damn back up plan\nSo if this don't work out, then I wonder where my life headed\nI ain't got shit (I ain't got shit)\nTired of being broke, gotta get it all, plus a nigga need drawers\nGotta hit the mall\nAin't no cameras in the stores so I bend the law (I gotta bend the law)\nPoint me to the door (Yeah)\nI'm winning now\nYeah, I'm tryna get some head\nBitch, it's been a while\nAnd don't be acting brand new cause your friends around ('Cause your friends around)\nI'm tryna hit the lotto, thirty million and deposit all\nCop a mansion with a safe and I hide it all\nJust so I can feel like a rich nigga got it all\nThis nigga got it all, it's all paranoia, I got a call from my lawyer\nI should've went to prison but the bars ain't for ya\n\n[Pre-Chorus]\nAnd the game ain't the same, so along came Joyner\nStanding around like you don't get the fucking picture\nLet me paint it for you, I ain't playing with you\nAwaiting for Illuminati just so I can get a break\nHere's my soul, let me trade it to you\n\n[Chorus]\n'Cause what the fuck do I gotta do to go and buy me a mansion? (Huh?)\nFuck is this? (Fuck is this?)\nI wasn't supposed to be broke for this long, goddamnit (Shit)\nWhat a bitch (What a bitch)\nI said my manager told me, \"Nigga, you gon' be rich\" (Nigga, you gon' be rich)\nYeah right, I need a mansion on the water\nAnd a yacht for my momma\nThrowing party while we're bumping Barry White\nNigga, I just want a mansion (You can have this shit, man, you can have the whole thing, I don't want it, I don't want none of this)\nI just want a mansion (I'm up here, losing my damn mind, running up and down the streets for us)", "image": "https://images.genius.com/e0f1ef72a727167faed7990bf3663ea4.800x800x1.jpg"}], "artist": "Joyner Lucas"}