{"songs": [{"title": "Ill Mind of Hopsin 8", "album": "Ill Mind of Hopsin Saga", "year": "2016-03-08", "lyrics": "[Verse 1]\nNigga, what the fuck? (What the fuck?)\nHomie, I made you rich, paid your rent (Damn right!)\nBitin' the hand that was feedin' you\nThis shit don't make any sense\nNigga, what the fuck? (What the fuck?)\nYou know this is that real shit\nHow you gon' forget who built this? (Huh?)\nI'm the one who made the company all the millions\nNow you got problems to deal with\nMan, this is tough luck, see a couple weeks ago we was buds\nAnd the crew that was killin' shit was us\n'Til you turned on me, homie, that's fucked up\nI ain't keepin' this shit on the hush, hush\nOn my chest I just carry too much stuff\nI done had it, enough is enough, bruh\nPlus I needed somethin' to get my buzz up\nYou done fucked with the wrong dude\nAin't no tellin' what Hopsin is gon' do, creepin' up on you\nQuit your sleepin', I told you\nThis a mothafuckin' journey we finna go through\nIf I ain't have so much to lose\nI swear to God I'd probably beat up and choke you (Damn!)\nNigga, this is that raw shit (Right?)\nThat organic flow you probably see up in Whole Foods\nShiver me timbers, something's fishy 'bout you, Mr. D Ritter\nWhen I told you that I wanted new management\nWhy the fuck you throw a fit and seem bitter?\nWhy you catch an attitude whenever I question you\nAbout all my fuckin' percentages?\nI know why (Why?), you've been bendin' it\nIn your benefit—your honor, I'm innocent!\nThis nigga crazy, I'm tellin' all of my people (You tell 'em!)\nHe takin' all of my C-Notes (It's true)\nSee, he has a gamblin' issue\nHe takes the cash and blows it all at casinos (Damn!)\nUh-oh, when I bring up my royalties\nYou start avoidin' me, that's some disloyalty\nYou woke up the evil boy in me, your ass is poisoning\nTell me why you would destroy FV?\nThis was a fuckin' vision that I had created with your brother\nBut you too infatuated with the money\nYou killed it and ran it straight into the gutter\nNow I think, \"Why'd I make D—A—M—E the boss?\"\nYou keep pissin' a whole lot of people off\nOur whole label came out with a weak result\nYou on that same bullshit Tomica brought\n\n[Chorus]\nNigga, I don't know what you thought\nYou think I can’t see the blood on the walls?\nBlood on the walls, that ain't goin' down, nigga\nI don't know what you thought\nI can clearly see the blood on the wall\nBlood on the walls, that ain't goin' down, nigga\nAin’t got time for your bullshit\nEverybody knows you be on it\nAin’t got time for your bullshit\nEverybody knows you be on it\nAin’t got time for your bullshit\nEverybody knows you be on it\nAin’t got time for your bullshit\n\n[Interlude]\nHold up! Hold up!\nI got some more shit to say, yo\n\n[Verse 2]\nIt’s supposed to be Funk Volume, isn’t it?\nThought it was music above all the business\nBut you just said: \"Fuck all you niggas!\"\nYou tarnished the brand\nAnd you started a Funk Volume Fitness?\nCome on now, really think\nGot us portrayin' somethin' we really ain’t\nHow we supposed to be ill\nWhen you on our website with a Shake weight\nTryna be Billy Blanks—nigga, thanks!\nFool, ain’t nobody tryna lift weights\nWe just wanna hit up the studio and just rap and do shows\nBut you don’t understand the culture of hip-hop\nYou a lame-ass nigga, Dame, half the crew knows\nNew-Age Jerry Heller, a scary fella\nI hate your fuckin' name, every letter\nI’m very fed up, you actin' like an ordinary heffa\nI’ma take you to the mortuary dress-up\nWe gave you our trust, then you had us cornered\nYou got us a shitty label deal with Warner\nAnd if I confront you about it\nYou tell me I need counsellin' and I got a disorder\nYou sent me on tour and it’s horror\nShitty hotels, no sleep, with no food to order\nMeet and greets every single day, it’s torture\nHow you expectin' an A1 performer?\nEvery time something’s wrong it’s the same thing (What?)\nBlah-blah-blah-blah, you just blame me (Damn!)\nThen you tell Brooklyn and Jammie (Damn!)\nNow they both thinkin' I’m crazy (Damn!)\nI deal with this on the daily (Damn!)\nMy career mentally rapes me (Damn!)\nI won’t let this nigga break me\nHe prayin' Dizzy Wright is gon’ replace me, shady\n\n[Verse 3]\nWhat are your fuckin' motives, Dame? Let’s talk about it!\nUmm, you’re our manager, our label-owner, our accountant\nHmm, that’s kinda tricky\nSomething is fishy, that’s risky\nWe just don’t even know\nWe go with the flow while you rowin’ the boat\nYou keepin' us simple-minded\n'Cause you knowin’ our only concern is just hopin’ we blow\nSo, when all the money come in from our album and tours\nYou sit there and soak in the dough\nWhen did we ever ask about the gross?\nWhen did we ever ask about the net?\nYou would just hand us money from our shows\n'Cause you knew we wasn’t questionin' the checks\nNigga, I trusted you with my life\nYou upped your percentage so I’m makin' less?!\nFuck you, bitch, you get no respect!\nThis is why Hop is comin' for your neck (Bless!)\nAll you care about is makin' money\nYou don’t care about a fuckin' soul though\nYou just fluctuate our dollars up and down\nAt your convenience like a fuckin' pogo\nYou been screwin’ everybody on the label on the low\nAnd they don’t even know though\nSo, good luck, Jarren, Dizzy, Hoppa, SwizZz, I’m goin' solo\n\n[Chorus]\nNigga, I don't know what you thought\nYou think I can’t see the blood on the walls?\nBlood on the walls, that ain't goin' down, nigga\nI don't know what you thought\nI can clearly see the blood on the wall\nBlood on the walls, that ain't goin' down, nigga\nAin’t got time for your bullshit\nEverybody knows you be on it\nAin’t got time for your bullshit\nEverybody knows you be on it\nAin’t got time for your bullshit\nEverybody knows you be on it\nAin’t got time for your bullshit\n\n[Spoken Outro: Joel Osteen]\nChange is one of the most difficult things that we face. But change is inevitable. One reason we don’t like change is we get comfortable where we are. We get used to our friends, our job, the place we live. And even if it’s not perfect we accept it, because it’s familiar. And what happens is, because we’re not willing to change, we get stuck in what God used to do, instead of moving forward into what God is about to do. Just because God’s blessed you where you are doesn’t mean you can just sit back and settle there. You have to stay open to what God is doing now. What worked five years ago may not work today. If you’re going to be successful, you have to be willing to change. Every blessing is not supposed to be permanent, every provision is not supposed to last forever. We should constantly evaluate our friendships. Who’s speaking into your life? Who are you depending on? Make sure they're not dragging you down, limiting you from blossoming. Everybody is not supposed to be in our life forever. If you don't get rid of the wrong friends, you will never meet the right friends", "image": "https://images.genius.com/f82de3014729a2e050d1a720e25e7ca1.600x600x1.jpg"}], "artist": "Hopsin"}