{"songs": [{"title": "Mind Of A Bad Boy/Real Bad Boyz (Westside)", "album": "Hitworks", "year": null, "lyrics": "[Verse 1: Dee Tha Mad Bitch]\nWhat goes on in the mind of a bad boy? Nothin' but payback\nWho's next, the clip, callin' murder conducting the contract\nBetter watch your back\nSince he's makin' that comeback\nThe 1-87 will stop 'em\nThe hollow point, will drop ya\nGo on, here's a scene for your soul\nSo take heed when you meet face-to-face, here comes the grim reaper\nYou best to profit from the depths of hell\nHe's a real McCoy\nBut ain't no stoppin' this girl is bad boy\nHe ain't no joke\nMuthafucka grab your throat\nBefore you find yourself cut with a blade\nAs your bloody body lays on top of cement\nIn front of your president\nIt was a murder for hire\nHit an innocent child in the crossfire\nNow he's confined to a jail\nGot shot six times, in his spine\nBut his mind is still down at the grind\nHe's willin' to destroy\nThat's what he lives for, to be a bad boy\n\n[Chorus]\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? We're comin' after you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\n\n[Verse 2: 2Pac]\nI got these bustas on my block and they after me\nRunnin' 'round tellin' these niggas, how they gon' capture me\nIt's gettin' crazy, it's hard to make my mind up\nNow should I, buck 'em down, or put my nine up?\nYou see, I ain't a bad boy, just a boy who had it bad\nI graduated from 22's to 3-57 mags\nRunnin' on these marks 'fore they stashin'\nI ain't askin', give it up, or get to blastin'\nThe penitentiary don't scare me\nA straight thug nigga, the whole set'll take care of me\nAnd tell me, who the fuck you gon' find\nRough enough to tear these bitch-niggas, this is mine\nNow busta, meet my nine, 24 on the grind\nI'm sick about mine, and uh, ain't nothin' wrong with gettin' high\nA hustlin'-ass nigga from the projects, I'm makin' loot\nAnd screamin' Thug Life, nigga, when I shoot\nThey made me\n\n[Chorus]\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? We're comin' after you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\n\n[Verse 3: Dee Tha Mad Bitch]\nNow how many bad boys in the house\nSo hurry boys got the bigger nuts\nWhat the fuck, I gave 'em the blunts\nHavin' a grudge against the whole fuckin' world\nA 16 shot-block-Glock, that'll stop 'em\nThey're sure to hit the ground\nNothin', bustin' a cap on no more every round\nA bad boy is the big, shot on the block\nHe got knots, bigger rocks for the cops\nBefore he gets props\nSo you petty boys, you can't fuck with 'em\nYou can eat the biggest good friend\nOr become a victim of a dead man\nIt's sad to see, when you end up six-feet deep\nSo rest in peace, muthafucka, join the pow\nHe got nothin' but the realest style\nFlavors when on the mic\nAnd packin' the meal like life\nSavers, sweep up on you at night\nHis grip on tight, and make you take a bite\nThat's all she wrote, barrel went down your throat\nKillin' off these niggas for fun\nMurder one, and throw away your gun\nHe's livin' his life like a soldier\nThat's what he lives for, to be a Bad Boy\n\n[Chorus]\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we're comin' after you\n\n[Outro]\n[?]", "image": "https://images.genius.com/91b79840c88a5ee60f440dbc7779b753.500x500x1.jpg"}], "artist": "2Pac"}