{"songs": [{"title": "DEATHCAMP", "album": "Cherry Bomb", "year": "2015-04-09", "lyrics": "[Produced by: Tyler, The Creator]\n\n[Verse: Tyler, The Creator]\nUm, excuse me mister, but can you please turn down the lights?\nI don't really like all these cameras, man\nAnd this shit just don't feel right\nAnd I don't really wanna be rude to you, sir\nBut fuck you mean I can't wear my hat in here?\nAnd you got me fucked up, if you think I care, nigga\nI hope you little niggas is listening\nThem Golf Boys is in this bitch like an infant\nThe blind niggas used to make fun of my vision\nAnd now I pay a mortage and they stuck with tuition\nSo special, the teacher asked if I was autistic\nAnd now I'm making plates, you just washing the dishes\nSo if you don't mind, get the fuck out of my kitchen\nBut keep your ego there so I can butt fuck your opinion\nBut in the meantime, brainwashing millions of minions\nLeader of the new school? (Ha, I'm in my own school)\nAnd you would never catch me in none of their fucking shin-digs\nI hope you fucking niggas is angry, pissed, and offended\nIn Search Of... did more for me than Illmatic\nThat's when I realized we ain't cut from the same fabric\nI made my own shit, you went out and bought yours\nMan, I got too much drive, motherfucker, I hate traffic\nLa-di-da-di, I'm going harder\nThan coming out the closet to conservative Christian fathers\nWhen it's a lot at stake carne asada let's be honest, I'm really morphing\nNamed the album \"Cherry Bomb\" because \"Greatest Hits\" sounded boring\nI don't like to follow the rules\nShe said that I must, I don't have any armpits\nShe wanted to talk; \"Who's in charge of this Golf shit?\"\nI said \"Howdy do? How are you? I'm the sergeant\nAnd who I are isn't really important\nMy heart is as dark as a window with car tint\nSo hop in with your friends, gal and I'll unpark it\nAnd I'll do donuts until the fat one is carsick.\"\nIt's young T\n\n[Bridge]\nI don't like to follow the rules\nAnd that's just who I am\nI hope you understand\nAnd I don't really think y'all cool\nSo give yourself a hand\nNo, no, give yourself a hand\nBetter pose for that camera\nBetter pose, boy you better pose\nAnd it's your life nigga I suppose\nFor the lights, for the camera, and the action\nNow your face is meltin' from the flash of the big ol' lights\nNigga you ask for this life\n\n[Outro]\nWelcome to death camp\nYeah, welcome to death camp\nYeah, welcome to death camp\nKissing on my bean bag\nYour lips high-five my tongue\nAnd my fingers moonwalk through your hair\n(For the lights, and the camera, and the action)\nThis is fun I can tell\nI don't know if you'll handle it well\nWelcome to hell camp\n(Lights, and the camera, and the action)\nYou should be mine in a way tonight\n(For the lights, and the camera, and the action)", "image": "https://images.genius.com/d363c1a1794946fc7054c2d292e6abcf.640x640x1.jpg"}], "artist": "Tyler, The Creator"}