{"songs": [{"title": "Tim Westwood Freestyle", "album": null, "year": "2012-07-09", "lyrics": "[Verse 1]\nNew shit alert! New clothes\nGot a new whip, homie I got two of those\nGot some green, homie we got UFO's\nWe the new chick, Royalty man, you ain't know?\nSomebody tell 'em we ain't never going nowhere\nMr. CEO, I give a fuck about a co-chair\nHe fly, no fair, tell 'em how we did it, though\nDroppin' with the hottest shit, no time to do the video\nATL is my city, though, East Side bitch\nGetting Cortez at Stonecrest, I'm East Side rich\nBut my old girl Laconia, my house California\nYou ain't heard the news? D-Money back on ya\nNiggas wanna network, cause I'm the only rapper with his face on a network\nFuckin' check my net worth tell 'em what the check's worth\nGo and let 'em know\nTouch down and I leave your city tore up\nThen I'm coming home to my girls on the tour bus\nBut then I'm gone again, more shows, more bucks\nTen times your cut, bein' broke sure sucks\nOpportunity, I've never seen a door shut\nGet it for my fam so my daddy ain't a Warbuck\nSummer coming so I hit 'em with the warm up\nBallin' in my sweat suit, I'm tryin' to get my form up\nI ain't think we was ballin' 'til private jets to New Orleans\nMy girlfriend on and on 'em, caught 'em fallin' like Autumn\nGod damnit, yeah get up on it yeah man the truth hurts\nThink fast, shoot first, beast like blue fur\nAll we do is do this, yeah\n\n[Break]\nAy, ay\nChildish Gambino\nHere we go, Harry Fraud\nYo we got a shout out for him\nYo\n\n[Verse 2]\nJesus, he's still around? That makes two of us\nRappers who fuckin' hate me still wanna stop my tour bus\nRappers who call me gimmick still post me and troll the comments\n20 shots of that honesty, I'm tryin' to control the vomit\nUgh, nauseum, eat a dick, all of 'em\n'Bino does it feel good? Is East Side still hood?\nHaters never mutual, boy that's for your man's sake\nI don't see it like a Pusha-T and Wayne handshake\nPop or flop mobsters, we ain't do neither\nWhy these dudes want a mixtape, Shaq Diesel?\nThe truth is what you make it and lately, it's hard to find\nWill they remember \"Heartbeat\" like it was \"Party All the Time\"?\nI know, I know, I know, it's that run it back\nI just rocked 10K, where my hundred at?\nMy homie reppin' K.Flay at the Summer Jam\nAnd they show me love somethin' serious\nAnd I was just a kid, man, I ain't think they hearin' us\nAnd Mase shook my hand and I'm shook\nCause my man still with Biggie and Gambino just a fan\nI'mma tell you something true\nIf you ain't got a bunch of haters, man, then you ain't doing you\nAnd this fake fuckin' rappers wanna fire shots for no reason\nI could've helped you, but fuck it, I'm callin' open season\nThis ain't subliminal, I'm comin' right at you\nBut no one knows who you are, so I'm rapping at fuckin' statues\nYou gassed cause you got a meetin'? Crew is a never heard of you\nYour drive is a learner's permit, your beef is a veggie burger\nVerbal murder? Nah, we just tell what the truth homie\nI'm with my girl in Spain, what are you doing?\nFuck it boy, we don't get enough joy\nWatchin' everyone I know makin' major bok choy\nRoyalty, only two of us are fuckin' rappers\nAnother runs Wordpress, another does Apple\nAnother's DT and drinkin', talkin', on that cheddar\nYou wonder who we are, that means you already met us\nI'm everywhere nigga, I don't need the fuckin' throne\nI don't need Illuminati, I could fucking start my own\n\n[Outro]\nCause I'm Childish, Childish, Childish\nChildish Gambino\nWestwood, Westwood, so its all good\nYo Childish Gambino, East Side let 'em know", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}