{"songs": [{"title": "“pie” (Feat. The Rock)", "album": null, "year": null, "lyrics": "You know, The Rock's gonna tell you a little story\nYou ain't gonna believe it, but he's gonna tell you anyway\nIt's tough to be the Rock!\nOh no, no, shut your mouth! No, no, it really is\nEven though The Rock is...\nThe Rock is the most electrifying man in all of show biz!\nYou see, when the Rock gets too much...\nToo much of the fame and all the bright lights...\nHe likes to kick back and have a slice of that unadulterated delight!\n\nDing!\nSlick Rick: Welcome to Rick's Bakery, can I help...\nWait a minute... Aren't you the famous Rock?\nThe Rock: Yeah, The rock, the people's champ in the house\nWhat's happening, Slick?\nSlick Rick: Hey, how're you doing, guy?\nLook, you gotta take a picture with me before you leave, guy\nThe Rock: Whoa, whoa, The Rock doesn't want to take pictures\nThe Rock just wants a piece of pie\n\nYou got any of that in this bakery?\nSlick Rick: Oh, I got every pie you can think of\nI've of strawberry pie, blueberry pie, apple pie...\nThe Rock: Blueberry? What? Oh, no, no, whoa, whoa\nActually, Slick, it doesn't matter what type of pie you have\nLet The Rock tell you a little story about pie...\n\nDriving down South, though quickly aroused\nWhen my car caught a flat near this old farm house\nI hope somebody's home, takin' a chance at it\nKnocked on the door, and this fine chick answered\n(You're The Rock!) Can I use your phone?\n(I'm shakin, sure, if you try some of this pie I'm makin')\nDaisy duke shorts on, five foot stood\nSaid, \"sure, what the heck, I mean it did smell good.\"\n(So she called Rock to the kitchen, towards the vapor)\nThere's her grandmother, aunt, and a Chinese neighbor?\n\nWell, The Rock is gonna tell you again\nYou see, it's tough to be The Rock!\nYeah, The Rock knows, that might sound crass\nOh, and by the way...\nAll you jabronis in the locker room...\nYou can all come kiss The Rock's ass!\n'Cause you know after The Rock lays the smackdown\nOn some big, fat, ugly hermaphrodite!\nThe Rock needs a little distraction...\nAnd a slice sounds just right!\n\nThe Rock said \"thanks ladies\", and more kind words\nGrandmother said, \"Be polite, eat mine first.\"\nSo I sat down, tried her's, she looked quite glad\nHad a strange tasting mold, but it wasn't so bad\nThat's right, The Rock having pie in the country\nDevoured her's, her aunt's, and still I was hungry\n\"That's all?\" Rock said\nBored and reading the paper\n'til finally, a plate of the next door neighbors\nDogged it down fast, 'cause it really did please\nI mean it tasted so good, Rock was talkin' Chinese!\n[Rock shouts incoherent \"Chinese\" words] That good pie!\nSlick Rick: Oh, that's the pie you was talkin about!\n\nOh yeah, The Rock knows the millions can smell it now!\nIt's tough to be The Rock!\nNo, no, no, no, it really is\nBecause you all know, The Rock is the most...\nElectrifying man in all of showbiz!\nYou see when The Rock gets too much... Too much of the fame...\nAnd all the bright lights\nHe loves to kick back and have a slice...\nNo, no, no, no, no, The Rock is gonna eat the whole damn pie!", "image": "https://images.genius.com/c919a00200647c646c275a32d9d66956.750x750x1.jpg"}], "artist": "Slick Rick"}