{"songs": [{"title": "Ill Mind of Hopsin 5", "album": "Ill Mind of Hopsin Saga", "year": "2012-07-18", "lyrics": "[Verse 1]\nMan, I hate rap, but if the shoe fits, wear it\nI've become a freak of nature all the kids stare at\nWho walk around bumpin' Raw with the shit blarin'\nSaying \"Fuck school!\" and droppin' out like a miscarriage\nI'm embarrassed and I'm ashamed\nI played a part in this devilish game\nMakin' your common sense perish\nBut I ain't takin' the full blame\n'Cause most of you chumps runnin' around here ain't never had strict parents\nAll of your brain cells rottin' from weed\nYou feelin' like if you ain't got it, life's not as complete\nYou havin' sex with every-motherfuckin'-body you see\nWith a past so dark that Satan'd jump out of his seat\nBut still you out in these streets, thinkin' you hot as can be\nWithout the knowledge to lead, so you just follow the sheep\nMakin' sure your lame swag is all polished and clean\nWhile your favorite rapper's like, \"Yeah, he got it from me\"\nYou been brainwashed by a fake life that you're used to livin'\nWhen I say the word \"fun,\" what do you envision?\nProbably drinkin' and smokin' out with your crew and chillin'\nWith clueless women you tryin' to bang, bumpin' New Edition\nIs that all you think life really is?\nWell, if so, then you're a fuckin' idiot\nI honestly feel like grabbing your head and hitting it\nMatter of fact, you don't even deserve a brain — give me it!\nDo you even have any goals\nAside from baggin' these hoes and packin' a bowl?\nWell, let me guess — no\nYou're only in school because your parents make you go\nWhen all you do is play beer pong and hang out with the bros\nYo, society's got you livin' for a whack cause\nYou're a fuckin' adult with no skills at all\nYou don't read any books or play ball\nYou don't draw — you literally do nothing at all!\nStill you fiend for the glamorous fruits\nYou don't have, 'cause you idolize rappers that do\nAnd all they say is, \"I got money and it's stacked to the roof\"\nAnd now you think that it's gon' magically just happen to you?\nHow? Your lazy ass don't commit to labor\nYou pick somethin' up, try it out, and put it down two minutes later\nThen you complain about your life 'cause it ain't gettin' catered\nNow whoever tries to call you on your bullshit's a hater?\nYou wanna succeed, you have to try; or one day you'll get older\nAnd regret it all 'cause you can't provide\nYour friends are lowlives, don't act surprised\nLook, just cut the bad fruit off of the tree, make the sacrifice\n\n[Verse 2]\nGirls, stop actin' like you want a guy\nWith traits like Romeo — bitch, that's a fuckin' lie!\nYou always talk about how every man's fake and you can't take it\nAnd you want somethin' real — shut up, tramp, save it!\nTwice a week you put on your makeup and damn bracelets\nAnd head to the club half-naked with your ass shakin'\nPullin' a lowlife nigga who claim he cash-makin'\n'Til you let him hit and find out he work at the gas station\nOne of them niggas got you pregnant and you can't raise it\nBut you caused it, your actions made a fat statement\nYou want Romeo, then act patient\nAnd stop frontin' like he in the club posted in the back waitin'\nIt's the club, where guys put on a new persona\nAfter they get loaded with a few Corona's\nThey always shoutin' and wild out\nWith habits that very few condone of\nThen they look for beautiful brainless bitches like you to bone 'em\nThen when they leave you, you cry and cry\nTalkin' about, \"Oh my god, I can't find a guy!\nI've spent so many years and I've tried and tried!\nWhy am I even on Earth? I should die!\"\nYou want Romeo, you're not worthy\nYou're cock-thirsty, you're nasty and probably got herpes\nSometimes the secret to findin' is to stop searchin'\nTry a new formula, 'cause your last one's not workin'\n\n[Verse 3]\nThe term \"real nigga\" is publicly used\nAnd I need to know what it means, 'cause I'm fuckin' confused\nAre you one for always bustin' your tool\nWith nothin' to lose and somethin' to prove\nTo homies up in your crew?\nIs it because you're sellin' drugs to get loot\nAnd brag about how you done been shot and stabbed\nLike it's fun to be you?\nBut your life's a struggle, right, and you just hustlin' through?\nNah, you hamster-ass nigga, you just stuck in a loop\nMan, why do black people gotta be the only ones who can't evolve?\n'Cause you in the streets actin' like a neanderthal\nIt's clear you can't stand the law\nYou're lost as an abandoned dog\nAnd all you're interested in is fightin', rappin' and basketball\nI can't even fuck with you\n'Cause if we out in public, you gon' get caught stealin' some shit, and get my ass in trouble, too\nYou'll get old and be nothin'\nLivin' life in these streets, thuggin'\nAnd starting shit with anybody mean-muggin'\nLook at you, a real nigga, thinkin' your life's cool\nGirls used to turn me down for guys who were like you\n'Til you grab their heart and shove a spearhead right through\nThen they regret it because it wasn't the right move\nYour \"real nigga\" talk seems bogus\nA real nigga don't brag about being real as long as he knows it\nAnd his future doesn't seem hopeless\nA real nigga stays out of jail, handles shit and he keeps focused\n\n[Verse 4]\nTo all you rappers whose soul is out in the wrong\nYou inspired the issue I wrote about in this song\nYou go to prowl on the young who roam around in the slums\nSee, this is what happens when rap's overcrowded with bums\nHope the hour is long when I'm rollin' out with your tongue\nThe man above is my guide, you know the power is strong\nAll you menacin' freaks are only in it for cheese\nAnd the mass-control limit was breached — fuck hip-hop!\nThey only in it for cheese, and any eyewitness can see\nThey purposely makin' the innocent weak\nMy existence on this planet's for you, I ain't only here to benefit me\nYo, we need to make a change while there's still time\nIt is hard, and sometimes I struggle tryin' to reveal mine\nI can guide you if you feel blind\nI just need you to be willin' to journey into my ill mind", "image": "https://images.rapgenius.com/1b25d508104ab31ee5039d11dd849f48.600x600x1.jpg"}], "artist": "Hopsin"}