{"songs": [{"title": "Till Hell Freezes Over", "album": "Detroit Underground 2000 Volume II", "year": null, "lyrics": "[Intro]\nYo yo yo yo yo (this is)\nThis is my motherfuckin' anthem (hip-hop)\nTo hip-hop music (anthem)\n'Cause I'ma keep doin' hip-hop music\nUntil the day that I die (Until the motherfuckin' day that I die)\nAight, bitch?\n\n[Verse 1]\nYo, I'm into voodoo, tarot cards and Ouija boards\nLightin' candles campin' out at haunted beach resorts\nI write the dark shit, and rap about perverted violence\nGhost stories of people murdered on deserted islands\nDressed in jean shorts, high tops and tube socks\nHoldin' a rifle, with a life full of drama like 2Pac's\nJumpin' off rooftops drunk after I do shots\nLandin' in someone's backyard gettin' chewed up by two rots\nI got a new watch and two rings with huge rocks\nThis rap shit got cash comin' out the blue like nude cops\nI use to sell pizzas, now I got twelve visas\nSo tell Jesus that I'ma quit sinnin' when hell freezes\n\n[Hook]\nThat's why my brain is out of order\nThat's probably why my nights are gettin' colder and my days seem shorter\nBut as the world turns and I keep growin' older\nI'll be livin' this hip-hop till hell freezes over\nBitch, till hell freezes over\nI'll be livin' this hip-hop till hell freezes over\nAnd as the world turns and I keep growin' older\nI'll be livin' this hip-hop till hell freezes (over)\n\n[Verse 2]\nYo, I used to be too heavy in that cruising Gratiot crap\nI think I fucked my head up listenin' to acid rap\nI go to parties bumpin' Nasty Nas's new song\nAnd smoke pot 'til I get high and stare at shit for too long\nLike this weed is laced, ain't it? It tastes tainted\nThe whole place fainted, I woke up with my face painted\nSpaced out like Sci-Fi TV, \"Fuck ICP, buy my CD!\" (Yeah)\nThat's what I'm screamin' while I'm handin' out promo tapes of my debut\nTellin' bitches, \"Let me eat your pussy while I shave you!\"\nAin't no shame in my game, I turn the party out\nMakin' everybody shout for the rapper with potty mouth\n\n[Hook]\nThat's why my brain is out of order\nThat's probably why my nights are gettin' colder and my days seem shorter\nBut as the world turns and I keep growin' older\nI'll be livin' this hip-hop till hell freezes over\nBitch, till hell freezes over\nI'll be livin' this hip-hop till hell freezes over\nAnd as the world turns and I keep growin' older\nI'll be livin' this hip-hop till hell freezes over\n\n[Outro]\nUh (Uh-uh, uh uh-uh, uh uh)\nUh uh-uh uh uh\nAh ah-ah ah ah\nUh uh-uh uh uh\nAh ah-ah ah ah\nUh uh-uh uh uh (Dr. Dre)\nAh ah-ah ah ah\n(Slim Shady)\n(Outsidaz)", "image": "https://images.genius.com/643c1103a1d49406ef6f0cf6688e50df.500x500x1.jpg"}], "artist": "Eminem"}