{"songs": [{"title": "I Don’t Give a Fuck", "album": "#IDGAF", "year": null, "lyrics": "[Verse 1: Ludacris]\nIt's that nigga you've been waiting on\nTrynna get more information conversating debating and hating on\nI need some pussy that I can take out my frustration's on\nOr on a yacht so i can take bad bitches and take a vacation onnnnnnn\n\n[Hook]\nI'm faded, I'm smashed\nI'm spending all this cash\nGot bout five racks in my pocket\nI don't really know how long it's gone last\nPour that drink all up in that cup\nThrow all that stank in a blunt\nGrab that chick with that butt\nAnd guess what? I don't really give a fuck\n\n[Verse 2]\nLife is a puzzle that I'm trying to get together\nEveryday trynna figure out what two women I can fit together\nDing ding let me get inside the ring because I think I got the prefect match\nDon't be nervous come on outcha shell lets wait for the birds to hatch\nShoe fly shoe bitch now it's time for the birds to fly\nMeanwhile this purple haze created a little purple sky\nIf you smoke that dirt don't be jealous of my maryjane\n8 albums in motherfucker ain't a damn thing changed\n\n[Hook]\nI'm faded, I'm smashed\nI'm spending all this cash\nGot bout five racks in my pocket\nI don't really know how long it's gone last\nPour that drink all up in that cup\nThrow all that stank in that blunt\nGrab that chick with that butt\nAnd guess what? I don't really give a fuck\n\n[Verse 3]\nI done got rich and lost my damn mind\nPlaques to plaques got a nigga celebrating all the damn time\nLUDA!\nQuit fooling around and get some work done\nNaw, I'd rather go to magic and see a bitch work some\nI think, I think I deserve it I'm in that guinness boook\nRappers throwing socks I throw them right back\nStill got these nigga's shoooook\nPeople see me in the movies and they think I went Hollywooood\nOnly difference is I'm popping a molly with a bunch of molly's and popping a molly is gooood\nIt does I mean it really does\nWas that Luda in a Lamborghini, I mean it really was\nHurry up and get a picture on ya iPhone\nThen turn around, bend over and let me get one on my phone\nI got it, Im'a save the filter and send it off\nHaters throw dirt I'm just so clean and a nigga just rinse em off\nSince 99 I've been in go mode\nAnd every time I see your bitch in the club she being ho mode\nI press a button and the whole damn crib just going ho mode\nAnd the crib dim the candles get lit and I pour some fucking drinks\nHey did Luda really fuck yo girl?\nWhat the fuck yo thank!\n\n[Hook]\nI'm faded, I'm smashed\nI'm spending all this cash\nGot bout five racks in my pocket\nI don't really know how long it's gone last\nPour that drink all up in that cup\nThrow all that stank in a blunt\nGrab that chick with that butt\nAnd guess what? I don't really give a fuck", "image": "https://images.genius.com/59084ad168e65b54e99e3d6e138cdf83.500x500x1.jpg"}], "artist": "Ludacris"}