{"songs": [{"title": "Retro Godfather", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "Come on (come on)\nTake it back (take it back)\n70's style (style)\nI'll do, anything\nAll y'all old school Studio 54ers\nThat's, my, word!\n\nThere's nothing in the world that I won't do\nI'll give my world to you, if you want me to\nI'll do, anything\nThat's, my, word!\n\nO.D.'n on this one fleein, all eyes seein\nDominant supreme being, face the mental\nDeep concentration break the point on a pencil\nKeep my cliches out your dental, capiche?\nShit that I been through is cause for parental\nDiscretions no question my Westside Connections\nL.A. Confidential, world don't stop\n'less it's mental, Staten residentials, you wit it?\nWu-Tang, Forever and a day, 'til I'm old and decayed\nI'm commited; look ma, we did it\nTop of the the world, tell it to my firstborn\nAnd my baby girl, did it my way, take the low ride\nOn the highway, out the sunroof, yellin\n\"Thank God it's Friday!\" Show a nigga love\nIf he got my sound pull the plug, he's not underground\nCall him mud, when I flood the airwaves\nHousehold and stairways (rainy days)\nWaiting for these paydays, think not of the ends\nIf I got twenty, my brother get ten\nNow let the madness begin motherfuckers!\n\nThere's nothing in the world that I won't do\nI'll give my world to you, if you want me to\nI'll do, anything.. anything.. anything.. anything..\nThere's nothing in the world that I won't do\nI'll give my world to you, if you want me to\nI'll do, anything..\nYo, yo, yo!\n\nWe got love for those with love for us\nBaby you can look but don't touch, I'm fried off the dust\nAnd plus, the only thing I trust is a fund\nAin't no fun, just paranoid niggas totin guns\nIn apparel, keep us camouflaged in the shadows\nThat's where I bring this tale that you never get to tattle\nObliterate the tri-state, and the crime rate\nTell them swine niggas fly straight, you can call it fate\nAnd if it ain't mine, call it fake, bottom line\nEnd the case, spoonfeed the track just a taste\nOf the side dish, soup of the day, I come Wright like N'Bushe\nFor them Dead Presidents\nFuck what you say, and he say, and she say, and they say\nVacate the premises, caught up in the melee\nSentence this song, to twenty-five years hard labor\nIn the system, where it takes the form of my wisdom\nRespect mine, take my time and protect nine\nNext on the frontline, Mr. Meth\nNo more no less, what you see is what your ass get\nSet it off I suggest\n\nThere's nothing in the world that I won't do\nI'll give my world to you, if you want me to\nI'll do, anything.. anything.. anything.. anything..\nThere's nothing in the world that I won't do\nI'll give my world to you, if you want me to\nI'll do, anything.. anything.. anything..\n\nNot a problem that I can't fix\nCause I can do it, in the mix\nNot a problem that I can't fix\nCause I can do it, in the mix", "image": "https://images.genius.com/7bb2fc25db22a3900f489969a9537f35.954x951x1.jpg"}], "artist": "Method Man"}