{"songs": [{"title": "Southmatic", "album": "SouthMatic", "year": "2019-06-21", "lyrics": "[Verse 1]\nNiggas be nice to me just 'cause I drive a Benz\nI could be your enemy, I could not be your friend\nI could be the Unabomber, durag and some Timbs\nAn alien that blends in, bitch I’m crazy in skin uh\nIs eatin' and shittin' and thrivin’ on Earth\nThe greatest shit in the universe\nEven roaches give birth huh\nLife ain't what they make it out to be\nIf heaven is Poppa Doughs then Earth is Applebees\nAnd I just came for the appetizer dog\nIt's a shame that I can't abide the law\nYou would think that I'm suicidal, nah\nFuck suicide, transform inside\nBitch I wanna die\nI'm a horny guy with a horny dick\nCall it poltergeist, don't ignore the signs\n'Cause if she wanted a family\nShe wouldn’t be popping E and plan B\nAnd I ain’t got no kids but she calling me papi\nFive-oh spilling coffee over my clock speed\nPineapples party looking like Great Gatsby\nNiggas wanna at me but can't get at me\nKundalini rising, the snakes is rattling\nI keep snakes around to eat the rats huh\nI tried to be vegan but I eats the cat\nI ain’t dyking but the backpack keeps the strap\nYou conditioned like that, I'm a nigga like that huh\nYou call the cops, you dependent like that\nWait, did I pick the right track?\nWait a minute, let me get it right back\nPrayin' for a freedom that you already had\nThat sound like a recipe for starvin' the blacks\nYou think that he a friend ’cause he give you opportunity\nHe really just a poverty pimp in your community\nThat's not ambiguity\nI'm killin' niggas all of my verses are eulogies\nPhysical body's just a shell\nTake off the S and what does that spell?\nWhat does that spell? What is that smell?\nGlasses tortoise shell\nYou a waitress, tell you hold the L\n\n[Interlude]\nOver to you B.o.B\nMan I tell ya, it's a great night here in Atlanta\nFor all the people that just got here\nWelcome to Atlanta\nHoes be hoin'\nSchemers be schemin'\nTrappers be trappin'\nThots be thottin'\nNiggas be niggin'\nAnd it's like that\n\n[Verse 2]\nI'm armed and present, I'm beyond eclectic, this is Armageddon\nGet your army and your armor ready, get your bomber ready\nI'm a monsta and you headed in the swamp direction\nTrespass find yourself pointed in the pump direction\nI would apologize and issue out a statement\nBut controversy is way too entertainin'\nThe let down of the American dream\nI guess life is not a swell as it seemed\nAll this false hope passed down from generation to generation\nYou thought lil' man man would be amazin'\nAnd get an education\nBut he still live in the basement, sellin' eighths to the neighbors\nThe last slice of weddin' cake in the fridge\nHe got a couple of side kids, fuckin' hoes in your crib\nNiggas bug me, get the D\nBut books are nigga repellent, I tell them read\n\n[Outro]\nThat all we have for tonight\nWe gonna get out of here\nAnd pay these light bills ah, pay these rents ha\nYeah Georgia power don't take EBTs\nSo we can do this shit for free on TV ha\nAnd remember, don't drink and drive\nJust smoke and fly\nWhere's that fucking bar at", "image": "https://images.genius.com/a9a03f89f8f3d7ce8b4db691d6f598db.800x800x1.jpg"}], "artist": "B.o.B"}