{"songs": [{"title": "Poetic Justice", "album": "Catastrophic", "year": "2012-12-21", "lyrics": "[Verse 1: Busta Rhymes]\nLook, tell me what you really wanna see\nI had the greatest experience shooting that video, 'What’s it Gonna Be?'\nI had to say it wowing, my heartbeat started pounding\nWalked on the set while she got dressed\nIn cock rings on her outfit\nJanet, why you doing this to me?\nAt the time I couldn’t believe we both were starring in this movie\nYou're in my video, you know a nigga loved it\nI spent 2.4 million on the fucking budget\nAll my jewelry flooded, see how the kid was on?\nFirst rap nigga album you’ve ever featured on\nAnd I was weak in the Lord, despite the things we said\nMy first words to Hype Williams is “I can’t believe this dream”\nShot a solo scene, I tried to make mines better\nBut I love when we shot together, and we rubbed up on each other\nBut I’m a little jealous, Tip, your tongue went in her mouth\nIn that Poetic Justice movie, from what I can account\nYou know what we be ‘bout…\nAny time, huh?\nAny place, baby?\n\nNow, you know, at the time, I was really\nI really had my crush on shorty, man, you know what I mean?\nYeah, I was in love with shorty since she was\nPenny and all that on Good Times and shit, you know what I mean?\nAyo, Kamaal, you’s a fucked up dude for doing that to me, man\nYou broke my heart with that, man\n\n[Verse 2: Q-Tip]\nCome on, Buss, you know how many dudes say that to me? Like…\n(You know you foul)\nOnce a day, girl, truly\nWe grew up with her through the lens of a camera\nDidn’t have much, but dare said I’m having her\nShorty was the joint, here’s my case and point\nMe and ‘Pac rollin’ L’s in the trailer\nBoth of us get to scheming how to nail her\nFirst movie about to come out in the theater\nPleasure principle, butt to the makeup truck, so ill I gave her my code\nWe kissed, I took her control, we swapped as all the film rolled\nA marathon, we kept this good thing going, sunset, the moon, it came on\nIn my mind it would prolong\nListen, the scene was deaded, but I wanted my own edit\nMe and Justice kissing keep it going, two pros with credit\nA memorable summer in ’92 out in Cali\nWhen I got back up top my niggas asked about the fatty\nAnd did I smash her madly, to that I had to answer\nNegative, but I’d give anything to be her dancer\nA captivating lady, I used to be her baby\nGood Times, they never fading\nLook back and celebrate Poetic Justice\n\n[Outro: Janet Jackson]\nAt any time, and any place, I don’t care who’s around\nAt any time, and any place, I don’t care who’s around\nIn the thunder and rain, you stare into my eyes\nI can feel your hand moving up my thighs\nIn the thunder and rain, you stare into my eyes\nI can feel your hand moving up my thighs", "image": "https://images.genius.com/b64a509fcfb92ec8935231089436682e.500x500x1.jpg"}], "artist": "Busta Rhymes"}