{"songs": [{"title": "Outside", "album": "Camp", "year": "2011-11-15", "lyrics": "[Verse 1]\nI used to dream every night, now I never dream at all\nI'm hopin' that it's cause I'm livin' everything I want\nI used to wake up in a bed between my mom and aunt\nPlaying with this Land Before Time toy from Pizza Hut\nMy dad works nights, putting on a stone face\nHe's saving up so we can get our own place\nIn the projects, man that sounds fancy to me\nThey called me \"fat nose,\" my mom say, \"You handsome to me\"\nMrs. Glover ma'am, your son is so advanced\nBut he's acting up in class and keeps peeing in his pants\nAnd I just wanna fit in, but nobody was helping me out\nThey talking hood shit and I ain't know what that was about\nCause hood shit and black shit is super different\nSo I'm talking hood shit and cool it now like New Edition\nMom and dad wouldn't listen\nThey left the Bronx so I wouldn't be that\nAll their friends in NY deal crack\nIt's weird, you think that they'd be proud of 'em\nBut when you leave the hood\nThey think that you look down on 'em\nThe truth is we still struggle on a different plane\n7 dollars an hour, WIC vouchers, it's all the same\nFacebook messaging hopin' that could patch up shit\nBut all they get now is, \"Can your son read this script?\"\n\n[Hook]\nThere's a world we can visit if we go outside\nOutside, outside—we can follow the road\nThere's a world we can visit if we go outside\nOutside, outside—no one knows\nThere's a world we can visit if we go outside\nOutside, outside—we can follow the road\nThere's a world we can visit if we go outside\nOutside, outside—no one knows\n\n[Verse 2]\nYeah, Dad lost his job, mama worked at Mrs. Winner's\nGun pulled in her face, she still made dinner\n“Donald watch the meter so they don’t turn the lights off\"\nWorkin' two jobs so I can get into that white school\nAnd I hate it there\nThey all make fun of my clothes and wanna touch my hair\nAnd my uncle on that stuff that got my grandma shook\nDrug dealers roughed him up and stole his address book\nHe’s supposed to pay ‘em back\nHe owe 'em money but his bank account is zero\nSo my momma made us sleep with Phillips heads\nUnder the pillow, like that would do somethin'\nBut she’s got six kids, she’s gotta do somethin'\nShe don’t want me in a lifestyle like my cousin\nAnd he mad cause his father ain’t around\nHe lookin’ at me now, like\n\"Why you so fuckin lucky? I had a father too\nBut he ain’t around so I'mma take it out on you\"\nWe used to say \"I love you,\" now we only think that shit\nIt feels weird that you’re the person I took sink baths with\nStreet took you over, I want my cousin back\nThe world sayin' what you are\nBecause you’re young and black, don’t believe ‘em\nYou’re still that kid who kept the older boys\nFrom teasin', for some reason\n\n[Hook]\nThere's a world we can visit if we go outside\nOutside, outside—we can follow the road\nThere's a world we can visit if we go outside\nOutside, outside—no one knows\nThere's a world we can visit if we go outside\nOutside, outside—we can follow the road\nThere's a world we can visit if we go outside\nOutside, outside—no one knows\n\n[Outro]\nCan you hear me now?\nCan you hear me now?\nOh, help us Lord\nOh, baby, baby, baby", "image": "https://images.genius.com/00196af444633a4108e6dc544358985e.630x630x1.jpg"}], "artist": "Childish Gambino"}