{"songs": [{"title": "Tired Of Y’all (Find Your Love Remix)", "album": null, "year": null, "lyrics": "[Hook: Royce Da 5'9\"]\nBoy you just a number…A-K-Hey, This four’ll put you under…A-K-Hey\nThem fans don’t really trust you…A-K-Hey, That’s why my family is fuck you\nI’m tired of y'all who thugging, I’m tired of y'all who hard\nI’m tired of y'all who thugging, I’m tired of y'all who hard\nI’m tired of y'all who thugging, cause all of y'all too hard\nI’m tired of y'all and all I know is I am gonna tear you apart\n\n[Verse: Royce Da 5'9\"]\nHow can Hip Hop possibly expose me when I’m so real niggas can’t hold me?\nNickel’s so ill miss me with the Loud talk I’m trying to be a player, you Chris Rock talking to Kobe\nBut I don’t play sports, I play a little game called \"Make your face look like the front of Kanye’s Porsche\"\nI’m getting better by the second you can feel it, can’t ya?\nAnd I’m still a gangsta, y'all niggas can play brothers 'till I kill 'em you feeling the little Willis, ain't ya?\nWhat kind of artist a killer, that wouldn’t kill a paintbrush?\nOh, really, you sold dope just for it turn you the color purple you niggas is so silly\nNigga please listen to me, you tripping if you think I’ll ever diss my nigga Ortiz\nThis is Shady 'till the death of this feeling like the best in this\nPaul Rosenberg on the messages Bad Meets Evil now it’s definite\nI’m the opposite of pessimist that’s my absolute optimistic testament\nQuick question, who you know touch it, Slaughterhouse outlaws call us no justice\nI just work hard I don’t even know what this is going on call it Bar Exam 4 fuck it\nSoon as the deal done boy you know it’s a Slaughter\nYou don’t know us for starters we exploding thinking you can swim with piranhas\nYou remind me of Obama, you don’t know much about oil and water\nLoaded Glock in the Bugatti gun rap big dick bitch looking like I Photoshopped it on my body\nNigga there’s gotta be, nobody hot as me\nYou ain’t seen a sicker male only way to see a sicker cell nigga you would have to go inside of Prodigy\nDiss? No, the sick flow, the overhand right’s like Klitschko... NICKEL!", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}