{"songs": [{"title": "Tanasia", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Chorus]\nTanasia, Tanasia\nIf you're not from Queensbridge, then you must be from Asia\nNever knew a love like this before, who said you was just a whore?\nWhere you walk, love, I kiss the floor\n\n[Verse 1]\nTruck jewels, big stacks, mustard boots\nConstruction on her feet, she eat duck confit\nI shoot up the club whenever I hit it raw\nIf she have a baby by me, I'ma love her more\nBrings food to the crib when I'm laying low\nAnd she know how to roll weed, but don't smoke\nChinese massages, wifey, no side-chick\nGo sight-seeing with the god\nPlaying cards with my dad, frying chicken for the mob\nSimply Lemonade, raspberry for the wash, gosh\nShe know who tryin' to rock her to sleep to get to me\nGive 'em the side eye when she see 'em in the street\nHer brother locked up, he doin' ten up in the beast\nHe's short, he comin' home and she hyped for his release\nFly her to Hollywood, watch flicks from Nollywood\nLike hydraulics, she ride the wood\n\n[Chorus]\nTanasia, Tanasia\nIf you're not from Queensbridge, then you must be from Asia\nNever knew a love like this before, who said you was just a whore?\nWhere you walk, love, I kiss the floor\nTanasia, Tanasia\nIf you're not from Queensbridge, then you must be from Asia\nNever knew a love like this before, who said you was just a whore?\nWhere you walk, love, I kiss the floor\n\n[Verse 2]\nShe edu-ma-cated, she said she related to the Asian\nEthic persuasion, the sex is amazin'\nNever bought her a Birkin, my night-time nurse\nMay be more like a surgeon, nice on the eyes, I put that work in\nBack when she was on the same block that I would service\nSaid, \"It's straight,\" we need a place up in Jamaica Estates\nAnd she was like, \"Oh no\" in a silky Kimono\nSaid the streets, the snakes, plus Governor Cuomo\nFlashes out the window, people takin' my photo\nShe knew I wasn't gon' be no husband, I be a no-show\nLeave her standin' at the altar, bro, I couldn't falter\nPlus that Nigerian blood mixed in her culture\nBody like she Evel Knievel, on the soul cycle\nLookin' like Janet, dance like Michael\nShe knew I wasn't cut from the cloth to be a Czar\nNow she hit the town with the legal Escobar, she's my—\n\n[Chorus]\nTanasia, Tanasia\nIf you're not from Queensbridge, then you must be from Asia\nNever knew a love like this before, who said you was just a whore?\nWhere you walk, love, I kiss the floor\nTanasia, Tanasia\nIf you're not from Queensbridge, then you must be from Asia\nNever knew a love like this before, who said you was just a whore?\nWhere you walk, love, I kiss the floor\n\n[Verse 3]\nWe fresh outta the Met Gala, express power\nExude the essence of best-dressed for the next hour\nToast glasses, velvet ropes, no trespassin'\nHella smoke, our section has the best fashion\nPicture us laughin', how ticklish the money has us\nLike little kids, but the difference is we'd much rather\nBe ghost, back in the crib, some avocado toast\nLaid-back, we choose that over Amalfi Coast\nChillin', startin' to think about children\nAnd bringin' 'em in the world with Kim Jong illin'\nBut since I'm feelin' what I'm feelin' and she feelin' what she feelin'\nI'm willin', she's willin', we buildin'\nEvery man originated in Asia\nOne continent, Africa was a part of Asia\nHere we are, in this Western Civilization\nI believe that we was destined to make it\n\n[Chorus]\nTanasia, Tanasia\nIf you're not from Queensbridge, then you must be from Asia\nNever knew a love like this before, who said you was just a whore?\nWhere you walk, love, I kiss the floor\nTanasia, Tanasia\nIf you're not from Queensbridge, then you must be from Asia\nNever knew a love like this before, who said you was just a whore?\nWhere you walk, love, I kiss the floor", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}