{"songs": [{"title": "Where I’m From", "album": "In My Lifetime, Vol. 1", "year": "1997-11-04", "lyrics": "[Intro]\nUh huh, ge-ge ge-ge-geah\nYe-ye-yeah, ye-ye-yeah, (Brooklyn)\nHow real is, this?\nHow real is, this? (Brooklyn)\nUh-huh huh  (Brooklyn)\nRespect this here, check!\n\n[Verse 1]\nI'm from where the hammers rung, news cameras never come\nYou and your mans hung in every verse in your rhyme\nWhere the grams is slung, niggas vanish every summer\nWhen the blue vans would come, we throw the work in the can and run\nWhere the plans was to get funds and skate off the set\nTo achieve this goal quicker, sold all my weight wet\nFaced with immeasurable odds, still I gave straight bets\nSo I felt I'm owed something and you nothing, check\nI'm from the other side where the other guys don't walk too much\nAnd girls in the projects wouldn't fuck us, said we talked too much\nSo they ran up to Tompkins and sought them dudes to trust\nI don't know what the fuck they thought\nThose niggas is foul just like us\nI'm from where the beef is inevitable, summertime's unforgettable\nBoosters in abundance, buy a half-price sweater new\nYour word was everything, so everything you said you'd do?\nYou did it. Couldn't talk about it if you ain't live it\nI'm from where niggas pull your card, and argue all day about\nWho's the best MCs, Biggie, Jay-Z or Nas?\nWhere the drugs czars evolve, and thugs are at odds\nAt each other's throats for the love of foreign cars\nWhere cats catch cases, hoping the judge R-and-R's\nBut most times find themselves locked up behind bars, is that all?\nI'm from where they ball and breed rhyme stars\nI'm from Marcy, son, just thought I'd remind y'all\n\n[Chorus]\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\n(Brooklyn... so where you from?)\n\n[Verse 2]\nI'm from the place where the church is the flakiest\nAnd niggas been praying to God so long that they atheist\nWhere you can't put your vest away\nAnd say you'll wear it tomorrow\n'Cause the day after we'll be saying\n\"Damn, I was just with him yesterday\"\nI'm a block away from hell\nNot enough shots away from stray shells\nAn ounce away from a triple beam\nStill using a hand-held weight scale\nYou're laughing, you know the place well\nWhere the liquor stores and the base dwell\nAnd government? Fuck government! Niggas politick theyselves\nWhere we call the cops the A-Team\n'Cause they hop out of vans and spray things\nAnd life expectancy so low we making out wills at eighteens\nWhere how you get rid of guys who step out of line, your rep solidifies\nSo tell me when I rap, you think I give a fuck who criticize?\nIf the shit is lies, God strike me\nAnd I got a question:\nAre you forgiving guys who live just like me? We'll never know\nOne day I prayed to you and said if I ever blow, I'd let 'em know\nThe stakes, and exactly what takes place in the ghetto\nPromise fulfilled, still I feel my job ain't done\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n\n[Chorus]\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\n(Brooklyn... so where you from?)\n\n[Verse 3]\nCheck, I'm from where they cross-over and clap boards\nLost Jehovah in place of rap lords, listen\nI'm up the block, around the corner and down the street\nFrom where the pimps, prostitutes and the drug lords meet\nWe make a million off of beats, 'cause our stories is deep\nAnd fuck tomorrow, as long as the night before was sweet\nNiggas get lost for weeks in the streets, twisted off leak\nAnd no matter the weather, niggas know how to draw heat\nWhether you're four-feet or Manute size, it always starts out with\nThree dice and \"shoot the five\"\nNiggas thought they deuce was live, now, I hit 'em with trips\nAnd I reached down for their money, pa, forget about this\nThis time around it's platinum, like the shit on my wrist\nAnd this Glock on my waist, y'all can't do shit about this\nNiggas'll show you love, that's how they fool thugs\nBefore you know it, you're lying in a pool of blood\nWhere I'm from\n\n[Chorus]\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Mentally been many places but I'm Brooklyn's own)\nCough up a lung, where I'm from, Marcy son, ain't nothing nice\n(Brooklyn...)", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg"}], "artist": "JAY-Z"}