{"songs": [{"title": "Snakes", "album": "Return to the 36 Chambers: The Dirty Version", "year": "1995-03-28", "lyrics": "Now number two, practiced the snake style\nHe was known as the snake spirit\nHe had the speed of a snake\n\n[Intro: Killah Priest]\nNiggas is like serpents out there\n[Snake style, no one could compete]\nSerpents will bite\nLay outside, and then they roll back into they holes\nThey slither, in the streets of Brooklyn, New York\nSlither in the streets, of Manhattan\nIn the streets of Queens, streets of the Bronx\nStreets of Staten Island\nWherever you see em they slither\nWhoever... yo\nFearsome shit... check it out\nYo, yo\n\n[Verse 1: Killah Priest]\nIt broke me up when they pat me on my shoulder\nSaid stay strong 'cause his life is now over\nI flash back to the heathens that he roll with\nThey shot him up and down nobody knows shit\nMy peers, little ears\nCame up to me with a eye full of tears\nLast night we was shootin' dice and gettin' nice\nKid rolled us, played us for our merchandise\nWe were in the hallway all day\nMe, Steve and Little Ray\nProbably at first they tried to rob me\nBack me in the lobby, pull out the shotty\nThen came Scotty, fragile body\nMy first impression, he returned from a party\nHe would just stagger, smellin' like Bacardi\nThe Dragon, braggin', how he was fuckin' mad hotties\nPressed on the elevator button, then all of a sudden\nHe licked off, about a dozen\nSlugs from the cannon, that ripped through my cousin\nNobody was standing when the nigga started bustin'\nBlood started to flood the floors by the elevator doors\nThat's the last thing that I saw\nDamn, we planned to make grands and buy a home\n\n[Number two]\n\n[Verse 2: RZA]\nJagged edge, rockin' God, hard as Stonehenge\nPledged whoever crossed his path get scrapped with a sledge..\n..hammer, he didn't give a damn about the manner\nAnd on the block he was called by the momma's\nAnd the grandma's, 'indecent', 'heathen', 'juvenile delinquent'\nHis weekends was frequently locked inside the precinct\nHis most recent cape for catchin' papes\nWas snatchin' up snakes on a roof butt-naked hang em off like drapes\nThen ask what's the combination to the safe, with the brace\nAnd those who didn't reply they fell straight to their face\nRazor blade sharp who invades the dark\nAnd raid more spots than Spays and NARCS iron heart like Tony Starks\nA fierce lion, who never leave the crib without the iron\nAnd on the block he be slingin' rocks and duckin' from the sirens\nGreetin' niggas he loved with a pound, and a bear hug\nThose who wanted life, they catch a slug from the snub\nA Five Percent, who all knew was one to ten\nHe loved the Gods with his heart but his brain was filled with sin\nAnd when he came through niggas be lookin' out\nHopin' he gets shot or tooken out, or locked the fuck up in Brooklyn House\nIn PC, on a liquid diet, but he was louder than a riot\n[Number two, the snake]\n\n[Verse 3: Masta Killa]\nDo the knowledge to a nigga named Trigga\nBad rude boy from the land of Jamaica\nWith visions to venture, to the U.S\nTo receive the gold that he couldn't achieve\nIn his country, even though he sold mad weed\nFor the next man, who was the Don of the clan\nNiggas actin like they got the block locked\nLike I can't sling drug raps and eat food\nBut I be the rudest, bad boy steppin gun totin\nShots lash out like a violent explosion\nAt the nigga, who tries to stop my production\nIntervene the scene and slow up the cream\nNone of that black, East New York, gun talk\nNiggas I extort from Baltic to Boardwalk\nMemories of injuries wounds and burns\nWalkin' through the streets of Medina I stand firm\nCause I know this, which means I can hold mine down\nWithout a doubt, niggas who front, get snuffed out\nJustice must be born there's no escape\nCause a snake can't be reformed so why wait\nComin' in the name to proclaim your fame for protection\nAnd you don't know no fuckin' lessons?\n[Number two, the snake]\n\n[Verse 4: Ol' Dirty Bastard]\nBad, bad, Leroy Brown\nBaddest man in the whole damn town\nBadder than the deep blue seaaaaa\nBadder than you and meeeeee\nNiggas comin thru the trees, like a salamander, bitin'\nLike a piranha, but I'm bitin' you back, like a black pantha\nThe style I'm ampin' the... fuck my name, who I be?\nFuck the game, it's all about the moneyyyy!\nOwahhaerahh, sometimes I get high with the Meth\nThen I turn to the Killah Priest\nWhen it comes TWELVE O'CLOCK!!\nI turn into the demon beast, yo\nYo fuck that shit!\n[Number two, the snake]\nYO! SHOW THESE MOTHERFUCKERS WHAT TIME IT IS\n[Number two, the snake] Rawwrarrrah\nRahhwarwaahauh, rawwaroar!!\nWHO's THE BAD-ASS? *rawharrah*\nWHO's THE BAD-ASS?\n[Now number two] Rawwwaahrah\n[He practiced the snake style\nHe was known as the snake spirit] YEAHhhhhh\n\n[Verse 5: Buddah Monk]\nLyrics, never waitin, twelve days, penetrated\nWhen I come with the ruffness, mad niggas try to rush this\nSlip into my killings, then I slays and you're helpless\nWhen I try to stay sick, it's Yakub grafted six\nCalm for the kill, knowing the style that's ill\nWhen I drop, lyric skills, brothers say, Buddah chill!!\n\n[Outro: Ol' Dirty Bastard]\nI don't need to rhyme no more, niggas know, yo!\nTo all the Wu-Tang Clan members\nThe Ghostface Killah, the GZA, the RZA, the Ol' Dirty Bastard\nThe Method Man, the Chef - Raekwon, Inspectah Deck, U-God\nYo!!!", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}