{"songs": [{"title": "Crystal Ball", "album": "No Ceilings 2", "year": "2015-11-26", "lyrics": "[Intro: Lil Wayne]\nI know 'round the world I be gettin' to the money\nShe crazy for the dick and I'm addicted to the money\nIt's a dirty world and my cup too, it's so muddy\nLong story short, I be gettin' to the money\nMy lady talkin' crazy, I done listened to the money\nShe crazy bout this dick and I'm addicted to the money\nI gotta watch that bitch, she must be in it for the money\nLong story short, I'mma pimp before a dummy\n\n[Verse 1: Lil Wayne]\nI ain't got high expectations I'm just expecting my money\nIf I don't get my check, I'm gonna be chin-checkin' for nothin'\nIf I don't get my check, I'm gonna be chin-checkin' in public\nLong story short, I'm just gettin' to the money\nLong story short, I'mma keep it short and sweet\nI get to the money, I don't let it get to me\nAll my niggas ballin', it's the way this shit should be\nI pull up on my darlin' and I lay the dick and leave\nShe'll thank you for comin'\nI'll put that dick in her stomach\nYou put that cash on the dresser for her\nYou take the bitch out to restaurants\nYou took the bitch out the reservoir\nAnd took the bitch straight to the fuckin' mall\nI get higher than cholesterol\nI see money in my crystal ball\n\n[Hook: Lil Wayne]\nI see money in my crystal ball\nOnly answer when my niggas call\nHello, what up nigga\nRingtone 2Pac, Soulja Slim, or Biggie Smalls\nCountin' money, listenin' to 2Pac, Soulja Slim, or Biggie Smalls\nGot steph walkin' round in the house\nIn nothing but a thong and I'm in my drawers\nI mean can I ball\nI don't mean no home\nI don't need no home\nBut niggas got their hands out and I don't read no palms\n\n[Verse 2: Lil Wayne]\nI know these niggas is pussy\nI know these niggas is pussy\nI know these niggas is lookin'\nI know these niggas is payin' attention\nI know these bitches got bad intentions\nBut I just want my money\nI just want my money\nGot 'em\nI'm startin' to feel like wavin' shotties\nStarted from the bottom, nigga\n\n[Bridge: Stephanie Acevedo]\nTryna break me off, you better break me off some money\nTalkin' bout you love me? Better show me with the money\nShow up at my door? Better show up with the money\nTake me somewhere nice? It better be private and sunny\nI got what you want, you got what I need\nI just take the check and let you take the lead\nI might take some shots, I might hit the weed\nPut a dollar sign at the beginning of Stephanie\nMula\n\n[Hook: Lil Wayne]\nI see money in my crystal ball\nI'm bout to bust open this crystal ball\nWhat up nigga?\nRingtone 2Pac, Soulja Slim, or Biggie Smalls\nCountin' money, listenin' to 2Pac, Soulja Slim, or Biggie Smalls\nGot stuff walkin' round in the house\nAnd I'm a dog and I'm in my drawers\nI mean can I ball\nI don't mean no home\nI don't need no home\nBut niggas got their hands out and I don't read no palms\n\n[Verse  3: Stephanie Acevedo]\nSpendin' spaniel, wasted cause my nigga hustle for me\nI'm outchea with my girls and we turnin' up for nothin'\nSo close with all my brothers and so far away from ugly\nRacin' in my new car, I see new friends actin' funny\nSpendin' spaniel, wasted cause my nigga hustle for me\nBreak my heart? I break the bank boy, I'm Young Money\nAll these niggas round me are my brothers, are my brothers\nThey'll kill anybody if they fuck with me, I love 'em\nThey'll kill anybody if they fuck with me, I love 'em\nAll these niggas round me are my brothers\nBreak my heart? I break the bank boy, I'm Young Money\n\n[Outro: Lil Wayne]\nLong story short, I be gettin' to the money\nLong story short, I be gettin' to the money\nLong story short, I be gettin' to the money\nLong story short, I be gettin' to the money\nI be gettin' to the money", "image": "https://images.genius.com/ed7fb7fe9af1d913b520bf5336619560.800x800x1.jpg"}], "artist": "Lil Wayne"}