{"songs": [{"title": "Manifest Destiny", "album": "Javotti Media Presents: The Cathedral", "year": null, "lyrics": "[Intro]\n\nCan you be objective for a minute?\nI know you’re handicap\nBut are you capable of being really objective?\nCause I wanna tell you something:\nYou say we won't get anywhere\nBecause what we’re doing is founded on a lie..\nTell me something:\nWhere you gonna find a bigger lie than the one this countries founded on?\n“All men are created equal.”\nEverything this countries suppose to live by\nRight?\nYou’re a Negros with some friends\nYou could use a little education\nThey got you so mixed up;\nYou’re singing, “My cons rated!”\nAnd meanwhile they WALK ALL OVER YOU!\n\n[Instrumental Break]\n\nJustice, equality (huh? Yeah, haha..)\nMy crew you see?\nIt’s Talib Kweli, K. Valentine, Niko-IS. Corey Moe\nKris Remy, Joel Ortiz, Yowwa, Curren$$y, Big K.R.I.T\nKendra Ross, Russell Gunn, Jessica Care Moore\nRes, Pharoh Monche, Cassper Nyovest, Alexander O’Niel\nYZ, Colonel Abram, Webby, Hebro Brisson, Rockwell\nPheness & Synquest, The Whispers, Jessy Johnson\nYoung Black Teenagers\nAnd two of the Negus from Hi-Fi  (yeah)\n\n[Trumpet Solo]\nFollowed by Saxophone / Piano Accompaniment / Scatting\n\nBlack Statue of Liberty (Poem by Jessica Care Moore)\n\nI stand still above an island, fist straight in the air\nScar on my face, thick braids in my hair\nBattle boots tied, red blood in the tears I’ve cried\nTourists fly from all over just to swim near my tide\nOr climb up my long flight of stairs\nBut they trip on their shoestring lies\nPiece by piece they shipped my body to this country\nNow that I’m here, your people don’t want me\nI’m a symbol of freedom, but I’m still not free\nI suffer from class, race, and gender inequality\nI wear a crown of knowledge, ’cause I’m a conscious queen\nMy mask is one of happiness, though my history here is full of misery\nDone deliberately\nI am America’s true statue of liberty\nYou placed a bible under my arm, after you ripped me of my faith\nAnd made me pray to a fictional imposter\nSo, if you were trying to maintain liberty\nToo late, you just lost her\n‘Cause her torch is about to serve as the night light for truth\nIn the slums and the ghettos that you find so uncouth\nEducation will be delivered not from the tree, but the root\nSo, little black girls and boys will check their pockets\nFor spirituality rather than loot\n‘Cause liberty is just old mother nature\nAnd although you don’t lover her, she’ll never hate ya\nShe’s earth, wind and fire, don’t tempt her to show her power\nTurning all weeds to flowers\nLooking into her wise eyes will make a blind man see\nHow can you dare name a eurocentric girl after me?\nAssata Shakur Barbara Jordan Nikki Giovanni and Angela Davis\nLook it up!\nThese are the real symbols of liberty\n‘Cause that stone-faced French woman ain’t gonna save us\nThe same folks who enslaved us\nI’m sitting at the back of the bus, ’cause I feel like it\nAnd I play ball\nNot ’cause you pay me to dunk it, dribble it or hike it\nI’m taking all my people back home, and breaking them mentally free\nI am the walking, talking, breathing, beautiful statue of liberty\nI sweep crack pipes out of schoolyards\nI nurture my man when times are hard\nSo, where the hell’s my statue?\nWhat’s the liberated woman gotta do?\nPlace my name in wet cement\nEvery month I pay the rent\nPut my silhouette on a stamp\nI’m not a ho, slut or tramp\nMy children aren’t on crack, and neither am I\nI want to see the words, “Go, strong Black woman,”\nWhen the Goodyear blimp flies by\nI can bake cookies, bear babies, preside over revolutions\nGet rings out of tubs, wear a suit, sport baggy jeans, slick my hair back\nOr tie it up in braids\nMy aura is unafraid\nSo, no statue in the big apple can mess with me\nI am the walking, talking, surviving, breathing, beautiful\nBlack Statue of Liberty", "image": "https://images.genius.com/ef6dedd7fb7fbfd332ff9ea334d4188f.500x500x1.jpg"}], "artist": "Talib Kweli"}