{"songs": [{"title": "Thizzles", "album": "Something Else", "year": "2013-07-30", "lyrics": "[Skit]\n- Man, I don't give a fuck about all that, I just wanna make sure these beats are locked down. Hey, hold on one second, here's Tech right here, man. What's up homeboy, what you need?\n- Th-th-th-th-thizzles!\n- How many?\n- Th-th-th-th-thizzles!\n- What is that, like five?\n- Yahtzee!\n- Alright, c'mon through\n- Cool\n\n[Intro: Tech N9ne]\nOnly ye who is on the molly shall dig this little diddy here\nAnd if ye shall want that molly, then ye shall have it!\n\n[Hook: Tech N9ne]\nWhen I'm in the house everybody in the place know I got that\nLadies in the back, on my lap, I'mma tap when they pop that\nI was on that molly when I copped that, but I never dropped that\nHey, hey (I got thizzles)\n\n[Verse 1: Tech N9ne]\nT-H-I-Z-Z-L-E-S in my belly, yes\nWe stay high, we be helly X'd, so don't be jelly, just\nGet up in the midst of the party\nGot a fistful of molly and a bitch with a body\nI think I wanna grab another chick from a hottie\nMake her lick on my lollipop, I hits when I'm naughty\nHit 'em both then I'm 'scaping later\nNever limited, dig it, I'm makin' paper\nPenny pickin', was sick, I was hatin' fakers\nWho played the great A, but they can't bust\nI was a-poppin', the panties was droppin'\nI never stopped even when granny was knockin'\nSuper shockin' when the be canopy top\nIt's off from all the rockin', insanity fuckin'\nThat I does, my high buzz\nThe type of sky shove I love, I was\n\n[Pre-hook: Tech N9ne]\nPoppin' Molly Ringwald, eatin' Stacy Green raw\nEverybody and thing saw a motherfuckin' fiend, y'all\n\n[Hook: Tech N9ne]\nWhen I'm in the house everybody in the place know I got that\nLadies in the back, on my lap, I'mma tap when they pop that\nI was on that molly when I copped that, but I never dropped that\nHey, hey (I got thizzles)\n\n[Verse 2: Danny Brown]\nM-D-M-to-the-A, on that plate, got me hella straight\nWe just took some dips, we just met, but we gon' fuck today\nSo pop that pussy for a goon and I got four hoes in my hotel room\nGot a zip of that Marley and a fill of that Henny and a gram of that molly we about to go boom\nBitch it's Tech Nina and your boy Danny Brown\nHand-me-down clothes on me hand-me-down hoes\nThey be hoes on the dick doing fingers made of gold with a ruby on her head and a diamond on my nuts\nCumming on her butt for a pill with a slut\nPlayin' with the pussy now I'm tryin' to go fuck\nSo ho stop playin' gon' let a nigga cut\nLike a homeboy screamin' ridin' on the west side\nGon' suck a nigga dick or something\nGon' let a nigga hit or something\nWe rollin', rollin' on the moon rocks we controlling, 'trolling\nUp against the wall, all these bitches on my balls\nOff that Molly Ringwald\nOff that molly, brainwashed\n\n[Hook: Tech N9ne]\nWhen I'm in the house everybody in the place know I got that\nLadies in the back, on my lap, I'mma tap when they pop that\nI was on that molly when I copped that, but I never dropped that\nHey, hey (I got thizzles)\n\n[Verse 3: Tech N9ne]\nOrange juice, morn' boost\nBorn goof, scorn roots\nWorn youths, let my horns loose\nPorn groups, with the E we raise the darn roof\nGot it really hot in here\nI'mma knock this beer, I'mma pop this, yeah\nBet you think I'mma gonna stick and rock this rear\nBut big booty bitch, I love you, but I'm not sincere\nSaid you never popped before, I can't tell how\n'Cause you're freaky, you take it, you're going to hell now!\nThat I does, my high buzz\nThe type of sky shove I love\nI was\n\n[Pre-hook: Tech N9ne]\nPoppin' Molly Ringwald, eatin' Stacy Green raw\nEverybody and thing saw a motherfuckin' fiend, y'all\n\n[Hook: Tech N9ne]\nWhen I'm in the house everybody in the place know I got that\nLadies in the back, on my lap, I'mma tap when they pop that\nI was on that molly when I copped that, but I never dropped that\nHey, hey (I got thizzles)\n\nTime to get your molly on!\nTime to get your molly on!\nTime to get your molly on!", "image": "https://images.genius.com/9d1e1c938850d53aa216f2bec0e2ef9c.1000x1000x1.jpg"}], "artist": "Tech N9ne"}