{"songs": [{"title": "Put On", "album": null, "year": null, "lyrics": "[Ludacris:]\n\nLUDA!\n\nNow before my nigga Jeezy made this song for the city\nBefore Wayne put out a milli and then in a week he sold a milli\nBefore JD threw ten thousand on the floor at Magic City\nBefore Usher jumped the broom, before he confessed that shit to Chilli\nBefore DJ Drama dropped the Southern Gangsta Grilly\nBefore Puff Daddy changed his fucking name to Diddy\nBefore Janet Jackson went on the tube and showed her titty\nI been reppin' for Atlanta and I been reppin' for my city\nYou could ask Dallas Austin you could ask Rico Wayde\nI kept the lights on in Atlanta when Goody and Cash took a break\nAnd you can say that \"he this\" and you can say that \"he that,\"\nBut one thing's for damn sure I put the city on my back\nAnd I ain’t goin' nowhere that movin' money ain't changed em'\nBut the vaults were too small at the bank so I rearranged em'\nThese rappers around my way ain't got mo’ money then me\nI’m blinded by my own ice but I got mo' money to see\nAnd I ain’t dissin' I’m just spittin’ what I call is the truth!\nSo catch me ridin' without that thang what you call is the roof!\nI got the money in my palms like I carved the Malouf!\nCuz I gotta make myself clear just like a bottle of Goose!\nAnd I can see right through ya\nDon’t let the mic fool ya\nSay the wrong words and my click might do ya\nSo before you go runnin' your mouth and say some shit you'll regret\nThis is just a small verse so that these boys don't forget\nI put on\n\nI ball hard on my first album but I ball harder today\nPlus, I just opened up a restaurant in the heart of the 'A'\nI payed my dues in my city and I’m throwin’ the finger to all the haters\nMe and the mayor just bought back the Martin Luther King papers\nNow how hard is that shit, how much harder can that get\nHard as the AR will make these niggas do a back-flip\nWatch it in Atlanta cuz I’m all over your girl\nFirst nigga with a polo beat I pimped all ova the world\nFirst to put on cash money when they came to the “A”\nShout-out to my nigga Pooh like sh- sh- shawty!\nFrom the goon squad to the shottas\nDope boys to the Rastas\nLuda represents this shit from the college park to the Oscars\nPut on a tuxedo, get incognito\nGot game for ya bitch I shoot it like a torpedo\nSo before you go runnin' your mouth and say some shit you'll regret\nThis is just a little verse so that these boys don't forget\nI put on", "image": "https://images.genius.com/d211edacb8de02968540124c6801063d.1000x1000x1.jpg"}], "artist": "Ludacris"}