{"songs": [{"title": "Stimulation", "album": "Tical", "year": "1994-11-15", "lyrics": "[Intro: Method Man (Blue Raspberry)]\n1, 2, 1, 2, 1, 2\nI gets busy on 'em, I gets bust of 'em\nI gets busy on 'em, I gets bust of 'em...\n(Let's come together for the stimulation\nMeth-Tical, hit 'em with the stimulation)\n\n[Verse 1: Method Man]\nI got 36 styles on my mind, on my mind\nKeep it real, Shaolin represent one timeeeee\nAll my peoples, are you with me, where you at? (Suuuu)\nAll my Killer Bees on attack, where you at? (Suuuu)\nThrow ya fuckin' hands in the air if you want 'em near\nIf ya got ya gats, peel a cap for the New Year\nBody devotion, what's the commotion?\nWu-Tang Clan, we attackin' your emotion\nFlowin' like the ocean (bluuue)\nI be comin' for your (creeew)\nFlyin' guillotine (styyyle) with the new Meth-Tical\nIs it goin'? Is it goin'? Is it gone?\nIf I ain't on ya records, then the shit ain't really on\nOne-man band from the Wu-Tang Clan\nAsk who the man? Goddamn, it be Method\nHere I, here I am in the Clan, it's essential\nPuttin' Def Jam on my records, it's on\n\n[Hook: Blue Raspberry]\nLet's come together for the stimulation\nMeth-Tical hit 'em with the stimulation\nCan everybody feel the stimulation?\nMeth-Tical hit 'em with the stimulation\n\n[Verse 2: Method Man]\nI'm here for you, son, I gotcha back\nAs long as you keep it real, word, I gotcha back\nBrothers want the drama but don't know how to act\nUntil the chrome pointed at his dome head crack\nCome on, let's keep it real, no disguise, recognize\nI'm from a small town where \"nigga do or nigga die\"\nThat's why I'm stressin'\nThat brothers keep they thoughts on they lesson\nResurrect yo' mind from the essence, for real\nIll block niggas get robbed like by the dozen\nWhat up, cousin? Now give a pound to that lounge nigga\nPeace, my MZA! Killah Hills 10304 by the GZA\nGot me wideeee, it's goin' DZA\nMake my way for the ooh buildin'\nNow I'm chillin' with the neighborhood villains\nThug Life, it be on now\nHear the gun blaow as I milk another cow\nLet the Method show you how niggas do it\nI study, live the life of good, bad and ugly\nHard times caught a nigga lovely, but that ain't nuttin'\nBefore I die, I'mma leave the world with sumtin'\nTo remember me by, the real stimuli!\nFor you frontin' ass out rappers to capture\nI rip the world apart like a natural disaster\nI keep it live, somethin' born in '85\nI utilize my 3rd eye, got me thinkin'\nBaby, you and I should get together for whatever\nYou never in your long-legged life had it better\nThan you got it now, we be loungin', Tical\n\"Word, son, I like your styleee\"\n\n[Hook: Blue Raspberry]\n\n[Break: Method Man, overlaps Hook]\nBasically, I'm here for the stimuli\nTo get high and for doughnuts\nMeth-Tical, it's '94 and it's raw, once more\nThe Wu-Tang saga continues\n\n[Outro Hook: Method Man, overlaps Blue Raspberry's Hook]\nWu-Tang Clan, forever\nNo, we don't die, we just multiply forever, and ever, and ever...\n\n[Hook' 'til fade]", "image": "https://images.genius.com/e8eea98eab886487258b11bd4e1cca4b.1000x1000x1.jpg"}], "artist": "Method Man"}