{"songs": [{"title": "Well All Rite Cha", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "[Intro: Method Man]\nHydro... indo... (buddha!)\nHah... cocoa... yo, ya-ya-yo!\nI need some brown weed (lady) all day\nI need some brown weed (jenny)\nI need some cut (lady, lady)\n\n[Verse 1: Method Man]\nNow these doors don't open, til after dark\nAnd it ain't til 12 til the party really starts\n(Yo, me and my crew had to be in by ten\nRight before the fun was about to begin)\nYo yo, one bitten, jabberjaws, tryin to taste the\nPaper written, kids be bullshittin, I see they flaws\nToo many rebels, not enough cause for me to pause\nThem broads love my shitty drawers, the finest\nCriminal minded put my life behind it, you niggas\nFind it hard to swallow poison in the bottle, she too sexy\nSo I gotta watch you fast bitches, too many tricks\nThat can give a dick a bad sickness *coughing*\n\n[Verse 2: Redman]\nYo, yo! Yo son excuse me?\n(Yo) I'm tryin to earn a million buck or two\nThe ill MC step in -- (and who the fuck are you?)\nDoc start walkin bumpin M.O.P\nTo catch a nigga gettin gassed, puttin ten on three\n(Da Ruckus!) With the mic I blast men on sight\nSo off the hook Atlantic Bell had to go on strike\nDoc did it, metaphors come AMG kitted\n20/20 vision, comes tinted! From being so high..\n(So high..) so high.. so high..\n\n[Verse 3: Method Man]\nAir it out\nIron Lung I be the street soldier, ante up\nPull them panties up, party's over, in the cut\nSlappin grudges offa niggas shoulder, bringin ruck\nLike them Wild-cats at Villanova, hot as fuck!\nDuke or sober, swallow ebola, soul controller\nOf the universe, stole-a, colder than polar\nCaps grab your hoodie hat, Island of Stat'\nKeep them cats runnin for they gat, in stormy weather\n\n[Verse 4: Redman]\nGats, right hook, uppercut swollen how I left your eye\nStage dived, made a mistake, kicked F.O.I\nAiyyo ho! Doc be keepin a dope show like Marilyn\nManson the handgun be stashed in the panelling\nJersey drop son, watch me whip it like midget\nDiggin in that whole plate and, piss on your picnic\n(Don't nobody move) Don't nobody start flinchin\nLimo driver, roll up the fuckin partition!\n\n[Hook]\n[M] Who them niggas that be rollin them thai, high as a kite?\nGettin pussy all nite (well all rite cha) yeah yeah\n[R] Well who them cats you can call on, when you wanna brawl?\n(Get drunk as hell) and so on (well all rite cha) yo yo\n[R] Is Funk Doc up in the house? (well all rite cha) yo yo\n[M] Hot Nix up in the house? (well all rite cha)\n[R] Bricks to Stat' hold it down (well all rite cha) yo yo\n[M] Mad dick up in your mouth (hah, all nite cha)\n\n[Verse 5: Redman]\nYo Tical's and Doc, did it before, I'll do it again\nSnatch spark to the ignition, I'm screwin it in\n(Aiyyo we out!) Six drop in ten seconds, what?\nI'll be the first one on the floor at your, wedding reception\nB-Boys gather around and act p-noid\nBring the Trouble T-Roy, to earlobes, keyloid\n(Terminator 2) Doc after Sarah Conn'\nFor the barrel bonds (Am I on?) Tical, you're on\n\nUhh-uhh-on, uhh-uhh-on\nUh uh-uh uh-uh, uh-uh-on\n\n[Verse 6: Method Man]\nGot these slim pickins on my Charles Dickens, I pack a mac\nTo make your back stiffen, flip the script I act different\nThe oddball, keep your distance, warning y'all you don't listen\nBitchin over shit you ain't gettin\nSo finally, puttin in work, the big hurt\nMC, with a social disease, and get it first\nEnemies, feel my energies, four centuries of anger\nRemember me? (The field nigga!)\nToo Ghetto Fabulous, RZA.. Sharp, and hazardous\nFigure, with bad habit, can't hold his liquor\nSpeed like a millipede (Hot Nix-on)\nContemplate the non-fiction on loose leaves\nParagraphs, hundred degrees, my pen bleed (ha!)\nShowin you the pain I feel from holdin these\nBlack thoughts, deep rooted, nowadays\nThey come with batteries included, in wicked ways\n\n[Hook]\n[M] Who them niggas that be rollin them thai, high as a kite?\nGettin pussy all nite (well all rite cha) yeah yeah\n[R] Well who them cats you can call on, when you wanna brawl?\n(Get drunk as hell) and so on (well all rite cha) yo yo\n[R] Is Funk Diggy in the house? (well all rite cha) yo yo\n[M] Meth Diggy no doubt! (well all rite cha)\n[R] Bricks to Stat' hold it down (well all rite cha) yo yo\n[M] Mad dick up in your mouth (all nite cha)\n\n[R]Cha, cha, cha, cha, cha, cha, cha, cha...\n[M] S.I.N.Y. 10304\n* fades in and out before end *", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}