{"songs": [{"title": "Ya’meen", "album": "4:21... The Day After", "year": "2006-08-29", "lyrics": "[Intro: Method Man]\nYo, I'm bout to hit you with this ya'meen\nOn top of the ya'meen, with a lil' bit of ya'meen mixed in\nYa'meen? Yeah... yeah... yo\n\n[Verse 1: Method Man]\nHow should I get it started? Fuck it, just get it started\nThese trash talkin' artists is nothin', niggas is garbage\nWhen Meth strike his target, leave it dearly departed\nHis flow is clearly the hardest, y'all gon' feel me, regardless\nMight break a promise, but never, breakin' the code\nSome get popped and call for they mamma when the drama unfolds\nMy block, hot as a sauna, marijuana and dough\nCrack deals on every corner, fiends run up on ya with soap\nAnd if life's a bitch, then I bet she's bitter and cold\nErry'time she thinkin' I fold, seven figures get sold\nMeth all in your chest or inhale it all in your nose\nCops don't know about this Method, but smell it all in his clothes\nYup, I'm still intact, how real is that? I'm back\nWith enough Sensamilla to fill ya vanilla wraps up\nNew York, New York, rock tube socks and Timberlands\n'Cause hip hop ain't feelin' them flip-flops, they feminine\n\n[Chorus: Method Man]\nI'm the one shot dealin', one shot killin' it (ya'meen)\nYeah, it's the top billin', the block feelin' like (ya'meen)\nYeah, fuck with me (ya'meen), yeah, fuck with me (ya'meen)\nIf you not for squealing' and for spillin' the (ya'meen)\nThe streets is watchin' the apple rotten like (ya'meen)\nPlus the B.B. hot and the towers droppin' like (ya'meen)\nYeah, fuck with this (ya'meen), yeah, fuck with this (ya'meen)\nIf you get it poppin', or get to poppin' 'em (ya'meen)\n\n[Verse 2: Fat Joe]\nYou know the haters diss you, let's deal with bigger issues\nYou know New York is dyin' after all the shit we been through\nAnd we done lost B.I.G., we done lost Pun\nHomie, you can't live, gotta go and get them guns\nYou know them hammers'll lose your cabbage, them dudes do damage\nSend Zulu Nation through Reaganomics, we move them package\nWe pushin' rain pain, gotta go and get that money\nY'all going \"hey hey\", but don't that pen look lovely\nYou - must - not - know - who - y'all niggas is fuckin' with\nI - can - take - life - nig... just for the fuck of it\nCrack's crazy, that nigga'll smack babies\nClap ladies for yackin' you gon' catch shady\nCall it a mass shower, the way them hollow's drizzle\nMr. Potato Head, you know them things can't miss you\nThe Average Joe, with an average flow\nMe and Meth bringin' back New York, nigga\n\n[Chorus: Method Man]\nI'm the one shot dealin', one shot killin' it (ya'meen)\nYeah, it's the top billin', the block feelin' like (ya'meen)\nYeah, fuck with me (ya'meen), yeah, fuck with me (ya'meen)\nIf you not for squealing' and for spillin' the (ya'meen)\nThe streets is watchin' the apple rotten like (ya'meen)\nPlus the B.B. hot and the towers droppin' like (ya'meen)\nYeah, fuck with this (ya'meen), yeah, fuck with this (ya'meen)\nIf you get it poppin', or get to poppin' 'em (ya'meen)\n\n[Verse 3: Styles P]\nYou don't like me, you can get what's right above the testicles\nS.P., turn the top five into vegetables\nYou don't believe me? Get 'em all in the room\nAnd the next five, I plan to gettin' all of them soon\nY'all can meet me at the table that's round, or get ya place in the ground\nThat's what you get when you facin' me, clown\nWho got the crown? I'ma piss on it now while they wearin' it\nNobody nicer than Ghost, I ain't hearin' it\nBeen Nike Airin' it, white tee out\nStick-up kid season when the dice be out\nI'm about to start investin' and liftin', niggas sippin' soup\nGhost rap, I'm knockin' out your icey mouth\nNiggas in the East wanna unite, not me\nIf you ain't sayin' I'm the best, you ain't come at me right\nNaw'Imean? If you don't, then you know how that beam\nThe four-four knock little pieces off of your spleen, nigga\n\n[Chorus: Method Man]\nI'm the one shot dealin', one shot killin' it (ya'meen)\nYeah, it's the top billin', the block feelin' like (ya'meen)\nYeah, fuck with me (ya'meen), yeah, fuck with me (ya'meen)\nIf you not for squealing' and for spillin' the (ya'meen)\nThe streets is watchin' the apple rotten like (ya'meen)\nPlus the B.B. hot and the towers droppin' like (ya'meen)\nYeah, fuck with this (ya'meen), yeah, fuck with this (ya'meen)\nIf you get it poppin', or get to poppin' 'em (ya'meen)", "image": "https://images.genius.com/3ddccdf6d7612b941c3c9dfb5048829a.1000x1000x1.jpg"}], "artist": "Method Man"}