{"songs": [{"title": "Killin Me", "album": "Down With the King ", "year": null, "lyrics": "(TALKIN)\nPaul Wall turn the bling in ya teeth down\nWill you please turn the bling down in ya mouth\nNigga i left my shades in the car man could you please turn the bling down in ya mouth\n\n(CHORUS X2)\nThese niggas KILLIN ME swerin that dey trill as me\nYou gona see me in tha streets some drama what it's finna be\nTalk all that shit you wanna talk imma let tha burna talk\nWe tha ones you heard about we show you what dat murda bout\n\n(Verse 1)\n(Paul Wall)\nYou can catch me squeezin GLOCKS pullin triggas and evadin tha cops you dont wanna see me squarading the blocks so i suggest you that you vacade this spot these boys be swearin they hard but you dont want it with the clique i claim you talkin loud but you ain't sayin a thang man speak into the mic man CLICK CLACK BANG BANG BANG\nYou need to be wearin panties cuz you packin pussy\nYou better not push me, when Macboney unload the result is\nYou're gonna be bloody, scabbed up and pussing\nYour talk is cheap I let my actions speak louder than your\nWords, first I bite, then I bark, keep your cool before I\nCalm your nerves\nWhat you know about the place I'm from? (nuttin)\nYou dunno about the hood I rep. (nope)\nYou don't want me to unload the clip (no), sink your ship, rearrange your lips. Watch your steps be careful cuz you\nStompin heavy on dangerous grounds, I got wind wit a full\nTwelve rounds keep talkin down and you'll get stomped down\nI don't play the radio and disrespect and attempt to\nRearrange your thoughts, the end result is your brains in a box so I suggest that you change your thoughts\n\n[Chorus]\nThese niggas KILLIN ME swerin that dey trill as me\nYou gona see me in tha streets some drama what it's finna be\nTalk all that shit you wanna talk imma let tha burna talk\nWe tha ones you heard about we show you what dat murda bout\n\n(Macboney)\nI'm hotter than lava straight up from the city\nWit somebody's baby mamma, how dey gonna kill me\nWhen I'm ready for da drama? i ain't got nothin to loose\nImma blast all partners den dey ass gon wonder den mash round the corner tryna crash my show, put a tag on ya toe\nYa'll ain't killas, ya'll just assholes with another hoe\nNigga talkin trash like a hoe, this fag gotta go\nLet my trap niggas run up, knock him to da floor\nLet me punch him with tha ring, get the gators in his throat\nShould I let him live? If I gotta ask, hell no\nHangin hard up his squad that's for dem to consume\nI don't take no stuff, unless it's yo girl wit her legs\nStraight up when I bust verse you were [unknown..] spittin\nBooze out yo car, you a fool by the luck, cuz you finish\nWhat you started and you loose, time-up, put yo brains on\nDust cuz you layin on the dust, thought you were bad but\nThat rife hangin up come fight like a man but yo ass ain't\nTough, just a big fat chump. Nigga show em the part where\nDey be walkin on wheels, come past for me, I'm waitin for\nYa any day nigga, when ya comin? Fuckin with TIP, ask him\nHow we done it, that was back in the day\nNow we got more banana clips ready for the dumpin, respectin the streets so nobody sayin nothin, AKs so cunnin\nNever see me comin, just a bunch of people runnin. Ya'll\nNiggas don't want it!\n\n[Chorus]\nThese niggas KILLIN ME swerin that dey trill as me\nYou gona see me in tha streets some drama what it's finna be\nTalk all that shit you wanna talk imma let tha burna talk\nWe tha ones you heard about we show you what dat murda bout", "image": "https://images.genius.com/bfc7d65a3c5f16d272808f97615ac5f6.360x360x1.jpg"}], "artist": "T.I."}