{"songs": [{"title": "Slept on Tony", "album": "GhostDeini the Great", "year": "2008-12-16", "lyrics": "[Intro: unknown male]\nNever under estimate Tony Stark\n\n[Hook: female singer (samples)]\nYou done slept on Tony\n\"Tony Starks!\" \"Ironman!\"\nYou done slept on Tony\n\"Yo, before that, I was getting it on\"\nYou done slept on Tony\n\"Tony Starks!\" \"Ironman\"\nYou done slept on Tony\n\"I was getting it, getting it, getting it on\"\n\n[Ghostface Killah]\nYo, when they kidnapped your boy, and forced me to do evil\nI created an iron suit, to protect my people\nEscaped, bound to be Ironman the great\nThe billionaire Tony Starks'll renew your fate\nBuilt Stark Towers, throw the biggest events\nGot liquid, armor, I can paint all dents\nKeep a few bad chicks, I ain't your average hero\nMovie premieres, catch me wit Denzel and De Niro\nSix six eleven gold, playboy industrialist\nFace of a ghost, mind of a technologist\nSpecialist, modern day speech slang therapist\nScecialize in weapons, I can blow off terrorists\nSo, so don't sleep big homey\nReal recognize and I can see you phoneys\nMy weak heart can't take it, got a life long sentance\nBoy genius grown up, and I fight with a vengeance\n\n[Hook]\n\n[Ghostface Killah]\nYo, I got steel toe wallies when I glide on stage\nAnd my heart gently weeps in an iron ribcage\nPunctured by metals, replaced by elements\nMy enemies hunt it like a tusk on the elephant\nExtraordinary, hiding my duel identities\nAnthony Stark, call me Ton', the top pedigree\nMulti-billionaire, military contractor\nCrushing my opponents, with the strength of a compactor\nEx-factor, I turn liquids to metals\nWater to wine, I turn dirt into rose petals\nGreatest man walking, blow a bottle of Goose\nGoldy plat iron armor, to Versace suits\nI'm so elegant, scientifically intelligent\nMy lawyers won the case, I won't take the settlement\nMoney's irrelevant, I need heat to energize\nWe taking over the planet, Stark Enterprise\n\n[Hook]\n\n[Outro: unknown male]\nOnce again, Tony Stark, infinite finesse\nStopped the planet, and destroyed an indestructable track", "image": "https://images.genius.com/469fdc23501d689480b2d8fa549f0636.240x240x1.jpg"}], "artist": "Ghostface Killah"}