{"songs": [{"title": "Nobody Does It Better", "album": "Life Is... Too $hort", "year": null, "lyrics": "Funky fresh on the microphone\n\nToo $hort\nToo $hort\n\n[Verse 1 ]\nSee, I'm fresh like always, I'm comin at you\nAnd you know I won't stop till I'm through\nSo get on it. now is the time\nToo $hort, baby,'s gonna spit that rhyme\nAt you, cause I'm jammin, so check me\nI play the music, even made the beat\nCause I'm the most rappin, most rhymin\nRollin in a drop-top straight high-sidin\nOn you, boy, I'm poppin the most\nI come from Oakland, don't play me close\nCause I'm a player, love to play this game\nI get funky out here, pumpin the name\nToo $hort, the one and only, I just rock it\nFat bankrolls in my pocket\nCall me 'the dirty rapper', I'll say, \"Sure\"\nBut I'm a young black entrepreneur\nI'm an MC, right? I own a company too\nProgrammed the drums and made the groove\nSo when you look in my face you see a wealthy man\nI hope it's not hard for you to understand\nI'm the businessman, it's not the same\nI'm treated like a dope dealer runnin the game\nAnd you wonder why I can't get no peace\nI'm makin more than the chief of police\nI'm\n\nToo $hort\n\n[Verse 2 ]\nNow that I've established one fact\nI came here to rap\nYou got a choice to make about me\nCan I get busy, are my raps too weak?\nBoy, you're too grown, don't say I'm borin\nJust because you know I come from Californ-\nIa where many rappers get no respect\nI'm at home in a tape deck\nI get played and played until it's all played out\nSucker MC's come to my house\nThey want a contract, get signed up\nBut like toys they need a good wind-up\nThen the other suckers, sayin no names\nRap on the mic and use New York slang\nEven though we don't talk like that out here\nThe point I'm tryina make comes out so clear\nYou want paper or plastic, Visa or cash?\nYou wanna burn rubber, homie, step on the gas\nNow nip, dip, roll the strip\nGonna take your mind on a serious tip\nLike always I made the beat funky\nI keep your head bouncin like a dopefiend junkie\nI got to say it before I break\nI never rap fake\nCause I'm\n\nToo $hort\n\n[Verse 3 ]\nSee, I'm fresh like always, no sweat\nIt's time to jump back in the mix and get\nOn it, now is the time\nToo $hort, baby,'s gonna spit that rhyme\nI sell records everyday\nAnd still I get no radio play\nI got homies, they love my beat\nSo you hear me all over the streets\nI take pride in the bass, I make it deep\nThe kinda tape you'll always keep\nSo if you lose it, you're not my mama's son\nIt ain't free, go and buy another one\nLike a costume party on Halloween\nMC's pop up on the scene\nSo you made a record, I saw your poster\nI'm still harder than you, boy, look closer\nWon't say who's best, I just tell you the truth\nYou're not makin money, so it couldn't be you\nSo if that leaves me, Too $hort, baby\nI keep it in tune like do-re-mi\nWith a strict rap tempo, bassline simple\nTake that, it's a Too $hort rap\nIt's on you, boy, I'm poppin the most\nI come from Oakland, don't play me close\nCause I'm\n\nToo $hort\n\n[Verse 4 ]\nNobody does it better\nTell you, nobody does it better than Too $hort\nI take a limousine to the airport\nFly first class, never ever last\nCause a brother like me, I pay cash\nTwinkle, twinkle, star in the night\nDon't look now, but I'm shinin bright\nI know you wanna hear my triple x\nFoul language, girls and sex\nWell, I'm gonna tell you bout livin the life\nStayin in school and not smokin the pipe\nIt's hard to be a rich man, don't you know?\nWhen you drop out of school and start smokin dope\nIt goes d-u-m-b\nYou're lookin for some d?\nThen start tweakin, it's goin on\nYou don't like it? Well, play another song\nI got rhymes, you wanna hear?\nI sing em every day of the year\nYou try to get it, you think you got it\nI hope you like it, cause you sure can't stop it\nThis rap is so funky fresh\nToo $hort, baby, in the flesh\nAnd if you ever say I'm through\nSo what? I'm makin more than you\nCause I'm\n\nToo $hort", "image": "https://images.genius.com/9ed3ca4bcc64d64446ff7e9bea94be4e.600x600x1.jpg"}], "artist": "Too $hort"}