{"songs": [{"title": "Flipside (Rough Version)", "album": "The Calm Before the Storm: Part 1", "year": "1999-11-09", "lyrics": "[Intro: Girl & Tech]\nOnly if you promise to smack me god damn it\nI think I'm gonna do the uhh.. hook on this one, yeah\nOkay, turn around so I can hit it from the back\nNo\nCome on!\nI don't want to\nYou don't want me to hit it from the back? Come on! BIANC!\n\n[Verse 1: Tech N9ne]\nI like to hit it on flip, don't trip\nI make it worth it, if you nervous I got the service\nThat'll make you work it, you deserve it\nA sex spot to flex wet spots with grip\nStressin' now, 'cause ain't nobody throwin' tips\nYour hips so amazin', I'm gazin', you blazin'\nPraisin' and I no longer shriveled like a raisin\nI'm stoned - hopin' that your homegirl I entered is\nI'm down, even if is Ellen Degeneres\nI'ma clown the punana, pound the pupan\nHate it like a crouton, wise words from God Zoutan\nThe flip baby, no gip baby\nNinna like the way you strip, baby, no way you dip ladies\nSee me in your city, be ready, when I'm looking for some fun\nI be coming at you, five hundred worth of 1's\nJust the trick off, gather your oils to lick off\nYou and your homegirl rollin' with me, jerkin' my dick off\nNot a rip off, just gettin' it tossed the lip gloss\nYour lips lost so deep in it, they callin' me the pit boss\nI'm lovin' it the way you got me shovin' it\nDoggy slip-slide, much obliged\nI cried when I hit it on the flipside\n\n[Chorus: Tech N9ne and Girl]\n(Which side?) Flipside\n(This side) Ladies so I can dip die\n(That's right)\nAin't nothin' thick about the way I like it\nThe jiggle making me fizzle when you make it, make it wiggle a little\nStay on the flipside\n(Which side?) Flipside\n(This side) Ladies so I can dip die\n(That's right)\nThis ain't no ballad talkin' about how I'm in love\nThis is strictly for the strippers in the club, on the flipside\n\n[Verse 2: Tech N9ne]\nMeet me in Las Vegas, I'm stayin' at the Grand\nKeys under Ninna when you be fightin' with your man\nInto it, no undees, get ready to bungy, jump me\nKnew you meant business, when you ripped out my Abercrombie\nHormones hungry, like to get me down under like Crocodile Dundee\nKeepin' your sex weapons from me, I'm grungy\nNot mean and I'm way freaky like zombie\nFriday to Sunday yellin' Tech, I love the way you done me\nAnd then I'm Solomon Grundy, you's a flower when I killed it\nYou wilt it, who got power, call me (Deep Space N9ne)\nOn [?] 'cause I rocked 'em all with socks and all\nY'all 'iancs, I hit the lots of y'all\nSlots, (show 'em, show 'em what you got)\nGirl you makin' it hop, it syncopated with pop non stop\nThis game is silky, I hope you milk me\nI'm fiendin', not killin' me 'cause you\nCan't touch my vibe, if you jockin' Kenin\nI fly in semen, you crying freeman\nIt feels so well, get chills in Hell Screamin' demon\nBefore you nut up I want you to shut up\nAnd give it to me face down, butt up\nI just die, when I hit it on the flipside\n\n[Chorus: Tech N9ne and Girl]\n(Which side?) Flipside\n(This side) Ladies so I can dip die\n(That's right)\nAin't nothin' thick about the way I like it\nThe jiggle making me fizzle when you make it, make it wiggle a little\nStay on the flipside\n(Which side?) Flipside\n(This side) Ladies so I can dip die\n(That's right)\nThis ain't no ballad talkin' about how I'm in love\nThis is strictly for the strippers in the club, on the flipside\n\n[Bridge: Tech N9ne and Girl]\nCan you feel it, baby? (20 to touch my waistline?)\nI can heal it, baby (40 to touch, bust and grind)\n'Bout to kill it, baby (200 bucks a good time)\nI wanna do it baby, stick it baby (Sex on the mind)\n\n[Verse 3: Tech N9ne]\nEnough! Girl you drivin' me nuts\nYou and your homie's hype horny comin' back from peanuts\nWith hokie-pokie, on the brain and we can keep it low-key\nB they hottest when they comin' back from sokey\nWhat up to upholstery, listen closely\nLap dance in the corner, I'm all up on her\nTwo more Coronas, you leaving with me\n'Cause I'm increasing the fee, you leasin' to pee\nHella fat like Jackie, pleasing me\nI admire, what you do call girls, the way you dance\nAnd strip, deck down to your tips, beautiful lips\nYou say that you like it way better from a wild style\nNigga comin' sex-crazed at you on the flipside\n\n[Bridge: Tech N9ne and Girl]\nCan you feel it, baby? (20 to touch my waistline?)\nI can heal it, baby (40 to touch, bust and grind)\n'Bout to kill it, baby (200 bucks a good time)\nI wanna do it baby, stick it baby (Sex on the mind)", "image": "https://images.genius.com/1d4a12a154c6cf30e77857bb018ab602.1000x1000x1.jpg"}], "artist": "Tech N9ne"}