{"songs": [{"title": "THE BROWN STAINS OF DARKEESE LATIFAH PART 6-12 (Remix)", "album": "Cherry Bomb", "year": "2015-04-13", "lyrics": "Part 1 - THE BROWN STAINS OF DARKEESE LATIFAH PART 6-12 (Remix)\n\n[Verse 1: Tyler, the Creator]\nOh, you the motherfucking man, huh?\nOh, you be fucking bitches, counting all the bands, huh?\nOh, you be trapping out the bando selling grams, huh?\nOh, you be smoking, drinking lean, and popping Xans, huh?\nYou see, that's the bullshit that I don't need\nI'm telling y'all niggas, y'all ain't fucking with me\nSee, I look in the mirror and he said, \"You are the man\"\nAnd I said, \"Hey man, I agree\"\nRocks on rainbow, Ben's a nice fellow\nYour neck reflects your personality, and mine is yellow\nBoy, I hit the block, like I hate Legos\nThey know, they got thirty seconds; Jared Leto\nBefore they see some halos, and I reload the ammo\nBoy, it's Golf Wang-o, and that's the squad I bang-o\nUntil my fucking brain go, now let's reload the aim-o\n\n[Verse 2: Tyler, the Creator]\nCan't a nigga get some fucking chaos in hurr?\nI'm the truth and the dare\nAnd you can get your ass beat like a kick and a snare\nScHoolboy's my niggy, you know I'm good in the 50s\nThat boy's not that bad, enh, it's no Biggie\nIt's the G-O, the L-F, we go-go, no homo\nWe black out, and go hard like JoJo and fuckin' Diggy\nNo ship in this series, since I pissed off Iggy man\nWe been that man since Batman had a sidekick\nCatch me in some Vans like one of them soccer mamas\nAnd them bitches blue like that family went to the Dodgers\nSolve 'em (Oh no!) You can't bitch, I'm a problem\nAnd you'll get fucked up like the thoughts inside of my noggin\nGoing harder than the quidditch in Harry Potter\nAll my shows got one black in it like Larry David\nAnd I'm that nigga, meaning I'm two niggas, I'm schizo\nBrent Lowe, my motherfucking bingo\nPink and yellow on my neck remind you of my dickhole\nAnd I don't really fuck with you niggas, shout out to Jim Crow\nDon't get offended, love being darkskinned\n23 with the crib and I don't got no tenants\nAnd I don't like sports, but the court got a tennis\nIs that diamonds on your neck? Stay the fuck out my business\nSee, that's that Cherry Bomb, get my burr on\nThat's McLaren, '91 out the Chevron\nMotors Flog Gnaw, Vans on, fuck your Jordans\nWent from throwing up to throwing carnivals\nBoy, I'm a sicko, flaco nigga, but kinda macho\nBoy, I got some vatos and shout out to ScHooly, he kinda loco\nPack a de la pistol, we splitting nachos, then for that cheese\nBoy, he was using some shells just like a taco, so grab your goggles\nNigga, Taco Tuesday, you don't want none of that\nHave you heard of Fairfax? Boy, we was running that\nNigga took the store from us, yeah, fuck all of that\n(Man, he really took the store)\n\n[Verse 3: ScHoolboy Q]\nCrack a cracker with a barrel, uh (yeah)\nGang bang tattoos, this ain't a Louis rag (rag)\nOrange Paisley got me crip crazy (uh, sup cuz?)\nPants heavy, sag to the left with the belt strapped\nNo face mask, nigga, just toe tags\nStill the blunts getting passed, yeah\nAin't worried 'bout no niggas (nigga)\nI don't grieve over suckers (sucker)\nGunpowder on my knuckles (knuckle)\nCall the ambulances (ambulances)\nI'm from the era of crip walking\nYou was clown-dancing, you wanna be me, huh?\nCuz is wack in his raps and what he rap, he ain't done\nTop Dawg, Wolf Gang, smell the cat on your tongue\nPussy boy, you fucked over, nigga, control your gums\nTeeth missing, moms' won't recognize your face when it's lump\nMy square homie's license, double life in my trunk\nMind, power, body, and soul, we break handcuffs\nGot a strike on my record, double cups, and duck\nYou want the life like us, you need to crip that coast\nYou want to steer that wheel, you want to smoke that kil'\nWell, who am I?\n\nPart 2 - SPECIAL (Hidden track, physical only)\n\n[Intro]\nShit, piss, fuck, cunt, cocksucker, motherfucker\nAnything that'll piss you muthafuckas off\nI don't even smoke and I'm a level up of all of y'all\nBitch, you couldn't reach me with a ladder and a calling card\n\n[Hook]\nI'm special, nigga\nWho the fuck are you?!\nI'm special, nigga\n\n[Verse]\nThey used to tell me to calm down, said I have a problem\nNow I'm runnin' shit, that's why you never see me wearin' joggers\nLead by example, how?\nAll y'all is my son and I ain't never had a fuckin' father\nBoy, I'mma bring the noise\nI got my own beat and we all got drums\nWhat these weapons about? We're just flexin' about\nYou on your grind who the one that got the wep at their house?\nBitch, I do this on purpose, you niggas don't got a purpose\nThis nigga call me a clown, nigga I own the circus\nStack is sittin' in my pocket folded up like a papaya\nYou know I golf bitch like I been sleepin' with Tiger\nWoody woody, my mob, mob is goodie we Oddkast\nWe o-K-K-K just like the clan\nHoodie golf shit packet, rip it out the fuckin' package\nIn that all pink fit lookin' like a fuckin' faggot\nWho the fuck you think you fuckin' with, nigga!?\nI'm a bad case of I don't even know\nI'm about to tear the shit out this goddamn house\nI think I'm about to blow my muthafuckin' brains out\nTyler, take a chill pill, nigga", "image": "https://images.genius.com/bc37e364cd39806bba7469442454fc50.640x640x1.jpg"}], "artist": "Tyler, The Creator"}