{"songs": [{"title": "Come On", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Intro: The Notorious B.I.G. (Diddy)]\nMotherfucka was amped (Uh huh)\nThe nigga was motherfuckin hyped up (Right?)\nThe nigga just grabbed the nigga, snuffed the nigga\nAnd it was on from there\nThe motherfucker there wasn't nuttin stoppin him\n(What what did the rest of his niggas do?)\nMan the motherfuckers was just ready for anything\nThem niggas was packin burners\nThem niggas was ready to fight (Oh shit)\nWhatever we had to do holmes (Uh huh)\nNiggas was on the real flipmo' holmes (Uh huh)\nIt was just comin out like a motherfucker (Right)\nThe nigga amped be like come on\nCOME ON MOTHERFUCKER!!!\n\n[Hook]\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\n\n[Verse 1: Sadat X]\nLet's go deep into the phrase, feel the sun rays\nOff the forehead, everything is real\nBiggie put me on this joint, so I'ma be the big wheel\nWatch it spin, hey dad, placed your bet on seven\nPeace to 106, 108, 110 and 111th\nHey Biggie, I understand you're from Brooklyn\nWith .22s in your shoes, yo, keep this joint cooking\n\n[Verse 2: Notorious B.I.G.]\nWell, why not blow up the spot with Sadat?\nRelease the brainstorm to make your motherfucking brain warm\nA strange form, something kind of lyrical\nBiggie the bastard, Sadat's kind of spiritual\nWell, in God we trust, guns I bust\nGot that disgusting, sewer-style dumping\nAnd, uh, do you know where you're going to?\nDo you like the things that I bring?\nMake an MC wanna sing for a living\nTake the beatdown we fucking giving\nC'mon, motherfucker!\n\n[Hook]\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\n\n[Verse 3: Sadat X]\nWhat? Niggas want drama, putting work on my block\nWhen I told y'all last week that shit was too hot\nSelling deuces and treys cuts my dimes\nSomebody don't get paid, somebody's block get sprayed\nReaction is delayed as ya run down the block\nCaught one in your chest, your breath come in spurts\nHey yo, Biggie, tell these niggas I'ma hit 'em where it hurts\nThe Big City, it don't spare no bodies\nCall me papi chulo, to all the Spanish mamis\nI'm about ten blunts down, drank three or four stouts\nSeen five fat asses, passed this bitch with glasses\nHey, your money, that's your stock, yo bitch, pass the Glock\nI'ma tell them, \"It can happen, don't play me with that rap shit\"\nLife is real, so Biggie take the steel\n\n[Hook]\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\n\n[Verse 4: Notorious B.I.G.]\nI got seven Mac-11's, about eight .38's\nNine 9's, ten Mac-10's the shits never end\nYou can't touch my riches\nEven if you had MC Hammer and them 357 bitches\nBiggie Smalls, the millionaire, the mansion, the yacht\nThe two weed spots, the two hot Glocks\nHuh, that's how I got the weed spot\nI shot dread in the head, took the bread and the lamb spread\nLil' Gotti got the shotty to your body\nSo don't resist or you might miss Christmas\nI tote guns, I make number runs\nI give MCs the runs dripping\nWhen I throw my clip in the AK, I slay from far away\nEverybody hit the D-E-C-K\nMy slow flows remarkable, peace to Matteo\nNow we smoke weed like Tony Montana sniff the yayo\nThat's crazy blunts, mad L's\nMy voice excels from the avenue to jail cells\nOh my God I'm dropping shit like a pigeon\nI hope you're listening, smacking babies at they christening\nSo you better grab your pistol\n'Cause if you sit still, I'm gonna make your fucking shit spill\nAnd I'm talking 'bout buckets, why did I have to do it?\nSadat said fuck it, you got a gun, nigga bust it\n'Cause I got mo' shots to pop ya\nBig Poppa, breaking you off something proper\nSigning off is the hardcore rap singer\nAKA crack slinger, bring it any time nigga\n\n[Hook]\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on\nCome on, motherfuckers, come on", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}