{"songs": [{"title": "My Drug Addiction", "album": null, "year": null, "lyrics": "I don't know what point exactly it started to be a problem, I just remember liking it more and more, whenever people would try to help me I would say get that fucking person outta here, I can't believe they said that shit to me, they don't know anything about me or my life. It's not like I'm out here snorting coke or shooting heroin up my arm.\n\nIt's either you have a problem and can you control it or you can't, I literally thought I could control it until I overdosed during Christmas of 2007. Had I got to the hospital about two hours later, I would have died. My organs were shutting down. My liver, kidneys, everything. They were gonna have to put me on dialysis, they didn’t think I was gonna make it.\n\nI remember coming out of rehab and relapsing and shooting right back up to where I was when I overdosed. I was ransacking my whole house just looking for a stash of Vicodin that I maybe hidden away and then I found some in my basement wrapped up it was the extra strength ones.\n\nAfter I got out of rehab I did not sleep for three week straights I mean like not even nodding off for a fucking minute I would just sit up and stare at my TV.\n\nI would walk around my house and thinking every single day, \"I'm gonna fucking die.\" I'm looking at my kids, and like, I need to be here for them. I'm growing. I just couldn’t believe that anybody could be naturally happy or naturally function or be just enjoying life in general without being on something\n\nThe doctors told me I'd done the equivalent of four bags of heroin,\nI was addicted Valium, Ambien, the numbers got so high I didn't even know what I was taking anymore. It never once hit me that drug addiction runs in my family, now that I understand that I’m an addict, I definitely have compassion for my mother. I get it now.\n\nI wanted to make an overall statement — I’m back. It was a slow process. You gotta remember I hadn’t recorded a song sober in seven years. So it took me a while to even feel like I could record a song sober … I don’t know the last time I shot a video sober, without drinking or taking anything. It’s been years.\n\nI almost feel like a little kid again with rap, I wanna play around with different flows. If I don’t feel like it’s what I’m fully capable of, if there’s one weak line, I wanna change it. Rap was my drug It used to get me high and then it stopped getting me high. Then I had to resort to other things to make me feel that. Now rap’s getting me high again.\n\nSo I would say to anybody, it does get better, you know. It just does.", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}