{"songs": [{"title": "The High Life", "album": "Young Sinatra: Welcome to Forever", "year": "2013-05-07", "lyrics": "[Verse: Logic]\nSeem like my whole life changed in the last year\nAt parties with legends like \"What the fuck I’m doing here?\"\nWaiting for someone to say \"What the fuck you doing here?\"\nUntil I realized I belonged and had nothing to fear\nWho would’ve thought I would mingle with celebrity singles\nIn a room full of Grammy winners discussing they singles\nSome people love you, some people hate you\nSome people need you, some people act like they know you\nBut they can’t even read you\nThe effort I put into music is still the same amount\n'Cause ain't a damn thing changed except the bank account\nI remember the day I got my advance money\nI’m talkin' so much bread, this shit'll make you dance money\nWhat's the first thing I did?\nGot my team out the way and then I got myself a crib\nMy boy Lenny gave me a place to stay for a year\nPut food in my stomach, I had nothing to fear\nAnd once that 365 was up, I told him to quit his job\nAnd gave him a new career\nSo many rappers on that stupid superstar shit\nBut I plan to eat with the people I starved with\nI’ve made money, I’ve lost money, I’ve spent money\nI've slept outside due to lack of the rent money\nI’ve been in love, been happy, been through a lot of pain\n'Cause what the fuck is sunshine without a little rain?\nAnd love is like leaves in the fall\n'Cause some people get scared and leave when you fall\nSpeaking of which, I met this girl the other day\nThe type of girl that make the pain fade away\nAnd I have a feeling she gon' be my next\n'Cause she make me forget all about my ex\nI’m talking something that’s deeper than just sex\nBut I don’t want her to be the third letter in the word next\nOld soul in the sea of love\nI’m just not current, none of the above\nAnd man, fuck all that depressing shit\nLet’s get this money and fuck these bitches\nYou know what I’m sayin?\nSike, nah, all of y'all just know that I’m playin'\n'Cause all the money you possess ain’t what makes you a man\nBig shot, tough guy, blow 100 grand\nBut you still in the same place, damn\nBut man, the world is so fascinating\nAmbition got these girls gravitating\nAnd honestly, it strokes the ego\nBut beautiful women ain’t good for nothing\nExcept procrastinating\nI got a show in Paris coming up\nFollowed by London, I'ma tear it up\nSo many people just don’t care enough\nAnalyzing faces in the crowd staring up\nWhat's the difference between me and them?\nHow come I ain’t in the crowd at they show seeing them\nWhat that guy see in me that he ain’t see in him?\n'Cause honestly I see no difference between me and him\nWe all people, all equal, we all the same?\nLookin' for control tryna play the game\nWe all got issues, just different magazines\nWe all sleep but have different dreams\nHowever, once you’re awake and your life ain’t what it seems\nAnd that’s the reason I’m living within my own dream\nHell yeah, fuck 'em all like I’m runnin' from the law\nHaters probably think they phase me, I’m like no, not at all\nI’m too high up, now to fall\nLike a sphere, bitch I ball\nNever asked me where my team at\n'Cause you know I brought em all\nAnd if you’re looking for a problem then we can get it solved\nI just kill them with kindness, keep it peace and it dissolve\nYou got bitches, I got Bobby Soxer girls that be ride or die\nA shawty on another level, let me catch a vibe\nSuper bad girl, IQ is in the sky\nShe graduated cum laude, your bitch went to DeVry\nGod damn, oh girl, she a go getta\nAt the party takin' shots like a Beretta\nDoing anything and everything to feel better\nAnd now she in the crib getting high like a falsetto\nHow you feeling, I be yelling\n\"Why these motherfuckers grilling?\"\nAnd she give me life ‘cause I’m making a killing\nBring it down, do it slow, show me how that really go\nGirl I’m new in town, I don’t really know\nThey be like, when you gonna tell me that you love me?\nI be like, \"Bitch I gotta hit the studio, ho\"\nNow she got me on the crib, talkin' that she wanna do it\nCondom on the dresser looking at me like ain't nothing to it\nThinking should I do it though, I don't even know the ho\nI don't even know the ho, I don't even know the ho\n\n[Outro: Elijah Blake]\nSayin', \"Ohh, mama I made it\"\nOhh, mama, I made it\nYou cannot tell me no\nBut the young boy made a way\nOh-oh-oh, oh-oh-oh, oh-oh-oh\nI said, oh-oh, oh-oh-oh", "image": "https://images.genius.com/da76d57af3e6ee702af91bac2a18326a.1000x1000x1.jpg"}], "artist": "Logic"}