{"songs": [{"title": "Press Play", "album": "Ego Trippin’", "year": "2008-03-07", "lyrics": "[Intro: Kurupt]\nYeah, what up bitch?\nKurupt Young Gotti, “Ego Trippin'” ho\nHa-ha, what up Snoop?\nWe back in this bitch homie, ey Daz!\n\n[Chorus: Kurupt]\nSo many, so many, so many G's in a 'Lac\nBlowin' weed in the back\nSwitch hit a switch, D.P.'s in the act\nBig Snoop Dogg, he a boss like that, bitch, yeah\n\n[Verse 1: Snoop Dogg]\nBendin' the curb swervin', blowin' on some izz-erb\nThe boss has returned, I'm still flyer than a bizz-ird\nRidin' and Rollin' with them Steelers like I'm Pittsburgh\nGo against the gang the man will have your whole clique served\nNice with the mic thang, the hoes love my pipe game\nPut it in the hole all night, I got nice aim\nSnoop Dogg nigga, how many times I got to show ya?\nYou don't wanna see this loc'ster Calvin Broadus from the shoulders\nSo, just get your rap on, that I never slacked on\nHo, you got your strap out, here we get our jack on\nDick you hoes can snack on, you and your whole crew\nI'll pull out my nine, now do what you hoes do\nDi-Di-Di-Dogg Pound, I came to break it down\nGod bless my pimp bone, gettin' my ego trip on, fool\nEase back before I trip on you-uh, flip on you-uh\nAnd have them hollows rip on through ya, boy\n\n[Break: Kurupt]\nDogg Pound is up in this bitch\nRiders, yeah, ey Snoop\nThese niggas ain't shit man\n\n[Chorus: Kurupt]\nSo many, so many G's in a 'Lac\nBlowin' weed in the back\nSwitch hit a switch, D.P.'s in the act\nBig Snoop Dogg, he a boss like that, bitch, yeah\n\n[Verse 2: Snoop Dogg]\nStill tokin', title holdin'\nDesert Eagle .45 totin', leave a niggas brain broken\nStill loc'n, still potent\nStill trippin', still tippin', yeah I'm still focused\nAnd I'm still flippin', words, do it like ki's for G's\nWe swerve-swerve across seas gettin' cheese with ease\nI'm still tallin' and, still ballin'\nDumb bitches still callin', foes still fallin'\nStill bustin' a ho, still gettin' bucks out a ho\nBitch get outta line I put my Chuck's on her throat\nStill hittin' switches, still gettin' riches\nStill the best in the game, I'm still hittin' pitches\nSo, what it do? I'm still at you\nI ain't forgot about the past 'cause, it still be fool\nGangsta shit, niggas get to ego grippin'\nIt's Snoop Dogg and I present to Y'all Ego Trippin'\nSo press play\n\n[Break: Kurupt]\nMan I ain't gon' tell you, niggas, again\nMan, we about seventeen years and rollin' fool\n\n[Chorus: Kurupt]\nSo many, so many G's in a 'Lac\nBlowin' weed in the back\nSwitch hit a switch, D.P.'s in the act\nBig Snoop Dogg, he a boss like that, bitch, yeah\n\n[Outro: Kurupt]\nMan, what else we gon' do, man?\nWe'll get this cheese, bang out, ride\nWhat up Soopafly, G-Dub, Nate?\nKurupt Young Gotti is definitely in this beotch\nWe do this, what up Dr. Dre, Daz?\nNigga we Ego Trippin' busta ass niggas\nCount us out, we come right back in\nPush us out this time punk\nYeah, and we doin' this our own nigga", "image": "https://images.genius.com/fd5ace5214e5da1f374653720da7d1c1.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}