{"songs": [{"title": "The Rain", "album": "Konvicted", "year": "2006-11-14", "lyrics": "[Intro: Akon]\nYeah, oh diddy oh diddy ohh...\nAh-ah-ah-ahh, ah-ah-ah-ahh\nAkon, Konvict Konvict\nAh-ah-ah-ahh, ah-ah-ah-ahh\nKonvict music, yeah\n\n[Akon]\nThe pressure's buildin up (oh) I feel like givin up (oh)\nHow in the fuck am I gonna back my first album up?\nWell everything has changed (oh) it'll never be the same (oh)\nNobody knew me then, now everybody knows my name\n... and I feel so ashamed\nI never been the kind of nigga that would complain (complain)\nBut it's so crazy man\nIt's no different, every day it's just the same thing\nNow it's been months out on the road\nOn tour doin so many different shows\nHead spinnin feelin like it's gonna explode\nAnd I just wanna know\nIf anybody out there's feelin me\nI'm losin my mind and I can't believe\nI let this shit get the best of me\nAnd now I gotta let ya know\n\n[Hook: Akon]\nWhat's got me insane?\nOhh, cause I can't stand the rain\nAyy, it's hitting my window pane, a little too much\nAnd now I gotta let ya know\nWhat's got my face in a frown?\nAyy, cause I can't stand the sound\nOhh, the thunder that's crashing down, upon my house\nAy, cause now I gotta let ya know\n\n[Akon]\nNow I got, no more worries now (now) my pocket's fatter now (now)\nLook in the mirror, my reflection looks different now\nYou're gettin bigger Akon you need to settle down\nWhy do I feel this way?\nShould I be happy or, should I just ignore\nEverything that I've been given, please help me Lord (please help me Lord)\nIt's all over but - I can't escape the raaaaain\nNow it's been months out on the road\nOn tour doin so many different shows\nHead spinnin feelin like it's gonna explode\nAnd now I gotta let you know\nIf anybody out there's feelin me\nI'm losin my mind and I can't believe\nI let this shit get the best of me\nAnd now I gotta let ya know\n\n[Hook] - minus last line w/ ad libs\n\n[Akon]\nSaid now whoa diddy whoa diddy whoa", "image": "https://images.genius.com/0ad650744a9848501bd0bdeb4763fe21.1000x1000x1.png"}], "artist": "Akon"}