{"songs": [{"title": "The Reunion", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro: Eminem & Royce da 5'9\"]\nAyo, this next song is a true story (Come here, bitch)\n'Cause some things in this universe\nDon't make sense but somehow always seem to fuckin' work\n\n[Verse 1: Eminem]\nFlying down I-75, 'bout to hop on 696\nI look over, this fuckin' chick's tryin' to fix\nHer makeup, I'm like, \"Bitch, you ain't a plastic surgeon\nI advise ya to put up your visor, I'm gettin' kinda ticked\nYou're blockin' my side mirror,\" she's like, \"Yeah, so?\"\nI'm like, \"So? You gon' need a stitch you keep acting like that, ho\nI look like your husband, slut? That's a rhetorical question\nYou talk to me like you talk to him, I'll fuck you up\nIn fact, get in the backseat, like the rest of my dates\nNo bitch rides shotgun; what? Taxi?\nStop and pick you some Maxi Pads up?\nIs that what you actually ask me?\"\nBitch reaches over and smacks me\nSays I annoy the fuck outta her, get in the fuckin' back\nPut on your slut powder, you slut, what?\nAnd shut the fuck up now, or get your feelings hurt\nWorse than my last chick when I accidentally butt dialed her\nAnd she heard me spreadin' AIDS rumors about her\nTurn the radio up louder, make it thump\nWhile I bump that Relapse CD\nTryin' to hit every bump in that cunt\nThought I snapped back into accents\n'Cause she kept asking me to quit calling her \"cunt\"\nI said, \"I can't!\", she said...\n\n[Chorus: Eminem]\nMarshall, you ain't really like that, oh, oh, oh\nYou're puttin' on a show, where's your mic at?\n'Cause you're breakin' my heart\nShe said, you're breakin' my heart\n'Cause you ain't really like that, oh, oh, oh\nYou're puttin' on a show, where's your mic at?\n'Cause you're breakin' my heart\nShe said, you're breakin' my heart\n\n[Verse 2: Royce da 5’9”]\nUh, pull up to the club in a Porsche, not a Pinto\nWhile Marshall's at a white trash party, I'm at drama central\nI walk up in there lookin' at my phone, on Twitter, tweetin'\nI'm feelin' a bunch of bitches looking at a nigga, cheesin'\nI get approached by this little skeezer, she asked me\nAm I the realest G? 'Cause I'm Gucci from head to feet\nI said, \"Yeah, I'm really is, 'cause I spit in your man's face\nLike Cam did that little kid on Killin' Season\"\nShe said, \"I'm feelin' your big ego, wait, am I talkin' wrong?\"\nI said, \"Nah, I'm a walkin' Kanye/Beyonce song\"\nShe said, \"I'm mad at you,\" I said, \"Why?\" She said\n\"Why you never make songs for chicks as if it's hard to do?\"\nI said, \"I make songs for me, leave the studio, and go\nAnd fuck the bitch who belong to who making songs for you\"\nShe said, \"I'm feelin' your whole swagger and flow\nCan we hook up?\" I said, \"Umm, you just used the word swagger\nSo, no!\" She said...\n\n[Chorus: Eminem]\nYou ain't really like that, oh, oh, oh\nYou're puttin' on a show, where's your mic at?\n'Cause you're breakin' my heart\nShe said, you're breakin' my heart\n'Cause you ain't really like that, oh, oh, oh\nYou're puttin' on a show, where's your mic at?\n'Cause you're breakin' my heart\nShe said, you're breakin' my heart\n\n[Verse 3: Eminem]\nWe been riding around in this hatchback 'til I'm fuckin' hunchback\nWhere the fuck's this party at, slutbag cunt? Cut what act?\nThink it's an act? Fuck that, I'm tryin' to shag, skuzz\nBetter find this love shack or somewhere to fuck at\nAh, don't touch that, you fat dyke!\nI'm tryin' to hear some \"Bagpipes from Baghdad\"\nDon't act like you don't like 'em, them accents, I rap tight\nAnd I'mma torture you 'til we find this place, yeah, that's right\nThought it was just past this light, just past Van Dyke\nBetter hit that map light, read them directions, oh yeah\nYou can't read, and you can't write, you told me that last night\nShe took my CD out the deck, snapped it in half like\n\"Relapse sucked,\" I snapped, hit the gas like\nBlew through the light, spun out, hit a patch of black ice\nForgot we had a trailer hitched to the back, we jackknifed\nBitch flew out the car, I laughed like she deserved it\nShe didn't think I'd act like that in person\n(Royce, Marshall just crashed right in front of the club)\n\n[Verse 4: Royce da 5’9” & Eminem]\nTell him I'll be there in a minute\nI'm tryna break up this catfight\nBetween my mistress and damn wife\nThen a chick wanted a hug, she was fat, so I gave her dap\nThen I tell her to scat, I'm not mean, I'm cute\nOn my way to the front door, takin' the scenic route\nTo avoid this chick with a lace front\nLookin' like Venus's and Serena's hooves\nI'm just sayin', them chicks got horse asses, they been attractive\nHope when they see me\nThey don't slap me with they tennis racquets\nMy mind drifted, back to this shit: I see my wife push her down\nStep over her body, then smack the mistress\nPolice outside, I turn and pass the gat to Vishis\nThen I step out and see my evil twin, he gives me an evil grin\nHe mugs the mistress, turns around\nAnd gives the missus hugs and kisses\nLooks at me twisted, like Nickel (\"Yeah, watch this shit\")\nHe smacks the dentures out of the mouth\nOf the fat bitch he rolled with, and looks back to mention\n\"Royce, it's good to be back to business!\"\n\n[Chorus: Eminem]\nThey said, you ain't really like that, oh, oh, oh\nYou're puttin' on a show, where's your mic at?\n'Cause you're breakin' our hearts\nThey said, you're breakin' our hearts\n'Cause you ain't really like that, oh, oh, oh\nYou're puttin' on a show, where's your mic at?\n'Cause you're breakin' our hearts\nThey said, you're breakin' our hearts", "image": "https://images.genius.com/e46d8c5b81dd5cfba852666c93111bef.1000x1000x1.jpg"}], "artist": "Bad Meets Evil"}