{"songs": [{"title": "Never Goin’ Back", "album": "Any Given Sunday (Music From the Motion Picture)", "year": null, "lyrics": "[Havoc]\nYo...\nAin't no hard time invented that Havoc can't handle\nIf cats only knew all the shit I been through\nHomicide, suicide, am I, losin my mind?\nJust, standin my ground keep it bottled up inside\nPractice what I preach Dunn, ride for my loved ones\nAsked about my life, no doubt had a tough one\nDid dirt, got dirt, shit only got worse\nBeen asked God why he put me on this earth, yo\nNot for nuttin Dunn, I want it all - can you blame me?\nNiggas just be settlin for crumbs\nHow dumb, how come, with no outcome?\nTen years later niggas still in the slums\nStrung off the next shit, dyin for they next shit\nFoamin from the mouth for the next man necklace\nAnd how about that, niggas too grown for that\nI'm holdin it down, now where your head at?  Yo\n\nChorus: Mobb Deep (repeat 2X)\n\nI ain't goin back, I ain't lookin back\nI'm movin ahead, now how about that?\nHell no black, I'm where the paper at\nLong as I don't forget where I came from\n\n[Prodigy]\nWe do it the Mobb way - leave em lookin like a strawberry\nMy outlook on life is quite very - positive\nI'm a content fella\nUntil you tamper with my plans to go on further\nFuck the hassle, it ain't worth my energy unless I must\nIf you insist, I'll be more than glad til his beef marriage\nMe and you til death do us\nScrape my fingertips on bricks, forty-two shot clips\nThat's my shit, do it like the old timers\nI use a wide holster, it's more discrete while I'm post up\nOr in motion, most niggas be floatin\nDon't even make eye contact, walkin\nDunn, pay attention that's how niggas die sooner\nWatch who you pass and it might be a reaper\nWatch my niggas we'll jump when you least thought\nWe came from the streets up, now we put G's up, so\n\nChorus\n\n[Havoc]\nYo, had time to think when just on the brink of death\nAt my front door me receivin slugs?\nOnly twenty-five, got fifty more to go\nAnd knows, their plot I hope they ass die slow\nHow though no dough, please don't show\nLike my man Twist said don't even see me when I blow\nGot, issue with my foes best believe I'ma solve em\nAnd laugh at your petty-ass problems\n\n[Prodigy]\nOut the slums of Queens, came a bunch of young gun niggas\nThe Infamous Mobb Deep\nWith dreams, of one day makin it big\nWith they Live Nigga Rap music, hard liquor swigs\nDirty Timbs, thirsty grins\nSmile all up in your face then I break your chin\nWent platinum, now them niggas writin scripts\nMurda Muzik the movie, pushin spaceships like..\n\nChorus", "image": "https://images.genius.com/acaa778c65b27a5d7a462b979fb7744b.200x195x1.jpg"}], "artist": "Mobb Deep"}