{"songs": [{"title": "Hailie’s Song", "album": "The Eminem Show", "year": "2002-05-26", "lyrics": "[Intro]\nDa-da, da-da\nYo, I can't sing, but\nI feel like singing\nI wanna fuckin' sing\n‘Cause I'm happy\nYeah, I'm happy\nI got my baby back\nYo, check it out\n\n[Verse 1]\nSome days I sit starin' out the window\nWatchin' this world pass me by\nSometimes I think there's nothin' to live for\nI almost break down and cry\nSometimes I think I'm crazy, I'm crazy, oh, so crazy\nWhy am I here? Am I just wastin' my time?\nBut then I see my baby, suddenly I'm not crazy\nIt all makes sense when I look into her eyes, oh, no\n\n[Chorus 1]\n‘Cause sometimes (Fuck) it feels like (I was scared) the world's on my shoulders\nEveryone's leanin' on me\n‘Cause sometimes it feels like the world's almost over\nBut then she comes back to me\n\n[Verse 2]\nMy baby girl keeps gettin' older\nI watch her grow up with pride\nPeople make jokes ‘cause they don't understand me\nThey just don't see my real side\nI act like shit don't faze me, inside it drives me crazy\nMy insecurities could eat me alive\nBut then I see my baby, suddenly I'm not crazy\nIt all makes sense when I look into her eyes, oh, no\n\n[Chorus 1]\n‘Cause sometimes it feels like the world's on my shoulders\nEveryone's leanin' on me\n‘Cause sometimes it feels like the world's almost over\nBut then she comes back to me\n\n[Verse 3]\nMan, if I could sing, I'd keep singin' this song to my daughter\nIf I could hit the notes, I'd blow somethin' as long as my father\nTo show her how I feel about her, how proud I am that I got her\nGod, I'm a daddy, I'm so glad that her mom didn't *reh tnaw*\nNow, you probably get this picture from my public persona\nThat I'm a pistol-packin' drug addict who bags on his momma\nBut I wanna just take this time out to be perfectly honest\n‘Cause there's a lot of shit I keep bottled that hurts deep inside of my soul\nAnd just know that I grow colder the older I grow\nThis boulder on my shoulder gets heavy and harder to hold\nAnd this load is like the weight of the world and I think my neck is breakin'\nShould I just give up or try to live up to these expectations?\nNow look, I love my daughter more than life in itself\nBut I got a wife that's determined to make my life livin' hell\nBut I handle it well, given the circumstances I'm dealt\nSo many chances, man, it's too bad, coulda had someone else\nBut the years that I've wasted is nothin' to the tears that I've tasted\nSo here's what I'm facin': three felonies, six years of probation\nI've went to jail for this woman, I've been to bat for this woman\nI've taken bats to people's backs, bent over backwards for this woman\nMan, I shoulda seen it comin', what'd I stick my penis up in?\nWouldn't have ripped the prenup up if I'da seen what she was fuckin'\nBut fuck it, it's over, there's no more reason to cry no more\nI got my baby, maybe, the only lady that I adore\nHailie! So sayonara, try tomorrow, nice to know ya\nOur baby's traveled back to the arms of her rightful owner\nAnd suddenly it seems like my shoulder blades have just shifted\nIt's like the greatest gift you can get, the weight has been lifted, and—\n\n[Chorus 2]\nNow it don't feel like the world's on my shoulders\nEveryone's leanin' on me\n‘Cause my baby knows that her daddy's a soldier\nNothin' can take her from me\n\n[Outro]\nWooo! Told you I can't sing\nOh, well—I tried\nHailie, 'member when I said\nIf you ever need anything, Daddy would be right there?\nGuess what—Daddy's here\nAnd I ain't goin' nowhere, baby\nI love you (​​*smooch*)​​", "image": "https://images.genius.com/c43578375ef2ac32c140cc35dfe2fef1.1000x1000x1.png"}], "artist": "Eminem"}