{"songs": [{"title": "Lights Please", "album": "The Warm Up", "year": "2009-06-15", "lyrics": "[Verse 1]\nYeah, I had this little bad thing, somethin' like them tens\nShe gave a nigga mad brain, somethin' like The Wiz\nBut, you see, the sad thing fuckin' with her is\nIs the chick ain't even have brains, dummy like a bitch\nSo I tried to show her about the world\nAnd about just who we really are\nAnd where we've come and how we still have to go really far\nLike, \"Baby, look at how we live broke on the boulevard\"\nBut all she ever want me to do is unhook her bra\nThen all I really want is for her to go down low\nBefore you know it, she wet enough to get drowned slow\nAnd all that deep shit I was previously down fo'\nReplaced by freak shit I am currently down fo'\nYou see I peeped it, pussy is power\nThat proud feelin' we get knowin' that pussy is ours\nAnd how it feels to feel that feelin'\nYou feelin' when you be drillin' that shit\nGot her sayin' you be killin' that shit\nAnd all the pain the world cause, she be healin' that shit\nAnd naw, that ain't your girl, dog\nBut you be feelin' that chick\nAnd you just wanna tell her everything she might need\nBut in the meantime it's lights, please\n\n[Chorus]\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\n\n[Verse 2]\nSo now we in the hotel, mirrors on the ceilin'\nShe say she wanna blow L's, I hear her and I'm willin'\nBut every time I smoke, well, a nigga mind gone\nSo that every word I spoke, well, I'm tryna put her on\nBut she couldn't hear me\nI told her all about how we been livin' a lie\nAnd that they love to see us all go to prison or die\nLike, \"Baby, look at how they show us on the TV screen\"\nBut all she ever want me to do is unzip her jeans\nThen all I really want is for her to get on top\nBefore you know it, she workin', jerkin' it nonstop\nAnd all that next shit I was previously talkin'\nIs now that wet shit that I'm currently lost in\nAnd while that sweat drip, I am reminded\nAll the times my brother told me that pussy is blindin'\nI'm findin', the more I grow\nThe more y'all seem to stay the same\nDon't even know the rules, but yet y'all tryna play the game\nAnd ain't it shameful how niggas blame hoes for givin' birth\nTo a baby that took two to make?\nCoward nigga, you a fake\nHow you gonna look in your son's face and turn your back\nThen go start another family?\nDawg, what type of shit is that?\nShe said it's okay, rub my head and told me to relax\nLaid a nigga down proper, like she was recordin' tracks\nSaid \"I know you wanna change the world\nBut for the night, please\nJust reach over and hit the lights please\"\n\n[Chorus]\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nLights please, ah-ah-ah\nLights please, ah-ah-ah\nLights please, ah-ah-ah\nLights please, turn off the lights\nLights, please\n\n[Outro]\nAlright, if y'all niggas heard the first one, The Come Up and shit, then you would have heard part 1 of this joint right here. It's \"Dead Presidents\", you know classic nigga, that's classic Jay shit. So I did it, threw it on the first mixtape, this is about a year ago. We let niggas hear like you know the mixtape whatever, and there was always this one nigga that stuck out to me like a year ago. This nigga's like \"yo\". like I thought I did my thing on this shit, that was like two of my favorite verses that I did, but he was just like \"Yo\", like, \"Yo you didn't come right man. If you gon' come on Dead Presidents son, you gotta come, hard son, you gotta come harder than that son, you gotta come harder than that.\" I was like, man what you mean I came hard? But, that shit always stuck in my mind, so doing this next, you know, doing this The Warm Up I was like, damn, I gotta get on it again, I gotta do it again. Just almost like, just to prove to that nigga and kinda prove to myself that you I can, I can maybe get a little...", "image": "https://images.genius.com/667aa37c796655c7e6a8bfed2d3eae7e.600x600x1.jpg"}], "artist": "J. Cole"}