{"songs": [{"title": "My Own Planet (Remix)", "album": "Street Hop", "year": "2009-10-20", "lyrics": "[Intro]\nDear Hip Hop\nI thought Hip-Hop was supposed to be a means of poetically expressing yourself\nBut it seems these days you'd say anything to get your CD's off the shelf\nHard times I am still compelled to move\nBut I swear to you it's that old school groove that's playing above the lyrics\nBecause if the music wasn't there, I definitely wouldn't hear it\n\n[Bridge: Royce Da 5’9]\nRight off the rip, nobody could fuck with me\nI'm out of space, mind and body, my soul and so on, so on\nMami, I'm fly is an understatement, come to greatness\n\n[Hook: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back for doing good\nI don’t need nobody else, I’m gonna do it by myself\nSay what you wanna say but stick to the facts, it’s all good\n\n[Verse 1: Royce da 5’9”]\nRight off the rip, nobody is quite like me\nYou gonna need a NASA spacecraft to sight me\nIf you don't like me, bite me, I could give a fuck less; fighting excites me\nLeaning on the moon with a patron fifth, playing my own shit\nAnd I sound terrific, I'm not cocky, I'm beyond that\nIt's time to start another hobby, I'm beyond rap\nRun and tell your baby daddy and your son Ray\nI'm hot, I sunbathe on the sun babe, I'm the one on the one way\nHands and pretty long legs from the runway, my nigga Nauny is a genius\nYou gonna need a ladder just to climb on my penis\nGot two words for the rap game: fuck y'all\n\n[Hook: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back for doing good\nI don’t need nobody else, I’m gonna do it by myself\nSay what you wanna say but stick to the facts, it’s all good\n\n[Verse 2: Royce da 5’9”]\nRight off the rip, you thought it was a wrap for me, didn't you?\nGo ahead and admit it hater, cold as ice, I'm a living refrigerator\nThe reason hip-hop's breathing the defibrillator\nI did a bid just for drunk driving, it'll never happen again\n‘Cause now I'm drunk flying, I'm an innovator\nWhen I say I'm on Venus, I don't mean that I'm dating the tennis player\nI'm on Saturn where you don't matter, alone\nI'm past the zone where your phone scatters\nHello? Can you hear me now you? You don't got a fucking choice\nElbowed my way into everybody's conversations\nWith rhyming, timing and patience, now I'm in space bitch\nI used to have to be on some watch what I say shit but now you gotta take it\n\n[Hook: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back for doing good\nI don’t need nobody else, I’m gonna do it by myself\nSay what you wanna say but stick to the facts, it’s all good\n\n[Verse 3: Big Sean]\nRight off the rip, the respect is demanded\nSitting on y’all so you can’t understand it\nI back a bitch down like a nigga chiropractic\nBack in this bitch like I’m putting on a jacket\nMission Impossible, fulfilling all my tactics\nBoi! Until I’m filling up a casket\nYou know, I think I'll have the soufflé\nMister Big Shot, Russian Roulette\nMy neck look like water boy, where is Bobby Boucher?\nBitches jump for me and I am not the bouquet\nI used to ride up in a put-put\nNow I rolls in the green, Tiger Wood putt putts\nYour girl used to be my butt slut, fuck my truck up\n‘Cause I’m fucking Tiger sluts, yup so hold your girl close\nAnd scream B-I-G like she recognize a ghost, fuck with me\n\n[Hook: Mr. Porter]\nI’m on my own planet, I’ll do my own thing\nThen turn around and pat myself on the back for doing good\nI don’t need nobody else, I’m gonna do it by myself\nSay what you wanna say but stick to the facts, it’s all good", "image": "https://images.rapgenius.com/a82ceb80cafd67005a0181ac465481b2.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}