{"songs": [{"title": "Off the Wall", "album": "Nutty Professor II: The Klumps (Soundtrack)", "year": "2000-07-11", "lyrics": "[Post-Hook: Eminem]\nNo matter what people say\nI'm gon' keep rapping this way\nNo matter what you may think\nI'mma keep doing my thing\n\n[Verse 1: Eminem]\nI'm the worst thing since fat bald men\nDecided to write songs to teach Mouseketeers to sing (Ahh!)\nI stick Britney Spears in a room full of mirrors\nSo she gets fifty years of bad luck\nCausing terror to Christina Aguilera\nWhen I grab her by the hair and drag her across the Sahara (AH!)\nBeware of this rap terrorist with a therapist\nWith a hair up his ass like a rabbit crawled in his pants\nGot a habit of holding Tylenol in his hands\nTill it melts in his fucking palms and dissolves in his glands\n(So who is it?) The fool who visit the playground\nWith two biscuits to lay down the school district\nGet pistol-whipped with a Mossberg\nWith a pistol grip, and fed pitbull shits\nSniff glue sticks like I give two shits (Yeah!)\nIf I get too rich, I just get sued\n\n[Verse 2: Redman]\nYo, I leave wit no injure, after I blow four in ya\nOne handstand on top of yo ninja\nCrash it, Doc stir the madness\nTill y'all outta work like Tony Atlas\nWalking, cans in the laundry basket\nAmerica's Most, with the army after us\nFuck flossing, we take what's yours\nUnload fifteen like an ace and four\nI'm outta work, but Doc laid them off\n(Shit, the power's out) The tape is off!\nYo, you targeted from arsonists\nPapermate pens filled wit arsenic\nI got hoes that don't know what Prada is\nDoc could shape up, touch your barber, miss (Ts! Ts!)\nFade you with a bloody blade\nI turn rap camps into Crystal Lake (Kill kill kill)\nFuck bitches face is what I'ma do\nCause that's what white boy Tano do\n\n[Hook: Eminem & Redman]\nSo how's everybody doin' tonight?\nHope you're in the mood to get drunk and scream in a fight\n'Cause uh, we getting down for the fuck of it\nSo suck my dick if y'all don't wanna bump to this (off the wall)\nSo how's everybody feelin' tonight?\nHope you in that mood to get rude and ill in a fight\n'Cause uh, we getting down for the fuck of it\nSo suck my dick if you don't wanna bump! (off the wall)\n\n[Post-Hook: Eminem]\nNo matter what people say\nI'm gon' keep rapping this way\nNo matter what you may think\nI'mma keep doing my thing\n\n[Verse 3: Redman]\nYo, what my jabs are spitting, hospital, son, admit it\nRip your lips off, kiss my ass with it\nSlap bitches, Doc. Marshall Maths? (Print it)\nWeed, X, and the acid tabs did it\nI'm \"What's Happening,\" with no Re-Run\nDoc. Rob De Niro when the Heat come\nMy barrel hang out the Camaro\nAimed at the nose of them hoes, it's hard to breathe from\nFlash the gat, your town, bogart it\nYour wallet, your chain: the main target\nBeef is like cold engine: don't start it\nBust in the air and hit a airplane pilot\nWe clowned you, rap surround sounds around you\nFrom ten-speed and brown shoe\nDoc and Eminem, cock the M&M\nBlood flows with 2Pacalypse and them\n\n[Verse 4: Eminem]\nIt's like, Funk Doctor meets the punk rocker\nGot the drugs stocked inside the lunch box (Uhh)\nPop junk like I just got jumped\nPopped the trunk and pulled out the shotgun pump\nKnock wood, it's all good; thank God for vodka\nCause wit my luck, I'll probably get shot by a stalker (Ckkk!)\nProbably got a fanatic waiting upstairs in the attic\nWith a automatic calling me up there (Watch up!)\nMy man, Stan, with a gat in his hand\nStaking my house out in a tan, tinted sedan\nPull your mouth out till you can't finish a damn (Yeah)\nHam sandwich, or your can spinach and Spam (Yeah)\nTill you gotta sip through a straw, shoplift through the mall\nPictures of me on my mom's living room wall\nHey, Ma... maybe I'll give you a call\nPsyche! You fucking bitch, suck a dick and two balls! (Hahaha)\nI'm giving you all my job descrip', which is\nTo piss bitches and priests off with this (\"...Need Jesus!\")\nPop more pills till police officers\nArrive at the scene and pull me off of Kim\nTeeth off my dick, hands off my balls\nBut y'all can kiss my ass, pants off and all! (Chm!)\nCause I'm so goddamn off the wall\nI might as well just be a painting smashed on the floor (AH!)\n\n[Hook: Redman & Eminem]\nSo how's everybody feelin' tonight?\nHope you in that mood to get rude and ill in a fight\n'Cause uh, we getting down for the fuck of it\nSo suck my dick if you don't wanna fuck to this (off the wall)\nSo how's everybody doin' tonight?\nHope you're in the mood to get drunk and screw in a fight\n'Cause uh, we getting down for the fuck of it\nSo suck my dick if y'all don't wanna bump to this (off the wall)\n\n[Post-Hook: Eminem]\nNo matter what people say\nI'm gon' keep rapping this way\nNo matter what you may think\nI'ma keep doing my thing\n\n[Outro: Eminem]\nNo matter what people say\nI'm gon' keep doing my thing\nNo matter... Oh", "image": "https://images.genius.com/9b1fb927772cba11d5bea2fa1b51e497.600x600x1.jpg"}], "artist": "Redman"}