{"songs": [{"title": "PoW WoW", "album": "E.A.R.T.H (Educational Avatar Reality Training Habitat)", "year": "2016-04-22", "lyrics": "[Intro]\nWe will ensure that our government never opens the door to the use of cloning... for human reproduction. It is dangerous, profoundly wrong and has no place in our society or any society. This order is an important step in advancing--\nBut when everything comes out it's going to blow the lid off of everything, because this is the biggest damn story in human history, and it's simply this: You are not alone and you have never been alone\n\n[Verse 1]\nBobby Ray, Bandz\nBobby Ray ha-ha\nShow your belly button if you ain't a clone\nShow your belly button if you ain't a clone\nShow your belly button if you ain't a clone\nIf you a surrogate you homegrown\nWhy you still got them damn panties on?\nWhy you still on your damn camera phone?\nBobby Ray Bandz on Genghis Khan\nWalking in with the damn Daniels on\nHaters on my dick, no I ain't alone\nAirports sell too much damn cologne\nState niggas wear too much damn cologne\nPack so loud smell it through the phone\nBob when you gonna write a book for shits sake?\nBut niggas don't read so I keep making mixtapes\nI keep making mixtapes\nEveryone I meet shop a beat or a mixtape\nSee they plan to enslave\nAnd make a billion dollars just off inmates\nClone meat your intake\nChicken look like it do nothing but lift weights\nAnd you just fixed the big plate\nKids looking grown by fifth grade\nOther day I saw a baby in a stroller\nLittle nigga had a goatee and a temp fade\nGoatee and a temp fade, goatee and a temp fade, goatee and a temp fade\nIf chemtrails are clouds when I pee it's lemonade\nOver and out, air force flying over my house\nHelicopters flying over the crib\nWe get it, you know where I live\nNo fucks, you know what I give\nNo chill, fuck Neil he's a shill\nCornrows, my Achilles heel\nGet harder than malaria still\nGet harder than surgical steel\nI give it to her she like, 'Hercules real'\nWord to the tower I'm a modern day seal\nVerbally kill, I hurt you for real\nI'm from the city where the goons often lurking the field\nAnd if the cops don't kill then the murderers will\nCan't hire these stripes, gotta earn them for real\nHow you gon' search for whats real\nWhen all the preachers that you worship be perverted for real\nAnd this will never play on syndicated radio\nCause that's just the way it goes\n\n[Hook]\nYeah, in my bloodline, uh\nCherokee in my bloodline, yeah\nCheekbones in my bloodline, yeah\nWeed shows in my bloodline, yeah\nIn my bloodline, in my bloodline, in my bloodline\nWanna cross me out like a plus sign, uh\n\n[Verse 2]\nWhat's behind a supernatural, is it actual?\nI blow your mind like explosives in a cantaloupe\nA stick of dynamite in your cantaloupe\nAstral project, I astral catapult\nWhat the fuck you laughing for?\nChain hang from my clavicle\nYou were inside of my admiral\nEat you like an enzyme or a cannibal\nLike I'm holding election with Hannibal Lecter\nTied up in the stretcher hitting on a professor\nMan I roll up the lettuce\nGet stoned like Rosetta\nToo faded tryna hold it together\nYou've been demoted a letter\nYou slow enough to trigger motion detector\nYou could lead a horse to water but you can't make him drink\nYou can lead someone to knowledge but you can't make him think, Bandz\n\n[Hook]\nYeah, in my bloodline, uh\nCherokee in my bloodline, yeah\nCheekbones in my bloodline, yeah\nWeed shows in my bloodline, yeah\nIn my bloodline, in my bloodline, in my bloodline\nWanna cross me out like a plus sign, uh", "image": "https://images.genius.com/288c59f28a4e9c1559eae1f7558abb79.600x600x1.jpg"}], "artist": "B.o.B"}