{"songs": [{"title": "Bring Back That G Shit", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "[Snoop Dogg]\nRide, ride\nRough, ride on, ride on\nRoll on, roll on\nWhat!, what!, what!\nRide on, ride on, roll on\nNigga what!, w-w-what!, what!, w-w-what!\nRide on\n\n[Kurupt]\nThis is the game you wanna spit to a nigga\nLet a nigga know it's all right, cascades\nAnd G'z stompin' on niggas like parades\nEscapades and charades played\nWhen the stampede stopped\nAnd it continuously Young Gotti\nSeen so many bodies\nDrop fours hop classics and drastic measures\nPrinciple's a pleasure and penal endeavours\nWhatever the case, whatever case, it's caught on a chase\nWhen a chase, it began in the facial of race\nMe and Fred, he make beats, I make rhymes\nAnd Snoop, he controls and calculates\nImpervious moves, the Pound Pentagon\nWit a pistols, I holla where the gangstas' at\nDaz poppin' his coller, nigga sweet and sour\nPop Chucks and collers, rollin' through the streets in my '84 Impala\n\n[Snoop Dogg]\nHolla, holla, if you wanna\nWe gon' run it from the co'na, it's the killa Califo'nia\nYa see, I do it to ya\nCause I know it screw ya, ya try up do us\nBut you can't cause you lovin' this beat\nUh, uh... we dump, dump to make you pump, pump\nWe comin' wit the heat to make ya trunk bump\nFreddy said he had a whole a gritty down to go steady\nAnd stick up Eddie for his fedy and bring it all back to daddy\nI want bread, cheese now put it on the patty\nKnick Knack style, kick back and flip files\nIn the verge, on now listen now honey child\nBow Wow, do ya now, how ya like it doggystyle?\nSmile and grinnin', sippin' on some gin'n\nRoll wit a cap and ya all strapped in\nOnce ya back in, it's straight mackin'\nI keep it crackin'\n\n[Hook - 4x]\nThis is how we all get down\nBring back that \"G\" shit fo' me!\n\n[Snoop Dogg]\nI know I slept you, kept ya, fin'na fetch ya\nSnatch ya back too, slapped you and rapped too\nThe vacuum sat 'chu and rat packed you, act two\nNow what must I do, to get you back\nTo the way is used to see, D-P-G-C'ology\nI'm not talkin' 'bout chemistry or biology\nThis \"G\"'ology, you feelin' me\nNiggas be killin' me and willin' me\nSilly he, thinkin' y'all gon' smash on me\nBlast on me, the audacity\nI'll take ya back to the ol' skool and let ya cut class wit me\nGet some ass wit me\nThen get us somethin' to drink and let you sip out the same glass as me\nAnd now you a killa\nAnd it was all over weed and a tall can of milla, illa\nKill a nigga like a flea\nBigg Snoopy D-O double gizzle\nWay off tha hizzle my nizzle\n\n[Goldie Loc]\nI hit niggas and bitches if you fuck wit my mental\nCause I'm a killa and stick release ya pop like a pimple\nIf you don't got my money I suggest you run\nCause the Gold Loc, he do you like a 20 or done\nAin't no fun the way I play, nigga I plays fo' keeps\nNo details you've just been sweeped to sweep\nLocations, directions, not even a trace\nBitch I doubt it, if ya body get found like waste\nIn the alley, killa Cali, this Eastsidaz Crips\nNever slip, set trip, and smoke chronic dip\nCuz!\n\n[Hook -4x]\n\n[Traci Nelson]\nSnoop Doggy Dogg has to give it to ya\nFredwreck got the reefers bumpin' through ya\nGoldie Loc can put the G and the C\nWit Kurupt Young Gotti from the D-P-G\n\n[Kokane - Harmonizing]\n\n[Daz]\nBitch\n\n[Fred Durst]\nHey!", "image": "https://images.genius.com/32f5907a0f69c52bd9d20ec857b3f90c.944x944x1.jpg"}], "artist": "Kurupt"}