{"songs": [{"title": "The Questions", "album": "Like Water for Chocolate", "year": "2000-03-28", "lyrics": "Uhh..\n\n[Common]\nIt's the questions (what..) it's the questions boy\nIt's the questions (What?) it's the questions c'mon\nThe questions (WHAT?) it's the questions boy\nIt's the questions (hah) it's the questions yeah\nTalkin bout the questions, it's the questions y'all\nIt's the questions (what?) it's the questions, dig it\nThe questions (why?) it's the questions boy\nIt's the questions (huh?) that's what it's all about\n\nYo, yo..\nWhat is an emcee if the wall ain't got no back?\n(I don't know, yo, he must be kinda wack)\nWhat is paper to a nigga if the nigga don't stack?\n(Yo, why the hell you askin me that?)\nWhy do these girls, look so good in the summer?\n(I don't know, I'm just sayin this shit)\nIf you got ta-dat-ta-dat-tap for your lady wouldja wanna?\n(Hmmm.. yeah, right)\nCause you answer the phone \"peace\" do that mean that you not a freak?\n(Hell no! That's right)\nCause you recognize me-e-e-e-e, yo, I got to speak?\n(Why can't you speak? What you big a star now?)\nWhy you got-ta, act like, nigga, all the time\n(Even on SUNDAY's you should..)\nIs a nigga yo' complexion, is it all in your mind?\n(It's all your mind..)\nWhat's it called y'all?\n\nIt's the questions (WHAT?) it's the questions boy\nIt's the questions (What?) it's the questions, yeah!\nThe questions (uhh) it's the questions y'all\nIt's the questions (WHAT?) it's the questions c'mon\nThe questions, it's the questions boy\nIt's the questions (ahh, uh ahh) it's the questions, yeah\nThe questions (yes) it's the questions boy\nIt's the questions - that's what it's all about\n\nYo, if I'm a intellectual-al, I can't be sexual?\n(I don't know, you wanna be sexual??)\nIf I want to uhh tah uhh does that mean I lack respect for you?\n(I don't know you tell me..)\nYouse a grown man, why fuck that young girl, are you lustin?\n(I might look twenty but I'm 15 - slow down girl)\nIf you got paper like that, then why you still hustlin?\n(Why you still hustlin? C'mon!)\nNow you know yo' stomach too big, to be wearin a shirt like that\n(Look at your stomach - ewww it's sloppy)\nSo why, you want, to go and do that?\n\n[Mos Def]\nWhy ya why ya why ya why ya why ya wanna why ya wanna\nWhy ya wanna go and do that love huh?\nYo why your girl gi-giddy when my name come up?\n{*female giggling*}\nHow come the industry build careers that don't last?\n(Uh-huh, that's right, ask him)\nHow come niggas don't know but they front and don't ask?\n(Mmmmhmmm) Man I don't know, I don't know\n\n[Common]\nIt's the questions (WHAT?) it's the questions girl\nIt's the questions (What?) it's the questions c'mon\nThe questions (WHAT?) it's the questions Com\nIt's the questions (hah) it's the questions yeah\nYo we talkin bout the questions, it's the questions girl\nIt's the questions (the who, the where, the when, the why)\nIt's the questions, c'mon!!\nThe questions.. the questions y'all (yo we shoutin it out)\nIt's the questions - that's what it's all about\n\n[Mos Def]\nYo, why they say never say never, when they know that ain't right?\n(What???)\nCause to never say never you done said never twice\n(They scrubs, that's why - yeah that's twice)\nWhy do I need I.D. to get I.D.?\n(I don't know, beats me.. beats me)\nIf I had I.D. I wouldn't need I.D\n(Hahahahah, that's right - that's true)\nWhy do these fine ghetto women got so much ass?\n(Why'd you talkin about our ass though? C'mon now)\nWhy did Dr. J shave his beard and mustache?\n(Like this.. and like this)\nHow you got high expectations but got low patience?\n(C'mon, I don't know, I don't know, I don't know)\nHow come this joint named \"The Questions\" is so John Blazin'?\n(Uh-huh, uh-huh, uh-huh) Man I don't know, I don't know\n\n[Common + Mos Def]\nIt's the questions (what..) it's the questions boy\nIt's the questions, it's just my questions black\nSome questions - it's the questions y'all\nIt's the questions (what?) it's the questions, yo\nTalkin bout the questions, it's the questions girl\nIt's the questions (what?) it's the questions, c'mon\nThe questions (which?) and we're shoutin it out\nIt's the questions (huh?) that's what it's all about, yo\n\n{*continues to fade with ad libs..*}", "image": "https://images.genius.com/8dbc84c60c9d76fe49cdbcee56ef974c.1000x1000x1.jpg"}], "artist": "Common"}