{"songs": [{"title": "That Ain’t Gangsta", "album": "Power of the Dollar", "year": null, "lyrics": "[Produced by Trackmasters]\n\n[Verse 1]\nHow you gonna take this? like a man or a bitch?\nYou gon' get it on nigga or you gon' snitch?\nI represent niggas in the hood gettin' rich\nMan, I stack chips and I unload clips\nAfter 3 summers in the jail I thought life was hard\nSome niggas started fightin', some niggas found God\nYou know me, started sellin' leak in the yard\nYo, I ran into niggas who used to have Hummers\nBig as hell in the joint wearin' '86 numbers\nDamm dog, you been in here that long?\nYou could think that, but say that and yo' ass is dead wrong\nA convo is only three words, \"yo what up\"\nYou ain't gotta work out to leave this bitch cut up\nLet a nigga find out you on some goin' home shit\nAnd you tryin' to bounce without payin' a loan, shit\nSome niggas beat cases on the strength of they cream\nAfter witnesses disappear on the strength of they team\nI'm hard as hell to get along wit' so it never fails\nA nigga I got beef with end up in the same jail\nHe had a L rolled in bible paper - blowin' the lah\nI sent him a little kite just to be blowin' his high\nAnd when I shot you in New York why would I box you now?\nIf I catch you going to sick call I'm'a ox you down\nNiggas you think is real really can't hold they own\nI'll have 'em on some E.T. shit tryin' to phone home\nIn here a gemstar is like a nine milli chrome\nIt's similar, in fact they'll both split ya dome\nScars are souvenirs, niggas always take 'em home\n\n[Hook]\nYou got blown over the jack? (that ain't gangsta)\nYour man ran when you got clapped? (that ain't gangsta)\nRockin' a vest with no gat? (that ain't gangsta)\nYou only a thug when you rap? (that ain't gangsta)\nNiggas juxed you for your track? (that ain't gangsta)\nYou ran to other thugs to get it back? (that ain't gangsta)\nNiggas ran off with your packs? (that ain't gangsta)\nIf you ain't bustin' ya gat (that ain't gangsta)\n\n[Verse 2]\nYou'd call me Animal if you seen me livin' on lock\nI stay in a box so much it seems like I'm visitin' pop-ulation\nWhen I walk by, niggas like \"Fifty don't play son\"\n\"yeah, somethin' really wrong with that nigga...\"\nMax out, I'm goin' straight for the Glock\nBust a u-turn, I'm goin' straight to the block\nThe things that'll happen if niggas say I can't eat\nDown goes the window....out goes the heat\nI'll make the whole block look like a fuckin' track meet\nSome get it in the leg, some get it in the back\nSome get it in the foot, bleed all over their Air Max\nNigga pump my packs or pay poor tax\nIt's extortion, it happens in the hood often\nClaim more lives than choices, free abortions\nRich Nice says I got a problem with the dice\nCause I put the title to the Benz on the line twice\nI rock shit cause I stay on that block shit\nThat 9mm Ruger to your knot shit\nSee the difference is I'm real and you not, kid\nI still stash crack money in my sock, shit\nYa'll niggas wanna pop shit? I pop clips\nLeave with your blood on my mink in the drop six\nGuiliani and Pataki can't stop this\nSince '86 my whole clique pop Criss\n\n[Hook]\n\n[Outro]\n5-5-1 BRRRAAAT BRRRAAAT\n1-3-4 BRRRAAAT BRRRAAAT\nWhat the fuck you know about that?", "image": "https://images.genius.com/f29b6e681d1b1237ec06d01ab616992a.600x600x1.jpg"}], "artist": "50 Cent"}