{"songs": [{"title": "Simple Conversation", "album": "BEFORETHEUNIVERSE", "year": "2014-12-10", "lyrics": "[Hook: Wiz Khalifa]\nIs you rollin' up but you don't feel nothin'?\nThat's a simple conversation\nBaby is ya fuckin' with a real one?\nThat's a simple conversation (x3)\nWhy these niggas keep hatin'?\nThat's a simple conversation\n\n[Verse 1: Wiz Khalifa]\nHop up in the whip, smokin' on the shit, you gon' need ventilation\nOG tastin', don't smoke till ya choke, get the dope, don't waste it\nI'd rather chill wit' a bad bitch, and see a bitch nigga later\nNah, nigga, I ain't waitin' up, nah nigga, I ain't waitin'\nNiggas still hatin', niggas still on the shit\nBitches still on a nigga dick, word to the clique\nEvery verse like a bird, think I'm servin' a brick\nYa heard me? That's a simple conversation\nLeanin' in my ride and smokin' weed up out a paper\nCome to Gs, I got a nation, weed and gin, the combination\nNeed to legalize it!\n\n[Hook]\nIs you rollin' up but you don't feel nothin'?\nThat's a simple conversation\nBaby is ya fuckin' with a real one?\nThat's a simple conversation (x3)\nWhy these niggas keep hatin'?\nThat's a simple conversation\n\n[Verse 2: Bankroll Fresh]\nBroke ass nigga, stop hatin'\nI'm fuckin' hoes off simple conversation\nKeep it real, I ain't even gotta say shit\nWhip the dick out, make the freak bitch taste it\nGears on the steering wheel, [?] race it\nGrew up in a spaceship, shot right past\nSmellin' like a bag, smokin' out the bag, sunny boy had\nSo many mothafuckin' hundreds in my hand, flashin'\nBaby is ya fuckin' wit' a real one?\nAll these pussy ass niggas, I'll kill one\nI'm in the mothafuckin' trap, vac-sealing\nBreaking and rebuilding, snapping and concealing\nKeep the heat compressor, straighten up the extra\nBankroll, you goin' hard, you a big flexer\nI'm on the phone talkin' money, simple conversation\nThese broke ass niggas, they still waitin'\n\n[Hook]\nIs you rollin' up but you don't feel nothin'?\nThat's a simple conversation\nBaby is ya fuckin' with a real one?\nThat's a simple conversation (x3)\nWhy these niggas keep hatin'?\nThat's a simple conversation\n\n[Verse 3: Reese]\nMoney talk, talk money, that's a simple conversation\nThree cellphones [?] nigga, that's how the plug conversatin', aye\nMy link was juugin' right back cross the nation, aye\nI'm fuckin' up money, sometimes you gotta pace it, aye\nLive from the bando, my partner operation\nSS Camaro, nothin' like a star racin'\nI buss on her chin, now she all in my facial\nHot sauce, I need a pay-cation\nIt could all be so simple, that's a little conversatin'\nMy niggas ain't bluffin' wit' you, that choppa gon' erase ya!", "image": "https://images.rapgenius.com/ac5ed4e2811eacf50c9fa6de9fe930af.500x500x1.jpg"}], "artist": "Wiz Khalifa"}