{"songs": [{"title": "Who the Fuck Is God", "album": null, "year": "2014-06-24", "lyrics": "[Intro]\nGod\nWho the fuck is\nWho the fuck is\nAyy\nCocaine\nAyy\n\n[Verse 1: XXXTENTACION]\nTwo shots for me and fucking Jesus himself\nWho the fuck signed the petition giving Jesus the belt?\nTie it around his neck and get to fucking buckling up\nFor every moment I counted on him, I'm fucking him up\nTorture victims are due to scriptures, it's written as such\nSo every moment my uncle suffered was planned in the cut\nCut his tongue out and hammered fucking nails in his skull\nCouldn't see what Jesus planned, my vision is dull, and so\nIf there's a fucking God, I wanna slit his fucking throat\nAnd feed his organs to the children\nAnd, shower solutions to the black and the white\nAnd, endless indulgence to the youth in the night\nCold scripture all use to be causing a rut\nDrowning women and many children and pillaging trust\nJust the minimum, murdered many in sake of themself\nHe just replaced you, you are just a book on his shelf, and so\n\n[Bridge: XXXTENTACION & Sully the Chief God]\nWho the fuck is God?\nWho the fuck is God?\nI said, who the fuck is God?\nIs he a trap star or rockstar\nOr the president\nDoesn't leave many men, innocent\nYeah, see, living for a reason I don't know\nFuck Jehova\nIt's Sully the Chief God\nHold up, yeah, yeah, yeah, yeah\n\n[Verse 2: Sully the Chief God]\nSociety is a parasite that darkens the soul\nKeeping us ignorant and under control\nOur heart's growing colder as our ego takes over\nDrugs numb the pain that I carry on my shoulder\nSmoking all this weed hoping that God forgives me\nWhile I stand and refuse to bow down on my knees\nBow down on my knees\nFuck that, smoke that DMT\n\n[Verse 3: Absentwill]\nYou never seen the shit I seen\nPullin' up in beams smoke by the steam\nOnce had hood dreams all about the cream\nThen you with the team, servin' up the fiends\nPoppy and a spleen, don't fuck with it\nNow let me take you back to the story, that I once told\nAyy, ayy, that I once told", "image": "https://images.genius.com/39d0d0d6a831b20f024dceabb5df2f5c.500x500x1.jpg"}], "artist": "XXXTENTACION"}