{"songs": [{"title": "Money", "album": null, "year": "2015-06-26", "lyrics": "[Intro]\nLondon on the track bitch!\n\n[Hook]\nI just want the money\nBring me all my money\nI just want the money\nBring me all my money\nI just want the money\nBring me all my money\nI just want the money\nBring me all my money\n\n[Verse 1]\nI just want that money nigga\nI don't give no damn about no fame\nI just get that head and go\nPlus that lil bitch got a pink pussy like a yam\nI'll pop it I'll make that booty say bang bang\nI'm icy so she failed to maintain her lane\nI'm so priceless I swear to God I can't complain\nNo no no no I can't\nI woke up with a smiling face\nLil shorty keep following like she down to play\nI can't fill my truck up with no fucking strays\nBut I can fill it up with all my bass\nAnd that's no lie that's no lie\nI'm balling so hard I need Gatorade\nEat your candy now and later\n\n[Hook]\nI just want the money\nBring me all my money\nI just want the money (I want racks)\nBring me all my money\nI just want the money\nBring me all my money (Bring me all the money)\nI just want the money (I just want the money)\nBring me all my money (Uh)\n\n[Verse 2]\nMy jewelry wet like water hose\nI didn't buy no spinners I had stop and goes\nYeah I was tired started stopping goals\nUsed to rob for birds now I'm flocking those\nHell yeah nigga flock (Brrrrr!)\nKing cobra nigga watch\nThe P stand for players they eat pies\nThe B stand for bodies who wan' die? Hey!\nWho wan' motherfucking die today today?\nBought a gold casket I killed him and paid\nI swear I'm back in my John Dillinger ways\nGo buy a milk carton he missing today\nGet my cookie from San Fransisco Bay\nIt's time to start planning put on your game face\nGodfather I killed them all in one day\nI meant a whole dime at one time oh my\n\n[Hook]\nI just want the money\nBring me all my money\nI just want the money\nBring me all my money\nI just want the money\nBring me all my money\nI just want the money\nBring me all my money", "image": "https://images.rapgenius.com/505fb03b09d0d481f5ad7c94719f3402.640x640x1.jpg"}], "artist": "Young Thug"}