{"songs": [{"title": "Ziplocc (Weedmix)", "album": null, "year": "2014-03-28", "lyrics": "[Intro]\nTa-hahaha, 28 grams nigga-a, the fuck you wanna do nigga? I'm coning a joint while we talk right now nigga, fuck wrong with you. A zip at a time bitch, put that lil ass shit away. Fuck wrong with you niggas mane? We blow big over here mane, Taylor Gang. We'll be in motherfuckin', Denver on 4/20 nigga. Weed is legal there, so that's sweet. Ya'll niggas, smoke like, two joints a day and you talk about \"you get high\" motherfucker. That's cool... We gon' continue to get dumb high. We ain't abusing it, we using it\n\n[Bridge]\nLet's have fun\nWhat up Winston?\n\n[Verse 1]\nWhat is you saying, my money insane\nI'm fresh off a plane, I'm rolling a plant\nGirl why is you playin', let's stick to the plan\nThe weed is so good that it stick to my hand\nIt come from the land, I know I'm the man\nBought a few packs, so they threw a few in\nI don't understand, I know what you payin'\nI smoke till it's gone, then grow it again\n\n[Hook]\nIt ain't nothing to get that zip off\nIt ain't nothing to get that zip off\n\n[Verse 2]\nI was smoking trees at the party, I get gnarly\nI got hundred pounds of weed, talking shawty, what you need?\nKush be so strong, hit it once, it's hard to breathe\nHave you coughing up a lung, so much smoke you tryna leave\nBlowing up a nigga phone, what I tell your ass?\nTalking about that pack, I ain't tryna sell your ass\nGoddamn, Rollie on my wrist, doobie in my fist\nSipping on the Cris, definitely going to jail if I take a piss\nIt ain't nothing to get that tip off\nArm out the window, it ain't nothing to get that clip off\nIt ain't nothing to knock your clique off\nPut it in her mouth, I swear she tried to suck my dick off\nGODAMN!\n\n[Hook]\nIt ain't nothing to get that zip off\nIt ain't nothing to get that zip off\n28 grams in a ziplocc\nIt ain't nothing to get that zip off\n\n[Verse 3]\nGot one rolled up, you should roll one too\nLet's get fucked up, girl you know how we do\nWhat time? What place? Drink gin, no chase\nFirst time all up, next time, call us\nDon't hit the bong, get this smoke, it's bad\nSay you smoking strong but you wrong, you've been smoking trash\nIt ain't in my lungs if it ain't that pressure\nFirst thing in the morning, grab my joint from off the dresser\nKeep my OG in a jar cause I like it fresh\nSaid he’d hit the weed, he ain’t ready yet\nSteady flexing on these children like I'm Willie Nelson\nNo discretion come to drugs, I got a big selection\nYES!\n\n[Hook]", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg"}], "artist": "Wiz Khalifa"}