{"songs": [{"title": "Hold Ya Head", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Intro/Collision: Sampled & 2Pac]\n\"Yo, Jackson!\" \"A 231549\"\n\"Yeah, close four! Comin' down!\nMy homeboys in Clinton and Rikers Island\nAll Crichlow! A 5991301\nThe penitentiaries, Mumia, Mutulu, Geronimo, Sekou\nAll Close five! Comin' down!\"\nThe political prisoners, San Quentin\n“Look at Satan” “I see him”\nAll the jailhouses, I'm witchu\n\n[Pre-Verse:  2Pac & Tyrone Wrice]\nYeah, one thug, one thug\nHow do we keep the music playin'?\nYou're listenin' to the sounds of one thug\nOne thug, one thug, How do we get ahead?\nYou're listenin' to the sounds of…\n\n[Verse 1: 2Pac]\nI wake up early in the mornin', mind state so military\nSuckers fantasizin' pictures of a young brother buried\nWas it me, the weed or this life I lead?\nIf daytime is for suckers then tonight we breathe\nOut for all that, knowin' that this world bring drawbacks\nLook how they shiver once I deliver these raw raps\nMeet me at the cemetery, dressed in black\nTonight we honor the dead, those who won't be back\nSo, if I die, do the same for me, shed no tears\nAn outlaw thug livin' in this game for years\nWhy worry? Hope to God, get me high when I'm buried\nKnowin' deep inside only a few love me\nDon't rush me to the gates of Heaven\nLet me picture for a while, how I lived for my days as a child\nI wonder now, how do we outlast?\nAlways get cash, stay strong if we all mash; hold ya head!\n\n[Chorus: Tyrone Wrice & 2Pac]\nHow do we keep the music playin'?\nYes, you got to hold ya head!\nHow do we get ahead? Hold ya head!\nToo many young black brothers are dyin'\nYes, you got to hold ya head!\nLivin' fast, too fast\n\n[Verse 2: 2Pac]\nThese felonies be like prophecies\nBeggin' me to stop ‘cause these\nLawyers gettin' money every time they knock us\nSnatchin' pockets lyrically, suckers flee when they notice\nSwitched my name to Makaveli, half the rap game ghost\nExposed foes with my hocus-pocus flows, they froze\nNow suckers idolize my chosen blows\nAnd mo' money mean litigatin', mo' playa hatin'\nGot a cell at the pen' for me waitin'—is this my fate?\nMiss me with that misdemeanor thinkin', me fall back?\nNever that, too much Tequila drinkin', we all that\nMake them understand me? Hell nah, this ain't my posse\nEveryone with me is family, ‘cause everybody's got me\nWatch me paint a perfect vision, this life we livin'\nGot us all meetin' up in prison\nLast week I got a letter from my road dog, written in blood\nSayin', \"Please show a playa love\"—hold ya head! (Hold it!)\n\n[Chorus: Tyrone Wrice & 2Pac]\nHow do we keep the music playin'?\nYou got to hold ya head!\nHow do we get ahead? Come on, hold ya head!\nToo many young black brothers are dyin'\nYes, hold ya head!\nLivin' fast, too fast\nThe weed got me tweakin' in my mind, I'm thinkin'…\n\n[Verse 3: 2Pac]\nGod bless the child that can hold his own\nIndeed, enemies bleed when I hold my chrome\nLet these words be the last to my unborn seeds\nHope to raise my young nation in this world of greed\nCurrency means nothin' if you still ain't free\nMoney breeds jealousy, take the game from me\nI hope for better days, trouble comes naturally\nRunnin' from authorities 'til they capture me\nAnd my aim is to spread mo' smiles than tears\nUtilize lessons learned from my childhood years\nMaybe Mama had it all right, rest yo' head\nTradin' conversations all night, bless the dead\nTo the homies that I used to have that no longer roll\nCatch a brother at the crossroads\nPlus nobody knows my soul, watchin' time pass\nThrough the glass of my drop-top Rolls; hold ya head!\n\n[Chorus: Tyrone Wrice & 2Pac]\nHow do we keep the music playin'?\nYou got to hold ya head!\nHow do we get ahead? C'mon, hold ya head!\nToo many young black brothers are dyin'\nYes, hold ya head!\nLivin' fast, too fast\nYou got to hold ya head!\nHow do we keep the music playin'?\nYes, you got to hold ya head!\nHow do we get ahead?\n\n[Collision: 2Pac]\nNo matter how hard it get, feel me? (Come on)\nGet the weed, drink a drink, read a book\nWatch the stars, get some pussy—whatever!", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}