{"songs": [{"title": "My Soul", "album": "My Soul", "year": "1997-08-26", "lyrics": "*Violins and pianos are heard, tapping, and a conductor clearing his\nThroat to signal that he is ready*\n\nChorus:\nSoul-oul-oul-oul-oul-oul-oul (My soul, my soul)\nMy soul-oul-oul\nMy soul-oul-oul (My soul)\nSoul-oul-oul-oul-oul-oul-oul (My soul)\nMy soul-oul-oul (My soul)\nMy soul-oul-oul\n\nVerse 1:\nYou can try to throw salt, but I keep my game face on\nAnd the only thing on your mind is stalkin' more digits than a telephone\nMe and thirty-nine theives jumpin' out of white Hummer\nFrom Compton (Wooh-wooh-wooh), while your crew get dumb and dumber\nGrew up straight out of low cash like CB fo'\nNow I got dough and you got one night stands like gangsta, yo\nSee on the low it's all gravy\nBut the threat of this new world order is about to drive me crazy\nAnd all you want is the Lex and gold Visa\nBomb singles and stackin' your chips like Pringles\nWhile my rhymes jack for platinum plaques\nQuicker than one time Jack Black's\nI twist sacks and sip yac\nPlus, the Invisible Man got my back like a spine\nSo, why you all up in mine?\nKeep the money and the fame cause all I really wanna hold\nIs my artistic flavor and control of my soul\n\nChorus\n\n[Verse 2]\nAin't no tellin\nMost women are still waitin' and sellin'\nMost of my homies is ex-felons (Convicts)\nIn two decades, rap went from Planet Rock\nTo crack rock\nNow, everybody got a Glock\nAnd it don't stop\nTill another brother drop\nThat's why I poured out a little drink for the homie Pac (Rest In Peace)\nWhat's a thin line between love and hate?\nA million dollars in the bank and you still can't escape\nIt's a small world, after all, you're clausterphobic, you can't breathe\nSo, store your ball like Christopher Reeve\nIt's the hater in you that makes you criticize me\nCause if you handled your business then yo ass would see\nNineteen-ninety-seven is still crackin'\nI'mma get the ladies out their seat like this was a car jackin'\nThey say the game is to be sold, not told\nYou can keep your bankroll, I want control of my soul\n\nChorus\n\n[Verse 3]\nMy jaws flip across sixteen bars like Dominique Dawes\nBut without no flaws, never broke a M.C. law\nSee, I was servin' wack rappers at the school\nWhen Bruce Lee was scrappin' with Kareem Abdul\nYou got into triple beams and guns you ain't gon shoot\nI seen a million rappers in the same Versace suit\nOr, the same pair of locs, that's probably why you're broke\nAnd your backstage and your ghetto pass got revoked\nScrappin' or rappin' what you want to happen?\nIf I ever come up short you the first one I'm jackin'\nIt's theives in the area like aircraft carrier's\nWe're launchin' F-15's\nAnd Anti-Wack Maf Machines\nMichropone, sittin' on my vocal chord\nSendin' busta's to the crossroads like Thuggish Ruggish Bone\nIt's the C-O-O-L-I-O, well I, won't fold\nWhen I'm controllin' my soul\n\nChorus: Repeat 1 1/2 times", "image": "https://images.genius.com/8b2afc0b2ec12b84597cab495ffdf0e1.600x600x1.jpg"}], "artist": "Coolio"}