{"songs": [{"title": "Pass Me By", "album": null, "year": null, "lyrics": "[Verse 1: J. Cole]\nDear Mrs. Bill Collector\nI know you're just doing your job, no mean to disrespect ya\nBut we been going through this thing since way back\nI told ya when I get the dough I would pay back\nBut I got problems baby (yeah, if you only knew)\nI got bigger problems baby\nSo while ya talk about the money that I owe like it's as if I didn't know man it don't mean nothin' to me\nCause right now I got my lil boy crying and my grandmother dying\nCould ya please stop fuckin' wit me?\nListen here I ain't lookin' for no tears, but my brother got a year and my moma keep smokin' that shit\nOn top of that I'm broke, please put that in your notes for the next one to call me up talkin' that shit\n\n[Hook: B.o.B]\nSo life don't pass me by, cause sometimes it'll leave ya stuck, don't ask me why (why)\nGotta keep this train-a-movin', no time to cry (cry)\nSo lonely days I say goodbye (bye)\nGotta live for today so life it won't pass me by\nCause sometimes it'll leave ya stuck, don't ask me why (why)\nGotta keep this train-a-movin', no time to cry (cry)\nSo lonely days I say goodbye (bye)\nGotta live for today so life it won't pass me by\n\n[Verse 2: J. Cole]\nDear Mr. Policeman\nAm I wrong, ain't you supposed to keep the peace, man?\nI coulda swore that I was driving pretty peaceful\nSo why the hell is you pulling over me for?\nIs it this black Mercedes? (Oh na, I get it, I get it, I get it)\nOr cause I'm black, hmm, maybe?\nTell me why my hands start sweating and I hold my breathe every time you get behind me\nI turn my music down so you won't hear a sound, man I'm nervous like I got a couple pounds on me\nYou pull me over, ya frown on me\nWith your flashlight, tell me, what do you see?\nThug niggas, drug-dealers its a trip\nEvery nigga in this whip got a mothafuckin' college degree\n\n[Hook: B.o.B]\nSo life don't pass me by, cause sometimes it'll leave ya stuck, don't ask me why (why)\nGotta keep this train-a-movin', no time to cry (cry)\nSo lonely days I say goodbye (bye)\nGotta live for today so life it won't pass me by\nCause sometimes it'll leave ya stuck, don't ask me why (why)\nGotta keep this train-a-movin', no time to cry (cry)\nSo lonely days I say goodbye (bye)\nGotta live for today so life it won't pass me by\n\n[Verse 3: J. Cole]\nMy middle finger to the law, bustin' off, tryin' to touch the sky\nMy teacher said, \"Impossible\", but I'mma fuckin' try\nPlus how he gon' tell me, he don't make the rules\nThere's niggas dying everyday, we don't make the news\nInstead they talk about some thunderstorm, cyclones\nTimmy got his bike stole\nTop story: Tiger Woods be fuckin' a these white hoes\nAnchorman stop snitchin'\nCut to commercial, he be textin' all his side bitches\nHey ma-goodness, how ironic\nI'm tryed for possession of some chronic\nMy lawyer came to court, man he was higher than the comet\nHey your Honor, is you kidding, how you sit above me?\nAre you perfect mothafucka? How you finna to judge me?\nWhen you home you don't cuss, drink and puff like us?\nThese cops is Bad Boys, they be just like Puff\nThey hate their jobs and their days be fucked up like us\nAt the end of the day, you niggas just like us\n\n[Hook: B.o.B]\nSo life don't pass me by, cause sometimes it'll leave ya stuck, don't ask me why (why)\nGotta keep this train-a-movin', no time to cry (cry)\nSo lonely days I say goodbye (bye)\nGotta live for today so life it won't pass me by\nCause sometimes it'll leave ya stuck, don't ask me why (why)\nGotta keep this train-a-movin', no time to cry (cry)\nSo lonely days I say goodbye (bye)\nGotta live for today so life it won't pass me by", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}