{"songs": [{"title": "Song Cry (MTV Unplugged)", "album": "MTV Unplugged", "year": "2001-12-18", "lyrics": "[Intro: Mary J. Blige (Jay Z)]\nPicture all the possibilities\n(Ok)\nPicture all the possibilities\n(This is so soulful)\nSounds like a love song\nSounds like a love song\n(Most incredible baby)\nYeah yeah\n\n[Hook 1]\nI can't see 'em coming down my eyes\nSo I gotta make the song cry\n\n[Verse 1]\nGood dude, I know you love me like cooked food\nEven though a nigga gotta move like a crook move\nWe was together on the block since free lunch\nWe should've been together having Four Seasons brunch\nWe used to use umbrellas to face the bad weather\nNow we travel first class to change the forecast\nNever in bunches, just me and you\nI loved your point of view cause you held no punches\nStill I left you for months on end\nIt's been months since I checked back in\nWe're somewhere in a small town, locking the mall down\nWoodgrain, four and change, Armor All'd down\nI can understand why you want a divorce now\nThough I can't let you know it, pride won't let me show it\nPretend to be heroic, that's just one to grow with\nBut deep inside you know I'm so sick right\n\n[Hook 2]\nI can't see 'em coming down my eyes\nSo I gotta make the song cry\nI know I see it coming down your eyes\nSo I gotta make the song cry\nI can't it coming down my eyes\nSo I gotta make the song cry\n\n[Verse 2]\nOn repeat, the CD of BIG's \"Me and My Chick\"\nWatching Bonnie and Clyde, pretending to be that shit\nEmpty gun in your hand saying, \"Let me see that clip\"\nShopping sprees, pull out that Visa quick\nYou know I had very bad credit, you helped me lease that whip\nYou helped me get the keys to that V dot 6\nWe was so happy poor but when we got rich\nThat's when our signals got crossed, and we got flipped\nRather mine, I don't know what made me leave that sh\nMade me speed that quick, let me see - that's it\nIt was the cheese helping chickens get amnesia quick\nI used to cut up they buddies, now they sayin they love me\nUsed to tell they friends I was ugly and wouldn't touch me\nThen I showed up in that dubbed out buggy\nAnd then they got fuzzy and they don't remember that\nAnd I don't remember you, you, you\n\n[Hook 2]\nI can't see 'em coming down my eyes\nSo I gotta make the song cry\nI know I see it coming down your eyes\nSo I gotta make the song cry\nI can't it coming down my eyes\nSo I gotta make the song cry\n\n[Verse 3]\nA face of stone, was shocked on the other end of the phone\nWord back home is that you had a special friend\nSo what was oh so special then\nYou have given away without getting at me\nThat's your fault, how many times you forgiven me\nHow was I to know that you was plain sick of me?\nI know the way a nigga living was whack\nBut you don't get a nigga back like that!\nShit I'm a man with pride, you don't do sh like that\nYou don't just pick up and leave and leave me sick like that\nYou don't throw away what we had, just like that\nI was flirting with them girls, I was gon' get right back\nThey say you can't turn a bad girl good\nBut once a good girl's gone bad, she's gone forever\nI mourn forever, shit\nI've got to live with the fact I did you wrong forever\n\n[Hook 2]\nI can't see 'em coming down my eyes\nSo I gotta make the song cry\nI know I see it coming down your eyes\nSo I gotta make the song cry\nI can't it coming down my eyes\nSo I gotta make the song cry\n\n[Outro: Jay Z (Mary J Blige)]\nLet's break it down\nThis song right here is for real, for all the hustlers right\nWho had a girlfriend, and started off, their whole relationship started off you know, he did what he had to do for them, you know what I mean?\nBut along the way he got lost.  Fast cars, fast money, you know the story\nTrust me, he's right here. Alright. Do believe it. On the real son\nUh\nCan't see it coming down my eyes\nBut I gotta make this song cry\nCan't see it coming down my eyes\nBut I gotta make this song cry\nI know I see it coming down your eyes\nSo I gotta make the song cry\nI can't it coming down my eyes\nSo I gotta make the song cry\n(Yeah. I said loving you, I said I need you)\nUh Uh\nUh Uh uhuh\nI got lost for a second I ain't gonna lie\nI was in my own thoughts for real\nAlright let's get it all the way to ten, where my man Dame\nDame over there? I know Dame over there somewhere. Where you at. You gotta stand up for this\nWe breaking the rules\nCamera blocking smamera smocking\nI gotta bring up one of the most hottest producers in the last 2 years he's been on fire, he's always been on fire but he';s really been on fire. I wanna bring my man Pharrell up, come up Pharrell. I found my man Dame too. Pharrell you wanna help me out on this one?\nThis man right here is the producer behind the next joint, like 150 new ones on the radio right now\nYeah man you gotta dance, we gonna dance too\nLet's go y'all", "image": "https://images.genius.com/a7449b38b8eab47232b379bc442a5f10.1000x1000x1.jpg"}], "artist": "JAY-Z"}