{"songs": [{"title": "Nobody Cares (Bonus Track)", "album": "Strangeulation", "year": "2014-02-18", "lyrics": "[Intro: Tech N9ne]\nSwanky all the time...\nSo don't worry 'bout me cause I'm Gucci, luchi, all up in my hallsies\nCome from Kansas City and get money's what they tought me\n\n[Verse 1: Tech N9ne]\nI'm a real one, fill 'em, up, I bust and kill 'em\nDidn't have to sell my soul to sell some fucking millions\nWhen I drop this Bou Lou drink, it'll put me up in billions\nThe ceiling never could stop this KC, MO civilian\nHow ya didn't know we had the green when I'm all up in yo' magazine?\nSo focused on the flow, fo' fifth, yo' bitch throw shit, that's flattering\nWe ain't like you others, we got a very sick disease\nAnd, if you get this bug, it may result in making cheese\nMade a lot of Technicians, gettin' mo' is the next mission\nWe got the colleges, the suburbs and the 'jects trippin'\nOff of this wealthy, foul-mouthed trigger\nDon't even bother to get your wicky styles out, nigga!\n\n[Hook: Krizz Kaliko, (Crystal Watson) & {Tech N9ne}]\nEverything in my head, all these words that I said\n(Nobody cares) Nobody cares\n(And nobody gives a damn what I say, who I am)\n(Nobody cares) Nobody Cares\nThese bright lights, show my life {nobody cares}\n(No one, no one, no one, no one cares, nobody, nobody)\n\n[Interlude: Tech N9ne & (Krizz Kaliko)]\nFellas better put a chastity belt on yo' spouses\nPut-put a chastity belt on yo' spouses (Ugh-huh!)\n\n[Verse 2: Krizz Kaliko]\nIt is what it is, nigga, I'm underground\nY'all saying the same thing, mainstream in trouble now\nI'm on my grown man, growin' a little stubble now\nA Spotify gotta fly, hustle gotta double down\nMurder was the case that I gave 'em\nDamn her with my grammar hammer, nobody could save 'em\nAnd we ain't just in Kansas City anymore\nWe on tour and we on some penny pinchin', \"give me more\"\nIf I die today, I'm comin' back, nigga\nStrange Music's on big black fat nigga\nCause we resurrected with people been disrespectin'\nNo equal to this direction, when Kali, people can check it\nWe be the choppin' and Tech get it poppin' in every Metropolis\nTracks, we be toppin' as boppers, they flock to us, niggas be jockin' us\nI flow, beware, rappers don't be goin' there\nMaybe I'm just blowin' smoke in the air and no one cares\n\n[Hook]\n\n[Interlude: Stevie Stone]\nI been (dope, d-dope, d-dope, dope, dope)\nNow get 'em (dope, d-dope, d-dope, dopeboy fresh)\n\n[Verse 3: Stevie Stone]\nBitch, I been out here poppin', been up in these streets\nSince I came up out that water, been the illest nigga low key\nGot yo' bitch up all on my Peta, bendin' on them knees\nBitch came back around and got backed down\nAnd done fucked around and got beat, it's that, shake down!\nStrange, so you know I make cake now\nWant to know where's the house by the lake down?\nI bought the car, it was the model and I'm make now\nI kick back, my feet up, cramp down and re-up\nTalk shit and I talk shit, this boss shit, nigga, G up\nEeee, whoa, kemosabe, (what ya smelling?)\nWalk up in the room, all you smell is money\nSixteen to ya tall, King\nLike the Hitman nigga, holla \"ball game!\"\n\n[Hook]", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}