{"songs": [{"title": "Don’t Deserve It", "album": "Trap Back 2 ", "year": "2010-03-13", "lyrics": "(Intro)\nRich niggas is back\nIt’s the little Rochy right here\nI know yall love it when we get together\nLet’s get em Gucci\n\n(Verse)\nI’m walkin with my strap, I give a fuck a nigga searchin\nDon’t keep it in the car, I got that pistol on person\nYou pissed Flocka Flame – you dissed the fuckin wrong person\nRun up on Gucci Mane – you be another dead person\nI toss em in the river – now the whole city searchin\nThe AK hit his ass and now that nigga need a surgeon\nTry me in this club then I’m gon shut it down early\nScene was so sick that the police start hurling\n\n(Interlude)\nUndisputed Dynamic Duo in the building\nStand up for this shit man\nWe raised yall niggas\nDJ Holiday, Gucci Mane\nTrap Back 2 niggas\n\n(Verse)\nI’m walkin with my strap, I give a fuck a nigga searchin\nDon’t keep it in the car, I got that pistol on person\nYou pissed Flocka Flame – you dissed the fuckin wrong person\nRun up on Gucci Mane – you be another dead person\nI toss em in the river – now the whole city searchin\nThe AK hit his ass and now that nigga need a surgeon\nTry me in this club then I’m gon shut it down early\nScene was so sick that the police start hurling\nEast Atlanta zone 6 niggas so thirsty\nThat shop with you Tuesday and rob your ass Thursday\nOne years old and he already start cursin\n12 years old and he already start servin\n\n(Hook)\nIf you ain’t getting money then I think you don’t deserve it\nYou reach for my chain you be another dead person\nBig Guwap, why they call me Mr. Perfect\nThen look me in my eyes when you see me cuz you’re nervous\nI murk your homeboy and I smoked a pound of purple\nYou’re talkin to the cops, pussy nigga I know you’re worthless\nHard top Rolls, smoking kush behind the curtains\nThe word just came in, wutchu wanna purchase?\n\n(Verse)\nFuck it cuz the young nigga turfin\nIf you ain’t getting no money then these bitches feel you’re worthless\nOh you a live-wire? Then I’mma make you short-circuit\nThese clown ass niggas need to go work in the circus\nMillion dollar nigga but I still eat Church's\nYou try me in these Church's then my boy then start burstin\nWhen he died and this Boosy mama feel he didn’t deserved it\nBox cutter in my pocket, I carve yo ass up like a turkey\nPut that on my squad, I ain’t gon let no nigga hurt me\nMy gun do all my talkin and I know you niggas heard me\nOld school vet like I’m fuckin James Worthy\nBut I’m shootin from the corner like I’m fuckin Bobby Hurley\n\n(Hook)\nIf you ain’t getting money then I think you don’t deserve it\nYou reach for my chain you be another dead person\nBig Guwap, why they call me Mr. Perfect\nThen look me in my eyes when you see me cuz you’re nervous\nI murk your homeboy and I smoked a pound of purple\nYou’re talkin to the cops, pussy nigga I know you’re worthless\nHard top Rolls, smoking kush behind the curtains\nThe word just came in, wutchu wanna purchase?\n\n(Verse: Wooh Da Kid)\nMoney makin me, no it’s money makin Wooh Da\nMy youngin 13 like a 3rd world shooter\nIn a couple years he’ll be taking over blocks\nAK47, got him takin over spots\nThe only thing I see in the mirror is me\nBefore you catch me slippin it’s gon be a first degree\nWord around town you a motherfuckin hater\nWe fucked the same bitch, the only difference is you paid er\nIf you ain’t getting money you a motherfuckin joke\nReachin for my strap if a nigga going broke\nScreamin adios, left from bacon from the toast\nOne minute here, next minute you a ghost (adios)\n\n(Hook)\nIf you ain’t getting money then I think you don’t deserve it\nYou reach for my chain you be another dead person\nBig Guwap, why they call me Mr. Perfect\nThen look me in my eyes when you see me cuz you’re nervous\nI murk your homeboy and I smoked a pound of purple\nYou’re talkin to the cops, pussy nigga I know you’re worthless\nHard top Rolls, smoking kush behind the curtains\nThe word just came in, wutchu wanna purchase?\n\nGucci!", "image": "https://images.genius.com/5ca2bb73f63c6bc2cfd48bd39758ce31.500x500x1.jpg"}], "artist": "Gucci Mane"}