{"songs": [{"title": "Soopaman Luva 5 (Part I)", "album": "Malpractice", "year": "2001-05-22", "lyrics": "Somebody stole my mojo!\n\n[Verse 1]\nYo, once again..\nSoopaman Luva flying through the fuckin sky\nI'm lookin for my mojo, I'm fried chinky-eyed\nMy cape is still tore up, but I make a lil' money\nI'm like Ace Ventura, duckin my landlord\nThe land of the poor, where I handle my biz\nI got a weed spot on the block Hannibal live\nPokemon on the pipe, Rudolph the deer Red-Nose\nGlow in the night, when his nose gettin right\nI pimp Snow and Vanna White on the ho stroll\nDr. Ruth on E, sippin Old Gold\nMr. T on crack, mohawk cornrow\nIn South Park with the Chef, in the stolen Ford\n\"I'm lookin for my mojo, where it at?\nGot a APB on it dawg, where it at?\"\nI ran into Cita, from BET\nShe said, \"Man is a nigga, that's fast on the trigger\nI thought he was you, when we had the party for two\nMy girlfriend said the same, majority rules\"\n\"Damn!! Who takin my women?\nWho takin my chickens around Thanksgiving? Now that's pimpin!\"\nCalled my man Meth and Bishop Don Juan\nHe smokin a blunt, other sippin Chandon\nHe said it ain't the game, but how you play it\nSo I can't hate the game, so I'm dyin to play it\nNow I'm back in the air, ready to put my smack down\nI'm searchin for the impostor to pat down\nI'm urgin to put the Glock up and clap rounds\nIt's curtains like Jimmy Hoffa, he not found\nSo ride on me, try homie\nYour plan'll fail like the Acme Kit from Coyote\nNow I'mma find the bastard that stole my juice\nSoopaman Part Five, in your archives\n\n[Singers]\nI'm yo Soopaman baby, that's who I am\nFlyin through the air, without a care\nI'm high as hell blazin, that Cali weed (Kryptonite for life)\nThat Kryptonite bud, that sticky green\nI'm yo' Soopaman (he's yo' Soopaman) I'm yo' Soopaman\nI'm yo' Soopaman (whoaaa yea yea yea yea) I'm yo' Soopaman\nI'm yo' Soopaman (he's high as hell for life)\nI'm yo' Soopaman (that Cali weed)\nI'm yo' Soopaman (Kryptonite baller)\nI'm yo' Soopaman (sticky green)\n\n{*needle drags across the record*}", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}