{"songs": [{"title": "Problem Child", "album": "Independence", "year": "2007-08-14", "lyrics": "[Intro: sample (Jadakiss)]\n(Load up, hahahahaha)\n\"Why can't you be man enough\"\n(Yeah, where you at, nigga?)\n\"Tell me where, you coming from\"\n(Load up nigga, wooo! HA-HAAAEEH!)\n\n[Verse 1: Jadakiss]\nYo, can't really figure this clown out\nWhere is he from, Jamaica Queens, Cali or down South?\nI could let a L.A. gun hit him\nBut Grape Street already told me you payin' to run with 'em\nI could let a New York knife poke him with one of my throw aways\nBut I don't want to see no cops smoke him, uhh\nSomebody tell Pa we ridin'\nAnd get ready to auction off the car he die in (eBay)\nNever we bump heads, since you like havin' people with you\nGet you a hospital with bunk beds\nWithout Dr. Dre, you would just make slow jams\nCome up out of that witness protection program\nHov' don't really respect you, get in your place\nIf B.I.G. was alive, he'd probably spit in your face\nNas was doing just fine without you (Esco)\nAnd Pac probably would've made an album about you\nSo I guess that just leaves me here to get rid of you\nAnd Rakim and them, they don't even consider you\nEm know you ain't got nothin' for Jada\nAnd I know he appreciates all the money you made him\nIt's two thousand-five, nobody fights fair\nI just know an instrumental's your worst nighmare\nBut you tough and you bad, too bad, you mad\nProbably been in your old hood more than you have\nYeah, you sold more records than me\nBut in the streets you gon' always be second to me\nWe was damn near feelin' you\nEven though your career is based off somebody damn near killin' you\nShit you be doing ain't even considered rappin' to us\nThis is probably the best thing that happened to us\nThe best Wanksta, internet gangsta\nMagazine mobster, shit on your whole roster\nGet ready to say Hail Marys and Our Father's\nGet out your black suits and hard bottoms\nHaha, don't worry, I got him\nHe ain't a problem child, just a child with a problem\n\n[Break: sample (Jadakiss)]\n\"Why can't you be man enough\"\n(We love it, nigga, let's go)\n\"Tell me where, you coming from\"\n\n[Verse 2: Styles P]\nD-Block, don't think it, nigga\nTake a piss in your Formula 50, drink it, nigga\nGet shot out the Reeboks nigga\nGot shot and ain't shoot none back, you'se a biatch nigga\nIf I would've got shot on grandma's stoop\nI would've had somebody grab my duke, right!?\nIn the streets they say, \"50, who shot ya?\"\nNamed three niggas soon as he came out the doctor\nAnd you far from a gangsta, nigga\nYou was talkin' 'bout yourself when you made Wanksta, nigga\nListen, why work out, cock guns on the DVD\nRun around with cops from homicide and TNT\nNigga you can suck my dick\nCome around without cops, shit's on, you gon' get touched quick\nCause, I was at the VIBE when it jumped off\nPut fifty grand up, you pussy you ain't even lift a hand up\nYour man stabbed somethin', police grab somethin'\nBut besides that, I ain't seen nobody man up\nShit, what the plot is about?\nCause you know that, you don't need a dentist to get shot in the mouth\nAnd the hood hate ya shit, but you hot in the south\nIt's the crackers that buy the album, what's the plottin' about?\nMany Men make a wish, but we ain't many men\nSo you gon' get death when we let them semis spit, what?\n\n[Sample]\n\"Why can't you be man enough\"\n\"Tell me where, you coming from\"\n\"Why can't you be man enough\"\n\"Tell me where, you coming from\"", "image": "https://images.genius.com/7bcf4d6fe249f1d515dfb14c0752464e.500x494x1.jpg"}], "artist": "Jadakiss"}