{"songs": [{"title": "Moves", "album": "I Decided.", "year": "2016-12-23", "lyrics": "[Intro]\nYeah\nSex game had her ass blowing me up (brrr)\nSex game had her ass texting me up\nYeah (808 Mafia!)\nWhoa\n\n[Chorus]\nI got the moves\nI got the moves\nI'm making moves\nYou gotta move (you gotta move)\nShe make that back move (damn)\nShe made her titties move (goddamn)\nI make the city move (like whoa)\nI make the city move\nI got the moves (I'm making-)\nI got the moves (I got the moves)\nI'm making moves (I'm making moves)\nYou gotta move (you gotta-)\nShe make that back move (damn)\nShe made her titties move (goddamn)\nI make the city move (l do)\nI make the city move (I do)\n\n[Verse]\nLook, give me the ball and I won't have to pass it\nI ain't passing out until I'm asthma attacking\nI take a plan and then I back-to-back it\nHit after hit, check the batting average\nI take the work, flip it, acrobatic\nGot a little time and a lot of talent\nDo a little talking and a lot of action\nSeen the competition, hm, not a challenge\nI lean, I move, I walk through in this bitch\nPacked out, but I can count on my hands who I'ma talk to in this bitch\nGirls from law school in this bitch\nYeah, they paralegals\nBarely 21, that's very legal\nBut they doing shit that's probably barely legal, aw, man\nIt's that nigga that you probably least expected\nI just had a couple dots that need connecting\nNow your top five getting redirected\nFrom here on out, it'll be consecutive\nWe making moves like Tarantino, like J.J. Abrams\nMoving like Channing Tatum\nMoving like Jason Statham\nMotherfuck the whole industry\nHalf of these niggas my mini-me's\nI got this bitch going off more than breaking and entering\nYou hot for a minute, me\nI make the shit that last for infinity\nHop in the booth, man, that shit like a gym to me, don't test the agility\nSilly, silly, thinking that the negativity you talking could ever fuck up the tranquility, look\nOkay, okay, okay, I'm on Rodeo for the day\nIf you owe me then you better pay your layaway, away\nStay away, or your ass might get K.O., kay today\nMan, that \"pew! pew!\" hit your ass from like way, a-ways, away\n\n[Chorus]\nI got the moves\nI got the moves (whoa)\nI'm making moves\nYou gotta move (you gotta move)\nShe make that back move (damn)\nShe made her titties move (goddamn)\nI make the city move (like whoa)\nI make the city move\nI got the moves (I'm making-)\nI got the moves (I got the moves)\nI'm making moves (I'm making moves)\nYou gotta move (you gotta-)\nShe make that back move (damn)\nShe made her titties move (goddamn)\nI make the city move (I do)\nI make the city move (yeah I do)\n\n[Outro]\nLook, I'm a Don, I'm a Don, I'm a Don (Don)\nI gave my whole family jobs and I take care of my Mom\nMe and my girl been through so much, that's my partner in crime  (808 Mafia!)\nTouch any of the above, now you harder to find\nGone", "image": "https://images.genius.com/15fe74f551404783e7b7cb1a8ba102e9.1000x1000x1.jpg"}], "artist": "Big Sean"}