{"songs": [{"title": "Where I’m From (OG)", "album": "Who Got Game?", "year": null, "lyrics": "[Verse 1: Dr. Dre]\nStreets is talkin, sayin Dre done changed\nAnd he ain't been to the hood, well how the fuck I find Game?\nI studied this rap shit, still a \"Hundred Miles and Runnin'\"\nStill makin Aftermath classics\nYou might catch me out in traffic\nOh-five Aston, bitches askin \"Where I'm From\"\nY'all forgot who helped 50 Cent pop\nI ain't spent my own money since Eminem dropped\nIn eighty-fo' I had the streets locked\nI am to gangsta rap what Biz Markie is to beatbox\nNiggas think cause I stopped on that \"Detox\"\nI traded in my All Stars for some Freeboks\nSpeakers still bumpin, the beats still comin\nCompton's version of Phil Drummond\nSame Dre, \"Different Strokes,\" same six-fo', different spokes\nSame \"Chronic\" just different smoke\n\n[Chorus: Nate Dogg (scratches)]\nIf you don't know (\"Aftermath, nigga with a attitude\")\n(\"Game time niggas, Westside!\") Where I'm from\n(\"Nigga with a attitude, Straight Outta Compton we rock khakis and Chucks\")\nIf you don't know (\"Almost lost my life when Dre dropped The Chronic\")\n(\"Legend in the making\") Where I'm from\n(\"Aftermath you bastards, watch your colors in this City of Angels\")\n\n[Verse 2: The Game]\nY'all niggas got it fucked up, what you thought\nCause I'm from Compton I couldn't do numbers like Usher?\nPlatinum certified, nigga that's a mill' plus\nPlay both sides of the fence cause the Crips feel cuz\nSee me ridin with Nate, nigga it's still Bloods\nYou can C-Walk to this homey it's still love\nNigga I've been bangin since Mary J. did \"Real Love\"\n(If you don't know)\nI painted the Rover black\nThe West coast is back, I can smoke to that\nMoms got the CL-6, that's a fact\nI bought the house, I'm just waitin on the platinum plaques\nNiggas lookin for a cat to jack\nHomey I'm willin to do two life sentences back to back\nSo please don't push me\nYou niggas is WNBA - all pussy\n\n[Chorus: Nate Dogg (scratches)]\nIf you don't know (\"Aftermath, nigga with a attitude\")\n(\"Game time niggas, Westside!\") Where I'm from\n(\"Nigga with a attitude, Straight Outta Compton we rock khakis and Chucks\")\nIf you don't know (\"Almost lost my life when Dre dropped The Chronic\")\n(\"Legend in the making\") Where I'm from\n(\"Aftermath you bastards, watch your colors in this City of Angels\")", "image": "https://images.genius.com/a07da7e37a6306d0e29285084f5afb9e.400x400x1.jpg"}], "artist": "The Game"}