{"songs": [{"title": "King Piece in the Chess Game", "album": "The Art of Storytelling", "year": "1999-05-25", "lyrics": "[Slick Rick]\nCheck, check, check, check\nCheck, check.. * Slick Rick starts humming a snake charmer song *\nYeah..\nThey say.. that Rick Rick is..\n\nYou're all garbage, that type talk I'm on\nDumb one becomin glad the great one walks among\nWhisperin, couple I scuffle eye\nYou little feedback niggas don't want any trouble\nRick'll own clout, sewn bout\nLick a throw now, how til death I kick a bone out\nWhy pursue for folk object?\nMy record will be barkin all through your broke project\n?? Yes my dog art, best to park her, kark her ??\nYou don't want death to walk her\nNot sayin that -- ain't nuttin could do me\nBut in the rap game, all secondary to me\nWHOA, whatever I settle\nIf a nigga wanna eat he better never cry battle\nHell yeah, ram the one sell fare elsewhere\nPut you and your family on welfare\n\nChorus: Canibus\n\n(Ricky D!) Rip it up, your watery blood\nAin't thick enough, yo wack niggas ain't slick enough\nReady and willin to face you, death awaits you\nThe king piece in the chess game, to checkmate you\n\n[Slick Rick]\nOoooooooooh, twist shot bitch, ?? voter ignores ??\nWatch toys duck, consider rap's ultimate voicebox\nDevour, and addressin dem coward\nHow can one man posess so much power?\nRhyme tearin through, bash all trifle\nThe eyes and spare a few assholes lives\nThis object -- brothers are glued to knob lick\n'Scuse me, if I'm bein overly rude to public\nThe favorite -- make you fall in love, make whoever with\nClever kid, make you do the best steps you ever did\nThe trick is, managin to kick it\nIt's no such thing as challenging the Slickest\nIt's double-or-sure shot, crumble before spot\n(I know) Must be humble before God\nRinging, cat must fear king-ing\nParty over here, type atmosphere spinning\n\nChorus\n\n[Slick Rick]\nOoooooooooh, I toy your cheddar top-netter\nYou find me a human being, boy or girl bet-ter\nIt's short son -- nurse and them soundkick bark on\nStop talk, stop worshipin the ground Rick walk on\nBitch play number one bougie\nWish they could give motherfucker some pussy\nSeen the face of supreme in tasteness\nNever see another human being this greatness\nSuccessful, and the hype is effectful and\nSorry God if bein any type disrespectful and\nHip-hop, assume pop's acquited\nNow with tick-tock, you don't stop, hit it!\nCommand Rick, shower the firmament\nEarnin it, tremendous power is permanent\nUnless frame interest dame\nLet's name who the king piece in the chess game\n\nChorus 4X\n\n[Canibus]\nYo, we can battle in front of the castle, I'll disgrace you\nI roast you, I burn you, I bake you\nI cremate you -- I motherfuckin hate you!\nThe king piece in the chess game'll check mate you, nigga!\nRicky D y'all..", "image": "https://images.genius.com/73539fff4e6ebc470e6cab73853f0ac6.1000x1000x1.jpg"}], "artist": "Slick Rick"}