{"songs": [{"title": "I Will Survive", "album": "Smokefest Underground", "year": "2000-10-31", "lyrics": "[Technique]\nBy dawn's early light\nI shine brighter than the stars in the night\nAnd 'bout ready for a fight\nCome noon, I've consumed enough juice\nTo cut loose and throw a mic to the moon\nSince I'm the sun, I'll make you one, it's all for fun\nI'm torching hot and all the same\nFrom playing war games with Saddam Hussein\nNow who's sane? I'm insane, my membrane's on cold-grown\nThe tempature's rising, to fry the cells in your dome\nIt might be on, and if you think so, you know me\nIt's Tech Caponey, the Doggfather's little homey\n\n[Snoop Doggy Dogg]\nAin't that somethin', how I got little homeys now?\nI remember when I was just a little bow-wow\nWriting for my rep, calling 'fore I step\nNow I put niggas in the game just to stay on deck\nHigh profile, but my style low-pro\nTop dogg on the Row, Doggystyle C.E.O\nAnd I blow the best indo, that you know of\nSo when I'm in your town, dip down, and show love\nYou know what? What's up? Shit, I'm feeling good now\nYou better come and get me 'fore I fall into a freestyle\n\n[Technique]\nThey say, what's a rapper? Well nigga, what's an emcee?\nIf they don't got the skills, then they don't roll with me\nAin't that the truth?, I'm bulletproof off the roof\nI got a mic and a fix, that'll jack you for your tooth\nI'm out for rep, but how long will it last?\nI'm coming up quick, cause broke niggas need cash\nAt last, I'm at the top, so I maintain now\nGotta bang now, nigga this Doggystyle\n\n[Snoop Doggy Dogg]\nAll she ever wanted was a small time, love thang\nGot my homey caught up in the dope game, coke game\nHe so sprung, on top of that he young\nHe's only thirteen years old, and the world's so cold\nHe never took the time-out to fall down on his knees\nUntil he fucked his G, got some keys, now they's enemies\nThe niggas he grew up with, they put him in the game\nNow they 'bout to take him out the game\nMan it's a shame, but you know how that shit go\nThat's life in the fast lane, that's why I roll slow\n\n[Hook]: Kurupt,(Snoop), [*some singing in the backgound*]\nI'd rather not get shot\nI'd rather sit in the studio and rock spots\nDogg Pound, Doggystyle, we're one big family, it's all D.P.G. (D.P.G.)\nI got a G on the best bomb money can buy\nI ain't out for no homicides, I'm out to survive\nDogg Pound, Doggystyle, one big family, it's all D.P.G. (D.P.G.)\n\n[Technique]\n(Niggas) Niggas and hoes will try to get you twisted\nBut I'm unlisted in the books\nYou base your life on that, you might get your life took, BLAOW!\nPut me in the game, I'm riding hard 'til I win\nServe a crew, kill a few niggas, 'til the end\nI mean, I'm a fiend for superior green\nAnd all my life I got advice from a superior team\nI gotta stay away from the casket\nDon't get blasted, and tell my kids how I lasted\nBut my crew's mafioso, so my philoso-\nPhy is to G to the day that I d-i-e [*echoes*]\n\n[Snoop Doggy Dogg]\nSnoop Dogg, smooth and imperial\nWake up every morning to my Lucky Charms cerials\nTime's getting drastic, man I'm a flas it\nDogg Pound Gangstas' choking off that boombastic\nHave you ever heard?\nI'm loose, shook the feds, like the juice, Snoop Dogg is 121st proof\nFool, you's a deuce, Deuce is some Genuine Draft\nI'm a genuwine, like ??, and all about cash, cash\nCash, I got some free, so indeed I gets the lighter for the hash\nHas it ever been a time when you didn't have a dime\nTo your name, and the only way to gain is through crime?\nSometimes I used to pack, one time I got jacked by some sacs\nBut you know I got mine, you know about the Don Corleone\nI'm-a survive and thank God for Lil' Spanky B. and Bone\n\n[Hook]: Kurupt,(Snoop), [*some singing in the backgound*]\n\n[*singing in the backgound continues until the end*]", "image": "https://images.genius.com/e7d84865e8d21f7778aa93228a899a2c.599x623x1.jpg"}], "artist": "Snoop Dogg"}