{"songs": [{"title": "Tony Tone", "album": "TESTING", "year": "2018-05-25", "lyrics": "[Intro: Puff Daddy & A$AP Rocky]\nUh, my mic sounds nice, check one (Woo!)\nMy mic sounds nice, check two (Uh-huh, yeah-yeah)\nTesting, one-two, one-two, let's go (Uh-huh, yeah-yeah)\n(Uh, woo!) Let's go\n(Uh, uh, yeah-yeah) Let's go\nMy mic sounds nice, check one (Yeah, yeah)\nMy mic sounds nice, check two (Yeah, testing, testing, woo!)\n\n[Chorus: A$AP Rocky & Puff Daddy]\nStoned-stoned when I'm in my zoney-zone\nSmokin' on the homegrown, feeling like I'm all alone\nUsed to go to Kingdome, Rucker Park with Tony Tone (Harlem!)\nListenin' to Bone Bone, feelin's in my bone bone\n\n[Post-Chorus: A$AP Rocky & Puff Daddy]\nI can tell it\nI could give a fuck about a list, ya heard? (Ya heard?)\nI could give a fuck about a diss, ya heard? (Ya heard?)\nI could give a fuck about your clique, ya heard? (Ya heard?)\nShut the fuck up 'fore I rock your bitch, ya heard? Uh\nShut the fuck up!\n\n[Verse 1: A$AP Rocky & Puff Daddy]\nMy mama named me, my papa gave me cock to take a piss with\nTo fuck ya bitch with, life is different for me, for instance\nThe type of niggas spray his kids in some chicks\nHe wouldn't raise his kids with, that type of twisted sick shit\nCome on, man\n\n[Interlude: Woman & Puff Daddy]\nWhat you say, nigga? Time's out\nLet's start over with this conversation\nYou sound super crazy right now\nAnd I got my two kids listenin'? (I'm just playing)\nYou said what? (I said I'm just-)\nUh-uh, nigga, you got me fucked up\nShut the fuck up!\n\n[Post-Chorus: A$AP Rocky & Puff Daddy]\nI could give a fuck about a list, ya heard? (Ya heard?)\nI could give a fuck about a diss, ya heard? (Ya heard?)\nI could give a fuck about your clique, ya heard? (Ya heard?)\nShut the fuck up 'fore I rock your bitch, ya heard?\nShut the fuck up!\n\n[Verse 2: A$AP Rocky & Puff Daddy]\nPeople really think I'm an asshole, I say anything (C'mon)\nTruthfully, I just say what I really think\nLike I'm too fresh, man, to be an under-class-man (Too fresh)\nWould say, \"Suck my dick\"—but that's sexual harassment (Take that, let's go!)\nFuck around and really come through in a murse on ya (Come on)\nWho else you know design ya stage and do your merch over? (Come on)\nAnd if you lame, do your verse over (Yeah)\nI changed the game like I'm Kurt Warner (Yeah, keep going)\nI run the game like I'm Time Warner (Yeah)\nThis ain't no Teen Choice Awards, slime slide on ya (Keep goin', yeah)\nAnd make your home for mama's fried roasting\nHad leans and Beams, tomatoes, Mercedes\nHad keys and grams, just me and Yams\n(Yeah, come on)\n\n[Interlude: A$AP Rocky]\nAnd Stevie rest in peace\nPickin' off the last collard greens, stress up outta me\nNow we sellin' out the Coliseum for the dynasty\nTell them boys who got it locked and got the key\nYou gotta see behind the scenes or in the streets (A$AP)\n\n[Verse 3: A$AP Rocky, Puff Daddy & A$AP Ferg]\nPeep my repertoire, Uptown esplanade\nEleanor, Druham, Nickel goin too HAM (C'mon)\nAK, Jackie Rob, East 11, 99\nLenox Ave, VLONE, Eastside, Wingstone (Yeah, Uptown)\n\n[Chorus: A$AP Rocky & Puff Daddy]\nStoned-stoned when I'm in my zoney-zone\nSmokin' on the homegrown, feeling like I'm all alone (Yeah)\nUsed to go to Kingdome, Rucker Park with Tony Tone (C'mon, that's right)\nListenin' to Bone Bone, feelin's in my bone bone (Yeah, yeah)\n\n[Post-Chorus: A$AP Rocky & Puff Daddy]\nI can tell it\nI could give a fuck about a list, ya heard? (Take that, yeah)\nI could give a fuck about a diss, ya heard? (Ya heard?)\nI could give a fuck about your clique, ya heard? (Take that)\nShut the fuck up 'fore I rock your bitch, ya heard? Uh (Take that, take that)\n\n[Outro: Puff Daddy & A$AP Ferg]\nAyo, we don't give a fuck about none of that shit\nThis is Harlem, motherfuckers (Yeah, take that, take that)\nThe fuck you think? (Uptown, nigga!)\nMob, A$AP, Same Gang, Tone Wop\nHarlem", "image": "https://images.genius.com/923416d6d8835da19bc83cfb578934ae.320x320x1.jpg"}], "artist": "A$AP Rocky"}