{"songs": [{"title": "Death Around the Corner", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Intro]\nChild: Why you by the window? What's wrong daddy?\nMother: I know what's wrong with that crazy motherfucker\nHe just stand by the goddamn window\nWith that fuckin' AK all day (there you go)\nYou don't work, you don't fuck, you don't\nYou don't do a goddamn thing\n\n[Verse 1]\nI see death around the corner, gotta stay high while I survive\nIn the city where the skinny niggas die\nIf they bury me, bury me as a G nigga, no need to worry\nI expect retaliation in a hurry\nI see death around the - corner, any day\nTryin to keep it together, no one lives forever anyway\nStrugglin' and strivin', my destiny's to die\nKeep my finger on the trigger, no mercy in my eyes\nIn a ball of confusion, I'm thinkin' 'bout my daddy\nMadder than a motherfucker, they never shoulda had me\nI guess I seen too many murders, the doctors can't help me\nGot me stressin' with my pistol in my sheets, it ain't healthy\nAm I paranoid? - Tell me the truth\nI'm out the window with my AK, ready to shoot\nRan out of indo and my mind can't take the stress, I'm out of breath\nMake me wanna kill my damn self; but I see death around the corner\n\n[Hook]\n(\"When we were kids, belonging felt good..\")\nI see death around the corner\n(\"But having respect, that feels even better..\")\nI see death around the corner\n(\"When we were kids, belonging felt good..\")\nI see death around the corner\n(\"But having respect, that feels even better..\")\n\n[Verse 2]\nI see death around the corner, the pressure's gettin' to me\nI no longer trust my homies - them phonies tried to do me\nSmokin' too much weed, got me paranoid, stressed\nPack a gat and my vest, under my clothes when I dress\nHere's hopin' I die the way I lived, straight thuggin'\nHuggin' my trigger for all them niggas that was buggin'\nMy homie told me once, don't you trust them other suckers\nThey front like they your homies but they phony motherfuckers\nAnd even if I did die young, who'd care\nAll I ever got was mean mugs and cold stares\nGot homies in my head that done passed away screamin' \"Please!\"\nYoung nigga, make G's\nI can't give up, although I'm hopeless, I think my mind's gone\nAll I can do is get my grind on, death around the corner\n\n[Hook]\n(\"When we were kids, belonging felt good..\")\nI see death around the corner\n(\"But having respect, that feels even better..\")\nI see death around the corner\n(\"When we were kids, belonging felt good..\")\nI see death around the corner\n(\"But having respect, that feels even better..\")\n\n[Verse 3]\n(I was raised) I was raised in the city, shitty\nEver since I was an itty bitty kiddy\nDrinkin' liquor out my momma's titty\nAnd smokin' weed was an everyday thang in my household\nAnd drinkin' liquor til' you out cold\nAnd though I'm grown now, nigga it's still on - Pow!\nBustin on them niggas 'til they gone\nHow many more jealous ass bitches, comin' for my riches\nNow I gotta be suspicious when I bone\nCause if I ain't sharp and heartless, them bitches'll start shit\nExcuse me, but this is where we part bitch\nNo more game for free, please explain to me\nWhy niggas trip bitch, who you came to see?\nMurder me now but see me later man, that's on my pops\nI got homies that will hunt you 'til you drop\nI hope the Lord can forgive me\nI was a G and gettin' high was a way of bein' free\nI see death around the corner\n\n[Hook]\n(\"When we were kids, belonging felt good..\")\nI see death around the corner\n(\"But having respect, that feels even better..\")\nI see death around the corner\n(\"When we were kids, belonging felt good..\")\nI see death around the corner\n(\"But having respect, that feels even better..\")\nI see death around the corner\n\n[Outro]\nThis is for all the real motherfuckin' niggas out there\nI know you ain't scared to die; we all gotta go, y'know?\nA real motherfucker will pick the time he goes\nAnd make sure he handles his motherfuckin' business\n(You think you're gonna live long enough to spend that money\nYou fuckin hump?)\nY'all niggas stop actin' like pussies out there, all right\nIf any of you..\nAre tired of gettin' ripped off by guys like that...\nI want his family dead! I want his house burnt to the ground!\nI wanna go there in the middle of the night I wanna piss on his ashes!\nI want his family dead! I want his house burnt to the ground!\nI wanna go there in the middle of the night I wanna piss on his ashes!\nI want that son of a bitch dead, I want him dead!\nI want him dead, I don't care...", "image": "https://images.genius.com/aa900ef68a5861f06835ba38e4e6d764.640x640x1.jpg"}], "artist": "2Pac"}