{"songs": [{"title": "PMW (All I Really Need)", "album": "LONG.LIVE.A$AP (Deluxe Version)", "year": "2013-01-15", "lyrics": "[Verse 1: A$AP Rocky]\nAll I think about is life, nights, sipping on Sprite\nLittle codeine, nigga get throwed right\nTwo blonde dykes wanna kiss all night\nI just pray to God that the shit go right\nLittle argument, and their fists don't fight\nFuck a dog ho and the bitch gon' bite\nA$AP nigga, sip Cris all night\nSo them R. Kelly hoes getting pissed on twice\nDamn, how a young nigga get so nice?\nYoung nigga cold like he sitting on ice\nFuck broke, tryna be rich all life\nI coulda been a criminal and just rolled dice\nMy nuts hanging, my top back\nHoes screaming that Pac back\nThrowing Westside, bandana tied\nA$AP life, got a Pac tat\nHarlem world my whole block strapped\nHoes all on my jock strap\nMy whip white but my top black\nAnd my bitch white but my cock black\nPurple drink? Got that\nTell these hoes all to twerk something\nBounce on me bitch, hurt something\nTell her pop that pussy like it's worth something\nSo shorty, she a stunner and daddy, he a runner\nBe that pretty mothafucka, you could call me what you wanna\nCause I'm in love with that ass, she in love with the cash\nSo she shaking it fast and then making them stacks\nAnd I'm taking it back and I'm taking her back\nTo the house just to bust in her mouth and I'm kicking her out\n\n[Bridge]\nHow 'bout me and you and you and I\nTake a ride to make this high\nOn and on and on and on\nOn and on and on and on\n\n[Chorus]\nSo I say pussy, money, weed\nPussy, money, weed\nPussy, money, weed\nThat's all a nigga need\n\n[Verse 2: Schoolboy Q]\nIt's A$AP Q, where the bread at?\nFuck around and bring the hush puppies back\nShe fuck me and the homies, she was cool with that\nThe block hot so I'm shaded in my bucket hat\nPause a little bit, I gotta little advice\nIf you fucked her once, then you could fuck her twice\nAnd don't get head from hoes with overbites\nJust giving out game, nigga show your right\nBorn stunna nigga, turn night to bright\nHigh as a kite in my Nike Flights\nMade 30 Racks it was just a flight\nFlew a bitch out too, it was just a night\nShorty got the booty make a nigga say, \"Whoa\"\nCan I suck your titties, tryna see how far I can go\nTry again and then again and she ain't telling me no\nSweetie tell me how you feeling, can I feel on you more?\nShe said, \"I ain't fucking for free,\" but ain't shit I can't afford\nShit, I'll pay you for it, now bounce that ass on my bungee cord\nYeah, whoopsie daisy, put a good kid in your Section.80\nTurn a baby into a lady, now here go the keys to my new Mercedes\nCause shawty she a stripper, all you got to do is tip her\nShe like ballers with some money screaming fuck them other niggas\nNow do A through Z for a G, panties go down to her feet\nPussy get wetter for me, smackin' that ass to the beat, give her that Diggity-D\n\n[Bridge]\nHow 'bout me and you and you and I\nTake a ride to make this high\nOn and on and on and on\nOn and on and on and on\n\n[Chorus]\nSo I say pussy, money, weed\nPussy, money, weed\nPussy, money, weed\nThat's all a nigga need", "image": "https://images.genius.com/75621d1119a70043aadbe3fbf4387d88.640x640x1.jpg"}], "artist": "A$AP Rocky"}