{"songs": [{"title": "It’s Over", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "[Little Girl]\nYeah, I saw you up in the club, uh huh\nYou think you was bad cause you had a Jag\n\n[Hook 2X: Natina]\nIt's over, it's over now\nMove over, it's my turn now\nIt's over, the game's shut down - sorry\n\n[Little Girl over Hook]\nYeah, yeah, my daddy's a big time baller (??)\n\n[Kurupt]\nI went from canopies to boards, fans to no repoirs\n(sorry) You ain't got the Bentley with four doors\nK-U, R-U, P-T, any, you just, bring my, bottle, of Remy\nRecognize a real hit when you hear one\nPostin up at the Playboy Mansion\nI stomp like gortex, poetical vortex\nBouncin to Jigga in California\n\n[Hook]\n\n[Natina]\nWha-wha, wha-what? C'mon, yo (what up in here?) yo, yo, yo\nIt's the N-A, T-I, aww, you know the rest (uh-huh)\nSilly how frequently they contest (uh-huh)\nI done toured across the seas and been across the world\nI done it for all y'all, my cats and my dawgs (haha, haha)\nIt's over, cause I'm bad to the bone (haha, haha)\nLeave a real diva to her own, alone\nI drive in Jaguars, so many different cars\nLife as a pop star, shouldn't be this hard, c'mon!\n\n[Hook]\n\n[Kurupt]\nSuckas..\nThis is how life should be (uh-huh) my girl and my peeps\nDon't make me remind you (uh-huh) I stays V.I.P\n(move over) For all my dime piece, all of my G's\nHustlers and pimps, with shiny wrists, making money\nCause my turn to shine and my turn to floss (bling bling)\nLike you play the game I stomps the Billboard\nOne thing for sure, G's hit the door\nTone and Poke know Natina does not play\nWhen she get on the mic she say what she gotta say\n(say) And Dr. Dre and Snoop, know Kurupt is ill (ill)\nFrom East coast to West the unforgettable skills\nBust from head to head (c'mon) sippin on Remy Red\nRunnin from club to club, nickels and dimes and dubs\nReady to rock spots, fours and drop tops\nKurupt and gangsta rap, Natina be runnin pop\n\n[Hook to fade w/ adlibs]", "image": "https://images.genius.com/d148b9136079e433cad48359c34d8258.300x300x1.jpg"}], "artist": "Kurupt"}