{"songs": [{"title": "Back And Forth", "album": "Young, Broke, and Infamous", "year": "2010-12-17", "lyrics": "[Intro]\nYou hear that, Phil? You not going to sleep\nFuck outta my room, man!\n(Cha)\nOh, I'll go for it\nYeah this is Logic on the beat, yo\n\n[Verse 1: Logic]\nLet me kick rhymes, let me do it slow\nGotta get it every time you ain't fuckin' know\nSee I'm half white and half negro\nSo I guess that's why I got a big ego\nI got double the talent so I guess I'm too nice\nTryna eat like two dykes 'cause I'm famished (I'm famished)\nBetter yet I'm in the depths of Hungary like Budapest\nAnd even when I'm fed I'ma keep going 'til the death\nCall me the collar bomba 'cause I'm blowing minds\nLike Osama, that's word to Obama\nSo much action within my words, there ain't no time for drama\nBringing wisdom like Dalai Lama, you ain't heard?\n\n[Verse 2: C Dot Castro]\nMy name is Castro\nHotter than taking shots of Tabasco\nI'm the shit, never constipated I got mad flow\nHave you wondering why the fuck did he go do that for?\nI don't know even my homies say I'm an asshole\nMy style is so defined 'cause I'm the definition\nOf truth you want proof well then you better listen\nI'm never dissin' that's a waste of time\nWhy waste an amazing rhyme\nOn them when I can take it and make it mine\nI'll make it fine, homie I don't need no one's help\nI stay on dimes so you can call me Roosevelt\nYeah, my flow is presidential\nI rip it acapella I don't need the instrumental\nSo try to sleep on me, I leave you like Tom in Seattle\nMy wordplay is too vicious homie\nSo you don't wanna scrabble, you don't wanna battle\nMy shit will leave you without a paddle\nNow they all riding me somebody give me a saddle\n\n[Verse 3: Logic]\nMy wifey livin' like Oprah\nMatter of fact Princess Diana\n'Cause my first name is S-I-R\nAnd I don't live like no bama\nSee I execute my emotion through perpetual grammar\n'Cause my stamina colder than Canada\nAnd hotter than Hades\nI spit more than babies infected with rabies\nThey can't get over the fact\nThat I'm under their skin like scabies, what it do", "image": "https://images.genius.com/0f21a1e2589d732e4a263527296e9f51.500x500x1.jpg"}], "artist": "Logic"}