{"songs": [{"title": "Run Game", "album": null, "year": "2019-06-20", "lyrics": "[Intro]\nOh, oh, oh, oh\nF and F, yeah\nLupe, yeah\nUh-huh, I'm just sayin', I'm just sayin'\nYou know how we do, uh (I'm just playin')\nYou know how we get down, uh-huh\nYeah, just a little, just a little bit (Yeah, uh)\n\n[Verse 1]\nI ain't came to do much (Uh)\nUntuck my chain and spend a few bucks (Uh)\nAnd dap a new dame and keep the jewels up (Uh)\nMaintain a do and bring the shoes up\nLook, uh, I'm tryna keep yo new love\nYou know how Lu' does, you move like I move girl\nMan, she's so foxy cute, yeah\nI can't wait to Versace suit her (Uh)\nSo in approximately five, four, three, two, one\nWhat up, hon? What you know about your future? (Uh)\nWhat you know about a superstar?\nLike I R, your man's VIP (Uh)\nLet me pour you a little more champ-ag-nee\nJust from yellow bottles, I'm anti-Asti\nI'm just itchin' to hand your car key\nEver driven a drop, not? Well come, give it a shot\n\n[Chorus]\nUh, I just came to run game (Oh)\nFlash my watch and show off my chain (Oh)\nYeah, let her know it's my Range (Oh)\nI'm just playin', I'm just sayin'\nLook, so this what we do (Yeah)\nYou, me, and her go back to my room (Yeah)\nTo chop game, pop a bottle or two (Yeah)\nI'm just playin', I'm just sayin'\nThat ain't me (Playboy)\n\n[Verse 2]\nPlayboy's back in ya ear (Uh)\nFresh from Bloomingdale's with a bag full of gear (Yeah)\nYes there's weed there, sex to sleep here (Uh)\nNah, understand, I'm just blessed to be here, yeah (Uh)\nHappy to be in the same section\nNow take my wallet like you're Jane Jetson (Uh-huh)\nAnd you and your best friend go an' get dressed\nIn the finest designers you can find\nThen let's rendezvous at the Westin\nSo I can do a lil' more flexin', count money in front of ya\nLet you wear my chain, act funny and front for ya (Uh)\nLet you tell me it's the time of the month for ya (Word)\nBoth y'all? (Yeah) Okay (Uh-huh, cool)\nI can wait (Yeah), it's cool (Yeah)\nOh, y'all wanna go to the pool\nWell, here's bikini money, more bank for some shoes\n\n[Chorus]\nI just, I just came to run game (Oh)\nFlash my watch and show off my chain (Oh)\nYeah, let her know it's my Range (Oh)\nI'm just playin', I'm just sayin'\nLook, so this what we do (Yeah)\nYou, me, and her go back to my room (Yeah)\nTo chop game, pop a bottle or two (Yeah)\nI'm just playin', I'm just sayin'\n\n[Verse 3]\nThe reality is I know exactly what my salary is\nAnd I can't afford to play myself\nRather play myself, trick off, and pay myself\nBefore I break myself to make her take off belt\nNah, we can go shoppin', yeah\nAnd we can roll around in the drop, boo, yeah\nBut you can't hold it down from the top, boo (Yeah)\nSo please understand that my buck stops here\nI don't need you, why should I succumb\nTo the power of the P U, frontin' to intrigue you\nSomething for your peoples, I seen it coming like previews\nSo I started dumbing to deceive you (Uh)\nAnd make you fall for the okie-doke (Uh-huh)\nBoo, I must admit this was mostly hoax\nI mean, I stopped pushing Ranges when I was 17\nNow it's about Porsches, forest green (Uh)\n\n[Chorus]\nI just came to run game (Oh)\nFlash my watch and show off my chain (Oh)\nYeah, let her know it's my Range (Oh)\nI'm just playin', I'm just sayin'\nLook, so this what we do (Yeah)\nYou, me, and her go back to my room (Yeah)\nTo chop game, pop a bottle or two (Yeah)\nI'm just playin', I'm just sayin'\n(That ain't me)", "image": "https://images.genius.com/2c8ff7d75498df94617c4bafc91cad0f.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}