{"songs": [{"title": "Boogie Down Productions’s “You Must Learn”", "album": "Conscious Rap Teacher Mixtape Hip Hop Saved My Life", "year": null, "lyrics": "[Hook]\nJust like I told you, you must learn\n\nIt's calm yet wild the style that I speak\nJust filled with facts and you will never get weak in the heart\nIn fact you'll start to illuminate, knowledge to others in a song\nLet me demonstrate the force of knowledge\nKnowledge reigned supreme\nThe ignorant is ripped to smithereens\nWhat do you mean when you say I'm rebellious\nCause I don't accept everything that you're telling us\nWhat are you selling us the creator dwellin' us\nI sit in your unknown class while you're failing' us\nI failed your class cause I ain't with your reasoning\nYou're tryin' make me you by seasoning\nUp my mind with see Jane run, see John walk in a hardcore New York\nCome on now, that's like a chocolate cow\nIt doesn't exist no way, no how\nIt seems to me that in a school that's ebony\nAfrican history should be pumped up steadily, but it's not\nAnd this has got to stop, See Spot run, run get Spot\nInsulting to a Black mentality, a Black way of life\nOr a jet Black family, so I include with one concern, that\nYou must learn\n\n[Hook x2]\n\nI believe that if you're teaching history\nFilled with straight up facts no mystery\nTeach the student what needs to be taught\nCause Black and White kids both take shorts\nWhen one doesn't know about the other ones' culture\nIgnorance swoops down like a vulture\nCause you don't know that you ain't just a janitor\nNo one told you about Benjamin Banneker\nA brilliant Black man that invented the almanac\nCan't you see where KRS is coming at\nWith Eli Whitney, Haile Selassie\nGranville Woods made the walkie-talkie\nLewis Latimer improved on Edison\nCharles Drew did a lot for medicine\nGarrett Morgan made the traffic lights\nHarriet Tubman freed the slaves at night\nMadam C.J. Walker made the straightening comb;\nBut you won't know this is you weren't shown\nThe point I'm gettin' at it it might be harsh\nCause we're just walkin' around brainwashed\nSo what I'm sayin' is not to diss a man\nWe need the 89 school system\nOne that caters to a Black return because\nYou must learn\n\n[Hook]\n\n\"Alkebulan\" is the original name\nOf Africa, now stripped of it's fame\nIt's good to know that in ancient times\nEgyptians developed all sciences of the mind\nTo the point where they ruled the planet\nBut Rome, Greece, and Persia wasn't havin' it\nThey attacked, and won the war\nBut it wasn't enough, they had to get to the core\nCause in that time it was Alkebulan\nThat ruled religion, politics, and man\nIn order to destroy the Egyptian race\nThey had to wipe the sciences from off the face of the planet\nSo they proceeded to ban it\nThen replace it with Christianity\nAnd it's, been that way, all the way to today\nLearn what we teach; hear what we say\nBut here comes the K-the-R-the-S-the-O-the-N-the-E\nThe BDP and we rhyme intelligently\nLet me continue with Theodosyius\nA Greek ruler not known to most of us\nHe, in the fourth century A.D.,\nCalls the Egyptians fools you see\nTwo years later, Justinian rules\nSix A.D., was it for schools\nAs a result, ignorance had swirled\nOver Christian Europe and Greco-Roman worlds\nThis went on for a thousand years\nOf ignorance, stupidity, and tears\nNow comes the seventeenth century hardness\nEurope, began to come out of it's darkness\nSo Johann F. Blumenbach, a German\nCame out of nowhere and started confirming\nWhite supremacy and men of colors\nBefore this time, all men were brothers\nIt was Johann, who went on to say\nThere are five different colors in the world today\nThat's caucasian, malayan, and mongolian\nAmerican-Indian, and ethiopian\nYet, the ignorance gets scarier\nHe believed whites were superior\nAccording to his idiotic fountain\nThe purest whites were from the Caucas mountains\nJ. A. Blofener, and H. S. Chamberlain\nBoth supported this outrageous racism\nThis went on to what the master race should be\nAnd why they killed the Jews in Germany\nHere is the reason why I'm so concerned\nBecause you, must, learn!!!!", "image": "https://images.genius.com/50c0b1be30bf41d8a7d5c0fb1cdcfd6a.350x350x1.jpg"}], "artist": "KRS-One"}