{"songs": [{"title": "Ruffest Ryders", "album": "The 24th Letter", "year": "2001-01-01", "lyrics": "[Intro: Sheek Louch]\nThe present!\nYo, yo, yo!\n\n[Verse One: Sheek Louch]\nAyo if gon' sleep on something, might as well be a bed\nAnd if you gon' crack a nigga, might as well be a head\nCause if you targeting the L.O.X., you might as as well target a box\nThat you gon' sleep in for years, all covered wit rocks\nCause I think not, I pop shots, I double what y'all got\nYa hotshots ain't got blocks, ?llabuta? muchacha\nFrom the days in school, now a motherfucker rule\nAnd I could drop my chain in coffee and keep shit cool\nThat's how ice be, I'm priceless, the iciest\nAnd I dont gotta wear fatigues to blow out your chest\nMy bullets thump when I'm laced in some fly shit, punk\nThe baby nine be on the daily, ain't no poppin a trunk\nBut if I pop the trunk, its to hand you a rag\nSo you can wipe down the windows on the side of my Jag\nMust I brag? My shit paid for, yours tagged\nAnd every bitch you grabbed, Sheek bend em back\n\n[Verse Two: Jadakiss]\nAyo I hope you ain't tongue-kissin your spouse\nCause I be makin love in her in the mouth\nType of cat buck at your house\nToo slick, means she be suckin my dick\nAnd before you know it, I'ma have her stuffin my bricks\nJada, if I kiss you now, you'll die later\nI been nice since people was watchin movies on Beta\nReady to clap, everybody givin me that\nCause believe it or not, we be the ones settin the traps\nYou listen to y'all hits, then listen to our hits\nAin't nuttin y'all cowards could do but gossip\nThat's the reason now y'all players ain't got chips\nCause everytime I turn around y'all on the L.O.X. dick\nNiggas thats narrow, I just smack em wit the barrel\nGive it to em at the light, like Kane's cousin Abel\n\n[Chorus: All (DMX)]\nThe Ruff Ryders! (What?) The Ruff Ryders!\nThe Ruff Ryders! (What?) The Ruff Ryders!\nThe Ruff Ryders! (What?) The Ruff Ryders!\nThe Ruff Ryders! (What?) The Ruff Ryders!\n\n[Verse Three: Styles P]\nCatch you and your son, ya know when its done\nShow me the money, I show you a gun, cocksucker\nSP'll spin corner while you party with dun\nI clap you I clap him, and thats rule number one\nSuckin' my clip! And I don't give a hell what you spit\nWho you are, where you from, and who the hell you can get\nCuz I sell records, plus I got a jail record\nYa niggas ain't sayin' shhhh until ya'll bare weapons\nIm 3 years older than 20, holdin a Henney\nCan rip a dolla bill but can't fold up a penny\nWanna murder Styles cocksucka load up the semi\nIm at your baby mom house, on the steps climbed out\nLike you played the don out, bout to rip your arms out\nYou done screwed up and did it, tryin to act like you with it\nCame two in ur short sleeves, three in your fitted\nAnd even when you dead, you can still flinch and get it\nA ryda that'll smack ya, cock back and clap ya\nStyles P ya favorite rapper's favorite rapper\n\n[Verse Four: Eve]\nAin't no surprise killaz, only fuck wit recognized killaz\nBabygirl want the world, gave ya pies killaz\nNo tops, take em in all shape and size niggas\nNo lie, prefer them ready do or die killaz\nWhat? What you want? cutey starin at me like\n\"Damn, where you from?\"\nYou be comin at me like \"Can I get some?\"\nLick your lips for this brown sugar\nSuck mine like a thumb, if you want, til I uhhh...\n\n[Chorus: All (DMX)]\nThe Ruff Ryders! (What?) The Ruff Ryders!\nThe Ruff Ryders! (What?) The Ruff Ryders!\nThe Ruff Ryders! (What?) The Ruff Ryders!\nThe Ruff Ryders! (What?) The Ruff Ryders!\n\n[Verse Five: Drag-On]\nI be the D-R, A-G, dash O-N, slash often Comma\nBurnin niggas often, they call me Drag-On, I'm hot scorchin\nKeep the block roastin Light a dutch wit the flames comin, toastin\nIn my eyes you could see what summer's holdin\nRealizin, every guy I'll fry or dead rowdy\nI burn to a degree of 130, and my gun dirty\nCause it got one bury, so you better run, hurry Or catch one early\nYou wrong, tryin to touch me, what type of shit you on?\nYou better through your boots on and your unflammable suits on\nCause I'm comin through wit a Yukon Black tinted wit gats in it\nCatch you while you smokin, send your casket\nThrow the sack in it\nBut only half of it, cause y'all like half-ass dude\nAnd we are one whole, and y'all niggas is one slash two\nMy gun blast you, tryna out the flames, what're you, firemen?\nYou'll catch a hell of a Backdraft cause my fire retirin, aight then\n\n[Verse Six: DMX]\nIt's my, survival instinct that keeps my head above the water\nEveryday I show another how a lover slaughter\nFlood your daughter, full of more holes than spurges\nTaxin businessmen for stocks over lunches\nWit these, I shoot the breeze, and extort\nEnough keys from the Cuban, to build a fuckin fort\nCaught up in somethin that I can't control\nTryna get a hold of a bankroll, let's role\nCatch bodies like a cold, and I stay slick so face it\nMake me chase it, I take your life and erase it\nWasted, in the fuckin streets cause it ain't worth shit\nThe undertaker take your ass unbder the earth quick\nI Love money, but the scrambles hot\nSo i snatch up my man and the gamblin spot\nTwenty grand is got, when niggas shot, one nigga less\nWhat used to be his chest is now a mess under his fuckin vest", "image": "https://images.rapgenius.com/a4366ca22169cc286a183e693f3a6ee9.300x300x1.jpg"}], "artist": "DMX"}