{"songs": [{"title": "Gangster 101", "album": "Cabin Fever 3", "year": "2015-12-15", "lyrics": "[Produced by: Sonny Digital]\n\n[Intro: Wiz Khalifa]\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah\n\n[Hook: Wiz Khalifa]\nAnywhere that we go they know us\nI keep some KK in the plane rolled up\nShawty say that I'm a gangsta, so what?\nIf shawty say that I'm a gangsta, so what?\nI do my thing, 100k to show up\nKeep Bombay and lemonade in my cup\nIf shawty say that I'm a gangsta, so what?\n(Yeah, yeah, yeah)\nShawty say that I'm a gangsta, so what?\n(Yeah, yeah, yeah)\n\n[Verse 1: Wiz Khalifa]\nCalled some friends, told her call some friends\nPour some juice and Gin\nWe go in, we be going in\nWe don't know the end\nPour some Gin, she want some more Henn\nI'm late for level ten\nLove again, never love again, never love again\nNiggas talk, they don’t really mean it cause it's all for fame\nLook at me, look into my eyes, I been through some pain\nLost some change, then bounced back again\nGave some niggas game, y'all some lames, y'all some lames\nY'all some, y'all some lames\nI'm just counting up this money, rolling up a plane\nNiggas in my lane, so I'm focused on some other things\nWhen you a boss in the game you show hella patience\nNiggas going on your page, don't know where the bank is\nShe keep blowing up my phone, said she wanna play\nSpent one night at my crib, say she wanna stay\nI do what I want to, say what I wanna say\nI been hustlin', hustlin', I been hustlin'\n\n[Hook: Wiz Khalifa (King Los)]\nAnywhere that we go they know us\nI keep some KK in the plane rolled up\nShawty say that I'm a gangsta, so what?\nIf shawty say that I'm a gangsta, so what?\nI do my thing, 100k to show up\nKeep Bombay and lemonade in my cup\nIf shawty say that I'm a gangsta, so what?\nShawty say that I'm a gangsta, so what?\n(Yeah, yeah, I shouldn't have hit that KK)\n\n[Verse 2: King Los]\nOh, shit, hold up, hold up, bro I'm focused\nRoll up, blow and choke it\nWater don't approach us\nFucked the hoe with magic, call it hocus pocus\nLos the dopest spoken, flow and stroke the coldest\nStroked the hoe and told her, \"Woah, woah, woah catch it all\"\nLike Pokemon then poke the poke to free 'em\nHokey Pokey, put your left foot in\nI put the effort in, no don’t eff with them\nI chef with the same shit I'm left with\nCooking with the left, boy, I'm Stephen\nWicked with the right like I'm Leftwich\nSpit it to a dyke, get the leverage\nKick it for a night, that's the blessin'\nMight hit it twice if I'm guessin'\nShe'll probably bring her wife to the session\nBitch on wood like Spike at the Knick game\nNice with the dick game, slurp game, twerk game\nPipe in a chick frame, twenty-four seven\nMore money, more blessings\nI ain't got fifty cents for the bitch\nI don't ask her twenty-one questions\nMy nigga's flip yayo, I just put the bucks in the bank\nKeep it G with the niggas 'round the way though\nYou knit that together, you get that\nYou chit-chat too much, you're a bitch ass nigga\nA big ass bitch, that's a BBW\nI'm a eighties baby, that's BB's on BMW's\nYou PMS cause you BS, I serve niggas like UPS\nThe groupies sweat the coupe\nThe Gucci sweats, the retro sneaks\nThe groove too fresh, the proven best\nThe cool respect the cool\nSo who are you, the spectical\nThe new special dude, the next to rule\nThe extra ruse, I'm extra rude\nMy ex could prove that I had to make an extra move now...\n\n[Hook: Wiz Khalifa]\nAnywhere that we go they know us\nI keep some KK in the plane rolled up\nShawty say that I'm a gangsta, so what?\nIf shawty say that I'm a gangsta, so what?\nI do my thing, 100k to show up\nKeep Bombay and lemonade in my cup\nIf shawty say that I'm a gangsta, so what?\nShawty say that I'm a gangsta, so what?", "image": "https://images.genius.com/036a1fd3f9480df4542a8206719c891b.600x600x1.jpg"}], "artist": "Wiz Khalifa"}