{"songs": [{"title": "Fresh Pair of Panties On", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "It's time to slow it down, steadily grindin\nAnd this is, the big Doggy Dogg..\n\nAnd I ain't talkin about no Air Force Ones\nI just gotta know, before you let me get some\n\n[Hook]\nDo you have a fresh pair of panties on?\nI got to know, or you could show, me\nSilk cotton see-through lace your sexy thong\nI got to know, or you could show, me\n\n[Verse 1: Snoop Dogg]\nFreak-a-leek, peak peak\nLet a nigga sneak a few, peek-a-boo\nLet's see what we can do\nI'm bout freakin you, and sneakin you\nInto a quiet place\nSo I can look at it face to face\nLet me guess, you prefer to wear cotton\nI can tell, cause you like squattin\nYour last dude, he was so rotten\nAnd now your love is to be gotten\nYeah baby girl I can read your mind\nBut what I'm really tryin to do is read between your pantylines\nI know it seems oh so personal\nBut I'm just tryin to make you feel real comfortable\nI know, so, what will it be?\nAnd the type of underwear you wear I mean it's troublin me\nCan I get a glimpse, one for the pimps?\nI got one question, answer me this then\n\n[Hook]\n\n[Verse 2: Snoop Dogg]\nYou came by the church with a whole lot of body\nGot invited to our annual pajama party\nWorkin that lace, I think it was the French cut\nYeah bitch, you got a big ol' butt\nHidin it, should be dividin it\nIt's real tight now but I got a way to widen it\nAnd slide in it, real smooth like\nWith a little bit of Miles Davis to get you in the mood like\nZoom boom hit the poom-poom right\nJust to get your groove right\nI can make it happen, but it can't happen if you ain't good at it\nWhen you gon' let a nigga have a look at it?\nCallin all cars, yeah baby girl you a star\nBut it's on you if you wanna go real far\nNow let me get a glimpse, one for the pimps\nI, have one question, answer me this\n\n[Hook]", "image": "https://images.genius.com/22daab0632e506300bab596c589dcfb2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}