{"songs": [{"title": "Mr. Percy", "album": "Life", "year": null, "lyrics": "[Hook: KRS-One]\nHave mercy, Mr. Percy\n(4 million people out of work right now!)\nCan't find a cent to pay my rent\n(Half the youth population out of work right now!)\nGive me another day\n(Homelessness rising up on families!)\nSo I can try to find my way\n(Word up, homelessness!)\nAnd I work (several resumes on e-mail)\nAnd I work (CDs I'm selling my beats)\nAnd I work (part-time at the retail)\nAnd I work (I'm just about to be in the street)\nAnd I work (the cars that I'm driving around)\nAnd I work (will I ever be on my feet again?)\nOh, what we all gon' tell them?\nOh, we telling them this now\n\n[Verse 1: KRS-One]\nFrankly I don't see how\nYou can't see how you really homeless now\nWhen the emergency hits, who really holds you down?\nWith the state of the economy and the way that it is\nMany men are at the door with they wife and they kids\nSaying\n\n[Hook: KRS-One]\nHave mercy, Mr. Percy\n(4 million people out of work right now!)\nCan't find a cent to pay my rent\n(Half the youth population out of work right now!)\nGive me another day\n(Homelessness rising up on families!)\nSo I can try to find my way (Oh!)\nAnd I work (try to drive a taxi cab)\nAnd I work (enrolled in a technical school)\nAnd I work (my friends, my family for a loan)\nAnd I work (dollar cabs and carpools)\nAnd I work (just another day now)\nAnd I work (I'm getting paid now)\nOh, what we all gon' tell them?\nOh, we telling them this now\n\n[Verse 2: KRS-One]\nEverywhere across the nation\nMore people are joining the homeless population\nFrom the south to the north to the west to the east\nPeople can't pay their mortgage or their lease\nAnd last but not least, you better hear what I'm saying\nSo many men are at the door with they kids saying\n\n[Hook: KRS-One]\nHave mercy, Mr. Percy\nCan't find a cent to pay my rent\n(blow blow blow blow blow! Not getting mercy!)\nGive me another day\n(4 million people out of work right now! You gotta do something!)\nSo I can try to find my way ([?] watch this!)\n\n[Verse 3: KRS-One]\nWe on the brink of revolution, you let it get too hot\nSo many people tryin' to hang on and just can not\nThey must've forgot last night's news spot\nRead like a news murder plot starring who got shot\nAnd very uplifting, just who got knocked\nVery little giving, everybody's heart is locked\nAnd they call this a civilization\nWhere I can't even find work with proper employment qualifications\nHip-hop is the name of my nation\nWhere every day is Saturday and twelve months is vacation\nPeace love unity having fun\nYou can tell by now I'm not the average one\n\n[Verse 4: Triune]\nGet choked for the dough, get stabbed for the stash\nMy actions brash, I rap for grabbing the cash\nThey search for the blacklist faces\nSo no need checking your ethnicity on applications\nHigh class for the green\nHow the fuck I make thirty grand a year with Dukes holding a Master's degree?\nIt makes no sense so I make those cents\nUsing my mind and using a nine, break bread\nThe move not orderly until those political figures meet a nigga over Martin Normandy\n'Til then a nigga gon' count his stacks\nShoot craps and crack niggas for countless acts\nThis a war going on outside no man is safe from\nI'm Triuno, some call me a great one\nUntil Bush knee deep in my community\nI'm hustling for mine 'til I get an opportunity\n\n[Hook: KRS-One]\nHave mercy, Mr. Percy\nCan't find a cent to pay my rent\nGive me another day\nSo I can try to find my way", "image": "https://images.genius.com/12162bd5dc20dab4c0cbb67190522d80.500x493x1.jpg"}], "artist": "KRS-One"}