{"songs": [{"title": "Kanye vs. Paparazzi: “Mosquito Bully”", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2013-09-27", "lyrics": "Paparazzo: Hey, good morning, Kanye\n\nKanye: Shut the fuck up\n\nPaparazzo: Hey, Kanye, are you mad at Jim Kimmel? Got anything to say about Jim Kimmel, Kanye? Do you think he was too much with you?\n\nKanye: Yo, did you just..?\n\nPaparazzo: Are you mad at Jim Kimmel?\n\nPaparazzo: How’s it going, Kanye?\n\nKanye: Don’t say anything to me, man. Like, stop asking me questions. You out in front of my house at 4 AM, talking about, ‘How’s it going?” It’s not going good, y’all here trying to take money--to take make money off of it. That’s how it’s going. It’s 4 AM and you asking me how it’s going. You know I don’t want you to say nothing to me. You hear what I’m saying?\n\nRespect that\n\n[Kanye lunges for camera]\n\nPaparazzo: Relax, man\n\nKanye: What you mean, “relax?!”\n\nPaparazzo: We don’t want to fight. We’re in the street\n\nKanye: I'mma change all this\n\nPaparazzo: Come on, Kanye. You know we like you\n\nKanye: Shut the fuck up. It’s 4 AM, you blood sucking mosquito\n\nPaparazzo: You left the bag right there, Kanye\n\nKanye: You want me to be standing outside your house at 4 AM?\n\nPaparazzo: We just want you to know that we’re here to support you--\n\nKanye: Shut the fuck up! You doing that to get more money for TMZ, every question you ask me\n\nPaparazzo: No, we’re just here to support you--\n\nKanye: SHUT THE FUCK UP! You bully! You mosquito bully! Pick a profession with some type of respect to it\n\n[Kanye gets in his Lambo, slams door. Revs engine. Exeunt.]\n\nPaparazzo: Já era!\n\n-Não, vamos pra lá!\n\n-No teu carro?\n\n-Bora na tua moto\n\n-Não, vamo embora meu, tu vai perder o cara!\n\n-Vai, vai que eu to pegando o carro", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}