{"songs": [{"title": "You Don’t Want to Fuck With Me", "album": "Nigga Please", "year": "1999-09-14", "lyrics": "Yo, when I say you don't want to fuck with me\nI'm not talking to you girl (and woman)\nYo, cause y'all want to fuck... y'all want to fuck me\n\nVerse:\nI stay away from danger, danger stay away from me\nI counter react on y'all niggas and then I flee\nWhatever you say is a mirage\nAnd on top of that, huh, nigga fuck y'all\nI'm the law of the land, got girls Uncle Nuggah\nI gagagaga got girls on the command\nI got the government lost on Gilligan Island (Nigga Please!)\nBy December, CIA gettin' paid taxes back\nFrom the Candy Cane, Santa came, back in the big hurricane\nYou ain't shaggy anymore, DA, I ain't in your ballgame\nI became, ain't your doggy bag ho same\nYou gotta make Ol' Dirty a better man\nIn the world if you wanna live\nFuck y'all, God don't forgive\nI don't answer phones\nI'll never reveal the Wu-Tang secret, and if you don't believe\nI'll kill your shit\n\nChorus: 2x\nYou don't want\nYou don't want fuck with me (Cause my name is Ol' Dirty)\n\nVerse:\nPlease Nigga!\nYou couldn't jump jump jump\nYou couldn't punk, you couldn't funk funk funk the shit up\nMy name is Dirt Dog the 18\nMillimeter, shoot you up, bust you up (Fuck fuck, What?)\nI drop the ambulance on a nigga\nMac truck, runnin' over niggas\nI love bitches, when they front on they pussycat\nYou ain't gettin' over like a fat rat\nHate is the method, killin' all you savages\nYou won't be sendin' me messages\nI put your nigga on pause, I keep that shit on\nDestroy you through your whores\nCause you ain't never had clout\nYou niggas on a rap drought\nI never get tired, I ain't in your drama quote\nSuck my dick!\nYeah that horror flick!\nChorus: 6x\n(To the ugly girls, throw your hands in the fuckin' air!)\n(To the ugly bitches, wave 'em like you just don't care!)\nVerse:\nYo, I'm the cunt, breast, asshole eater\nAnd if you let me physically eat it, it only get (burps)\nYo, don't race, you'll lose!\nI'm stronger than booze!\nDon't eat the food!\nAAAAHH! If you really want to cum\nThe cocaine get your pussy numb\nYO! FUCK Y'ALL! EVERYBODY!\n\nChorus: 3x\nDon't ever look at my name as bad", "image": "https://images.genius.com/ab1797ebd0d89e0846bb01b1a14efb3e.220x220x1.jpg"}], "artist": "Ol’ Dirty Bastard"}