{"songs": [{"title": "The Whole World", "album": "Full Circle", "year": "2006-10-17", "lyrics": "[Xzibit]\nBig bad insane Strong Arm Steady gang\nWay beyond the days of rockin them stupid rapper chains\nComin through clear the lane, send a bullet through your brain\nNumber one with a bullet - faster than the bullet train\nPop it if you pull it mayne, hang with orangutans\nI live for my soldiers, ask them, they gon' say the same\nMy gauge rings your bells like the Hunchback of Notre Dame\nAin't even gotta say it, you motherfuckers know the name\nLegendary classic, niggas be punk pussy and plastic\nWastin the time and the minds of the masses (yeah!)\nBut look how strong we are, man I'm a motherfuckin star\nEvery week I cop a house and a car\nThe mini-mansion off in Vegas with the vanquish\nThat's where I mastermind my situations, determination and patience\nWe don't speak the same language (no) I got a translator\nSpittin 25 times, see your bitch ass later, C'MON!\n\n[Hook: Xzibit]\nThat nigga X to the Z, that boy is somethin to see, cause he a G\nI got the whole world waitin on me!\nI'm about that grind so motherfucker don't waste my time\nI got the whole world waitin on me!\nIf you ready to ride, c'mon, get in my ride and let's slide\nI got the whole world waitin on me!\n... Yeah! I got the whole world waitin on me!\n\n[Xzibit]\nNiggas screamin they the shit but that shit ain't real\nI don't need to be the shit cause shit roll downhill\nI'm escalatin aggressively, millions built up in equity\nCorporations invest in me, bangin shit 'til the death of me (YEAH!)\nCooked coke recipe, money come back so thick\nMy kid's kids couldn't spend this shit\nGet a grip, pop a clip, chop down that brick\nNo amount of fame gon' change this gangsta spit\nQuick to roll out the backwood (yeah) smoke out your buildin\nWe soldiers devoted dressed down like civilians\nNiggas wanna kill me because I make millions (that's weak!)\nThat's weak like gangstas that hide behind children (hahaha, yeah!)\nNovocain the game, no shame\nNo feelings, no names, no numbers, naw bitch\nYou can't hang with us (no!)\nAshes to ashes and you can't bust\nYou so popcorn and fake industrious, YEAH!\n\n[Hook]\n\n[Xzibit]\nYeah... yeah, whattup Key?\nI'm liftin plates you'll never find in the weight room\nSo stay tuned my platoon finna touch down soon\nCancun to St. Thomas, St. Thomas to the Bahamas\nMost niggas ain't really honest so I'm watchin my step\nI'm the hardest cold-hearted artist, the coast is clear\nDubai, Australia to Africa, this is the year!\nLet the alcohol you sippin saturate in yo' system\nI be swimmin through these women, man, fuck 'em and flip 'em\nI know you hopin I would fall to the side, or go to Way Side\nIt ain't a motherfucker alive to come and take mine (no!)\nDon't procrastinate, don't waste time\nNever faced time, Houdini with crime, traffic over state lines\nMilitary minded, stickin to the base lines\nIntellectually brighter than California sunshine\nYeah, I got my bars up, go pull my cars up (yeah)\nI love my struggle, never cover my scars up (c'mon)\nNigga\n\n[Hook]", "image": "https://images.genius.com/9bc78de515a998eed4e40863e21c20b6.1000x1000x1.jpg"}], "artist": "Xzibit"}