{"songs": [{"title": "Those Gurlz", "album": "Ego Trippin’", "year": "2008-03-07", "lyrics": "[Chorus]\n(Those girls, those girls)\nThose girls, they don't mean a thing to me\nI was just playin' the game\nIt was all a fantasy (Those girls)\n\n[Verse 1]\nI got a call from this ho the other day\nShe say she just moved down from The Bay\nTo L.A. - well that's great\nWe should sit down and talk face to face\nYou bring the barbeque, I got the paper plates\nI can't lie girl, I like the way you shake\nAnd when you dance the way you make your booty shake\nGive or take, I rate you 'bout an eight\nOr a nine - okay, fine, you a dime\nAnd them other bitches they gon' wait in line\nThey hatin' on you how you take away they shine\nRewind, pay attention to the signs\nI see money when I look you in the eyes\nNo lie, I love how you stay fly\nSo fly, send a text and I'll reply\nAnd when you need that good sex, I'm the guy\n\n[Chorus]\n(Those girls, those girls, those girls, those girls)\nThose girls, they don't mean a thing to me\nI was just playin' the game\nIt was all a fantasy (Those girls)\n\n[Verse 2]\nIt was Kim, Dalesa, Vanessa, Rene\nI don't love hoes or respect what they say\nHey... yeah that's life\nThe Pound comin' through, get the F out the way\nI know it's been a minute but your boy been away\nIt feels so good, take me back in the day\nI hit the studio, then back to the stage\nThe lights come on and the people start to wave\nThen I seen this girl, she looked me right in the face\nLike \"I know you remember me and my homegirl Tanay\"\nWe stay downtown in a loft on Santa Fe\nAnd we your number one biggest fans to this day\nWait... baby girl I'm the great\nBig Snoop Dogg, you got to bring me up to date\nI know a lot of girls rock shows in many states\nRoom 220, bring your friend and some drank\n\n[Chorus]\n(Those girls, those girls, those girls, those girls)\nThose girls, they don't mean a thing to me\nI was just playin' the game\nIt was all a fantasy (Those girls)\n\n[Verse 3]\nNow where you gonna find a nigga fresh like me bitch?\nSomebody pass the lighter so I can get this weed lit\nShe lookin' at my stones like \"Damn, is he rich?\"\nI'm lookin' at her pose like damn is she thick\nFuck them other dudes, I'm the man to be with\nFifty million sold, who's bigger than me bitch?\nNobody, let me put you on to some G shit\nHop in the Benz, I'll get you higher than ski lifts\nAnd then I'm 'bout to beat the cat up like Heathcliff\nYeah, cause all bitches need dick\nAnd if they say they don't they just lyin', they wanna sit\nShotgun in the 500 like she the shit\nUh-uh, hold on baby, we the shit\nClear blue skies, dip 'til you're seasick\nYou're with the one and only\nS, yes, N, double, O, P\n\n[Chorus]\n(Those girls, those girls, those girls, those girls)\nThose girls, they don't mean a thing to me\nI was just playin' the game\nIt was all a fantasy (Those girls)", "image": "https://images.genius.com/01cbba32edaa8dd413a34a1afe94d70e.498x500x1.jpg"}], "artist": "Snoop Dogg"}