{"songs": [{"title": "Stronger (Live From VH1 Storytellers)", "album": "VH1 Storytellers", "year": null, "lyrics": "[Intro/Monologue]\nWhen people come at me a certain type of way, uh, I forget them for\nThey base their opinions merely on what they were taught\nYou know, what they were given, what their parents taught them\nYou hear that? When you see this ain't, that- that's not nothing\nThey will never be anything and you know, I'm a pretty good dartboard 'cause I can take it\nI'm a easy target, 'cause I don't fit in\nI think through the gate, you know\nFrom The College Dropout when I was the only person with a polo in the midst of a whole bunch of jerseys\nThat I was the, the difference\nAnd I realized that I'm not just fighting a battle just for myself, but for a generation\nYou know, a generation fighting against the false information of the media\nAnd the perceptions that people create in the matrix that society creates in the lies that people tell, and the-\nAnd the laughs and the jokes that people tell all the way back in a high school lunch room\nAll the way to when you know, you're older, and anyone that decides to walk their own path as ostracize\nAnd um, you know, you have to be stronger in that situation and that's- that's one of my main goals that they don't kill me can only can only make me stronger\n\n[Verse 1]\nLet's get lost tonight\nYou could be my black Kate Moss tonight\nPlay secretary, I'm the boss tonight\nAnd you don't give a fuck what they all say, right?\nAwesome, the Christian in Christian Dior\nDamn, they don't make 'em like this anymore\nI ask, ‘cause I'm not sure\nDo anybody make real shit anymore?\nBow in the presence of greatness\n‘Cause right now thou hast forsaken us\nYou should be honored by my lateness\nThat I would even show up to this fake shit\nSo go ahead, go nuts, go apeshit\n'Specially in my Pastellé, on my Bape shit\nAct like you can't tell who made this\nNew Gospel, homie, take six\nAnd take this, haters!\n\n[Hook]\nN-now th-that that don't kill me\nCan only make me stronger\nI need you to hurry up now\n‘Cause I can't wait much longer\nI know I got to be right now\n‘Cause I can't get much wronger\nIs this what you've been waiting for?!\nWork it harder, make it better\nDo it faster, makes us stronger\nMore than ever, hour after hour\nWork–\n\n[Verse 2]\nI don't know if you got a man or not\nIf you made plans or not\nIf God put me in your plans or not\nI'm trippin', this drink got me saying a lot\nBut I know that God put you in front of me\nSo how the hell could you front on me?\nThere's a thousand you's, there's only one of me\nI'm trippin', I'm caught up in the moment, right?\n‘Cause it's Louis Vuitton Don night\nSo we gon' do everything that Kan like\nHeard they'd do anything for a Klondike\nWell, I'd do anything for a blonde dyke\nAnd she'll do anything for the limelight\nAnd we'll do anything when the time's right\nUh, baby, you're makin' it\nUh, baby, you're makin' it\n\n[Hook]\nN-now th-that that don't kill me\nCan only make me stronger\nI need you to hurry up now\n‘Cause I can't wait much longer\nI know I got to be right now\n‘Cause I can't get much wronger\nMan, I've been waiting all night now\nIs this what you've been waiting for?!\nWork it harder, make it better\nDo it faster, makes us stronger\n(I need you right now!)\nMore than ever, hour after hour\nWork–\n(I need you right now!)\n\n[Interlude]\nGo to the drums, go to the drums\n[?]\n\n[Outro]\nYou know how long I've been on ya\nSince Prince was on Apollonia\nSince O.J. had Isotoners\nDon't act like I never told ya\nYou know how long I've been on ya\nSince Prince was on Apollonia\nSince O.J. had Isotoners\nDon't act like I never told ya\nDon't act like I never told ya\nDon't act like I never told ya\nDon't act like I never told ya", "image": "https://images.genius.com/3c0aee76b72a24d6c01e44a72adb029c.1000x871x1.jpg"}], "artist": "Kanye West"}