{"songs": [{"title": "The Rain", "album": "28 Grams", "year": "2014-05-25", "lyrics": "[Intro]\nNigga like me smoke weed everyday\nNigga like me high all the time\nShut the fuck up man\nIt's Taylor's! Ugh\n\n[Verse 1]\nOne shot, one kill, what the deal?\nLearned this from my OG, shit is real\nMade niggas, paid niggas, all around\nOne phone call, brr, it's going down\nClique full of psychos, goon in some tight clothes\nNeed my paper straight, no typos\nRight flows, but really I don't write\nI'm in the studio all night\nMake sure the shit you call a dream is what I really call my life\nFrom my city, Harlem Nights, you niggas silly - this the 'burg\nNot Philly, shout them niggas though that wheelie on them bikes\nThese niggas fans, they just sittin'\nTalk about plans they ain't been in\nEven rock brands they don't fit in\nAin't got to go to France, spend 100 bands\nGotta understand, damn!\n\n[Hook]\nI can't stand fake niggas\nI can't stand fake niggas\nI can't stand fake niggas\n\n[Verse 2]\nWalk it how I talk it, if I roll it, I'mma spark it\nIf she bad, I tell her park it, I'mma hit it like a target\nOh shit! He blowing up your phone again\nMust ain't let him know, you ain't coming home again\nLeave that man alone, could be doing better\nDo it on your own, could be on a jet, flying 'round the globe\nBaby we gonna smoke a whole zone\nBurning kush till her eyes gone\nCellphone by the remote control\nWhen your girlfriends call, they just get the dial tone\nPaper wild long\nTry to draw the line between personal and business\nBut these niggas in their feelings like bitches\nMobbing through these trenches, always on a mission\nRules to the game, starve the competition\nKhalifa Kush keep me high, to where I don’t wanna speak\nBroke and jail - two things I don't wanna be\nYou talk tough, but your clique is nervous\nWash 'em up, get that quick detergent\nThen we done with 'em\nThere's gotta be somebody to blame\nIt's a shame, shame, shame\n\n[Outro]\nI can't stand fake niggas\nI can't stand fake niggas\nI can't stand fake niggas\nWhat? What?\nI can't stand fake niggas\nI can't stand fake niggas\nFake ass, niggas, shit\nDawg, damn, woah\n28 Grams, 28, and a bag in my hand\nGod, Damn!\nHo\nHahahahaha\nHol up, hol up, hol up\nMan when my hair get long you niggas in trouble\nJust warning you now", "image": "https://images.genius.com/e168a843af4516427b50fafd226984ee.990x990x1.jpg"}], "artist": "Wiz Khalifa"}