{"songs": [{"title": "Brown Skin Woman", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "{Kid Capri}\nAiyyo Kris, yo yo yo!\nThat was fresh, come with that next shit\n\nUhh! Fat fat fat fat beats! ..\nHow refreshing is it really?\nHow refreshing is it really?!\nHa ha ha ha ha ha! Whoo! ..\nBig shout out to Philly in the house\nG. Simone, you know you're not alone\nKRS-One on the micraphone\nNow we gonna come down ruffneck like this now seen?\nMad Lion hold tight\n\nChorus:\n\nBrown skin woman, you a queen, not a HOE\nAny man that drop the lyric what we give them the BO\nBrown skin woman you a queen and not a HOE\nAny man that drop the lyric what we give them the BO\n\nVerse One:\n\nWe don't come with disrespect, we come with intellect\nIf you come with disrespect you get a rope around your neck\nSome people don't expect me, to be so violent\nBut me NAH violent, just myself I protect\nToo many time I see, young gwal pickadee\nPay five ten twenty thirty dollar to see\nSome rapper some singer some .. celebrity\nTalk bout they wan fi sex up and fill up you body\nBut them NAH talk about peelin off some money\nFor the pumpin onna bed, when you haf the baby\nWhattaya think can happen next? After you're done havin sex?\nToo much of ignorance, not enough intellence\nMahn me NOT against sex, but too many DJ\nTalk sex but them not talk about the next day\nCause the next day them gone, and you sit alone\nGot em soup up your mic, pon de micraphone\n\nChorus (w/ minor variations)\n\nVerse Two:\n\nBrown skin gwal them can't diss yo\nCause you run the show-ow-ow!\nThem call you all type of bimbo\nBut you know you're not a ho-oe-oe!\nBwoy pickade, check out your history\nBrown man is a God in any ci-ty\nWhite, man knew dat, and dat was a shock\nSo dem whip up your bod', and dem whippin not stop\nBut dem NAH can't stop us wit de whip and de chain\nSo dem take away your history, erase your name\nSTILL, with no name, with no fight, with no fuss\nWe just, take on the name, that MASSA give us\nThat name is NI-GGA, the correct is NE-GRO\nIt's spa-nish for BLACK, white mahn call us DAT\nThere is also NE-GROID, also NE-GRO\nNow, all nigga pon the corner playin cee-lo\nMan you're not a ne-gro, cause you're skin is not black\nTake a look at yourself, you're brown and that's a fact\nYou not jump from no tree, you not live in no cave\nThat's some GARBAGE dem print, dem want you to behave!\nYou a African man, some say Asian\nYou must respect your love, all brown skin 'oman!\nIf you diss your 'oman, you not come wit no plan\nSo shut up your mowf, til you must understand!\n\nChorus (w/ minor variations)\n\nOutro:\n\nI know you want me to call you a nigga.. NO!\nI know you want me to call you a ho.. NO!\nI know you want me to call you a bitch.. NO!\nThis is how it go!\n\n{Kid Capri}\nYes Kris, you're large!\nAnother fat production by the KIIIIID Capri\nBig shouts to the engineer Naughty\nBig shouts to Luca, and we OUTTTTTTTTA here!\n\nPeeeeeeeeeeace!", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}