{"songs": [{"title": "Rob The Robbers", "album": "Pre-Release Therapy: The Truth Will Set You Free", "year": "2006-09-19", "lyrics": "[Hook]\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\n\n[I-20]\nAll black gloves, black mask, here we go again\nThe traps goin' slow, so I'm kickin' niggas doors again\nThem pussy niggas soft, so the dealers goin' hard for it\nI'm off in the truck, call up Buck, he got the hard for it\nI got scopes on the AR, make it easy to just pop at you\nThe first talkin' dope boy, then we hit to rob at you\nWon't hesitate to pull it out, empty out a clip\nHeard your partner got the cannons, so I'm tryin' to hit a lick\nI ain't got to contemplate it, see I'm down to demonstrate it\nI'm a DTP nigga, G-Unit affiliated\nGot a clique full of street niggas, ready for the shit\nAnd a crib full of thick hoes, down for the joint\nTell them pretty niggas, here we come\nLay it down, G it up\nExtra clips, extra round, pick a clown, hit 'em Buck\nHit 'em with that semi, or bust with that revolver\nHow the hell you robbers, gonna rob a robber?\n\n[Hook]\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\n\n[Young Buck]\nSnatch niggas out their Chevies in traffic, I'm a savage\nThe devil made me do it nigga, I gotta have it\nI'm hoppin' out this Escalade, chopper in my hand\nI catch the ones that I can, and start poppin' at they man\nThey say the hood wanna kill me, the police want me locked up\nSo I just take their jewelry, every time I pop up\nMy album went platinum, and yeah, the nigga still jackin'\nI ain't lyin' or actin', it's just that I love it with a passion\nYou should these niggas faces with the .40's on they shorties\nHave they ass breakin' up like this dope game ain't for me (oh)\nSo, come on pussy nigga, bring it if you that hard\nAnd watch when you come home, I'll be layin' in your backyard\nNiggas turn to trackstars, runnin' when we comin'\nSee, them beepers see me do it, but they don't know who done it\nAy 20, make sure you tell that nigga Luda, I'm a shoota'\nSo if he got a problem with them cowards, bring me through there\n\n[Hook]\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\n\n[Ludacris]\n.45 in the crevice of the 'Lac seat, hummin, comin' right at ya\nThese hollows will make you think you at a track meet\nBoys hit the back street\nI'm ridin shotgun, with a shotgun, pussy niggas hit the back seat\nChickens wanna act sweet 'cause of my candy-coated paint\nAnd size 24 shoes, I call 'em Shaq's feet, rollin' 20 Lacs deep\nWhoever want it, we done it at 2100 Jack-U street\nSo hide-ya hide-ya wallet-wallet, tuck-ya tuck-ya chain-chain\nI don't wanna, cock-it cock-it, chicka-chicka bang-bang\nAin't no way to try to stop it, or numb the pain-pain\nCause this ain't no muthafuckin video game-game\nBut I can empty the cartridge, while you bitchin' and fussin'\nGrab the sticks of extra clips and press the reset button\nPut you on the front page of you the latest edition\nTell the robbers I'm the greatest addition\nMotherfucker!\n\n[Hook]\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?\nHow the hell you robbers gonna rob a robber?", "image": "https://images.genius.com/e52e99bd3b0df0885e2062779b5d5814.600x596x1.jpg"}], "artist": "Ludacris"}