{"songs": [{"title": "Halacaust 3000", "album": "WAR VOL. 1: Exclusives, Unreleased & New Jointz", "year": null, "lyrics": "[Kurupt]\nYo Eastwood  (Yo what up Gotti?)\nNiggas act like bitches, wanna hear the truth?\nBefore I say another word, motherfuck Snoop\nDoggHouse eat a big Dogg Pound dick\nThis Gotti, you ain't gon' pimp slap shit\nI'm cool, calm, and I'm so collective\nAnd you niggas don't respect shit, nigga\nThey call you Soopafly, I call you Soopa-cape\nY'all niggas bring the gorillas I done ate\nThey call you Soopafly, I call you Soopa-bitch\nThat love to eat a Snooper-duper super dick\nPanties and a cape, little pink panties\nI drink Hennessy motherfucker\nAnd I'm somebody you don't wanna see motherfucker\nI'm lookin' in the streets and I see you niggas truant\nAnd I'm ridin' without Simon's influence motherfucker..\n\n[Eastwood]\nI roll these streets with my mind on G's, and I keep a Glock tucked\nLow-key on my body for niggas that's tryin' to kill me\nShit, I'm out the hood too\nFrom the Eastside to Compton to Inglewood too\nI'm Eastwood (Who?)\nOne of the realest livin', existin', lyricist lynchin'\nI'm competition brought to collision, I flow with percision\nDecision to end it, I spit with a vengeance\nSo pay attention homie, it's business\nCan't die without my tickets\nI'm ballin', boss hoggin', Snoop doggin'\nI'm stompin' out your braids with my Chuck's\nA outlaw with a thug ministry, chemistry, touched by my memory\nHennessy, from here to Italy got niggas feelin' me\nSun roof open, so I can feel the wind blow\nSmokin' dodie, blowin' out my H2 limo\nAin't never had a demo, I'm choppin' up albums\nLock me in a booth, I'm a beast, turn up the value\n\n[Young Ron]\nSmoke a blunt with Mr. Cooper, super trooper, pop - Snoop and Soopa\nI'm so fly, I roam the block and I'm ready to die\nNiggas told me what happened but they never really told me why\nThese streets is real, I've seen my O.G.'s cry\nBodies outlined with chalk, that's where a dope fiend died\nSoldiers who can't hold they own won't make it alive\nI got a lot of talent, so I ain't hard to find\nI'm on the grind, my squad ain't far behind\nWe mackin' dimes, in the club packin' nines\nSniffin' lines - that cocaine blow your mind\nFuckin' with mine, I'm bringin' mine\nBring yours nigga!..\n\n[Gail Gotti]\nEase the beast, Gotti supreme\nGail posted in the back of the 'Llac on lean\nKeep the heat stashed in the dash when we mash\nLike livin' fast it's secondary to cash\nGet your vest tested, your chest infected\nRoll with Tha Row now my flow's respected\nGotti up and left, never was rejected\nRide 'til I die 'til the game's respected, bitch\n\n[Kurupt]\nI ain't said shit, done shit, fuck 'em\nBustin', bust in bustin', dumpin', fuck 'em - gangsta\nWhat the fuck you really ever did? - nothin'\nWhat the fuck you really ever done?", "image": "https://images.genius.com/8d43afcbe036c9cb953800372c505747.355x353x1.jpg"}], "artist": "Kurupt"}