{"songs": [{"title": "The Express", "album": null, "year": null, "lyrics": "[Talib Kweli]\n\"There comes a time-\"\nHi-Tek, who we rockin wit?\n\"In every young mans life when-\"\nThat's right we rockin with the best\n\"He must go out into the world\"\nYa ya ya yo yo\n\n[Verse 1]\nI don't just spit, I hauck loogies on these emcee floozies\nY'all beggars can't afford to be choosy\nWanna bubble like jacuzzis, act bouigey, you watchin to many movies\nThese cats is fruity and got it mixed up like smoothies\nWho are we? Yours truly, fist in the air like Huey\nSmoke 'em one-by-one like Lucy's, then we skate like 'ooty\nJust because yur rhymes is booty don't mean you \"The shit\"\nYo my style is universal, I get around like orbit\nI got this all up in my veins, so fuck what you sayin\nYour stuck in the same frame of mind, ain't no duckin my rain\nWhen it's times for storms to brew, I'm _Warning_ you like Notorious\nBefore we bust, I won't be courteous\nEven if ya moms is in the audience, I'm still the goriest\nRoad warrior, whose story is more glorious than Euphoria\nAnd you got it all up in you, and ain't nobody stoppin you\nIf you don't believe us you could check out how we rock for you\n\n[Hook]\nCan't stop, don't stop\nRockin to the rhythem cuz I\nI get down and (Brooklyn)\nI get down and (to put it down)\nI get down and I (Like UNI)\nI get down (The uptown)\nGets down and sha-na-na\nCan't stop, don't stop\nRockin to the rhythem cuz I\nI get down and (Cincinnati)\nI get down and (Madtown)\nI get down and (Detroit)\nI get down and (Chicago)\nAh ah ah, sha-na-na\n\n[Verse 2]\nKweli, that's me, the king, the emcee\nRhyme, get mine on the T-O-P\nCan another emcee ever FUCK with me?\n(Hell no!) \"Y'all niggas Tickle Me like Elmo\"\nYo I got hip-hop on deadlock\nYou wanna pose like models, you catchin headshots\nMy roots extend to bedrock I stay grounded\nThe perfect balance, I found it\nAnd I got everybody feelin it\nMy aura shine like ice and ain't nobody stealin it\nAin't no need to say \"Run your jewels\" when I'm revealin it (True)\nAnd droppin it, on your stupid ass and not concealin it (Put it on 'em)\nCats want you in the dark, no switch that\nIn fact them cats want you in the pitch black\nWhere the light switch at? This shit's wack\nYou try to get some \"Get Back,\" that's how a bitch act\nSo sit back and observe these gentlemen\nWith that melanin, we see through the swine like gelatin\nSo never question my relevance, manifestin all elements\nTake hip-hop and develop it, by injectin intelligence\nWackness, you don't just smell of it, you reek in it\nWe stay feakin it, so the title we keepin it\nHi-Tek is the best kept secret since Diamond D\nKweli consider me the opitimy of emcee\nSo you know what that mean to me - eternally we stand out\nAnd make them other dudes look like scenery\n\n\"Won't stop\"\n\"Doin it..real\"\n\"Hip-Hop...\" [--Havoc (Mobb Deep)\n\n[Hook]\nCuz we can't stop, don't stop\nRockin to the rhythem cuz I\nI get down and (Zimbabwe)\nI get down and (Nigeria)\nI get down and (In Japan)\nI get down and (And Cuba gets down)\nSha-na-na (And Jamaica gets down)\n\n[Verse 3]\nIts the Reflection Eternal ('Ternal)\nTo universal for rehearsal\nNo commercials, still we make shit pop like kernals\nFrom Quinn Shore to Myrtle\nWhether you stay sober or more pissy than a urinal\nMy illness is terminal, it's disgustin\nThe way we be, shuttin down the function\nI make my name end any emcee discussion (Who?)\nOutta whose whips more fatter, who rock the most ice\nWhile my subject matter shatter your whole concept of nice\nYou can look throughout history books to see whose liver\nI'm prehistoric, got the Eye of the Sabertooth Tiger too\nRip into the flesh of the track\nCounterattack before you act with insight\nI see clear you blind as a bat\nDwellin in caves, tellin the slaves what'chu think they wanna hear\nI swear, my aunt told me the definition of fear is\n'Fuck everything and run,' that's what you did\nBut the party just begun and we rockin 'til we see the sun\n\nCan't stop\n\"Make a choice\"\nDon't stop\n\"Brooklyn, New York City\" [--Talib (BlackStar)\nWon't stop\n\"Chicago\"\nCuz I, I get down and (Everybody)\nI get down and..\nCan't stop\n\"Cincinnati!\"\nDon't stop\n\"L.A.\"\nYo we won't stop\n\"Southeast to west-\"\nCuz I, get down and\nGet down and\nGet down and\nCan't stop, don't stop\nRockin to the rhythem cuz I\nI get down and (Atlanta gets down)\nI get down and (L.A. get down)\nI get down and (Illadelph get down, and the Bay)\nIt's like sha-na-na\nCan't stop..\n\n_________________________________________________________________", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}