{"songs": [{"title": "Because the internet Screenplay - Part 2", "album": "because the internet Screenplay", "year": null, "lyrics": "RAP GENIUS NOTE: This is Part 2 of the script, read Part 1 if you have not already\nCUT TO:\n*******[PLAY SONG \"DIAL UP\" AT THIS POINT]*******\n\n[VISUAL]\n\nThe Boy lies, arms to his side, on his bed, looking at the ceiling\n\nSpiders slowly drop from single strands of web from all the posts on the bed. It looks pretty. All of them dropping simultaneously swaying together. They whisper:\n\n......where are you?\n................who is this?\n...don't slide\n\nIt's almost a song\n\n*******[PLAY SONG \"THE WORST GUYS\" AT THIS POINT]*******\n\nINT. MANSION - NIGHT\n\nMore people are at the house. People drinking and smoking. Shoes off. It's a Temple. Respect it\n\nThe back wall of the living room has been pushed into the wall, so there's a seamless transiting from living room to backyard patio\n\nPeople sit on the swings underneath space heaters\n\nEMILY is in the middle of the pool table. Swank plays pool around her. RUBEN is filming Marcus and Steve throwing things in the fire pit\n\nAJ is djing in the middle of the living room\n\nSome guy is running through the living room in just a towel. He is dripping water. He almost slips\n\nThe projector room (theatre) is playing Fight/Vine compilations. Two dudes are in there not watching. Just smoking\n\nThe Boy walks through the backyard. There's a dude and a girl making out on the bar outside. They're sitting on the bar\n\n       THE BOY: Don't sit on that\n\nThey look at him. He stares back. They get down. He walks away. They stare as he leaves. The Boy walks to the edge of the pool and looks at the ocean go into the sky\n\n       THIS KID IN A HAT (laughing/whisper): Hurry!\n\nThis kid in a hat and his friend are running out the front door with an iPad and a midi controller. The Boy walks inside. Marcus stops him. He's out of breath and looks wet\n\n       THE BOY: Some guys just stole some stuff\n\n       MARCUS: Please tell me you saw that Argentinan...Argentinian? Argentina-girl. I can't say it-\n\n       THE BOY: Stop inviting random niggas in here. If you don't know their names they can't come\n\n       MARCUS: I don't hear you right now. I just fucked in a steam shower and I feel CRAZY. It's like I came in a Prince video. I like, blacked out. Couldn't breath in there, mane. I- (wait) Fuck! Is she still in there? You think she's okay? (He thinks)\n\n       THE BOY: You're the Florida of my friends\n\nThe Boy walks away\n\nINT. FATHER'S ROOM - NIGHT\n\nThe Boy walks up to the door. Before he can open it, Sasha opens it from the inside. She's with another girl. It feels like they just did a drug or were stealing something themselves\n\nSasha sees The Boy. Startled. Then she smirks\n\n       SASHA: Come in! Quick!\n\n[VISUAL]\n\nShe pulls him in. The other girl flops on the bed\n\n       OTHER GIRL: UUUUUGGGGHHHHHHH. SOOOOO SOOOOOFFFFTTT\n\n       SASHA: Hurry, hurry, hurry. Scoot, scoot\n\nThe Boy lays against the wall. Sasha sits on the bed\n\nSilence. Then:\n\n       SASHA (CONT'D): Show us your dick\n\n       THE BOY: Wha?\n\n       SASHA: Do it. Show it\n\n       OTHER GIRL: Ew\n\nSilence\n\n       THE BOY: Ha\n\nSilence\n\n       THE BOY (CONT'D): Why?\n\n       SASHA: Cause it's probably gross and I wanna laugh at it\n\n       OTHER GIRL: I've never seen a black dick. Is it purple?\n\n       SASHA: Grape dick\n\n       OTHER GIRL (agreeing): Grape dick\n\nSasha gets up and starts to punch The Boy playfully. The other girl is laughing crazy\n\n       SASHA: Do it. Don't be weird!\n\n       OTHER GIRL: Let's be weird a little!\n\nThe punches slowly stop. Then Sasha starts kissing The Boy. You can't see below their waist, but stuff is going on. Then stuff stops\n\n       SASHA: What's wrong? This is weird?\n\n       THE BOY: No\n\n       SASHA: You don't want to? This is weird?\n\n       THE BOY: No. I want to\n\n       SASHA: Then...what's going on, chum?\n\n       THE BOY: Hold on\n\nThe Boy plays with his dick. Nothing. It's like gum\n\nSilence. Fidgeting. Sasha's got a [ASHAMED EMOJI] look on her face\n\n       THE BOY (CONT'D): Hold on\n\nHe walks into the bathroom and closes the door. Locked. Silence. Sasha sits on the floor\n\n       OTHER GIRL: What's up?\n\n*******[PLAY SONG \"SHADOWS\" AT THIS POINT]*******\n\nINT. BATHROOM - NIGHT\n\nThe Boy sits on the floor. Head in hands\n\nDamn, guy\n\nThe Boy's ex-girlfriend steps out of the linen closet\n\n[VISUAL]\n\n       VANESSA: What are you doing?\n\n       THE BOY (head in hands): Chillin\n\n       VANESSA: In the Bathroom?\n\n       THE BOY: Mmm-hmm\n\n       VANESSA: Well, I want to go out\n\n       THE BOY (\"no\"): Mmm-mmm\n\nVanessa playfully throws things from the counter at him (toothbrush, cup, floss, soap). He throws some of it back. She starts laughing. He pulls her to the ground with him\n\n       VANESSA: Why are you so moody?\n\n       THE BOY: I'm not. Let me enjoy this for a second\n\n       VANESSA: We can do this outside, [EDIT]\n\n       THE BOY: We could live the rest of our lives here. There's a TV in the mirror. There's fresh water every time we flush. I heard they're building a sandwich place in the shower\n\nVanessa smh and smiles\n\n       VANESSA: Get up. We're going\n\n       THE BOY: Come 'on-\n\n       VANESSA: I mean it!\n\nShe pulls him up. She opens up the linen closet and pulls The Boy in\n\nCoachella is inside the closet\n\nThere are people saying things, giving opinions, feeling interesting. Everyone has a purpose today. It's a great time\n\nThe Boy chases after Vanessa and catches her. He carries her for like three steps, then they walk together, holding hands\n\n       VANESSA (CONT'D): We have to see everything together. I don't wanna split up this time. We each get to choose one band the other one can't make you see- (then) What's wrong?\n\n       THE BOY (smh): ...\n\n       VANESSA (disappointed): Really?...You're really doing this to me? Right now?\n\n       THE BOY: You don't think this is a waste of our time?\n\n       VANESSA: No, I don't think me and you together is a waste of time. That's what you think. And I'm tired of trying to convince you otherwise. At least be a man and break up with me instead of telling me I don't like you\n\n       THE BOY: But you don't! You don't really like me. I just look good when you scroll past me with the rest of your \"I'm almost Vashtie\" bullshit\n\n[NO MOUTH EMOJI]\n\n       VANESSA (teary whisper): You're so mean\n\n       THE BOY: I'm trying to be honest\n\n       VANESSA: Mean doesn't mean honest! Honest can mean mean. But only if you mean it\n\n       THE BOY (so many \"means\"): Wait...the-\n\n       VANESSA: I'm trying so hard with you. But I'm not gonna carry us. I won't waste your time anymore\n\nShe starts walking away. Then she looks to the sky and shoots up like a rocket\nShe looks like a shooting star in the sky. Not a sound is heard while this happens. They never see each other again\n\nThen the coyotes come out\n\nThey're glowing blue. They're circling and they're talking about music\n\n       WOLF 1: What'd you think of 2 Chainz' set?\n\n       WOLF 2: It was really fun. His live shows have gotten way better. I saw him last spring in Chicago\n\n       WOLF WITH GLASSES: Have you heard that Roc Marciano album on vinyl? It's so good, man\n\n       MESSY, BUT COOL WOLF: You guys, this is my fiance, another wolf. He or she works in a small music or graphic design for niche clothing or this app I'm building\n\nThey rip The Boy to shreds while they talk. Blood everywhere. The Boy doesn't make a sound. Lets it happen\n\nINT. BATHROOM - NIGHT\n\nThe Boy realizes he is pacing in the shower. He's been in there for a minute, cause the water is cold\n\nHe opens the door. The girls are gone. The small clock on the desk says \"5:23 AM\". There's also a note written in lipstick on the mirror that says \"YOUR FUCKED\" (smh at the \"your\"). Probably Sasha. She's probably right\n\nCUT TO:\n\nINT. LIVING ROOM - NIGHT\n\nThe house isn't totalled, just dirty. Empty cups, bottles, cigarette butts, etc. The Boy sees Steve and Swank passed out on the couch\n\n       THE BOY: Let's go guys\n\n       STEVE (waking up): Where we going?\n\n       THE BOY: Oakland\n\n       SWANK: When's the flight leave?\n\n       THE BOY: We're driving\n\n       SWANK: Wha? (then) How'd we get poor?\n\nINT. FAM'S ROOM - NIGHT\n\nFam's sleeping. There's a naked girl sleeping with him. The Boy comes in\n\n       THE BOY: We're going\n\nThe Boy leaves. Fam opens his eyes\n\nCUT TO:\n\n*******[PLAY SONG \"TELEGRAPH AVE.\" AT THIS POINT]*******\n\nEXT. MANSION - NIGHT\n\nSwank, Steve, and Fam are asleep in the car. The Boy sits down in the driver's seat\n\n       He pulls out his phone and texts someone named NYALA:\n\nIm driving up now\n\n...(that moment you know exactly what they're typing and how they look doing it)\n       She writes back: DONT\n\nThe Boy looks at this. Then starts up the car and turns on the radio and speeds out of the driveway\n\nA moment passes...\n\nThen we see the girl that was in bed with Fam walk out in the Mansion doorway\n\n       THAT GIRL FAM KNOWS FROM THAT ONE PLACE: Fam?\n\nEXT. I-5 - NIGHT/EARLY MORNING\n\nEveryone's asleep in the car except The Boy who's driving (AJ is there too. They picked him up.). Lloyd's \"Oakland\" is playing on the radio. The Boy turns it up so he feels like he's in a video. He pushes his seat back so he can lean\n\n       SWANK: Ow, ow!\n\nHe slammed Swanks knees. Sorry\n\nThe Boy speeds through the empty highway. It's really pretty. I'm not sure what those factories are in the middle of nowhere with all the lights on them. They're probably horrible for the earth, but they look really magical at night. He passes one of those factories\n\nThere's a lot of rolling hills. Lotta farms. There's a slaughterhouse. Smells and looks grey and awful. All the cows look really sad. Maybe I'm just making them sad. Maybe they're fine\n\nLooking at the rows of crops criss-cross on farms as they pass\n\nThere's a billboard. It says: ROSCOE'S WETSUIT\n\nThe Boy stares at it. Just a white billboard with \"roscoe's wetsuit\" on it\n\nEXT. MIDDLE OF NOWHERE IN-N-OUT - DAY\n\nThe guys are sitting on their car, eating burgers at the far end of the parking lot\n\nAs The Boy bites into his double-double he thinks about the slaughterhouse. Then he looks at his burger. He laughs\n\nTwo women walk out. They look like they're in their late 30s. Swank spots em. One of the women is wearing a Northwestern hoodie\n\n       SWANK (re: hoodie): Long way from Chicago\n\n       WOMAN 1: Alumni\n\n       SWANK: There's no way. You can't be over twenty-three\n\nThe women just smirk and close their doors. They drive off\n\n       SWANK (CONT'D): See that? Johnny Appleseed of confidence, man. Just leaving little seeds with everyone\n\nA car crazily pulls up next to the In-N-Out. Two dudes jump out with masks and guns\n\n       FAM: Daaammmmnnn\n\nThey run inside. We see people running in their cars, and driving off. All of our guys stay seated on their car. Just eating\n\nA minute goes by. No gun shots. Just yelling\n\nThe two dudes run out. Just as they do, you can hear the police coming\n\n       ROBBERY DUDE 1: MOVE, RYAN!\n\n       AJ: This nigga's using his real name. Treated\n\n       STEVE: Could be a code name\n\n       AJ: That's definitely his real name. No one's robbery name is \"Ryan\". It's something like...\"Snake-Man\"\n\nThey all make a face\n\n       AJ (CONT'D): Fuck ya'll. I wouldn't rob a place with ya'll pussy ass anyway\n\nThe Police roll up. Ryan tries to get away, but they pin him. The other dude shoots at the cop\n\n       FAM: We should leave. They're shooting at the cops. Which means the other cops coming give a fuck 'bout bystanders now\n\n       MARCUS (in anchorman voice): Two men were arrested in an attempted robbery at an In-N-Out burger today. (mumbling) Also some niggers ended up dead, we don't know. This is news, people!\n\n       STEVE: After being frisked, the dead suspects somehow got guns and shot themselves in the head even though they were handcuffed and in the back of a tiny-ass squad car\n\n       THE BOY: Police chief states: \"no investigation needed\"\n\n       STEVE: \"White people still safe!\"\n\nThey laugh. As they start to drive off\n\nSuddenly two cop cars screech in front of them\n\n       COP 1: HANDS IN THE AIR!\n\n       STEVE: Fuck\n\nAll of the guys put their hands up\n\nCUT TO:\n\nEXT. OAKLAND STREET - DAY\n\nEveryone looks a little bummed. Silence. More silence\n\n       THE BOY: We're here\n\nThey pull over to a row of brownstones\n\n       MARCUS: Great. Why are we where is this?\n\nThe Boy gets out of the car and walks up to the door. As he's about to knock, the door opens. Nyla is standing there. Her face is a mix of anger and strange\n\nSympathy. Like she refused to cry like...an hour ago?\n\n       THE BOY: Hey-\n\n       NYLA: There's a point you reach when you're no longer able to feel like you did. Not about a person, not with a certain place, you just can't feel like you did because that muscle or whatever is just...dead. Or gone\n\n       THE BOY: Hi, Nyla\n\n       NYLA: When you're alone, you might be able to remember it. You might even hear a song that makes you question it. But you don't have it. It doesn't exist anymore. It's dead. Do you understand?\n\n       THE BOY: Yes. Absolutely. But Nyla-\n\n       NYLA: I AM AT THAT POINT, [EDIT]\n\nTears. She's not crying. She's just that mad\n\nA dude pokes his head out from the hallway in the brownstone. The Boy and him make eye contact\n\n       THE BOY: This isn't what you think it is. I didn't come here to...look, I saw this dude die and-\n\n       NYLA: And you're scared. So you came here\n\n       THE BOY: I'm not scared. I just wanna be with someone\nWho knows me for a little\n\n       NYLA: I don't know you. We're not together. I have company. Go home\n\n       THE BOY: Okay, you're being mean now\n\n       NYLA: \"Mean?\" Who cares? You're an adult. Also, you embarrassed me\n\n       THE BOY (to the dude in the hallway): We were planning on having a kid together. She offered and we had a whole plan. Like adults or something. Then I backed out. So... (then) You're second at best is what I'm saying\n\nThe guy goes -__- [SIDE EYE EMOJI]\n\n       NYLA: What is wrong with you?\n\n       THE BOY: I don't know\n\n       NYLA: Me neither\n\nThis is really sad for both of em. They really wanna know. Nyla closes the door\n\n       NYLA (CONT'D through the door): Please grow up\nThe Boy stands there...then Swank walks up to him on the stoop of the brownstone\n\n       SWANK: Can I use her bathroom? That double-double's makin moves\n\nThe Boy walks away and gets in the car. Swank stands there for a moment. Then tries to cut off a fart with his hand as he walks to the car\n\nCUT TO:\n\n*******[PLAY SONG \"SWEATPANTS\" AT THIS POINT]*******\nINT. OAKLAND CLUB - NIGHT\n\nThe guys sit at a table in the corner. The Boy is sitting in the corner. Fam is texting. Swank and Steve are talking to two girls. A promoter walks over\n\n       PROMOTER: Ey. You gonna just sit here\n\n       THE BOY: Yeah\n\n       PROMOTER: Well, you gotta order something\n\n       THE BOY: A bottle?\n\n       PROMOTER: Yeah. A bottle\n\nThey stare\n\n       THE BOY: I'll take 12 bottles\n\nPromoter gives him a [NO MOUTH EMOJI]. The Boy just stares at him...he's serious. The promoter walks off\n\nCUT TO:\n\nTwelve girls with bottles and sparklers emerge around the club from the back. It's a parade. They curve around the club making a big to do. People are staring, like \"is Diddy here? OMG Diddy's here!\"\n\nThe parade gets to the top of the stairs where the booth is. But when they turn the corner, the guys are gone already. There's a stack of cash sitting in the middle of the table\n\nThe promoter stands there\n\nINT. DINER - LATE NIGHT\n\n[VISUAL]\n\nThe guys are eating\n\n       SWANK: But animals eat animals, man. Animals!\n\n       STEVE: The argument is that we've been given the freewill and understanding of life. So we shouldn't because the option is there for us\n\n       SWANK: Man, in Nigeria they made me AND my little brother slaughter a goat. We raised that goat, man. I loved that fucking goat. And one day we came home from school and they just handed us the knife. I've seen the blood man. I've heard the screams. I still ate the shit though\n\n\n...I was here before\n\n\n       THE BOY: We were here before\n\n       FAM: What?\n\n       THE BOY: We've done this before\n\n       FAM: Nah man. This is our first time together in Oakland\n\n       THE BOY: This is every night. This is all the nights, man\n\n       FAM (weirded out): Nahhhh. We switch it up, man\n\nThe Boy stops listening. Across the way there's a group of kids eating in a booth\n\nThey're laughing and talking behind the back of a friend they don't seem to like very much. One of the girls is going in. But behind her, there's a guy in a colorful faux 90's hat. He's writing something on the wall in sharpie\n\nHe's writing \"roscoe's wetsuit\"\n\nThe Boy gets up and walks over\n\n       THE BOY: Excuse me. What does that mean?\n\n       HAT KID: What?\n\n       THE BOY: Roscoe's wetsuit\n\n       HAT KID: Oh. I don't know\n\n       THE BOY: Yes you do\n\n       HAT KID: Wha?\n\n       THE BOY: You know what it means. Tell me\n\n       HAT KID: I don't know. I saw it online\n\n       THE BOY: So you just write shit you see?\n\n       HAT KID: Fuck's your problem?\n\nFam walks up. Grabs The Boy\n\n       FAM: Ey. Let's just eat\n\nThe Boy and Fam sit\n\n       HAT KID: It means I sat on your mom's face\n\nThe Boy SLAMS his fist on the table. It's loud. Everyone in the diner looks at him. The Boy doesn't look up\n\n       THE BOY (quiet): Tell me what it is or I'll cut you open and take the answer\n\nSilence\n\nCUT TO:\n\nEXT. HOTEL - NIGHT\nThe guys roll up to the front of the hotel\n\n       SWANK: That kid was scared as fuck! He was like [OPEN MOUTH EMOJI]\n\n       FAM (to The Boy): You good?\n\nBoy doesn't say anything\n\nINT. HOTEL LOBBY - NIGHT\nThe guys walk in the lobby. There's an Indian wedding happening. They're probably not called Indian weddings. It's probably just a wedding, but all the people participating happen to be Indian. There's a bunch of guys talking and quietly laughing in the hall. The door to the banquet room is open as they pass. The Boy stops. The bride and groom are slow dancing. The Bride is quite pretty. Green eyes and dark skin. She's got the aura of a business woman. Probably met him at Stanford and was like \"this is reliable\". The groom looks like a caricature of a good ol' fashion white dude\n\n       STEVE: Good for him\n\n       SWANK: Nah. He don't get any interracial points. He's just doing what white guys been doing since forever. Exactly what he wants\n\n       AJ: Really? Like that?\n\n       SWANK: Man, I used to get so pissed when girls would watch Boy Meets World and be like \"Ryder Strong's so dope for having a black girlfriend\". Man, fuck that nigga\n\n       AJ: Come on, man. My dad's white and his parents didn't like my mom. They just started talking again\n\n       SWANK (over the top): Oh you're poor white dad! (then) Nigga, shut up. Take that team light skin shit outside\n\n       THE BOY: I've never seen one of these\n\n       FAM: A first dance?\n\n       THE BOY: A wedding\n\n       FAM: Yeah. (then) Marriage is so wack. I mean, I get it. But come on, yo. Forever? (\"Ms. Jackson\") Forever, ever? Forever, ever?\n\n       THE BOY: You think either of them don't wanna do it?\n\n       FAM: Mane, I bet both of em are like that\n\n       THE BOY: They look happy as fuck though\n\n       FAM: Cause they reached their goal. In a year they'll\nBe like \"oh fuck...goals are dumb.\"\n\n       MARCUS: Goals are dumb?\n\n       FAM: Making your life a goal is dumb. I think. This shit is supposed to be just fun. (then) I took an edible at the diner. It's kickin in. Hard. I'mma go upstairs\n\n       THE BOY: Okay\n\nThey both stand there for a moment\n\n       FAM: I'm gonna need some help\n\nAJ takes Fam by the arm\n\n       FAM (CONT'D): There we go\n\nThey head to the elevators\n\n       MARCUS: I'mma look for some bridesmaids\n\nHe walks off\n\n       STEVE (yelling to Marcus): Gee-van-chi!\n\n       MARCUS (calling back): Nigga, god bless you\n\n       STEVE (to The Boy): What you doin?\n\nThe Boy stares at the couple\n\n       THE BOY: I'mma stay down here\n\n       SWANK: You good?\n\n       THE BOY: I'm great\n\nThey Kanye shrug, then walk off to the bar. The Boy walks into the banquet\n\nINT. BANQUET HALL - NIGHT\n\nThe lights are low. Most of the people have gotten up to pee or something. The Boy just stares at the couple. Then he decides to start recording. A man comes up to him\n\n       OLDER INDIAN DUDE:Who are you here with?\n\n       THE BOY (not looking up from his phone): The groom. We went to college together\n\n       OLDER INDIAN DUDE: Oh. (then) Nice isn't it?\n\n       THE BOY (sincere): Beautiful\n\n       OLDER INDIAN DUDE: When the buddies start getting\nMarried, that means you're next\n\n       THE BOY: I don't think so\n\n       OLDER INDIAN DUDE: That's what everyone says. That's what I said thirty years ago\n\n       THE BOY: I don't believe in marriage. (then) Maybe that's not true. But I am against it\n\n       OLDER INDIAN DUDE: What do you believe in?\n\n       THE BOY: Cool baby mamas\n\n       OLDER INDIAN DUDE: Ahhhhh. But how many women you know are interested in your concept?\n\n       THE BOY: More than you'd think. I find if you have a job and are actually interested in raising a child, women, who are a little older, tend to be responsive. I just don't think they like being labeled that. (then) Do you get tired of it?\n\n       OLDER INDIAN DUDE: Of marriage?\n\n       THE BOY: Of marriage. Of her. Of yourself\n\nHe thinks\n\n       OLDER INDIAN DUDE: Yes. Sometimes\n\n       THE BOY: Then why?\n\n       OLDER INDIAN DUDE: I had to man-up. It was time. I\nDon't regret it\n\n       THE BOY: Well I don't have to man-up. I did what I'm supposed to do. I found the things I'm good at. I didn't get anyone pregnant on the way there. And I've had mature relationships that prepared me for what marriage is\n\n       OLDER INDIAN DUDE: Mature relationships?\n\n       THE BOY: Yeah. I keep in touch with all my exes. We're all friends\n\n       OLDER INDIAN DUDE: You still call them\n\n       THE BOY: I send em a happy birthday text or DM 'em\n\n       OLDER INDIAN DUDE: That's not a friend. I do that with my boss. And I hate my boss. (to himself) Fuckin Korean kid thinks he know everything\n\nSilence\n\n       OLDER INDIAN DUDE (CONT'D): What do you do?\n\n       THE BOY: I troll celebrities, politicians, or anyone with large enough online cache until I get a response. I post those responses and/or convos on my blog. And I charge gossip blogs and advertisers to advertise on my site and sometimes me and my friend put out novelty books of fucked up things we find online while digging up dirt on said celebrities and/ or politicians and sell it to niche book stores or larger stores that fit our aesthetic\n\nThe man just stares, not understanding\n\n       THE BOY (CONT'D): How old are you?\n\n       OLDER INDIAN DUDE: Fifty-three\n\n       THE BOY: I'm like Bill O'Reilly\n\n       OLDER INDIAN DUDE: Oh\n\nThe older man leaves. A shlubby man in a suit comes to the podium in front. People clap for the end of the dance\n\n       MAN IN SUIT: I've known Safia and Greg since college and I honestly knew this day would happen since we were getting high in my dorm room junior year at GW. (to mom) Sorry Mrs. Healey, Greg smokes weed. You gotta deal!\n\nEveryone laughs\n\n       MAN IN SUIT (CONT'D): But honestly, may you two spend the rest of your lives healthy and happy\n\n\"Awwww\"\n\n       MAN IN SUIT (CONT'D): And now, the traditional \"march to forever\" to bless the bride and groom with happiness for all their days to come\n\nEveryone claps\n\n*******[PLAY SONG \"3005\" AT THIS POINT]*******\n\n[VISUAL]\n\nLittle creatures slowly start to march out from the kitchen. Some have banners that say \"HAPPY MARRIAGE!\". Some have sparklers. They all bounce on beat. It's cute for a very short moment. Then it feels wrong\n\nAll the creatures have two legs, two arms, like humans.  But they are definitely not humans. One of the giveaways being that they are naked, but don't seem to have genitals\n\nAll the creatures are breathing heavy out their mouths (their noses being two tiny slits probably don't allow for heavy air traffic)\n\nThey're about three feet high. Their eyes are larger than they should be and are spread farther on their faces. They don't have hair anywhere on their bodies. They all have forced smiles on their faces. You can see their teeth are just a little too sharp when they smile. Insinuating carnivorous behavior. If they wanted to, at any point they could jump on you and rip out your throat in .8 seconds. But they're not right now. They're marching\nOne of the creatures has tears in its eyes. Still smiling tho. Pushing the smile\n\nEveryone is smiling as they march past, but they're all very cautious. Clearly worried that one may attack. The Boy watches as the creatures reach the front of the party and form a circle. They do this weird clapping, almost step team routine, then stop. The music stops\n\n       CREATURE 1: We did it!\n\n       CREATURE 2: Yay!\n\nEveryone claps. The bride and groom force a smile. The creatures slowly make their way back to the kitchen. All that's heard is their struggled breathing and clammy skin hitting the wooden dance floor. One stares at The Boy as he (or she) leaves\n\n...that was unacceptable. [LEMONGRAB: UNNACCEPTABLE!]\nRAP GENIUS NOTE: This is the end of Part 2, continue on at Part 3", "image": "https://images.genius.com/85529bbeef5d1dc890a832d5d3953daa.600x600x1.jpg"}], "artist": "Childish Gambino"}