{"songs": [{"title": "Burban In The Booth", "album": null, "year": "2014-05-10", "lyrics": "[Intro: Riz MC]\nCan you do me a favour bruv?\nCould you get the beat up in my headphones please?\nYep, get it up a bit more please, in my headphones\nYeah,  wicked, alright, listen, okay\n\n[Verse 1: Riz MC]\nListen up, listen Glov, kids and up, give us love\nSick cause ya, click a buzz, in the light, yeah bruv\nWhether in cinemas or in the club spittin' fast\nIn my element like -- in a skinhead bar\nRiz is not the type of spitter, to write a bit of shit about the bitches, ice and glitter\nI find it limiting, I'd rather print the bigger picture\nThem bars are boring like they only pouring pints of bitter\nYes, I'm an actor but I'm realer than most\nWon battles and had the best choke, put fear in they throats\nSongs banned cause the lines are so bold\nI drop science and flow, so the album's called Microscope\nAnd it's rougher than the road to Guantanamo\nSwitch like bricks on the latch that go from alcohol to powder nose\nSniff up her lips, on the prowl for coke, but the dealer was shifty, sold him a load of panadol\nRappers so fashion school, look like Timmy Mallet do\nMallet you, push your pineapple till you Agadoo\nBattle you, serve you red rub, why? (Ha!)\nCause you be layin' backwards as Malibu\nShit's ruthless like Trishner's abusers\nManners are ill -- banks are too rich\nTroops dig deep in the Middle East, bruisin' for crude, lootin' black gold for blue chips\nBut are you, as thin as a toothpick? Through two bricks and a few ticks, gets a few years\nWe werent blinded by knobs like the -- resign, but hoes a bonus when the dude quits\nI got views, make political music, money and gun rappers are sayin' what Fox News is\nGet money and buy shit, anybody who tries it should die\nWhy are rappers so right-wing?\nFood for thought, do you avoid diet?\nI'm on the Wu-Tang tour so chew on my four tyres\nPeople confuse me for Rooney, no lie\nThink I'm the star from 3, but I mean 4 lions\n\n[Verse 2: Childish Gambino]\nUh, girls text me after shows, I wanna call 'em all\nGot some goons to hold my money, must be ballin' hard\nHad a tour, I broke my foot, I had to brawl it off\n\"I ain't heard nothin' yet, man, Gambino must've fallen off.\"\nNah, never that, dawg, run it back\nBack to chillin' on Memorial and Harrison\nMama, no more Arizona Jeans, that shit's embarrasin', I got a Truffaut jacket and me and my brother sharin' it\nAnythin' they hand us, minivans and bandannas\nThat Wickes voucher stuntin', I think 'bout my cousin\nEvery time I spit an ill verse, like that time we talked about which Power Ranger that we'd kill first, that shit was so funny man, that shit was no money\nPyjamas and oatmeal, way you livin' is so real\nNeed a Nobel prize, for them coke deals, I thought co-tell, right?\nThem boys you been fuckin' with, now they busy beefin' cause they see you on some other shit? Not to mention the government\nI ain't trynna see you on the first 48\nWonder if God hears when an atheist prays\nI don't know what to say, man that better change quick\nWomen love to spit, love women who swallow you\nMakin' me, I won't woo when they mention your album\nI don't know what I should tell them: That we royalty? That they spoil me?\nPretty girls on the grass with some champagne, all I do is win and make Azealia's last name\nIs -- gonna go and make his own lane? Man, I hope so, shit is so cut throat\nBrought a knife to a gun show, brought a gun to a bear fight\nGrizzly bear screams in my hair when I say \"night.\"\nCause I don't wanna make moves that they all regret, I just wanna make something that they all respect\nGo on, let 'em know woo", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}