{"songs": [{"title": "Hustlin", "album": "Dedication 2", "year": "2006-05-22", "lyrics": "[Intro: Lil Wayne & DJ Drama]\nDramatic, nigga!\nHaha! Shoutout my nigga, Rick Ross!\nShout to Slip-N-Slide!\nKhaled! (My nigga, DJ Khaled!)\nYeah! Dedication 2! (That's right!)\nDrama! I... see ya!\nI'm so dedicated right now!\nFee, baby! (Gangsta Gri-zillz!)\nHot Spitta! Mack Maine!\nTwenty-four-seven!\nPo, baby! E-I-E-I-O!\nD2! (Gangsta Gri-zillz!)\n\n[Verse 1]\nYeah, now what they do?\nYou know it's Weezy F. the fuckin boss\nInside the Phantom bitch so big I probably get lost (Ill!)\nHow bout that exhaust, and my Funky Cold Medina\nI make that ho tip toe like a ballerina\nI'm the Miami fever, in that Miami Heat\nHop in that Miami water, I'm like a Florida Marlin\nBut I come from New Orleans, nigga, we still strong\nAnd my money real long, real real real long\nAnd this my thirteenth year, bitch, I'm still goin'\nSo my money real long, real, real, real long\nNigga that steel on, red beam safety off\nMurder scene, tape it off, red rum, tomato sauce\nNiggas say they paper boys, bitch, I be with caper boys\nI say we be burnin bodies, we dont be burnin cars\nAnd I got a bitch with me, call her \"Miss Without-Drawers\"\nAnd I'm at the bank, you could call me \"Mr. Withdrawals\"\n\n[Chorus: Rick Ross & Lil Wayne]\nEveryday I'm hustlin' (yeah), everyday I'm hustlin' (yeah)\nEveryday I'm hustlin', everyday I'm, everyday I'm\nEveryday I'm hustlin', hu-hustlin', hustlin', hustlin'\nWhip it real hard, whip it, whip it real hard\n\n[Verse 2]\nIf you want it I'mma bring it let Diana Ross sing it\nI'mma pull it I'mma bang it that's that Nina Ross singin'\nI be way in Opa-Locka with that Rick Ross bangin'\nIf you try me, I reverse ya, now you Kris Kross-swangin', yeah\nWhip soft top seats soft leather feet prop\nHeat cocked, somethin on my neck look like a peacock\nYou need not, talk that street hop to me Ak' cause we pop\nLike thousand dollar bottles of that Chris Rock\nBitch stop trippin' I been hot, when not\nI been threw away what they just got\nAnd niggas talk shit but when I see em they lips lock\nBitch bop, know I got that ooo wop griplock, get shot\nBitch I bet I'm hustlin' when ya nigga not\nBigger appetite, bigger pot; EAT!\n\n[Chorus: Rick Ross & Lil Wayne]\nEveryday I'm hustlin' (yeah!), everyday I'm hustlin' (Weezy!)\nWhip it real hard, whip it, whip it real hard\n\n[Verse 3]\nCall it what you want, but baby, just dont call the cops\nLet em chase that drop, I'mma chase that guap\nYeah, racetrack jacket wit the racetrack locs\nYeah all black Maserati taste that smoke (Gangsta!)\nI'mma crack that egg open, beat that yolk\nLet it soak let it soak watch it come back bulk, yeah\nThen I hit the streets up and talk that talk\nLet it float, let it float, never come back broke, naw\nRun that shit, I'm Cash Money's bread and butter, no sugar\nBring me all the beef, I'm the motherfuckin' pressure cooker\nYeah, yeah, I could change the weather for ya\nLose ya ass, the neighbors tell 'em that they never saw ya\nClose ya mouth, it be better for ya\nAll that snitchin like the cops got a medal for ya, ha!\nI'mma hustler, got work hoes and metal for ya\nWhen ya think ya ready, I'll be ready for ya, bitch!\n\n[Outro: DJ Drama & Lil Wayne]\nShoutout to the 305! (Yeah! Dedication 2!)\nWhip it real hard, whip it, whip it, real hard\nPhilly and Miami! They got the official!\nHuh? I thought I told them niggas\nShoutout to MixUnit!", "image": "https://images.genius.com/d3b5f479408c61bed346754e1bb3f8ad.1000x1000x1.png"}], "artist": "Lil Wayne"}