{"songs": [{"title": "U Don’t Wanna Battle", "album": null, "year": null, "lyrics": "[Intro]\nYou don't wanna battle (Battle, battle)\nWith me, whoa\nYou don't wanna battle (Battle)\n\n[Verse 1: 2Pac]\nYo I can rock it on a slow tip\nDon't flip, 'cause I can do this\nNo shit, won't trip, ain't nothin' to this\n2Pacalpyse, now jack you better brace\n'Cause I'm thumpin' it up and pumpin' it up with hellafied bass\nIf the comp rolls, throw blows until they back down\nThey sweat, no threat, suckers I smack down\nNo joke, I smoke any and all punks\nThey step, mic check and then they get done\nWhat's next? I flex and rock the dope TECs\nGet drunk, then run through crews like group sex\nGet sprung, it's fun, I love to hear the hoes homeboys\nMake noise from back to front rows\n'Cause yo, I flow and go continually\n2Pac, non-stop rippin' up scenery\nSo now, you know how I be rockin' shit\nWhen I flow, same ho with the 2Pacalypse\n\n[Chorus]\nYou don't wanna battle, down with me\nNobody\n\n[Verse 2: Ryan D]\nTime to crunch and munch, your pussy ass see I had a hunch\nYou couldn't punch, I eat you for lunch\nAnd go through, your sorry crew, I thought you knew?\nYou punk motherfuckers couldn't ever do\nThe things I, The R the Y—\nThe A the N Daz D did bitch, you couldn't ever fade me\nI'm not a sucker, I treat you like a serious trick\nYou little dummy, you need to stop talkin' shit\nYou got nerve, I give you credit, to think you hang\nBut brother we're not all in the same gang\nThe punks, the suckers, the phonies, the perpetrators like you\nWould never even fit in a crew\nWithout suckin' a dick, or maybe robbin' a bank\nYou see you don't got talent and your breathe straight stank ho Now step in line before I'm mad at you\nYou silly sucker ha, I thought you knew\n\n[Chorus]\nWho would wanna battle, down with me?\nNobo-dy\n\n[Verse 3: 2Pac]\nHit dropper, shit stopper with the strength to motivate\nGive me a break, and then it's time to illustrate\n2Pac will terminate, 'cause niggas like to perpetrate\nRhymes I create, yo you best believe they're worth the wait\nSo here I go, I'm about to throw a dope flow\nAnd let them know 2Pac will hit you with a death blow\nBut you say no because you wanna battle blow for blow\nI'm nothin' nice and my advise is just to let it go\nI would just battle you but somehow I don't think it's fair\nI'm not an amateur, I'll damage ya and leave you there\nAnyway nigga I'm the one they want to hear from\nFuck that pussy shit that you be boppin' in they eardrum\n'Cause in the 90's boy, 2Pac is comin' through\nI'm in effect, snappin' necks, I thought you knew\n\n[Chorus]\nWho would wanna battle, down with me?\nNobo-dy\n\n[Verse 4: Ryan D]\nYou wanna talk about a battle?\nWell I'ma talk about a massacre\nYou soft sucker, I'm tryin' not to laugh at ya\nYou and your posse, just stepped into the circle of death\nYou thought I wouldn't but the gauge, was in effect\nI'm not a killer but I'm not exactly pro-life\nKeep actin' stupid I'ma stab you with my girl's knife\nI'm not a coward, punk I'll walk into your livin' room\nChange the channel, and make you watch a cartoon\nAnd if you step, I hope you pack a serious nine\n'Cause if you don't, your sorry ass will be all mine\n'Cause I'm a warrior, I'll make a fire out of a stick\nLife in the jungle, but never comin' less than thick\nYou sorry maggot, you need to learn a lesson from me\nThe funky brother causin' trouble chief R Y D\n'Cause I'm no sucker, I'm laughin' at you and your crew\nYou'll never hang 2Pac, I thought you knew\n\n[Chorus]\nWho would wanna battle, down with me?\nNobo-dy\nWho would wanna battle, down with me?\nNobo-dy\nWho would wanna battle, down with me?\nNobo-dy", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}