{"songs": [{"title": "Wetter", "album": "Category F5", "year": "2009-02-24", "lyrics": "[Intro: Erika Shevon]\nI'm calling you daddy, daddy\nCan you be my daddy? Daddy\nI need a daddy, daddy\nWon't you be my daddy? Daddy\nCome and make it rain down onnnn meeeeeee\nCome and make it rain down onnnn meeeeeee\n\n[Twista]\nNow, now, now come and kick it with the Twista\nBlack Caddy, mack daddy with a ho up in the backseat\nWith a '97 +Pimp+ flow, got a feelin\nWhen you smokin when I flip it to a Trax beat\nTalkin about a beautiful figure, astonishing as Greek mythology\nBody be just like the girl in uhh, what's that movie?\nNever mind, let me enter yo' atmosphere\nAs you enter my world and let me touch that booty\nI can't believe that yo' momma that cold\nHer daughter got such an astonishing soul, you need a modelin role\nStill a playa know you got it when you climbin\nFrom the bottom to the top of the pole, cause you can pop in control\nYo' phatty's so accurate when I'm smackin it\nIt's makin me say \"What I gotta do to get with that?\"\nWhen it come to makin it rain I can get it wet\nWhen it come to cuttin that monkey I can get it wet\nYou want some media baby you need a better man\nHe cover politics, I'mma be yo' weatherman\nCause every time I'm lookin up and I see more ass\nI'mma constantly see rain in the forecast\nThis-a-way, that-a-way, I'm flickin 5000 Ones\nOr whatever you wanna call it\nIt's a celebration, you the champion, here's the fetti confetti\nC'mon and get drunk with the money hauler\n\n[Hook: Erika Shevon]\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\n\n[Twista]\nBut when I'm not for the feminine (feminine)\nAnd everybody that proceed with the hatred I'mma teach 'em a lesson\nI take shots of adrenaline (adrenaline)\nCause that's the way I receive immunization against the recession\nI got the muscle off of my hustle-and-flow money\nA entrepreneur with ways to get mo' money\nSo don't be trippin whenever you see me throw money\nHuh, it's just a lil' bit of show money\nBut if you want me to get it wet in other ways\nThen I'mma have to beat it up but first I'mma play wit'chu girl\nTouch your ears and your neck and play wit'cha pearls\nThen I reach up in your pants and play wit'cha pearl\nWhen I lay you down you ain't gotta be frontin and fakin on me baby\nCause I know it take the right touch\nI ain't stoppin 'til you wet up the covers\nBecause I gotta keep on fuckin 'til I see a lot of white stuff\nNow you got me excited, I can't hold it\nI'm feelin it comin, I'm 'bout to let off an explosion (ohh)\nLet it ride when I see you animated and shakin\nNow when I touch your body you catchin convulsions (uh-huh)\nThat's when I know I'm doin what I'm supposed to\nYou chose me, I chose you\nDon't think I can get it wet? I told you\nCome and let the Twist rain down on you\n\n[Hook: Erika Shevon]\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\nYou done been good, but you can do better\nI done been wet, but I can get it wetter\nCome and make it rain down onnnn meeeeeee\n\n[Outro: Erika Shevon]\nI'm calling you daddy, daddy\nCan you be my daddy? Daddy\nI need a daddy, daddy\nWon't you be my daddy? Daddy\nCome and make it rain down onnnn meeeeeee\nCome and make it rain down onnnn meeeeeee", "image": "https://images.genius.com/ab06dbf0ce99f56ef5472a2ab819fd5f.675x675x1.png"}], "artist": "Twista"}