{"songs": [{"title": "It’s Okay (One Blood)", "album": "Doctor’s Advocate", "year": "2006-07-24", "lyrics": "[Intro: The Game & Junior Reid]\nDre, I see dead people\nModern vampires of the city\nHunting blood\nBlood\nBlood\nYo, Dre\nThought I was dead\nWest Coast\n(One blood, one blood, one blood, one blood)\n\n[Verse 1: The Game]\nI'm the Doctor's Advocate, nigga, Dre shot ya\nBrought me back from the dead\nThat's why they call him the doctor\nThe 'Math gon' drop him\nAnd 50 ain't rocking with him no more\nIt's okay! I get it popping\nWhole club rocking, like a six-four Impala\nDrink Cris', throw it up, call the shit hydraulics\nThen piss in the cup, call the shit Hpnotiq (Brrrrat!)\nI bleed Compton, spit crack and shit chronic\nAnd you new niggas ain't shit but new niggas\nBathing Ape-shoe niggas, I'm talking to you, niggas\nBouncing in the '64, throwing up West side, man\nSell another 5 million albums? Yes, I am\nFresh like \"Damn, this nigga did it again\nA hundred thousand on his neck, L.A. above the brim\"\nInside the Lambo, the shotgun with Snoop\nWhat would the muthafuckin' West Coast be\nWithout one crip and...?\n\n[Hook: Junior Reid]\nOne blood\nOne blood\nOne blood\nOne blood\nBlood, blood, blood, blood-blood-blood\nBlood, blood, blood, blood-blood-blood\nBlood, blood, blood, blood-blood-blood\nOne blood, one blood, one blood, one blood\nOne blood\n\n[Verse 2: The Game]\nI'm from the Westside of the six-four Impala\nWhere niggas say \"Where you from?\"\nWe don't never say \"Harlem\"\nBandanna on the right side, gun on the left side\nNiggas in New York know how to throw up the Westside\nWord to Eazy, I'm so ill, believe me\nI made room for Jeezy\nBut the rest of you niggas better be glad you breathing\nAll I need is one reason\nI'm the king, and Dre said it: the West Coast need me\nI don't know why you niggas keep trying me\nEverybody know that I'm the heir to the Aftermath dynasty\nAnd I ain't gotta make shit for the club\nWhat DJ gon' turn down the thirty-eight snub?\nYou thirty-eight and you still rapping? Ughhh\nI'm 26, nigga, so is the dubs\nOn the '07 Hummer, hop out, no bodyguards\nWhen the chronic smoke clear all you gon' see is...\n\n[Hook]\nOne blood\nOne blood\nOne blood\nOne blood\nBlood, blood, blood, blood-blood-blood\nBlood, blood, blood, blood-blood-blood\nBlood, blood, blood, blood-blood-blood\nOne blood, one blood, one blood, one blood\nOne blood\n\n[Verse 3: The Game]\nI ain't got beef with 50, no beef with Jay\nWhat's beef when you getting head in the six-trey?\nAnd the double Game chain, I keep 'em on display\nBlack T-shirt, so all you see is the A\nTurn on the TV, and all you see is the A\nYou niggas better make up a dance and try to get radio play\nKeep on snapping your fingers, I ain't going away\nI don't regret what I spit, 'cause I know what I say\nAnd niggas talking about me, they don't know when to stop\nI got the Louis Vuitton belt buckle holding the Glock\nNo beam, no silencer; I know when to pop\nWait 'til Lil Jon come on and let off a shot\nI have the number one billboard spot\nNiggas stepped on my fingers, and I climb right back to the top\nI'm B.I.G., I'm Cube, I'm Nas, I'm Pac\nThis ain't shit but a warning 'til my album drop\n\n[Hook]\nOne blood\nOne blood\nOne blood\nOne blood\nBlood, blood, blood, blood-blood-blood\nBlood, blood, blood, blood-blood-blood\nBlood, blood, blood, blood-blood-blood\nOne blood, one blood, one blood, one blood", "image": "https://images.genius.com/88ebf4a862bbec3ef028d5b0cf1cd5aa.300x300x1.jpg"}], "artist": "The Game"}