{"songs": [{"title": "Walking Through the Darkness", "album": "Bulletproof Wallets", "year": "2001-11-13", "lyrics": "[Intro: Ghostface Killah]\nYeah you are now listening to the sounds of Ghost Radio\n777 FM, we in God dimension\nSponsored by Stark Enterprise\nShout out to everybody on Staten Island\nDon't touch that dial...\n\n[Verse 1: Ghostface Killah]\nA-yo, a-yo, my name's on your roster kid, I mean business\nBig elevators mean big businesses\nSleeves rolled up around five, I, loosen my tie\nRough day though the stock was high\nPlus I'm hungry, move like the boss of the joint\nI know it don't mean nothing 'causeI brought the joint\nBut still, realer hits, card dealerships\nBank slips, murder topics, niggas ain't shit\nSo what, I had a rough day?\nThat's right, and if y'all don't like it\nThen motherfuck y'all, it's Ghost in the house!\nMake noise if it's C.R.E.A.M. in the house!\nAww shit now, fly coffee tables, haircuts dust\nMoney this long, you wish you could roll with us\nSupersoak us, your bitch chose us\nBe sure to stay away from friends you can't trust\n\n[Chorus: Tekitha (Ghostface)]\nIt's been so long (yeah, uh-huh, uh-huh)\nSince he had a true friend (that's right, that's right)\nTrue friends are sure hard to come by (uh-huh)\nBut then again\nHis loyalties lie within\nAlways kept his head to the sky\nAnd they can't see... no n-n-no-no (Check it\nI want all y'all...remember this? Yo, c'mon, c'mon)\nThey can't see him walking through the darkness... no-n-n-no-no\n(Ooha-ooha! yo, Ooha-ooha! uh-huh\nYeah, Ooha-ooha! Ooha-ooha!)\nThey can't see him walking through the darkness\n\n[Verse 2: Ghostface Killah]\nYo, yo, yo, the new President America\nFlash money, act funny\nParty, ride the bubbly\nGoons and thugs, double Hennessy\nOne shot to the nose, double energy\nI don Wallabees, fucking remember me\nGuess who's back? The W embassy!\nEven in the dark we electricity, rap celebrities for the longevity\nStaten and Manhattan, that's all liberty\nB.E.T, MTV always big up me\nThat I rock coliseums, cop a drop BM\nDrunk throw his dick out on stage, I gotta see him\nThen he sung:\nHa! Let's get drunk! Ha!\nLet's get drunk and high yeah!\n\n[Break: Ghostface (Tekitha)]\nYeah, yeah, uh-huh, throw your hands in the air, throw your hands in the air\n(They can't see him walking through the darkness)\nLike this y'all, like that y'all... c'mon, yeah\n(c'mon, no-o-o they can't see him walking through the darkness)\nYeah... ma, c'mon boo... yeah that's right... motherfucka\n(No-o-o, they can't see him walking through the darkness)\nYeah... c'mon ma, rock that sick... that's right yo, look at ??? over there\nC'mon, c'mon we breakin' it down\n(Ooh no-o, they can't see him walking through, walking through)\nUh-huh, these are the best dancers in the house tonight\nLadies and gentlemen give them a round of applause\n(No, and the earth, they can't explain... on his road to become... become)\nUh-huh, that's how I like it, that's right, listening to the sounds of Ghost\nRadio...\nIt's like that y'all... Staten Island, New York\n(the chased and get hazed)\nNew York in the house, make some noise!\n(but ???)", "image": "https://images.genius.com/f4093661813b3ac25f7c044e4b1e305d.899x899x1.jpg"}], "artist": "Ghostface Killah"}