{"songs": [{"title": "Overdose On Life", "album": null, "year": "2008-04-30", "lyrics": "And I'm a leave on one more note\nOne more motherf*ckin note\nIt's like this... Look at him\nI ain't been here in a minute\nCut the lights off I feel fantastic right now baby...\nYeah... Look...\nI said I used to cut the porch lights on and now I cut the porches lights on just to let them know their foresights wrong\nWhere this rapper going with that obscure ice on he a lame I'm just tryna get my mature life on\nO D\nO. D. Everybody know me, even fans that resemble them kids in the O.C\nOh me Oh my them girls love me like Seth Cohen\nSo get a grip get a glass pour the X. O. in\nI did want one these niggas to say that I'm not the same\nPick a road cause where you drivin is not a lane\nAnd rest in peace to Pimp C life is not a game\nTaking over the world no pinky just a lotta Brain\nHe bout to send them the shit that I'm on (Yeah)\nYou prolly could have predicted I'm on (Yeah)\nMy sense of judgment is a officially gone\nUp into the air all the smoke from the swisha is blown\nAhh... I'm grown I'm grown I'm living in this elevator zone alone\nI'm up so high I'm never coming down and you say you got them hoes but they never coming round\nI got pent house walls I stay high above your ass\nAnd I can see it all, my balcony is glass\nAnd wifey's over (Bitches)\nBut moneys over (Her)\nCause money's under (Nothin)\nMy life is such a (Blur)\nThat's not the way it has to go it's jus what I prefer\nAnd do not disagree with me it's best you jus concur\nI'm a legend with a legacy that can't help but survive\nEven when I f*ckin die they gonna bury me Alive...\nAnd I'm so prestigious\nI brought my niggas from the hood to the beaches\nI'm living good gripping wood with all the features\nJesus my money straight no creases\nP P P Peep this\nWe got bottles over here\nKush is in the air... we good (O. D. O.D.)\nBithces over there... we good (O. D. O. D.)\nMoney on the floor we good\nO.D. O.D everybody know me\nOh no Travie high on life again... (Wow)\nFeel like I swallowed a whole bottle of Vicodin... (Dam)\nSo high I wanna cry like tiny violins\nIn my best mode the pesmote enjoy the silence... (Shh)\nStop the violence, how when every blind is like the motherf*ckin Watts riots pouring out my pen\nIight dam be easy I'm a get back\nGentleman with a superlative use of syntax\nAnd I done gave up the narcotics but I can't leave the crib without some xanax in my water... (Nope)\nHello my name is Travie and I'm a life-aholic\nTold'em all these beats is like the Wallis to my Gromit... (Ha)\nThe alpha to my Bruce wearing stripes on my candy cane\nWorn without the other so for real without the candy brain\nSuper trooper like a gun tote in candyman\nAsk me how I'm livin bet I tell ya fine and dandy man\nCheck his vital signs they peeping off the meter man\nI'm a live forever in Neverland with Peter Pan\nF*ck pulling the nine out\nI'm a pull a Amy Winehouse\nSipping Purple Rain with Mary Jane girls in my house... (My House)\nIsaiah I'm a see ya when I get there\nUntil then hold me down like gravity it's Travie... Uno... Easy\nAnd I'm so prestigious\nI brought my niggas from the hood to the beaches\nI'm living good gripping wood with all the features\nJesus my money straight no creases\nP P Peep this\nWe got bottles over here\nKush is in the air... we good (O. D. O.D.)\nBithces over there... we good (O. D. O. D.)\nMoney on the floor we good\nIt's Mickey\nO.D. O.D everybody know me\nHa I'm bout to overdose on life somebody please pass the weed\nSo if I comatose tonight you won't have to ask for refer\nIf the things that I seen through my Prada frames got me paid\nWatch me mane I'm cocky slave with this Rocky chain\nI got I got my fames cluttered with this bud\nAnd this name of it is Fame and it's all up in my blood\nTyna suppress the too fresh feeling I got... Oooo yes\nI'm in it for the huge yes duplex living like I'm Hugh Heff\nEvery other night I need a blue net for group sex\nLeaving with a bruise neck then I yell whose next... (Next)\nStand'em in a line this is new fax city take this crack between ya thighs... (Yeah)\n(Mickey what you mean) I'm promethazine f*ck the queen\nSniff the white horse of success and then let him lean... (Let'em see)\nTryna match my high on life... (Then let'em dream)\nGotta catch the spot on my flight\nFirst class known of the aroma of the smoker life\nGot me like a stoner, a zoner but nah it's never over... (Mickey what you mean)\nI stick my tongue out sippin Remy conceited of I'm teasing every bum out\nHung out with celebrities from every drug house\nSo when you remember me say that I was strung out... (Mickey what you mean)\nI'm a addict for the green cash I'm a O.D. so flip going to rehab\nAnd I'm so prestigious\nI brought my niggas from the hood to the beaches\nI'm living good gripping wood with all the features\nJesus my money straight no creases\nP P Peep this\nWe got bottles over here\nKush is in the air... we good (O. D. O.D.)\nBithces over there... we good (O. D. O. D.)\nMoney on the floor we good\nO.D. O.D everybody know me", "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg"}], "artist": "Drake"}