{"songs": [{"title": "Prelude to a Come Up", "album": "Cypress Hill IV", "year": "1998-10-06", "lyrics": "[MC Eiht]\nGeeyeah, Soul Assassins two times, stick em!\nGeeyeah, Cypress Hill three times, come on!\nGeeyeah..\n\nInfiltration be our daily operation for chasin\nCross the seven seas eased, clockin much conversation\nPenetration, you know we gets busy, no hesitation\nGreenery, hand-picked, from my own plantation\nFeels the heat, under the som-brero\nTo any amigo that's tryin to, stop the dineros\nChills with, senoritas, like charro\nGet drunk off tequila lay low til tomorrow\nFollow, my flow, get the cash and go\nCall my homey B-Rizzy in Mexico City\nLoose lips sink ships, faker faces got guilt\nDidn't mean to call you late, I need a hideout til..\nCool, homey, I'll bring some fuckin skunk\nThe homey smuggle me across lines in a trunk\nJust like a bird I'm free, in a land\nWith no fuckin extradition treaty, I'm out, geyeah\n\n\"Shit is real on the motherfuckin Hill God\" (2X)\n\"With the crew from off the Hill\"\n\n[B-Real]\nB-Really killin the Phillie now can you feel me from the\nSoul Assassin committee, the shitty niggas never thrill me\nYou silly bitches never respect, neglect money\nYou funny or broke, think it's a joke, your nose is runny\nGot my main man, Mr. Rocho kickin the vocals\nFrom the Eastside, where it's loco sellin the poco\nFrom the two G's, breakin the leaves of cheese, makin the bacon\nYou hear it sizzle got your hands ready for the takin\nEvading the pigs, raiding my crib, I'm mad lib\nAnd I wanna live and I'm givin the message droppin the lesson\nFlippin shit, and I'm keepin em guessin they all stressin\nHit the lullaby, no confession, we in session\n\n\"Shit is real on the motherfuckin Hill God\" (4X)\n\"With the crew from off the Hill\"\n\n[MC Eiht]\nWe's beez the three amigos, skates with nickel plates\nUnder the seat and we goes East Coast/West Coast, anybody killer!\nSoul Assassins gets the cash and smash *vroom*\nWho spits the Glocks like uno and dos?\nMakin your body dissapear like a ghost\nOne time's tryin to gaffle me, harassin me\nTryin to send me to the penetentiary\n\n[B-Real]\nIn the nighttime, niggas are creepin you fuckin sleepin\nAnd the beat, just keeps on seepin into the street\nWhile you peakin I'm meetin and greetin the people speakin\nAnd leadin the motherfuckers who's seekin to catch, ruckus\nMeaning you suckers no-luckers overdub us, nut hug us\nYou love us, you can't stop, these mad audio hustlers\n\n\"Shit is real on the motherfuckin Hill God\" (5X)", "image": "https://images.genius.com/4f0b9d852eece67bb00fcc4712c945bb.500x500x1.jpg"}], "artist": "Cypress Hill"}