{"songs": [{"title": "Don’t Trust ’Em", "album": "Gazing at the Moonlight", "year": "2009-10-27", "lyrics": "[Intro]\nHey yo, pass me a Kleenex before I lay this shit down\nI can’t believe this shit man\nI tried to be a lover boy, little bitch broke my heart\nWords of wisdom\n\n[Hook]\nDon’t trust ‘em\nDon’t you ever, ever trust a ho\nDon’t trust ‘em\nDon’t trust ‘em\nDon’t you ever, ever, ever, ever, trust a ho\n‘Cause ooh ooh ooh they be lyin’\nThey’ll slip right under your surface\nOoh ooh ooh they be lyin’\nWhat have I done to deserve this?\n\n[Verse 1]\nWhat happened to “be honest with me and I’ll be honest with you”\nYour whole past Mrs. Innocent I thought was the truth\nBitch had me felling ill on my knees barfing my food\nI’m no longer the same nigga now; I’m heartless and rude\nMy homies said never trust a ho, but I casually ignored it\nTill I got caught up in it, now I see the reason for it\nBut I had to be retarded, go and release my heart\nI always thought that I’d bring the drama, never knew she would spark it\nThat’s just the way to learn, I go the tables turned\nTo get to my cold state of mind I had to make it burn\nFor pussy, one night stands is my only source\nFuck that love shit little bitch, I’m feelin’ no remorse\nWhy should I? You had me acting like a fool\nTrapped inside your loop because you’re afraid to sacrifice the truth?\nCome on, how many niggas you really fuck with?\nHow many time you really suck dick?\nQuit lyin’ to me you dumb prick\n\n[Hook]\nDon’t trust ‘em\nDon’t you ever, ever trust a ho\nDon’t trust ‘em\nDon’t trust ‘em\nDon’t you ever, ever, ever, ever, trust a ho\n‘Cause ooh ooh ooh they be lyin’\nThey’ll slip right under your surface\nOoh ooh ooh they be lyin’\nWhat have I done to deserve this?\n\n[Verse 2]\nI’ll never find love, screw it, fuck it\nBeen through enough shit\nThere’s nothin’ you bitches can do to go renew your justice\nI’m too disgusted and I’m tired of being played with\nYou should have thought about all this prior to the occasion\nYou fucked around, thought for a while you was amazing\nTill I got the pieces and piled up the equation\nHad a nigga goin’ in and out your crotch\nNot knowin’ this little skank done been around the block\nA year later out the blue we having trust issues\nAfter I already fell in love with you\nCome to think of it the image does fit you\nYou fucked every nigga on the thug menu\nAnd I’m the dumb kid who\nThinks he found his soul mate, he’s blinded by the light\nTill it goes dim, now his hand is right beside a knife\nA violent type of life is what society offers\nMan, why even bother?\nJust remember\n\n[Hook]\nDon’t trust ‘em\nDon’t you ever, ever trust a ho\nDon’t trust ‘em\nDon’t trust ‘em\nDon’t you ever, ever, ever, ever, trust a ho\n‘Cause ooh ooh ooh they be lyin’\nThey’ll slip right under your surface\nOoh ooh ooh they be lyin’\nWhat have I done to deserve this?\n\n[Bridge]\nThey’ll hide their colors from ones they wanna love\nEven if you ask her, more than likely she ain’t gonna tell\nBeen through this too many times, so take it from me, ooh take it from me!\n\n[Verse 3]\nYo if you about to fall in love you need to think twice on it\n‘Cause girls are trifflin’, they’ll start lyin’ when they invite you in\nHave you feeling like the man; you think you found a keeper\nGirls have said they love you; but when she say it, the sound is sweeter\nYour love drowning deeper, now she’s acting like she smoking pounds of reefer\nConfessing that whole fuckin’ town done beefed her\nThen you like “I left this bitch with my heart, she ripped it apart\nI should have seen this from the start”\nThe shit you and her go and do it sounds nice\nBut the fact remains, you don’t turn a ho into a housewife\nThat’s what the fuck I did, and I regretted it, that’s why I’m negative\nNo medicine could get rid of this\nThe next bitch who lies to me, watch me damage her\nI’m pickin’ her up and body slamin’ her\nAnd that’s real, so if you think your girls a ho but you didn’t witness it\nAssume she’s a ho, till proven innocent\nAnd just remember\n\n[Hook]\nDon’t trust ‘em\nDon’t you ever, ever trust a ho\nDon’t trust ‘em\nDon’t trust ‘em\nDon’t you ever, ever, ever, ever, trust a ho\n‘Cause ooh ooh ooh they be lyin’\nThey’ll slip right under your surface\nOoh ooh ooh they be lyin’\nWhat have I done to deserve this?\n\n[Outro]\nFuck love, Don’t hate me\nHate these lying ass bitches for making me make you hate me", "image": "https://images.genius.com/fb33e7a89a5050dc08095e21c220cc15.1000x1000x1.jpg"}], "artist": "Hopsin"}