{"songs": [{"title": "Friend of Mine", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Intro: The Notorious B.I.G.]\nNo, fuck the bitches, fuck all the stank-ass hoes\nAll my niggas know\nJunior M.A.F.I.A. clique, Gucci Don, you know how we play\nFuckin' scandalous-ass bitches\nYou know how it go, Gooch\nI meet a bitch, fuck a bitch\nNext thing you know, you fuckin' a bitch\nYou just pass around shit, pass the shit like a cold and shit\nFuck 'em\n\n[Verse 1: The Notorious B.I.G. & Lil' Kim]\nNow when I'm fucking off gin I'm invincible\nDon't love no ho, that's my principle\n'Cause, uh, bitches come (And uh) bitches go (Uh)\nThat's why I get my nut and I be out the fucking door (You know)\nThey might be the one to set me up\nWant to get they little brother to wet me up\nThat's why I tote TECs and stuff, to get them off my case\nJust in case the little fucker ends up misplaced\nI don't give a bitch enough to catch the bus\nAnd when I see the semen I'm leaving\nBitches be scheming, I kid you not\nThat's why I keep my windows locked and my Glock cocked\nOne ho said, Big, why you so hard on us?\nWhy you swear all bitches are so scandalous?\nThug nigga 'til the end, tell a friend, bitch\n'Cause when I like you, then you go and fuck my friend, bitch\nAnd you know that ain't right\n\n[Chorus]\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine\n\n[Verse 2: The Notorious B.I.G. & Lil' Kim]\nYou see, I don't sweat these hoes\nI keep them in flavors like Timbos and Girbauds\nBitches just like to play the merry-go\nYeah we know, drop the scenario\nIt was me, Dee, the MPV\nThe blunts and brew thang, knocking some Wu-tang\nM-E-T-H-Oh shit, look at them lips and them hips on that bitch\nDee hit the dip, so I can drop my mackadocious shit\nLight the blunt clip and recognize a pimp\nNeedless to speak, the G's obsolete\nDon't sleep, banged the skins in a week\nOn the creep up the avenue\nI seen her on the block, who she rapping to?\nThat's my nigga Dee, damn he got G\nNow she fucking him and fucking me, see\nYou know that ain't right\n\n[Chorus]\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine, uh\n\n[Verse 3: The Notorious B.I.G.]\nNow I play her far like a moon play a star\nShe still sweat me hard 'cause I'm a rap star\nI be cruising up the block, I be passing her\nPimping hard with a female passenger\nAnd the only time I call her to hang\nIs when me and Dee blunted up, pissy, scheming on a gangbang\nShe should have used her intuition\nThen she wouldn't be classified in that position, listen\nShe's saying I dissed her 'cause I'm fucking her sister\nA message to the fellas, that really gets 'em pissed, uh\nBut she started that fucking family\nShe fucked my man Dee, so why she mad at me? (True)\nPlus your sister look better than you\nGive head better than you, pussy get wetter than you\nSo break the fuck out like a rash\nI'm glad I ain't spend no cash to hit your nasty ass\n\n[Chorus]\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine\nYou know that ain't right with a friend of mine", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}