{"songs": [{"title": "Who Do U Be?", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "You gonna dissect man (roll this shit)\nOh oh oh for the homies, who that?\nYeah, it's Kurupt fool\nLive, Dogg Pound\nAnd let all y'all know(know know), we live\nYeah Lurupt the raw dogg\nDogg Pound Gangsta for life\nAnd my own thing, Antra\nCheck this out, (check it out)\n\n[Kurupt]\nOne, two to the three\nK to the U- R- U- P to the T\nDips and toe back whips\nI ain't for competing\nI own banks in sweden\nI keeps a low profile, I don't floss\nTop dogg, fool I'm the boss\nSpeculative decisions, I'm giving out executive positions\nMaking my own executive decisions\nO.G. lie the only way is supposed to be lie\nSimply, its all in me\nSo when you think about Kurupt just think about Bentleys\n\n[Hook]\nWho do you be, tell me tell me\n(that's a nigga\nWho do you be, tell me tell me\n(steady cruisin' with your mind on the cash\nEverything is tight so what you think be the past)\n\n[Kurupt]\nFeel the flames, separate terrains\nWe on the same track on separate trains\nI'm all about coasting, locomotion\nSip get lit smooth\nMove in slow motion, smooth as lotion\nHeaded to where the g's reside, ready to ride\nI'm a fix it all, twist it all by showing all y'all what's the meaning of all\nI'm hyper like a sniper on dope and dynamite\nI ignite the stage, like rage, or sawed off gauge\nNow all y'all off the stage you be the first one, verse one\nNigga disperse one, and I'm a show you how you get the job done\nYou can't buy it, the sound encourages riots\n\n[Hook]\n\n[Kurupt]\nYo, I feel a whoo, bars with that whoop de whoop\nComing swoop, chill with Kurupt and the crew\nIn the back of the pad, but don't get mad, don't get upset\nIf I have to jab and jet, I gots to go put in, I get it all good in\nSo don't tweak come back next week\nBut when she came back she met a hard fact\nDude that ain't where Kurupt stay at\n\n[Hook to end]", "image": "https://images.genius.com/a7652517cf446c15e882aa0bc85229b3.594x594x1.jpg"}], "artist": "Kurupt"}