{"songs": [{"title": "Clear the Air", "album": null, "year": null, "lyrics": "[Intro: Busta Rhymes]\nAiyyo Dready!!! What you do this for man?\n\n[DJ Talking in the background] (Akon):\nBOOM BOOM BOOM BING!!!!! Original!) Testing one, two, three\nHey hold on, di dance nah done now yuh know! (I wanna clear the air)\nYuh dun know yuh know, mi nah tell yuh now!!! Mi nah tell yuh how di dance done now!!\n\n[Chorus: Akon] (Busta Rhymes)\nI wanna clear the air\nWith the medal that's known to divide the whole atmosphere (Yeah!)\nAnd I love to share\nThem bullets come a dime a dozen I kept two so I could have spare (So historic!)\nCause you never know, make no mistakes about it I let it goooooooo!!!!!!!!!\n(This beautiful moment in music!!!)\nAnd don't get too close, make no mistakes about it I let it goooooooo!!!!!!!!!\n(Y'all ain't ready! You are not ready!)\nAnd clear the air (Akon! Shabba! And Busta Bus!!!)\n\n[Verse 1: Busta Rhymes]\nMi come to willin to willin to willin to willin to willin to willin to point dem out!!!\nLet mi show you what I'm talkin 'bout\nMi come to mekin to mekin to mekin to mekin to mekin di whole a dem scream and shout!!!\nYou better believe it no doubt I'm sayin!\nNow you better call a doctor (Ha!) I'm about to give it to you proper\nStraight! Like a little bit of Vodka, It's Busta Rhymes and Shabba\nBetta know mi come through fi draw pure card\nWid big tune fi mash up farin way back dung a yard\nCaan tell mi nuttin one whole heap a dem a fraud\nOonu come through oonu betta call in national guard (BOOM!!!)\nDon't even ask I had to go dig in my stash\nAnd pull out somethin that will remind you of a Jammy's soundclash\nAnd when di ratchet pop yuh betta know fi hit di ground fast (NOW PASS!!!!!!!)\nAnd come out a di place because yuh sound trash\nCheck me! You don't want no problems bring any opponent\nBus and Shabba, Akon is such a historical moment (BO!!!!)\n\n[Chorus: Akon] (Shabba Ranks)\nI wanna clear the air\nWith the medal that's known to divide the whole atmosphere (Shabba!!! Him deh yah!!!)\nAnd I love to share\nThem bullets come a dime a dozen I kept two so I could have spare (Busta!!! Him deh yah!!!)\nCause you never know, make no mistakes about it I let it goooooooo!!!!!!!!!\n(Akon!!! Konvict!!! Cho!!!)\nAnd don't get too close, make no mistakes about it I let it goooooooo!!!!!!!!!\n(Explosive!!! Fully Loaded!!!)\nAnd clear the air\n\n[Verse 2: Shabba Ranks]\nSome a fi look, some a fi stare, some a fi jump, some a fi cheer\nFrom Halfway Tree right back to Madison Square\nBusta Rhymes back in here coolin wid di chandelier chair\nShabba Rankin step up! Yeah! Inna higher gear\nDem love di clothes dat I wear I swear\nShare it pon di song it a fi just souvenir\nIt's not di turtle it's not di hare, Busta kill and they will fear\nWid di heart of a lion slaughta bull like a deer\nMurda murda murda undertaker deh near\nDi forty four magnum buss it loud and clear\nWe chop it and we slap it inna di fold right here\nIf yuh diss yuh surely shall disappear, yuh hear\n\n[Chorus: Akon] (Busta Rhymes)\nI wanna clear the air\nWith the medal that's known to divide the whole atmosphere (Akon sing to 'em!!!!)\nAnd I love to share\nThem bullets come a dime a dozen I kept two so I could have spare\nCause you never know, make no mistakes about it I let it goooooooo!!!!!!!!!\n(How many times am I gonna have to beat y'all in the head!!!)\nAnd don't get too close, make no mistakes about it I let it goooooooo!!!!!!!!!\nAnd clear the air (Let's go)\n\n[Verse 3: Busta Rhymes]\nRemember this! And due to observation watch the domination\nBusta, Shabba and 'Kon phenomenal combination\nEvery gun fi let off!!! As soon as you hear the kid\nAnd tell dem bwoy to step off!!!! Just look at the shit we did\n(BLOCKA BLOCKA!!!!) Gun pop off again when we step upon di scene\nAnd leave a shit in di place, reach yuh magazine\nYou peep the way we comin were controllin everywhere\nWe launch the missile clearin the air, yeah\n\n[Chorus: Akon]\nI wanna clear the air, with the medal that's known to divide the whole atmosphere\nAnd I love to share, them bullets come a dime a dozen I kept two so I could have spare\nCause you never know, make no mistakes about it I let it goooooooo!!!!!!!!!\nAnd don't get too close, make no mistakes about it I let it goooooooo!!!!!!!!!\nI wanna clear the air, with the medal that's known to divide the whole atmosphere\nAnd I love to share, them bullets come a dime a dozen I kept two so I could have spare\nCause you never know, make no mistakes about it I let it goooooooo!!!!!!!!!\nAnd don't get too close, make no mistakes about it I let it goooooooo!!!!!!!!!\nAnd clear the air", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}