{"songs": [{"title": "Villuminati", "album": "Born Sinner (Deluxe Version)", "year": "2013-06-18", "lyrics": "[Intro: Choir & J. Cole]\nI'm a born sinner\nBut I die better than that, I swear\nIt's way darker this time\n*Laughs*\n\n[Chorus: J. Cole & The Notorious B.I.G.]\nSometimes I brag like Hov\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov, now I'm in the limelight 'cause I rhyme tight\nCole, time to get paid, blow up like the World Trade\n\n[Verse 1: J. Cole]\nSometimes I brag like Hov, sometimes I'm real like Pac\nSometimes I focus on the flow to show the skills I got\nSometimes I focus on the dough, look at these bills I got\nThis is a message for some rappers tryna steal my spot\nYou niggas famous on the internet, I'm real life hot, homie\nGet your weight up, fake niggas get sprayed up\nMy verbal AK slay faggots\nAnd I don't mean no disrespect whenever I say faggot, okay, faggot?\nUh, don't be so sensitive\nIf you want to get fucked in the ass that's between you and whoever else's dick it is\nPause, maybe that line was too far\nJust a little joke to show how homophobic you are\nAnd who can blame ya? Boy Meets World, I'm tryna find a new Topanga\nAnd bang her out, no hanging out\nMy pops was club hopping back when Rick James was out\nAnd all I get is Trinidad James, wait a minute, that's strange\nSip a bit of champagne, say fuck it\nIf the hoes like it I love it, nigga, nigga, nigga\nUsed to watch Rap City, Big Tigga, Tigga\nRap nerd, even copped Rah Diggah, Diggah\nPac had a nigga saying fuck Jigga, fuck Biggie\nI was only like 11 so forgive me\nA decade later I'd be all up in the city\nTryna get Hov to fuck with me\nWith a burned CD full of jams that was up in my hand\nWhen he said he didn't want it it was fuck him again\nOne day, he gon' regret playing me\nLittle did I know in a year he'd be fucking paying me, what could you say to me? I\nBeat the odds like Vegas, I used to rap about haters\nBefore niggas was hating me, now they hate to see\nA young black man with a college degree\nFucking all these little models for free, pardon me\n\n[Chorus: J. Cole & The Notorious B.I.G.]\nSometimes I brag like Hov\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov\nGot the game back, and I ain’t ever letting go\n\n[Verse 2: J. Cole]\nI'm the prince of the city, I studied Machiavelli\nYou niggas couldn't blow with C4 strapped to your belly\nI snuck up out the parts where niggas be living heartless\nAnd cannot tell the difference between Iraqi, Israeli\nAnd so I'm wondering really what could you actually tell me\nI'm tryna keep my homie from throwing crack in the skully\nSo, back with this pen to give back for my sins\nTook a black president to tell the Japanese sorry\nBut who the fuck gon' tell my niggas sorry\nNever seen his pops 'cause he's sorry\nFucked up education, would ask for reparations\nBut I’m probably just gon' go and buy Ferraris, vroom\nPlease forgive him\nAccording to the preacher man he needs Jesus in him\nBut the Devil run the T.V. so the demons in 'em\nI'm in trouble\nDid a deal with the Devil, now I'm pleading with him\nLike give me my soul\n\n[Bridge: J. Cole]\nMy nigga, I ain't ever letting you go again\nI ain't ever letting go\nI ain't ever letting you go again\nPlease give me my soul\nI ain't ever letting go\nI ain't ever letting you go again\nPlease give me my soul\nI ain't ever letting go\nBut the Devil don't play fair\n\n[Refrain: J. Cole]\nI'm 'bout to go and join the Illuminati\nFuck everybody\nI'm 'bout to go and join the Illuminati\nFuck everybody\nI'm 'bout to go and join the Illuminati\nFuck everybody\nI'm 'bout to go and join the Illuminati\n\n[Verse 3: J. Cole]\nThese next three bars is dedicated to the retards\nKeep on asking me about the Illuminati;\nIs you stupid, nigga? Young black millionaire\nOld white billionaires, I'm sure that they can do without me\nAnd I ain't really into sacrificing human bodies\nCouple more A's I would've been a summa cuma laude\nBeyoncé told me that she want to cop the blue Bugatti\nThat shit is more than what I'm worth, I think she knew it probably\nWell this is awkward, awkward\nWant to know what else is really awkward, awkward\nWhen niggas buy rings for bitches I had flings with\nI'm praying I don't see 'em at the Oscars, Oscars\n\n[Interlude: J. Cole]\nHey J. Cole, this way, hey\nOh, hey, what's up? What's goin' on with you? Okay\nBig smile, man, big smile, let me see that crooked smile\nJ. Cole, J. Cole, this way, look this way\nOh friend hug, friend hug, just keep it friendly\nWe friends, friends\n\n[Verse 4: J. Cole]\nRe-adjustin' my target audience, 'cause it's obvious\nI've gone astray, losing my way like Timberlake\nProduced by Timbaland on that goddamn FutureSex/LoveSounds\nWhat's playing in my mind, just the sound of my whole career\nCrash and burning, the thing that I mostly fear\nWas on track for the first two years until I let the Devil steer\nNow what have we here? Mask my tears, but I\n\n[Bridge: J. Cole, Yolanda DeBerry & Tanikka Myers]\nI ain't ever letting go\nI ain't ever letting you go again\nI ain't ever letting go\nI ain't ever letting you go again\nI ain't ever letting go\nI ain't ever letting you go again\nI ain't ever letting go\nI ain't ever letting you go again\n\n[Outro: J. Cole & The Notorious B.I.G.]\nAllow me to re-introduce myself, my name is Cole\nMy nigga\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov\nAllow me to re-introduce myself, my name is Cole\nMy nigga\nBorn sinner, the opposite of a winner\nSometimes I brag like Hov\nBorn sinner", "image": "https://images.genius.com/fbfa7c8b3518f456c489c0bc1cf3ffd5.1000x1000x1.jpg"}], "artist": "J. Cole"}