{"songs": [{"title": "Last Call", "album": "The Warm Up", "year": "2009-06-15", "lyrics": "[Intro]\nLa-la-la-laaaa, la lala la lalaaaa\n\n[Chorus]\nNow I am (Here's to the Roc')\nHey and they ask and they ask and they ask and I tell them\n(Here's to Roc-a-Fella) It's the Fayettenam\nRaise your glasses, your glasses, your glasses to the sky and\n(Here's to the Roc')\nThis is the last call for alcohol\nThis is the warm-up\n\n[Verse 1]\nNow to the few niggas out there who heard my last shit\nWhich if I must say so myself that was a classic\nI never been the type to ride my own coat tail\nBut it's obvious I'm here to stay, a fucking hotel\nI came up, I warmed up\nThe next up, I blow up!\nIf you ain't peep the trend by now with each rap I go up\nLook all he wanted was a deal so when he got it he just faded\nBut tell me what's a deal when you want to be the greatest?\nSo Jay I appreciate it, hell of a stepping stone\nWonder if he see it in my eyes I'm trying to get the throne\nWonder if the people know how many nights I spent alone\nMaking beats writing rhymes, thinking deep fighting time\nI'm getting better but wasn't getting younger\nAnd all that time can make the most confident nigga wonder\nBut never doubt it or allowed that shit to phase me yo\nJust switch my thoughts up like the stations on the radio nigga now I am\n\n[Chorus]\nAnd they ask and they ask and they ask and I tell them\nIt's the Fayettenam\nPut your glasses and your glasses and your glasses to the sky\nThis is the last call for alcohol\nThis is the warm-up!\nSo get your back up off the wall\n\n[Verse 2]\nNow may I never slip up or let my grip up\nI know my girl be praying Lord just keep his pants zipped up -\nNow if some groupie bitch is on his dick then make it's stiff up, at least give the nigga common sense to wrap his dick up\nToast, let’s lift up our glasses, then sip up\nWe fly past they look up\nThey don't last they give up\nThey don't blast we clip up then empty\nAnd indeed we hit the target yes these niggas think they the shit and they ain't even farted yet\nStyle incomplete like a garbage ass quarterback\nMy offense is for real, ay fuck sack, niggas getting coffined in the Ville\nWay too often and it feels wrong\nNew York niggas fuck with me, I got 'em singing Ville songs\nGuess it's only right because we grew up singing they shit\nBig shit, Mase shit, Nas shit, Jay shit\nTime for a Carolina nigga to take his place with the greats\nA slim nigga making bold statement\nUh, ay J. Cole how you do that there? I hear you blowing up my nigga\nI'm like, true that yea\nIn NY but smile every time I flew back there\nThat Carolina, Fayettenam oh yea my crew back there\nI go home been so long they saying, you back here? -\nTook a turn for the worst boy don't move back here\nDon't do that, yo who dat?\nHe rep the Ville when he spit it told you he be back with a record deal and he did it\nNigga, fuck spinning on my pivot homie, I'm finna travel till 'refs blow the whistle on me\nI got a whole fucking city that's just sitting on me\nBut it fits on my back, my state is sitting on that\nWill I drop? I think not I get up while they stop-like a sleeve on tank tops\nThey ain't give it all they got so they flop\nSo hey watch, how I'm finna take their spot\nNow I'm starting and they not-let me show you how to stay hot\nI play not, man I'm killing em even your idols feeling em dog\nThe same nigga used to chill in the mall\nWhile they were still in the mall, I was up there spilling my rap\nThe hero fighting villains just to put the Ville on the map\n\n[Chorus]\nAnd they ask and they ask and they ask and I tell them\nIt's the Fayettenam\nPut your glasses and your glasses and your glasses to the sky\nThis is the last call for alcohol\nThis is the warm-up!\nSo get your back up off the wall\n\n[Outro]\nYeah man so shit, this was The Warm Up\nUm, what can I say, what can I say?\nIf you heard The Come Up that was about just a lil nigga from North Carolina man\nFayettnam to be exact\nMoved to NYC, chasing the dream\nI used college, if y'all niggas don't know, I used college as a tool to get to New York\nI ain't have no family up here or nothing like that, I came up here on a scholarship, nigga went to college\nAnd the whole time I ain't even think I would have to finish college, I just thought I'd be signed by my freshman year so I wouldn't have to finish college\nBut it didn't happen like that obviously, a nigga graduated and things started falling into place\nI got more focused, I dropped The Come Up\nAnd I look at The Come Up like, how kinda like how I was in high school\nJust picture this, The Warm Up is about a nigga who did not make the team when he tried out and I know it's a lotta niggas who know that feeling man\nYou try out, you think you deserve to be one the team and you go that day to look at the cut-list\nYou wake up and you can't even sleep, you're like, \"Damn I'm gon' make the team, I did my thing at tryouts.\"\nYou go to the list. All the niggas is looking at their names on the list, some niggas is like, \"Aww shit I see my name nigga I'm good, I'm good nigga I'm good, I see my name.\"\nAnd you're looking for your name, and you kinda play in the back, tryna wait for niggas to clear out cause you're not sure\nAnd you go to the list and your name ain't there\nAnd you're like, \"How the fuck did I not make this team? I'm better than him, I'm better than him, I'm better than him.\"\nSo a lotta niggas either quit or some niggas go harder and so that's kinda how I took the rap shit when I put out The Come Up\nCause ever since I was 15 I thought I was supposed to be signed\nBut you know, shit, everything happens for a reason\nSo shit fast forward to The Warm Up, this just me, like you know, me being that nigga that's practicing and making sure it's no way, it's undeniable that when I go to tryouts, there's no fucking way the coach is passing up on me, my nigga\nSo that's what this whole mixtape was about and lo and behold, you know\nAs I'm finishing the mixtape, the deal comes\nThank God, I'm blessed. Everything happens for a reason. And it couldn't have been with a more fucking, with a better fucking squad\nYou know the niggas I got on the squad if you listen to this then you might have heard who I signed with, I ain't even gon' blast it off like that\nShoutouts to, you know, Mark Pitts, definitely\nShoutout to my nigga Mike Rooney, my nigga E, shoutout to my whole fucking crew, man\nThat's The Warm Up is about man\nRG what's good, Mike Shaw, my nigga Mez, Mez held me down, nigga\nMore than anybody in the whole fucking, in the whole crew, honestly\nSo shit, let's get it, man\nWe got a lotta shit for '09, '010, '011, '0 goddamn 35\nThat's all I got man, that's The Warm Up\nI made the team\nSo when you go from making the team, now what you gotta do nigga, you gotta start\nYou gotta be a starter, you gotta make it to college\nYou gotta make it from college to the league, nigga\nTrust me, I ain't get no deal and fucking relax man\nI feel like I ain't made it yet period nigga\nAnd that's all I really gotta say yo, it's The Warm Up\nThank you for listening man\nYeah", "image": "https://images.genius.com/35dc92a2bcff8d7abfc69f96f332730b.1000x1000x1.jpg"}], "artist": "J. Cole"}