{"songs": [{"title": "The Mechanic", "album": "Return of the Body Snatchers (ThisIs50 Volume 1)", "year": null, "lyrics": "[Intro: 50 Cent]\nNiggas trying to front? We move on them\nOne up 'side the waist, squeeze the Ruge on them\nNext day we outside like who want it?\nNiggas think something is sweet until we move on them\n\nYeah, niggas want to front? We move on them\nGo through that block they pump, wave that Uzi at them\nNext day we in the hoopties looking for them\nNiggas think something is sweet until we move on them\n\n[Hook: 50 Cent & (Tony Yayo)]\nI'm the Mechanic\nI use the hammer to fix shit\nI be on that sick shit\nI come through to spit clips\n(Called the mechanic\nNiggas on that snitch shit\nTalking that slick shit)\nI know how to fix this\n\n[Verse 1: 50 Cent]\nWith a hard head; a nigga head open, he soft\nI provide these services, we breaking them off\nI'm a familiar face from the land of the lost\nI used to be a worker bee, now a nigga a boss\nIt's like every now and then I'm back to being a Mechanic\nI split a nigga head, I'm a grease monkey with it\nMy Momma told me \"Baby Boy, the Lord going to bless us\"\nThe dope bought us shit the food stamps couldn't get us\nMan, they don't understand, we were just trying to make it\nBut where I'm from if you want shit, you got to take it\nI'm a Trojan of War, I get it done like Achilles\nMy Tre pound will cut a nigga down on the str-id-eets (streets)\nI never had drama with Spics, Jews, or Guineas\nBut once over a bitch a nigga tried to kill me\nI was coming out his projects, I let off the semi\nYou asking about Nedgme, they know me\n\n[Hook: 50 Cent & (Tony Yayo)] x2\nI'm the Mechanic\nI use the hammer to fix shit\nI be on that sick shit\nI come through to spit clips\n(Called the mechanic\nNiggas on that snitch shit\nTalking that slick shit)\nI know how to fix this\n\n[Bridge: Tony Yayo]\nWe don't play that pussy shit. We move on them\nWe put that work in. Nigga, we move on them\nShorty, I know you ain't scared. We move on them\nHere, the hammer right here. Now move on them\n\n[Verse 2: 50 Cent]\nNiggas is loose, I grab the cig and tighten niggas up\nI lost my path in the dark, I'm lighting niggas up\nI'm the school yard with your kid playing dodge ball\nThen out come the hammer, can shorty dodge those?\nI got a few screws missing, maybe even a bolt\nA few shooters with me, down to go for the fall\nI say \"Get'em!\" they get to killing like I'm running the court\nThen get down with these around. The hulks in your throat\nThis is not amateur night and this ain't the Apollo\nAin't nothing saying the sun is coming out tomorrow\nYour arm is broke and the promise of Death is coming\nSo if you want for me that homicide, I'm gunning\n\n[Hook: 50 Cent & (Tony Yayo)] x2\nI'm the Mechanic\nI use the hammer to fix shit\nI be on that sick shit\nI come through to spit clips\n(Called the mechanic\nNiggas on that snitch shit\nTalking that slick shit)\nI know how to fix this\n\n[Verse 3: 50 Cent]\nMoney buys guns, paranoia comes\nWhen the drama comes, go ahead pussy run\nFriends turned foes, Daddy girl's turn hoes\nIn the penitentiary hearts turn cold\nSome turn snitch for State's evidence\nWhile the big boys with the blow keep getting rich\nWhen the drama comes they way they don't fucking panic\nThey hop on the phone quick to holler at mechanics\n\n[Hook: 50 Cent & (Tony Yayo)] x2\nI'm the Mechanic\nI use the hammer to fix shit\nI be on that sick shit\nI come through to spit clips\n(Called the mechanic\nNiggas on that snitch shit\nTalking that slick shit)\nI know how to fix this\n\nI'm the Mechanic", "image": "https://images.genius.com/bf576db23d4c9be399eb9e8c910a6b51.499x499x1.jpg"}], "artist": "50 Cent"}