{"songs": [{"title": "Paddyshop", "album": "The Infamous (Demo Tape)", "year": null, "lyrics": "[Produced By Havoc]\n\n[Verse 1: Prodigy]\nYou can never understand the mind state\nMy goal is to increase the crime rate\nAnd work at a fast pace, no time to think twice\nCatch the fool blinkin' and he will be iced\nFor tryin' to play tough on the menu\nBut I can see the trick within you\nI break it down to a science, word is bond\nNine times out of ten says you'll never see your life again\nI'm ready to die, and ready for all y'all\nIf you think you ready to try to push the God to the limit\nBut I ambush and hit hard and bust shots in it\nYou didn't really want to get involved with a gunfight\nPraying to God that you could live a long life\nBut I put the knife to your throat and proceed to cut\nWhile you're bleedin' on the floor with your mouth shut\nAnd what?\n\n[Hook]\n*scratches* Pumpin' mad slugs\n\nAll we do all day is\nAll we do all day\nAll we do all day is\n\n[Verse 2: Havoc]\nStep through the door, gettin' set for '94\nWith the mind of Saddam, hardcore, bringin' war\nSo cock your pistol, I'm accurate like a Scud missile\nI'll leave a cop killer lost in your brain tissue\nTherefore, say no more, I'm the raw\nKid with skills, give you more than what you came for\nMy crew got my back so when you pop\nThis Glock kicks hollow tips, hittin' you up real quick\nI chill on the hill, mind my own but still\nStay your point, keep my steel cocked and ready for real\nI stay trife and walk the projects at night\nLivin' right? Son, they want to take my life!\nI'm paranoid, damn sure ain't the weed I smoke\nIt's the phony mother fuckers, while I'm on, they're broke\nI see 'em starin', with their heat to try to get bold\nStarin' at my gold, so the heat I hold tight like a mic\nWhen I rhyme, commit crimes tonight\nThrew a bid on my head? Pump lead\nLeave your whole town red, bust a vessel instead\nI choose, you lose when I squeeze\nThe enemies, them blow to fumes\nSpark a L, burn a brain cell, love love\nAy black, Paddyshop, light it up\n\n[Bridge: Big Noyd]\nBig Noyd in the house, representin' Mobb Deep\nEither smokin' a black or the bluey one-twoey\nLightin' it up, light the weed and make a cloud (x4)\n\n[Verse 3: Prodigy]\nYou got a lot of heart boy, all that yappin'\nActin' like it can’t happen\nIt’s brothers like you who fail to realize the realness\nSo, now I got to deal with this\nBack when I was younger, I used to get stuck\nBut now the tables turned and I make the beef duck\nQuit stealin' all you who want to try and play me\nI bet you if I hit you with the pound you’d obey me\nYou must be smokin' dust, my crew will flip for days\nAnd bust your face open in various ways\nI’m in too deep, ain't no if, what if, maybes\nAnd if you got a kid then the P is killin' babies\nAnd after that, relax and get puffed out\nBut watch your step 'cause you could still get rubbed out\nStop frontin', get a Tec to your grill\nFor real, you ain’t ill, I know the deal\nPuff a fat L, burn a brain cell, love love\nAy black, Paddyshop, lightin' it up\n\n[Hook]\n\n[Verse 4: Havoc]\nI leave your brain in a faze, call me, dead\nYour mind can’t find out project side, that’s when I climb out\nBe on a flow in the Ac, the two, either one, two\nAy Black, that’s where they got that stay high\nKeep my mind in the sky, straight are the corrupt\nFront on this kid and you get bucked\nLeft stuck off the raps I kick, Queensbridge kid, you dig?\nAnd rocks into the head, take a swig\nI’m bent, stay hard, and if we bump into any shorties\nAll I want to know is if there’s any skins to barb\nI live the high life, keep my mind right, do my dirt at night\nForget the pull, word is bond, it’s on\nQueensbridge representin' with the automatic fullies\nWeapons we pack, more cracks and flip G-packs\nGet that loot kid, what you gonna do\nWhen my whole crew is blazin' at you?\n’Cause it’s whole crews we run through\nI'm ill like Tommy Hill but brothers can’t figure the facts\nFake Jacks, you’ll get ten in your back\nI react like a maniac, strapped with macs\nIt’s what the petty tip you on cause I'm not on it like that\nI just chill, what the Hell? Everybody want to be a gangster\nStep to Havoc and step into the Zone of Danger\nThey get blown with the banger\nYou been on a whore too long, a buck fifty flippin' on me\n'Cause everywhere I go son, it’s time for me to flip\nLoose lips ain’t shit, aim a nine and don’t miss\nI learned to hold my own, protect my dome from beef\nI’m quick to squeeze my piece, when the beef get deep\nI get down for my crown in a minute\nWanna start drama; wants my gun? Imma end it!\nAnd all this time, I been smokin' Drum, to relax my mind\nI’m stressed like a motherfuck, niggas get bucked\nOn the ave, cause Queens niggas don’t give a fuck\nAnd if you didn’t know by now, Queensbridge is where I’m from\nThe place that stars are born and phony rappers get done\nSpark an L, burn a brain cell, love love\nAy black, Paddyshop, lightin' it up\n\n[Hook]", "image": "https://images.genius.com/5285e9def5b4b96755f32ab86f2dc24d.500x500x1.jpg"}], "artist": "Mobb Deep"}