{"songs": [{"title": "Shorty Was Da Bomb", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[Answering machine]\n*BEEP* Thursday, June 28th, 2:02 AM\n\"I just called you and you said Domino's Pizza, but… and you said you were on your way, but there's just one problem\nI'm all the way to fucking Rochester, New York. Wrong ho!\"\n\n[Talking: DMX]\nUhh, yo yo… yo, not this shit again\nDog gon' be a dog, y'knahmean? Motherfucking dog!\nDon't get a dog if you can't take care of a dog\nGotta take care of the dog, y'know? Y'know?\nTake it easy lady, y'know? Uh-huh\nGive me a motherfucking break, will ya?\n\n[Verse 1: DMX]\nShorty was the bomb, brownskin honey with a little dough\nCome to find out she was a lil hoe, but still, yo\nI pushed up, shorty had that ass like blaow\nHad me scheming on how I could get that now\nWas like girlfriend, let me drop a bug in yo' ear\nShe was mine cause I told her what she wanted to hear\nWas like yeah, she knew how it was going down\nShe said page me, code zero, cause I know you get around\nDidn't have a man, but even if she did dead\nCause my game is tight like a stocking cap on a nigga's head\nI said, we'll get up like nine or somethin'\nDon't act like when I say that ass is mine I'm frontin'\nThat night was right, she let me get that, hit that\nRip that, bounce it off the walls, flip that\nBut only, one thing went wrong, the rubber bust\nBut I didn't fuss cause, dog, shorty was the bomb\n\n[Hook: DMX *singing*]\nShorty, UH! We only did it for that night\nBut man, the pussy was good\nBut shorty's fucking up my life, fucking up my life\nShorty, UH! We only did it for that night\nBut man, the pussy was good\nBut shorty's fucking up my life\nC'mon, ma, give me a break!\n\n[Verse 2: DMX]\nA few days later, I hit her up just to keep it real\nWas like, \"Whassup, boo? How you been? How you feel?\"\nShe said, \"Aight, but my friend's kinda late\nToday's the 13th, and it should've been here on the 8th\"\nI'm like, \"For real?! Don't stress it, it'll come\nIt better cause I can't afford another little one\"\nShe said, \"Neither can I\", I said, \"Cool\nCause I got mad shit to do and you still going to school\"\nSo at least we had the same thing in mind\nNot to have this kid and everything would be fine\nBut I was blind to the fact that she was setting me up\nFor the kill, damn, why wasn't she on the pill?\nAnd I still would check on her like once a week\nSometimes I hit it, sometimes I didn't, but shorty was a freak\nAnd whenever I would speak on the baby\nShorty would be like, \"I ain't having this kid, is you crazy?\"\n\n[Hook]\n\n[Verse 3: DMX]\nBy now, wasn't looking too good\nCause she wasn't doing things that she told me she would\nLike getting the price checked out for what we had to do\nAnd it goes up another yard for every month after two\nAnd a half, I had to laugh out of frustration\nNow she's four months, I'm ready to hit the bus station\nIf I was still on that shit it would've made me rob her\nTold her friends, \"DMX? Yeah, that's my baby's father\"\nHer lil' stomach is shown, so now the heat is on\nMaybe she'll see the light if I start to treat her wrong\nLike if she thought that if she kept the baby she would keep me, so I played the game on her level, got sneaky\nLet her have the kid, she said it was premature\nFound out she was six months when she said she was four\nSo I left her with the pressure on the next man's arm\nBut she'll be aight, cause shorty was the bomb\n\n[Hook]", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}