{"songs": [{"title": "PBSA", "album": "Strangeulation Vol. II", "year": "2015-11-20", "lyrics": "[Intro]\n\n[Verse 1: Tech N9ne]\nChest out, ten toes down\nLeft routes been shown now\nTech shouts, them foes frown\nNext bout, you stretched out, we test clout when in yo' town\nEx'd out, full of debt doubt cause the best house we hold ground!\nBetter run now, don't come around my way\nGonna be dumbfound when the gun sounds cause sun down is my day\nMeaning I don't sleep, but yo food yes I'm gon' eat, alone peep\nAnybody tryna get the grown seat better gone, it's gonna be a long week!\n(Rah, rah, rah!) That's what they talkin' a lot of em bumpin' they chops\nBut they can never compare to the winner, they simply be giving me something to knock\nI slay wack, just play back my hits\nSo you better stay back on this great track cause I made that my bitch!\nYou wantin' this, I'm on a mission too\nSo you ain't gonna get what you wanna get, this one I'm kickin' through\nHit they mama, quit the trauma, hid dishonor gets to shoot\nIf you want a bitch, a ton of shit cause I'ma hit your crew\nBout to knock you out yo' skin, go in body, then I'ma go chin\nPlace yo' bet, you gonna hate the Tech\nCause I'ma break yo' neck, we ain't no kin\nDreams and hopes will be broken when that flow spin\nI'ma fo' sho' sin, level headed when the rebel get it\nHeavy metal fetish when I go in!\n\n[Hook: Tech N9ne] (x4)\nPLAY BALL!\nSLAY ALL!\n\n[Bridge: Godemis]\nWar paint on my mean mug\nAccolades, I got dumb clout\nBack to back I run mad laps\nWhen the sun's down or the sun's out\nSara Jay on my side arm\nY'all ain't tryna see me with guns out\nWith mo anger, that's no-brainer\nSo y'all niggas better run routes!\n\n[Verse 2: Ubiquitous]\nI heard something 'bout\nAnybody can get it, I'm with it\nI'm coming for Sun's crown\nWhen I hit him he done after one count\nYeah I'm living, I love it, my lungs loud\nWhen I come from the scrummage\nThe scrimmage, I did it, I done it like what now\nWe could put up some butter and do it no stutter\nBut put up or shut up your bum mouth!\nNow it's your move, took a chump out, I'm so old school\nYeah, say hi to my little friend\nKill 'em with the pen, make the dynamite go boom!\nTalk about big balling, and it may seem like I'm stalling\nWhen I'm staring outta that wall and\nBombing like Babe Ruth when I call it\nYes y'all it, and my bet's all in, heck nah, never let y'all win\nIn the game, everything a test to check\nTo see who can really hang like a net, all in\nCome and train with the Ces, yeah\nIt's no thing little bunny, I can bang with the best in the biz\nYou better be saving all of your breath for the gym\nGotta run until there ain't nothin' left in the lid bruh, let's get it in\nYou heard me, chewed 'em up, I'm done early\nSuited up in my jersey, feelin' like who or what can come serve me\nY'all too corrupt to come prove to us your kung-fu\nYou suck, you're unworthy, dirty like Harry makin' my day\nTell 'em I come to slay when I play, break!\n\n[Hook: Tech N9ne] (x4)\nPLAY BALL!\nSLAY ALL!\n\n[Verse 3: Godemis]\nK-I-M, and I kill shit\nYou could say that I slay turds\nDIB and I K-I-S, y'all L-A-F and those eight words\nOn my D-O-B I was D-O-A, but I came up out of that coma homie\nODB, I take no T-O, I'm like Oscar Meyer with no bologna\nKiller and I'm dealin' 'em, I'm wavy\nSinner in the center of a stadium, ya numb\nAnd now I go gorilla for real, uh, fuck I'm off the wall for real, uh\nAnd I'm an inaudible offense as often as needed\nY'all slower than molasses, run screen passes, Weeden\nYa get hit with a blitz, boy\nJust for thinkin' that they couldn't catch this\nAnd when I run a muck, I'm puttin' numbers up\nGo and take you a look at my stats bitch\nMy contract's got no cap, and the money is under the mattress\nI stay high like A.I, what the fuck are we talkin' bout, practice?\n\n[Hook: Tech N9ne] (x4)\nPLAY BALL!\nSLAY ALL!", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}