{"songs": [{"title": "Lookin at You", "album": "Doctor’s Advocate", "year": "2006-11-14", "lyrics": "[Hook: Tracey Nelson]\nWalking down the street, in my All Stars\nIn my khaki suit, doin' what I do\nWalking down the street, smoking chronic\nIn my black locs lookin', at you\n\n[Verse 1: The Game]\nGuess who's back on the West coast tracks\nIt's the motherfucking messiah of gangsta rap\nStill dip in the six-fo', still puffin on the same chronic\nHaters mad cause I still got it\nI never fall off, even without the Doc\nYou niggas sellin your soul trying to stay on top\nBitch nigga check your Kotex\nYou niggas ain't moving shit like the hand on a fake-ass Rolex\nI'm five million sold\nThe cover of my last album the only time you see me sittin on gold\nI'm the most anticipated, most celebrated\nMost loved and the motherfucking most hated\nKeep rolling like gold Daytons\nNiggas got the game fucked up like Hennessy with a Coke chaser\nYou gotta deal with me, I'm the West Coast savior\nNiggas think of me every time they six-fo' scraper\n\n[Spoken Word: Mac Minister]\nWhat do you call a nigga who's overbearing\nBelligerent, foul, defiant and very disrespectful?\nYou call that nigga the Doctor's Advocate\nHe's a reflection of Dr. Dre in his heyday in the worst way\nThe five star surgeon general\nTook Jayceon to the Aftermath research department\nAnd gave him a blood test\nIt came back G-A-M-E positive\nThe nigga's infected with the Game virus\nHis oratorical skills are so impeccable\nThat niggas in the streets call him Cyrus\nThe young damu's down with violence\nCause in his heart he's a tyrant\nIt's not a game, it's just called The Game\nThere'll be no referees, no halftime reports\nWhen the game is over, The Game is over\nYou can't put a quarter in the machine and get three mo' men\nTHAT'S, the end\n\n[Hook: Tracey Nelson]\nWalking down the street, in my All Stars\nIn my khaki suit, doin' what I do\nWalking down the street, smoking chronic\nIn my black locs lookin', at you\n\n[Verse 2: The Game]\nI done been to hell and back\nLeft for dead, you know who to thank for that\nFinished my second LP without a Dr. Dre track\nYou can take my soul but can't take my plaques\nI'm the motherfucking snare when it touch the beat\nI'm the 808 drum that got you movin your feet\nI'm the heir to the throne after the D-R-E\nProduct of my environment, you old-ass niggas\nGet ready for your early retirement\nBefore I let hip-hop burn down I run in the building like a fireman\nWho can outspit me when I'm high off sticky\nThrowing back Patron shots in some creased up dickies\nI'm D.O.C. certified, Ice Cube lynch'd me\nSnoop stamped me and the good Doc handpicked me\nYou still with me?\nMe and my mic can't be separated like Interscope and - hahaha\n\n[Outro: The Game]\nOh shit\nThis some good ass motherfucking weed\nCalifornia sticky green!\nThis is the aftermath for the Aftermath\nWest, coast!", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg"}], "artist": "The Game"}