{"songs": [{"title": "Politics as Usual (Obama Is Here)", "album": "The Preview", "year": null, "lyrics": "[Produced by Polow Da Don]\n\n[Intro: Ludacris]\nHold on man, Mr. Barack Odrama\nCan I address the current state of affairs real quick?\nI got some shit I need to get off my chest\n\n[Verse: Ludacris]\nI'm back on it like I just signed my record deal\nYeah the best is here\nThe Bentley coupe paint is drippin' wet, it got sex appeal\nNever shoulda hated, you never shoulda doubted him\nWith a slot in the president's iPod, Obama shouted him\nSaid I handled my biz and I'm one of his favorite rappers\nWell give Luda a special pardon if I'm ever in the slammer\nBetter yet put me in office, make me your vice president\nHillary hated on you so that {​​censored}​​ bitch is irrelevant\nNow Jesse talkin' slick and apologizin' for what?!\nIf you said it then you meant it, how you want it, head or gut\nAnd all you other politicians tryin' to hate on my man\nWatch us win majority vote in every state on my man\nYou can't stop what's 'bout to happen, we 'bout to make history\nThe first black president is destined and it's meant to be\nThe threats ain't fazin' us, the nooses or the jokes\nGet off your ass black people it's time to get out and vote\nPaint the White House black and I'm sure that's got 'em terrified\nMcCain don't belong in any chair unless he's paralyzed\nYeah I said it cause Bush is mentally handicapped\nBall up all of his speeches and just throw 'em like candy wraps\nCause what you talkin' I hear nothin' even relevant\nAnd you the worst of all 43 presidents\nGet out and vote, or the end'll be near\nAnd the world is ready for change cause Obama is here\nYeah!\n\n[Hook: Ludacris]\nCause Obama is here\nThe world is ready for change cause Obama is here\nYeahhhh, cause Obama is here\nSay world is ready for change cause Obama is here\nHey!", "image": "https://images.genius.com/d3d7b5692d6943a0a071946843cc3521.525x525x1.jpg"}], "artist": "Ludacris"}