{"songs": [{"title": "Pull Up", "album": "Free Weezy Album", "year": "2015-07-04", "lyrics": "[Intro: Lil Wayne]\nThat's how I raised 'em, Lord\nThem niggas crazy\n\n[Verse 1: Lil Wayne]\nD-boy, D-boy, D-boy, my pockets look Keloid\nMy dead Presidents reborn\nWhen I'm naked I got three arms\nGot a big house with a green lawn, got a cigar full of neon\nLike my ho cold and my tea warm\nClose his casket, he look deformed\nI got bitches on my dick\n\n[Verse 2: Euro]\nI got Jays at my door\nI got shooters on my team\nI got Feds down my throat\nCounting money, dirty and clean\nSmoking nothing but Irene\nGot a bitch with good hygiene\nI'm sick with it, no vaccine\n\n[Verse 3: Lil Wayne]\nI got coke under my nails\nI got niggas taking them Ls\nNigga, we don't need no scale\nI'm sick with it, no get well\nTrigga man, trigga man, trigga man please don't shoot\n'Bout it, 'bout it, 'bout it like T-R-U\nYoung nigga ridin' in a V-1-2\nChop bricks like karate, judo, kung fu\nLike jiu-jitsu, split a brick in two\n\n[Verse 4: Euro]\nYou do you, I'mma do what it do\nNiggas dropping dimes and their 2 cents too\nBout it, bout it, bout it like hoody-hoo\nStarted from the bottom and I grew into\nEverything I'm driving is new, improved\nWhen she fucking with me it's a new experience\nFucking with you it's a new excuse\n\n[Verse 5: Lil Wayne]\nNigga, who is you?\nI looked in the mirror, say \"Ooh, it's you\"\nAll my goons be too enthused\nSo don't open your mouth, like you're chewing glue\nLight blue Michael Jordans\nMy shoe get checks like \"Swoosh\"\nHear you niggas talking about what you gon' do\nOr might do, I invite you, I entice you but I advise you\nNot to, God bless you like \"Achoo\"\nPolice find you in the bayou\nWith your friends by you\nAnd your shit knocked loose\nNigga, that's what you'll get like Ken and Ryu\nI been Piru, I'm in my mood\nSo you know what you can do?\n\n[Hook: Lil Wayne]\nFuck nigga, pull up!\nI'll be waiting, yeah\nFuck nigga, good luck, yeah\nI'll be waiting, yeah\nFuck nigga, pull up\n\n[Verse 6: Lil Wayne]\nFuck nigga pull up, fuck nigga pull up\nI'll be waiting with my muhfuckin' foot up\nI ain't even stood up, fuck nigga, good luck\nFuck nigga put up or muhfuckin' shush up\nFuck nigga, pull up, my young niggas stood up\nLike, fuck nigga, what up? Fuck nigga shook up\nI been out here since P had the hook up\nSo if you wan' meet, nigga, I'm a butcher\nIf you wan' beef, nigga, I'm a butcher\nMy niggas wanna eat? Nigga, I'mma cook ya\nIf you with your bitch, and your bitch want me\nNigga, I'mma pull her like a trigger, she the bullet\nWe the illest, we the coolest (We the illest, we the coolest)\nWe the illest, we the coolest (We the illest, we the coolest)\nThe sickest and the smoothest, the gifted and the goofiest\nRead a scripture out your movie, get a picture, I'm a-zoomin\nI'mma hit 'em, I'mma lose 'em, I'mma kill 'em, I'mma bruise 'em\nI'm a sinner, I'm a suitor, not to mention I'm a mover\nI come at you when I'm movin', the bitch I'm with bad\nI'mma pinch her on her booty, that bitch is Lil Tunechi's\nAw yeah, aw yeah, fuckin' right\n\n[Verse 7: Euro & Lil Wayne]\nAlways had my gun in fights\nAlways had the upper hand\nYou the always-call-your-brother type (ooh)\nHard-head all my fuckin life (yeah)\nWhole world in my fuckin hand (yeah)\nDamn, my girl just pulled up\nWith \"Pull Up to My Bumper\" playin'\nBut fuck it man, like what you sayin'?\nLook, I'm not sayin', but I'm just sayin'\n\n[Hook: Lil Wayne]\nFuck nigga, pull up\nI'll be waitin'\nLord knows, I'll be waitin' for you\nMe and my young niggas\nThat's how I raised 'em\n\n[Bridge: Lil Wayne]\nFuck nigga, pull up, my young niggas stood up\nLike, fuck nigga, what up? Blooka-blooka-blookah\nI say, fuck nigga, pull up, I'm waitin' with my foot up\nFuck nigga, good luck! Blrrt, blrrt, blrrt!\n\n[Verse 8: Lil Wayne & Euro]\nI say, fuck nigga, pull up, fuck around and never pull off\nThey see the guns we pull out, say \"Never mind\" and pull off\nThey see the guns we pull out, say, \"Never mind\" and keep goin'\nI put the gun in his mouth and say \"Be quiet and breath soft\"\nShifty eyes, I see four, flip them pies like D. Dawes\nThese bitches tired, they sleepwalk, brilliant mind, I'm street smart\nIn deep thought and we are what she want and she want\nAnd he don't, but keep on and we gon' see\nYeah!\n\n[Outro: Lil Wayne]\nFuck nigga, pull up\nYeah, fuck nigga, pull up, woo\nI'll be waiting, haha\nWhy you waiting?\nFuck nigga, pull up, fuck nigga, pull up\nFuck nigga, pull up\nYeah, I'll be waiting for you\nUh, me and my young niggas\nYeah\nThat's how I raised 'em Lord\nThem lil niggas crazy\nThey just waiting for me to tell 'em to go crazy, boy\nWhat am I waiting for?", "image": "https://images.genius.com/22c3b68c0f49bb742b34148131ca933d.1000x1000x1.jpg"}], "artist": "Lil Wayne"}