{"songs": [{"title": "Just a Moment (12\" Mix)", "album": null, "year": null, "lyrics": "[Verse 1: Quan]\nCan we please have a moment of silence?\nThat's for my niggas doin' years in confinement\nAnd for my soldiers who passed over, no longer living\nThat couldn't run whenever the reaper came to get 'em\nCan we please pour out some liquor?\nSymobolizin', let's take in time to consider that\nThough our thugs ain't here, the love is here\nAnd we gon' rep 'til slugs kill us here\nThis for my dawgs stuck in the struggle tryin' to gain\nSmokin' trauma, sniffin' Ra while sellin' cocaine\nTrapped in the game, not knowin' how to stop and get by\nTo live it alive, so instead they live it to die\nCan we please have a moment of peace?\nFor every G that fell for his flag in the streets\nBloodin' and thuggin', folkin' and lokin'\nCrypin' and creepin', Latin and kingin'\nOr just for poor righteous teachin'\n\n[Hook: Quan sings]\nAs days goes and nights fall\nFor the rest of our life we'll miss y'all\nAnd even though life must go on, we'll still mourn\nWhile wishin' y'all were home\n\n[Verse 2: Nas]\nYeah, and can we have another moment of silence?\nFor brothers who died from black-on-black violence\nFrom here to the Dark Continent were rebels sell diamonds\nTo clients allover the world, got little Black girls dyin'\nAnd can we please pour some more liquors?\nFor Will, Bokeem, Bar, Pappy -- my niggas\nHere's another Warrior Song from Nasty and Quan\nIt's to him I pass the baton to carry this on\nStreet's Disciple, salute to those who's gone with bullets\nAnd I promise through rhymin' Quan gon' rep his life to the fullest\nAnd can we please have a moment of truth?\nFor soldiers and troops away with helmets and boots\nAnd families back home who pray they make it home safe\nHopin' that they don't get hit with a stray or missiles\nThis is just a moment to let you all know that we miss you\nMommy I'm still here, wishin' I was there with you\nLet's take 'em home\n\n[Hook]\n\n[Verse 3: Quan]\nAnd can we please have a moment to mourn?\nFor Pac, Biggie and Pun cause through us they live on\nJam Master Jay, Freaky Ty and Alliyah\nBig L and Left Eye, when we die we wish to see ya...\n\n[Nas]\nPhotographs of lost memories\nOn the blocks with blunts and Hennessey\nPicture some niggas in mock neck shirts\nBallantine Ale in brown bags\nBrothers like to brag 'bout their cousins\nThat locked in the system\nWe all fall victims, we all call Christian\nOr Islamic faith, to restore all our faith\nBarbed wire and tall brick wall\nBut we all can escape\n\n[Hook]", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}