{"songs": [{"title": "Dreamchasers 2 Outro", "album": "Dreamchasers 2", "year": "2012-03-07", "lyrics": "[Verse 1: Meek Mill]\nI just call my homie and he say he got a lick\nHe said he know a pussy nigga with a hundred bricks\nSo we gon' ride up on em, slide up on em with them sticks\nFinna pop up at his crib like a fuckin' magic trick\nHocus-Pocus, to the safe like you ace nigga open focus\nBut this ain't Calvin niggas, ridin' like a locomotive\nWhere the cash at? Show me where your stash at\nBefore I let the 40 air ya out and leave that ass flat\nPussy ass niggas man it's tax season\nMake a move and this muthafuckin mac squeezin'\nAct decent, bet them hollows leave your back leakin'\nNiggas searchin' for the coca like we crack feignin'\nI gotta hundred killas on my team\nYoung niggas gettin' greasier than Vaseline\nHad a dream, I'mma chase it with this Mac machine\nPut a nigga on the cover of a magazine\nHome invasion, news paper got a man down\nHold this nigga legs, I'mma tie his hands down\nLet em taste it, just to know we ain't playin' round\nHe ain't gotta get up on your knees, nigga head down\nBlocka! You fuckin' with a shotta\nI'm bangin' 2Pac, \"My Ambitionz As A Ridah\"\nI got the oo-wop. tryna' get it for my momma\nAnd we gon flush everything if them boys get behind us\n'Cause we ain't comin' home, I'm in another zone\nRidin' with my dogs, we just want another bone\nI got another lick, so I got another chrome\nI ain't gettin' to the money, nigga, then there's something wrong\n\n[Outro: DJ Drama]\nYou see, dreamchasin' is an occupation\nThat's an exclusive membership\nSuch as: Rozay, Khaled, Karen Civil, Lou Will, Joey I.E.\nI mean, of course, I'm a member\nIt's never too late to join\nPlease! Submit an application any day\nRemember the last one?\nI told you, it starts with a thought\nWhatever happens after that is up to you\nDreams and Nightmares up next!\nQuality... Street... Music!\nAnd like that... We gone!", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}