{"songs": [{"title": "Stay in Line", "album": "Legend of the Liquid Sword", "year": "2002-12-10", "lyrics": "[GZA]\nThrow down ya mic son, ya gauge is empty\nPlus the wack shit in the game might tempt me\nQuickly drop non-stop rec shot\nWhat I took on the road on the lap and desktop\nA mixture from up-tempo to slow grooves\n8-Track figure that's mixed wit Pro Tool\nI rhyme wit sense the paragraph was intense\nArea's dense with the flow from the sentence\nEngine powered by five hundred horses\nPress by a threat of joint forces\nFor emcee's who spit rap to cause beef\nCause they depend on wild kill for fresh meat\nOn the board, you're just a piece that's captured\nWeak as the lamb that's laying in the pasture\nThe plug that gave ya juice, I might pull it\nCan't escape these endless waves of rap bullets\n\n[Hook: Santi White (GZA)]\nThey got no place for me\nIn my life can't you see?\nI must not push or bite it tell me\nStay in line, Stay in line (Stay in line)\nStay in line, Stay in line (Stay in line son)\nStay in line, Stay in line (Stay in line kid)\nStay in line\n\n[GZA]\nI'm not insane in fact I'm kinda rational\nChrome-plated serrated swords slashing you\nI shine light to the mic\nThat's filled with the unspoiled water that's rich with life\nBut um, you get high off the wealth and livin' large\nWe rely on the stealth of camouflage\nCut supply lines, flood ya mans market\nFrom high altitude cover the land target\nLost in the desert, the journey is stressful\nWhere the rescues are unsuccessful\nThey perish while they search for it, intriguing treasures\nShoulda taken precautionary measures\nThe rhyme with the shank in the yard that kept stabbing ya\nA shakedown from Alcatraz to Attica\nBecause we rock the jails\nWhere the inmates write the verse on the walls of cells\n\n[Hook: Santi White (GZA)]\nThey got no place for me\nIn my life can't you see?\nI must not push or bite it tell me\nStay in line, Stay in line (Stay in line)\nStay in line, Stay in line (Stay in line son)\nStay in line, Stay in line (Stay in line kid)\nStay in line\n\n[GZA]\nYa out cold, ya styles old\nAllah just rolled, attack his skull wit a plan that's bold\nHit ya king with a Check that caused directly damage ya disco tech\nShoulda' Protect ya Neck\n\n[Santi White]\nAnd do they think they got me? I don't know\nThey seen ya picture baby? Don't think so\nNow do your mission and while you were thinking\nAin't no collision that'll stop me from screaming\n\n[GZA]\nInvolving movements, controlling the squares that's closed in\nWit impact, in fact ya zone is frozen\nSubmerged in deep blocks of ice\nScheming a wise by the high-tech devise\nThe slightest fame can bring pain and torture\nThe author, who came with a burning offer\nPublished by whoever made it must own it\nIs just an atonement for one chaotic moment\n\n[Hook: Santi White (GZA)]\nThey got no place for me\nIn my life can't you see?\nI must not push or bite it tell me\nStay in line, Stay in line (Stay in line)\nStay in line, Stay in line (Stay in line son)\nStay in line, Stay in line (Stay in line kid)\nStay in line", "image": "https://images.genius.com/6eec7781b61d16cab75a144ab36ff78d.500x500x1.jpg"}], "artist": "GZA"}