{"songs": [{"title": "Jingling Baby", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "[Chorus]\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n\n[Verse 1]\nThey call me Uncle L, Future of the Funk\nRecords I recorded minus all the junk\nPeople spread gossip and believe what they must\nWhile I slam dunk dicks and make em bite the dust\nA minute is needed to make a phony roni bleed\nAnd put him in a bucket like it's chicken feed\nCheck out the - pick of the litter, not a quitter, I'm nice y'all\nAnd I'ma dust you off and dust you off twice\nYou neer heard this so observant all hysterical fan-\n-natics of the Asiatic miracle man\nProminent, dominant, McCoy and I'm Real\nIf you're another brother's fan? Forget how you feel\nCause he's so-so, I got the instinct\nThey call me Deputy Dog, now put your ass in the clink\nInnovating, devastating, and dope on the single, now\nLet me see your earrings jingle\n\n[Chorus]\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n\n[Verse 2]\nI chopped you, chewed you, baked you and {fucked} you\nThat {shit} you pop, you need to stop, you're kind of rude you\nNo good {niggaboo} tryin' to base\nHow we livin' homes? Get out my face!\nI'm complete, in effect, and I can't fall\nI rise, suprise, and I advise you all\nTo stand back and peep, don't sleep or doubt\nMy skill'll get ill, I turn the mother out\nI'm top-notch, you're still playin' hop-scotch\nNow I'ma do ya while the party people watch\nYou're real funny, you really try to go for yours\nBut I know why: you ain't had no dough before\nSo you tried and lied to drain my fame\nThis ain't a game, yo, you know my name\nForget all the MC's who like to mingle\nYo baby, let me see your earrings jingle\n\n[Chorus]\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n\n[Verse 3]\nWhen you first walked in, I ain't know what to think\nYou grabbed the microphone like your shit don't stink\nAnd tried to run down that; I can't get over that\nShit you were sayin' - you call that a battle rap?\nHow you gonna go against an army with a handgun?\nI'm Cool J, yo you don't understand, son\nI'm a legend, on top of that I'm livin'\nNow you look stupid like that bitch Ms. Givens\nWhoever geesed you up; nah, how should I say it?\nWhoever set you up, they knew just how to play it\nCause man, YO, I feel for you brother\nI'm a baaaaaad... (Word to the mother!)\nTakin out suckers while the ladies pucker\nAnd rollin' over niggas like a redneck trucker\nInnovatin', devastatin', and dope on a single, now\nLemme see your earrings jingle\n\n[Chorus]\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n\n[Verse 4]\nYeah baby, you know what I mean?\nYou like be jinglin crazy, word\n(yeah yeah yeah)\nAll over this funky beat\nYou be like jinglin', and your earrings be jinglin'\nAnd shakin all over the place and all (mm-hmm)\nIt's like real, it's real wild to me honey yaknahwhatImean?\nThe way you be jinglin', worrrrrrd\n\n[Chorus]\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n\n[Verse 5]\nCan't believe you tried to grip the same mic as me\nYour grip's too weak, you can't hold it, B\nYou can dream of makin' progress and gettin' this nice\nBut when I roll up, it's like Hip Hop Vice\nI serve to curbs, I never swerve I'm superb\nEvery word you heard played tricks on your nerves\nYou played your hand, lost track of your plan\nWhen I show up, I blow up, end of story, my man\nI'm a play you like a poker chip, that's what you get\nI bet your fret, sweat, and regret you met\nThe titan of fightin', excitin' when writin', you triflin' toy-boy\nI gotta enlighten, so start bitin'\nYou know you can't create and get mean like this\nWhen I'm on the court, G, it's strictly SWISSSSHHHH!\nWhen it's all over, said and done, my friend\nThey say, \"That {bad motherfucker} just scored again\"\nSo take a step back, give me some room to wreck shop\nHere's your token back, you're gettin' off at the next stop\nI'ma deliver and give a speech with vigor\nI drink some Olde E and start waxin {niggas}\n\n[Chorus]\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby\n(They're jingling, baby) Go 'head, baby", "image": "https://images.genius.com/50f3518021144107f62ef0ff2c5bee03.599x588x1.jpg"}], "artist": "LL Cool J"}