{"songs": [{"title": "Thank You", "album": "YSIV", "year": "2018-09-28", "lyrics": "[Skit: Kevin Randolph & Steven Blum]\n\n[THALIA:]\nThis concludes the program—\n\n[KAI:]\nDamn man, we been walking forever...\n\n[THOMAS:]\nWell, Thalia's tracking system says we'll be there in just over an hour...\n\n[KAI:]\nShit, at least we got good walking music—or is that it?\n\n[THOMAS:]\n(laughing)\nNo man, I'm queueing up the fourth album now—his final one...\n\n[KAI:]\nNigga, what the hell are you talkin' bout?\nMan, he has like a million albums!\n\n[THOMAS:]\nI mean the final Young Sinatra, the fourth one.\n\n[KAI:]\nAww, shit man, you had me trippin'!\nI was about to say...\n\n[THOMAS & Logic:]\n(Yeah, yeah) Let's get back to this boom bap shit.\n\n[Intro: Logic]\nYeah, so we just gon' let this shit breathe one time\nShout-out my boy Henry right here in the studio\nAye, yeah—\nCheck, check, mic check, one, two\nAlright this is classic shit, yeah\n\n[Verse 1: Logic]\nI coulda never imagine that this shit here could happen\nWent from the basement to thirty million just off of rappin'\nYoung Sinatra, that boy that brought you so many classics\nAin't never comin' with nothin' less than the illest tactics\nThought the series was over, but we just gettin' started\nI won't ever leave this rap shit, no I can't depart it\nFrom the trap to the boom bap\nTo Young Sinatra to Tarantino\nWe know he do that\nBitch, I got the flame, who dat?\nI'm the new Kanye when they was like \"Who Kanye?\"\nI got that fire in my soul to make these classics, ayy\nI decided to write this letter on a private jet\n'Cause in many ways it still feel like I ain't made it yet\nFor every goal I attain, I set like ten more\nBut I had to take a break to write you, that's for sure\nTake a moment and celebrate how we all alive\nHad to write this letter here over a Nujabes vibe\nFuck that rapper shit, fuck a punchline\nThis for every single fan that know every single line\nSo I'm saying thank you for loving me\nFor setting me free and letting me be me\n\n[Chorus: Logic & Lucy Rose]\nThank you, thank you\nFor letting me speak my mind\nAnd putting it all on the line\nThrough the sunshine and the rain\nThrough the good times and the pain\nAnd never staying the same\nAnd having the courage to change\nThrough the sunshine and the rain\nThrough the good times and the pain\nFor never staying the same\nAnd having the courage to change\nThank you, thank you\nFor letting me speak my mind\nAnd putting it all on the line\nThrough the sunshine and the rain\nThrough the good times and the pain\nFor never staying the same\nAnd having the courage to change\nThrough the sunshine and the rain\nThrough the good times and the pain\nFor never staying the same\nAnd having the courage to change\n\n[Interlude: The RattPack]\nAye, what's up Logic, big love out here from Jonathan U.S. Navy out here in Japan. Much love for my boy Oscar. Keep us going every day\n\nYo, Logic I'm Shane E. from Pueblo, Colorado and I just can't since about 2014. I love every one of your projects\n\nIt's Yiana from Australia and honestly, I'm so excited for Young Sinatra IV. You've been an amazing inspiration to me. I just wanna say thank you so much\n\nThis is Seif from Egypt. Yo, I love your music man. Everything about it's so inspirational. I just love the way you look at things and how real you are. I love listening to you. Take care, man\n\nYo, what up Logic. It's Max calling from Alberta, Canada. I just wanted to say your music has really inspired me and has always got me feeling up when times were down\n\nHey, Logic, it's Michael from Israel and I'm a really big fan of yours. I love you so much and I love your music. Keep doing what you're doing. Thank you very much\n\nDiego Sepúlveda from Puerto Rico. And your music to me helps me get through everything\n\nI'm Francis from Botswana, in Africa. Your music really means a lot to me, thank you for always being you, peace, love, and positivity\n\nHey, I'm Deborah from Hong Kong, and I just want to say that your music has lifted my soul in such tough times and it told me that anyone from anywhere could be anything they want to be\n\nMy name is Ali, I come from Jamaica. Yo, your music helped me through some whole heap of dark times. Down here in a third world country it's rough, but, hey your music helped me get through. Yeh, RattPack, RattPack for life yute, Young Sinatra yute, yeh\n\nHey, Logic it's Chester and I'm from Silver City, New Mexico and Paige, producer for him, from Silver City, Mexico. We love you! We love you Logic\n\nMy name is Abdulla, I'm from Palestine, I just want to say that your music is so inspiring to all the youth in the Middle East, and Asia, and all around the world\n\nIt's Eric Khaled from Canada, Alberta, Sturgeon Lake, little reserve, repping all my native homies\n\nIt's Katie from Portland, Maine, and each day I fall more in love with your message your music and everything about you. RattPack all day, every day, for life\n\nMy name is Muhammad and I'm from Amman, Jordan and I'd like to say that your music is a big inspiration for me\n\nHi, Logic, it's Amber from Ireland; I just wanted to say your music means fucking everything to me\n\nMy name is Tebogo Kodisang and I'm from South Africa\n\nWhat up, Logic? This is Dionisio from Mexico\n\nThis is Summer Sheers coming from Joliet, Illinois\n\nMy name's Habib from Singapore\n\nYo, what's up Logic. New York, Taiwan, I'm from Australia, man\n\nHi, Logic, my name's Alexandra I'm from Brooklyn, New York\n\nMy name's Issam, I'm from Israel\n\nMy name is July, I'm from Seattle\n\nMy name is Kinan Fayyad, I'm from Beirut, Lebanon\n\nI'm from New York\nI'm from Mexico\nLithuania\nMissouri\nNorthern California\nKenya\nAlbuquerque, New Mexico\nNorth Carolina\nTurkey, Istanbul\nNew York, Long Island\nVirginia\nFrom India\nMexico\nChile\nNebraska\nIceland\nBay Area\n[?]\nI'm from Brooklyn\nCalling from Serbia\nNashville, Tennessee\nFrom Dallas, Texas\nMiami\nBaltimore, Maryland\nLos Angeles\nViewmont, California\nNorth Carolina\nFrom Zimbabwe\nFrom Wisconsin\nSan Antonio, Texas\nNew Jersey\nComin' from Maryland\nSouth Carolina\nChicago, Illinois\nSacramento\n\nYo, Logic, what's up? It's Tanner from Boise, Idaho. PLP. RattPack forever. Visionaries never fail\n\n\n[Outro: Logic]\nYeah, yeah\nShout out to all the fans\nAll my family, the RattPack all around the world\nI love you guys, man\nThank you, thank you so much for letting me do what I love every single day and spreading a positive message\nPeace, love, and positivity, baby\nYeah, yeah\n(Sinatra)", "image": "https://images.genius.com/2bdac395ac5e383d08777fa471ffb275.600x600x1.jpg"}], "artist": "Logic"}