{"songs": [{"title": "Dunfiato", "album": "Muddy Waters 2: The Preload EP", "year": "2014-05-07", "lyrics": "[Intro]\nHey, hey\nMuddy fucking waters mixtape, man\nI'm high as a bitch  up in this motherfucker\nI need a beat, I need a fuckin' beat\nI don't need no turn up beat, I need some elements\nSome Hip-hop\nLet's get back to some elements and shit (yeah)\nJosh, I like that man. You like that man?\nLet's turn that shit up man (yeah)\nLyrical wordplay for y'all. I feel good on this one, man\nThis is how real emcees do it, you know?\nYeah, I like that shit a lot man\nD'un fiato!\nRome, York, we in the building\nCheck it out (yo)\n\n[Verse 1: Redman]\nWhen I hit the bong I'm Godzilla taking over Hong Kong\nEating wantan wid' a shotgun in long johns\nIt's not unsung\nNo story here to tell, I'm just ready\nI'm a student before the school bell\nThat prevail my wordplay\nThirsty, I bust all three Ks on Martin Luther King birthday\nBerkeley College, for twenty dollars\nIf I got it, smoke, here enquire my knowledge\nA little psychotic, I know\nRate me, I'm Michael Jordan in the final four fighting with Wayne Gretzky\nI'm not relevant, let's see\nWho's spittin?\nSome of y'all Coke and Pepsi, I can't tell the difference\nI'm Darryl when I'm pitchin'\nBefore the white girl had 'em twitchin'\nNow the rap game in my kitchen\nEasy pickens\nRebel wid' a cause\nMy mind is like fuck with mine, I'll put your mind on the wall\nI'm on tour gettin' bread and tattoos and your job is giving Tic Tacs in bathrooms\nI hate gossip, I'll mash up your media moshpit\nRelease a ba-boom in the chat room\nMy weed bags are vacuum that smuggle\nOff of one blunt, a bitch gon' fuck you (HAHAHA)\nChicks Tivo the meatloaf, when I hit they belly Doc droppin' all dimes (RICO!)\nTake precautions\nI got a Paul Bearer that build coffins for all rappers and nonsense\nNonchalantly I'm thinkin' darker than a convict conscience\nThat's why I'm sweating in the armpits, that's where the bomb is\nThe gang rate in my city is like the 80s where Kendrick Lamar live\nI gotta' harvest the purple at my apartment, across the park I sell pounds to Cartman\nI think like an orphan, I'm in a zone\nBut it's freestyle so these words might need a home\nExecutive net, I demand respect, check, don't even talk to me or text the wrong tone (OKAY)\nStay at bay, um and delay\nWhen I ride out, pull pins from these hand grenades\nYou can be amazed or hate it\nBut either way I get it heated like Kanye and Sway\nI'm done wid' it, I had fun wid' it\nStay back and tell your girl come get it\nShe had Mr. Right, now she want Mr. Wrong\nNow she swing along, like Serena arms", "image": "https://images.genius.com/f618e04e53b27567c6d36ab82c2fd432.500x500x1.jpg"}], "artist": "Redman"}