{"songs": [{"title": "Anziety", "album": "Everybody", "year": "2017-05-05", "lyrics": "[Intro: Lucy Rose]\nEverything is fine, everything is so fine\nEverything is fine, everything is so fine\n'Cause I’m good, so good\n'Cause I’m good, so good, so good\nI wish you would, I wish you would\nI wish you would, I wish you would\nI wish you would, this is my life\nThis is my all, this is my all\nAnd now I’m happy, right now I’m happy, but sometimes\n\n\n[Chorus]\nI’ma get up in your mind right now\nI’ma get up in your, I’ma get it\nGon' get up, gon' get up\nGon' get up, get up, get up, get up\nI’ma get up in your mind right now\nMake you feel like dying right now\nI’ma make you pray to God\nTo the good old Lord for a sign right now\nTo the good old Lord\nI’ma get up in your mind right now\nMake you feel like dying right now\nI’ma make you pray to God\nTo the good old Lord for a sign right now\nTo the good old Lord\n\n[Verse 1]\n“I’ma make it some day some how” what you telling yourself\nBut you ain’t focused on what's important: mentality, health Everybody in the world only want one thing, what's that?\nInfinite power and a pocket full of wealth\nIts like ohhh I'ma bring it back to the basics\nNobody can erase it\nPeople in the street going ape shit\nBattling depression but nobody wanna say shit\nI'ma bring it back to the basics\nI'ma bring it back to the basics\nI'ma get up, get on\nThat’s what I been on\nFuckin' with your mind, tryna turn shit on\nBut they want to paint me as a villain\nEven though I’m here to open their mind\nThrough the rhyme of life\nI gotta open their mind and design the right time\nTo make a decision and get in 'em like an incision\n'Cause I'ma hit 'em and give 'em livin'\nThey wonder what I’m giving, I'ma never give in\nI gotta let everybody know\nI'm in their mind right now\n\n[Chorus]\nI’ma get up in your mind right now\nMake you feel like dying right now\nI’ma make you pray to God\nTo the good old Lord for a sign right now\nTo the good old Lord\nI’ma get up in your mind right now\nMake you feel like dying right now\nI’ma make you pray to God\nTo the good old Lord for a sign right now\nTo the good old Lord\n\n[Verse 2]\nI'ma bring it back to the basics\nNobody can erase it\nPeople in the street going ape shit\nBattling depression but nobody wanna say shit\nWhy nobody wanna say:\nI been living with this everyday\nWhy nobody wanna say:\nEverything will be ok\nI'ma bring it back to the basics\nEverything will be okay\nI remember somehow, someway\nI remember somehow, someway\nI remember somehow, someway\nI remember somehow, someway\n\n[Speech]\nIt was December of 2015 in sunny Los Angeles California in the heart of Hollywood\nI stood next to my wife in a line surrounded by hundreds of other people on our way to watch Star Wars\nWhen suddenly I was engulfed with fear and panic\nAs my body began to fade\nIn this moment my mind was full of clarity\nBut my body insisted it was in danger\nI looked around and I told myself I was safe, I was fine\nBut I was convinced that something was wrong\nBefore I knew it I felt as though I was going to\nFall and fade away\nMy body grew weak\nAnd soon enough I found myself in a hospital bed being told what I went through was anxiety\nI refused to believe this story\nI searched and searched for the cause of what had happened to me\nI began to feel detached from reality\nI felt as though I was seeing the world through a glass\nI got blood work done\nAnalysis of my mind and body to no avail\nThe doctor said it was anxiety\nBut how could it be anxiety?\nHow could anxiety make me physically feel off balance?\nHow could anxiety make me feel as though I was fading from this world and on the brink of death?\nDerealization\nThe sense of being out of one’s body\nI’m not here\nI’m not me\nI’m not real\nNothing is\nNothing but this feeling of panic\nNobody understands\nNobody knows the sufferings\nThis physical feeling\nIt can’t be anxiety\nIt can’t\nOr can it?\nCan it in fact be the mind controlling the body?\nYeah, of course\nI’m so in control of my mind and my body\nBut I’m subconsciously forcing myself into a state\nOf self bondage entangled by the ropes of my own mind\nI am unhappy\nNot with life\nBut with this feeling\nI am scared, I am human, I am a man\nBut I look in the mirror and I see a child\nI am an adult who recognize grown ups don’t really know shit\nAnd they never did\nAnd it scares me\nCause now I’m just a grown up who doesn’t know shit\nBut one thing is I do know this feeling, this horrible feeling is going to kill me\nNo, no this feeling\nThis anxiety is nothing\nI have anxiety\nJust like you, the person I wrote this for\nAnd together we will overcome this feeling\nWe will remember despite the attacks and constant feeling of our mind and body being on the edge\nThat we are alive\nAnd any moments we have free of this feeling we will not take for granted\nWe will rejoice in this gift that is life\nWe will rejoice in this day that we have been given\nWe will accept our anxiety and strive for the betterment of ourselves\nStarting with mental health\nWe will accept ourselves as we are\nAnd we will be happy with the person we see in the mirror\nWe will accept ourselves\nAnd live with anxiety", "image": "https://images.genius.com/1a2c364a06d2844fd9e294ee0ea798ff.1000x1000x1.jpg"}], "artist": "Logic"}