{"songs": [{"title": "Do It", "album": null, "year": null, "lyrics": "* this track was an exclusive offer only as a Best Buy download\n\n[Intro]\n10, 9, 8, 7\n6, 5, 4, 3\n2, 1, 0, ignition\n\n[Snoop Dogg]\nGeah, uhh\nAin't nothin to it but to do it my nigga\nBigg Snoopy D-O-dub cuz\nAll up in the club, y'knowmtalkbout?\nI see you over there baby girl workin that pole gettin yo' money\nI wanna talk to you for a minute\nCause I got this new step I want you to do\nTry this shit out one time\nAnd let's see if you can pull this off\nYeah, uhh, uhh\n\n[Chorus: Snoop Dogg] + (woman)\nPut your right foot in and your left foot out\nPut yo' ass on my dick, that's what I'm talkin about\nWork a nigga 'til it feel like I'm 'bout to pass out\nNow shaaake, that's what I'm talkin about\nNow do it do it do it do it! (How you wanna do it?)\nDo it do it do it do it! (How you wanna do it?)\nDo it do it do it do it! (How you wanna do it?)\nDo it do it do it do it!! (How you wanna do it?)\n\n[Snoop Dogg]\nDon't play wit it, let me go and get it\nCause I been watchin it, scopin it, hopin it\nTryna get my hands on it, wanna make you dip\nI - wanna make you sip; I - wanna make you flip so, open it\nTip tiptoe out the back do' now meet me there\nYou can bring a buddy wit'chu bitch, I don't really care\nJust make it snappy, I know you're happy\nBut hurry up before that white bitch come and get at me\nWhen I first stepped foot all up in this place\nYou shoulda seen all the hooks that was in my face\nTalkin 'bout \"I can rap, you need to sign me up cuz\"\nDon't you know I'm in the club tryna find me some girls?\nI give a fuck if you can rap nigga, you'll get shot\nI ain't fuckin wit'chu wack niggas, so kick rocks\nAy baby boo, come and holla at my crew\nAnd bring your homegirl too, now make it do what it do (do)\n\n[Chorus]\n\n[Snoop Dogg]\nPick your money up, now pop a pose for me\nFreeze (strip!) Mm, take off your clothes for me\nMm.. you're standin there lookin good\n.. I see you stuck in the neighborhood\n.. And I can tell that the flavor's good\n.. And you should do it like I know you should (do it)\nYou's a go-getter, a real flame-spitter\nTwenty-two hoes and all of 'em came wit her\nShe the baby-sitter, with the kitty litter\nShe need a dog in her life and D-O-dub bit her\nShe's so anxious, baby had to stay around\nDon't even trip cause you rollin with a player now\nAnd we gon' do it up, until you get enough\nI'll get you drunk, take you home and then I'll beat it up\nI'll drop you off, pick it up, I need your hair done\nSo I can stick it up, dick you up, you know what's up\n\n[Chorus]", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}