{"songs": [{"title": "Must Be Bobby", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "Bo-bby.. Bo-bby.. Bo-bby..\nBo-bby..\nBo-bby.. Bo-bby.. Bo-bby..\nBo-bby.. Bo-bby.. Bo-bby.. Bo-bby..\n\n[RZA]\nPsssh. Doo-doo-doo-doo-doo-doo-doo-doo-doo! {​*Bobby Digital sound*}​\nYo.. Bobby\nYo, yo, RZA Bobby\nYo, yo, RZA Bobby\nB-Bobby, yo\nHit the bodega for a 40 ounce son, Garcia Vega\nTwo bags of chips, and one pack of Now & Laters\nFlame tucked down to my nuts, on my last buck\nOnly thing keep a nigga calm is a good fuck\nLoose-leaf cigarettes be dipped in wet\nChicken of the seas get trapped inside my net\nWith their clothes off, son when the gun goes off\nI'm bound to play Napoleon, and blow a nose off -\nYour Sphinx; your stumble rap style, your flow's off\nLike Kunta, tryin to run with his chopped toes off\nUnchallenged sword I yield the storm rider\nClip full of ruffled-tip fast-actin long fire\nFour hundred grain cartridge, with steel casin\nThose who can't draw the crowd is still tracin\nThe mic is cast to the floor and shapeshifted\nHeavy as the hammer of Thor you can't lift it\nSo tense, bitch there's no defense\nThis four-four inch'll make you jump the fence\nRight eye squinted; I speak brok-len english\nStumble off the cold four-oh of Olde English Wu brew\nTwo-two inside the shoe\nNo describin what this heat, in my jacket could do\nI teach, seeds to read, never reach for the weed indeed\nBow down to the great Bob Digi Digi\n\n(Bo-bby..) Yo, it must be Bobby\n(Bo-bby..) Oh, no, it must be Bobby\n(Bo-bby..) Oh, no, it must be Bobby\n(Bo-bby..) Oh, no, it must be..\n\nI keep rice soaked in coconut milk mixed with tofu\nSit in the sun six hours then I charge up like Goku\nDragonball Z; imagine you're raggin me\nThat's like walkin through a Blood hood flaggin a C\nNot, tryin to tell you how much weight we carry\nIt may get, every snake in the tri-state buried\nPlus, Feds had one add, sayin I gun traffed\nI sold twenty million records bitch; some laugh!\nFresh shafts of morning dew on Nancy Drew\nSherlock Holmes crime sleuth couldn't figure the Wu\nYou loaf of bread head, keep a sober head\nOne point five mill a year's my overhead\n\n(Bo-bby..) Yo, yo, it must be Bobby\n(Bo-bby..) Yo, yo, it must be Bobby\n(Bo-bby..) Oh, no, it must be Bobby\n(Bo-bby..) Yo, check, yo\n\nI keep MC's puzzled keep my dogs in the muzzle\nIce cold forty ounce drink 'em down with one guzzle\nSon might spit a word at a bird, see if she chirp back\nTall chocolate deluxe buttercup, off the meat rack\nA chickenhead scratch the yard for worms\nAnd roosters walk around with their heads in the perm\nI be spreadin knowledge keepin my third eye polished\nNever, chase for dollars to fulfill the black wallet\nYou must be Bellevue, son, I walk with twelve jewels\nAfford anything this world could sell you\nBeats that the change the style'll rearrange ya\nBZA-Bobby! I'm strikin' you like Beatlemania\n\nYo, it must be Bobby\nOh, no, it must be Bobby\nYo, son, it must be Bobby\nBZA-buh, BZA-wha', BZA-Bobby\n(Bo-bby..) Fuckin' up the mic is still my hobby\n(Bo-bby..) F-fuckin' up the mic is still my hobby\n(Bo-bby..) Yo, yo, it must be.. doo doo!\n(Bo-bby..) Yeah, yeah\n\n(Bo-bby..) - {​*repeat to fade*}​", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}