{"songs": [{"title": "Good Girls, Bad Guys", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "[Dyme]\nWhy do good girls (what what what) like bad guys?\n\n[DMX]\nHey yo Boo, why do (good girls) like bad guys?\nKnowin that bad guys tell mad lies?\n(And why do) dog niggas (want a honey wit class?)\n(Sometimes you want more than just a honey wit ass)\n\n[DMX]\nUh, uh\nHey yo, who would ever think that the two would go good\nMidtown honey, nigga from the hood\nBut knock on wood, I got this bitch (what?) excuse me\nShe don't like to be called a bitch, try not to lose me\nThe rules we go by, where I'm from, she don't know\nWhen I say I'm goin around the way, she won't go\n(Hell no) C'mon baby, you aight with me\nTryin to get you, to spend the whole night with me\n(But I'm a good girl) Uhh, that's why I like her\nCouldn't treat her like a hoodrat, didn't bite her\nTurn a church girl to a straight Ruff Ryder\nTake her to the Ramada make it an all nighter\n(Oh no, I only go to the Swiss hotel)\nFuckin with me? I have you in the back of the Chevelle\nLike what (what) hittin it raw dogg in the butt\nYou was good this mornin, but tonight you a slut\n\nChorus: DMX (Dyme)\n\nWhy do (good girls) like bad guys\nKnowin that bad guys tell mad lies?\n(And why do) dog niggas (want a honey wit class?)\n(Sometimes you want more than just a honey wit ass)\nHey yo Boo, why do (good girls) like bad guys\nKnowin that bad guys tell mad lies?\n(Then why do) dog niggas (want a honey wit class?)\n(Sometimes you want more than just a honey wit ass)\n\n[Dyme]\nHey yo Boo, I'm diggin you, cause you make me wanna do\nAll them things I was taught I wasn't supposed to\nI'm secure, keep it tight while you on tour\n(You fuckin wit a dog!) That's why I'm feelin you more\nAttractive to me, wit yo' tactics\nHit it like AHHH! Make me backflip\n(You been tryin to act, rich, that's why I taxed you\nAnd I just got married) Hell, but I ain't even ask you\n(I'm just tellin you, cause nowadays, bitches be flippin)\nOne more bitch, I'm skippin (Damn girl, stop trippin)\nCause you be actin like\n(Listen, I ain't always talkin money\nBut I will keep you wit a smile, and walkin funny\nSo what's it gon' be?) Yo, what you mean? (What to do?\nYou want the nigga wit the slacks, or the jeans and the boots?\nYou wanna be safe or be laced, cause you can be replaced)\nYeah, you can be erased\n(Don't get slapped, babyface)\n\nChorus\n\n[DMX]\nMan, I got shorty stayin out late (Well I keep him wit a cut\nAnd his nails stay clean) At least I get a nut\nAnd I got honey rebellin (And I stopped him from sellin)\nI be gettin away with murder, right? (shit, I ain't tellin)\nStraight out the hood (yeah, nigga you get mushy)\nI got honey suckin dick (and I got you eatin pussy)\nI can be good in a bad way (I can be bad in a good way)\nGirl, you ain't the same dog (that's what them rats in the hood say\nOr would say, if you was around them more often)\nI got honey smokin weed (it be havin me coughin)\nShe keep the dog on the leash (when we walk in the streets)\nAnd if y'all think it's sweet (then the dog's off the leash\nNow I don't want no drama, wit no baby's mama\nI might be a good girl, but I keeps the armor)\nGirl, you off the hook, but at least now I know why\nGood girls like bad guys\n\nChorus\n\n[Dyme]\nWhy do good girls (what what what) like bad guys?\nWhy do good girls (what what what) like bad guys?\nWhy do good girls (what what what) like bad guys?\nWhy do good girls (what what what) like bad guys?\nUhh, uhh\nC'mon, yeah, I like that\nC'mon, wha wha what\nYeah yeah, DMX\nDyme, baby girl\nRuff Ryder, uhh, yeah..", "image": "https://images.genius.com/57efb548310ed90e73d9200fd01a3e59.630x630x1.jpg"}], "artist": "DMX"}