{"songs": [{"title": "Yeah Ya Know (Takers)", "album": "Fuck A Mixtape", "year": "2010-06-01", "lyrics": "[Intro]\nDamn, has it been that long? (haha)\nSay what happens since I been gone\nThey got the game all wrong, it's too pretty in here\nLet's say we take it back to the trap one time\n\n[Hook]\nI went from rolling wit' dem rocks on the block\nTo controlling my position at the top\nOf every chart and I will not, stop\n(We ride, and we roll, and you stop) Yeah we go, yeah we go\n(hey, hey, hey)\nYea you know, yea you know, yea you know, yea you know\nYea you know, yea you know\nGirl we ride, man we roll, and you stop\nAnd we go, and we go\n\n[Verse 1]\nIn the middle of a fight, I'm so cool\nEverybody wonder how I go through\nAll of this half of which would have broke you\nCame out smelling like a rose even more true\nWorldwide, bi-coastal, global, nigga's I respect\nCause they more more closer\nCause I get it don't mean they do too\nCause I ain't got a damn minute ain't no 'tude\nYou know we never not goin all in\nKickin doors over just to let my dogs in\nSo many rides never catch a nigga walkin'\nIn a G-5 tryna fit a bunch of broads in\nThen we landin' laughin'. chicks with fantastic asses\nExtravagant habitats, if you never seen tragic happen (hey)\n\nMake magic happen with cash I'm actually catchin magic\nIn the market for lavish mansions 'n NBA expansions\nI was passin out Phantoms in 04 so no, dough ain't shit to me\nWay past respect you see, but a nigga ain't even half as big as he finna be\n\n[Hook]\nI went from rolling wit' dem rocks on the block\nTo controlling my position at the top\nOf every chart I will not, stop\n(We ride, and we roll, man you stop) Yeah we go, yeah we go\n(hey, hey, hey)\n(yea you know, yea you know, yea you know, yea you know\nYea you know, yea you know)\nGirl we ride, man we roll, and you stop\nAnd we go, and we go (go)\n\n[Verse 2]\nSo fly why would I wanna land for\nEverything you could ask for and more\nYour choice, you could even be a fan or\nHate to see a nigga get a hundred grand more\nBein' a motherfuckin' man, won't stand for\nThe rap wars, always goin' back and forth\nNip it in the bud kill it like cancer\nBut when it rains, then it pours give a damn sure\nIn France, bonjour, merci, oui\nThe same people on tour, on TV\nThey signed him shoulda kept your reciept\nGet a refund cause you sure can't see me\nWho keeps CD's on repeat, stuck in MP3's for 3 weeks\nAt the gates on the day I was released\nThe only time you will ever see me free\n\n[Bridge]\nBig money J, much as you can get for it?\nAtlantic records say just make another hit for me\nI tell 'em cut a hundred million dollar check for me\nLike it or not, don't lose no respect for me\nNever mind what I did, cause the best commin'\nI'm the king in a game like chess to me\nSo put the cash in tha bag\nGive the rest to the attendant puttin' gas in the jet for a homie friend\n\n[Hook]\nI went from rolling wit' dem rocks on the block\nTo controlling my position at the top\nOf every chart I will not, stop\n(We ride, and we roll, man you stop) Yeah we go, yeah we go\n(hey, hey, hey)\n(yea you know, yea you know, yea you know, yea you know\nYea you know, yea you know)\nGirl we ride, man we roll, and you stop\nAnd we go, and we go (go)\n\n[Verse 3]\nI got a new swag and it's a new day\nHere we go again too, what it do 'J?\nIf you recall, I was the one who used to move yay\nNow I gotta new Audemar with a blue face\nHoppin' up in G4 jet, no suitcase, whole new wardrobe in a new place\nChange clothes if a stain on my shoelace\nT.I. roll like sushi, touché\nIf the king ain't back, who the hell am I?\nBringin' homocide to the gang, no alibi\nCan't tell a lie to the judge, I'm guilty\nYour Honor do you mind the guy tried to kill me\nI could still be, in a trap now\nAK 'round, little yay 'round\n100k downstairs by the trey pound\nBut if they wonderin who runnin the A now?\n\n[Hook]\n(Yea you know, yea you know, yea you know, yea you know\nYea you know, yea you know)\nGirl we ride, man we roll, and you stop\nAnd we go, and we go (go)\n\nYeah you know that we ride\nIn control we don't stop\nWe gon blow where we drop\nLet you know we on top\nGirl we ride, man we roll, then you stop\nAnd we go, and we go\nSay we roll and we ride\nIn control we don't stop\nWe gon' blow where we drop\nLet you know we on top\nGirl we ride, man we roll, then you stop\nAnd we go, and we go\n\n[Outro - T.I. - talking]\nPrison ain't change me, it made me worse, right Pop?\nIf I want it, I'm a come get it\nI ain't askin for it, I'm a take it\nWe takers!", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg"}], "artist": "T.I."}