{"songs": [{"title": "Get Out", "album": "The Last of a Dying Breed", "year": "2000-10-03", "lyrics": "[Intro: Scarface]\nC'mon\nYeah\nFace Mob\nUh huh, uh huh uh\nHis name is Jigga\nYeah\nWhat's happenin baby\nWassup, wassup witcha?\nTryin to get this loot\nYeah\nKnowwhatimsayin?\nNo doubt\n\n[Verse One: Scarface & Jay-Z]\nSo what's it gon' be? Women? Whiskey? Weed?\nDope, coke, or all the guns you need, nigga\nYou could get them thangs for a lesser fee\nYeah, and with the right amount of pressure\nThem thangs look free\nI'm on my way now, desperate need of a lick indeed\nBelieve I got a vick if it's a brick you need\nMy nigga, for sheez! Right back at you\nHolla after you land we get it before you leave\nIs you for sure? Them niggas out there still got cheese\n'Cause my niggas in the drop bounced back to slanging OZs\nMan, them niggas raping the town without breaking 'em down\nThem bastards making a killing, slanging half our buildings\nFor real, man, I'm on my last nine thousand\nAin't got no money, I'm fighting cases with this ho money\n\n[Chorus: Jay-Z]\nAnd when the money get low and the hungriness show\nNiggas better get the fuck out the house\nAnd when the money get low and the hungriness show\nNiggas better get the fuck out the house\nAnd when the money get low and the hungriness show\nNiggas better get the fuck out the house\n\n[Verse Two: Scarface & Jay-Z]\nI caught a northwest flight to NY, on the buddy pass\nSitting at the exit row, by the door\nI got a hoopty from this doofy nigga around the way\nI had the four-four under the rug, weekend ago\nThree hours, I landed in the city of dreams\nWith tall buildings, flooded with cabs and limousines\nWhere the fuck is Jay-Z?\nGoddamn, traffic is getting on my nerve\nI seen 'Face by the curb\n\n[Dialogue Break: Scarface & Jay-Z]\nGoddamn, dog! I been sittin here thirty minutes!\nMan, you know these motherfucking cab drivers. Like they own this motherfucker\nOpen the trunk. Damn!\nOpen this motherfucker\nIll! And then I'm thinking...\n\n[Verse Two (Cont'd): Scarface & Jay-Z]\nJigga, let's get this motherfucking cash, nigga\nWell, if it's a money thing\nLet's get this motherfucking money, man\nAnd then I said to Jigga\nLet's get this motherfucking cash, nigga\nI got a dope house scoped out\nAn escape route? No doubt\nLet's hit the highway; load up, lock\nLet's do this shit! Hold up, cops\nYou tripping! It's eight million stories in this naked motherfucker\nYeah, and ten million undercovers\nWe gon' get this raw, we gon' kick in the door\nThey got guns in the couch, they got shit in the floor\nNiggas is gon' shit they drawers!\nThey got a bitch at the door\nBullshit, heard that stupid shit before\n\n[Chorus: Jay-Z]\nAnd when the money get low and the hungriness show\nNiggas better get the fuck out the house\nAnd when the money get low and the hungriness show\nNiggas better get the fuck out the house\nAnd when the money get low and the hungriness show\nNiggas better get the fuck out the house\n\n[Verse Three: Scarface & Jay-Z]\nI hit the buzzer: \"Míra, Manny!\nLet me up! It's Joey, motherfucker!\"\nTaking the steps up with only one thing on our minds\nWipe this motherfucker clean, everybody gotta die\nAs the steps got closer, the voices got louder, you hear it?\nDeath's approaching, we coming for that powder\nThen I knocked four times, I hit the ho with clear polish\nWell, she couldn't see shit, now what's it gonna be, bitch?", "image": "https://images.genius.com/2361572b4ea20d3eff0b970b4f5f5a1e.1000x1000x1.jpg"}], "artist": "Scarface"}