{"songs": [{"title": "Niggas", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Hook]\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\n[Verse 1]\nBack up chump, you know Biggie Smalls rips it quick\nAnd kicks it quick; you know how black niggas get\nWith the hoods, fatigues with the boots with trees\nSmokin weed, flippin ki's, making crazy G's\nHitting buckshots at niggas that open spots\nOn the avenue--take my loot, and I'm bagging you\nPimping hoes that drive Volvos and Rodeos\nFlash the roll, make her wet in her pantyhose\nDamn, a nigga's style is unorthodox\nGrip the Glock, when I walk down the crowded blocks\nJust in case a nigga want to act out\nI just black out, and blow they motherfucking back out\nThat's a real nigga for ya\n\n[Hook]\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\n[Verse 2]\nWhen we smoke spliffs, we pack four-fifths\nJust in case Dread want to riff\nHe get a free lift to the cemetary, rough very\nNot your ordinary: we watch you get buried\nThat's a real nigga for ya\nGet mad, do a quarter, flip the script, and rip your lawyer\nSpit at the DA, cause fuck what she say\nShe don't give a fuck about your ass anyway\nUp north, bound first stop for the town\nOf Fishkill, where the hand skills are real ill\nYou'll be a super Hoover doo-doo stain remover\nHa-Hah! Yo G, pass the buddha\n\n[Hook]\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\n[Hook]\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\n[Verse 3]\nMoney, hoes, and clothes\nBlunt smoke coming out the nose, is all a nigga knows\nFlipping on foes, putting tags on toes\nWatching the stash grow, clocking the cashflow\nThe neighborhood gravedigger\nGetting paid so much, all the bitches want to see a nigga\nI guess they figure I'm paid, I want to get laid\nOr since I got loot, I want to knock boots\nI'd rather beat my dick than trick\nAnd if she don't suck, then we don't fuck\nI'd rather make a buck, drive a fat-ass truck\nGrab the 9, two clips, and run amuck\nYes, flex after two or three Becks\nAs I wreck shit, what the fuck you expected?\nA fly guy? Well fuck it, I'm the high guy\nFrom Bed-Stuy, putting the swelling on your eye\nAnd your nose even; when I choke ya, you stop breathing\nAnd when Jake come, I'm leaving\n\n[Hook]\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (Niggas!)\nTo all my Bronx (Niggas!)\nTo all my Queensbridge (Niggas!)\n(Nigga, nigga, nigga, nigga!)\n\n[Outro]\n[Operator]\nThe hotel guest you have called is unavailable\nYou may leave a private recorded message at the tone or press zero and a hotel operator will assist you\nYou may start your message now, press zero to return to the attendant\n\n[Too $hort]\nAyo B.I.G., what's up, man? It's $hort, man\nHeard you in Miami, boy, give me a call\nI got some, bitches, man; I got eight bitches\nI got some chronic, I got the keys to Luke's crib, nigga That nigga ain't gonna be here for two weeks\nHit me up, dude; hit me up\nIt's $hort, man; it's Short\nHolla at me, a'ight", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}