{"songs": [{"title": "Don’t Believe ’Em", "album": "Back on My B.S.", "year": "2009-05-19", "lyrics": "[Intro: Akon (T.I.)]\nWhen they tell you that you'll never get over (ha ha ha)\nJust tell 'em they're number one (el capitan partner)\nYou're a champion (yeah, the Ali of my day, you know me)\nDon't believe 'em when they try to say it's over!\n(I can't hear ya, I'm way up here, what you say?)\nJust tell 'em they're number one (it's over for who, numero uno partner)\nYou're a champion (ha ha ha, let's go Bust!)\n\n[Verse One: Busta Rhymes]\nNow, there's, nothing you can do to stop a nigga from within\nWith the hunger of a lion I secure another win (hey!)\nSo passionate, you might even misinterpret it as arrogant\nI'm going in (hey!)\nI'mma make the world feel my pain\nWhile I'm showing you my muscle and I hustle through the game\nAnd even though they leave us in the hood like we ain't SHIT\nWe ain't got nothing but everything to gain\nLook, even if a motherfucker try to pop me\nI'm so blessed - do anything that you could do to stop me (Stop me)\nNow I'm climbing up the ladder and I'm jumping at the top\nYou might wanna call me - Rocky\nSee there's more of us - Ugly\nYou don't really wanna war with us - Trust me\nSo glorious, that we from the bottom\nStill we victorious - Hug me\n\n[Hook: Akon (Busta Rhymes)]\nI see it in your eyes, it ain't hard to tell\nThey're watching you (can't nobody ever stop what I'm doing)\nThey just telling you lies, they want you to fail\nThey're plotting on you (and they can never stop my movement!)\nSo, don't believe 'em when they try to say it's over\n(You know exactly what to tell 'em!)\nJust tell 'em they're number one (number one)\nYou're a champion!\n\n[Verse 2: T.I.]\nHey, see the websites lying trying to block my shine\nDon't you know you never will stop my grind?\nIn a drop-top flying like I don't got time\nGot everybody surprised that I won't drop dimes\nWhat's on yo' mind? Best get me off it\nAt least quit lying if you must keep talking\nGo on with the nonsense, best keep walking\nBoy how you sue us, send the lawyers to the office\nA lot of y'all got sprung like that shorty\nCouple months off, I'll be right back shorty\nWith a brand new swag and a brand new .40\nAnd a brand new ride, give a damn who saw it\nNation-wide news, nigga yeah you saw it\nShorty need a bodyguard for his bodyguard, don't he?\nTip falling off sound kinda odd, don't it?\nY'all hate to see me ball? Take it up with God homie\n\n[Hook: Akon]\n\n[Verse 3: Busta Rhymes]\nAny situation where you might get fed up\nGotta stay focused, homie keep your head up\nIt don't really matter what the next one is doing\nHomie gotta handle your business and then you better step up\nLive to the fullest for the dream you're pursuing\nAin't nothing in the work gon' really stop what you're doing (Oh!)\nGo hard no matter what they be saying\nNigga don't quit cause you know we gotta keep it moving (Oh!)\nTake a look and see yourself in me\nCause it's all about we (We)\nMe and you securing a win together\nSo we could be the best that we could ever be (Oh!)\nStay up on your grind, be the first one to - Set it\nPeople try to shut me down, I won't - Let it\nI'm so stubborn for the success\nYou know my motto, don't stop, get it, get it!\n\n[Hook: Akon]\n\n[Akon]\nTell 'em they're number one [repeat to fade]", "image": "https://images.genius.com/39d2d4f1bba15212af6b346af49c7ff2.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}