{"songs": [{"title": "Don’t Call Tasha", "album": "Free Agents - The Murda Mixtape", "year": null, "lyrics": "[Havoc]\nWon't stop 'til the casket drop\nThe shit don't pop, better believe I have that work on the block\nWith my left on the hammer, the other on a knot\nNiggas wanna scheme and plot, shit - this all I got\nPull his ass out the drop - nigga we ain't playin witchu hoes\nLet the heat blow, nigga just eat those\nAnd I don't give a fuck, nigga go get your peoples\nNigga, I ring your girl bell and blast through the peephole\nHere's how I put that ass in a sleep hold\nTwenty-four/seven in creep mode, nigga you ain't safe\nFuck your girl in the face while your lame ass tuggin her\nNow she sex like a porno chick, way I was pluggin her\nSeven to the max, know I broke the governor\nBitch got a fetish for me? You still in love with her\nDawg I had that all, so I only want some of her\nWhen she finish pity(?) talkin motherfuck her, I'm done with her\nBitch\n\n\"Call Tasha again, and I'mma kill you myself - you hear me dawg?\nI don't play, I ain't with really with this phone shit;\nJust the only way I could get at you - don't call Tasha back\"\n\n[Prodigy] That's how we do that shit, it's like this\n\n\"You heard me? Don't call her back... don't don't don't do it\"\n\n[Prodigy]\nAiyyo, yo (\"Huh? Straight up\")\nThis shit in pocket baby\nWe stitchin this shit up, you just follow us\nWe hold the streets up - you couldn't beat us with hammers\nWe got retarded strength\n.. and we ain't runnin for nothin\n'cept for the escape after we push them gun buttons\n(Pa-pow!) Now you gettin out the way\nShots poppin out the Ace leave people's shit swollen\nIt's my style to flip\nNiggas is bogus, we come through and shut down the set\nYo Hav' - it's our time my nigga\nOur music grab these niggas and show 'em how it's did\nMulti-million dollar mobsters\n300,000 dollar cars and hit the streets if you want to\n(Ay nigga) And still keep it thug too\nYou couldn't pull us out the streets, we got deep roots {*echoes*}", "image": "https://images.genius.com/8a94d4d15bcdf43ddb8ce2cdbfde357c.455x455x1.jpg"}], "artist": "Mobb Deep"}