{"songs": [{"title": "Biscuits", "album": "Tical", "year": "1994-11-15", "lyrics": "[Intro]\nWhat? What you want?\nRepresent represent represent\nYeah, represent, check it out check it out\n\n[Hook]\nYo mama don't wear no drawers!\nI saw her when she took them off!\nStanding on the welfare line\nEating swine trying to look fine, with her stank behind\nYou can ask the bitch and she'll tell ya fast\nMeth-Tical got STYLE with his nasty ass\n\n[Verse 1]\nAre you ready, to face the consequences and suffer?\nI even tell ya momma you ain't shit, motherfucker\nBring it, and let that killer bee kid sting it\nAnd rep-resent, it's like heads up a brick, when I swing it\nGet lost, I break you off something\nI'm pumping, like a Reebok, with a pump\nFrom the jump and, you was nothing\nBet you thought you fucking clan had ya back but they was fronting\nSmoking dirt blunts and fucking nasty sluts and\nYou just a naked gun without the bullet, what you busting\nGet your ship sunken, fucking with a drunken\nMaster disaster at any rap functions\n\n[Interlude]\nJust an echo, yoo-hoo\nWe be living in the valley yoo-hoo\nIt may be difficult to bring back\nSweet memories of you\nAnd you can even ask your crew\nBet your bottom dollar that they tell ya fast\nMeth-Tical got STYLE with his nasty ass\n\n[Verse 2]\nWho said the Wu-Tang Clan? Was it you or your man?\nYou wanna point the finger, I'll bring ya\n36 chambers, be out, you'se in danger\nLet me pull your brain out your ass with a hanger\nDidn't momma tell ya not to talk to a stranger?\nNow ya got ya neck, in the noose, of the strangler\nJust recline, keep the Meth in mind\nI'll even test the knuckle check on the hands of time\nWhat? And I'll be more than glad to bust that ass\nAll up and down the block, the street, that ave\nWhatever, smoking on a Spike Lee joint\nHey I'm Mo' Better, I'm hoping niggas get the point\nCause they could never, stop the veteran, word to God\nWhen I'm severing the head of a mental vegetarian\nThe Method, at the weed gate, with a long line of credit\nIf you desire fire, I be the first to set it\nOff, flame on like the Human Torch\nFantastic Four for all the fans in the store\nYou can eat it all and it'll tell you fast\nMeth-Tical got STYLE for your nasty ass\n\n[Outro]\n94 baby, word up, recognize, recognize\nWu-Tang killer bee\nThe RZA and the Method MZA\nRaider Ruckus, where you at?", "image": "https://images.genius.com/e8eea98eab886487258b11bd4e1cca4b.1000x1000x1.jpg"}], "artist": "Method Man"}