{"songs": [{"title": "Respect My Conglomerate (Remix)", "album": "The Last Kiss", "year": "2009-04-04", "lyrics": "[Intro: Busta Rhymes]\nMost people would consider this illegal\n\n[Hook]\nSince we are the best and you agree with me right?\nNo need to debate the way we run shit\nSee were kind of like the government\nSo just repect my conglomerate\nJust respect my conglomerate\nJust respect my conglomerate\nJust respect my conglomerate\nJust respect my conglomerate\n\n[Busta Rhymes]\nIt's Bus Rhymes!!!! (HUH!) And I'm back\nWith the crack, and the thugs, and the drugs, NIGGA BLACK!!!! (OH!!!!)\nThe best to do it we only deal with the facts bitch\nBlazin that I'm so amazin on the tracks BITCH!!!!!!\n(BOUNCE ON 'EM!!!!) And I jump, and I skip\nAnd I hop, and I flip over niggas like gymnastics (HEY!)\nWatch the way and I'm givin the streets acid\nBastards niggas know I'm the king of the classics\nDrastic measures, I'm spreadin like a rash bitch\nClass is in session you 'bout to get yo' ass kicked\nEmperor, of every roundtable of the house\n(AND WHEN I SPEAK) Niggas respect me as leader of the councilman\nGod rap, God persona, God scrilla (HUH!)\nGod body in the flesh call me GODZILLA!!!!\nNow you know you see we be the most prominent\nDominant niggas respect my conglomerate (AHHHHHHHH!!!!!!)\n\n[Hook]\n\n[Young Jeezy]\nYeaaaaah! I try to tell 'em homie\nYo Bus', watch my moves yo...\n\nI tell 'em, \"Hol' up, swoll' up, ya ain't see us rollin up\"\nSee them broads froze up, soon do's open up\nHey ladies, you likin what ya see?\n+American Gangster+, my strap's European\n(YO!!) Came wit a scope, got a Navy feel\nSo I can ambush niggas like the Navy Seals\nMy defensive line lookin like some linebackers\nMost six cars, the other hal - CARJACKERRRRS!!!\nBallers wit them thangs, yeah we call 'em contractors\nAnd if ya in-boys right, then they might contract ya (HA-HAAAAAH!!!)\n40 cal lookin sweet on them honeycomb seats\nJust like Cassie, my Sean John freak\nGet you what ya want, just not that deep\nYet thirteen'll split, got them A-Rod seats\nTwo for the Madonna, the A-Rod freak\nYou know I brought the whole, so we A-Rod deep\n\n[Hook]\n\n[Jadakiss]\nUh-huh... uh-uh! Yeah\nEh-HAEH!!! Ha-HAEEEH!! HA-HAEEEH!!\nYeah, uh, yeah, yo..\n\nWorkers, bosses, Ferraris, Porches\nDope fiends nauseous, crack spot\nRace track, horses, big meetings at the\nRound table, to discuss what the cost is\nMoney, change you, devils, angels\nWe the ones who say what you can and what you cain't do\nRespect, power, kush, sour\nHaze, airy, pills, powder\nGangstas, varmints, ice, garments\nDon shit, real niggas who I get it on wit\nWhen I'm around, my colleagues ain't comfortable\nThey all got a-sick with my verses for a month or two\n(Uh) Yep - wrong nigga to have a problem with\nThe blade first, then the bullet gon' follow it\nYeah, if you lucky, I might hollow it\nD-Block, just respect my conglomerate\n\n[Hook]", "image": "https://images.genius.com/74f6cb8e37420dc73fd4019537e3cbd1.953x953x1.jpg"}], "artist": "Jadakiss"}