{"songs": [{"title": "My Fault", "album": "The Slim Shady LP", "year": "1999-02-23", "lyrics": "[Chorus]\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Verse 1]\nI went to John's rave with Ron and Dave\nAnd met a new wave blonde babe with half of her head shaved\nA nurse aid who came to get laid and tied up\nWith first aid tape and raped on the first date (Ooh)\nSusan, an ex-heroin addict who just stopped usin'\nWho love booze and alternative music (What up?)\nTold me she was going back into usin' again (Nah)\nI said, \"Wait, first try this hallucinogen\nIt's better than heroin, Henn, the booze and the gin\nC'mere, let's go in here, who's in the den?\"\n\"It's me and Kelly!\"\n\"My bad\" (Sorry)\n\"Let's try another room\"\n\"I don't trust you\"\n\"Shut up, slut, chew up this mushroom\nThis'll help you get in touch with your roots\nWe'll get barefoot, butt-naked, and run in the woods\"\n\"Oh hell, I might as well try 'em, this party is so drab\"\n\"Oh dag\" (Mmm)\n\"I ain't mean for you to eat the whole bag\"\n\"Huh?\"\n\n[Chorus]\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault (I'm sorry)\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Verse 2]\n\"Yo, Sue\"\n\"Get away from me, I don't know you\"\n\"Oh shoot, she's trippin'\"\n\"I need to go puke\" (Blehh)\n\"I wasn't tryna turn this into somethin' major\nI just wanted to make you appreciate nature\nSusan, stop crying, I don't hate ya\nThe world's not against you, I'm sorry your father raped ya\nSo what you had your little coochie in your dad's mouth?\nThat ain't no reason to start wiggin' and spaz out (Nah)\"\nShe said, \"Help me, I think I'm havin' a seizure\"\nI said, \"I'm high too, bitch, quit grabbin' my T-shirt (Let go)\nWould you calm down? You're startin' to scare me\"\nShe said, \"I'm 26 years old and I'm not married\nI don't even have any kids and I can't cook\"\n\"(Hello) I'm over here, Sue (Hi)\nYou're talking to the plant, look\nWe need to get to a hospital 'fore it's too late\n'Cause I never seen no one eat as many 'shrooms as you ate\"\n\n[Chorus]\nI never meant to give you mushrooms, girl (Whoops)\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault (It's an accident)\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Verse 3]\n\"Susan, wait, where you goin'? You better be careful\"\n\"Leave me alone, dad, I'm sick of gettin' my hair pulled\"\n\"I'm not your dad, quit trying to swallow your tongue\nWant some gum? Put down the scissors\n'Fore you do something dumb\nI'll be right back, just chill, baby, please?\nI gotta go find Dave, he's the one who gave me these\n(I'ma kill him)\nJohn, where's Dave at? Before I bash you\"\n\"He's in the bathroom, I think he's takin' a crap, dude\"\n\"Dave, pull up your pants, we need an ambulance\nThere's a girl upstairs talking to plants, choppin' her hair off\nAnd there's only two days left of Spring Break\nHow long do these things take to wear off?\"\n\"Well, it depends on how many you had\"\n\"I took three, she ate the other 22 caps\nNow she's upstairs cryin' out her eyeballs, drinking Lysol\"\n\"She's gonna die, dude\"\n\"I know and it's my fault\"\n\"Oh my God\"\n\n[Chorus]\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world (I'm sorry)\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault (What do I do?)\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Outro]\nMy God, I'm so sorry, I'm so sorry\nSusan, please wake up, please\nPlease wake up, what are you doing?!\nYou're not dead, you're not dead\nI know you're not dead\nWake up, Susan, wake up\nOh my God", "image": "https://images.genius.com/18fd7ff1ba2db7ae16a26498fc58bb64.600x600x1.png"}], "artist": "Eminem"}