{"songs": [{"title": "Still Blowin", "album": "Still Blowin’", "year": null, "lyrics": "[Intro]\nBeitch!\nYeah I still smoke\nStill blowin\n\n[Too $hort]\nI don't need navigation, I know where to go\n85 on the highway blowin the 'dro\nMove out the way if you goin too slow\nMy dick's in her mouth, let a hoe be a hoe\nCause I flip 'em like pancakes\nI smoke weed like Scoot and Band-Aid\nComin back, from Humboldt County\nAll I blow is kush, I don't want no brown weed\nSo light it up, let's get it on\nI smoked a lot of purp but that shit is strong\nYou can buy it on the turf, that's whassup\nBut niggas like me hit the cannabis club\n\n[Chorus: repeat 2X]\nI only shop at the weed store\nSmoked it all up now I need some more\nThat's what I do - what you ain't knowin?\nI got/bought some O.G. kush and I'm still blowin\n\n[Too $hort]\nAin't nuthin changed I'm still blowin the purp\nRidin in my car, goin to work\nMy clothes are wreakin, but fuck the smell!\nYou can say what you want nigga I cain't tell\nI smoke half on the way, the other half later\nReceptionist flirtin with me, I don't wanna date her\nI just wanna hit, and sleep with the slut\nWe can smoke and fuck but don't keep in touch\nShe got a sexy body, yeah she's a hottie\nShe's a nymphomaniac, nasty and naughty\nI'm wit'chu girl, if you say so\nShe gave me a massage and I gave her a facial\n\n[Chorus]\n[Too $hort]\nI just spent 28 days in rehab\nWeed and alcohol, I need it bad\nShit won't help - I've quit before\nDidn't take too long for me to hit some more\nI used to smoke Newports but I had to stop\nI even used to smoke my weed with rocks\nMy square girlfriends said I need to stop\nBut I'm hooked on weed like it's hop, bitch!\nAnd I don't need no poppy seed\nNo coca leaf, or no PCP\nAll I need is some good-ass weed\nKeep the styrofoam cup, you can have that E\n\n[Chorus - first half only]\n[Too $hort]\nDon't be mad at me\nCause you a stupid motherfucker you don't have to be\nFuck the peer pressure - what you ain't knowin?\nYou can do you Mr. Kush and keep blowin\nBeotch!\n\nStill blowin\nGot that O.G. kush\nYeah man we ain't never gon' stop smokin\nRoll another, roll that shit up\nNothin but the best baby, in California\nBay Area, nothin but pimp\nAll the way to East Oakland\nWhassup Bay Area?", "image": "https://images.genius.com/cbce7a2bf9547c73552eb8d05ea5f8b2.700x700x1.jpg"}], "artist": "Too $hort"}