{"songs": [{"title": "LAW (LoveAllWays)", "album": "DROGAS Light", "year": "2017-02-10", "lyrics": "[Hook: SimonSayz]\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\n\n[Verse 1: Lupe Fiasco]\nI don’t wanna be here by myself\nBut I’m just like you, and you don’t wanna be here by yourself\nWanna put my name on it, but don’t wanna end the friendship\n'Cause that’s a declaration, of independence\nWould you lie for it? Would you die for it?\nPut fireworks all inside of that sky for it?\nWould you wait for me, then get away from me?\nWait ‘til I come outside, hop inside the ride and floor it\nTell her, she’ll be safe with me\nTo the tellers in the safe with me\nWhen the shootin' starts, don’t go with them\nYou should stay with me\n'Cause in the race of hearts, that’s the place to be\n'Cause the finish line is exactly where you start\nSo I’ll run around this whole bitch, just to end up where you are\nNow that’s real shit, treadmill shit\nI’m Treadstone but I feel shit\nThat’s Bourne knowledge, yes you are, you just gon' have to believe\nThat we 'bout to go to work so these niggas gon' have to leave\n\n[Hook: SIMON SAYZ]\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\n\n[Verse 2: Lupe Fiasco]\nNow you all business, started up yourself a small business\nAnd we all in this, no half-steppin', we high heel\nAll inches, high yield, small interest, hell yeah\nThat’s a loan and we owe some\nBut we pay the bank back out the same sack, same money we just stole from\nThat’s real, that’s a steal\nLike four to two, I look forward to you, lookin' down on the field\nAnd you look 4'2\", look forward boo, don’t look down at your heels\nDon't matter what's at stake, just let it burn, don't e'en look down at your grill\nEither way we gon' ball, look around at your wheels\nEven the baby gon' ball, look around at your wheels\nThis ain't my shit, this our shit\nLook around what you build and that's great and shape\nAnd you should look inside how you feel\nYou look and sound like you trill, you look inside for that feel\nOr just look and sound how I look and sound\n'Cause I look and sound like I kill niggas\nAnd you just gon' have to believe\nAnd babe, I'm 'bout to go to work so these niggas gon' have to leave\n\n[Hook: SIMON SAYZ]\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\n\n[Verse 3: Lupe Fiasco]\nShe don't want no soft nigga, she just don't want no false nigga\nDaddy can be a gangsta, just can't be no lost nigga\nIf you a senior, be a senior\nDon't be runnin' 'round like some frosh niggas\nSnapback is great, but you're 'bout to graduate\nTake your hat off nigga\nTiger did 'cause Tiger could\nBut if Tiger couldn't then Tiger wouldn't\nThat's a billion dollars off golf, nigga\nShe my fast money, my cash money, take a loss with her\nAnd let's move slow and make a million dollars off cough syrup\n\n[Hook: SIMON SAYZ]\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?\nI just wanna be here alone, alone\nWith you, with you, with you, with you, with you\nTell me, how do you feel?", "image": "https://images.rapgenius.com/7653687854fa6f0a23697baf50a07668.500x500x1.jpg"}], "artist": "Lupe Fiasco"}