{"songs": [{"title": "Big Bad Wolf", "album": "Dedication 6: Reloaded", "year": "2018-01-23", "lyrics": "[Intro: DJ Drama & Lil Wayne]\nI'ma just say this shit right here\nThe greatest mixtape series of all time\nUh-uh-uh-mmmm\nCare to debate me?\nYeah, yeah, yeah, yeah, sick shit\nI thought so\n\n[Verse]\nKeep that shit on Twitter, y'all ain't lit, y'all litter\nKeep that shit in your shitter, or eat that shit, don't spit up, rrr!\nKeep my bad bitch did up, keep my main bitch put up\nWatchin' me do push-ups\nShe was playin' with herself and I looked up, damn\nYour thot need to get her look up, uh\nYou're plottin' on me, my foot up, uh\nYour squad ain't hard, that's cushion, uh\nThat ain't sauce, that's puddin', uh\nTunechi across her bosom, damn\nShootin' up the jurors, damn\nDon't name my pistol, I named the trigger\nBenjamin Button, push him, bam!\nY'all just pussy, get buried together and let 'em play footsie\nY'all just wussy, I got some bullies gon' pull up in hoodies\nAnd come take a look-see, better play hooky\nI got some hookers hookin' up with politicans\nAnd some athletes, and some college niggas\nSend your missus on all kind of missions\nI'm the sickest nigga skippin' doctors visits\nBut my pots is pissy, smokin' hockey sticky\nPut a stockin' on my face and hit a lick and\nWhen the shit get ugly, I go Pretty Ricky\nI don't fuck with rats, neither Minnie, Mickey\nI don't fuck with cops, that's the piggly-wiggly\nFuck my bitch's friends, and they friendly-friendly\nWhile your bitch givin' me her twenty-twenty\nLike she tired of Mickey-D's, Wendy's, Denny's\nLike she tired of Macy's, JC Penney's\nI got bitches gettin' tired of spendin', spend it\nIf we winnin', win it\nI know dreamchasers that ain't never dreamt it\nSo I had to tint it and I had to rim it\nAnd I worked the lanes like Shaq and Penny\nIt's the Blood gang, it's the money gang\nRed rags to riches, need happy endings\nThen it's back to bidness, and we laugh at sentencin'\nHungry lawyers make a snack out witnesses\nHungry artists or starvin' artists\nIn the kitchen, restaurant, and cafeterias\nDon't make a difference if you taste the difference\nBetter pay the difference to the racketeers\nNow your good luck lookin' like you crackin' mirrors\nNow the artificial become sacrificial\nThat's a body count, where the mathematician?\nWhere the wettest clitoris and fattest nipples\nWith an ass that jiggle with a grab or tickle\nWith a throat deep enough to land a missile?\nIf your nigga miss you and he have opinions\nTell him two cents is only half a nickel\nNow we at his villa aiming at his pillows\nHair triggers, fingers finna act like bristles\nAnd I catch a triple, flip, kick, jiu-jitsu\nThrowin' pool parties, she don't have a swimsuit\nNeither of her friends do, I think that's official\nGot my neighbor's eyes bigger than the Simpsons\nAnd her man is simple so I had to pimp her\nAnd she had potential but he lacked credentials\nSo give me a sec', I'll go at your neck\nAnd send you back lookin' like the Dracula bit you, rrr!\nYeah, cannibalism, goin' animalistic in a land of civilians\nThese niggas clones, copycats, and chameleons\nOnce they dead and gone, no paraphernalia\nWhen she left her thong, that's paraphernalia\nSound familiar? My plug's Sicilian\nHe the one who told me that sometimes\nYou gotta leave your la familia behind the millions\nRhyme or reason, I'm the reason\nGot their eyes wide but too blind to see it\nWith friends like those\nIt make me text all my enemies and tell 'em I don't need 'em\nHallelujah, power intruders\nBitch walk around my house like Hooters\nTowel user, power user\nMolly mixed with white girl, Molly/Susan\nNiggas talkin' out their bowel movers\nTurn their homies into flower choosers\nTurn your kids into father choosers\nMake your bitch a widow and your mom a cougar\nI'm a silent shooter with a silent shooter\nClap at you, if you don't die, I'll boo ya\nTell a doc that's tryna save your life\nAnd runnin' wires through you, he could die next to ya, rrr!\nI'ma make the nurse ride me like a giant scooter\nLet her partner shoot it, we put out the movie\nWin awards, she got a Golden Globe head and an Oscar booty\nNiggas prostitutin'\nThese rappers ain't talkin' 'bout shit, not even 'bout pollution\nAin't got a house to live in, ain't got a pool to swim in\nChange in their pockets, nor a couch to lose it\nEn route to Houston with a contribution\nFull of Monster juices, Mazda too slow\nMacho, Cujo, macho mucho\nBig bad wolf, watch the moon glow, rrr!\nI got a Greek freak, she call me Antetokounmpo\nJust follow the coupe, ho, and I know that you know\nI'm hotter than soup, she still swallow my soup bowl\nI'm out of my loophole, you out of the loop though\nGot all these niggas on silent and mute mode\nThe power to do so, my pockets is sumo\nGettin' the mula by the minuto\nMafia Nouveau, I am the uno\nReal boss nigga, should model for Hugo\nFuck with me, I go Lolapaloozo\nPull up, trigger finger, holler, and pull-o\nPow-pow-pow, sound like a symphony, or opera, two-door\nHittin' some new notes\nAnd I am the maestro, and you just a typo\nPrivate flight, don't fly in too low\nI'm wiser than you know, a private school flow\nI got me a new ho, and now it's a duo\nOne went to college and one went to ju-co\nI had to ask 'em, what's four plus two though? Rrr!\n\n[Outro]\nMy ultimate basketball dream team\nThe starting five would most likely be umm\nOf course I'ma have to start with Kobe Bryant, umm\nThis gone take a minute, umm, Chris Paul\nUhh, Shaquille O'Neal, LeBron James\nAnd umm, oh you know I'm gon say Steph Curry, hehe, Steph Curry\nYou already know that's my starting five, I got money on them\nHolla at ya boy", "image": "https://images.genius.com/7fffdea050c45f423cceee2609addf81.600x600x1.jpg"}], "artist": "Lil Wayne"}