{"songs": [{"title": "Bang, Bang", "album": "#T5DOA: Freestyle Edition", "year": "2015-05-15", "lyrics": "[Intro]\nBang, bang, nigga, fuck that\nI know niggas ain't poppin' shit\nWord up, 101, whatever, I'll fuck these niggas up\nPut the guns down, this is Jada\nWhatever niggas want do, J-A-D-A\nY'all 'ready know, LOX, what, nigga?\n\n[Hook]\nWe gon' thug this shit out, we gon' thug this shit out\nAnd say, 'Bang, bang, bang, bang, bang, bang, bang, bang\nBang, bang, bang, bang, bang, bang, bang, bang'\n\n[Verse 1]\nUh, yeah, throw your sets up, niggas, bang, bang\nGangbang, whatever you got to to maintain\nReal talk, reason they lovin' me ain't changed\nIt's like stickin' a pit bull on a Great Dane\nBesides walkin' 'round here shooky, you straight lane\nGood dope got fiends lookin' for straight veins\nThe fire in my eye, you lookin' at straight flames\nWhat you feelin' is that guilt, it ain't shame\nServin' niggas just ain't built to take pain\nIt take a certain special skill to bang, bang\nYeah, I could stand there and just look at your brains hang\nWe're from a different world, my nigga, the Dwayne Wayne\nWe in the same race, not in the same lane\nIt's all the same base, was hoppin' the same train\nUsed the same plates for choppin' the same 'caine\nYeah, no security, I'm poppin' the thang-thang\nWhen are you gonna realize he's not playin'?\nWith extortion, dudes got killed, they stopped payin'\nStay low-key firin', don't stop sprayin'\nNiggas is eyeballin' now and they stop weighin'\nAll I know is, have that money by the A.M\nOr else they gon' hit him soon as I okay him\nYeah, I'm still killin' these bitches, I O. J. 'em\nShout the rock, see gutter, the whole (-)\nI'm always gone, at shows I'm not stayin'\nI'm one of the elite, that goes without sayin'\nI'm on a roll, doin' shows or I'm layin'\nWe don't love them hoes, we Bombay 'em\nShow me the target, set it, I'm aimin'\nWhatever the odds are, bet it, I'm gamin'\nYeah, shittin' on all these niggas, I'm not strainin'\nKnow how it feels to get wet without rainin'\nNobody loves you yet, you're not Raymond\nThe lion inside me, yes, I tamed him\nI took the other route, I bring the gang to your mother house\nBang, bang, we gon' thug it out\n\n[Hook] [x2]", "image": "https://images.genius.com/91aaca2db40e949852229a6bd8eb75d7.500x500x1.jpg"}], "artist": "Jadakiss"}