{"songs": [{"title": "New York Shit", "album": "The Big Bang", "year": "2006-06-09", "lyrics": "[Intro: Busta Rhymes]\nDJ Scratch you sick for this one\n\n[Swizz Beatz]\nWOO! Come on! New York we back!!! (Swizzy!!!)\n\n[Hook: Swizz Beatz]\nIf you from New York stand up right now!\nIf you from New York hands up right now!!!\nGet it up, get it up, get it get it get it up!!! {*4X*}\n\n[Swizz Beatz]\nYeah! Yeah! I'm on my New York shit\nHat to the back on my New York shit\n(WOO! WOO!) Yeah, I'm on my New York shit (Oh!)\nTimbs with the shorts on my New York shit (Come on!)\nI'm on my New York shit\nRidin on the train on my New York shit\nBurner in the club on my New York shit\nRazor in my mouth on my New York shit (Ladies and Gentlemen!!!)\n\n[Busta Rhymes]\nYeah! I'm on my New York shit\nGot the world followin the New York script\nHustle with Timbs and hoodies on my New York flip\nRubberband stack money with my New York click\nYeah! I'm on my New York shit\nI rep the Giants, the Jets, New York Knicks\nTailor-made clothin with my New York stitch\nMy chick bangin don't you see my New York bitch\nYeah! I'm on my New York shit\nYou niggas know we deserve the props we get\nRidin up in the range I'm in my New York whip\nInternational chicks on my New York dick\nYeah! I'm on my New York shit\nSee how I kill it with my New York spit\nThanks to the boroughs now I'm New York rich\nThe way I flood 'rm thoro with my New York hits\n\n[Hook]\n\n[Swizz Beatz]\nYeah! Yeah! I'm on my New York shit\nKid Capri on my New York shit (Come on!)\nDJ Red Alert on my New York shit (Bounce!)\nFunkmaster Flex on my New York shit (Shit!)\nWOO! I'm on my New York shit\nB.I.G. on my New York shit\n(WOO!) Big Pun on my New York shit\nJam Master Jay on my New York shit\n\n[Busta Rhymes]\nBVD's and durags nigga\nStand on the corners, God build on five percent lessons\nGot a nickel crack hand on hand niggas\nOn a hustle rebellin, while the D's calculatin who sellin\nSell drugs right in front of the deli\nPancho know what we doin and while we bubblin our corner be brewin\nIntroduce you to the new walk nigga, and the new talk nigga\nThat's how we do when we in New York niggas\nYeah! Yeah! I'm on my New York shit\nEvery hood love me for my New York skill\nI got alot of money on that New York strip\nGully rock a scully with a New York fit\nYeah! I'm on my New York shit\nRun up in The Tunnel catch a New York vick\nO.D.B. reppin New York sick\nShit you want the truth take a New York trip\n\n[Hook]\n\n[Outro: Busta Rhymes]\nYeah! I think it's about time for y'all to give New York there shit back\nY'all know where the crown belong, y'all know we started this shit\nYou know we gave birth to all of this shit\nDon't get it confused nigga, Flipmode bitch!!! Full Surface bitch!!!\nTo the family that helped me get rich since day one\nChris Lighty, James Cruz, Mona Scott, the whole Violator family bitch!!!\nBig up to Nas, big up to Jay-Z, big up to Roc-A-Fella, big up to Ruff Ryders\nDMX, EPMD, Jazzy Joyce, Cocoa Chanelle, Green Lantern, Mister Cee, DJ Enuff\nDJ Camilo, DJ Envy, Clue, Kay Slay, the voice of New York Angie Martinez\nGrandmixer DST, yeah, Grandwizard Theodore\nGrandmaster Flash, I'm a take it all the way back\nRun-D.M.C., LL Cool J, Ralph McDaniels\nCold Crush Brothers, Fab 5 Freddy, Funky Four Plus One More, Zulu Nation\nSpoonie Gee, Five Percent Nation Of Islam, Yeah! Wu-Tang, Treacherous Three and all of that\nBusy B whattup!!! Brucie B, Luv Bug Starski ya nah mean, Big Daddy Kane, Rakim, Kool G. Rap\nWe 'gon keep it goin, Public Enemy, B.D.P. I wanna big up producers like Pete Rock, Marley Marl\nPremo, Eric \"Vietnam\" Sadler, Keith Shocklee, Large Professor, Easy Mo Bee, Diamond D\nHowie T, Mantronix, yeah, Awesome Two, hey y'all I can't forget my nigga Biz Markie\nJust Ice, Lord Finesse, MC Shan, Cutmaster DC, UTFO, Whodini, Doug E. Fresh, Slick Rick\nUltramagnetic, X-Clan, Nice N Smooth, yeah, aiyyo, let me big up my ladies!!!\nMy ladies and mothers of hip hop, MC Lyte, Salt N Pepa, Latifah, Sha Rock\nAll the Roxannes, The Real Roxanne, Roxanne Shante, yeah, Pebbly Poo\nYeah yeah we fuckin y'all head up boy, we takin it back nigga!!!!\nNEW YORK YOU KNOW WHAT IT IS STAND UP NEW YORK!!!!\nYeah! I ain't finshed yet! Mr. Magic, Chuck Chillout, Audio Two\nA Tribe Called Quest, De La Soul, Black Sheep, Jungle Brothers\nLeaders Of The New School nigga! P. Diddy and the whole Bad Boy!\nBrand Nubian nigga! A ha ha ha ha ha ha ha!!! I ain't forgettin shit!\nKool Herc, Afrika Bambaata, the fathers of this shit, thank y'all", "image": "https://images.genius.com/be78d5f1fcdafddac07407fe6e45d552.630x630x1.jpg"}], "artist": "Busta Rhymes"}