{"songs": [{"title": "First Day of Spring", "album": "The Infamous Archives", "year": "2007-03-13", "lyrics": "[adlibs - Mobb Deep and Tragedy Khadafi]\nDangerous…\nFuck is that son?\nComing through, kid\nClique coming through\nI don’t know that nigga right there…\nC’mere, man!\n\n[Havoc]\nArmed and dangerous\nForm a cold swarm, fatal outcome\nThe mishap, couldn’t outrun and got clapped\nSmarts and agility is what you lack\nYo, you buck at this and we buck right back (x2)\n\n[Tragedy Khadafi]\n‘Cause you’s a halfway\nThug that you portray\nIf you got locked, that ass probably come home gay\nSmack blood out your mouth, what the fuck you say?\nBreak your feeble ass down, kid, you ain’t in my league\nForcin’ me to bless you with something you don’t need\nYo suborder, y’all niggas aughta watch your speed\nYo, word is born, I been doing this too long\nTo let you newborn thugs try to come on strong\nSince a juvenile I been making streets hot\nWhile I was runnin’ from cops you was practicing’ jump shots\nWorld plant seeds in my mind, Strange Fruit\nSurvivalist, basing my life on rap loot\nI blast one, won’t hesitate to splash one\nLiving every day in my life like it’s my last one\nCNN, on again, pullin’ a fast one\nCapone-N-Noreaga, the Infamous Mobb\nYour team want beef? Then my squad’s on the job\nCNN, War Report, guerrilla squad\nShittin’ on my name? Speak blasphemy\nKhadafi, I’m on a level that you can’t even see\nDon’t get mad ‘cause your shorty gave that ass to me\nYo, you realize\nTwo-Five will still shine\nIn due time\nWe all involved with crime\n\n[Havoc]\nCrime, yo, check it out, yo\nAyo, we bang like the Tunnel and jam like broken gate\n100 and 0 - nigga, go check the stats\nQ.B. - yeah that name hold weight and ring bells\nAll you niggas shook, and it ain’t hard to tell\nMajor clientele, the infamous cartel\nCatch a buck fifty, gem star we scar well\nHard luck, got gassed up and starstruck\nThen got stuck, in one stroke, the Mobb clutch\nLaid up, sipping’ all types of shit, get your chick bent\nTalk the bitch to death ’til there’s no info left\nHomicidal klepto, like the lye leave ‘em petro\nRegulate the metropolitan\nNiggas getting’ bodied and\nIn the lobby and\nLock the door, it ain’t safe kid\nTake it how you take it\nGrab a hold and embrace it", "image": "https://images.genius.com/cb51383ec91030d5e17e2b134d0e8477.1000x1000x1.jpg"}], "artist": "Mobb Deep"}