{"songs": [{"title": "Session", "album": "Bastard", "year": "2009-12-25", "lyrics": "[Verse 1: Tyler, The Creator]\nI'm Tyler, Mr. Green Hat\nPro-abortion, anti-clean rap\nFuck your blog opinion and your feedback\nMy self-respect I leave that, in the lost and found\nWhere the black girls get their weaves back\nAwesome I achieve that mini, blasting \"You're a jerk\"\nIn some fucking yellow skinnies looking like a fucking faggot\nBouncing 'round the house trying to find an easy way to rape Minnie\nBet you thirty dollars you find her like Cartman found Kenny, dead\nI like my girls smart, skinny\nKinda pop tart, when I bite into them red\nI'm a self-racist, you should tape this, ask Sarah, I'm the rapist\nI'm a fascist, fuck fashion, Gucci belts is for them faggots\nMy hat is by Jabbia, and if you got a fucking problem\nWith the future, you can get a death wish just like Atiba\nFuck the biz apparent, Odd Future errant\nI'm watching the Berrics getting head from someone's parent\nA lot of fucking hate inside my heart, guaranteed\nThat I'm sharing in the force with the cyclops staring\nI'm flying on a beaver, you're a disbeliever\nSo don't ask for no mothafuckin' ride when you see us\nSwim right past you, the shit-list said that I'm nutty such a cashew\n'Cause I jack off with dish soap and smell gas fumes\nPermanent brain damage similar to tattoos\nThe shit, you can mention me if anybody ask you\nKill the jungle, let the cats loose\nYou didn't see me here if someone ask you\n\n[Verse 2: Hodgy Beats]\nI want to feel her in every way\nMary Jane keeps me high like every day\nBong, vaporizer, in the sack now\nStuck in my high, afraid of heights, I'm trapped\nBuy a swisher for a dollar or two blunt wraps\nRoll it up and ensure that everything's fat\nShe ain't got time to try and relieve ya\nBut she'll get all in your head, Sativa\n\n[Verse 3: brandUn DeShay]\nI'm good but y'all don't want me like vegetables\nI'm all in front of you zeroes like decimals\nLet's take them high like the decibels\nSo we get them high, get them high like cholesterol\nIn a overweight mother-lover, my tracks is filled with blubber\nThat's fat, who needs another producer?\nChica-Go-Getter from Odd Future, used to ride solo\n'Cause I ain't really care what the rest say\nType of nigga to jerk off to his own sex tape\nBest stay away when the door closed, I show up with four hoes\nBest believe I'm leaving with more of those\nAnd I got a girlfriend so I'm a keep lying until the verse end, FIN\nBrandUn DeShay, Hodgy Beats, Ace the Creator\nOdd Future, O.F. until, until from now until forever\n\n[Alternate Verse 3: Mike G]\nWe grind, these niggas asking for some promo\nWe sit back, observe, stacking hella box logos\nSquare circle jerks starting O.F. moshpit\nPreaching to the poets, I'm an O.F. prophet\nNo less profit, fiened when we drop shit\nConvertible coupe, bitches scream when they tops split\nIt's that crack, give you something to sell\nPut these bitches on lock down, something like jail\nThought she hot I swear, probably rougher than hell\nAnd she ain't gay, but the only thing she like is fucking Chanel\nLight skinned women, all sex everything\nThink we can fit ten in, bowls packed with everything\nEverything that we call flight, living life\nThis is everything that they call hype\nI'm everything that they call nice\nShe in colors and shit, she off that northern lights, right\nIntimidated by niggas you can't be\nI'm a G, and this is something you can't see\nTop ranked, number one my son\nAnd she looking for them trees, baby we got some\nAnd stay focused on the women and you get less done\nIt's ironic cause I always hear you talking about one\nThem other niggas smoke, they ain't this high\nHow high? Nigga, higher than the kites they fly", "image": "https://images.genius.com/4c2b63a8598d42edb317eaf311d36882.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}