{"songs": [{"title": "Digest It", "album": "Tabernacle: Trust the Shooter", "year": "2016-03-29", "lyrics": "[Intro: Mr. Porter]\nSee, see God said \"Let there be light\"\nThen he created man who roamed Earth to hunt\nThen he created the beast\nNickel let's go\n\n[Verse 1: Royce Da 5'9\"]\nI bang my weapon, I think grotesque shit before I bless this\nInk on my paper, I R-A-K-I-M with my efforts\nI K-R-S it, AK's my preference, how dare y'all mess with me\nLyrically, I bury y'all best shit, I'm here to carry out y'all death wish\nThey can't digest it\nLike injecting bloggers with infections\nThey can't digest it\nThey rate my albums, they taint my message\nThey can't digest it\nCall this Inception, Shawshank Redemption\nThis is my movie, pardon my special effects\nI'm sittin' in my jacuzzi\nBlessings on blessings, one of us eating\nOne can't digest shit\nI let you pull my chain, I might as well let you come take my necklace\nUsed to pay out without gettin' back shit\nNow I'm collecting, plugging, connected\nBut know that definitely ain't my confession\nBlock got turned up like Tetris\nGot problems I need correcting\nI'm out here bird watching, plus I got a Popeye's obsession\nHot thighs and breasts has guys out right now tryna impress them\nFeels like I'm at a drive thru makin' a final selection\nThis chick tryna find out who I slept with\nI'm 'bout to let it happen cause who I smashed was her best friend, that's misdirection\nDealing with women with friends\nOne thing I learned is my lesson\nThis like Bob Evans, they share sausage but can't digest it\n\n[Interlude: Mr. Porter]\nBut then God created the woman\nAnd the woman needed to led by something other than man\nSo he created the queen\nTiara, get 'em\n\n[Verse 2: Tiara]\nThey can't digest this\nFood for thought cause this flow don't sit well in your small intestines\nYou know I grace these tracks\nYo eyes closed, amen, yes I blessed it\nThey can't contest it\nNo competitions, oh no contestants\nI'm giving lessons\nEyes on my pupils, yes, class in session\nI do this with no effort, no stressing, so no compression\nThey fuel off my aggression, I kill shit, that's my profession\nYou try to come bum my spot, better think twice\nYes, use your discretion\nI eat, sleep, breathe my passion for music, this my obsession\nLook, hop in the booth and take off\nYep, rocket ship, I'm rockin' shit\nMaking this hard to digest\nI pass right by you chicks, I buy you chicks\nLike I'm Warren Sapp, I fly right by you chicks\nYou say yo cap is fire, whoo\nWell, I'm gon' light this fire, bitch\nStep if you wanna, I'm wreckin' you up\nTalking lots of shit but I'm backin' you up\nGet that ass hit like you backin' it up\nAnd I'm killin' the game like the casket is shut\nDigest it, they can't digest it\nCaitlyn's a man but she's wearin' dresses\nThey can't digest it\nPolice killing people where there ain't no justice\nThey can't digest it\nParis invaded by all the terrorists\nWe can't digest it\nCure for diseases but never get 'em\nHow they 'sposed to make money if they ain't got no one infected?\nThe world gon' end real soon, especially if Trump gets elected\n\n[Outro: Mr. Porter, Tiara]\nSo, the moral of the story goes\nThis is plain and dope, this is Bad Half\nThis is bad dope\nTiara, Royce, Mr. Porter\nWe can't digest it", "image": "https://images.genius.com/5c9849e0f3618550af46c49efa192e9b.630x630x1.jpg"}], "artist": "Royce da 5'9'’"}