{"songs": [{"title": "Untouchable Drunk Freestyle", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nIt’s 'Pac, Makaveli\nI'm in the studio drunk than a motherfucka\nReady to freestyle this shit, and do it wild\nLive, for all my dogs\nFo all my dogs out there raisin' hell\nJust to see a young nigga raise the bail\nStepped out on the streets fresh from jail\nAll the police wanna rag and tell\nNot knowin’ that I stacks my mail, uh\nAll these niggas wanna see me fail, uh\nThat’s just the intro\nAs I sit back and rock this instrumental, uh\n\n[Verse 1: 2Pac]\nAfter the fire comes the rain\nAfter pleasure there’s pain\nEven though we're broke for the moment\nWe'll be ballin’ again\nTime to make your, my military be prepared for the bustas\nSimilar to bitches that's scary, get too near me then rush 'em\nVisions of overpacked prisons\nMillions of niggas thug livin’\nPrecious, three strikes, hope they don’t tell us\nThey pull a heater, ammunition in grace\nShh, move without a sound as we slide down pistols in place\nThey got me feenin’ for currency, the money be callin’ me\nIt’s like I’m dreamin’, seeing scenes of me ballin’\nSophisticated, and this fuckin’ misbehavior\nGot the cocked 4-5, snatchin’ niggas' pagers\nLabeled a mark, soon as we start, it was hard to quit\nStarted out drinkin’ 40s, moved to harder shit\nGoddamn, now I’m a grown man\nI follow no man, nigga, got my own plan\nIn my hand got the .45, I kick it live to survive\nMake these niggas die, while gettin’ high, though we cry\nWhen these thugs bomb, niggas’ll leave in their caskets\nThat’s what you get for being playa hatin’ bastards\nMe and my clique so legit\nWe keep a 50 on us, niggas know\nYou can’t touch us\nWhen they get to come against us\nThese niggas be defenseless, it’s senseless\nKnockin’ niggas back on the fences\nMy whole clique be sick\nAnd though we rip whole crews\nNiggas knew we came through drinkin’ 22’s of brew\nAnd though we drink Hennessys\nWe provide our enemies with mo’ shit\nThe art of war so legit\nI read, my name out, Makaveli\nWith the Thug Life tatted on the bottom of my belly\nCan these niggas understand this?\nMy whole family is sick and so scandalous\nLet's me introduce my clique:\nCastro, when he blasts y’all\nNiggas run and hide\nNapoleon will provide\nThe game\nLet me explain why E.D.I\nProvide shit, for the needy and take from the greedy\nKadafi, he not sloppy, and not a copy\nHe’s the only one, bring a gun, if you want it\nYoung Noble, bring the soul to the true\nLet 'em know we come through in a bucket or BMW\nWe trouble you, the W for Westside\nNiggas die when they try to infiltrate my crew\nWe never hide, we ride, and die, together\nAnd when you see my clique we always ride forever\nMe, my whole clique is sick, we smoke sinsimi'\nCan you convince the G, that they could come against me?\nYou can see me on TV or live\nNiggas die when they try to come against me\nNever hide\nIn my own zone, in my own dome, in my mind I’m a don\nNigga knew it once I came armed, I\nSplashed on niggas\nWill I dash on niggas?\nOnce I mash these figures, I'll be badder, nigga\nIt’s me, Makaveli, A.K.A The Don of this whole clique\nNiggas, you so sick\nThat’s my freestyle drunken flow\nJust so you bitch ass niggas in the back row know\nWhether it’s New York or Texas, ride through in a Lexus\nOr BMW, I trouble you, throwin’ up forever this big ol’ W\nHuhhuhhuhhuhu\nMy double R proves I’m a big rap star\nRockin’ the grooves, niggas where ya at, where ya are\nIs the back, in the front, when ya bump this shit\nI keep a gat inside my trunk legit\nAlways, though I’m on probation, I still rock the nation\nOut on bail, though last year I was in jail\nRaise hell, until I get my mail\nWill I fail? Hell nah, nigga, bite my nails\nI keep a manicure, though you panic\nYou’re still gon' die, when Pac get high\nSmokin’ indo, I roll my window down\nA smooth criminal, and though I pack this pound\n3-5-7 or 4-5\nWill I hide? Will I die? Will I ride?\nNiggas never know why\nMy whole crew, a family clique\nAre we sick? Are we live?\nThough we struggle to survive\nIn this motherfuckin’ ‘95 turn to ‘96, ’96 turn to ‘97\nI keep a 3-5-7, Mack 11\nBack home I got a M-R\nWhat did I say, a mini 14? Haha, my double R\nRide with my clue, ride with my crew\nYou don’t have a clue, nigga, when we’re comin’ for you\nWe hit the House of Blues, actin,’ like fools, my nigga Fatal\nPut a gun inside his club, I keep this fucker prenatal\nHad a banger inside his chest, nah nah\nBanger inside his belly, nah nah nah\nIt was Makaveli that told him to bring that gat outside his belly\nI say, \"Yo, Fatal, what are you crazy?\"\nNiggas pissin’ outside in the front\nNiggas sayin' \"Goddamn, them niggas is funny as hell\"\nWhat you want? You want some funk?\nHell nah, them niggas don’t want no beef\nThat’s why we left that motherfucker in a Rolls, a limo, I mean\nWith bitches inside to meet\nI was chillin’ in the back, drinking on some Hennessy\nI just did a dope ass show, them niggas will always remember me\nCame from Italy, bellisimo, was the call\nYeah, nigga, I got Versace, Armani\nAll them niggas wanna fuck with me, y’all know\nI always represent my people to the fullest\nYeah, I'm that same motherfucker took 5...bullets\nCount em, came out, rappin’ and stealin’\nAnd makin’ 5 motherfuckin' records got sold, millions millions\nHaha, platinum, I made 5 platinum shits, know what I’m sayin’\nNiggas, can’t fuck with me, 2Pacalypse, not known for playin', huh\nI took shots, and gave shots, fuck the cops\nWill I stop, until my shit, reach the top? Hmm\nNiggas out there wanna do me\nWhether it's Mobb Deep, Bad Boy or The Fugees, hahahahaha\nY’all niggas’ll never stop me, never drop me, never make me fall\nMe, 2Pacalypse, all I know how to do is BALL BALL BALL!\nMy crew, survive reincarnation after I’m dead\nThey'll rock and roll and bring the funk to the whole nation\nAnd you know\nEach one of these niggas have a gun wit' my name on it, you know\nI spit the game so clear it's plain on it, you know, huh\nWhen I’m dead, my niggas’ll ride for me, kill everybody\nThey each got a city to pick to make it our party", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}