{"songs": [{"title": "Rest of my Life", "album": "Street’s Disciple", "year": "2004-11-30", "lyrics": "[Chorus: Amerie]\nOoh, oh, oh, oh, oh, oh\nThe rest of my life\nOoh, oh, oh, oh, oh (Oh)\nThe rest of my life\n\n[Verse 1: Nas]\nLife: dead presidents, devilish men\nOverthrow king from they thrones cause of their negligence\nDeath, real shit'll start comin' to light\nNiggas you ain't like dickin' your wife, what?\nKind of undermining, grimy, stiff corpse shapin'\nPork bacon, double-cross Satan\nHeathens, non-god-fearing, lace thong wearing demons\nBut glory go to God, y'all beneath him\nIf y'all don't know that, rap with a old cat\nHe'll show you streets where them big dealers drove at\nWhere low-key killers let the fo' clap\nBlocka-blocka-blocka—oh\nThe glow, the 'dro, the dough for shows\nEverything a hood brother think he needs—yo\nYou'll find a goal in a ghetto superstar's roadmap\nAnd I'mma use that for the—\n\n[Chorus: Amerie]\nOoh, oh, oh, oh, oh, oh\nThe rest of my life\nOoh, oh, oh, oh, oh, oh\nThe rest of my life\n\n[Verse 2: Nas]\nBurnt-out, kicked to the curb\nSo I had to learn how to turn around a hundred thou' real fast\nIn '95 that was my last, I went back to the ave thinkin' rap's a thing of the past\nRest in peace E Money Bags, no more cabs, got caught with the ratchet in the stash\nLawyer want cash, my ba'y bro blast burners at cats who gel\nThey burnt a range with a Molotov cokctail\nMy little man got fourteen-years for car-jackin' a undercover\nThem cops swear, my little nigga told on me\nI'm thinkin, \"Hello, where's the L-O-V-E\"\nPigs play games, my little man'll never say names\nWord to his pops with elephant veins\nThey both locked-up still, word to Will\nI'll make it and chill for the—\n\n[Chorus: Amerie]\nOoh, oh, oh, oh, oh, oh\nThe rest of my life\nOoh, oh, oh, oh, oh, oh\nThe rest of my life\n\n[Verse 3: Nas]\nMy man gave his mommy coke\nSo she wouldn't hit the block all crazy for the smoke\nDamn, nigga, could you picture you supplyin' your own moms\nSo she don't have to bone for dimes?\nOr give dome for nicks' in the roofs of the projects\nWhere dogs shit and piss\nYeah, we all plan to get rich but it's all about how it's executed\nLexus coup-ed, brigettes from cubics\nMight've been stupid, but I got far from twenty-six bars\nTo ten LPs\nWhat can him tell me? Of them? Of y'all?\nI'm Nas—on a track that's unorthodox\nLike my life could've been offed by the cops\nTold y'all, Nas will prevail by the book when it's up for sale\nAbout the rest—\n\n[Chorus: Amerie]\nOoh, oh, oh, oh, oh, oh\nThe rest of my life\nOoh, oh, oh, oh, oh, oh\nThe rest of my life", "image": "https://images.genius.com/65c98702fc773f6dafd41563fe5c5485.500x500x1.jpg"}], "artist": "Nas"}