{"songs": [{"title": "In The Ghetto", "album": "The Big Bang", "year": "2006-06-09", "lyrics": "[Busta Rhymes]\nYou know, my homey Treach from Naughty By Nature once said\nIf you ain't from the ghetto, don't come to the fucking ghetto\nBut I'mma let one of our most immaculate tour guides\nTake us all through the ghetto - my nigga Rick James!\n\n[Rick James - sampled from \"Ghetto Life\"] + (backup singers)\nWhen I was a young boy, growing up in the ghetto!\nHanging out on corners, singing with the fellas\nLooking for the cute chicks, trying to find me big fun\nLooking for some trouble, or anyone who'll give me some\nI was young and crazy! (In the ghetto)\nDidn't know what my life would be (In the ghetto)\nI was dumb and oh so lazy (In the ghetto)\nSomething had a spell on me (In the ghetto)\nYou all know what I'm talking about (Talking about ghetto life)\n(Talking about ghetto life)\nYou all know what I'm singing about (Talking about ghetto life)\nGhetto life (Talking about ghetto life)\n\n[Busta Rhymes]\n(In the ghetto) Sure we be taking them chances\nWhile we search for the answers we be smoking them cancer sticks\nPolice provoking motherfuckers we dancing\nAnd we be dodging them bullets they be popping off at us, shit\nBut yet we always romance the street\nAnd fall in love with the hood until somebody come blast the heat\nAlways up to no good, so all of my fam could eat\nSee in the hood we hungry - hey nigga we playing for keeps\nMy soldiers on the block get on it\nIt be good if you flaunt it, we will take if we want it\nSee niggas from the ghetto got a different state of mind\nWith a different kind of hustle and we iller with the grind\nAnd develop our muscle until we sicker with the shine\nIn the struggle, thus our money come quicker doing crime\nI see the way we rep the hood, gotta love me\nYou can take me out the ghetto, but you can't take it from me\nGotta love it\n\n[Hook: Rick James] + (backup singers)\n(Talkin about ghetto life)\nGhetto life (Talking about ghetto life)\nYou all know what I'm singing about (Talkin about ghetto life)\nGhetto life (Talking about ghetto life)\n\n[Busta Rhymes]\n(In the ghetto) That's where we get into that street shit\nHustle hard, try to get money quick (In the ghetto)\nThat's where I got my name from\nI learned to get money and I got all my game from (In the ghetto)\nThat's where you eat with a bunch of the wolves\nAnd get to hustling as hard as you could (In the ghetto)\nUntil your cake stacking shit'll get good\nThrow a block party for the whole hood (In the ghetto)\nWith them burnout cellys\nTalk crazy, sell drugs in front of Pancho Deli\nCrackhead chicks still smuggle babies in they belly\nAnd then piss in elevators 'til the lobby all smelly (In the ghetto)\nThat's where I keep my ratchets\nGet my instincts and survival tactics\nAin't nothing like the hood nigga, I don't care\nYou surviving in the ghetto you can make it anywhere\nGotta love it\n\n[Hook]\n\n[Interlude: Busta Rhymes]\nTo my East coast niggas - rep your ghetto\nWest coast niggas - rep your ghetto\nMidwest niggas - rep your ghetto\nDown South niggas - rep your ghetto\nTo my East coast niggas - rep your ghetto\nWest coast niggas - rep your ghetto\nMidwest niggas - rep your ghetto\nTo my Dirty South niggas - rep your ghetto\n\n[Busta Rhymes]\n(In the ghetto) Even though they act rude\nYou'll always find a good chick to hold a brick for they dude\nBehind the bullshit, me and my clique on the move\nWe honor the code of the street, and live by the rules (In the ghetto)\nIs where, all of the hood's at\nFind the most crooks and they sell the most drugs at\nWhere you find beautiful women and rugrats\nAnd some of the most powerful people, I love that!\nCome mon\n\n[Outro: Rick James] + (backup singers)\n(Talking about ghetto life)\nYou all know what I'm talking about (Talking about ghetto life)\n(Talkin about ghetto life)\nYou all know what I'm singing about (Talking about ghetto life)\nGhetto life (Talking about ghetto life)\n(In the ghetto)\n\n\"Never mind who you thought I was, I'm Rick James BITCH!\" {*applause*}\n\"Cocaine is a hell of a drug\"", "image": "https://images.genius.com/be78d5f1fcdafddac07407fe6e45d552.630x630x1.jpg"}], "artist": "Busta Rhymes"}