{"songs": [{"title": "Fubba U Cubba Cubba", "album": "Anger Management 3", "year": "2005-12-26", "lyrics": "[Intro Proof] –\nShady records, ain’t nobody better than us\nShady records, more cheddar than us\nShady records, ain’t nobody better than us\nShady records…\n\n[Eminem]\nI done figured this rap shit out, I map shit out strategically\nTiming is everything, and it seems to be the key\nTo my success, I merked for me repeatedly\n(GreenLantern) “The evil genius”\nWe done be, to beat MC’s\nTiming is everything, and it seems to be the key\nLet 'em diss you first and respond immediately\nIn order to master, the art of war, don't start a war\nShit, not no more; we done scared 'em off, there are no more\nVictims to sick; I'm fixin' to pick some and start shit\nAin’t got no pictures to rip and shit to throw darts at\nAin't got no more targets, shit, Irv and Jeff\nWe done beat 'em to death, Benzino in debt\nThere seems to just be no one left to bully; Bush is pussy\nWhy the fuck you think his name's Bush? Puss is bushy!\nAin't shit going on, shit, I've been getting so bored lately\nI'm thinking of doing some shit to get you to go and hate me again\nTell the truth, I liked the shit better then, shit, I could spit better\nI'm 'bout to kick this sick shit again, look:\nThe game just ain't the same, it's changing\nShit, Dre is quitting, Jay is quitting, now it's just wankstas\nJust saying the same shit, it's fake and it's ancient\nAnd It's making me so bored I'mma just make a new language\nFubba-u-cubba-kubba yubba obubba ubba\nYou-ba can subbabick my dadibbadick through a tuba!\nSumma dumma lamma I'm not a human, I'm a suicidal supersonic\nSuicidal Unabomber\nYou think I'm the new Osama, press thinks I'm the new Madonna\nJeffrey Dahmer left me with this legacy to carry on\nA lot of talk and rumors on us, who's the hottest? To be honest\nHip hop ain't been the same since 2Pac moved to Cuba on us\n[Outro Konartist] – Shaddy records, they ain’t better than us\nShaddy records, they ain’t making more cheddar than us\nShaddy records, they ain’t better than us\nShaddy records, muthafuckas more cheddar than us", "image": "https://images.genius.com/5b4e4107970d86992883eef26d8c871a.400x400x1.jpg"}], "artist": "Eminem"}