{"songs": [{"title": "Tormented", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro: Tech N9ne]\nOne for the devil, two for my God\nFather please forgive me while I rock this broad!\n(Tormented)\n\n[Verse 1: Tech N9ne]\nI've been lovin' coochie since it was (Invented)\nAsk me does it get me? Yes it does (Feels lovely)\nPink or brown without even with fuzz (They love me)\nAll up on me off up in the club (Addicted)\nGotta get her off in the room, get her off them panties (Get wicked)\nGet her in the bedroom quick get hit with a whammy (Can't shake it)\nTry to pass it by my homie, but I (Can't make it)\nIf it was non-existent, I would die (Stay with me)\nI don't wanna ever let it go (A quickie)\nBeat it down like I'm Riddick Bowe (Real stiffly)\nWe can do it fast or even slow (I'll lift thee)\nUp on the bed or on the floor (Obsessed with)\nPussy, coochie, nani on my mind (God bless it)\nHit it from the front or from behind (Get naked)\nI'm horny baby, don't you waste my time (Don't mess with)\nPsycho alpha schitzo Tech N9ne!\n\n[Hook x2]\n(Tormented)\nMoney, women, liquor, hella drugs\n(Tormented)\nLookin' at me from afar, you'll get a buzz\n(Tormented)\nFather, can you tell me? (What?)\nWhat it is, what it was, and what it shall be! (Death)\n\n[Bridge 1: Tech N9ne]\nOne for the demon two for the son\nFather please forgive while I drink this rum!\n(Tormented)\n\n[Verse 2; Tech N9ne]\nLiquor got the Nina feelin' real (Demented)\nSo intoxicated I could kill (Get fucked up)\nWhen I'm havin trouble payin' bills (Might luck up)\nIf I got the dough to drink until (Get twisted)\nAin't no tellin' what I'm 'bout to do (Get wicked)\nFill me up I'll try to fight a crew (Don't touch me)\nBouncer wanna show me to the do' (Don't rush me)\nPlease partnah I don't wanna go (Shame on me)\nChuckin' ain't a damn thang changed (Rain on me)\nFuck it, do it 'til I feel the flame (Don't test me)\nTried to fight 'em fair no lead (Get messy)\nBut the alcohol said (Go 'head)\n(Can't stop it) Alcohol is takin' over blood\n(Don't mock it) Bitches like it thinkin' I'm a stud\n(No expenses) When I'm out I get a lot of love\nI'm drinkin' everything the tender\nTryin to get me in the club\n\n[Hook x2]\n(Tormented)\nMoney, women, liquor, hella drugs\n(Tormented)\nLookin' at me from afar, you'll get a buzz\n(Tormented)\nFather, can you tell me? (What?)\nWhat it is, what it was, and what it shall be! (Death)\n\n[Bridge 2: Tech N9ne]\nOne for the spirit, two for the blood\nFather please forgive me while I take this drug!\n(Tormented)\n\n[Verse 3: Grant Rice]\nWanna live my life in a day (What I meant is)\nDrugs help escape the flame and pain (THC)\nRoll it, light it, now you smoke your weed (I want it)\nPuff it, pass it 'til your eyes bleed (White cocaine)\nLight it, sniff it, now you feel the rush (Numb your brain)\nIn hell you an angel on the dust (PCP)\nDip it a wet stick it's numb numb (Dank and weed)\nThey it quick where I come from (GHB)\nDo it fluid it's called date rape (LSD)\nHit it, trip it now things trace (Valium pills)\nGot this villian chillin' stayin' paid (Bounce until)\nI'm feelin' ill until the day breaks (Ecstacy)\nCop it, pop it, roll time to club (Sex to me)\nIs who I'm takin home so I can fuck (Grant Rice is)\nMoney, drugs, liqour and them ho's (My life is)\nBased on sex, drugs and Rock'n Roll\n\n[Hook x2]\n(Tormented)\nMoney, women, liquor, hella drugs\n(Tormented)\nLookin' at me from afar, you'll get a buzz\n(Tormented)\nFather, can you tell me? (What?)\nWhat it is, what it was, and what it shall be! (Death)\n\n[Bridge 3: Tech N9ne]\nOne up in heaven, two here in hell\nFather please forgive me while I chase this mail!\n(Tormented)\n\n[Verse 4: Tech N9ne]\nRollers\nTry to get it, not the jingle but the fold up\nStackin' papers and the coppers can't control us\nChasin' relish 'til my fuckin' pockets swoll up\nGod forgive me, but the heavens got to hold up\nGet it quickly, is you wit me? This is sho' nuff\nDon't be bitchy, 5-1-50, hit the dough up\nKilla hippies, niggas wish we never showed up\nDon't be dummy get that money daddy told us\nGot to steppin' daddy left and never showed us\nSo we started pushin' weed and pushin' boulders\nFor Tony Roma on the corner 'til we blowed up\nGet it sewed up\n\n[Outro: Tech N9ne]\n(Tormented)\nI don't know so don't you ask why\n(Intended)\nFor Nina to get a piece of pie\n(Rest in peace)\nAll I want is money so I can fly\nI'm chasin' rella scrilla cabbage money hungry 'til I die\n(Tormented)", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}