{"songs": [{"title": "Famous (LWA)", "album": "Lil Weezy Ana", "year": null, "lyrics": "[Intro: DJ Raj Smoove]\nGreatest DJ in the world\nBest Rapper Alive\nYoung Money Volume 1!\nLilWeezyAna!\nRaj Smoove\nYo Taz, I see you\nThe greatest DJ in the world\n\n[Verse 1]\nOK, I spit that, get back\nI'm intact, in fact, the author's authentic\nOK, I spit that, get back\nI'm intact, in fact, the author— (Ooh, boy!)\nOil, slick like Syntec, inject\nEven the paralyzed feel my impact, as I...\nSkim back over my words that's on the page\nI'm lyin', I don't write, I get high and ignite\nI got a serious mental plan and dental plan\nAnd you don't want to bring the giant out of the gentle-man\nGee, golly, gigabytes, and a gorilla's hand\nTo the side of a nigga face like I don't give a damn\nEven if he's with his mans and thems\nI put his plans and limbs all over his pants and Timbs\nAnd I wasn't fortunate to grow up like The Sims\nBut instead I blew up before I grew up, haha!\nI spend eight and put two up\n'Cause you never know when I have to do what\nDo when? Do who? Do you and you two\nAnd you too, woohoo, haha!\nNow, I'm cuckoo like birds with my words\nI'm poopoo, meaning I'm the shit on you turds\nYes, and I get on your nerves\nYes, and I get on your nerves\nAnd yes; and I get on your nerves\nAnd sit on your mind like piss on the curb\nBitch-bitch! Disturb me? While I'm working-ing?\nYou are just another Earthling\nBe in the game, shit I must be first-string\nI like my tucks baggy and my turf clean-ean, ah!\nCheck my pattern/scheme\nI probably have on rocks from the Moon, and Saturn's ring-ring\nUh, whose badder, give 'em a ladder\nTell them climb on up here and watch me get at her\nThe badder part about it is, these niggas hate\nBut you won't even get a bar on my mixtape\nI'm probably on a boat feedin' a bitch grapes and crepes\nBy the way, that's French pancakes\nJe parlons Francais trés bién\nGarçon adore chaude lesbiennes\nPardon my French, pardon the stench\nBut I smoke that Grinch 'til my eyes squinch\nI meant \"squint,\" I'm so bent like a dent\nBut bitch, I'm still no Clark Kent\n\n[Hook]\nAnd my Momma used to tell me\nNot to let nobody fuck with me\nIt stuck with me\nI keep it real to the world, publicly\nUnbelievable\nI said my Momma used to tell me\nNot to let nobody fuck with me\nIt stuck with me\nI keep it real to the world, publicly\nUnbelievable\n\n[Outro]\nBitches say they love you but they hate you\nAnd they say that it's all a part of our animal nature\nSon, just watch your damn behavior\n'Cause every animal has a tamer\nI come from where the gangstas came from\nGo down like the rain that the drain sucks\nGoddamn, the game sucks\nThank God I'm famous\nThank God I'm famous", "image": "https://images.genius.com/37784bcd1bf2ed4b67f173caa0f2d9c4.500x483x1.jpg"}], "artist": "Lil Wayne"}