{"songs": [{"title": "Party and Bullshit (Ratatat Remix)", "album": "Ratatat Remixes Vol. 2", "year": null, "lyrics": "[Biggie]\n\nI was a terror since the public school era\nBathroom passes, cuttin classes, squeezing asses\nSmoking blunts was a daily routine\nSince thirteen, a chubby nigga on the scene\nI used to have the tre` duce\nAnd the duce duce in my bubblegoose\nNow i got the mack in my knapsack\nLoungin' black, smoking sacks up in acts\nAnd sidekicks with my sidekicks rockin fly kicks\nHoneys want to chat\nBut all we wanna know is \"Where the party at?\"\nAnd can i bring my gat?\nIf not, I hope I don't get shot\nBut i throw my vest on my chest\n'Cause niggas is a mess\nIt don't take nothin' but frontin'\nFor me to start somethin'\nBuggin' and barkin' at niggas like i was duck huntin'\nDumbing out, just me and my crew\nCause all we wanna do is...\n\nChorus:\nParty... And bullshit, and... (x9)\n\n[Biggie]\n\nHugs from the honeys, Pounds from the roughnecks\nSeen my man Sei that I knew from the projects\nSaid he had beef, asked me if I had my peice\nSure do, two .22's in my shoes\nHoller if you need me love i'm in the house\nRoam and strollin' see what the honeys is about\nMoet popping, hoe hopping, ain't no stopping Big Poppa, I'm a BAD BOY\nNiggas wanna front, who got your back?\nNiggas wanna flex, who got the gat?\nIt ain't hard to tell I'm the east coast overdoser\nNigga you scared you're supposed to\nNigga I toast ya, put fear in your heart\nFuck up the party before it even start\nPissy drunk, off the Henny and stuff\nOr some brand-nubian shit beatin' down punks!\n\nChorus (x9)\n\n[Biggie]\n\nBitches in the back looking righteous\nIn a tight dress, i think i might just\nHit her with a little Biggie 101, How to tote a gun\nAnd have fun with Jamaician rum\nConversations, blunts in rotation\nMy man Big Jacques got the Glock in his waist and\nWe're smoking, drinking, got the hooker thinking\nIf money smell bad than this nigga Biggie stinking\nIs it my charm? I got the hookers eatin out my palm\nShe grabbed my arm and said \"Let's leave calm\"\nI'm hittin' skins again\nRolled up another blunt, bought a Heineken\nNiggas start to look out, a kid got choked out\nBlows was thrown and a fucking fight broke out\n\n[Music stops, indecipherable sounds of people yelling and arguing\nBiggie breaks it up yelling \"Yo chill, man, chill!\"]\n\n[Biggie]\n\nCan't we just all get along?\nSo i can put hickies on her chest like Li'l Shawn\nGet her pissy drunk off of Don Perrignon\nAnd it's on, and I'm gone\nThat's that\n\n[Chorus w/ Puff Daddy talking after selected lines]\n\nParty... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\nAnd Party... and Bullshit\n\nRepeats until fade out", "image": "https://images.genius.com/12e22504130ce1c7e6cbb673dd2bb942.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}