{"songs": [{"title": "Kit (What’s the Scoop?)", "album": "The Great Adventures of Slick Rick", "year": "1998-11-01", "lyrics": "[Intro]\nKit, where you goin'?\nSorry, Michael, it's Rick the Ruler, I have to go\n\n[Verse 1]\nLights, camera, action, you're on\nGet 'em Ricky D, what's wrong?\nThe crowd's gone\nSo help me out Kit cause this thief has to be caught\nRadio the chief of police, get a report\nChief of police said \"Welp\nI'm sorry Ricky D cause I really can't help\"\nAhh drats I think I'll take a long walk\nKit put your scan on all these rappers in New York\n\"But Michael's callin' me Rick, I have to go\nIf I get a word you'll definitely be the first to know\"\nWell all that night I felt really uptight\nHello?, \"Rick, it's Vance Wright\nThrow on your clothes, I found 'em, they're down town\"\nWord?, \"Someone's havin' a concert and they're using your crown\"\nWhat?, you sure its mine?\n\"Yo Rick, I know the shape of it, come on\"\nYou know your scratches? \"Yeah, plus I got tape of it\"\nGet over my house quick, ride your motorcycle\nKit, Ricky Rick, pick up, forget old Michael\nWell here came the DJ, trucks to say the least\n\"Ayo let me hear the tape,\" it's a complete masterpiece\nYelp, I guess it is, but this one bound to overtake\nI heard a *honk honk*, that's Kit, so let's break\nHere go my rap Kit\nAnalyze a hit, so Kit what's the scoop?\n\"Slick Rick, this one is it\"\n\n[Verse 2]\nWell my tummy was growling while I was chilling in my seat\nWe stopped by McDonald's so I get something to eat\nSkipped the line and the crowd started to break\n\"Hey yo, let me get a Big Mac and a strawberry shake\"\nSomeone snatched me by my neck I thought I must be dead\nInjected me with something, threw a bag over my head\nI felt real weak, word, I couldn't even stand\nI fell, next thing I wads being thrust inside a van\nUnconscious, who could be this shady?\nWhen I awoke I was in a room with this lady\n\"So you're the boss, Rick Rick with all the clout?\"\nUh-huh know why'm I tied up and what's this all about?\nAnd this she left the room this was my one chance for hope\nI used my watch lighter to burn away the rope\nThen I's free, I's free, an alarm was alerted\nI made a flying leap through the window and it hurted\nSomeone threw a knife, who could be this trife\nSo I ran and I ran cause I was petro' for my life\nStranded and raw I saw a phone not far\nI radioed in to my supadelic car\nYo, what's with the concert, am I still in it to win it?\n\"Yes I'm in Manhattan and I'll be there in a minute\nAnd oh, by the way, I re-listened to your hit, hey Rick\"\nWhat's the scoop? \"Oh man, this one is it!\"\n\n[Verse 3]\nTight tight security - MAN, they was the softest\nCame in with some cannons and bumrushed the office\nGrabbed up the one who liked to front and pretend\nNo, I don't know who it is, some brother looking like a hen\n\"Let me go, let me go, please,\" you must be dusted\nHand cuffed this brother cause the thief could not be trusted\nGrabbed up my money and my crown that's how I dissed 'em\nI went on the mic, and DJ, man, I'm on the system\nHe warmed up the techniques to show he ain't soft\nThe crowd was up and this is how it started off\n\n[Refrain]\n(Who, who, who is the top choice of them all?)\n\n[Verse 4]\nYo Vance, cut, thanks a lot, who wanna die?\nWe up top, somewhat, forget me not\nThe class that I have won't last\nSoon as I blast, from out the past, dash fast, and here at last\nVance Wright, no man can bring you this\nAnd Ricky Rick, clean shot, cause I'm the king of this", "image": "https://images.genius.com/09b48445ade4e1b5e75781bcfa6eb3c6.924x924x1.jpg"}], "artist": "Slick Rick"}