{"songs": [{"title": "Unfair", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro: Tech N9ne]\nAnd the road gets harder with flow spits\n'Cause we represent that Kansas City, MO, shit\nDouble doses, Tech Kalikosis\nBut ran into a duo that's ferocious\nSome of the best two, kill you, no rescue\nThey say that you gotta spit hot 16's before you step through\nAnd they say everybody, nigga, even Tech do\nNow we gotta explain our journey to the Ces Cru\n\n[Verse 1: Tech N9ne]\nI'm on a pilgrimage to the rhyme Mecca, because I am Tecca\nAnd this mind, it left ya, down at the bottom because N9ne's better\nAnd if swines ever find the quest to try and test the cleverness\nThey in a mess; bind yessir, sever decay 'em and define pressure\nI'ma spit it for bidig roars and not a critic whore!\nHit ignore, I got acidic core! Thidis war, you're nada when it pours!\nWanna pla-ay every da-ay, sta-ay for the wa-ay that I spra-ay\nSa-ay? You got the pa-ay? That's ya-ay or na-ay?\nBumblebee tuna, grrr\nDon't be smelling like it if you're under me, rumors\nWill begin about you from hung-r-y pooner's!\nHopin', wishin', prayin' when you're gone it'd be sooner!\nWhen I'm dead I'ma get up in the head of the nigga that set it up pickin' the lead up, then I wet 'em up look like a predator\nI'ma dead 'em and let it puss, skip the peace it ain't no humble we Luna\nMoon stricken, rednecks sayin' who them coones rippin'\n(Boom!) Pick 'em off\nTake 'em off to my land in my van a lotta room, get in nin nin\nWhen I catch my flow try to wake up your style\nBut you fucked up like, \"Uh-oh, I'ma make up for it now\"\n\n[Hook: Tech N9ne]\nIt's unfair to be such a motherfucking rarity\nBeware that we tear many squares if he dares to be a parody\nOf this clarity, we bare that we share, swear we need therapy\nPrepare to see nare any spared caring is bare-ly there\nIt's unfair to be such a motherfucking rarity\nBeware that we tear many squares if he dares to be a parody\nOf this clarity, we bare that we share, swear we need therapy\nPrepare to see nare any spared caring is bare-ly there it's unfair\n\n[Verse 2: Krizz Kaliko]\nWho are these dudes? We never let in any fools, you know the rules\nKristopher, egotistical, narcissistic with ya!\nIf they sit on my throne then we tell 'em to get up and move and make us some room\nI heard of these guys, murderous when it comes to scripture\nUbiquitous and Godemis, they Gods to us, we Gods to them\nSo we meet right in the middle, chewed the fat and fried up a little\nAnd it's unfair, we got their hands in the air\nAnd you can’t even get a show\nNo one cares that your freestyle so rare\nBut don't nobody can't nobody know\nAnd it's easy for them physical favors\nWhy y'all just spend all your paper\nBreezes bend over the table, tattoo symbols of my label\nDriving and trafficking rhymes, tongues sharp as African knives\nWe what's happening to your wives while you're at nine to fives\nYou might as well stop rappin' never gonna happen if I stop laughin'\n'Cause it's too hard to impress us, just blatant disregard\nThe Four Horsemen of course we forced to be coarse when\nYou talkin' taller when y'all getting the short end!\n\n[Hook: Tech N9ne]\nIt's unfair to be such a motherfucking rarity\nBeware that we tear many squares if he dares to be a parody\nOf this clarity, we bare that we share, swear we need therapy\nPrepare to see nare any spared caring is bare-ly there\nIt's unfair to be such a motherfucking rarity\nBeware that we tear many squares if he dares to be a parody\nOf this clarity, we bare that we share, swear we need therapy\nPrepare to see nare any spared caring is bare-ly there it's unfair\n\n[Verse 3: Godemis]\nIt's unfair to me, nothing is what it appears to be\nKillin' off any and everything\nComin' and threatening somethin' that's dear to me\nIf'n you feelin' the fear then flee\nFi fo fee fum, what a fuck up!\nI'm retarded with a clover, I guess you can call it dumb luck\nWhen I'm rappin', out of habit I'm adamant gettin' adam\nBut I would rather, hit a madam with a Magnum and split her atoms\nTryna fathom the famine that will diminish the anger\nGot a place set at the table, we eating spinach with Strangers\nSippin' Caribou Lou\nSpilling the sickest shit ever I tell 'em but who woulda knew it?\nI’m one of two in the crew, with a knife in my pocket and one in my shoe\nSurrounded by haters so what I'ma do?\nThinkin' I gotta devise a game plan\nGet a ticket to kick it with Krizz and Nina\nSo I guessin' I’m headed to Strangeland!\nAnd my main man, woulda told me to murk 'em\nDoin' the sin indeed, I'ma catch a couple more\nThen I’m formin' a human centipede\nPause, I'm aware that they hatin', look it, they gotta diss\nWho the fuck is fuckin' with Tech, Kali, Ubi and Godemis?\n\n[Hook: Tech N9ne]\nIt's unfair to be such a motherfucking rarity\nBeware that we tear many squares if he dares to be a parody\nOf this clarity, we bare that we share, swear we need therapy\nPrepare to see nare any spared caring is bare-ly there\nIt's unfair to be such a motherfucking rarity\nBeware that we tear many squares if he dares to be a parody\nOf this clarity, we bare that we share, swear we need therapy\nPrepare to see nare any spared caring is bare-ly there it's unfair\n\n[Verse 4: Ubiquitous]\nIt's unfair to be, doin' motherfuckin' charity\nYou can pay a fuckin' fare for me\nOr really there ain't nothin' there for me, move carefully\nI swear that we, high as a Cherokee, fly as a parakeet\nIn my rhyme I spoke like Jeremy feel my fire, my smoke, my kerosene\nWe-we-we don’t want no drama, we-we don’t want no trouble\nWe-we can keep it peaceful if y-y'all can keep it humble\nI-I really don’t know what he come fo'\nBut his name is the same as a gun yo\nStrangeland is a place that I seen in a dream\nSince I was runnin' 'round in my Umbro\nAnd you heard it direct from my mouthpiece\nTech scouted me out, then found me\nTurn out we the perfect strangers, Larry Appleton and Balki\nI was out east, when the text came in\nWith Tech sayin' what is 'bout to be\nBefore you fuck me on the dough, know that everybody 'round here lookin' out for me\nNow that we got that in the air, I can feel the change in the atmosphere\nMy crew been living in limbo, apparently all this rappin' has trapped us here\nAnd after years they hearin' we lost inside the dream not necessarily\nI won’t let this rap thing bury me, I'ma let these bat wings carry me\n\n[Hook: Godemis]\nYtirar gnikcufrehtom a hcus eb ot riafnu s'ti\nYdorap a eb ot serad eh fi serauqs ynam raet ew taht eraweb\nYpareht deen ew raews ,erahs ew taht erab ew ,ytiralc siht fo\nEreht yl-erab si gnirac deraps yna eran ees ot eraperp", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}