{"songs": [{"title": "L$D [Explicit]", "album": null, "year": "2015-03-19", "lyrics": "[Verse]\nI know I dream about her all day \u2028I think about her with her clothes off\nI'm ridin' 'round with my system bumpin' LSD\nI look for ways to say \"I love you\"\u2028 But I ain't into makin' love songs\u2028Baby, I'm just rappin' to this LSD\nShe ain't a stranger to the city life\u2028I introduced her to this hippy life\u2028We make love under pretty lights, LSD (Acid)\nI get a feelin' it's a trippy night \u2028them other drugs just don't fit me right\nGirl, I really fuckin' want love, sex, dream\nAnother quarter to the face system\u2028 make no mistakes, it's all, a leap of faith for love \u2028it takes a place in, feelin' that you crave doin' love, sex, dreams\n\n[Chorus]\nIt started in Hollywood \u2028Dreamin' of sharin' love\nMy tongue at a loss for words\nCause my feelings just said it all\nParty just started up\nDreamin' of sharin' worlds\nHeld this feeling for way too long\nSaid, \"I really wanna let it go\"\n\n[Bridge 1]\nI've been gettin' fly because the gimmick's so dope\nI've been getting high cause I figured Lord told me\nI've been drinking, driving, now we'll never go home\nI gon' stay in doubt because the weather's so cold, oh\n\n[Bridge 2]\nFeeling low sometimes when the light shines down\nMakes me high\nCan you feel it? \u2028Can you feel it?\nFeeling low sometimes when the light shines down\nMakes me high\nCan you feel it?\u2028 Can you feel it?\n\n[Bridge 3]\nFor all them hoes that was frontin' on niggas back in the days, man\u2028(This for my broke jiggy niggas right now, you know)\nYou know what I'm saying?\nExcuse me, fuck out my face\nThey say wealth is in the mind, not the pocket\nI learned that from a very wise man\n(Gotta pocket full of stones like Pimp say)\n\n[Verse 2]\nOkay excuse me, Mr. Bill Collector, I got problems\nMy check arrive mañana, I'ma pay my debt, I promise\nI spent 20 thousand dollars with my partners in Bahamas\nAnother 20 thousand dollars on Rick Owens out in Barneys\nI said excuse me, why the fuck you lookin'? What's your problem?\nI swear we gon' have drama if you touch my tailored garments\nAll you see is niggas here, so that means it's triggers there\nWhat you mean? We got weed, and codeine and bricks for sale\nI bet a lot of niggas plottin' so you know I got that heater, bruh\nDrive my side of Harlem, catch me ridin' with my nina, bruh\nShe got an apple bottom that remind you of Bonita, bruh\nOh you mean like Q-Tip? Now that girl my new bitch\nExcuse me, no, I believe the proper term's excuse you\nI could switch up on you niggas and start shittin' if I choose to\nThat's when the new you becomin' different since they knew you\nI guess the new me is just gon' take some gettin' used to\n\n[Chorus]\nIt started in Hollywood\nDuh, duh-duh\nDreamin' of sharin' love\nDuh, duh-duh\nMy tongue at a loss for words\nCause my feelings just said it all\n\n[Outro]\nI look for ways to say, \"I love you\"\nBut I ain't into makin' love songs\nBaby, I'm just rappin' to this LSD", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg"}], "artist": "A$AP Rocky"}