{"songs": [{"title": "Slavery Was A Choice Pt. 1 [May 1, 2018]", "album": null, "year": "2018-05-01", "lyrics": "I don't think people necessarily understand what happened last week with the Make America Great Again hat. What are you trying to do with the message you're sending?\n\nIt was really just my subconscious. It was a feeling I had, you know like, people, we're taught how to feel. We're taught how to think. We don't know how to think for ourselves. We don't know how to feel for ourselves. People say feel free, but they don't really want us to feel free. And, uh, I felt a freedom in first of all, just doing something that everybody tells you not to do.\n\n...\n\nI just love Trump! That's my boy! You know like, so many rappers, you'll look at a video of Snoop Dogg loving Trump, but then he get into office and now they don't love him. Trump is one of rap's favorite people right?\n\nBut we talked about this, that before he was elected president, people in hip-hop it was an in thing to put Donald Trump in your rhymes somewhere.\n\nAnd by the way, I'm in hip-hop but I'm not just in hip-hop. I'm a black person in the black community but I'm not just that. I feel like one thing is that people try to minimize me to artist, hip-hop, black community...Yeah, I'm always gonna represent that but I also represent the world.\n\n...\n\nYou hear about slavery for 400 years. For 400 years? That sound like a choice! [laughs]. You was there for 400 years and it was all of y'all?\n\nIt's like we're mentally imprisoned. I like the word 'prison', because slavery goes too direct to the idea of blacks. It's like slavery Holocaust, Holocaust Jews, slavery is blacks...So prison is something that unites us as one race. Blacks and whites being one race. That we're the human race.\nDo you feel that I'm being free? And that I'm thinking free?\n\n[Van Lathan]\nI actually don't think that you're thinking anything. I think what you're doing right now is actually the absence of thought. And the reason why I feel like that is because Kanye, you're entitled to your opinion, you're entitled to believe whatever you want, but there is fact, and real-world, real-life consequence behind everything that you just said.\n\nWhile you are making music, and being an artist, and living the life that you've earned by being a genius, the rest of us in society have to deal with these threats to our lives. We have to deal with the marginalization that has come from the 400 years that you said, for our people was a choice!\n\nFrankly, I'm disappointed. I'm appalled. And brother, I am unbelievably hurt by the fact that you have morphed into something, to me, that's not real.", "image": "https://images.genius.com/aab94fa6927a427c544580f7c77735ee.1000x538x1.jpg"}], "artist": "Kanye West"}