{"songs": [{"title": "Yada, Yada, Yada", "album": "Absolute Power", "year": "2002-09-24", "lyrics": "[Intro]\nHuh,my nigga Don Juan, damn..\nBeen knowin' you for a long time, nigga (heh)\nWe did a lot of shit together, man\nOn this music tip, man\nBeautiful shit we did, dog\nRemember when we went out to L.A. man, with Quincy man\nMade all that shit pop, Yukmouth and everybody, Dubb C and everybody\nHad a lot of good times, dog, know what I'm sizzlin'?\nBut that shits about to come to an end, dog\nYou know? Never have I ever crossed anybody, y'all niggas know me\nThe sands of time have already started to pour against you, dog\nSo listen hard, 'cause I speak real softly, like this:\n\n[Verse 1]\nJust think: What if I could just, just blink your shit away?\nNiggas think: Because a nigga bust, I got grips and grips of pay\nThe pain grows in fame and kangos we're changin' strange hoes\nWho bang in Range Roves for thangs same shows with lames\nThe rains goes will stain and insane foes who drain\nAnd hang rows with brains\nIf you caught it, that means you got it\nAnd if you brought it, that means you should have shot it\n'Cause I'm about to drop the ray and Nina locked to kill a liter\nPropped to meaner nigga I pop the millimeter\nDeMarco I'm 'bout to spark flow ya bark so hearts with parts\nGonna make ya heart blow (heart blow), blood\nAnd don't be was-in, Cuzin' me buggin' me\n'Bout dubbs I be muscling these clubs really lovin', me\nIt hurts my nigga, the hurt my nigga, but hurt my nigga\nIs what's inspiring these spurts my nigga\nAt first my nigga\nUsed to be my homie, used to be my ace\nYellin' you gon' slap the taste out my mouth\nNigga, I never scare\nSavoir faires everywhere\nIf you need me believe me it's easy\nTo put hoes in chakrateasie\nWatch the wizie, these Glocks'll talk fa' shizie\n\n[Hook]\nSome say I should worry and watch where I walk\nYada, yada, yada, nigga, that's just talk\nI'm a friend, if I was a foe I would be\nKnock-knock-knock-knock-knock-knock-knock-knockin' at yo' front do'\nSome say I should worry and watch where I walk\nYada, yada, yada, nigga, that's just talk\nI'm a friend, if I was a foe I would be\nKnock-knock-knock-knock-knock-knock-knock-knockin' at yo' front do'\n\n[Verse 2]\nThe Industry's faulty, industry's salty (man)\nThe industry cost me, industry brought me (pain)\nThe industry taught me, industry caught me (strange)\nAnd you niggas know that the industry's awfully (vain)\nI ain't a snake nigga, all I did is make niggas money\nWith Sonny now it's funny, you playa hate niggas\nOver some cake the fake of a show me state nigga\nIn my face will be Don Juan The Great to late nigga\nI don't speak a lot I peep a lot I creep a lot\nAnd people who speakin' usually weak and out for peace and no beef a lot\nRemember we used to kick it like bros\nNow you niggas act like bitches and hoes, with ya licorice souls\nTecca N9ne I got the wickedest flows\nNo kid in this MO, no misery will ever get wit this Rouge\nI'm pissed in this hole\nLittle for side a crypt in his soul\nInstead of a rap I should have twisted his nose\nWho kept Short Nitty from killin' you? (Me!)\nWho kept Diamond from drillin' you? (Me!)\nWho kept villain niggas from bill dealin' you? (Me!)\nSo now you can take away me and keep on talkin' crazy\nAnd I'mma let 'em know where you keep your baby and where you stay, D\n\n[Hook]\nSome say I should worry and watch where I walk\nYada, yada, yada, nigga, that's just talk\nI'm a friend, if I was a foe I would be\nKnock-knock-knock-knock-knock-knock-knock-knockin' at yo' front do'\nSome say I should worry and watch where I walk\nYada, yada, yada, nigga, that's just talk\nI'm a friend, if I was a foe I would be\nKnock-knock-knock-knock-knock-knock-knock-knockin' at yo' front do'\n\n[Verse 3]\nYou can't turn enough motherfuckers against me\nYou can't find a harder rapper that'll convince me\nI'm with the Canties, the Ashbees, the White Bears\nLa Zhunes, the Harris's, and the motherfucking Timleys\nThe theories, the buyers, the Kennedy's\nYou know the families that are known to be bad for humanity\nCan he be bad? Can he be tough? Can he be rough?\nNo cream puffs are considered to be rough enough\nNobody likes you not even ya bitches, I'm a witness\nThey sick of yo disrespectful way of speakin' explicit\nAlways talkin' about how big yo dick is\nBetter hope Anghellic go multi-platinum to get yo riches, blood\nThis is the end of men who were once friends and then\nOne asshole thought he was somethin'\nWhen punks bend over they get fucked! (Get fucked!)\nHand over them Tech tapes or get stuck! (Get stuck!)\nYou must think I'm soft for talkin' to Icey Roc 'bout knockin' the Nina out\nI'm trippin' without a doubt\nI'm a tell you really is yo friend\nMail Bakarii and maybe you and him can get together and tell like it is again\nIt's over mane, I hope you brought your Novocaine\nI know the pain, is slowly takin' over brain\nSo calm that motherfucking wombat, I don't need no Don Juan tracks to come bomb on rap\n\n[Hook]\nSome say I should worry and watch where I walk\nYada, yada, yada, nigga, that's just talk\nI'm a friend, if I was a foe I would be\nKnock-knock-knock-knock-knock-knock-knock-knockin' at yo' front do'\nSome say I should worry and watch where I walk\nYada, yada, yada, nigga, that's just talk\nI'm a friend, if I was a foe I would be\nKnock-knock-knock-knock-knock-knock-knock-knockin' at yo' front do'\n\n[Outro]\nThat's what I'm speakin' on, dog, that's real shit\nNigga once said to me: \"Nigga walk around like his shit don't stink\nGon' cut ya nose off and stick up ya ass so you can smell that shit,\" man\nYa know what I'm sizzlin'?\nDog, you drew first blood man\nThat was dog shit\nYou know what I'm sizzlin'\nThat ain't no friend\nTalkin' 'bout knockin' me out nigga\nYa know what are we\nYo\n\nDr. Dre here I come\nTimbaland here I come\nNeptunes here I come\nRick Rock here I come\nAlchemist here I come\nSick Jack here I come\nBoscoe here I come\nSwizz Beats here I come\nTrackmasters here I come\nDon Juan be done", "image": "https://images.genius.com/478a9ba0370b10241e03f91f6e741b36.1000x986x1.jpg"}], "artist": "Tech N9ne"}