{"songs": [{"title": "Powerglide", "album": "SR3MM", "year": "2018-03-01", "lyrics": "[Intro: Swae Lee & Juicy J]\nYeah, yeah, yeah\nMike WiLL Made-It\nYeah, yeah, yeah\nMally Mall\nOh, oh, oh, oh, oh\nEar Drummers\nYeah, ho\n\n[Chorus: Swae Lee]\nWhat's in ya' mug? Toasted up, nah, I ain't hostin'\nKush all in my lap because these hoes don't wanna roll it\nI was slidin' in the Lamb' with the powerglide\nSlime green paint, peanut butter inside\nShe wanna fuck, speak up, comin' out her clothes (clothes)\nI'm in wonderland when she comin' down the pole\nAnd I don't care if she take all of mine\nLike it ain't shit but a dollar sign\n\n[Verse 1: Swae Lee]\nDiamonds unthawed, comin' in froze (froze)\nGot too many girls to let one of them go (oh)\nWhen I make a purchase, I can't wait to show-ow-boat (oh)\nIf she bad, I put a pinky ring on, snow globe\nI'ma have that pussy on lock like po-po (yeah)\nShe was goin' up and down like yo-yo (down)\nYou can say I'm greedy 'cause I always want more (more)\nI don't fuck with holmes 'cause they with some slow-pokes (lame)\nOoh, money on monsoon (ooh), baby girl, full moon (ayy)\nGive these niggas with some money some room\nShe don't stop, batteries not included (go)\nOh, big ballin' like Mutombo\nMuch cooler than the cool kids, woah\nCan you believe every night we do this? (Do this, yeah)\n\n[Chorus: Swae Lee]\nWhat's in ya' mug? Toasted up, nah, I ain't hostin'\nKush all in my lap because these hoes don't wanna roll it\nI was slidin' in the Lamb' with the powerglide\nSlime green paint, peanut butter inside\nShe wanna fuck, speak up, comin' out her clothes (clothes)\nI'm in wonderland when she comin' down the pole\nAnd I don't care if she take all of mine\nLike it ain't shit but a dollar sign\n\n[Verse 2: Swae Lee]\nHold up, I'ma go and spend those hundreds though (hol' up)\nI don't care if she had a man, so? (Man?)\nPedicure gang, get your fingernails did\nWith no shame, flips that ass like heads or tails (tails)\nAnd she finer than a motherlover (lover)\nCan I hit that ass like a bullseye? (Hit)\nShe gon' suck like a bloodsucker (woo)\nMy fee higher than a motherfucker\nOh, I hear you like fast cash (fast cash)\nBaby, you know I got the hots for you (I've got the hots)\nI've been workin', so I cash in\nShe said, \"I only wanna dance for you\" (dance)\nWe have no mercy for you, no (no)\nMe and my niggas closer than in-laws (than in-laws)\nFuck an interview, she know the answer (answer)\nPrototype cars, not a Jaguar (skrrt)\n\n[Chorus: Swae Lee]\nWhat's in ya' mug? Toasted up, nah, I ain't hostin'\nKush all in my lap because these hoes don't wanna roll it\nI was slidin' in the Lamb' with the powerglide\nSlime green paint, peanut butter inside\nShe wanna fuck, speak up, comin' out her clothes (clothes)\nI'm in wonderland when she comin' down the pole\nAnd I don't care if she take all of mine\nLike it ain't shit but a dollar sign\n\n[Verse 3: Slim Jxmmi]\nDuck sauce on my feet, ho, pass around the pre-rolls\nRollie on my chain, Flavor Flav with the steez, ho\nKush residue on my jeans, I blow hella dope\nAnd them classic Reeboks, whiter than snow\nAnd a nigga be dressin', walkin' 'round, Gucci steppin'\nUnintentional flexin', tryna send out a message\nMoney walk with the extra, shake that ass wit' ya bestie\nSeein' stars in the rental, got your broad in the rental\n20K in A.O.D. and it's just me and my kinfolk\nTryna send a girl to college, I ain't coppin' no free show\nSay her birthday late July, yeah, that means she a Leo\nMight just leave with me tonight, but that don't mean she a freak ho\nFuck with dancers and models, shout out them girls who get dollars\nShawty came from the bottom, yeah, shout out Keisha Bottoms\nCouple cases of Rosé, came out to me with the sparklers\nI pour up for all the girls, but I'ma drink out the bottles\n\n[Chorus: Swae Lee & Juicy J]\nWhat's in ya' mug? Toasted up, nah, I ain't hostin'\nKush all in my lap because these hoes don't wanna roll it\nI was slidin' in the Lamb' with the powerglide\nSlime green paint, peanut butter inside\nShe wanna fuck, speak up, comin' out her clothes (clothes)\nI'm in wonderland when she comin' down the pole\nAnd I don't care if she take all of mine (I got you Swae)\nLike it ain't shit but a dollar sign (Juicy J) (yeah, ho)\n\n[Verse 4: Juicy J]\nShe got that million dollar pussy, but I get it for the free\nShe like to do a lot of snow, I told that bitch to come and ski\nShawty bad, she can get it, she can swallow, she can spit it\nBring her friend, if she with it, on the pole, y'all can split it\nIn the bed or the Lamb' (or the Lamb')\nGot your bitch suckin' dick on the 'Gram (on the 'Gram)\nV12 helped me get up out the jam (out the jam), trunk full of slam\nR.I.P. Lil Peep, I gotta slow down on them Xans (hey)\nJust had a ménage (hey), back seat of my Benz (hey)\nPut that shit on camera (hey), she squirted on the lens (hey)\nThen she told me put it on her chinny chin-chin (hey)\nPocket full of nothin' but them Benjy Franklins\nIn the game, posted up (up), puttin' numbers up (up)\nBitch, run me that check first, I don't wanna fuck (yeah)\nThey say it's cuffin' season, baby, you ain't good enough (nope)\nShe want a real nigga, dawg, you ain't hood enough\n\n[Chorus: Swae Lee]\nWhat's in ya' mug? Toasted up, nah, I ain't hostin'\nKush all in my lap because these hoes don't wanna roll it\nI was slidin' in the Lamb' with the powerglide\nSlime green paint, peanut butter inside\nShe wanna fuck, speak up, comin' out her clothes (clothes)\nI'm in wonderland when she comin' down the pole\nAnd I don't care if she take all of mine\nLike it ain't shit but a dollar sign", "image": "https://images.genius.com/eb9b54393913ac1966b177519577219a.600x600x1.jpg"}], "artist": "Rae Sremmurd"}