{"songs": [{"title": "Blow It Out", "album": "Chicken-n-Beer", "year": "2003-09-28", "lyrics": "[Ludacris]\nAOWWWW!\nI never used to snore in my sleep 'til this rap shit started\nWarm thoughts fill the hot-headed and cold-hearted\nYour whole paycheck, you burp it and then fart it\nAnd y'all think I'm gon' stop? BLOW IT OUT YA ASS!\nIn one year I got rich, now life's movin so fast\nBut bein broke with no food is just a thing of the past\nPlus I'm the new phenomenon like white women with ass\nAnd y'all prayin that I flop? BLOW IT OUT YA ASS!\nIn New York I buy clothing, in Cali I get green\nIn Atlanta I get sleep, in Texas I sip lean\nAll these rappers wanna know what I'm gettin for sixteens\nTry 80, want a discount? BLOW IT OUT YA ASS!\nSee in just six months I infiltrated the system\nIf you find somebody better, then I'm sorry I missed him\nNiggas hate givin me props cause I might use it against them\nC'mon, get Ludacris out! BLOW IT OUT YA ASS!\n\n[Hook 2X: Ludacris]\nIf you mad I'm on top, then wish me gone\nIf you mad I'm on the road, then wish me home\nAnd if you mad that I'm right, punk wish me wrong\nBut after your three wishes - BLOW IT OUT YA ASS!\n\n[Ludacris]\nIt's time to saddle up the Tontos cause I'm the Lone Ranger\nI eat dinner with Jews but don't talk to strangers\nI'm just a few albums from filling your disc changer\nIf you ever think of stoppin me - BLOW IT OUT YA ASS!\nI'm a hustler by nature but criminal by law\nAny charges set against me, chunk it up and stand tall\nNext year I'm lookin into buyin Greenbriar Mall\nYou probably own a lot of property! BLOW IT OUT YA ASS!\nC'mon and take a look, he's got gigantic balls\nPlus his money keeps flowin like Niagara Falls\nWe all know Jesus saves and Ludacris withdraws\nI'm 'bout to go on vacation - BLOW IT OUT YA ASS!\nShout out to Bill O'Reilly, I'mma throw you a curve\nYou mad cause I'm a THIEF and got away with words\nI'mma start my own beverage, it'll calm your nerves\nPepsi's the New Generation - BLOW IT OUT YA ASS!\n\n[Hook]\n\n[Ludacris]\nMy black people show me love when I'm up on the block\nAnd Latinos always waitin for my CD's to drop\nWhite people love the flow, they say, \"Dude, you fuckin rock!\"\nYo' fans are my fans, right? BLOW IT OUT YA ASS!\nSo find my album in the stores and look for the white steam\nRip it open, play it and yo' momma might scream\nIt's hard, other albums are softer than ice cream\nYo' scans are my scans, right? BLOW IT OUT YA ASS!\nNow Luda's throwin up A's, and I'm lightin up L's\nAround the globe gettin paid, you home bitin yo' nails\nDTP, the only label that practice fightin ourselves\nWe probably gettin on your nerves, huh? BLOW IT OUT YA ASS!\nI been eatin and gettin FAT while y'all dyin of hunger\nI get drunk in the winter, stay high in the summer\nWatch out, my album's puttin up McDonald's numbers\nYou over 6 million served, huh? BLOW IT OUT YA ASS!\n\n[Hook]\n\nBLOW IT OUT YA ASS!\nWHOO!", "image": "https://images.genius.com/1498cf277a7dc50ffc916ca191c3608f.1000x1000x1.jpg"}], "artist": "Ludacris"}