{"songs": [{"title": "Hey Ho", "album": "Battle of the Sexes", "year": "2010-03-08", "lyrics": "[Intro: Ludacris]\nIf men sleep around we some playas but for women they be sayin\n\n[Hook: Ludacris]\nHey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nIf men sleep around, we some playas, but for women they be sayin'\nHey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nIf men sleep around, we some playas, but for women they be sayin'\n\n[Verse 1: Ludacris]\nNow I been ridin up in my Bentley coupe, stuntin with the top down\nFo' 24-inch rims so heavy they hold the block down\n24 karat necklace so heavy it hurt my neck\nThree things you can't take away from me - money, power and respect\nI got it and hold onto it, you knew that I never let it GO!\nYou prostitute it, but money I never let it HO!\nSpeakin of hoes, oh yes we meet 'em and we G 'em dude\nAnd we may see 'em but we wouldn't wanna be 'em dude\nI put my fist UP, I got the power girl\nI wash my nuts off, go take a shower girl\nIt's been a hour girl, it's time to GO\nAnd if my neighbor see you while you walkin out my do'\n\n[Hook: Ludacris]\nHey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nIf men sleep around, we some playas, but for women they be sayin'\nHey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nIf men sleep around, we some playas, but for women they be sayin'\n\n[Verse 2: Lil' Kim]\nNowww, can't nobody do it like Kim, only woman that can do it like men\nVVS's be them gems - ho, now count that!\nMy-my-my money comin in, bendin them corners on them rims\nGold-plated checkbook, tell me how do ya bounce that?\nI, bounce into position like I invented the Kama Sutra\nBut money make me cum, go and ask Luda!\nAnd women cheat better than men, we don't disturb 'em\nMy motto is \"What they don't know won't hurt 'em\"\nWe just do it like you do, see the roles done switched\nIf I'm a ho, you's a ho, if I'm a bitch, you's a bitch\nKnow that I'mma stay rich so fellas do what ya do\nCause y'all don't fuck us, niggas we fuck you!\n\n[Interlude: Ludacris] + (Lil' Kim)\nHEY HO! (Now we sayin) HEY HO!\n(Now we sayin) HEY HO! (Now we sayin) HEY HO!\n(Now we sayin) HEY HO! (Now we sayin) HEY HO!\nIf men sleep around we some playas but for women they be sayin\nHEY HO! (But now we sayin) HEY HO!\n(But now we sayin) HEY HO! (But now we sayin) HEY HO!\n(But now we sayin) HEY HO! (But now we sayin) HEY HO!\nIf men sleep around we some playas but for women they be sayin\n\n[Verse 3: Lil' Fate]\nShe likes the night lights, bright lights, big spendin\nLil' Fate been big pimpin pimpin\nSo don't be mad at my raps and try and look at me funny\nCause you know that most you ladies tradin sex for money\nSo if you comin out the pocket then you might get laid\nThat's how the rent, car note and cell phone get paid\nI bet the snakes all show, once you cut that grass\nAnd I'm a pimp, so it's time that I exploit they ass\nYou see it's hoes after the party, it's hoes after the show\nIt's hoes up in the lobby, it's hoes out on the stroll\n(Hey ho!) Here's some No-Doze, no dough, no sleep\nHo, on your feet, if you don't work you don't eat!\n\n[Hook: Ludacris]\nHey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nIf men sleep around, we some playas, but for women they be sayin'\nHey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nThey be sayin' hey ho, they be sayin' hey ho\nIf men sleep around, we some playas, but for women they be sayin'", "image": "https://images.genius.com/05b5494c6b36a8d257cb2950d2d8896c.640x640x1.jpg"}], "artist": "Ludacris"}