{"songs": [{"title": "I Got Next/Neva Hadda Gun", "album": "I Got Next", "year": "1997-05-20", "lyrics": "It's meant to be evidently\nWhen I rock so eloquently\nPut the beat on and let me\nKill another wack emcee\nCan't trust them, never test me\nI practice and study\nBut I'm not in it for the money\nBut to me they look so funny\nYou can't test the teacher\nThe teacher won't reach intact\nThrough the speaker you're weaker, now sit your ass in the back\nMy lyrical you hear it, you fear it, you can't get near it\nCause the spirit eat Eric\nAnd Eric your rhymes is wack\nLike that, that, right back\n\nCheck it out!\n\nCheck it like this\nJust skills  You know you gots to build just skills\n*A phone is dialed a man says hello and a woman starts speaking in\nSpanish*\nYou know you gots to build just skills, uh come on get down\nJust skills  You know we got to build just skills, come on get down\n\nYeah, uh come on\nI got that rip track, flip that, underground rap\nWhen I kick back\nMost of what I'm hearin be weak\nSo I speak through beats and the streets as I teach\nI impeach, through speech, each lyric leech I reach\nHave a seat in the lecture\nNothin can protect you\nHard is the texture\nOf the mic wreckin rock in your sector\nBetter than ever remember I am no beginner\nI'd like to shout out Eric Skinner\nJust skills, you know we gots to build just skills, come on a get down\nJust skills, you know we gots to build just skills, come on a get down\nYo, we livin in a world of private jets and limousine\nThe fruit we eatin as we prepare tangerine to nectarine\nSee everybody livin in the same routine\nWe need the telephone, and yes, we need the fax machine\nYou listen to the sound, well I think you know it's me\nNow, let me educate you with my concious poetry\nMe want, me want, me want, me want, me want no wack rap\nMe want, me want, me want, me want, me want no wack rap\nMe love, me love, me love, me love, me love it when it's bad\nSee if you wack rap you ought be steppin out the back\nSee emcees on the microphone forgettin that they black\nSee hear them kick the lyrics that are holdin people back\nBut when you hear the teacher, KRS will find the track\nYou bound to see the light, and you don't want return back\nSo listen very closely to the secret scientist\nI'm sending this one out to all my inner city kids\nNow you supposed to be apostle what you have inside your head\nCan make you more reliable, it can make you feel dead\nNow listen very closely to the way I say this rhyme\nIt's the thing called the brain, and the thing called the mind\nBut I'm outta time\n\nChorus (scratching on the word \"can\"):\nCan I tell them that I really never had a gun?\nNo, you can't cause now you bouts to get done!\nCan I tell them that I really never had a gun\nNever had a gun, never had a gun?\nCan I tell them that I really never had a gun?\nNo, you can't cause now you bouts to get done!\nCan I tell them that I really never had a gun\nNever had a gun, never had a gun?\n\nOn the block you just yap a whole lot\nAbout the clothes that you got\nYo, or the gold that you got\nEverybody sees all the friends in your Benz, yo, it's fat\nBut they ain't gettin money like that\nWord to my brother Kenny, jealous one envy\nThe rich are few, while the poor, many\nBut you got gold cuffs and cars and stuff\nYou eatin well, but still in the ghetto you dwell\nYou know it's hot, so you make it known about your Glock\nTo any perpetrator tryin to blow up your spot\nYou grab the microphone and talk a good ramble\nYou the hardcore outlaw, criminal, vandal\nBurnin emcees like a candle, but you frontin\nYou ain't got nothin, with your life you gamble\nOne day you gamble up snake eyes\nTalkin all that junk about you don't take dives, you take lives\nNobody on the block tries, cause you claim you got powerful ties\nSo at the red light you arrive\nAnd to your surprise you get heffed up with just two steak knives\nYou're terrified, they take your Benz, and what makes things worse\nYou ain't got guns to burst\n\nChorus", "image": "https://images.genius.com/2d8a06de1f39a224dcb05e3e9195e0b4.640x640x1.jpg"}], "artist": "KRS-One"}