{"songs": [{"title": "Red & Gold", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Verse 1]\nI remember when, last past November when\nClown kid got pounded in with the Timberlands\nThey left him trembling, he was not remembering:\nNever tuck your denim in just to floss an emblem\nSome would debate, \"Wait, the fella ate gelatin\nOr he been listening in to what his weathermens was telling him\"\nWhen I could feel it in my melanin, it's compelling\nUs to break them off, no reassembling\nNo science-fiction to no theater near you, coming soon to\nFuck with you frequently like how phases of the moon would do\nYou could gather 'round like it was an eclipse\nJust don't look directly to the bitch, you may be blinded by the scripts\nPass the L, the last to tussle in them shirttails\nAll hail, King Geedorah, the third rail\n700 volts holds rap to a standstill\nFool ignore the rule, fuck up and get his man killed\nTwo bottles of Dom got his hands filled\nAnd so goes the days of our lives as the hourglass sand spill\nAnd built with Passion and a glass of the 'Ze\n(And the lights went down and hey!)\n\n[Hook]\nAnd I knew it was the last day - Wig-Twisting Season\nWhen some could get their wigs twisted back within reason\nMostly with these crimes of treason\nAnd you'll be lucky if there's no squeezing even this evening\n\n[Verse 2]\nFrom how he's feeling, thrilling choice of flow is sick\nHe's the villain with the million dollar voice-throw trick\nHe's like a ventriloquist, with his fist in the speaker's back\nCouldn't think of no uniquer track, nope, sneak attack\nIt don't really matter how big them is. So much as a nipple\nCause you could have a chick with D-Triple\n'Cept the nipple little. Just hot off the griddle\nLike how he do monkey rhymers, like Monkey-in-the-Middle by his damn self\nAin't no average MC ahead of me\nGetting cheddar instead of the probably better pedigree\nWith nicknames, sick games as Rick James\nMessy games, sci-fly such as Jesse James\nBlast, I figure, ass-hawking ass titty licker\nLast one to walk up in, fast-talking city slicker\nGot bagged cause of the dirty chick with make-up\nBail out quick for the 7:30 wake-up\nMy only backup was an A-cup, as far as May\nTo when the leaves turn red and gold to Nimrod earthday\nAll else? Worthless to say\n(And the lights went down and hey!)\n\n[Hook]\nThat's when I knew it was the first day - Wig-Twisting Season\nWhen some could get their wigs twisted back within reasoning\nMostly with these crimes of treason men\nAnd y'all be lucky if there's no squeezing even this evening\n\n[Verse 3]\nIt's like a mosquito, the much sweeter resent the act\nI been bent back since my Physical went back\nSince, Cultured more of my kin\nAnd for them I keep an L rolled in this hellhole\nHold your head, use your head and hold, or be dead and cold\nIn the worsest way, soon as the leaves show red and gold\nTo 'round Nimrod release day\nAnd all else? Needless to say\nWait a motherfucking minute! True facts presented\nThe names was probably changed just to protect who ain't in it\nThe XP was three-quarters tinted, 4/5ths was converted\nThe way his shit was twisted? Ask him if it hurted\n\n[Hook]\nWig-Twisting Season\nWhen some could get their wigs twisted back within reasoning\nMostly with these crimes of lying, and fronting, and cheating\nAll types of different styles of treason", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}