{"songs": [{"title": "Willie Dynamite", "album": "I Love Life, Thank You", "year": "2011-09-20", "lyrics": "[Intro]\n\"You're a hard man to reach, Willie Dynamite!...I wanna rap\"\n\"Go right ahead..\"\n\n[Verse 1: Mac Miller]\nThe girls ask me for that Willie D that's how I know they feelin' me\nIt's simple see, the pimpin' be what got these bitches clipped to me\nWe maybe at the game, I guarantee you we in different seats\nI seen you in the nosebleeds, but where I'm at that isn't cheap\nIn the Benz, in a Jeep, make a million in a week\nTakin' off her clothes 'fore I begin to speak like gimme cheek\nSpin to London, been to France, go there if you get the chance\nBeen to Amsterdam, hit the club, hell no I didn't dance\nRolled around a little, smoked the weed, seen the red lights\nAin't fuck a prostitute but the head nice, get right\nFrom here on to the next life, relax and sip that Red Stripe\nThe way I spend this money you would think I had an ex-wife\nBitches love the lead pipe, the Burgh word to Ken Rice\nNew place every day, what I would give to just have 10 nights\nYeah right, bout to drop an album, hope to blow your mind\nTryna reach a level where no music is put over mine\n\n[Hook]\nUh, the girls ask me for that willie D\nUh, the girls ask me for that willie D\nWhat does it mean to keep your pimp hand strong?\nLive it up cause you don't live that long\nOr am I wrong?\nUh, the girls ask me for that willie D\nUh, the girls ask me for that willie D\nWhat does it mean to keep your pimp hand strong?\nLive it up cause you don't live that long\nOr am I wrong?\n\n[Verse 2: Mac Miller]\nIt's young Macintosh, tell you bout that sabotage\nTravellin' through Germany, word to David Hasselhoff\nBack up off me, kill em softly, bitches like to fuck em doggy\nProbably off some molly got me turnin' into polygons\nOn and on, DJ's puttin' on my song\nPeople say I talk too long, killin' every single track the God is on\nThey cheerin' with their pom-poms, buyin' what I got on\nStraight gold, find me fuckin' Silver with my Long John\nTom Tom, direct me to that money please\nSquare sponge, fuckin' dumb, yeah your grades is under C\nAnd I know in God we trust, but how much do they trust in me?\nEnough to be a fuckin' beast on beats, yeah, shit is so disgustingly\nAmazin', bitches out the playpen\nYou fuckin' hand askin' \"how much money can I fit into this rubberband?\"\nHustlin', throw your ass right inside a rubbish can\nExcuse my french, that's just how I talk if I was Russell Brand\nKnow that I'm the fuckin' man, play my shit for three days\n\"All I make is hits, call me T-Pain!\"\nSicker than if she gave me AIDS, plus some teeth decay\nThen she stole my condom, try to auction it on Ebay\nTalk a little shit man, probably thought he dissed me\nBitch please, I just ate out Monica Lewinsky\nYeah, I taught her bout some slaughter, had her cryin' about her father\nThen I busted in her face while she told me it's an honor\nBob O'Connor, we just politicin', finger-lickin' on my chicken\nGot a way with words, words, words, word to Charles Dickens\nI wrote this on the shitter usin' toilet-paper\nPut your head inside the water, enjoy the flavor\n\nYeah bitch!\nNah Jerm, don't cut me off man!\nFuck you!\n\n[Hook]\nUh, the girls ask me for that willie D\nUh, the girls ask me for that willie D\nWhat does it mean to keep your pimp hand strong?\nLive it up cause you don't live that long\nOr am I wrong?\nUh, the girls ask me for that willie D\nUh, the girls ask me for that willie D\nWhat does it mean to keep your pimp hand strong?\nLive it up cause you don't live that long\nOr am I wrong?", "image": "https://images.genius.com/986f803b4d2b7fff1f43a7344f02fb6e.375x375x1.jpg"}], "artist": "Mac Miller"}