{"songs": [{"title": "Lone", "album": "Wolf", "year": "2013-04-01", "lyrics": "[Intro: Dr. TC]\nSo, what's going on, Wolf? Talk to me, man. People worry, we hear stories about you getting into fights and all this unnecessary bullshit. What's on your mind? Talk to me, I'm here\n\n[Hook]\nDomo roll another one\nI'm just fuckin' with you I ain't smokin' none\nMy squad bring terror, no intended pun (Wolf Gang, nigga)\nMerch booth made niggas extensive funds\nMama got the Rover with the Range\nShe don't ever ever gotta struggle, not again\nAnd I put that on my dead grandmama's name (Rest in peace)\nToo soon\n\n[Verse 1: Tyler, The Creator]\nUh, my nigga Slater, yeah that's my little pony\nLittle homies is repping like I been fucking with Kony\nNigga Phillip and Kobi, to my niggas that know me\nYa boy seem happy as fuck but truthfully ya boy lonely\nNigga's a target for marketing, he's an artist\nCan't even walk into Target without botherin customers botherin\nAsking me for a picture, can I talk to they sister?\nNaw nigga, get lost, you're fucking smothering\nGod I wanna quit, but I can't\n'Cause mother and sister can't pay the rent\nFour stories with storage, I'm 21 with a mortgage\nAnd touring's paying the bills, life is paying for thrills\nLifes' a bitch bruh but from the third-floor man, she's gorgeous\nA year ago I was broke, now how can I afford this?\nI started off with disposables, now I have an assortment\nAnd I'm using these negatives to develop a portrait\nNow the frame is a pain in the ass to get it in\nWithout a scratch or stain on the glass, but that's not important\nJust as long as it's printed, and I hinted it is\nAnd when I get it I'll make sure you get a copy, bitch\nShit I'll even add a signature with the fuckin' pic-ature\nI'll even tell you the film I used, and the aperture\n\n[Hook]\nDomo roll another one\nI'm just fuckin' with you I ain't smokin' none\nMy squad bring terror, no intended pun (Gang, nigga)\nMerch booth made niggas extensive funds\nMama got the Rover with the Range\nShe don't ever ever gotta struggle, not again\nAnd I put that on my dead grandmama's name\nToo soon\n\n[Verse 2]\nGrandmother died, didn't cry not a tear\nNot gonna lie, fucking weird no water dripped out the eye\nBut when I got the news, yup it left your boy stuck\n'Cause when my mom dipped, she was the one that gave me a fuck\nMom calling and calling, I'm on my way to a show\nI answer, she crying, saying, \"Sadie is dying\"\nThe doc said she only had a week for us to speak\nBefore she deceased, cause cancer was just eating her cheeks up\nFuck, nah this is really awkward for me, bruh\nI hang the phone up, and adjust my seat back\nAnd started to think, like, \"What the fuck just happened?\"\nI never had a death and I just seen her a week ago\nMeet them at the hospital I should\nIn between the set of BADBADNOTGOOD\nLionel asked what happened I said it's bad bad, not good\nJust take me to the Cedars-Sinai off of Oakwood\nGetting there, family sitting center chair\nAwkward in the lobby, it was floating in the thinning air\nGetting there, need a sticker saying how I got in there, there's a room\nOpen up the curtain, she's just sitting there, hello\nOur conversation's brief, couldn't even make eye contact when we speak\nLookin' at her you could tell all she had was weak\nAnd I'm not talkin' days bruh, I'm talkin' 'bout her strength\nI sat there 20 minutes tops, hoping it was just a fucking plea that she could cop\nShe died that night\n\n[Outro]\nDr. TC: Oh, that's heavy man, I'm sorry for your loss\nTyler: Yeah, whatever, don't worry about it...\nDr. TC: Last time I seen Sammy, he was lookin' for you\nTyler: Fuck that nigga Samuel\nDr. TC: Uhh, have you seen him?\nTyler: Nah, but if I seen that nigga I woulda killed him", "image": "https://images.genius.com/dde81a162bfe7b81092c8630cdf16d70.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}