{"songs": [{"title": "Georgia", "album": "SUPERFLY (Original Motion Picture Soundtrack)", "year": "2018-06-15", "lyrics": "[Intro: Future]\nJeffery, Hendrxx\nAye, bro, is that Jambo?\nWhere we go from here?\nSuperfly\nNo regrets, I was made like this in Georgia\nJambo\n\n[Bridge 1: Future]\nDon't let me die today\nDon't let me perish away today\nDon't let me die away\nDon't let me perish away today\n\n[Verse 1: Young Thug & Future]\n(Georgia)\nEverything I rock super fly\nKillin' these hoes, Georgia, yeah, suicide\n(Georgia)\nUmbrella on the Rolls Royce when I'm curbside\n\n[Verse 2: Future]\nYeah, went to the end of the road, then I did a 360\nGot a few of my hoes textin', sayin' they miss me (Georgia)\n100, 300, let's go, we jumpin' out of it instantly (let's go)\nDiamonds gon' light up and glow, she wanna come and ski with me (ooh)\nI had her stand on her toes, the marble floor, no sympathy (Georgia)\nI gave it to her right though I made her feel the chemistry (I made her feel the chemistry)\nI should not stop smashing on these girls when they come to this lifestyle\nWe the ones drinkin' the most syrup, you can see all the jewelry is loud\n\n[Bridge 2: Future]\nOh, Georgia, don't you give up on me\nI can afford you, hope you'll be there for me\nI piss out diamonds, I make it super fly\nAin't no regrets, my love will never die\n\n[Chorus: Young Thug, Future & Both]\n(SEX)\nGot no recess, we got no recess\nNo Tyco, with you\nLive with no regrets, we havin' Rolex sex\nAnd they both recessed, I know you best (I know)\nGot no recess, we got no recess\nNo Tyco, with you (with you)\nLive with no regrets (no regrets), we havin' Rolex sex (Rolex sex)\nAnd they both recessed, I know you best\n\n[Post-Chorus: Future]\nNo regrets, no regrets\nEvery day we go to sleep in Diamond\nNo recess, no recess\nEvery day we wake up, nigga, grindin'\n\n[Outro: Future]\nGeorgia, Georgia\nDon't let me perish away today\nGeorgia, Georgia\nDon't give up\nGeorgia, Georgia", "image": "https://images.genius.com/93706895b47b1526bb155788bf485b4f.939x939x1.jpg"}], "artist": "Future"}