{"songs": [{"title": "Surgical Gloves", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "[Intro: Raekwon]\nEight million stories, nigga\nTake ya'll niggas somewhere, man\nYa'll niggas never heard niggas rhyme like this before, man\nThis ain't no Wizard of Oz shit neither, man\nFor real, man, aiyo\n\n[Verse 1]\nSurgical gloves, snubs in the grass with his blood\nHomie hold that, the four black, we black down\nGold Jag', Ol' laughing yo, yo, what the fuck happened?\nThey clapped him and the scalp it flew that way\nYo why they capped him? It went through his lap\nSnatched his Audemars Piguet, took his man gold, get at\nHe painted it, slayed blocks, aiming it\nHit a child, this is foul, but he styled with his flamer flaming shit\nTeddy with the red Range, supercharged Kangols\nRae & Ghost CD in his change, yo, Angel\nSpanish kid lingo, all I know is where he hang though, kept it sideways, angle\nGood brush, tough talk, keep it real, daddy, got them thangos\nI respect on how the game goes, the same goes\nFor get fresh niggas, test niggas, extra bless niggas, with them egos\nWe blow you out your peacoats\nHaha, dios míos, we get them twelve a ki, yo\nKeep it moving, slide off in the G.O.'s\nFreeloaders, the D's over, your shit won't sell no more\nBreeze over...\n\n[Hook: Raekwon]\nMoney, gear, drugs, guns, Goodyears\nAll my niggas sit, smelling the tears\nCookin snow white, it's just the poor life, never living off fear\nWe all millionaires, now where my shares?\n(Money) You know the code, drug money, gear money, baby\n(Money) You know we fold the stash holders, cash blowers, yeah\n(Money) So when the D's come, we float and grab the boats, yea\n(Money) Spend off, I got my win off, have a potent year\n\n[Verse 2]\nX6's red, up in Albany with the dreds\nBags of black, fuck the feds\nPapers in Aruba's, gold tuba from Bermuda\nIn my living room spreads, cameras action, got the calico cranked\nWhere the food at? Hood jewelry on, I gots to do that\nLong chain hatchet flooded up, you knew that\nBaby blue mac, stones on the nozzle stick\nBulletproof brocco's with the Jew bitches, all I got is two cracks\nGazelle lenses, clear rude wraps, bagging every ziplock\nAnd my peoples sit around, cops split that\nHigh potent white kit kats, we sell up in the hood\nGoing door to door, every floor, every get back\nMy gangsta shit, get gats, for every man, here go a gram\nMeet me by my drophead and drop your lid back\nForty-seven quick claps, spray off on something\n\n[Hook]\n\n[Outro: Raekwon]\nSpray on one of ya'll man, the streets is mine, nigga\nYou know what we do, for real\nStraight up, it's how we playing right now, man\nCuz the streets, man, streets is making ya'll niggas see, man\nBut some of ya'll is blind, for real", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}