{"songs": [{"title": "Never See Me Again", "album": null, "year": null, "lyrics": "[Intro]\nAnd it'll be a long time, before you ever see me again, me again\n\n[Verse 1]\nThey want me, hold my head in shame\nSo I hold 'em on, holding hands in vein\nCouple [?] of the feds say I'm insane\nA psych said I'm going [?]\nAnd then his son told me put down the drink dawg\nI got a [?]\nI guess [?] finna chop it's head off\nI need a little something to knock the edge off\nAside from this song, life sucks\n[?]\n[?] modest\nAnd every, god needs a goddess\nAnd every, star couldn't guide us\nIt falls upon something that's inside us\nSo I [?] with my riders\n[?] with my Riders\n[?]\n\n[Hook]\nAnd I don't like them, and they don't like that\nThey don't like that, and I don't want that\nAnd it'll be a long time before you ever see me again\nDon't worry about me, worry 'bout you\nWorry about something, don't worry what I do\nHating motherfuckers, it'll be a long time\nBefore you ever see me again, me again\n\n[Verse 2]\nSee I need some time to meditate\nNaw bitch I'm fly I need time to levitate\nAnd I don't sound try, tryna' hesitate\n[?] nigga, you a featherweight\nAnd I'm a heavyweight and I'm very great\nI put the everyday rocking in every state\nDo not debate, you cannot cape\nI must've on faith, getting knocked of faith\nGuess it's not faith, guess it was written\nI can sell a phone, guess I was different\nThat was cellphone back then, that was different\nNow I'm spitting and everybody's just spitting\nAnd what it sound like when everybody sound like\nWhat you sound like, bumpin' 'em on a round mic\nI don't even have a knife\nFeel like [?]\nAnd these niggas are secondary like Pippen around Mike\nTrippin' around sight, something on that down light\nI'mma be downright, you niggas is downright biters\nAnd I'mma [?] fighters\nAnd my shit downright fire, from the corner buyer\nAnd I'm alone, eh\n\n[Hook]\nDon't worry 'bout me, don't worry 'bout them\nDon't worry 'bout you, and what you gonna do\nAnd it'll be a long time before you ever see me again\nDon't worry 'bout me, don't worry 'bout me\nDon't worry 'bout you and maybe I do\n[?]\nAnd it'll be a long time before you ever see me again\nDon't worry 'bout me, don't worry 'bout you\nI worry 'bout something not we can do\n[?] me\nAnd it'll be a long time before you ever see me again, me again\nDon't worry 'bout me, na na na na\nAnd it'll be a long time before you ever see me again, me again\nAgain, again\nBefore you ever see me again, me again, again, again\nIt'll be a long time before you ever see me again\n\n[Bridge]\nCan you clap your hands, hands\nClap your, clap your hand, hands\nClap your, clap your hand, hands\nAnd I wanna something, I wanna something then\nCan you clap your hand, hand\nNeed you to clap your hand, hand\nNeed you to clap your hand, hand\nNeed you to clap your hand\nNeed you to clap your hand, hand\nNeed you to clap your hand\nNeed you to clap your hand, hand\nNeed you to clap your hand\n\n[Verse 3]\nSo the song like a Section 8\nSo I pass that dick around like the collection plate\nI can sell 'em on Sunday with the [?]\nI be stunting with the stunnas, and that's the best you make\nSo if everybody just stand now, and shit don't pan out\nThrow your hands up, at least give them a handout\nAnd with the sun shown, it's like the Jerome is\n[?] on the cellphone days, I'm homeless\nOr feeling like Ike at the end of the movie\nWait, just need two more shows just to get to me\nOr feeling like Eddie Kane, I still got it\nAnd it's something but the problem is, you still not it\nOr maybe if it's sicker, they say I'm \"that nigga\"\nOr maybe if [?] is not a cellphone [?]\nOr maybe damn, I could just blow my shit [?]\nMaybe I should stop being real, maybe I should get on Twitter\nMaybe I should [?] I could reconsider\n[?] cellphone liver\nAnd I'mma drink until I can't stand and got no liver\nI can stand and deliver 'til the [?]\nAnd I'mma spit it, like it get it, gonna die by the [?]\nI'd rather live by what I live by, then die when I'm fine\nI'm gonna stand by my self 'til my very last breath\nCause you know what? A coward dies a thousand deaths\nAnd I'm proud [?]\nAnd I could style on [?], hell with this\nYou can't style on me, nigga I'm [?]\nI'm liable to be a liability [?]\nYou plan to style on me, trying to style on me\nNigga, I'm liable to be a liability, and my ability\nI can sound like [?]\n[?]\n\n[Hook 2]\nDon't worry 'bout me, worry 'bout you\nWorry about something, something will do\nAnd motherfuckers, it'll be a long time\nBefore you ever see me again\nSo don't worry about me, I'll be fine\nI'll be up some, going for mine\nAnd it'll be a long time\n'fore you ever see me again, me again\nDon't worry 'bout me, worry 'bout you, worry 'bout you\n'fore you ever see\n\n[Verse 4]\nDon't worry about what I been up to\nWhen the fuck I'm going hard, nigga fuck you\nWho the fuck is going, I can [?]\nWho the fucks asking? I'll put the summer on blast and\nWho the fucks lasting?\nAnd be the last standing\nCaught up on the [?]\nGet a better tan and\nI been feeling dandy\nAnd who can run the planet? Pass them a Xanax\nAnd n afternoon I annex\nAnd all of the damage [?]\nLeft on the [?]\nWho [?] after all, I guess it's a small world after all\nStunting on the sun, cus I have to ball\nI run the world cause it's a small world after all\nAnd I'm never after y'all\nI have to loss somethin' and I got it all\nAnd you feeling like you got it all?\n[?]\nNah nigga, not at all\n\n[Hook]\nWorry 'bout me, don't worry bout me, just worry bout you\nAnd what'chya gon' do?\nIt'll be a long time, before you ever see me again\n\n[Verse 5]\n[?] on the all out, [?] all out [?]\nLast summer, last fight, and y'all had a fall out\nI can sense [?] what y'all 'bout?\nBumping [?]something, and everything that y'all 'bout\nY'all had your ups and downs, you don't fuck around\nPut everything on the [?] something then you go and fuck around\nBet you felt something, now you feel nothing now\nY'all feelings felt something, ya'll don't feel nothing now\nHer tears dried up, [?] a specialist\nI was under [?] and learning what the lesson is\nWhat the ebony of essences, the Genesis\nI got the fetishes, something on the [?]\n[?] and you had to look at innocence\nI wish we just could take it back to the Book of Genesis\nBefore the hook is in is there any point of any of this?\n[?]\n[?] put hands on you, then put his front side and put hands on you\nJust turn around say for really? I'm done motherfucker\nI [?]\n\n[Hook]\nWorry bout me, just worry bout you, I can [?] when I be good\nAnd she said that\nIt'll be a long time before you ever see me again, me again\nDon't worry 'bout me, just worry 'bout you\nAnd I'll be up now, what I've been up to\nAnd it'll be a long time before you ever see me again, me again\nDon't worry 'bout me, don't worry 'bout them\nAnd it'll be a long time before you ever see me again, me again\nMe again, me again\nIt'll be a long time before you ever see me again", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}