{"songs": [{"title": "It’s All G", "album": "A Year and a Day", "year": null, "lyrics": "Ay, it's all G homie\nDon't worry about it, I'll carry the load pimpin'\nOh you don't gotta take the heat, you know\nGod will never give you any more then you can handle\n\n(Chorus)\nEven though I'm wanted dead or alive\nBy the jackers and the robbers and the federal guys\nI keep my head to the sky\nEmbrace the pain\nI'm facing twenty-five but I can't complain\n(It's all G) I done walked through the fire before\nHey I survived when them guys open fire before\n(It's all G) Let the haters conversate on me\nSince he too weak to take the heat just put the weight on me\nIt's all G\n\nHey, let me tell ya how you measure a man\nWhen his world start to fall see how tall he stand\nWill you fold under pressure when the feds come and get ya\nCan you hold it together? Think so? Well, that's special\nWill you have the same swagger when the world laughing at ya\nAct like nothing the matter till ya girl have to ask ya\nWell ya armour keep cracking, or will ya keep laughing\nBe the same person even if you ain't perfect\nWhen you hear them lame verses will you say it ain't worth\nOr blow it all make a call and send them goons lurkin'\nOne thing's for certain, two things fa' sho'\nI might be hurting but I won't even complain, you know\nI keep my head to the sky save the crying for the cowards\nKeep your face dry, better do it in the showers\nWipe it off with a towel, no emotions to show\nKeep the windows closed to the soul you know\nIt's all G\n\n(Chorus)\n\nRemember first God with you, you done seen worst\nJust know there gotta be a purpose don't think he ain't working\nSometimes he gotta sit you down and do some soul searching\nListen, hear, answer, learn that from an old person\nHe can show you things you use to take for granted\nThen give it back again better than you had it then\nAnd reveal to you your real friends then\nYou reach a hand out to him he'll extend his\nNow you feel like you can carry the load\nSomehow you feel like you can get through what was scary before\nIt's all G, it's like I've never been scared before\nA long time ago I shoulda been dead, you know\nThrew a middle finger to the reaper when he took shots at me\nHe got my best friend and he still not happy\nHe want me in a casket? Well let him come and catch me\nTell whoever asking man, I feel fantastic\nIt's all G\n\n(Chorus)\n\nI just wonder what got him so upset\nGuess cause I'm the best that's what I get\nMaybe cause when I talk more than all of Atlanta listen\nThey want to see me suffer, won't give him the ammunition (Ha!)\nNo pun intended I don't mean to be long winded\nBut I gotta ask this question ya'll before this songs ended\nWould you let 'em see you sweat or let 'em see a vet\nWho ready for whatever, they can never disrespect\nI got through out it all I keep my chest up out my head high\nAlthough the haters threw they best as they said, I\nWas a done dollar, but I just come harder\nI went through all that just to become smarter\nAnd tomorrow I can see it in the headlines\nT.I. not guilty, wave goodbye to the bad guy\nThe kind of man that they done seldom seen\nEven though they wanted me in jail, all hail the king\nIt's all G\n\n(Chorus)", "image": "https://images.genius.com/07b58bbb55162f134918e0fb84589756.500x500x1.jpg"}], "artist": "T.I."}