{"songs": [{"title": "Spaceship", "album": null, "year": null, "lyrics": "[Intro: Easy-Wider ft. Wiz Khalifa]\n(Yeeuh)\nThis one goes out-(I gotta go)-to all my aliens and weirdo's out their\n(Laughs) Me I'm high on (Yep) that stuff\nGood weed that is\nIt's ya man Easy-Wider\n(I'm on another level-)\nW.E.E.D, (-somewhere outta state or another planet.)\nBrand new Wiz Khalifa (I'm in control like Janet, damnit.) (Laughs)\n(Yeah) We gonna show you how to fly lets go\n\n[Verse 1: Wiz Khalifa]\nI'm somewhere off in Pluto\nAin't close to nothin' you know-or ever seen\nI smoke heavy green, I never lean\nBut its drink in my cup\nA whole lot of stink in my blunt\nLouis Vuitton, boy this Gucci he got on\nFuck the charms see the shoes he got on?\nAnd my songs' why the groupies are gone\nPimp juice by the two liter gone\nI live on some other shit\nEvery week another bitch, ain't drunk sex who you fuckin' wit?\nNot me, I'm in another galaxy, get your telescopes\nMy flow is hella dope, punch lines never been the type tell a joke, nope\nSo fresh you can smell the soap\nBoy you know I'm high, you ain't gotta smell the smoke. (Laughs)\nI'm finna take a flight out, found me a Hollywood hideout, yeah\nSome superstar shit what I'm bout\nWrite what I live, live what I rhyme 'bout\nWhen Knot come home, I'm gon' see him when he land\nWhen Skirts come home, I'm gon' see him when he land\n\n[Hook: Wiz Khalifa]\nSo fly I need a spaceship\nSo high I feel like I got a face lift\nI can't say shit, but-(Inhale)\nSo fly I need a spaceship\nSo high I feel like I got a face lift\nI can't say shit, but-(Inhale)\n\n[Verse 2: Wiz Khalifa]\nWhen light come home, I'm gon' see him when he land\nHater talk wrong, leave him leakin' where he stand\nQua on the ship too, I'm gon' see him when he land\nFor all this money talk, I'm gon' need a rubber band, man\nLotta bitches on my penis and I heard they all from Venus\nThey know I'm heavy hustle so them hoes run out to meet us\nThat money come fast as light speed-us, Jesus\nAnd no ain't no standing here\nThe whip so sick it got landing gear\nSo high I need my man to steer\nSledren got me feeling like the man in here\nNo paper just flying, yellow diamonds\nAnd my chain I'm Orion, no lying\nI'm somewhere out the Ozone wit it\nNo dime I need the whole-(Um)\n\n[Hook]\n\n[Bridge]\nGot damn Murphy, (Yeaaahhh)\nWe light years ahead of ya'll mane.(Laughs)\nDon't even use gas man,(Yeah)\nBang in left through the one hole\nGo sit on the two niggas (Yep) next to Pluto\nYou feel me. (Uh-Huh)\nHeavy Hustle ho. (Heavy Hustle ho)\n\n[Outro]\nI been there, I seen it, I done it\nWhen it come down to that money, I need that, I want that, yeah\nI been there, I seen it, I done it\nWhen it come down to that money, I need that, I want that, yeah\nI been there, I seen it, I done it\nWhen it come down to that money, I need that I want that\nI see a bad bitch, I need that I want that\nI'm tryna get high, where my weed at where my blunt at?\nI'm tryna get high, where my weed at where my blunt at?\nWhen it come down to that money, I need that, I want that, yeah", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg"}], "artist": "Wiz Khalifa"}