{"songs": [{"title": "Sekou Story", "album": "Street’s Disciple", "year": "2004-11-30", "lyrics": "[Verse 1: Nas]\nUh, I knew a few pharmacists, fuck frozen\nThey kept pneumonias on their arms and wrists\nThe main dude, Sekou, face look hard as shit\nRemember like yesterday, they were the kings of ecstacy\nKept sellin' it, he blends in everywhere, has a mixed heritage\nBitches let him hit on the reg', waterbed seats in his car\nAll red Ferrari, Florida where we met at a redlight\nHomeboy bumpin' my old shit\nThey wildin' with some freaks from the islands\nPiled in behind him, limosine, Benz\nHe shouted, \"Nas, roll with us\"\nI'm bored so I followed him\nNikki Beach, here's where the scene begins\nHe put me on to Dawn, nice ass with a set of mean twins\nHad a pocket full of cash, Sekou wasn't lettin' me spend\nI was there for the weekend, packed and prepared for anything\nThen he brings me to his castle in Coconut Grove\nWar stories about dudes both of us know\nNever heard drunken words spoken so slow\nA year go by, the nigga was fly\nPrada shoes, a lotta jewelry, stayed high\nGot a call, he's in N.Y\nNeeds a couple of G's 'til tomorrow, I dips by\nFor a season where he's at\nGreets me with a smile, told him \"Here keep that\"\nNext week got a call from his wife\nSaid somebody done took son life\n*beat changes*\nShe said\n\n[Nas as Scarlett - repeat 2X]\n\"Who gon' hold me down now? Hold me down now\nTell me that huh -- who gon' hold me down now?\nWho gon' hold me down now? Who gon' hold me down?\nTell me that huh -- who gon' hold me down now\"\n\n[Nas as Scarlett]\nForget about them other dudes, they talkin' to me rude\nCause I always knew the truth, they hated Sekou\nH2 full of holes, the drove him off the road\nLeft him there on Biscayne, clothes stained with his brain\nMy soul shattered, my man's toe's tagged up\nArrangement's a closed casket\nSee now a ho has to, maintain with his fake gang\nSheddin' fake tears, I won't have it\nLook, this kid's Jamaican -- half Hatian, half Asian\nBrag about how the streets needed a changin'\nSon, you the only one a bitch could call\nYou remind me of my dude, help me get them all\n\nNas: \"Di-sci-ple\" *scratched by DJ 3X*\nScarlett: \"You remind me of my dude, help me get them all\"\nNas: \"Di-sci-ple\" *scratched by DJ 3X*\nScarlett: \"You remind me of my dude, help me get them all\"", "image": "https://images.genius.com/65c98702fc773f6dafd41563fe5c5485.500x500x1.jpg"}], "artist": "Nas"}