{"songs": [{"title": "That’s That", "album": "Born Like This", "year": "2009-03-24", "lyrics": "[Verse]\nAlready woke, spared a joke, barely spoke, rarely smoke\nStared at folks when properly provoked, mirror broke\nHere, share strawberry morning, gone an more important spawning\nTorn in, poor men sworn in\nCornish hens switching positions, auditioning morticians\nSaw it in a vision, ignoring prison\nIgnoramuses enlist and sound dumb\nFound 'em drowned in cow's dung, crowns flung\nRings a Tinkerbell, sing for things that's frail as a fingernail\nBring a scale, stale ginger lingers\nSeven figures invigor\nNigga, fresh from out the jail, alpha male\nSickest ninja injury this century, enter plea\nLend sympathy to limper Simple Simon rhyming emcees\nTrees is free, please leave a key\nThese meagre fleas, he's the breeze\nAnd she's the bees knees for sheez\nG's of G's\nSeize property, shopper sprees, chop the cheese\nDrop the grease to stop diseases, gee wiz pa!\nDOOM rock grammar like the kumbaya\nMama was a ho hopper, papa was a Rolling Stone star like Obama\nPull a card like oh drama\nCivil liberties\nThese little titties abilities riddle me, middle C\nGive a MC a rectal hysterectomy\nLecture on removal of the bowels, foul technically\nDon't expect to see the recipe\nUntil we receive the check as well as the collection fee\nMore wreck than Section Z\nWhat you expect to get for free?\nShit from me, history\nThe key, plucked it off the mayor\nChucked it in the ol' tar pit off La Brea, player\nThey say he's gone too far\nDOOM'll catch em after Jumah on cue lacka!!\nDo whatcha gotta do, grarrrr\nThe rumors are not true, got two ma\nNo prob, got the job, hot-barred heart throb\nScotchguard the bar with cotton swabs, dart lob\nBake a cake, sweet\nJamaica trade in treats on the beach\nMake her skeet til her feets meet\n\nCan it be I stayed away too long?\nDid you miss these rhymes when I was gone?\nAs you listen to these crazy tracks\nCheck them stats then you know where I'm at\nAnd that's that\n\n[Audio Clip: Unknown, Kathleen Turner, Christopher Lloyd]\nLook, there's Doom now!\nI followed him to the studio, but I was too late to stop him\nThat's right! You'll never stop me! You're dead! You're all dead! Doom!", "image": "https://images.genius.com/01edf9d69a6ac635d7ca4d452539e8ce.1000x1000x1.jpg"}], "artist": "MF DOOM"}