{"songs": [{"title": "Paid in Full", "album": "Paid in Full", "year": "1987-07-07", "lyrics": "[Intro: Eric B. and Rakim]\nYo Rakim, what's up?\nYo, I'm doing the knowledge, E, man I'm trying to get paid in full\nWell, check this out, since Norby Walters is our agency, right?\nTrue\nCara Lewis is our agent\nWord up\nZakia and 4th and Broadway is our record company\nIndeed\nOkay, so who we rollin' with then?\nWe rolling with Rush of Rushtown Management\nCheck this out. Since we talkin' over this def beat right here that I put together. I wanna hear some of them def rhymes. You know what I'm sayin'? And together we can get paid in full\n\n[Verse 1: Rakim]\nThinkin' of a master plan\n'Cause ain’t nothin' but sweat inside my hand\nSo I dig into my pocket, all my money spent\nSo I dig deeper, but still coming up with lint\nSo I start my mission, leave my residence\nThinkin', \"How could I get some dead presidents?\"\nI need money, I used to be a stick-up kid\nSo I think of all the devious things I did\nI used to roll up, this is a hold up, ain’t nothing funny\nStop smilin', be still, don’t nothing move, but the money\nBut now I learned to earn 'cause I’m righteous\nI feel great, so maybe I might just\nSearch for a 9 to 5, If I strive\nThen maybe I’ll stay alive\nSo I walk up the street, whistlin' this\nFeeling out of place, 'cause man do I miss\nA pen and a paper, a stereo, a tape of\nMe and Eric B and a nice big plate of\nFish, which is my favorite dish\nBut without no money, it’s still a wish\n'Cause I don’t like to dream about gettin' paid\nSo I dig into the books of the rhymes that I made\nSo now's a test to see if I got pull\nHit the studio, 'cause I’m paid in full\n\n[Outro: Eric B. and Rakim]\nRakim, check this out\nYo, you go to your girl's house and I'll go to mine\n'Cause my girl is definitely mad 'cause it took us too long to do this album\nYo, I hear what you're sayin', so let's just pump the music up and count our money\nYo, well check this out\nYo, Elai\nTurn the bass down and just let the beat keep on rockin'... and we outta here\nYo, what happened to peace?\nPeace, peace, peace\n\n[Produced by Eric B.]", "image": "https://images.genius.com/f102814939a97eb3a27e9e27da36c213.600x600x1.jpg"}], "artist": "Eric B. & Rakim"}