{"songs": [{"title": "Female Players", "album": "What’s My Favorite Word?", "year": null, "lyrics": "[Woman] Only fuck with these silly-ass boys for fun\n[Woman] Get 'em all alone, and a thug is hung\nScreamin aiyy-yah, aiyy-yah\n[Woman] Only fuck with these silly-ass boys for fun\n[Woman] Get 'em all alone, and a thug is hung\nScreamin aiyy-yah, aiyy-yah\n\n[Too $hort]\nI like them wild girls, the way they throw that\nWhen the music ghetto, and she don't hold back\nI wanna see her wiggle, when I stick it in her\nCall me the champ, cause my dick's the winner\nBitch! It's internationally known\nI picture in my mind, you look nasty in thongs\nYou probably do it just like you dance (player)\nYou bout to bust out your pants\nYou got.. too much ass in your jeans\nThrow it my way, I'm not passin a thing\nAre you a pleaser, or a teaser?\nR&B diva or a skeezer?\nTo me, it's the same difference\nI do my thang in the game, pimpin'\nDon't worry bout me, cause I'mma do mine (damn)\nDamn this bitch is too fine\n\n[Hook: Too $hort] + woman\n[Woman] Only fuck with these silly-ass boys for fun\n[$hort] I like female players\n[Woman] Get 'em all alone, and a thug is hung\nScreamin aiyy-yah, aiyy-yah\n[Woman] Only fuck with these silly-ass boys for fun\n[$hort] I don't like them squares\n[Woman] Get 'em all alone, and a thug is hung\nScreamin aiyy-yah, aiyy-yah\n\n[Too $hort]\nYeah she got dough, she get her hustle on\nYou can't buy that girl out, fool what you want?\nShe get her own table, buy her own bottles\nLook in her purse, she got long dollars\nNow you wonder why she hangin with me\nYou curious how my game could be\nPlayin broads ain't a thang to me\nIt must be a sign up but you can't see (player)\nIt's right there in your face\nThrow the peace sign up all the players in the place\nLook around, it's time to go to work\nI'm tryin to flirt with little momma in the shortest skirt\nI think she with it, but I don't wanna just hit it\nI wanna get explicit\nAnd if she kiss it, it's bound to get good\nTomorrow mornin I'll be cruisin round the bitch hood\n\n[Hook] w/ minor variations\n\n[Too $hort]\nAll my female players, gather around\nIt's a roller coaster baby you at Magic Mountain\nSix Flags on a holiday\nYou wanna ride again girl you ain't gotta wait\nYou never have to stand in line for the ride\nJust take a few hits cause I'm tryin to get you high\nI can't tell you to loosen up\nBut I can say I love the way you move your butt\nLet's make it happen, you wanna go home with me?\nSo I don't wake up in the mornin all lonely?\nWe can't compromise, I won't promise you lies\nBut I will make you feel it 'til the sun rise\nAnd if you wanna know what it's like\nAsk all the top notches in the club tonight\nThey'll tell ya, I ain't tryin to find a wife\nBut if you fuck with Short Dawg you'll have the time of your life\n\n[Hook] w/ minor variations\n\n[Too $hort] I like female players", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}