{"songs": [{"title": "Sk8", "album": "No Genre: The Label", "year": null, "lyrics": "Intro:\nX6 Skate (Skate)\n\nHook: (London Jae)\nYoung nigga on my grind, but I don't (Skate)\nX6 (No I don't skate) Skate\nNo, I don't got no time don't make me(Wait )\nX3 (Don't make Me) Wait\n(No no no no)\nI don't ever go broke, ' don't take no\n(x3 Breaks)\nWith the Mozart ride with the toast, boy you know I got a lot on my (x6 Plate)\n\nBridge:\nY'all niggas on my grind but I don't...\n\nVerse: 1 (Jake Lambo)\nThese niggas ain't really all that, tryna be on top like a cap on a bald head\nFriends told me that they wouldn't cross me and they all did\nI'm just getting busy killin' rappers, leave 'em all dead\nAll I know is us, bro, fuck what y'all said\nRay 's in the jungle so my best friend 's Tarzan\nWant it? Imma get it, pull strings like harp players\nYoung ones tryna ball, but I don't really walk near\nI be grindin', I'm grindin', I'm grindin', I'm grindin', I do\nWon't catch me slippin', man, they just be trippin'\nThey trippin', I tell em to lace up your boots\nDoing what I want, don't play by the rules\nI'm not a teacher, but you can get schooled\nShe not a lightbulb, but she can get screwed\nHe  just be lethal when he's in the booth\nI don't know people, I sit with my crew\nDo get it, my right, no left\nOh yes let em know I want some more checks\nMy girl be trippin', I work it out like both flex\nYour girl keep trippin', be askin' me for more sex\nOh, what you wanna do?\nTryna get this money, tell em follow me like vamanos\nSpot em like a domino, Hit 'em with the dummy flow\nThis ain't the future, you got me shinin' like a dinosaur\n\nInsert Hook and bridge\n\nVerse: 2 (JaqueBeatz)\nDo tricks, your honor\nShe get the wood acoustic, your honor\nShe act like she don't do shit, your honor\nBut she walked here like the shoe fits, your honor\nAnd those ain't retro, she blowin' me, ex though, she sit in the Esso\nIs  she with you, cuz I go a prime ape in the chimp too\nYou Charlie errin', this hurricane fixes you\nSo when the cameras rollin', better act right, bitch\nBut side chicks only get the half-pipe, bitch\nThese niggas turn on you than they jack-knife, bitch\nI protectin' all my green, holla' cacti, bitch\n(Ahhh)\nFit your'e bright, cocaine crack white bitch\nGet a CAT scan all we see is pussy in you\nNo wonder you out here movin' so cat-like bitch\nMy Negro, I been on my shit though\nI'm an influenza, you been on your menstrual\nYou ain't even understand. you ain't even on your ten toes\nBoy, I just be sketchin' on your lady with my pencil\nAnd so, Eraser broke, but if you raise a ho\nImma carve her into stone, Your Michaelangelo\nMight turn her into a banking roll, turn on the channel ho\n?????\n\nInsert hook and bridge\n\nVerse 3: (B.o.B)\nNever really rode on four wheels\nShe can ride a surfboard like a pro still\nI keep the money on auto like mobile\nEat it out the box in the morning like oatmeal\nNigga, I'm straight. Imma send her home before I hug 3rd base\nI'm shelf, bitch. Sell like I'm on eBay and niggas want beef like the FDA\nWe could up these stakes, with a side of some Vino Blanco, Torpedo Launch code\nClose curtains on 'em, I don't need Article\nA nigga mile-high like the Denver Broncos\nI'm so high, they like, \"have you see where Bob goes?\"\nPussy weed and Presidents x2\nHeard you hatin' on the squad right?\nWell, suck my dick like its a peppermint\nWakin' up to residents, cameras poppin', Serve bands a lot\n? and art, Sir Lance-A-thot\nBeatin up the block, Jay Lambo, and Bob\n6 Bitches, three legs, tarantula\nBut she on the tris on the [?]\nShe speak on her knees, on her knees\nAnd I heard her boyfriend getting salty\nCuz she keep my cd\n\nInsert hook", "image": "https://images.genius.com/75e7f10bcbceaf55df2abb72f70543f1.500x500x1.jpg"}], "artist": "B.o.B"}