{"songs": [{"title": "Never Let You Go", "album": "Strange Clouds", "year": "2012-01-01", "lyrics": "[Intro: Ryan Tedder]\n1,2,3\n\n[Chorus: B.o.B]\nThey can take these clothes off my back\nThey can take my money\nDon't care about that\nLet them take my words\nIt’s all I've got\nThey can have this fame\nIt ain't worth a lot\nOnly thing I know, is I'll never let you go\n\n[Verse 1: B.o.B]\nAs she takes the stand\nBy the look in her eyes I can tell that’s she knows\nThat she’s holding the fate of my world in her hands\nDamn, fo’ real\nThis was never the plan\nIt was never intended for her to end up the defendant\nAnd I guess it just happened by chance\nDamn, and you hope\nYou hopin’ that a miracle happens\nYou prayed that the Judge doesn't bang that gavel\nJust so you can go back and avoid a disaster\nAnd you could still be holding her hand\nLike the last note of the saddest song\nWe’re like the last word at the end of the poem\nYou know, sometimes there's nothing worse than being alone\nIt’s funny how you never know what you got ‘til it’s gone\n\n[Chorus]\n\n[Hook: B.o.B]\nWon’t let you go\nNo, never gonna let you go\nWon’t let you go\nNo, never gonna let you go\nWon’t let you go\nNo, never gonna let you go\nWon’t let you go\nNo, never gonna let you go\n\n[Verse 2: B.o.B]\nWhat’s the one thing in this life that you live for?\nWho do you know in the world you would die for?\nWho would lie for?\nWho if they committed a crime you would stop on a dime and do time for\nCuz it was me she would lie for\nAnd that was her that I cried for\nNow I’d give it all away to get her back\nCuz she ain’t free, no, this ain’t no July 4th\nYea, no, it don’t sound logical\nBut there’s some things in this life that you gotta do\nBrother, one thing in this world that got to you\nI’d let it all go but I ain’t dropping you\n\n[Chorus + Hook]\n\n[Outro]\nIt might be wrong or it might be right\nBut there’s no looking back and we won’t sleep tonight\nWe’re living while we’re young and this is worth the fight\nEven if I lost it all\n\n[Chrous + Hook]", "image": "https://images.genius.com/5a3389828b8e82878033f8e842711c94.540x540x1.jpg"}], "artist": "B.o.B"}