{"songs": [{"title": "Jesus Loves", "album": null, "year": "2019-09-02", "lyrics": "Uh, check your brain matter\nDo you care if your wife’s brain splatters?\nWhat about Jesus? Does he matter?\nIs he in your life? Do you love your wife?\nThese are all questions to ask yourself\n\nDo you wear a white or a black belt?\nDo you care if you kid orders a chicken melt?\nThese are all questions to ask yourself\n\nOHHHHHHHHH\n\nI woke up and I said - Jesus I love you\nI don’t care if you’re black and I don’t care if you’re blue\nI went to my coworker and he said I can smell you\nDo you shower? Do you wear cologne?\n\nDo you even care if your penis is showing?\nThese are all questions to ask yourself\n\nThis morning I drank coffee. Spilt coffee\nDon’t cry over spilled milk don’t cry woman\nI looked up and Jesus said don’t cry woman don’t cry woman\n\nOOOOHHHHH\n\nBlack lives matter if you open your eyes\nIs my death about my wife or my life?\nYou wanna know the size of my penis? What’s the size of your knowledge\n\nJust fell off my scooter. You asked me if my knees hurt. I looked up at your eyes and you smelled of reefer. I took you in and showed you Jesus. It’s not I love Jesus. It’s we love Jesus\n\nYou tell me you’re not racist. Why haven’t you seen crazy rich Asians?\n\nYou gave life of pi a 6/10 - would you like it more if there was a white guy named Ben?\n\nCheck your socks for congruence - don’t you know brain matter is fluid? You can still go back to school Darnell you can still go back to school Darnell\n\nYou hit me up on FaceTime - asking for hoes on FaceTime why don’t you man up and face time? Or give your mother some face to face time. MAN\n\nYour whack rap and your ad libs are making your mind weak\n\n\nMy wife is a pterodactyl\nShe spin my dick like axel\nNo whites v blacks this ain’t no battle\nAll you youngings get a ride to church like cattle\nI’m the saddle and you the horse\nI don’t fuck with whores\nI do my chores\nAnd of course\nI’m on course\nI got force\nI drink coors\nI write cords\nYou look in the mirror but you don’t see her\nIt ain’t clear\nYou don’t have vision\nYour superstitions\nLike my circumcision\nEat the foreskin bitch\nDon’t tell on your mommy bro don’t be snitch\nIf she is witch you can’t wife\nYou don’t wanna see her boobs you wanna see her mind\nAnd I don’t mind to see a movie with some whites\nBut I don’t like it when the whites see me and start some fights\nIt’s not alright it’s not okay\nI don’t care if straight or gay\nYou know what I’m trying to say\nI’m on my way man\nReese’s pieces Jesus piece Rest In Peace\nYou hold your soul man just go and pee\nI watch you hittas like cinemasins\nI eat raw chicken like it’s cinnamon sticks\nYou bish\nMy penis is real if you wanna see it brother\nI wake up in the morning I call my mother\nWhen is the last time you called your mom\nYou banging girls like rom com\nMy pubes like Pom Pom\nAnd my dick is circumcised\nI’m young sir cum wise\nI’m J.Cole and I got old flows my flow is but into a bowl", "image": "https://images.genius.com/9db1a9643a028d62543e44c90da3a6ad.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}