{"songs": [{"title": "Rhyme or Reason", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Intro: Sample + Eminem]\nYeah, yeah\nYeah, yeah yeah\n(\"What's your name?\") Marshall\n(\"Who's your daddy?\") I don't have one\n\n[Verse 1]\nMy mother reproduced like the komodo dragon\nAnd had me on the back of a motorcycle, then crashed in\nThe side of loco-motive with rap, I'm\nLoco, it's like handing a psycho a loaded handgun\nMichelangelo with a paint gun in a tantrum\n'Bout to explode all over the canvas\nBack with the Yoda of rap, \"In a spasm\nYour music usually has 'em\nBut waned for the game your enthusiasm it hasn't\nFollow you must, Rick Rubin my little Padawan.\"\nA Jedi in training, colossal brain and\nThoughts are entertainin'\nBut docile and impossible to explain and, I'm also vain and\nProbably find a way to complain about a Picasso painting\nPuke Skywalker, but sound like Chewbacca when I talk\nFull of such blind rage I need a seein' eye dog\nCan't even find the page I was writing this rhyme on\nOh, it's on the ram-page\nCouldn't see what I wrote, I write small\nIt says, \"Ever since I drove a '79 Lincoln with whitewalls\nHad a fire in my heart\nAnd a dire desire to aspire to Die Hard.\"\nSo as long as I'm on the clock, punching this time card\nHip-hop ain't dying on my watch\n\n[Chorus]\nNow sometimes when I'm sleepin'\nShe comes to me in my dreams\nIs she taken? Is she mine?\nDon't got time, don't care, don't have two shits to give\nLet me take you by the hand to promised land\nAnd threaten everyone\n'Cause there's no rhyme or no reason for nothing\n\n[Bridge: Sample + Eminem]\n(\"Now, what's your name?\") Marshall\n(\"Who's your daddy?\") I don’t know him, but I wonder—\n(\"Is he rich like me?\") Ha\n(\"Has he taken any time to show you what you need to live?\")\n\n[Verse 2]\nNo, if he had\nHe wouldn't have ended up in these rhymes on my pad\nI wouldn't be so mad, my attitude wouldn't be so bad\nYeah, Dad, I'm the epitome and the prime\nExample of what happens when the power of the rhyme\nFalls into the wrong hands and\nMakes you want to get up and start dancin'\nEven if it is Charles Manson\nWho just happens to be rappin', blue lights flashin'\nLaughin' all the way to the bank, lampin' in my K-Mart mansion\nI’m in the style department\nWith a pile in my cart, rippin' the aisle apart but\nWith great power comes\nAbsolutely no responsibility for content\nCompletely despondent and condescending\nThe king of nonsense and controversy is on a\nBeat-killing spree, Your Honor\nI must plead guilty, 'cause I sparked a revolution\nRebel without a cause who caused the evolution\nOf rap, to take it to the next level, boost it\nBut several rebuked it, and whoever produced it\n(\"Hip-hop is the Devil's music\")\nDoes that mean it belongs to me?\n'Cause I just happen to be a white honky devil with two horns\nThat don't honk but every time I speak you hear a beep\nBut lyrically I never hear a peep, not even a whisper\nRappers better stay clear of me, bitch, 'cause it's the—\n\n[Chorus]\nIt's the time of the season\nWhen hate runs high\nAnd this time, I won't give it to you easy\nWhen I take back what's mine\nWith pleasured hands\nAnd torture everyone, that is my plan\nMy job here isn't done\n'Cause there's no rhyme or no reason for nothing\n\n[Bridge: Sample + Eminem]\n(\"What's your name?\") Shady\n(\"Who's your daddy?\") I don’t give a fuck, but I wonder\n(\"Is he rich like me?\") Doubt it, ha\n(\"Has he taken any time to show you what you need to live?\")\n\n[Verse 3]\nSo, yeah, Dad—let's walk\nLet's have us a father-and-son talk\nBut I bet we wouldn't probably get one block\nWithout me knocking your block off, this is all your fault\nMaybe that's why I'm so bananas I a-ppealed to all those walks\nOf life, whoever had strife\nMaybe that's what dad and son talks are like\n'Cause I related to the struggles of young America\nWhen their fucking parents were unaware of their troubles\nNow they're rippin' out their fuckin' hair again, it's hysterical\nI chuckle as everybody bloodies their bare knuckles\nYeah, uh-oh, better beware, knuckle heads!\nThe sign of my hustle says:\n\"Don't knock, the door's broken, it won't lock\nIt might just fly open, get cold-cocked\nYou critics come to pay me a visit?\nMisery loves company, please stay a minute!\"\nKryptonite to a hypocrite\nZip your lip if you dish it but can't take it\nToo busy gettin' stoned in your glass house\nTo kick rocks, then you wonder why I lash out\nMr. Mathers as advertised on the flyers, so spread the word\n'Cause I'm promoting my passion until I'm passed out\nCompletely brain-dead: Rain Man\nDoing a Bankhead in a restraint chair\nSo, bitch, shoot me a look, it better be a blank stare\nOr get shanked in the pancreas\nI'm angrier than all eight other reindeer\nPut together with Chief Keef 'cause I hate every fuckin' thang, yeah\nEven this rhyme, bitch\nAnd quit tryin' look for a fuckin' reason for it that ain't there\nBut I still am a \"Criminal!\"\nTen-year-old degenerate grabbin' on my genitals!\nThe last Mathers LP done went diamond\nThis time I'm predicting this one will go emerald!\nWhen will the madness end?\nHow can it when there's no method to the pad and pen?\nThe only message that I have to send\nIs: \"Dad, I'm back at it again!\"\n\n[Outro]\nYeah… (Who's your daddy?)", "image": "https://images.genius.com/2c354260f9edc6b2e9bf6b06c935a0b8.1000x1000x1.png"}], "artist": "Eminem"}