{"songs": [{"title": "Simon Says (Street Games)", "album": "M.I.C. (Make it Count)", "year": "2004-10-26", "lyrics": "[Intro: Royce]\nI'mma hit you until you, hit you until you\nHit you until you, hit you until you\nI'mma hit you until you, hit you until you\nHit you until you, hit you until you\nI'mma hit you until you STOP, hit you until you GO!\nHit you until you DROP, hit you until you ROLL!\nI'mma hit you until you BLEED, hit you until you LEAVE!\nHit you until you.. yeah, yeah\n\n[Verse 1: Royce Da 5'9\"]\nI put in my dirt I'mma hurt you\nBullets is Eeny Meeny Miny Moe, don't put your foot in my circle\nYou must be ruthless, or you will die hidin\nBeside a bunch of chicken niggas that Duck Duck Goose\nI'm not a hater nigga\nYou punks got a 50/50 chance of livin, you playin Rock Paper Scissors\nWhy the FUCK would I knuckle up witcha?\nI got twin Glocks from Scotland, I'd rather Double Dutch witcha\nHe played them street games 'til the heat came\nSame nigga that be changin quick when they see brains\nWe ride in streets with Mafia ties\nWe pop up by surprise like we playin +Hide-And-Go-Seek+\nAnd I'm about to draw the line nigga, talk to your soldiers\nCross me, you try to knock a stick off of my shoulder\nNigga I will heat you, 5'9\" will have you lyin beside your bed\nI'm the nigga Simon Says\n\n[Hook: Royce]\nI'mma hit you until you STOP, hit you until you GO!\nHit you until you DROP, hit you until you ROLL!\nI'mma hit you until you BLEED, hit you until you LEAVE!\nHit you until you, hit you until you\nI'mma hit you until you STOP, hit you until you GO!\nHit you until you DROP, hit you until you ROLL!\nHit you until you BLEED, hit you until you LEAVE!\nHit you until you\n\n[Verse 2: Royce Da 5'9\"]\nYeah yeah, I see pain but why\nIs it these street games is all leadin into the same violences?\nGod is it, possible the same niggas\nThat's winnin in Dodgeball will grow up and dodge bullets?\nThe funky little, two squares\nIn this concrete jungle was shootin the Monkeys In The Middle\nIf you compare me to anyone in this game\nIf it ain't Shyne or Beans then it's Truth Or Dare\nI been this hollow inside for years\nLeave peers beside beers that'll Spin The Bottle\nDon't think that e'ry night seem right\nNigga just look beside you, I'm at every Red Light, Green Light\nReady to stop you, fatally\nI'll leave bullets inside your truck the size of Hot Potatoes\nA comparison's vital - you ain't nobody\nRoyce 5'9\" is Simon, the Americal Idol\n\n[Hook]\n\n[Verse 3: Royce Da 5'9\"]\nYeah, yeah, now he's had the luck as\nThe same dumb fuck that took toes to the morgue for Freeze Tag\nMiss the clock is tickin away\nAt the pick of the day the hot shot, let's play Hop Scotch\nLet's teach all of these punks\nThat we as venomous as snakes, you can be them Leap Frogs and jump\nI'mma make 'em all drop and say \"Ahh\"\nI'm the king of the playground, I make 'em say Father May I\nYou should say Grace - cause even if you\nBring your own pencil to the game nigga we don't play Breaks\nNow you gon' find your fitted\nIn the Lost & Found cause you crossed your bound nigga Hide and go get it\nFinally the dudes be lame\nHis name booted out of the games, hang by the dooky chains\nErase the phonies - keep his team shooter\nThen flee the scene while runnin in the latest Ponies\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}