{"songs": [{"title": "Outside the Lounge", "album": "Lyricist Lounge Volume One ", "year": null, "lyrics": "[Lilscienz]\nYo, freestyles, reside to the e-ventually\nYou might see me, kick the spree\nGet the tape in the Benzi box\nUp in club spots\nOn a regular base\nAnytime and place\nWhat? Like Janet\nI slam kids\nHarder than Shaquille O'Neal down to the masses\nI take crews back to, um, hip-hop classes\nBecause they didn't surpass this\nWe reside actually, acrobatically, yo...\n\n[???]\nCome and burn me if you spit words of flame from your brain\n(What?) Rugged terrain, style insane, you's the lame\n(Huh) Freestyle or written strictly shittin' on emcees\nDrop these mad degrees on emcees\nEveryday, every night\nYou fight for the mic, but you can't handle it\nI dismantle it, bust you in your head with it\nYou know you can't spit it like I spit it\nYeah you shit it in the toilet bowl\nYou know I got nuff soul\nY'all control the core cipher\nYou know we drop this, and got emcees following like the Pied Piper\nYou know we hyper, so...\n\n[Wiseguy]\nYo, yo, yo; can I get a chance to drop in the cipher?\nSet the shit on fire\nYo why the, beat stop?\nI don't know, the beat-box is coming in\nGot you counting from one to ten\nAnd by the time you get up to nine, your ass is left behind\nCause you can't mess with the lyrical master rhymes\nSlay niggas to pass the time, coming off the mind or the brain\nCan't maintain, I'm type strange\nAnd ill, in the mind of Wiseguy, that's right\nI'm the baddest on the mic, I'm average height\nGot a huge appetite, sorta like Iron Mike\n'Cept I don't bite, I just fight, with raps I write\nUse the left and the right, recite styles that's hype off the top\nPardon me but stop the beat-box\nCause yo I got beats son\n(Aw word?) (Aight) My bad, I didn't mean to kill that shit. (That's alright\nMan, y'know what'm sayin?)\n\n[Talib Kweli]\nThe beats is always love, y'know what I'm sayin'?\nNiggas always show love with the beats\n(My little yellow box, always come in handy) Y'know what I'm sayin'?\nYo, this is like a wack emcee's nightmare, y'know what I'm sayin'?\nThats why I'm right here, y'know what I'm sayin'?\n*beat comes in*\n\nYo, yo, yo, yo, yo\nMy name's Kweli, from the Eternally\nReflection, spruce to the tree, Bruce to the Lee\n*aside* Yo, wassup y'all, wassup y'all\nIm doin this\nI love the rush that I get seein' a wack emcee's bottom lip quiver\nHe know he gettin' smacked for every wack rhyme he deliver\nWhether in alleys or back streets or the stairwell to Fat Beats\nI come off like the ink that be staining my hand and rap sheets\nWith lyrics stronger than Samson, to send Marilyn Manson back to Hell\nThe resurrection of Fred Hampton\nYou can tell by the way your shit swelled and lump up\nWhenever punks jump up\nThey get beat down, for thinking they Bone, creeping on a come up\nNow I got one up\nAre we much more than crabs in a barrel\nOr fags who rap about apparel with an outlook that's mad narrow?\nWe civilized, so on the microphone we vilify\nFor proving that the niggas with skills is still alive\n\n(Still alive) (Still alive) (Still alive)\n\n[Shabaam Shadeeq]\nA-yo\nFreak that, I'm leavin' rappers hangin' like cave bats\nOr hats on coat racks, I'm rough like porcupine backs\nSmacks the emcees that lack, but, yo, they knew that\nLike the flute, blew through that, with nothing but facts\nDJ's cut the wax, snare sharp like ax\nMic apparatus invited to start static\nFrom basement to attic, get smacked, act dramatic\nI had it with some of these fake rhyming ass faggots\n\"Who Shabaam Shadeeq?\" they ask, mega blast\nStorm forecast, whiplash like car crash\nBlack Flag for emcees that multiply\nAct bad, make you dig in your rhyme bag\nGot all the skills you wish you had, dreams you had\nScorch that ass and make you take the words back\nTo the foundation of that whack verse creation\nDouble S, who wan' test? smash your face in\n\n[Building Block]\nYeah, yo, yo; my shops cop ?more 'neath?\nThings in caster rock\nAnd get you open with the combination, like master lock\nLet it be known, that none could ever pass the Block\nAnd when the spot get blown, I hit you with the ?yeah, first shot?\nTraffic stop when I'm jammin, cause I got more back than gammon\nSlammin those that oppose my flow like salmon\nFoes be standing clear, cause, yo, they can't compare\nThe only thing that could hang in hear is a chandelier\nThis man could care less what them say, kick it like sensai\nThen stay, on your mind like Ash on a Wednesday\nHe at a loss style, got no cause to smile\nI toss that ass all across, kinda like a foster child\n\n[Mr. Metaphor]\nIt's Mr. Metaphor, everybody gather 'round\nLive in stereo sound and very profound\nDeeper than a burial ground, I'm aerial bound and shuttin'\nComp down as I rock like Charles Dutton\nFrom Kings to Putnam, I cut 'em from every angle\nFar from a square cause I wreck when I tangle\nMinds I mangle, mics I strangle in advance\nIn any circumstance I leave you shook like turbulence\nYou'll never get this, I'm up in that ass like a tetanus\nMet twist rhymes and drop more lines than Tetris\nI'm sicker than asbestos, spraying rhymes like a pesticide\nBest to step aside, realize who the best is\n\n[Lilscienz]\nOne two, one two\nThe Scienz of Life, BX to New Jeruz\nOne two, one two\nYeah, the Scienz of Life, BX to New Jeruz\nYo, let's go back like Gilgamesh epics\nWith fact-challenging methods\nThe rhythm stays energetic\nThe pen's motions kinetic\nSee Heaven sent styles, bless the ears of my peers\nEven older heads get contacted\nFrom bomb tactic\nExploding in your nearest tabernacle, Holy like Kadesh\nHTM, bow lyricists\nYou feel it in your chest son, like that Nine Ether\nSound right, reasin em, pleasin em through the speaker\nFor years and years mad heads doubted me\nThen I changed hiphop, into new-op, its best described as alchemy\nThe scientist, applying this throughout the global\nI stays universal with the vocal\nAttracting your focal points with each joint performed at live shows\nWhile Lilsci' verbally fly with dime flows\nMy mind grows, being divine, strolls, by the Master\nOne verse could cause cataclysmic disaster\nBut the truth hurts to be murder with spoken words\nProfound sound all in your section\nNo question\nThe Scienz of Life, don't confuse it\nAiyyo if it don't sound right than it ain't music\n\n*indistinct chatter by emcees overlapped by security guard saying:*\nAlright, alright fellas, fellas, fellas, fellas, hold on, hold on\nHold up a second\nYou guys, you guys can't be making this noise\nWith the music and everything. (Aw, come on!)\nYou gotta leave this area. I gotta clear this spot\n(We gotta go inside right now) So get on line. (We got tickets)\nSo get on line (We got tickets)\nAlright, alright, you gonna get, you got tickets\nSo get on line, and get out of this area\nThe line is over there. (We were just doing our thing)\nIts all good, its all good. Get on line, alright\n(Whatever, whatever) Little youngsters", "image": "https://images.genius.com/4eeeb836d76e96f80c8bf378ca7feb4d.275x275x1.png"}], "artist": "Talib Kweli"}