{"songs": [{"title": "Terrorist (Japanese Version)", "album": "Bobby Digital in Stereo", "year": "1998-11-24", "lyrics": "[Intro: P.R. Terrorist, (RZA), {Killa Sin}]\nBobby (uh-huh, huh-huh), Now Y\nBobby, (duh-duh-duh), Killarm, Bobby, Bobby, Bobby\n(Word up, Digital, Digital)\nTerrorist shit, Terrorist shit, Digital, come and get ahold of it\n(ya gotta keep niggas...tuned into the zone)\nTo the tune of the black knights, yo\n{Straight to the horn, Killarm, Killarm}\n\n[P.R. Terrorist]\nContemplate on how to run this shit\nUniversally, forever blunted\nReflect shots off my forcefield, this shit will split your nugget\nThoughts too rugged, extortioning CREAM from off the budget\nRefugees, all the Terrorist fans, they fuckin love it\nInsurance can't cover it, your maximum is minimum\nNiggas, they tryin to dub it, yo\nIt's the hottest shit on the streets\nSince summer '86, my prefix is like a remix\nThrowing bricks, try and dub this shit, it's accurate\nCome for your head, it's immaculate\nConception, when my weapon's busting\nShots, niggas try to discuss my business around the neighborhood\n\n[Doc Doom]\nYo, switchblade, grenade, rhyme flows\nBuck niggas like wild rhinos\nUp in these killing fields you bound to die slow\nYour style staggers like a drunken whino\nThat's why there's no hope to defeat a Black Knight\nThat's like tryin to walk a tight rope\nSwitchblade, grenade, rhyme flows\nBuck niggas like wild rhinos\nUp in these killing fields you bound to die slow\nYour style staggers like a drunken whino\nThat's why there's no hope to defeat a black knight\nThat's like tryin to walk a tight rope\nWith no feet, mercenary team, streets of concrete\nSasquatch, dump a nigga ass, so why try the\nInvinsible, Dr. destructor\nMy lyrics bring war like Lebanon\nOur troup's a Desert Storm, it be on son\nCompton is the city where I come from\nAct dumb if you want to, and catch a hot one\nIt's that real, knuckle up, lace your boots tight\nDon't give a fuck cause every night is our night\n\n[Killa Sin]\nThese rap icons, smash, spit fire out of cons\nFuck bigons, rely on islam in my python\nSqueeze off, long fist, when I'm pissed\nResult of this, gun powder cover my wrist\nBlasphemous, how these fake fucks cursing my name\nKnowing damn well, I'm hurting the same\nWhat part of the game you playing? Kid, I'm sayin'\nYo, three months ago you was on, falling short now\nChasing the Don, your money ain't long\nFaggot fucks, bag 'em up, stick 'em in the back of my truck\nStrip 'em and smack 'em up for acting up\nHe slithering, hit him in the ribs again\nBroke the code of honor that we living in\nCould lead to the whole click dismemberin'\nNever that, Killarm roll strong\nEven though you gone, Wise, the crew will still hold on\nI love you, in that dream you probably told me who busted you\nShould have paid attention but I slept\nSo for that I gotta dust two devils off\nHeaded off, all that, fucking blow trial style\nLaw and Order cat gotta Serve Justice, what\nFuck this shit, (Serve Justice)\nGrab ya muskett and bust quick, word up\n\n[Warcloud]\nLet me touch this, yo, yo, yo, yo, yo..\n\n{*this part is cut off on the US version*}\n\nThieves gather under red moonlight when doom strikes\nLeaving maroon sights in saloon fights and wound lives\nMy harpoon's flight can't be recorded by human retinas\nBite me and you'll catch more shots to the stomach then tetanus\nI'm foaming at the mouth when I talk, King Holocaust with a crooked walk\nWhoever looking soft is getting tooken off, shook and lost, cracked in half\nI take...ugh.. {*laughs*}\n\n[P.R. Terrorist]\nI take, I take all fake snakes, grab 'em, by they heads, grab 'em\nWhile they slither through the grass I'm in\nI grab em up, squeeze them till they eyeballs POP!\nTerrorist SHIT! When is that shit gonna stop?\n\n[Outro: Killa Sin]\nNever.. word up dunn\nStuck the heater up under the leather, hand sever\nFuck that shit, yo we come to..", "image": "https://images.genius.com/10f833f6fa5be4455d32a441346e0086.431x431x1.jpg"}], "artist": "RZA"}