{"songs": [{"title": "Grand Hustle Kings", "album": null, "year": null, "lyrics": "[Intro] [T.I. talking]:\nUncle Quincy they gon dig this\nHaha, hold up\nYeaaaah!\n\n[Chorus]:\nAlright people, I wanna see you dance if your type forever\nGet your hands up, say hey\nAnd shawty you're looking good\nCome here, let me see you dance\nNow get ya hands up\nYour hearts\n\n[T.I.:]\nI got to the park, super cool, stupid hot\nHe the freshest from his fitted down to the shoes and socks\nCan you wanna like it, couldn't care less if you do or not\nA reminder for those of you who forget\nHere's the king partna', ya ain't bout to say a big deal I'm not\nFifty mill I got, double down why not\n177 Aston Martin cash and carry off the lot\nThey say money talk but listen Shorty cause I talk a lot\nIncredible, my pockets and a cherry red drop\nYour money funny, big diamonds in the words red boss\nWe're gonna be smoking the city when I come kicking come and witness\n8 hundred young women all here for Young Fif\nListen, if I really dig her, let her meet my uncle Quincy\nCatch up with me suckers gonna need a solid month of Wendy\nMany moons will it take you buffoons and many goons\nPresents fill up any room, King back gimme room\n\n[Chorus]\n[B.o.B:]\nI told the World what I'm gon do, check the charts if you want proof\nNumber 1 and number 2, I'll take the rest, don't mind if I do\nPull my seat up to this table in the game, where's my food\nBut frankly, I accomplished what they said I'll never do\nOr maybe you've been sleeping or snoozing on me before\nOr possibly, blocking me from opening doors\nAnd everybody surprised now\n3 years down the road\nBut where was everybody when albums wasn't in stores\nWho cares if it ain't fair\nCause I mean?\nBob on beast, Bob on blast, Bob is everything you say\nIt's finesse, an expression, an emphasis on my name\nTalking record labels corporations this is entertainment\nHere is what I meant\nThey be like \"hey Bob try this\nPut on this shirt, put on these jeans\nPut on this hat, that'd be the shit\nRap it like that, sing it like this\nYeah yeah yeah\nThat'll be a hit\nWhat's his name?\"\nWell I'm in my own lane and that's why I ain't that\"\n\n[Chorus]\n[Young Dro:]\nHey look, came on so hard\nYou don't see the star in me\nDro, I can do anything, you don't see the heart in me\nPressure becomes combustible\nWheels squeezing the arteries of haters\nPlus my uncle is Quincy Jones so pardon me\nI like riding a may\n[?]\nWhen it come to money boy, we got that?\nLooking bad as ever, mansion in the panamerica\nWhy sick, I'm extravagant and clever\nWill damage you, it's whatever\nGrand Hustle Kings\nI won't get off the mic until that thing starts sizzling\nBlock you like a histamine\nThis is really history\nWatch ya old lady 'fore I slip in with this hickory\nLike Elmo y'all tickle me\nWhy I still be ripping beats\nBacking fantastic, tell me that you've been listening\nWhite on white, drop back joint\nT.I in a ride out\n2 of the best in the game, what you gotta decide about\n\n[Chorus]", "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}