{"songs": [{"title": "O.G. (Original Version)", "album": null, "year": null, "lyrics": "Snoop (daz):\nYeah, what ima do right here is take my time\nAnd dedicating this one to my niggas resting in peace\nAnd my niggas behind the wall\nSee you when I get there, you know what Im saying? (really doe)\nSo drip with me as I go down memory lane\nBoy it's a loony where the grass is greener\n(1-8-7 ain't shit but a misdemeanor)\nIve seen a lot of niggas come up, but few niggas done up\nSome rest in peace, with their khakis heavy squeezed\nBut it's a east side thang, a hoo ride thang\n(cause if we bang to the boogie than we boogie to the bang)\nI bring you the motherfucking .38\n(just get the mc and the homie nate)\nSo we can slide, slide, slipperdy slide\nAs I take you on a trip nigga ride (east side)\nNate (daz):\nDo you remember back on the east side?\nWhere all us niggas used to love to ride\nWe didn't care what we did\nTime was nothing to us we were just kids\nTimes are different now, but you still get stuck\nIm not a kid no more, I just don't give a fuck\nSo if you're thinking about coming and stepping to me\nKeep this in mind: Im a motherfucking o.g\nSnoop:\nLets speed the clock up and pass some time\nJune 17th, 1979\nThat's my first time being arrested\nI know I did the crime, but I ain't going to confess to this shit\nI learned than from the gs\nA g is an overseer, the overseer sees\nMore than you do cause he gets experienced\nAnd besides Im just a juvenile delinquent\nSo I was gone, and Im on my way home\nMy mommas going to get me, and I flee with (? ? ? )\nShe puts a jacket on my back and hands me a comb\nWe stop and frosty freeze for a couple snowcones\nShe telling me that I didn't need to do what I done\nShe said: \"playing football should be your only fun son\"\nIm like \"allright\" so we enter the house\nCome up to the door and pops fired to the mouth\nI couldn't do nothing but cry like a bitch\nI looked at my momma and said: \"damn, why you snitch? \"\nThey put me on punishment but that didn't work\nNow wearing khakis, wallabees, and a t-shirt\nAnd throwing up the neighborhood gang sides\nI do my first robbery and now I gotta do time\nNate:\nMy homie told me one day he had a jack move\nHe said: \"come on nate dogg, it'll be smooth\"\nI agreed and said \"come on, lets go and jack them fools\"\nNext day we were draped in the county blues\nI went and did a little time in the bucket see (seventeen years)\nSaying to myself \"ill never fuck with that nigga again\"\nFore Im locked down I learned to be\nWhat I am now and that's a motherfucking o.g\nOriginal gangsta\nDaz:\nI grew up in the city as a chap, faced the trials\nNever smiled, became a gangster in the meanwhile\nYoud find me swearing and lying, trying to be an o.g.,\nBeating the shit out of niggas for guess, some hillfigers\nThe man behind the trigger, committing robberies\nWith the homies, no one could stop, nobody knew me\nBreaking niggas for showing, sucker niggas better know me\nBecause we ain't letting the bullshit slide no more\nDo your wear nigga and kick in your front door\nTo let you know we can't take no more\nFeeling revenge, killing enemies, family and friends\nAnd let you pay the cost for my homies life, it's lost\nToss a coin in the air, run my fingers through my hair\nAnd ask myself: \"who the fuck should I really fear? \"\nI ran around with the best killers\nThug criminals and drug dealers\nBlasting niggas if they come near us\n(? ? ? ) with evil spirits, no one could help us if we could\nKnock on wood for good luck\nServe every nigga in your hood with a buck, now youve been struck\nStood gangsta in a static gangsta mack\nA grown child laying niggas the fuck down\nNate (daz):\nOriginal gangsta (original gangsta)\nComing from long beach (the town by the sea where niggas know me)\nComing from the east side...\nYoure fucking with the pound, oh nigga please\nC-o-b.s can't see the d-o-double gs, [o.g.s... repeat 5 times]\nShout outs to my nigga mr. d-a-z\nShout outs to my nigga mr. warren g\nShout outs to my nigga s-n-double o-p\nShout outs to my niggas c, style and me\nSnoop (nate):\nYeah, straight up, based on a true story\nYou know what Im saying? it's a g thang baby (original gangsta)\nYou trick ass bitch!", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}