{"songs": [{"title": "Money and the Power", "album": "Mr. Scarface is Back", "year": "1991-10-03", "lyrics": "Chorus:\nMoney and the power, money and the power\nI ain't fallin short I got the\nMoney and the power\nYup! Hehehahaha, hehe ha hah hah.. yeah\nMoney and the power, money and the power\nNever goin back cause I got\nMoney and the power\n\n[Scarface]\nDeep in the heart of South Park lurks a stalker\nS.A. fool, native Houston South Parker\nBorn and brought up to be a heartless motherfucker\nNo one else to blame, fuck it blame it on my mother\nWhen I was growin up nobody seemed to give a shit\nAnd that's what makes me one hard son of a bitch\nSince they ain't give a shit, I ain't give a shit either\nSweet 16, time to stack me up some ki's\nLearned the game of hustlin, fuckin over fiends\nSellin niggas beat, in other words amphetamines\nMy game was more advanced, sellin speed I'm goin broke\nGot em up with Floyd and Floyd had fronted me some dope\nLearned to rock it up, now I got it sold\nTime to go for broke, motherfuck who I owe\nBusiness started boomin, started movin powder\nMotherfuck the bitches I want money and the power.. yup!\n\nChorus:\nMoney and the power, money and the power\nI ain't fallin short I got the\nMoney and the power\nYup!\nMoney and the power, money and the power\nBitches on my dick cause I got\nMoney and the power\n\n[Scarface]\nBought me a Caddy, 30's and vogues\nBrand new crib, brand new clothes\nMom would ask questions, and often pitch a bitch\nWhere am I gettin the money? Mickey D's ain't paid me shit\nI'd make up a story, just to get her off my back\nUh oh I got a beep I think my boys are out of crack\nEverything was smooth, exactly how I played it\nA dollar to be made, best believe a nigga made it\nNickels dimes and twenties, and sixty cent bumps\nNigga rollin hard, stackin paper like Trump\nAnd I ain't give a fuck I told you that from the jump\nDidn't worry about no static I had a motherfuckin pump\nAss out of line, word em up a nigga sprayed em\nMomma told me shoot first, and ask questions later..\nSix hundred bucks a motherfuckin hour\nAnd I ain't fallin short cause I got money and the power, yup\n\nChorus:\nMoney and the power, money and the power\nI ain't fallin short 'cause I got the\nMoney and the power\nYeah..\nMoney and the power, money and the power\nI got it like dat, cause I got\nMoney and the power\n\n[Scarface]\nThere goes 21, and still stackin 30's\nBrought my brother Warren Lee down from New Jersey\nHe helped me for a minute then he started screwin up\nSaid fuck gettin paid, I guess my brother'd rather fuck\nBitches ran his life, and they're still runnin Lee\nI guess he doesn't realize the bitch is fuckin me\nIt really doesn't matter, cause Ak'll never tell\nHe can stay broke, but I got dope to sell\nI step out on the cut, shit was lookin funny\nI ran back in the house and started callin up my money\nI signaled for my workers to bring in all the dope\nI can feel the bust and sure enough in comes the 5-0\nNiggas stayed relaxed but they was friskin niggas up\nIf someone said my name then I was definitely fucked\nBut I'mma play it cool, if I kill I gotta kill\nFightin for my shit, I never ran and never will\nCome to find out, they wasn't fuckin with my boys\nBusted a nigga who said he paid em, talkin noise\nHehehehehe.. I guess the juices are sour\nBut I ain't fallin short cause I got money and the power YUP!\n\nChorus:\nMoney and the power, money and the power\nSold a million records I got\nMoney and the power\nYup!\nMoney and the power, money and the power\nBest to come clean, cause I got\nMoney and the power\nMoney and the power, money and the power\nMoney and the pow-the-pow-the-pow-the-pow-the-power!", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}