{"songs": [{"title": "Respect", "album": "Cabin Fever 3", "year": "2015-12-15", "lyrics": "[Produced by TM88]\n\n[Intro: Juicy J]\nMr. Cap you ready? Um hmm\nYou finna kill this shit, yeah\nPass that bong over there bro\n\n[Hook: K Camp]\nWhen you stay all on your job and stay focused\nYou gon' be the best\nDo what you can when your team get a chance\nPut it all to the test\nCame for it all, know you heard this before but\nI done more with less\nGrindin', you fall now you done with the tour\nGet it all off your chest\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nWhen you go hard\nYou go hard and don't stop until ain't nothin' left\n\n[Verse 1: Wiz Khalifa]\nI just wanna pull up with my trunk in the front\nI just wanna pull up with my niggas smokin' joints\nI just wanna pull up with a bitch with no Instagram\nI just wanna pull up to the club just to start\nWhen you a young nigga, you can have anything you want\nWhen you a young nigga, you can have any bitch you want\nWhen you a young nigga, you can drive what you wanna drive\nWhen you a young nigga, you can buy what you wanna buy\nHavin' fun with some bitches, smokin' weed in the ride\nOn the corner with my dogs, drinkin' gin to survive\nAin't from the bottom? You can't understand\nBank in my hand, your bitch think I'm the man\nYes I am\n\n[Hook: K Camp]\nWhen you stay out and your chopper stay focused\nShe gone be the best\nDo what you can when your team get a chance\nPut it all to the test\nCame for it all, know you heard this before but\nI don't more less\nGrindin', you fall now you done with the tour\nGet it all off your chest\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nWhen you go hard\nYou go hard and don't stop until ain't nothin' left\n\n[Verse 2: Juicy J]\nAll my pockets overweight\nAppetite for all this cake\nMoney man, I still run this game\nI'm in perfect shape\nMoonrocks, keep me high as tube socks, bird one\nKeep it pimpin' and pay close attention, you might learn somethin'\nMy family is all I need, I make sure that we gon' eat\nOvertime, 25 hours, 8 days a week\nI remember back when I was broke, how could I forget?\nNine bathrooms in my crib, I got a pot to piss\nMy look my momma's face when I bought her a new home\nMy mom, we finally made it, them hard times is gone\nFinally made it legit, ain't no way I'mma quit\nGot a cone full of guacamole, let's go get these chips\n(Hustlin', hustlin')\nAll the money coming in so fast you can't resist\n(Hustlin', hustlin')\nCause there ain't no such thing as gettin' too rich\n(Hustlin', hustlin')\nYou will never hear me say I don't want no more\n(Hustlin', hustlin')\nThis Juicy J and gettin' to the money is all I know\n\n[Hook: K Camp]\nWhen you stay out and your chopper stay focused\nShe gone be the best\nDo what you can when your team get a chance\nPut it all to the test\nCame for it all, know you heard this before but\nI don't more less\nGrindin', you fall now you done with the tour\nGet it all off your chest\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nHustlin', hustlin', hustlin', hustlin'\nThat's all they respect\nWhen you go hard\nYou go hard and don't stop until ain't nothin' left\n\n[Outro: Juicy J]\nYo nigga keep it real with your motherfuckin' self and grind for your motherfuckin' self. If you lookin' for another nigga. If you lookin' for another nigga to put food on your motherfuckin' table nigga you dumb as fuck. You a stupid ass nigga, you should go fuckin' take a gun and put it to your brains and blow your own God damn brains out\n\nYou stupid as hell nigga, don't be beggin' no nigga for shit nigga, get your lazy ass up, get out here and work nigga. You know what I'm sayin'? That's how we get this bread, we hustle nigga. We gotta be out here man, up early in the motherfuckin' mornin' man to the next motherfuckin' morning, man. You know what I'm sayin'? How a nigga supposed to get this shit?\n\nThis shit don't, money don't grow on trees, shit don't fall out the sky, nigga. You know what I'm sayin'? I know you out there high and shit, you know what I'm sayin'? Niggas die for this shit man, niggas out here on some real grind, nigga. There's some fucked up motherfuckers out here man, you know what I'm sayin' man?\n\nWhen a real life situation kick in, your motherfuckin' kids hungry, your bills due, your motherfuckin' car broke down, man. Nigga you gone be sicker than a motherfucker, man. We still gon' be gettin' money, we still gon' be gettin' high, we gon' be in the strip club, we gon' be bringin' in the bags left and motherfuckin' right. Bringin' them bitches in, throwin' that shit out like trash nigga. We gon' be gettin' high as fuck, laughin' at you ol' stupid ass niggas out here man, the fuck outta here man, kill yourself nigga", "image": "https://images.genius.com/036a1fd3f9480df4542a8206719c891b.600x600x1.jpg"}], "artist": "Wiz Khalifa"}