{"songs": [{"title": "So Bad", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Intro]\nYeah, haha, you feel that, baby?\nYeah, I feel it too, damn\nYou know, I'm so glad we could spend this time together\nYou see, I'm not as crazy as you thought I was, am I?\n\n[Verse 1]\nI’m the American Dream\nI’m the definiton of white trash ballin’\nI’m right back on 'em with a *err-chick-err, chicka-chick*\nI can’t call it, same shit, different toilet\nOh, you got a nice ass, darling\nCan’t wait to get you into my Benz, take you for a spin\nWhat you mean we ain't fuckin’? You take me for a friend?\nLet me tell you the whole story of Shady’s origin\nYou’ll be sorry if you slam my Mercedes door again\nNow, it all started with my father\nI must’ve got my pimpin' genes from him\nThe way he left my momma\nI’m a rolling stone, just like him, word to Johnny Drama\nKeep my entourage with me, baby, I’ll make a promise\nThere ain't nobody as bomb as\nMe, I’m as calm as the breeze\nI’m the bee’s knees, his legs, and his arms\nI'm a superstar, girl, I’m ready for you, mama\nWhy you think the only thing I got on is my pajamas?\n\n[Chorus]\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\n\n[Verse 2]\nI'm equivalent to a shot of Cuervo\nFirst I’ll kiss your navel, work my way down\nBaby, you can lay down on the table\nBut you may wanna find somethin' more stable\nI told you I ain't foolin' from the gate\nThis ain't the first day of April\nBut thank you for stayin', April\nI'ma make you learn to appreciate me, differentiate me\nFrom these phony, little fishy and sissy fake Gs\nSkip over the \"huggy bear,\" and all the \"kissy face,\" please\nInitiate phase three, missy, now service me\nTake another shot of Jäger, shakin' so nervously\nTake your time, baby, oh, you’re the bomb, baby\nOh, you’re doing that even better than your mom, lady\nI told you why I’m Shady, you didn't listen now, did ya?\nRelax, woman, you know that I’m only kiddin' with ya\nGot a twisted sense of humor, it's warped, but I didn't hit ya\nI think you’re finally startin' to get the picture, I’m just...\n\n[Chorus]\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\n\n[Bridge]\nCall me dynamite, dynamite, dynamite, soul\nCall me dynamite, dynamite, dynamite, soul\nI can hold you in the morning\nBut in the evening I gotta go\n‘Cause I'm on to the next girl\nAnd the next girl I kind of like, oh\n\n[Verse 3]\nI got you caught up in the rapture, make you recapture\nThe feelings you had for your last boyfriend before he slapped ya\nYou never wanted someone so bad, you're\nSweatin', but if I’m what you wanted\nWhy’d you panic when I grabbed ya?\nGirl, don't be so frantic, I’m just a hopeless romantic\nDon't try to fight the feeling of somethin' that's so organic\nYou can’t ignore it, so don't, just stand before it\nJust drop them panties to the floor, let’s get to camcordin'\nDamn, shawty, I told you this was bound to happen\nSoon as you wrote your number on the napkin\nI was bound to work a number on your back\nAnd throw your spine out of alignment\nMy love has got you so blind that\nYou couldn't pick Amy Winehouse out of a line-up\nSo stop at the store, pick a pint up\nLet's get the pineapple Schnapps going, no one will knock\n‘Cause I'ma hang a sign up saying \"Don't Disturb\"\nShawty, I’m so superb\nI say the right things, don't I spit the dopest words?\n\n[Chorus]\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\n\n[Bridge]\nDynamite, dynamite, dynamite, soul\nDynamite, dynamite, dynamite, soul\nI can hold you in the morning\nBut in the evening I gotta go\n‘Cause I am on to the next girl\nAnd the next girl I kind of like, oh\n\n[Chorus]\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\nI'm so bad, I’m so good that I’m so bad\nI guarantee I’ll be the greatest thing you ever had\n‘Cause you ain't never met nobody like me\nAnd you ain't gonna wanna fuck nobody else again\n\n[Outro]\nDr. Dre\n2010\nLightyears ahead of you", "image": "https://images.genius.com/7b93181ae4ed594c902bf7e4e2149ca7.1000x1000x1.jpg"}], "artist": "Eminem"}