{"songs": [{"title": "On Radio, JAY Z, and Mark Zuckerberg", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2016-11-20", "lyrics": "[Kayne West:]\n\nStop it, stop it. Hey radio, fuck you! Radio, fuck you! Y’all don’t want to lose again. A lot of people here tonight felt like they lost. You know why? Because y’all been lied to. Google lied to you. Facebook lied to you. Radio lied to you. Radio, fuck you! I know it’s a lot of real niggas working at radio, real people, real programming directors with wives and kids that love music, that can’t play what they want to play because they’ve been paid to play that bullshit over and over and over. And when I say that bullshit, what I’m saying is: we love Drake, Drake is great. He’s a great artist. But Frank Ocean is great, too! But you know who the greatest of all of us? Who do y’all think?\n\n[crowd shouts “Kanye” and other names]\n\nNope. Kid motherfucking Cudi.\n\nRadio, fuck you! Oh yeah, I’m on my Trump shit tonight. Radio, fuck you. Yeah, I’m taking his lead. I’ma just say how I say, be ‘Ye, and win. I’ma take his lead. Radio, fuck you! Radio, fuck you! Wait a second. Aye, is it, “'Radio, fuck you?' That’s what you’re saying?” Exactly.\n\nNot fuck the people that work at radio because these is real people that gotta feed they kids and they’re not being allowed to play that real shit because they think that in order to feed they kids they gotta play the same shit over and over and over. I was raised by KRS 1, I was raised by Tribe Called Quest, I was raised by DMX. The last real nigga alive? Naw, nigga! We real niggas alive, we alive tonight, bruh! We alive tonight, bruh! Virgil Abloh is alive tonight, bro! A$AP Nast is alive tonight, bro! Bari is alive tonight, bro! Ian Connor is alive tonight, bro! Rocky alive tonight, bro! Aye, y’all love my show. When I say these names, y’all better scream for me. I don’t give a fuck if you know the names or not! Go ahead, Google them. They will give you a little bit of factual information. They will give you that. Why did I name A$AP? Because that’s the future. That’s the niggas, they got me and Cudi. It’s life.\n\nWe’ve got a hundred years out here, a hundred years on this planet, bro, and we can have a utopia! We can love each other! But the rules gotta be fair. Khaled and Drake and radio and Doc and 92.3 and everybody; is it just me, or did you hear that song so many times “you say you wanna play for free?” Aye, aye! You know what it is, though? Because, aye, I love Drake, I love Khaled. But they set that song up, bro!\n\nAnd let me tell you something: MTV, fuck you! Once again, as always! I’m on my Trump shit tonight! Let me tell you what it is, bruh. Aye, you know me. I went down seven years of my life of motherfuckers hating me for saying Beyoncé had the best video. Hey, baby, let’s rock and roll tonight. Y’all might be experiencing a lot of pop shit, but the vibes is back! The prodigal son, Kid Cudi, has returned! The vibes is back! I know it’s going to be a lot of conversations after tonight!\n\nKhaled, I know you got hitters from Miami. Please do not send them at my head. I just want to have a conversation about how we playing radio’s game. Khaled, you a real nigga. Khaled, you a real nigga! You got the keys! But, as we learn all the politics that niggas was doing for years, Obama couldn’t make America great because he couldn’t be him to be who he was. Black men have been slaves. Obama wasn’t allowed to do this - AAAH! - and still win! He had to be perfect. But being perfect don’t always change shit, bro. Being perfect don’t always change shit, bro!\n\nSo, when I talk about MTV, let me explain something: I was hurt. Beyoncé, I was hurt because I wanted to present a video called “Fade” and I don’t expect MTV to help me. 'Mr. West, I don’t respect you. I will let you know that Beyoncé is winning the video tonight for “Formation” over “Hotline Bling” and “Famous.”' They told me beforehand so I wouldn’t run on stage. Hey, bruh, y’all ain’t gotta fuck with me, but you know I got the vision and you know I’ma gonna keep it real with you. Beyoncé, I was hurt! I went down seven years on behalf of your —hey, nigga, don’t throw no shit while I’m talking! I am putting my career, my life, my public well-standing at risk when I talk to y’all like this! This is a moment in the matrix, bro! The vibes is back! The vibes is back! Motherfuckers might feel a way about this tonight.\n\nBeyoncé, I was hurt because I heard that you said you wouldn’t perform unless you won Video of the Year over me and over \"Hotline Bling.\" In my opinion — now, don’t go trying to diss Beyoncé. She is great, Taylor Swift is great. We are all great people. We are all equal!\n\nBut sometimes, we be playing the politics too much and forget who we are just to win. Fuck winning. Fuck looking cool. Fuck looking cool. Fuck being cool. Fuck all that, bruh! I’ve been sitting here to give y’all my truth even at the risk of my own life. Even at the risk of my own success, my own career. I’ve been sitting here to give y’all the truth.\n\nJay Z, call me, bruh! You still ain’t calling me! Jay Z, call me! Aye, bruh, I know you got killers, please don’t send them at my head! Just call me! Talk to me like a man! I’m not trying to be the man, I just am a man, the same as anybody here! I ain’t above, below none of y’all. We all equal! We all equal! This is the vibes, bro! This is the future. This is the way of thinking to make America great again! Haha, you didn’t like that! Guess what? Y’all need the vibes! I was hurt. Feelings matter, bro! The way motherfuckers put money up so high, popularity, radio spins. Feelings matter, bro. Feelings matter, bro.\n\nIt’s a new world, Hillary Clinton, it’s a new world! Feelings matter! Because guess what? Everybody in middle America felt a way and they showed you how they felt. Feelings matter, bro. It’s a new world. It’s a new world, Barack! It’s a new world, Jay Z! Hey, don’t send killers at my head, bro! This ain’t the Malcolm X movie. We growing from that moment. Let ‘Ye be ‘Ye. And wait a second, do y’all agree with that? Let ‘Ye be ‘Ye! Wait a second, I ain’t hear enough screams on that. Let ‘Ye be ‘Ye!\n\nPeople, I’m not saying this out of my own well-being because it wouldn’t be smart out of my own well-being to say things like this. Radio, I done talked to you a bunch of motherfucking times. Y’all motherfuckers is behind the times! Because guess what? The Saint Pablo Tour is the most relevant shit happening! The Saint Pablo Tour is more relevant than radio! And if y’all keep following old models, your ass is going to be Hillary Clinton! You might not like it, but they gotta hear it. I ain’t here to massage you with a fake truth, telling you that Hillary gon’ win over and over and over and then you wake up, you still can’t believe it! You know why? Because you was lied to by Google. You was lied to by Mark Zuckerberg!\n\nMark Zuckerberg, you wanna call me now?! Do I got the vision, Mark Zuckerberg?! Was you wrong? When I said I was $53 million in debt and you didn’t call me, was you wrong? You ate dinner, you asked my friend Ebony Schiller to have dinner with me. I told you about DONDA. You said you would help and you didn’t! Then you went to look for aliens. Me and Kid Cudi are aliens right here, bro! The vibes is back!\n\n[to DJ] Aye, John, take it all the way back to the beginning.\n\nShia LaBeouf, Kid Cudi feels a way. Give him a call.\n\nQ-Tip, I love you, bro. Don’t tell me how to be me, though. I love you. The Tribe album is dope. I love you. Don’t tell me how to be me, though. I’ve been me, I am me. There’s a Richard Pryor interview that you can watch about people coming into power and not changing everything and just becoming a part of the power. That’s happened with musicians because they’re scared. I’m not scared! I’m here to change things! I am here to change things. And things won’t change until people admit their own falsehoods. I got the visions, bro. That’s what I’ve been blessed with. My vision! I’m not always going to say things the perfect way, the right way. But I’m going to say how I feel. Right now, press, get ready to write your passive-aggressive, LeBron James, racist comments. Season 4, racist comments. Get ready to have a field day, press! Get ready, get ready! Because the show’s over.", "image": "https://images.genius.com/61bed0c74188e6f897c50931c37a748c.640x360x1.jpg"}], "artist": "Kanye West"}