{"songs": [{"title": "Don’t Cry", "album": "Tha Carter V", "year": "2018-09-28", "lyrics": "[Intro: Lil Wayne]\nYeah\nC5\n\n[Chorus: XXXTENTACION]\nDon't cry, don’t go\nWon't lie, I fuckin' love you, whoa!\n\n[Verse 1: Lil Wayne]\nWhy y’all staring into the clouds\nAm I rising or they comin' down?\nI see death around the corner\nAnd the U-turn sign's lookin' like a smile\nWhat do I do now? Who gon' find me, how?\nNowhere to turn but around and round\nJust another nigga that done lost his head\nNo, a fucking king that forgot his crown\nI am not number one, it's true\nI'm number 9-27-82\nColor blind even if I may be blue\nA lot on my plate, ain't my favorite food\nBut I’m hungry, so hungry\nNeed my family tree next to a money tree\nWith a bunch of leaves in the Garden of Eden\nWith a bunch of Eves, no fruit punch for me\nI sip from the Fountain of Youth\nSo if I die young, blame the juice\nBury me in New Orleans\nTombstone reads: \"Don’t cry, stay tuned.\"\nBring me back to life\nGot to lose a life just to have a life\nBut if heaven's as good as advertised\nI want a triple extension on my motherfuckin’ afterlife\nRest in paradise\n\n[Chorus: XXXTENTACION & Lil Wayne]\nDon't cry (Don't cry, don't cry), don’t go (Why, oh why?)\nWon't lie, I fuckin' love you, whoa!\nDon't cry (Don't cry, don't cry, don't cry)\nDon't go (Why, oh why, oh why, oh why?)\nWon't lie (Don't cry, don't cry)\nI fuckin' love you, whoa! (Don't cry, don't cry)\n\n[Verse 2: Lil Wayne]\nTalent is God-given, be grateful\nFame is not a given, be humble\nAnd conceit is self-driven, drive carefully\nStay in your own lane, seat buckled\nAnd sometimes when there is no music\nWe toot our own horns, rum-bum-bum-bum\nThat woman carried the future\nAnd Tunechi was born like, \"dun-dun-dun-dun-dun\"\nDon't call it a comeback\nIt was dark, now the sun back\nHit me hard, but I punched back\nThe wheels fell off, I rode the hubcap\nIs it suicide or it's do or die?\nIt's newer days and it's bluer skies\nI told myself, \"It's just you and I\"\nThen the breeze came and it blew my mind\nLord knows who I'm there for\nI give my last breath of air for\nMama tell me to be careful\nVoice in my head give me an earful\nBut I got mind control over my control\nI lost control but knew I'd find control\nI let God control what I cannot control\nCan't control the tears, let 'em drop and roll\n\n[Chorus: XXXTENTACION & Lil Wayne]\nDon't cry (Don't cry, don't cry)\nDon't go (Why, oh why, oh why?)\nWon't lie (Don't cry), I fuckin' love you, whoa!\n(Triple extension on my motherfuckin' afterlife, rest in paradise)\nDon't cry (Don't cry, don't cry)\nDon't go (Why, oh why, oh why?)\nWon't lie, I fuckin' love you, whoa! (Don't cry)\n\n[Outro: Lil Wayne]\nDon't cry, stay tuned\nAnd triple extension on my motherfuckin' afterlife\nRest in paradise", "image": "https://images.genius.com/4c0617938ce2884f571b2c557d27ea6f.1000x1000x1.jpg"}], "artist": "Lil Wayne"}