{"songs": [{"title": "Mr.Scarface (Radio Version)", "album": "Mr. Scarface is Back", "year": "1991-09-26", "lyrics": "[Intro]\nMr. Mr. Scarface been walking down the block\nOut jumps some fiends and steals all his rocks\nPulls out a gun and shoots down all the fiends\nAnd Mr. Mr. Scarface went up the block again\n\n[Chorus]\nAll I have in this world, all I have in this world\nAll I have, all I have, all I have in this world\n\n[Bridge]\nAhh yeah, hah\nMr. Scarface is back in the house once again!\nYea, droppin some of that new\nMr. Mr. Scarface Two, But yo I gotta Chilled Dude\n\n[Verse 1]\nI don't give a damn about the chatter in the background\nPeople get beat when they step this is Ak's town\nIf you don't know, I recommend you check\nAnd ask them little suckas how many heads I put to rest\nI play a game but the game ain't roulette\nSlangin 'caine is the thang and I bet\nThat there's a lot of wannabe Scarfaces\nI've heard the name in ninety-nine different places\nI'm here to squash it all original will speak\nScarface coming hard from the streets\nI left my cut, in fear of a prison term\nThey wanna put me in a chair and let me burn\nBut go to prison on a murder rap, damn that\nI refuse to be a visitor at state's camp\nSo I broke and left behind all I worked for\nEither that or be sentenced for a drug war\nAnd many want to know why I've slowed up\nIt's either that or get stucked\nCause laws get happy on a days\nSay huh put you in a Front Page\nBut this butt ain't made for no caps, homie\nThis buck says 'Exit Only'\nSo I get in the wind but hey\nA brother still sold a quarter everyday\nI sat around for six months black\nWaitin for the day to make a comeback\nAnd now I'm ready for combat\nMr. Scarface is back\n\n[Chorus]\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my  just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my  just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\n\n[Verse 2]\nAiyo Bido, drop that\nYeah, heh heh\nBack in the South Park, six o'clock on the dot\nCheckin on my old rock spot\nI seen the same old set\nHeh, the small timers see me so they jet\nBuildin' 128\nI got myself a bag and I can't wait\nTo cut em up small to make a profit\nDealers on the cut short stop it\nFiends'll see em small then they go\nWhere, to see the dope dealer pro\nOne brother got pissed\nAnd started reachin' for his hip\n.357 on your fast, fool\nLike I said before, you don't get a second chance dude\nUnloaded on his boy, he was hurt\nSix shots put his gym in the dirt\nLaid him out like a old piano rug\nGettin' pumped full of .38 slugs\nSome other people stepped out y'all\nUh oh, I had to make a phone call\n\n[Skit]\nJ. Prince: Hello?\nScarface: Hey J!\nJ. Prince: Wassup?\nScarface: I'm in a little trouble man\nJ. Prince: Where you at?\nScarface: I'm out here in South Park Village\nJ. Prince: Stay right there, I'll be right on\nScarface: C'mon let's take these to war man\n\n[Verse 3]\nJ called up some brothers from the 5th Ward\nAnd came back with a 5th Ward hit squad\nWe Ain't Playin Uzi machine\nCause Lil' J packed an M-16\nWill an AK with a banana clip\nAnd little Bill had a 12 Gauge pistol grip\nI hit a little laugh and got me a buzz\nAnd that's about the time they got drugged\nOne more war took place\nYou can call me DJ Akshen , or call me Mr. Scarface\n\n[Chorus]\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my  just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my  just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\n\n[Verse 3]\nLater on, all alone, you know what happened next\nAnother girl came by to give me sex\nIt was kind of strange I was throwed off\nThe last chick got her head blowed off\nBut I ain'tsta pass up no\nShe started strippin' at the door, oh goody\nRollin' around rubbing on my back\nShakin her down with the Bozack\nI didn't have to pretend I loved her\nAll she wanted me to do was just hug her\nSo I gave it up to the lady\nAnd all she said was \"Do me baby, Do me baby\"\nI started stroking in an outrage\nThe whole while I was starin' at my twelve gauge\nThe chip was gettin' loud I said I'm killin her\nAnd all the while my man was hard and he steady drillin' her\nI heard to step as she fell to the floor\nI heard a knock on the front door\nI grabbed the twelve gauge from the bed head\nWho is it? (Fred) Who? Fred?\nWho the hell is Fred, I stood by the door\nBy that time someone jumped in the window\nNow what the hell was I do?, I got lucky\nThe girl packed a twenty-two\nHit him in his head, there she laid him\nThe pastor standin' by the door I sprayed him\nAnd headed for the back\nI seen that same old brown Cadillac\nIt kinda messed me up at first\nCause the brother that drove that Caddy rode away in a hearse\nI opened up fire on the ride G\nWho I was shootin for was standin right behind me\nI had a double barrel pointed at my back\nCould this be the end of Mr. Brad?\nI don't know what happened to the front\nWell that's about the time the closet door it opened up\n(On your ass trick!\nI'll be damned if I go out like the last)\nHeh, five-0's on my back, mane\nThey know me by the face, but they don't know my last name\nNow I'm back on the case\nJust call me Mr. Scarface", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}