{"songs": [{"title": "What If", "album": null, "year": null, "lyrics": "What if I’ll never make it?\nWhat if I’m never famous?\nWhat if, I’m broke\nAnd my whole life is been a joke?\nWhat if nothing never happens?\nWhat if I gotta stop rapping?\nWhat if, what if, what if this is it?\n\nWhat if I never got the chance to tell the world what I gotta say?\nWhen I’ll die all I do is just ride away\nI tried to talk about my life in every song\nSo you have a little something to remember when I’m gone\nI tell you like this, I ain’t pretending in the…\nBut I tell you that I’m working and I’m getting very strong\nIt won’t b long ’till you hear me on the radio\nBut in my head I got ways to go\nBut I’mma take it slow, this is the way to blow\nSo any place I go, I know my bank can …\nI’m taking notes, I am hip hop\nIt replaces my soul if I sing to the bottom and make a flow\nI heard the real world’s cold, I’mma take your coat\nBe prepared, and be aware …\n\nWhat if I’ll never make it?\nWhat if I’m never famous?\nWhat if, I’m broke\nAnd my whole life is been a joke?\nWhat if nothing never happens?\nWhat if I gotta stop rapping?\nWhat if, what if, what if this is it?\n\nExpectations picking, they wonder what I’m about to do\nSport interest, music I can count on you, right?\nDo I have it all twisted? I went from popular to… in an instant\nMy friends forgot me cause they probably seen me on…\nIn an… where I should be out at a party!\nIt drives me crazy, money is the due\nInsomnia I could wait.. something I can do to put the work in it…\nFailure getting jealous, throwing dirt upon my name\nBurning up my pain, but I’m working through my pain\nCause life’s hard, ’till you learn it’s just a game!\nPlay your cards, use your letters on your scrabble board\nIf you’re small, put your heart into your rapping more\nNo money? why the fuck you’re counting for?\nA thousand.. trying to get up my allowances\n\nWhat if I’ll never make it?\nWhat if I’m never famous?\nWhat if, I’m broke\nAnd my whole life is been a joke?\nWhat if nothing never happens?\nWhat if I gotta stop rapping?\nWhat if, what if, what if this is it?", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}