{"songs": [{"title": "Overtime", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro: Tech N9ne]\nYeah so, since I was 10 years older then her she tried to give me that \"Coming to America\" spiel. You know what I'm saying? Like \"Some guys put in an hour. Some of 'em even an hour and a half. But a man gotta put in overtime for me to get off.\" Ha ha\n\n[Hook: Krizz Kaliko]\nWork it baby\nI'mma give you extra, you deserve it baby\nPut a star next to you 'cause you're perfect baby\nAll the time\nClock out, clock in for overtime\n\n[Verse 1: Tech N9ne]\nIf you think we 'bout to go to sleep - forget about it\nYou really doubt it, though we can make the synergys link\nIn the middle of the night I'm fixin' to enter the pink\nNever the one to be stingy. I leave my dinner, she winks\n'Cause she think she got me and her percentage be Brink's\nBut I'mma stick it without a ticket in the tender she thinks\nSuck me up then I can become her energy drink\nAnd that's what she gon' need\nPunching the clock, I'm not gonna be done on three\nBaby you probably wanna kick it and get her done on E\nBut you ever have steamy sexual fun on weed?\nSo I told her nein! No I don't look like it but I'm the older kind\nBut that don't mean I'mma stick it, n' quit it, forget it\nBecause tonight I'm 'bout to get it in overtime\n\n[Hook: Krizz Kaliko]\nWork it baby\nI'mma give you extra, you deserve it baby\nPut a star next to you 'cause you're perfect baby\nAll the time\nClock out, clock in for overtime\n\n[Verse 2: Stevie Stone]\nLovin' your body, lovin' your pace\nLove it when you maneuver your body off in my space\nAnd weather the chase, and have your body off in the daze\nAnd could you feel the hormones, they off the rage\nNow check it - let me take a little dose of the page\nI'm hittin' for hours and hours, hours hours and days\nAll the positions I'm feelin' real kinky today\nI've waited to play my trombone, have a parade (have a parade)\nKitty kitty kitty kitty c'mere\nWell there's a couple little things I wanna say in ya ear\nI'm shiftin' gears, love it when I strike the wheel\nStevie Stone in the bed, I'm a freak for real\nBaby girl I'm a freak for real\nA little too much tongue got me head over heels\nWetter the chill\nHead shot, ready to kill\nReady to deal, head rock, watch what you will\n\n[Hook: Krizz Kaliko]\nWork it baby\nI'mma give you extra, you deserve it baby\nPut a star next to you 'cause you're perfect baby\nAll the time\nClock out, clock in for overtime\n\n[Verse 3: Tech N9ne]\nBaby, baby, gave me a job and I love it\nI know you be lovin' the way I throb when you hug it\nWhen I got the poonini I thought the job really was it\nBefore the poonini you take the job and you shove it\nFeel like a nigga makin' love when I does it\nOn the clock I won't stop and when it buzz I'mma plug it\nGood enough for me to be your husband in public\nYou really be wantin' to pack a stud in your luggage\n\n[Stevie Stone]\nAh, pack a stud in your luggage\nBreak down baby, Stone gonna love it\nWhile we bangin' make a nigga wanna love it\nMake me wanna snatch it\nSee to it girlie, ha\nIt's one of a kind\nYou bring the girls and I'm comin' with the N9ne\nSpread them legs and open wide\nGive you that overtime\n\n[Hook: Krizz Kaliko]\nWork it baby\nI'mma give you extra, you deserve it baby\nPut a star next to you 'cause you're perfect baby\nAll the time\nClock out, clock in for overtime", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}