{"songs": [{"title": "Shake it Baby", "album": "The DEFinition", "year": "2004-08-31", "lyrics": "[LL Cool J]\nYellow canary, tennis bracelet necklace, knahmsayin?\nThree quarter black mink; shades, canaries in both ears\nKnahmsayin?  Black Phantom, triple black, with the oak wood\nGucci shoes, that's how I play\n\n[Verse One]\nHold up, I don't gamble, I don't play no craps\nI was taught early on don't jeapordize the stacks\nBefore I open my mouth, I get all the facts\nI could never fall off, it's too many hot tracks\nI'm affiliated with too many hot cats\nTo end up, crawlin out of a hole in Iraq\nTry to topple my regime\nYou end up in need of a scalpel to your spleen\nIs there a medic on the scene?\nEasy children, Queens is in the buildin\nThat blank look on your grill'll get filled in\nSlow down baby, you actin like a clown homes\nYou get your fronts remodeled like a brownstone\nYou hear my heat rock comin through your sheetrock\nIt means you're OD'n homeboy, here come the detox\nI get my swagger on, proud as a peacock\nBars is hot, beats is pumpin like a {*edit*} box\n\n[Chorus]\nShake it baby shake it\nIf you a real O.G. put your hands in the air with me, c'mon\nShake it baby shake it\nYoung ladies in the spot, if you came up in the place to rock, c'mon\nShake it baby shake it\nDivided we fall, stay together and forever we ball, c'mon\nShake it baby shake it\nYou do it for the gangsters\nI do it for the ladies, but it's all money baby\n\n[Verse Two]\nThey pay me so much it's hard for them to swallow\nWhen you got 'em by the balls, their hearts and minds follow\nPay yourself first, that's one of my main mottos\nPicture Bill Gates on the block dodgin hollows\nI can't see it player that's beneath my vision\nI'm beyond focused, every decision is made with precision\nIt seems like greed's the world religion\nBut L want cake, save the crumbs for the pidgeons\nBlack man, get the flies outcha eyes\nYou can't cause where you born but you affect where you die\nUntil that day, health and welfare, cheers\nAnd after my wake, the hood'll talk, man listen here\nHe kept a mink and canaries in his ears\nLike the Enterprise rollin over stars for years\nSpit bars for years, kept hot cars for years\nThe dice was loaded but he beat the odds for years, uh-huh!\n\n[Chorus]\n\n[Verse Three]\nTo be or not to be the man, that's the question\nGot a vision in my mind, I can see that I'm destined\nTo lean up in the backseat, givin directions\nSweep the block clean as November elections\nOn the Blackberry readin cash flow quadrant\nBrim to the side, my gorillas is bonded\nCLS Vision, four Hummers behind it\nYou forgot I'm from Queens?  You can get reminded\nI'm a man's man, when you chumps gon' learn\nIf you play with fire you get poured in a urn\nYou must have been puffin on blunts of sherm\nAll my albums is platinum, it's been confirmed\nI'm more than a symbol of sex, I get respect\nFor livin in the hills but still keepin it mad real\nStay on course, the boss crush obstacles\nYou burnin me, two words: im-possible\n\n[Chorus]\n\n[LL Cool J]\nLike I said\nYellow canary tennis on the neck\nThree quarter black mink\nGucci hat to the side, shades\nGucci shoes, baggy jeans\nBlack Phantom, oak wood\nThat's how I play\nYeah\n(Shake it baby shake it)\nYou do it for the gangsters\nI do it for the ladies, but it's all money baby", "image": "https://images.genius.com/b42398fade2d37f1bf7eaa68c9bd69dc.1000x1000x1.jpg"}], "artist": "LL Cool J"}