{"songs": [{"title": "It’s All on a Ho", "album": null, "year": null, "lyrics": "[Snoop Dogg]\nFuck, sittin' up lettin' these motherfuckerz know, though\nYou're my pimp buddies, my boy Sean Dogg, you on a mission (Yeah, baby!)\nCreep Dogg, I know you trippin' (I feel you) Ya heard me? (um-hm)\n[murmur] We just sittin' up in here droppin' game about these motherfuckin'...HOS\n(HOS?!) That's right, hoes, and that what the topic is today on the show: hoes\n(Why you always gotta talk about 'em?) I mean, cause if you gotta blame it on somebody\nYou might as well blame it on a motherfuckin ho....\n\n[beat kicks in]\n\nYou feel me, Meech\n(Now that I think about it...) It was all on a motherfuckin' ho\n(Ya heard me?) That the topic today: Hoes\nLive here, Snoop Dogg, and uh..what I'm gonna do right here\n[inhales] besides smokin' this weed...I'm a holla at 'chy'all...\nIt was all on a ho, in one minute or two it, too\nCause I know I got it like that...y'knahmsayin?\nIt was all on a ho (Ho, ho, ho)\n\n[\"Now that I think about it?\" echoes]\n\nShiit, niggas straight feelin' like Bobby Womack\nIs in this motherfucker tonight...y'knahmsayin?\nThat's the way I feel about 'cha...hm hm..it was all on a ho...\nBut uh...it's Nineteen-motherfuckin'-Ninety Eight\nAnd I believe today is uh...October 31st, if I ain't...wrong...right, nigga?\nYeah, yeah there, so uh... as they say in Halloween world or...\nWhite world or just a world, in general: Trick or Treat, bitch (Ha ha!)\nYa feel me? (Ya heard me?) We puttin' this Space-Age pimpin'\nFull ?Fledge? pimpin' right here...y'know?\nRight now, bitch can't even look at me\nBitch you under arrest for \"Reckless Eyeballs\"\nWe just doin' this real P-Im right about now, ya feel me?\n(That's it...that's it...) Because...I mean, I got a big grip...a BIG, BIG memory, cuz\nI remember a whole lot of bitches didn't wanna give no nigga no title \"Playa\"\nBitches wouldn't even look at me, y'knahmsayin? (Yeah you!)\nThey just want a nigga to bust a rap about 'em, y'know (Yeah you!)\nBuy 'em sometin' to eat from...IHOP, y'know\nGo get 'em a Big Mac value pack or sumthin'...\nBut uh...I'm a tell you what I really remember the most about these bitches, cuz\n(What chu remember, dawg?)\n\n[Snoop raps]\nI remember Rachel, Tina, Lisa, and Grace\nCause every single one of them had a special place in my heart\nFrom the start, see I was just a young puppy\nA young dummy, panties, bitches to fuck with me\nNow that I grew up and blew up, I look back\nAnd thanked [thought] on these hoes, they straight to' up, know what?\nI'm in effect for the nine-eight\nSee now I'm scared of love, like my homeboy Nate\nAnd I don't wanna hurt no mo'...so...\nI rather go to the Mo' with a ho and leave my rubber on the flo' (What?!)\nAnd call my nigga, Sean Dizzay\nTo come scoop me up in the cut, Dogg, nigga, what, chy'all? (What, what, what)\nAin't knowin? Pimpin' and ho-in'\nKeep the grass growin', \"Nigga, where you goin'?\"\nLook here bitch, don't ask me shit\nDid I interupt you while [*slurping noises*] you was sucking my dick, beyotch?\nI don't need the stress, besides talkin' back to a pimp would get yo ass slapped\nRespect the GAME (GAME), and I promise you the game gon' do the motherfuckin' same\nI learned a whole lot from these bitches of my past\nA bitch with no class is worse than a bitch with no ass\nAnd you wonder why I'm from The Pound?\nShiiiit, if a bitch can't swim, nigga, she bound to drown, nigga\n\nHook: [with echoing \"Now that I think about it\"]\nIt was all on a ho, what chu trippin' fo', nigga?\nIt was all on a ho, Gs' up, hoes down, what chu trippin' fo'? (What chu trippin' for'?)\nIt was all on a ho, why you trippin', dawg? Hoes down, Gs' up\nIt was all on a ho, what chu trippin fo', ya heard? Gs' up, hoes down, it was all on a ho\n\nIt was Nineteen-motherfuckin'-Ninety Three\nMe and Sean Dogg in the CPT\nAnd we fuckin' with these fuckin' mob bicthes he know\nAnd the one named Kiki, she's so kinky\nSaid she loved my video, so you know where we goin here\nNow she feelin' freaky, and wanna braid my hair\nSo I sit back, relax, and let her twist\nAnd put my head back on a pound of fish ?????\n(Wait a minute!) Wait a minute! Let me hit it!\n\"Nah! I ain't even trippin' let me get some head in the kitchen\nAnd keep dippin'\", Then I looked in the living room and\nSee my nigga Sean Dogg bitch straight trippin'\nSo, you know what's next..(What up?)..no sex!\nPull out cha dick and bust a nut on her dress, (Say what?) (Word!)\nLike Billy Clinton, we representin'\nFor all you women, bitches, keep swimmin'\nWe never save 'em and that's on The Pound\nCause if the bitch can't swim, she bound to drown, nigga\n\nHook: [with echoing \"Now that I think about it\"]\nIt was all on a ho, hoes down, yeah (hooooooooooooooo)\nIt was all on a ho, G's up, yeah, Hoes down, hoes down (hooooooooooooooo)\nHoes' down, (hoooooooooooooooooooo), yeah\nIt was all on a ho, Gs' up, hoes down, Gs' up\nIt was all on a ho, it was all on a ho, ho, ho, ho, ho\nIt was all on a ho, Gs' up, hoes down, Gs' up, if a bitch can't swim, she's bound to drown\nCheck it out, y'all, Checka-checka-check it out, y'all\nIt was all on a ho, yeah, I need everybody out there to say this shit wit' me, c'mon\n\nNow can I get a hooooooooooooooo (hooooooooooooooo)\nSay hooooooooooooooo (hoooooooooooooo)\nLemme hear you say ho, ho, ho! (Ho, ho, ho!)\nEverybody...ho, ho, ho! (Ho, ho, ho!)\nNow can I get a BE-YOTCH!? (BE-YOTCH!)\nC'mon BE-YOTCH! (BE-YOTCH!)\nGangstaz lemme hear you say BE-YOTCH! (BE-YOTCH!)\nLadies....BE-YOTCH! (BE-YOTCH!)\nOne mo' time, everybody say hooooooooooo (hooooooooooooooo)\nC'mon say hoooooooooooo (hooooooooooooooo)\nC'mon say ho, ho, ho! (Ho, ho, ho!)\nEverybody say ho, ho, ho! (Ho, ho, ho!)\n\nAiyyo ?Meech?, I got some hoes bouncin' through...\nGet the fuck up on out of here, nigga\n\n[Snoop adlibs \"It was all on a ho\"\n\"Now that I think about it\", and \"hoooooooooooo\" til fade]", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}