{"songs": [{"title": "The R", "album": "Follow the Leader", "year": "1988-07-26", "lyrics": "[Verse 1]\nWhoever underestimated, still waited\nPumpin' the radio, finally they played it\nYou wondered how come the album was late?\nI was givin' you time to get the last one straight\nThe show must go on, I got somethin' to dance to\nSlow it down and romance to, and give me a chance to\nKeep you in tune and up to par\nThen you're doin' it with The R\n(The R, The R, The R, The R ...)\nDoin' it with The R\n(The R, The R, The R, The R ...)\n\n[Verse 2]\nSomethin' new and to keep you doin' what'cha doin'\nThis is for you and your crew and for who in\nThe vicinity, I don't need no identity\nI see hands in the air, that means many be\nCooperatin', I can't stop relatin'\nHip-hop is makin' more sense when I'm statin'\nParagraphs of potential to prevent you from usin' my instrumental\nKeep in mind, I meant to\nIllustrate another iller break immediately\nHurry up and learn the words and repeat it with me\nThen soon, you're in tune and up to par\nAnd then you're doin' it with The R\n(The R, The R, The R, The R ...)\nKeep doin' it, you keep doin' it with The R\n(The R, The R, The R, The R ...)\n\n[Verse 3]\nIn the summertime, pockets bulgin'\nSomething's happenin', then I'm indulgin'\nMusic is mine, Gucci seats reclined\nGold grill, a paint job will shine\nPull up in the park and then pop the trunk\nTurn up the bass and let the system thump\nA block party starts to form, people start to swarm\nLoud as a ghetto blaster, word is bond\nRecords remind you of a madness\nThe moment it's played, you get glad it's\nThe return of the brother, keepin' you up to par\nAnd you're doing it with The R\n(The R, The R, The R, The R ...)\n\n[Outro]\nYou know what I'm sayin'?\nThe microphone fiend Rakim in full effect\nDJ Eric B. need more records to wreck\nTo the Queens posse, you’re doin' it with the R\n(The R, The R, The R, The R ...)\nBrooklyn, you’re doin' it with The R\n(The R, The R, The R, The R ...)\nThe Bronx is doin' it with The R\n(The R, The R, The R, The R ...)\nManhattan, keep doin' it with The R\n(The R, The R, The R, The R ...)\nAnd Strong Island, you’re doin it with The R\n(The R, The R, The R, The R ...)\nWyandanch and the Paid In Full posse doin' it with The R\n(The R, The R, The R, The R ...)\nPeace to the Nation of Islam\nAnd I'm outta here\nOut, out, out", "image": "https://images.genius.com/9b590ab143a3ba007bcb44a5bd6af57b.953x953x1.jpg"}], "artist": "Eric B. & Rakim"}