{"songs": [{"title": "You Don’t Know Me", "album": "Midnight Club 3: DUB Edition Original Soundtrack", "year": null, "lyrics": "[Hook]\nYou might've seen me in the streets but nigga you don't know me\nWhen you holla, when you speak, remember, you don't know me\nSave all that hatin' and that poppin', nigga, you don't know me\nQuit tellin' niggas 'you my partner', nigga, you don't know me\nDon't be a groupie keep it movin', nigga, you don't know me\nHey, I ain't trippin', pimp, the truth is really, you don't know me\nYeah, you know they call me T.I. but you don't know me\nYou be hatin' an' I see why cause you don't know me\n\n[Verse 1]\nI think it's time I made a song for niggas who don't know me\nI graduated out the streets, I'ma real O.G\nI been trappin', shootin' pistols since I stood 4 feet\nSo, all you niggas actin' bad, you gon' have to show me\nYou gone make me bring the Chevy to a real slow creep\nMy niggas hangin' out the window, mouth full of gold teeth\nWhen the guns start poppin', wonder when it's gone cease\nChopper hit you in' the side an' create a slow leak\nWe can end the speculation cause today we gon' see\nWhat's the future of a pussy nigga hatin' on me\nI give a fuck about the fed's investigation on me\nI don't care that they at my shows and they waitin' on me\nI'ma keep on flossin', poppin', long as Tomp is on the beat\nTell polices, I ain't stoppin', I'ma keep it in the streets\nContrary to your beliefs, I'm as real as you can be\nFuck ya thoughts and ya feelings, nigga, you don't know me\n\n[Hook]\nYou might've seen me in the streets but nigga you don't know me\nWhen you holla, when you speak, remember, you don't know me\nSave all that hatin' and that poppin', nigga, you don't know me\nQuit tellin' niggas 'you my partner', nigga, you don't know me\nDon't be a groupie keep it movin', nigga, you don't know me\nHey, I ain't trippin', pimp, the truth is really, you don't know me\nYeah, you know they call me T.I. but you don't know me\nYou be hatin' an' I see why cause you don't know me\n\n[Verse 2]\nOnce again', let me remind you, nigga, you don't know me\nSo, don't be walkin' up and asking, what's the deal on a key\nI don't know if you wearing wires, you could be the police\nIf I was slangin' blow, you couldn't get an O.Z\nSee me in' the PSC follow through at a show deep\nPolice holdin' up the door because they know we tote heat\nI just wanna rap wi' C blowin' dro in' the fleet\nOr wit clan by the dozen different bitches in' a week\nI just wanna chill wit Kuntry an his daddy, Freddie G\nBallin' out at anytime, at any store an' spend a G\nI wanna ball in' the Bahamas courtesy of K.T\nMacBoney gotta mill but it's dolla D.P\nA.K. house on the hill right next to JD\nEvery week, meet at Philant restaurant for lunch and eat free\nGet in' they pay lil' Greg and B\nThat's the only shot we got at gettin', Cap back on the streets\n\n[Hook]\nYou might've seen me in the streets but nigga you don't know me\nWhen you holla, when you speak, remember, you don't know me\nSave all that hatin' and that poppin', nigga, you don't know me\nQuit tellin' niggas 'you my partner', nigga, you don't know me\nDon't be a groupie keep it movin', nigga, you don't know me\nHey, I ain't trippin', pimp, the truth is really, you don't know me\nYeah, you know they call me T.I. but you don't know me\nYou be hatin' an' I see why cause you don't know me\n\n[Bridge]\nYou see a nigga hatin' on a G, ask him, what it's gon' be\nWhat you lookin' at? Pussy nigga, you don't know me\nAt the club, in' the streets or wherever we should meet\nIt's choppers choppin', pistol poppin', nigga, you don't know me\n\n[Hook]\nYou might've seen me in the streets but nigga you don't know me\nWhen you holla, when you speak, remember, you don't know me\nSave all that hatin' and that poppin', nigga, you don't know me\nQuit tellin' niggas 'you my partner', nigga, you don't know me\nDon't be a groupie keep it movin', nigga, you don't know me\nHey, I ain't trippin', pimp, the truth is really, you don't know me\nYeah, you know they call me T.I. but you don't know me\nYou be hatin' an' I see why cause you don't know me", "image": "https://images.genius.com/1de7ebefb35a74b0eee3066decd0d434.476x476x1.jpg"}], "artist": "T.I."}