{"songs": [{"title": "Do-Re-Mi", "album": null, "year": null, "lyrics": "(feat. Sermon, Erick)\n\n[LL Cool J]\nUhh, uhh.. yeah\nSee I know how to get down, word up\n\nIt's so hot it's, LL's version of the East coast chronic\nSmoke 'til your lungs collapse\nYou supposed to be the nigga, where all the drama at?\nSo ironic, L came back\nFlooded the market - got your mens on the wall\nHoldin his blunt, too fucked up to spark it\nShow me a nigga who can do like I do\nThen gas your mans up so I can rip that nigga too\nBraggin you goin platinum like that shit brand new\nI was platinum in eighty-five, what THE FUCK wrong with you, huh?\nCome (?) L - what you call rocks to me is minerals\nTried to throw salt on my name, shit's political\nThe baddest man on the planet\nSo ill when I'm spittin niggas take it for granted\nCram to understand it, I'll switch and write it lefthanded\nHeat my pinky ring up and leave your bitch branded\nGot a voice like a cannon - nigga shoot\nI don't think she really hot, your career is a fluke\nI'm the best MC to ever touch the pen\nTake a look at what I'm doin it will not be done again\nAs sure I am the descendant of former slaves\nI'ma resurrect brothers from they mental graves\nMake 'em confess - LL's the most rugged\nGod, and no man's above it, gotta love it\n\n[Chorus: LL, Erick]\nDO - get this bread, use ya infrared\nRE - fuck the industry, it's all about\nMI - you ain't goin - FA\nL said it - SO, puffin on the - LA\n\nDO - get this bread, use ya infrared\nRE - fuck the industry, it's all about\nMI - you ain't goin - FA\nE said - SO, puffin on the - LA (.. TI DO)\n\n[Erick Sermon]\nUhh, E Dub on the microphone\nDroppin bombs - spots get blown\nSo why would you assume my style wouldn't bloom\nWhen I rap, wack MC's vacate the room\nCause they suck, and that's how I feel\nI'ma smack down the A&R who signed the deal\nThen wrap 'round his neck yo' reel to reel\nSo next time he know, how the real feel\nGet loose and wrap hand 'round the steel\nLeave you in the truck, wrapped 'round ya wheel\n(I ain't playin) But y'all front like I ain't it\nAnd every rapper y'all like, sample my shit\n(Name one) I'm nice, and there's no mistakin\nI threw a bomb rhyme in the hands of Troy Aikman\nMy track record is out there, gone\nE.T. like maybe I should phone home (hello?)\nI'm known for the dome bangers\nDrop any song of mine right now in the club and it's DANGER\nScarface, E, LL Cool (jigga jigga)\nJ, never heard it spit this way, hey\n\n[Chorus: LL, Scarface]\nDO - get this bread, use ya infrared\nRE - fuck the industry, it's all about\nMI - you ain't goin - FA\nL said it - SO, puffin on the - LA (that's right)\n\nDO - get this bread, use ya infrared\nRE - fuck the industry, it's all about\nMI - you ain't goin - FA\nCause 'Face said - SO, puffin on the - LA (.. TI DO)\n\n[Scarface]\nYou a trash-ass nigga, slash garbage-ass rhymer\nYou switched from the raw to a chart climber\nAnd now your shit is blowin out the stores\nAnd uh, next month you fin' to go out on the tour but\nCount - (two, three, and, four)\nYour records ain't sellin no more\nAnd damn - you done spent your money galore\nBuyin all the stupid shit that your money can't afford (uh-oh)\nTryin to keep up with the trendy\nGot your bitch minked out in all Fendi\nBought your homeboy a brand new Bentley\nAnd the well that wouldn't run dry is now empty\nIt's simply, cause you wasn't focused on the next day\nAnd your next tape you can't give it away, but hey\nI send these to these niggas tryin to keep up with the Joneses\nEverything you see me I owns it\nI've been quietly sellin tapes for thirteen years\nSo let's get, that, clear\nYou might have sold a few more tapes, but\nRealistically, are you that great? (nah)\nCan't get respect but I done paid dues\nStood on the block slangin cooked up rocks, I'm the same dude\nI've been the same nigga since I came through\nDo-re-mi too, damn fool!", "image": "https://images.genius.com/4a83e0fa554b5f2e5c5acce61362bbe7.1000x1000x1.png"}], "artist": "Scarface"}