{"songs": [{"title": "Money Good", "album": "Fuck the Money", "year": "2015-12-11", "lyrics": "[?]\nIt's not so much a business where you make a lot of money but if you enjoy the business then the money comes. But if you're looking for the fast, instant kind of famous and money it's going to be boring to you because it doesn't happen quite like that\n\n[Yeah, yeah.. {?}]\n\nVerse 1:\nWhen the money come it's sweet as a honeybun\nBut when the money gone they hide like a honeycomb\nThey tell you get your education\nNigga, go to college\nThey colonizing your mind like Rhodesia\nWhat you, a Rhodes scholar?\nThey never tell you that degree is just a receipt\nYou be paying off them loans til you're 6 feet deep\nPeep\nIn my environment every snitch gon' have to die\nYou ask me why\nCuz my entitlement is American as apple pie\nIt's hard to get a check, it's easy to get in debt\nThen get it wet\nYou could get a little head for a little bread\nThat shit is dead\nGet by, get over\nYou gotta get ahead or be back in the shelter by 12 so you can get a bed\nThe conditions you raised in is preyin on your decision-making\nYou concentrating on that short paper\nThe broad paper, that hard candy, that jaw breaker\nThe dark side of the force pay for that Lord Vader\n\nChorus:\nHow you tell a nigga from the hood?\nWe on the Dirty, Sexy Money like Blair Underwood\nMy money good (x4)\n\nCan't touch it\nIt's only human to want to look\nMoney talk\nMy shit be tellin everyone to shhh\nMy money good (x4)\n\nVerse 2:\nThe millionaire musician a fairly recent phenomenon\nBefore there was [?] musicians performing on the street corners\nOut in the deep forest\nThe city drop the beat, the night air sing a sweet chorus\nThe trees lean toward us in order to take in the CO2 that we let out and convert it into oxygen\nEvery time you blow a breath out you start the cycle again\nRecycle the wind, spin it any way you want it\nIt's priceless, this life is a blessing\nNo matter how you slice it or dice it, you can grill it like a swordfish\nA beautiful mind, the bars gorgeous\nI know I'm a suspect\nWhen I'm walking and the streets is like my office\nWe the working class artists\nThey wishin that we was porpoise\nBut I know my worth\nTell em to make an offer of gold first\nI'm in the fight of my life and I'm taking the whole purse\nSoul search\nFor getting paid for creating the cold verse\nGot the money on my mind\nTryna escape and it don't work\nChurch\n\nRepeat chorus", "image": "https://images.genius.com/23223285f9cac119c15336b3e08cd741.498x498x1.jpg"}], "artist": "Talib Kweli"}