{"songs": [{"title": "All Outta Ale", "album": "Unexpected Guests", "year": "2002-01-01", "lyrics": "[Sample]\nOne more beer\nAnd I'll take you all\nAll of you\n\n[Intro]\nBanned from all bars\nThe man with seven scars\n\n[Verse 1]\nSmack it up, flip it, pulled out, 'bout to fell\nSunday in the ATL and I'm all outta ale\nLike a bat out of hell, tripped on a cat tail\nMutt drinkin out a pail, who let the rat out the cell?\nGot all the ingredients and recipe, might as well\nSince last week, the bootlegger been in jail\nIf all else fail, inhale the L\nMakin' sure they can't see your sale via snail mail\nMind like a sewer, servin' rhyme on a skewer\nDOOM'll step to a fine dime like he knew her\n\"My black sister!\" She said, \"Step back!\" before he kissed her\nShe did the dipper and the smack just missed her\nThere go a list of politics like Henry Kissinger\n99% of rap's just a friendly listener\nI'm like, \"These dudes must have some screws loose to hate y'all\"\nOr a couple of ounces short of deuce-deuce or 8 Ball\nY'all know it's time for the end when the day come\nBuy a album, get rudely insulted over fake drums\nSame CDs you get for free, you break 'em\nWa-alaikum, make 'em eat they food like Steak-umm\nWhy she wanna ask me if I could pass the paprika?\nOne hand on the mic, the other on the beaker\nEvery week or so, peeked out the lab though, eureka!\nA technique to keep somethin' uniquer in ya speaker\nFor yo' information, I didn't do the beat, y'all\nIt ain't my fault if she didn't move her feet at all\nSkeeter, robbed Peter to pay Paul\nSo he could trick it on Mary so she can play ball\n\n[Chorus]\nShe better have my scrilla\nCut it out with all that funny hand jive, will ya?\nAll this trouble for a tall glass of Olde E\nDrink it all fast and make you haul ass slowly\nRemind me to remember what you told me\nHoly moly, did you get a load of her roly-poly?\nYo, G, remind me to remember what you told me\nWhoever don't feel him, feel balls like a goalie\n\n[Verse 2]\nOne for the money, two for the better green\n3,4-Methylenedioxymethamphetamine\nTold the knock-kneed ghetto queen, \"Get the head fiend\"\nTell him it's for Medellin and use oxyacetylene\nWho needs airplay? It's all just hearsay\nLeave a wig like it was having a bad hair day\nMiracle glide master, asked him what's his secret\nHe said Shasta and turned to formaldehyde faster\nWhen I'm home with my lady, I try to duke her daily\nOne night, she tried to flail me with her ukulele\nPack your heat, the Villain on the cover of Black Beat\nWith a bunch of crackers and some snack meat\n\n[Chorus]\nThey better have my scrilla\nCut it out with all that funny hand jive, will ya?\nAll this trouble for a tall glass of Olde E\nDrink it all fast and make you haul ass slowly\nRemind me to remember what you told me\nHoly moly, did you get a load of her roly-poly?\nYo, G, remind me to remember what you told me", "image": "https://images.rapgenius.com/e35ae570deff5c95d381ad7936ceba81.480x343x1.jpg"}], "artist": "MF DOOM"}