{"songs": [{"title": "Stretch Armstrong Freestyles", "album": "Build and Destroy", "year": "2003-07-29", "lyrics": "[Royce Da 5'9\"]\nStretch Stretch.. (Whassup sup?)\nI'm tryin to figure out a way to start this rhyme off (Mmm)\nYou ain't got no ideas? (Nah)\nAight, I'll start it like this (Aight)\nCheck it, yo\n\n{*P. Diddy's \"Bad Boy for Life\" beat plays*}\n\nFUCK, you! (haha) I'm all nuts, no glory\nYou're walkin now but nigga what's the story?\nYou better, duck when I go BOOM, cause suckers bore me\nAnd yeah, I probably hate Tommy Boy as much as Nore do\nWho the best?  Eminem, Jigga or Nas?\nCause when it comes lottery time, that spot'll be mines\nYou takin the throne is under the bridge\nAnd yeah, you might be +Ready to Die+ but none of you +Big+\nSo, you've been dared to listen\n'til the fiercest rhythm'll spit air condition glitter and wrist cool\nFUCK doom, I don't age\nCut \"Boom\" up loud and see a mushroom cloud on stage {*explosion*}\nDo the math, four knuckles'll give you six months\nAnd, you niggas is so pussy you make my dick jump (haha)\nI don't wish to be king, I'll pass the throne\nWhatever shines too bright shines half as long\nI don't kiss hoes, I only put my lips on a cup\nPee-wee niggas, go somewhere and piss on your nuts (haha)\nGod gave me this life, and if he decides to envy and give me\nI'm takin the flow of the century with me\nOh, so if you feel insane, and want a war\nReality check, you not ready, your soldiers is still in trainin\nA bunch of hundreds that'll read the menu\nWe run tabs with receipts sayin \"To be continued..\"\nAnd - bully niggas this is your day\nMeet me at the flagpole so you can hit me in my fists with your face\nAnd snitch niggas is common as E-Bay wear\nUhh, give the cops more +Alerts+ than DJ Red\nI got the blood of a dead soldier, on my palms\nAnd the scent of yo' bitch lingerin on my fingertips\nAnd you niggas is deep, I got a deep barrel that'll blaze\nSo FUCK deep, the deep shall lay in a shallow grave\nFor you deep niggas\n\n{*beat switches to Lord Tariq & Peter Gunz' \"What's That Sound?\"*}\n\nUhh.. {Stretch Armstrong is now in your world..}\n\nYo, I determine what time it's on, I call my nigga Proof\nHand him a pint of Limon and turn him loose!\nI'm tired of you new jacks\nI'm tired of niggas sayin they bout to blow\n'Less you a bitch, I don't care if you bout do that\nMove back, youngster, the Glock gon' speak\nChew up your vest and turn your chest hair to taco meat!\nThe street, continuous to pit, too quick to smash ya\nOr flash the clip, or give you the picture develop\nThe click clock, six shots blows through another door\nAnd it gets hot, this Hip-Hop Quotable tug of war\nWho did ya niggas beats you bitches, who made it work?\nThat shit was {*phwrt!*}, I got harder 2-Way alerts\nYou get toe-up and re-torn; by the walkin bomb\nThat I blow up and re-form, grow up then re-born\nTold you I'm a star that's gon' live forever\nServin life sentence and get out and go to the bar\nSo nigga take BLLAT!  I gotta go to the car\nBLLAT, oh BLLAT!  I gotta throw it in 'park'\nThe iron'll wet ya - the Mausberg pump\nWith the buckshots shells'll turn a nigga into Chinese Checkers\nI don't even start writin 'til I'm on my third 5th\nThat's what you get, when Beatminers meet the Wordsmiths\nUhh, every time I go out, I cop somethin new\nEvery time I throw this right hand I knock somethin loose\nWho the fuck think they can see me?  Might as well\nCall the wife and tell her you're not comin home and to take it easy\nMy guns don't shoot, they WOOF!\nAt them sissy-ass niggas type to accidentally shoot they foot\nDesert Eagle too big for you bitch-ass niggas\nSoft-ass palms, can't take the kickback niggas\nAnd you wonder why they suckin my dick\nOr why I keep a suitcase with a hundred grand handcuffed to my wrist\nOr why the watch could possibly make you lose your sight blinkin\nOn the wrist, lookin like halogen hazard lights blinkin\nRoyce 5-9 in this bitch\nAbout to sprinkle gunfire on any snitch\nNow who the fuck want it, bitches?\n\nYeah, uhh, uhh", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}