{"songs": [{"title": "Neva Gon Stop Me", "album": "Freshmen Adjustment Vol. 2", "year": null, "lyrics": "[Intro: Kanye West]\nWhat are they gon' tell me?\nYou know what I'm saying\nI used to be in gym class like \"Nigga, I'm finna be a rapper\"\nI didn't do my homework for my last three years of high school, nigga\n\n[Verse 1: Kanye West]\nSo I'm assuming ya'll niggas don't know what you doing\nYou're not hot cause your tapes don't work\nWe can't stop, our brakes don't work\nMan I heard you spit your favorite verse\nIt's the softest place on Earth\nYa'll some motherfucking idiots\nDropping enough bricks to build a city with\nWhat the fuck is on your mind?\nYou sniffing that shit\nMy own blood, go on stud\nProbably the reason that the phone bugged\nAlways talking fast as hell like Bone Thugs\nYou act like you don't know what the chrome does\nLike what 2 shots to the dome does\nPlus you kind of slow man\nBut if we listen to you\nWe all be broke like Gary Coleman\nI'm trying to blow like Pokémane\nAnd I don't want to have to choke you man\nI'd rather go to bed, getting head on the sofa man\nYo but, aigh, it's over man\n\n[Hook]\n\nNothing's gonna stop Nothing's gonna stop Nothing's gonna stop me!\n(I said) Nothing's gonna stop Nothing's gonna stop Nothing's gonna stop me!\n[Talk over Hook] Niggas can't be serious, you the only Nigga I know experience Y2K\nYou the only Nigga who lights went out fucking ?? 2000!\n\n[Verse 2: Kanye West]\nLet's go man\nI hate a gold digging bitch that want to get in my whip\nFuck fucking, I make her kiss the tip of my dick\nYou know what I'm here for cut all that crying and shit\nPlus my nigga want a fit\nWhy don't you buy him some shit?\nI'm from the land of the P-I-M-P\nI got these hoes buying the weed and the optimos\nWhy you think my neck froze?\nWhy I got these clothes?\nPSSH Man I gots to pose\nNext to the, lex to the, benz fit ya, next time we, fuck, bring ya, friends with ya\nAnd he doesn't take American Express\nAnd he don't take hoes with small breast keep it moving (keep it moving)\nI hate lame niggas, I hate gay niggas, I hate a dick riding I-I-I I know Kanye niggas\n(So) save the talk and save the game how you gon con me when Kan half my name? Nigga\n\n[Outro]\nI did about 4 or 5 beats for Nas\nThis nigga don't know how to pronounce my name because they always spell it wrong\nShit, you know I'm saying, I'mma I'mma tell it real, you know what I'm saying? That's not cool, y'all can't even...", "image": "https://images.genius.com/96319570be9d2165984a99be5ecf2edf.500x500x1.jpg"}], "artist": "Kanye West"}