{"songs": [{"title": "Pull Up*", "album": "Born 2 Rap", "year": "2019-06-07", "lyrics": "[Intro: Denzel Washington in Training Day]\nAw, you motherfuckers. Haha, OK\nYou think you can do this to me?!\nYou motherfuckers will be playing basketball in Pelican Bay when I get finished with you. SHU program, nigga! Twenty-three-hour lockdown! I’m the man up in this piece! You’ll never see the light of da-who the fuck you think you fuckin' with?\nKing Kong ain't got shit on me\n\n[Verse 1]\nThe last who rock, the last fuckin' dance, nigga\nYou know I'm a blood no rag in my pants, nigga\nWhat they sayin' nigga? He fell off?\n'Cause he in Calabasas well off, copped the new Lambo\nAnd cut the tail off, chopper on his lap can knock a whale off\nI'll steal Dr. Dre yacht and sail off\nDon't believe me?! Watch me, who the fuck gon' stop me?!\nI know Andre Young wish he left me where he got me\nDay after they shot me I was walkin' out the swap meet\nCrutchin' on my left arm, niggas tried to Pac me\nAll they did was make me stronger\nWanna, gangbang longer, had to\nCreep inside of Slauson make my, chain hang longer\nBunny hop into that Range with the thang-thang on him\nRed flag wavin', oh you tryin' to bang-bang on him?\nMonkey nuts banana clips with that, orangu-tang on him\nKing Kong ain't got shit on me, it's training day homie\nPull up\n\n[Chorus]\nOh you think you bangin'-bangin'? Nigga pull up\nAll you niggas gangstas now? Nigga, pull up\nOh you think you poppin' lil nigga? Pull up\n'Cause we run the night and hit that back fence\nCut a nigga power, 100-round clip we out of crazy hours\nCatch a nigga slippin' like he in the shower\nPut a body in the ground and let it grow a flower\nPeace sign nigga, Eastside nigga\nWestside nigga, Tecs fly nigga\nLM-double O-2, test drive nigga\nNorthside, Southside niggas ridin' with me motherfucker\nPull up\n\n[Verse 2]\nWhen it come to gangbangin', nigga I'm a specialist\n6s pro club I been with the extra shit\nWhen I say five, I don't do it for the flexin' shit\nI mean on Cinco de Mayo I shot it out with Mexicans\nDid my first drive-by, wasn't even havin' sex and shit\nFourteen, back seat, shakin' like the exorcist\nAll these demons inside me got me loadin' up the Tec and shit\nGun hangin' out the window kickin' on some Tekken shit\nWe was on that Texas shit, Impala leanin' like it's sippin' on that medicine\nWe see yo' 'hood, we cross it out and disrespect yo' shit\nI was Redman, aimin' at yo' headband\nAnd when I'm with my killa' bees I'm on that Method shit\n40-Tical nigga, 2 Tecs, Rasheed Wallace I'm a foul nigga\nSince I had the super soaker, runnin' 'round wettin' shit\nClean the whole block now he ain't even got a set to trip\nTell em, pull up\n\n[Chorus]\nOh you think you bangin'-bangin'? Nigga pull up\nAll you niggas gangstas now? Nigga, pull up\nOh you think you poppin' lil nigga? Pull up\n'Cause we run the night and hit that back fence\nCut a nigga power, 100-round clip we out of crazy hours\nCatch a nigga slippin' like he in the shower\nPut a body in the ground and let it grow a flower\nPeace sign nigga, Eastside nigga\nWestside nigga, Tecs fly nigga\nLM-double O-2, test drive nigga\nNorthside, Southside niggas ridin' with me motherfucker\nPull up\n\n[Prince Production]", "image": "https://images.genius.com/ad6f06c94460fb7303cc0cd341240eae.1000x1000x1.jpg"}], "artist": "The Game"}