{"songs": [{"title": "Knuckle Up", "album": "Build and Destroy", "year": null, "lyrics": "[Hush] + (Royce)\nWhat? (Knuckle up)\nYeah.. (Whatchu say?)\nHush (Uhh uhh, Royce Nickel-Nine)\nYeah, we represent Detroit Rock City\n(And we'll FUCK you up!) Yo, yo, yo!\n\n[Hush]\nYou're fuckin with a straight-up menace\nThat'll run inside your apartment complex and start sprayin tenants\nI stick bastards for a wealthy scheme\nPunch through your chest and snatchin out your self-esteem\nStabbin your spleen, precise like a javelin team\nGrabbin the green, quicker than a crack and a fiend\nQuick draw, faster than it takes you to blink\nI spit thoughts, faster than it takes you to think\nYou catchin a sink, drownin in whatever you drink\nI'm huntin you down, bustin at your leather or mink\nI'm meltin your ice, I'm heated in your average rink\nLockin it down, and rockin like I'm trapped in the clink\nSlappin a freak, trappin every rat or a fink\nFast with the ink, blast you out your hat or your link\nShatter your teeth, every time you chatter or breathe\nUnravel your cream, Detroit it's ether that or the bing\nHush, I get madder and mean\nMatter of fact, all of y'all get splattered in three - pieces\nJust your body and arms in shirts sleeveless\nBeggin for Jesus, before your heart collapses and seizes\nWho needs this, crush the fine line\nI'll be on the phone callin my boys and 5'9\"\nDetroit city cats that are born with nine lives\nAnd I use that are yours, you better shoot me nine times!\n\n[Hook 2X: Hush] + (Royce)\nKnuckle up! If you see us cop a plea and duck\nKnuckle up! (When you see us in the streets in a truck)\nKnuckle up! If you see us droppin B's in a buck\nKnuckle up! (When you see us in the D, nigga what!)\n\n[Royce Da 5'9\"]\nUhh uhh.. yo yo, yo\nI done took more bitches off more niggas hands\nAnd, more niggas ran from po-po's in a van\nStick to my word so I don't threaten niggas no more\nIf I make you a promise then it's safe to say that it's honest\nMy guns, tired from being fired, while yours sit on the shelf\nI'm like a sole concept in itself\nChokin my weapon, burnin your vest\nIn 2G, rap niggas learn from the best and hope to be set\nKnuckle up - I don't depend on my toast to spark\nWrap my fingers around your neck and let the chokin start\nI'mma be on top pissin 'til I soak the charts\nYou don't like me but I'm still here like Rosa Parks\nA flow is a flow, so - lo and behold the art\nI listen to you and go, \"ehh,\" on your dopest part\nI don't do these open mics, I tear shows apart\nWhodie I'm a +Hot Boy+, you get roasted dark\nFirst nigga to hit the flow is smart\nLast nigga that hit the flow you 'bout to see him and his folks depart\nBling bling - chain glow in the dark\nMore flooded with mo' ice, cold-blooded with a frozen heart\nHe's not street smart, he only knows the park\nBut we can share this rap pie long as he knows his part\nIf you was even close to smart, you know I roll with sharks\nAnd dogs that bite and only supposed to bark\n\n[Hook] - 2X", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}