{"songs": [{"title": "Think Of Me", "album": "Who You Mad At? Me Or Yourself?", "year": "2013-04-18", "lyrics": "[Verse 1]\nIt's that D-O double 'Bino\nNigga, how you livin'? Yeah, my life so cappuccino\nBittersweet, I'm giving everything I got, I feel so\nHelpless, help us, shopping at the Gelson's: soymilk, shellfish\nUsed to stunt Kitsune, used to date Katsumi\nBut then I got a new one, but she ain't talking to me\nIMessages unread, pain that was unsaid\nLaughter that we ain't heard from children we ain't had\nI'm a boss, homie. Die a boss like I'm Steve Jobs\nThey thought I was Jamaican, I got three jobs\nThey must have been mistaken, I ain't feel ya\nThey respect the grind and zone 6 lookin' real soft\nDear Mom, you sound sick every time I call\nDad's lying to me, I can hear it in his tone\nI don't want nobody help, leave me the fuck alone\nBrother holding my head in the shower don't know what I'm on\nRivers running through my nappy afro\nFeeling guilty, won the raffle\nBut the lotto ate my motto at my core\nI'm just an apple and they want me PC\nPaid for my house but this show is not me\nMore than the music, we going for that mastery overload\nDa Vinci Code comatose to sport a beard like I'm OVO\nGot that cream, I'm an Oreo\nYou know how the story goes\nDatPiff four page cause you suck something glory hole\nIt's that Fresh Prince, Royalty means you deserve it\nWe were best friends, they talking bout him and I\nThey loving this silly guy, I'm popping Abilify\nNiggas was wildin' out cause they want me so civilized\nThey say anytime that you getting cheese you in a rat race\nAny movies that they offer me is black face\nIt's so post racial, so I can't prove it\nWe the same thing, we in the same movement\nBusiness is business, we eating lunch, just not on silent\nIt's the Diddy and Biggie driving backwards, I'm so iconic\nIf I'm dead before Detox it doesn't mater, I heard The Chronic\nYou gon' sell it on eBay, just be glad that I fuckin' signed it\nI ain't mad, though, you gotta eat, right?\nI know your voice, man, you Marshall Lee, right?\nNah, I'm what you hear in your dreams saying it's not enough\nGod had made a lot of land, I gotta buy it up\nI'm bouncing on the highway, blast it in my driveway\nPut that shit on replay, turnt up on agave\nCheck the kimosabe, my life is so behind me\nIf you ain't feeling it, come and find me\nCome and find me\n\n[Outro]\nYeah, I'm so on to you\nI'm so on to you\nI'm on to you", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg"}], "artist": "Childish Gambino"}