{"songs": [{"title": "Street Hop", "album": "The Bar Exam", "year": "2007-04-07", "lyrics": "[Woman talking]\nNickel\nThe M.I.C. bitch\n(Statik)\nYou show off\nVerse one\n\n[Verse One]\nI've been a monster bitch\nMy shit been bonkers\nThe flow been conquered\nHoes I been pompous (Smash Squad)\nI've been conceited but I don't run with 5-0\nI haven't been shot up either and I ain't from Chicago\nWhen I enter the center stage the show's over\nMinutes later the floor is frozen, a Rolls, rolls up\nI'm demonstratin' a coke flow but I'm so sober\nThe original +Renegade+ before Hova\nThey like, \"Damn, why ain't Dre ever get him?\nHe seem like so much anger and pain represent him.\"\nEminem himself will tell you I'm the only nigga livin'\nThat done ever spanked him on the same record with him\nYour man's gettin' jealous\nCause what I'm spittin' is sicker than his single\nHe got to think of a dance just to sell it\nThis is street hop to the fullest\nTo them real niggas out there on the corner beat boxin' with bullets\nNiggas that be trigger packin'\nPop lockin' with Glocks\nCould aim well enough to shoot the zippers off your Thriller jacket\nMe, I'm the illest rapper\nSince every rapper killin'\nFrom here on out, you can call me Shottie The Killer Capper\nThese record labels just manufacture shit\nLike the pimp game homie, I'm here to snatch yo bitch\nGot a fist game on me that ain't an afro pick\nTry that ying yang on me, I'll handy cap you quick\n\n[Woman speaking]\nVerse two\n\n[Verse Two]\nUsually I play the two or three I been ballin'\nBitch, losin' me is like the Piston's losin' Ben Wallace\nI'm to Detroit like what Souljah Slim is to Chopper City\nSo losin' me is like musically losin' Pac or Biggie\nI'll be your ass, leave you with your mouth piece wired\nLosin' pounds in the hospital, be quiet\nTil you finally come up out that coma, boney\nLookin' like somebody put you on the South Beach Diet\nIf you hearin' me spit it, it's soundin' like the king died\nTrippin' when I kick it, it's soundin' like my strings tied\nI put the clip in and pull it\nAnd woof\nWoof\nListen, the pistol is soundin' like Hakeem's bride\nAnd you don't wanna beef nigga cause my arm's be\nAll through Cali and Miami like a palm tree\nMy crew be\nIn New York or New Jerz usually\nWith tools to recognize you as who is you?\nExcuse me\nYou don't wanna fool with the etiquette or the Uzi\nI'll put you in the credits that's at the end of the movie\nI pity your mother\nShe never seen you in a magazine\nFor the obituary I give you the cover\n(Smash squad)\nSo when I'm rhymin' with ya\nI'm Ving Rhames of the pimp game\nI play the same role as Tiny Lister\nAgain and again\nThe Debo of the type cast\nWhen I TiVo the mag they be showin' the white flag\nSo sit at the table and get it like it's digital cable\nI torture you into talkin' to me till it get's fatal\nFuck with you till I put you out of your misery\nWith a silence or I'mma just muffle it up with a potato\n\n[Scratch Outro]\n\"This is street hop\" - Nas 'Made You Look'\n\nDJ Premier on the cut\n\"Six July\" on the beat", "image": "https://images.genius.com/4f966eb73a81b58069fb8aff648de307.700x700x1.jpg"}], "artist": "Royce da 5'9'’"}