{"songs": [{"title": "Hand of the Dead Body", "album": "The Diary", "year": "1994-10-18", "lyrics": "[Intro: Voiceover \"News Anchor\"]\n\"In world news today: officials agree that rapper Brad Jordan, alias\nScarface, must be stopped. After being monitored by Secret Service agents for two years, evidence leads Tobacco and Firearms officials to believe that his literally dope lyrics promote drug usage and distribution,degrade women, influence gambling, promote and teach violence. And more importantly it's influencing our minors and destroying our young community. Officials say, he's the lord of underground rap and his music must be stopped.\"\n\n[Verse 1: Scarface]\nWe got this ho muthafucka on a mission\nNow the whole entire world's gotta try to come up with a quick decision\nThey claim we threats to society\nAnd now they calling on the government to try and make somebody quiet\nFor the bullshit they done to me\nGangsta Nip, Spice-1 or 2Pac never gave a gun to me\nSo gangsta rap ain't done shit for that\nI've even seen white folks from River Oaks go get the gat\nSo why you trying kick some dust up\nAmerica's been always known for blaming us niggas for they fuck-ups\nAnd we were always considered evil\nNow they trying to bust our only code of communicating with our people\nLets peep the game from a different angle\nMatt Dillon pulled his pistol every time him and someone tangled\nSo why you criticize me\nFor the shit that you see on your tv\nThat rates worse than PG\nJust bring your ass to where they got me\nSo you can feel the hand of the dead body\n\nChorus: Devin The Dude\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\n\n[Verse 2: Scarface]\nSo now they trying separation\nAnd sending black folks in white coats to infiltrate our congregation\nTapping into our conversation\nSaying the message that they give\nBring forth or premeditation\nSo David's got a silver mag\nWhile listening to Brad, David gets pissed and kills his dad\nDavid Duke's got a shotgun\nSo why you get upset cause I got one\nA tisket a tasket\nA nigga got his ass kicked\nShot in the face by a cop, close casket\nAn open and shut situation\nCop gets got, the wanna blame it on my occupation\nIf you don't dig me, than nigga you can sue me\nBecause the shit that I be saying ain't worse than no western movie\nDon't blame me blame your man Gotti\nSo you can feel the hand of the dead body\n\nChorus: Devin The Dude\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\n\n[Verse 3: Ice Cube]\nYou best to free your mind\nBefore I free my nine\nAnd stop fucking with D'voidofpop\nOr feel my hot rocks\nBang,bang, boom boom, ping ping I'm the black\nWhite boys got a magazine and don't kow how to act\nI'll attack and make you vomit\nDown with Khalid Abdul Muhammad\nDo he got a brother, I'm it now\nI'm the illest\nWanna kill this house nigga Don Cornelius\nCan you feel this?\nYou punk niggas make me sick\nSucking on the devil's dick\nScared of revolution\nNeed to start douching\nHouston is the place\nI caught a case\nThem motherfuckers tried to put a scar on my face\nBut I bust two times to the gut\nDo the Reverend Calvin Butts\nGot a pair of nuts?\nI started this gangsta shit in '86\nNow you dissing me\nFor publicity\nIsn't he a ho to the third degree\nWho me\nI'm a g who like to scrap-a-lot\nDown with Rap-A-Lot\nAnd I can't stop, won't stop\nSo fuck Bill and Hillary\nIce Cube there ain't no killing me\nIce Cube, Scarface\nDropping on these selling out niggas, doing it like this\n\nChorus: Devin The Dude\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long", "image": "https://images.genius.com/18ccee2c198d56c7f1368268755e5bd3.1000x966x1.jpg"}], "artist": "Scarface"}