{"songs": [{"title": "Lazy", "album": "Us or Else: Letter to the System", "year": "2016-12-15", "lyrics": "[Hook: Gizzle & T.I]\nKnow why you broke because you niggas is lazy\nHold up tell em\nDont wanna be a monster but this what they made me\nI am what I am, so?\nStart getting this money they thought i was crazy\nI'm out of my mind tell em\nI know why you broke you niggas is lazy\nFuck nigga look\n\n[Post-Hook: RaRa & Gizzle]\nAin't got that problem damn thats fucked up problem\nGoing out bout these dollars hustle up stack these dollars\nWaking up early going to go get it coming home go to sleep with it pray to God everyday let a young nigga ball\nBut you niggas is lazy\n\n[Verse 1: T.I.]\nTell me why everytime I see you niggas you be all on instagram showing money off\nPoppin' bottles at the strip club still living at yo momma house Nigga what the fuck you celebrating for? If you ain't got it what the fuck you on vacation for?\nMake it seem like you ain't rushing tryna take it slow, you 29 nigga what the fuck you waiting for? Remain focused on yo grind keep it on yo mind\nUniverse can't deny you when you bonafide hey why you niggas taking pictures in your whip just acquire me some land it's a gold mine\nAin't no more waiting on niggas to put you on better get your hustle on get it going on your own boy and don't nobody give ah damn about your homeboy\nAin't no excuses for a broke boy no more\n\n[Hook: Gizzle & T.I]\nKnow why you broke because you niggas is lazy\nHold up tell em\nDont wanna be a monster but this what they made me\nI am what I am, so?\nStart getting this money they thought i was crazy\nI'm out of my mind tell em\nI know why you broke you niggas is lazy\nFuck nigga look\n\n[Post-Hook: RaRa & Gizzle]\nAin't got that problem damn thats fucked up problem\nGoing out bout these dollars hustle up stack these dollars\nWaking up early going to go get it coming home go to sleep with it pray to God everyday let a young nigga ball\nBut you niggas is lazy\n\n[Verse 2: Tokyo Jetz]\nShow me another bitch you know that grind like me on some new new\nAnd old shit don't excite me\nDon't wanna hear about no ems you flip birds cause niggas go get around a bitch and try to flip words\nGive a fuck about what yo shoulda coulda woulda did\nIn the league ain't wit all that talking say that shit again\nCatching plays serving jays just to go buy michael jays\nMichael played you ain't gotta ride where michael play\nFucked up niggas loved to flex for the gram ain't got shit for a bitch and no i wouldn't give ah damn\nYou's ah butler at the trap you's ah doughman the type to flex with another nigga doughman, Bad like a bitch tell ah nigga no man\nAnd take yo ass back to the 5th floor man\nFuck what you had at the moment you ah broke man you shouldn't have to tell ah nigga go man\n\n[Hook: Gizzle & T.I]\nKnow why you broke because you niggas is lazy\nHold up tell em\nDont wanna be a monster but this what they made me\nI am what I am, so?\nStart getting this money they thought i was crazy\nI'm out of my mind tell em\nI know why you broke you niggas is lazy\nFuck nigga look\n\n[Post-Hook: RaRa & Gizzle]\nAin't got that problem damn thats fucked up problem\nGoing out bout these dollars hustle up stack these dollars\nWaking up early going to go get it coming home go to sleep with it pray to God everyday let a young nigga ball\nBut you niggas is lazy\n\n[Verse 3: RaRa]\nMotherfuck the world & everything in it\nHandle my business my business from start till I finish\nSleep when I die spit fire till i grow tired suit & tie im suit for it\nIm wrecking shit for it\nFreedom for it going over board catch ah charge if it's necessary\nHard on the legendary that's why you can't see me on TV\nHustle in 3D\nBitch I'm on point with it\n\n[Verse 4: London Jae]\nI pull up like the point with it one shot from the cannon leave these pussy niggas dead smoking like ah\nBeen had what it take to be these momma told me keep my grass cut cause you know these niggas shady go & get em baby\nStaying ya lastest & stay in ya lane stay on the top stay out the business and roll with niggas and know the thing\nKeep these niggas out your business they like hoes & shit keep God first keep on pushing & keep on rolling with it\n\n[Hook: Gizzle & T.I]\nKnow why you broke because you niggas is lazy\nHold up tell em\nDont wanna be a monster but this what they made me\nI am what I am, so?\nStart getting this money they thought i was crazy\nI'm out of my mind tell em\nI know why you broke you niggas is lazy\nFuck nigga look\n\n[Post-Hook: RaRa & Gizzle]\nAin't got that problem damn thats fucked up problem\nGoing out bout these dollars hustle up stack these dollars\nWaking up early going to go get it coming home go to sleep with it pray to God everyday let a young nigga ball\nBut you niggas is lazy", "image": "https://images.genius.com/4a3af1ad50f638f4b221d88c280afff5.680x680x1.jpg"}], "artist": "T.I."}