{"songs": [{"title": "Still Slippin’", "album": "Life", "year": null, "lyrics": "[KRS-One]\nThey slippin Duke\n\nYou slippin Duke, you trippin Duke\nRememeber you still livin in a corporate chicken coop\nWith a hundred other chickens yellin get that loot\nMakin a hundred other chickens tryin to spit what's cute\nBut KRS spits the fruit\nMy words are not hollow, I'll lead you out the chicken suit\nYou slippin Duke, I got proof, spit truth in the club\nSo the colleges man, we get so loose\nWhat's the use, you slippin Duke, how America great\nWhen Iraq, had no nukes, now OOPS\nWhatever happened to samples and loops?\nThe same thing that happened to organs and flutes, and real artists\nThank God for The Roots, the soldier that's home with his family\nSupport for the troops yeah, now let's start this\nI've taught many groups, been through many suits\nTeachin new recruits that can't take it back to hula hoops\nI know we're on mute, stand up straight\nI'm like Skywalker without the loot, you slippin Duke\n\n{*scratch: \"At 8 you're a sucker, at 7 a motherfucker\"*}\n\n[KRS-One]\nYEAHH!\nTalk your talk, degrade my character\nYour remarks are amateur, the future laughs at ya\nI got much stamina, and I know my facts\nI am hip-hop, I don't speak for blacks\nI speak for hip-hop's preservation, and only that\nPeace love unity, I'm known for that\nWhat's your hassle with me man, no man is ownin me\nYou just mad cause I lead hip-hop globally\nYour hassle is that, I'm an international cat\nYou know in any debate, I'm smashin your crap\nWhen it comes to hip-hop, you behind\nCause I've been organizin this politically since 1989\nI stay selective, the objective peace of mind\nI am hip-hop and so are you don't be so blind\nUse the key next time, you know my roots\nBut listen dog you slippin Duke!\n\n{*scratch: \"You wanna hear a fresh rhyme, you'll come to the source\"*}\n{*scratch: \"Stamp BDP on your head then you're off\"*}\n{*scratch: \"At 8 you're a sucker, at 7 a motherfucker\"*}\n{*scratch: \"Do not attempt to diss cause you're soft\"*}", "image": "https://images.genius.com/12162bd5dc20dab4c0cbb67190522d80.500x493x1.jpg"}], "artist": "KRS-One"}