{"songs": [{"title": "Cardboard Box", "album": null, "year": null, "lyrics": "Verse 1: (Havoc)\n41st side nigga, them thirsty side niggas\nNumber one pick, gutter litter, leavin' 'em bitter\nHow the fuck a nigga figure he can come through this?\nWith no worry at all and ice on his wrist\nPlottin' to get it, poppn' them slugs\nOne in the mug, leave 'em in the morgue, keepin' it gangsta? we keepin'\nIt thug\nMakin' albums, washin' that dough made from narcotics\nYou know the mob brolic, gats we got it\nLike a bitch on her period, don't even wanna see you\nUnless you got what I need, and we sure not peoples\nOnly niggas that I fuck wit' could hold what I bust wit'\nA one minute nigga, hit 'em like when I nut quick\nGot a bad ass bitch that'll fuck your clique\nAss so fat, make the illest nigga dry snitch\nIt's time to stretch on these cats 'cause my dogs is restless\nThe number one sinner mothafucka, repent this\n\nChorus -\n\nFuckin' wit' us will leave you in a cardboard box\nFuckin' wit' us will leave you leakin', callin' the cops\nWith nothin' to bust? we'll leave you in a fucked up spot\nAnd you don't even wanna be that nigga claimin' a spot\n(repeat)\n\nVerse 2: (The Jackal)\nPlay stupid, 32 shots nigga, looped it\n64 troopers, Tim boots and Rugers\nShow and prover, Q.B. manuever\nPure breed grower, flow gives brain tumors\nHolla at ya dog, movin' units\nAin't ready for the onslaught\nTry to knock the Don off\nNot too much talk, niggas just pop off\nGot that feelin' inside, who willin' to ride?\nAight here, take this Four-Five\nCardboard box these niggas off sides\nRap nigga live, rap niggas alive\nThat nigga high, gangsta stroll, stackin' to the sky\nPoppin' his collar nigga, tossin' that dollar\nAct up, blood clot his throat, make it hard to swallow\nUsed to pitch times holdin' trotters\nNow I pitch 16's with the culture power saga\nYou sorry, don't bother, Q.B. to Carter\nRucker, Nino, Goodfella, Godfather\n\nChorus x2\n\nVerse 3: (Littles)\nCame home after 5, stood on my own two\nI learned to seperate Men from Boys and crews\nI toy with dudes, now I'm just annoyed with fools\nI'm a pimp on a track with another Mans food\nI refuse to be whored by another Mans rules\nIt's a pimp and ho game, you gotta respect the business\nBut I only mob with thugs and gangsta niggas\nIt seems nowadays snitches get respect\nYa'll don't know a real nigga 'till he's layed to rest?\nYa'll lucky I ain't come home chasin' necks\nArms, legs, chests, blazin' tecks\n'cause I love to snap, crackle, and pop them hammers\nRock bandanas, cop wanna knock and jam us\nWatch and slam us, locked up, box and canners\n'cause when I start lickin' all you niggas start snitchin'\nBitchin', little niggas start missin'\nWe provide ya'll with the truth and facts\nYa'll don't wanna give me burn with these ruthless raps\nShit, I'll bounce ya'll ass straight off the tracks\nPlus I roll with gorillas and I'm true to cats\n\nChorus x2\n\nVerse 4: (Nature)\nAll I need is a kick and a snare, ya'll niggas scared\nMy name speaks for itself, it rains as soon as it hits the air\nGot a wicked stare, one eye crossed\nIn Queens fiends returnin' every gun I toss\nEvery dun I corpse, my religion is none\nI figured once I lay it out niggas 'll run\nI could type it up e-mail\nAnd give it to you, when you're done you're comin' back for a refill\nGrade A shit, like the taste of the haze and the dro\nI rock the same Guess jeans five days in a row\nSee my Thirty-Six waist is now Thirty-Eight\nQuick to help a nigga up to the pearly gates\nMakin' sure every other live nigga heard of Nate\nGuaranteed to boost the murder rate\nIf it don't it will niggas, chill just give it some time\nHow much pain can a nigga provide?\nYa'll niggas rhyme?", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}