{"songs": [{"title": "The Guide", "album": "Passion, Pain & Demon Slayin’", "year": "2016-12-16", "lyrics": "[Intro: Kid Cudi]\nAin't the type to let you tell her what she needs\nAin't gon' sit or stand around\nA lethal love, I leave 'em sick, mamacita on me\nNo, one touch is never allowed\nShe said, \"What do you want, what do you want, what do you want?\nWhat do you want, what do you want, what you want, what do you want, what do you want?\nWhat do you want, what do you want, what do you want, what do you want, what do you want?\nWhat do you want, what do you...?\"\n\n[Chorus: Kid Cudi and André 3000]\nOoh, ooh\nWhere you going?\nWhere you going?\nWhere you going?\nOoh, ooh, ooh, ooh\n\n[Verse 1: Kid Cudi]\nI need a winnin' woman, a Wonder Woman\nA Gal Gadot, sophisticated and hot (Uh)\nShe knowing what she doing, like the music here\nWhen she step on the scene she could light up the block (Uh)\nSittin' all, took her, make her awesome\nCivil hearts hid them whole love back in a custom\nAin't too many women, I know\nWho could look at your soul, just from lookin' at you\nI heard she got these niggas fallin' at her feet\nShe kneels to no one with her golden crown\nYou'd be the one to b-bow\nYou'd be the one to b-bow\nHave mercy on me, put some magic on me\nBe my guide in the dark (Uh)\nHave mercy on me, put some magic on me\nBe my guide in the dark, guide in the dark\n\n[Chorus: Kid Cudi and Andre 3000]\nOoh, ooh\nWhere you going?\nWhere you going?\nWhere you going?\nOoh, ooh, ooh, ooh\n\n[Verse 2: André 3000]\nSo when did we become so sophisticated and smart\nAnd tryin' so hard that we forgot that we were animals?\nBut never her, I never heard a creature make such sounds\nIt never would occur to people her up-downs\nConvertible, would murder evil, pup-pup hounds, just been doggin' her\nCourtesy and real love found, just been dodgin' her\nMr. Man, misogyny hands been massagin' her\nIf she ran and blew up her town, shit, I would pardon her\nPut a part in her scalp, scratch her dandruff\nPut her heart in your hand, she throw a tantrum\nBetter let her get that shit off, bug repellent\nHell, they've been telling her \"Nah\" since forever\nHarold Melvin and some Bluenotes all she know\nMurder, murder, murder, m-murder all she wrote\nPerverted, she prefer to be hurted, claw her throat\nAll the dirty verdicts she learned watchin' soaps, yeah\n\n[Chorus: Kid Cudi and André 3000]\nOoh, ooh\nWhere you going?\nWhere you going?\nWhere you going?\nOoh, ooh, ooh, ooh\n\n[Verse 3: Kid Cudi]\nSemi-automatic with the passion when we makin' love\nNever made it to the bed, sexin' on the living room floor\nNow she on the warpath, homie probably best that you don't piss her off\nGot this woman on the prowl, on the hunt, she gon' eat 'em all\nAnd she know what she lookin' for, know what she lookin' for\nShe said she got herself some Louboutins, got herself some Louboutins\nNot indecisive, indecisive at all\nShe know what she lookin' for, got her some Louboutins\n\n[Chorus: Kid Cudi and André 3000]\nOoh, ooh\nWhere you going?\nWhere you going?\nWhere you going?\nOoh, ooh, ooh, ooh", "image": "https://images.genius.com/efae5867d6e39372f9815e5f28cde6a5.1000x1000x1.jpg"}], "artist": "Kid Cudi"}