{"songs": [{"title": "I Remember", "album": "It Takes A Thief", "year": "1994-07-19", "lyrics": "Verse One: Coolio\n\nWhen I was a kid I rode crates on a skate\nAnd I ate everything momma put on my plate\nNiggas walked around packin B-B guns\nKnock on yo' door and run, just for fun\nWe went to the sto' and sold bottles fo' a nickel\nTo feast upon a big bag of Cheetos and a pickle\nYou could get a soda foe less than quarter, and\nPeople used to speak even if they didn't know ya\nWe fought in the streets like little black soldiers\nShake hands, and still be friends when it was over\nWe used to play tag and, hide and go seek, or\nHide and go get it if we had a few freaks, but\nNow thangs changed, kids ain't the same\nThey bang, and slang, and blow out brains\nI wish I could go back but, wishin is for suckers\nLife was so simple then\n\nChorus One: ?\n\nI remember (I remember) ohhhhhhh\nWhen we used to hang\nOn the porch, drinkin brew\nAnd now they drive-by (bay-bee)\nI remember (I remember) ohhhhhhh\nWhen we used to play\nShoot-em-up, up and down\nBut now they gang-bang (bay-bee)\n\nVerse Two: Billy Boy\n\nWell I remember yesteryear like it was yesterday\nRunnin through the streets of Monessen, P-A\nI take you through my childhood step by step\nDaddy always told me to maintain my rep though\nDaddy was a dawg he ain't raise no punks\nIn the midst of the trees we learned how to thump\nAt the tender age of nine momma put us on a plane\nNext stop -- the land of the insane\nCompton California where the killers grow\nForced to live a life that I didn't know\nWore the wrong colors cause I didn't know the facts\nCall her bitch, caught a case, caught a slug in my back\nBut I adapted quickly, suckers tried to get me\nNow the fools better run cause this just driveby Billy\nLittle black boy from the East\nForced to be a killer, but I can still remember\n\nChorus Two: ?\n\nI remember (I remember) ohhhhhhh\nWhen we used to play\nDomino, on the porch\nBut now they drive-by (bay-bee)\n\nI remember (I remember) ohhhhhhh\nWhen we used to have\nArmy fights, in the smog\nBut now they gang-bang (bay-bee)\n\n[Coolio] Back when I was a kid nigga\nWe used to have this game called paperball\n(Paperball? What the fuck is that?)\nGet a piece of paper, ball that motherfucker up\nAnd play with it! Hahahaha\n\nVerse Three: J-Ro\n\nI got Tha Alkaholik juice to wake ya up like a rooster\nBack when I was young, I used to be a booster\nStealin candy from the sto', go to school, come up\nI had the whole playground, chewin all my gum up\nYou know what I'm sayin? Playin still to the chest\nAnd I was the best, playin kickball at recess\nI play Pop Warner, golden pairs for the losers\nWe used to hop corners on the fresh deuce cruisers\nPlayin Galaga, Space Invaders, eatin Reese's\nI had all the women cause my tough skins had creases\nAnd it's been that way since day one\nGirls of the world ain't nothin but fun\nI used to watch Dr. J, come through in the clutch\nRemember New Zoo Review, and Starsky and Hutch\nI remember lunchtime, we used to rhyme out loud\nPeace to the Wop and the hip-hop crowd, I remember\n\nChorus One\n\nOutro: ?\n\nOhhh, my life, no no\nI do remember ohhhhhhhh\nI know you do\nI remember yesterday\nI remember when we played\nI remember yesterday, aoowwwwwww!\nI remember, hell, when we used to play\nIn ghetto blocks through the dark\nI rememmmmmberrrrrr\nYeahhh yeahhh yeahh\nWe used to play dominoes all night long\nDominoes all night long\nYesterday, yesterday\nDo you remember yesterday? I remember yesterday\nYou remember remember remember remember...", "image": "https://images.genius.com/681f5b81de576ad7ba17ac999a7e7e8a.1000x1000x1.jpg"}], "artist": "Coolio"}