{"songs": [{"title": "I Wanna Rock (The Kings G-Mix)", "album": "More Malice", "year": "2010-01-26", "lyrics": "[Verse 1 - Jay-Z]\nHold up, I wanna rock right now\nMy name is Hov and I came to shake the town\nYeah, your boy's internationally known\nBut I'm from the hood, got a pocket full of stones\nI used to cop \"Rob Base\", turn it into \"EZ Rock\"\nJust to stay \"Doug E. Fresh\", all that shit to easy rock\nUsed to \"Chef\" Raekwon, give fiends a \"Ghostface\"\nY'all know my \"Forte\", I just might catch a dope case\nI \"Mastered\" the \"P\"\nWith connects in the Midwest, so I'm \"Heavy\" in the \"D\"\nYour boy still \"Snoop\" around\nSince a pup, I been \"Kurupt\" and I fuck with Tha Dogg Pound\nUgh! Roc Nation is the gang now\nSome dope lyrics is the only thing I slang now\nI \"Get the Job Done\", I put the \"Kane\" down\nIt's no \"Biggie\" - heh, I'm just a king now\n\n[Hook]\n\n(*Malice N Wonderland!)\n\n[Verse 2 - Snoop Dogg]\nG Mix!!!! I was a fiend, before I became a teen\nI melted cabbage sacks instead of cones of ice cream\nCrime orientated that's how the west was originated\nFitted like pieces of puzzle, complicated\nI dropped the sack and tried to rap hits y'all\nThey tried to bang on me, and say that I'm too small\nCool!!! Cause I don't get upset\nI call the king of the east catch a flight then I jet\nRight back to the west, where my niggas is at\nScoop the gilly put it back on the map\nLike this like that while you rollin a bag\nLoadin ya gat, pop pop, I'm holdin ya back\nI'm like the Whopper FUCK THE BIG MAC!!!\nRun up on the dog my gat go click clack\nAnd that's fo' sho!!!\nThe reason why, man I don't know so let's go cuz\n\n[Hook]\n\n[Verse 3 - Snoop Dogg]\nBoss Dogg chillin', looking like a million\nYeah, nigga got it, I'mma leave it to my children\nTonight I'm on some other shit, and baby loving it\nHella fast, grip they ass like the oven mitt\nI'm gooned up, boy! Rich as fuck, boy!\nBlack and gold brakes, that's my truck, boy\nI'm on my Eastside, shit I'm working\nI got the party going, and it's jerking\nMy niggas all long, we rolling out deck\nHoes getting in, you better pick a bitch\nCause when I shut it down, the party's over with\nShe call me \"Superman\", I'm on my \"Soulja\" shit\nBoss Dogg get em, I sick em and take em home\nWest Coast bitch, I'm on my fucking throne\nI'm gigging on these hoes, do em like dominoes\nAnd slam em on they back and tell em \"vamanos\"", "image": "https://images.genius.com/463a0ac98c71553803f108dccc9e3499.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}