{"songs": [{"title": "We Dem Boyz (Remix)", "album": "Catastrophic 2", "year": "2014-05-06", "lyrics": "[Intro: Busta Rhymes]\nYeah, O.T. Genasis\nYeah, J-Doe\nYeah, Bus-A-Bus\nBOYZ!\n\n[Wiz Khalifa: Hook X2]\nHol up, we dem boyz\nHol up, we dem boyz\nHol up, hol up, hol up, we makin' noise\nHol up, hol up, we dem boyz\n\n[O.T. Genasis: Verse 1]\nHol up, hol up ,hol up\nI'm gettin money\nHol up, hol up, hol up\nShe acting funny\nMan, that because these bitches want me\nWeed feel like I dipped it in honey [It’s sticky]\nHand cuffin cause she model\nMan,my hand cuffs is pair of diamonds\nHoping that she want to fucking swallow [Fuck me bitch]\nI hit the club and click pictures,called the lotto\nI got a deal they say I’m comfortable\nWell, yeah, I’m treating verses like Lunchables\nDrop top GT to feel the weather\nYour broke ass GT, get it together\n\n[Hook]\n\n[J-Doe: Verse 2]\n\nHol up, Nah! ain’t gon touch that style (Oh no)\nAbout my business, (Yeah) you already know I don’t fuck around\nUnless I’m touching down with your bitch\nGot her going up and down on that dick\nShe said what we doing tonight\nCause I don’t know what you’re doing but we better get to that shit quick\nMy new name Freshness ,Aloe Vicious [Uh hun]\nAll about my business\nI don’t do fake, I don’t do hate, and I damn sure don’t do no dishes\nAll my niggas trip,[uh huh] all my niggas thorough\nHalf em rep their block,[yo] half em rep their borough\nLook All these niggas know me, that Inglewood homie\nGot respect from all the OGs', what the fuck you bout to show me? Hol up\n\n[Hook]\n\n[Busta Rhymes: Verse 3]\nIt’s the conglomerate bitch! Make some noise\nRespect and honour it bitch, We dem boyz\nRookie your bitch chose me, she made a choice\nShe said hol up hol up, I hear his voice\nWhen I pull up, Rolls Royce\nWhile we spend all this money, you counting coins\nMy bitch be bathing in berries it smell like oils\nHol up, Hol up, Hol up, Hol up,We Dem Boys\nNow if you fucking with me, fire up in the air, light your dutches with me\nStack some more M’s bout a hundred fifty\nHol up, Hol up, Hol up, and if you fucking with me\nSing it!\n\n[Hook]", "image": "https://images.genius.com/e62c91245f30f934445e89fdf7493038.500x500x1.jpg"}], "artist": "Busta Rhymes"}