{"songs": [{"title": "MVP", "album": "Theater of the Mind", "year": "2008-11-24", "lyrics": "[Intro: Ludacris sample]\nI'm the MVP, I'm stupid with this rap shit!\n\n[Hook: Ludacris w/ DJ Premier scratches]\n\"Here I am\"\n\"I'm the man\" \"Word!\"\n'DTP's about that bomb shit!\"\n\"LUDA!\"\n\n[Verse 1: Ludacris]\nWhen Premier puts the needle on the record then I put it on blast\nYour flow's garbage, I throw it in the trash\nI'm the MVP, I'm stupid with this rap shit\nRewind the verse, make the track do a back flip\nYour speakers poppin on a handstand\nThey sneak dissin niggas, throwin little jabs like Bam Bam\nBut I'm a bad man, they amateurs like at Apollo\nI wipe em off the stage like Sandman\nGod damn man, what the hell you smokin on?\nIt's Ludacris, I got more cheese than provolone\nAnd the chrome is home, so I'm never home alone\nAnd only keep friends with two X chromosomes\nSo I command all these rappers, put the mic down\nThrow a grenade in your mouth, nigga bite down!\nBecause I'm back with Premo on the track\nTakin it to the essence, showin niggas how to rap\n\n[Hook: Ludacris w/ DJ Premier scratches]\n\"Here I am\"\n\"I'm the man\" \"Word!\"\n'DTP's about that bomb shit!\"\n\"LUDA!\"\n\n[Verse 2]\nStill hungry as the day I began, I heat the booth up so much\nThe engineer caught a muthafuckin tan\nI'm the truth when it comes to it (true!)\nI hold hip-hop for hostage, since 2000, I put a gun to it\nAnd I run through it, like a Jamaican Bolt\nAnd everyday's a vacation on Jamaican smoke\nCloud your whole block, talk shit and hear the fo' pop\nOne, two and it don't stop\nAnd my delivery's invadin your vicinity\nHennessey is my remedy, taking shots like Kennedy\nAnd I been a G for a long time\nTo these streets, I'm connected like I'm online\nOn time for whatever\nAnd every time an album drop, I drop BIG like Voletta\nI'm ahead of the competition, they wishin that I just fade off\nMy career for your life, let's trade off\n\n[Hook: Ludacris w/ DJ Premier scratches]\n\"Here I am\"\n\"I'm the man\" \"Word!\"\n'DTP's about that bomb shit!\"\n\"LUDA!\"\n\n[Verse 3]\nEight years in the game, ain't a damn thang changed\nSo I brought it back to one of the tracks\nOf where the damn thang came\nAnd he goin down in history, cause he don't sleep\nAnd he the first southern rapper on a Premo beat\nI ate the kick and the snare, the samples always taste fine\nAnd I shoot a hot 16 from the baseline\nI'm on point like CP3\nAnd I'll be goin down in rap as the MVP\n\n[Hook: Ludacris w/ DJ Premier scratches]\n\"Here I am\"\n\"I'm the man\" \"Word!\"\n'DTP's about that bomb shit!\"\n\"LUDA!\"", "image": "https://images.genius.com/abff9ac1df466053c5fe1b6b3c92056f.1000x1000x1.jpg"}], "artist": "Ludacris"}