{"songs": [{"title": "I Got Your Back", "album": null, "year": null, "lyrics": "Aye Shawty I Know You Be Hearin This\nAnd That From Here And There\nBut Please Trust And Believe\nLil' Mama I See You Gone\nRide For Me So imma Die For You\nIs You Wit Me?(Well Let's Get It)\n[Keri Hilson:]\nI got your back boy\n\n[Chorus: Keri Hilson & T.I.]\nWhen were high(T.I.:From when its all good)\nWhen were low(T.I.:To when its all bad)\nBoy I promise I will never let you go\nSaid I got I got I got I got yo' back boy\n(Now What you call dat)\nI got I got I got I got yo' back boy\n(I know you got my back right)\nKeep my swagger\nKeep it looking good for ya\nKeep it looking hood for ya\nShawty if you don't know\nI got I got I got I got your back boy\nI got I got I got I got your back boy\n\n[T.I. Verse 1]\nHey it's whatever shawty\nYou ain't gotta ask\nYes, Valentino blouses, summer houses, cash, check!\nYou can get it you deserve it, flawless diamonds, Louie purses\nMy mission's to purchase Earth for her\nPresent the gifts without the curse\nHer pleasure is my purpose\nPleasure to be at your service\nWe front row at fashion shows\nAs well as Sunday morning service\nBut better days or for worse\nIf I'm paid or I'm hurting in my pocket\nShe still got a nigga back, know that's for sure\nNo matter what may occur in life\nEveryday with her is like a plus\nI'mma love her til she be like that's enough\nPop a bottle get a couple wine glasses fill em up and lift em up\nLet us toast to the future here's to us\nNo, here's to her\n\n[Keri Hilson - Bridge]\nThey wonder how we do what we do\nPanamera Porsches me and you\nStuck to your side like like like glue\nBe by your side whatever your gonna do\n\n[Chorus]\n\n[T.I. Verse 2]\nThis is for the women who man caught a sentence\nWho gon be there for a minute but they didn't keep their distance\nThey stayed home waiting on the phone\nAnd on visit day show up looking good smelling better, playing kissy face\nJust wanna let you know we appreciate(I appreciate you baby)\nEverything you do for us on a day to day\nAnd I know we don't show you all the time but we lucky that you ours\nNo bouquet of flowers could ever show how much we know we need you\nWe do all that's in our power just to please you\nSee boo, fuck them girls, I would leave the World 'fore I leave you\nMay God say even Eve and Adam ain't got shit on these two\n\n[Bridge]\n\n[Chorus]\n\n[T.I. Verse 3]\nSure enough\nEven though them chicks be hating on us\nStill I'm gonna keep her by my side\nIn whatever situation we gon ride\nMake all my fantasies come alive\nThat's no lie now\nIll be, alright just as long as you beside me\n10 million dollar mansions won't suffice\nIf you ain't gon be in there with me at night\nThe pieces to the puzzles in my life\nWith all of my good days and all of my bad\nYou stood by your man(stood by my man) and you know you got my back\nWorth every car, every bag, with me they wanna be that\nI know what I got at home\nI ain't gon never leave that\nThem bitches best believe that", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}