{"songs": [{"title": "Hit the Ground Running", "album": "N9NA", "year": "2018-11-02", "lyrics": "[Intro: Tech N9ne]\nAll of us should go, a nigga knock, who's wit' it?\nThey will never know or never stop who did it\n'Cause we all speed 'em up\nAin't no catchin' up with us at all when we cut\nEverybody know the way I rip it sound stunnin'\nNobody stoppin' us when we hit the ground runnin'\nCome on\n\n[Verse 1: Tech N9ne &  JL]\nFeedin' you N9na ever since the money was allocated\nFrom T.O.G. and every time I drop people salivated\nVenomous vernacular is very vicious and validated\nBy many people but to the fuckin' foolish my style is hated\nAin't that a panini that's mad at a weenie\nThe stabbin' and jabbin' rappin', cappin' as bad as cabrini?\nI'm one of the critical ones\nFiendin' for fire foul and formidable from pitiful slums\nBut I got up and served these suckas my syllables some\nRoadrunna, this MO gunna's a flow stunna\nWhen he get chose by the hoes, none of the clothes on her\nLovin' the soul of a rogue and they want the dough from a\nPlatinum and gold negro under one O's number\nI'm hand pickin' 'em, clarity and the quick in 'em\nStick with the fam', thicker than rarity, never different than\nA chariot with it flickerin', flame I hold like Olympian\nBut the kicker been, I really can't tell if anyone's even listenin'\n\n[Chorus: King Iso]\nI'm not human, Earth is too dense\nLove is useless\n(I don't really wanna be a part of this system, no nothing\nManifest a better place for me, this one malfunctioned)\nOne, run, two, bitch\n(Taking off into the universe, I got out, then I found somethin'\nThrow another fuckin' planet toward 'em\n'Bout to hit the ground running like)\n\n[Verse 2: JL & King Iso]\nTell me I ain't got it, you fakin', lyin', hallucinatin'\nYou get a vibe but do hide your feelings, you tryin' to escape 'em\nTo the rudimentary, it's too Da Vinci for you to take in\nHopin' that if I do fall, eventually parachute gon' cave in (Woo)\nFoolish envy, with whom am I miscommunicatin'? (Uh)\nClaimin' like I ain't one of the illest, you get a rude awakenin'\nSeen this side of me  and then sat in silence recuperatin'\nIf you looking to do some hatin', figure no use in waitin'\nI'm bored, important spoils of my sport\nCyborg at war winnin', willin' to die for it\nOn my Thor shit, floor spins, spin in a time warp\nMy portion short, then I kill and fill my fork (Hell yeah)\nTable-tippin', the energy got the cable glitchin'\nEnter the Matrix, when I'm blazing, bitch I be Agent Smith\nAnd shit go shiftin' back and forth over, it ain't no game of tennis\nTakin' human form when I'm morphin', homie like wait a minute\n\n[Chorus: King Iso]\nI'm not human, Earth is too dense\nLove is useless\n(I don't really wanna be a part of this system, no nothing\nManifest a better place for me, this one malfunctioned)\nOne, run, two, bitch\n(Taking off into the universe, I got out, then I found somethin'\nThrow another fuckin' planet toward 'em\n'Bout to hit the ground running like)\n\n[Verse 3: King Iso]\nRunnin' like Naruto and needin' N9na to throw batons\nBaton like Rouge and kill everything like Rittz while foes are on\nSee you people are slowin' on, we be speedin' like motocross\nPlease believe it like Ripley\nI'm gunnin' like when you quote it wrong\nRockin' o's like I'm Jovi Bon\nGot the force, call me Solo Han\nI'm the war to you whores, I'm the dinosaur steppin' on your lawn\nAnybody wanna try to keep up with the killer\nI don't even want him gone\nSick enough to go toe to toe with a crook, someone calling ya\n\"And that nigga's from Omaha?\"\nTold you all that Iso's a god, bitch, it is like I switched dimensions\nAnd photo bombed Kotal Kahn\nHoly moly, what's goin' on?\nWith a bat leave 'em Mortal Kom'\nOpen portals when I flow and producers call me Polow da Don\nTech finna soundin' effortless, rhymin' better than most of y'all\nYou're like designer, yes, I be flyer even when clothes are off\nWho do I catch now?\nGotta catch 'em all like a Pokeball\nBetter follow the protocol, listen homie I told you all that\n\n[Chorus: King Iso]\nI'm not human, Earth is too dense\nLove is useless\n(I don't really wanna be a part of this system, no nothing\nManifest a better place for me, this one malfunctioned)\nOne, run, two, bitch\n(Taking off into the universe, I got out, then I found somethin'\nThrow another fuckin' planet toward 'em\n'Bout to hit the ground running like)\n\n[Outro: Tech N9ne]\nTech N9ne\nJL\nKing ISO\nKiller shit\nWe hoped you enjoyed\nSidenote, there's nobody else fucking with us", "image": "https://images.genius.com/3fbd16f0636d88b64458a85ac130b7bc.500x500x1.jpg"}], "artist": "Tech N9ne"}