{"songs": [{"title": "Rich Niggaz", "album": "Born Sinner (Deluxe Version)", "year": "2013-06-18", "lyrics": "[Intro]\nAyo, ayo, ayo, ah, ayo, ah\nAyo, ayo, ayo, ah\nYeah\n\n[Verse 1]\nI hate rich niggas, god damn it\n'Cause I ain't never had a lot, damn it\nWho you had to kill? Who you had to rob?\nWho you had to fuck just to make it to the top, damn it?\nOr maybe that's daddy money, escalator, no ladder money\nEscalade, new Caddy money\nWorst fear going broke cause I'm bad with money\nCrooked smile nigga, momma never had the money, damn\nI ain't tripping\nNigga Jordan; I ain't Pippen, yeah\nUp the steps, I ain't slipping\nTears, blood, sweat, and I ain't cripping\nHere's a song you can sing along with\nWhen you down on some let you know you ain't alone shit\nWhen your momma ain't at home cause she got a second job\nDelivering pizzas, you think she out here getting robbed\nPlease God watch her I know how niggas do\nHalf cracker but a nigga too\nTalking all that shit 'bout your step-pops\nHow he was a dog, now look at you\nI ain't bad as that nigga, plus dawg, I'm a grown man now\nI ain't mad at that nigga\nBut if a plane crashed and it only killed his lame ass\nI'd be glad it's that nigga, nigga\nDid Kay dirty now it's back to broke\nRefund checks, used that to float\nMomma gets depressed, falls in love with the next maniac\nOn crack, use that to cope\nMake a nigga smoke a whole sack of dope\nWriting rhymes, tryna bring back the hope\nTry to ride the storm out and crashed the boat\nCould've drowned, but I grabbed the rope\n\n[Pre-Hook]\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\n\n[Hook]\nSing, you got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\nYou got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\n\n[Verse 2]\nI hate rich niggas, god damn it\n'Cause I ain't never had a lot, damn it\nNiggas can't front on the flows you got\nBut every fucking verse how much dough you got\nHomie, don't quit now\nHear my shit and tried to switch now\nKnow you felt the shit just now, know you felt the shit just now\nAin't there more to you? Don't it ever get boring to you?\nI realize deep down you a coward getting high off of power, fuck it more to you\nSaw through you and it made me ashamed that I played the game\nNot for mo' money like Damon Wayans\nWanted the respect but it came with fame\nI just wanted love but this ain't the same\nI took a train down memory lane\nAnd watched little Jermaine do his thing before he made a name\nIt's like Sony signed Basquiat\nHe gave it all he got, and now a nigga don't paint the same, damn\nI guess he can't complain\nAll the money that be raining in\nSpend a hundred thou for the chain again\nThink of old school niggas like Dana Dane\nProbably kill for another claim to fame, my brain the same\nYeah, nigga, at least he ain't insane\nAt least he ain't insane\nYou ain't crazy, motherfucker, you just afraid of change\nThat's new, maybe that's true\nBut listen here I got a bigger fear\nOf one day that I become you\nWhen I become lost and I become heartless\nAnd numb from all the Ménages\nJust one bitch don't feel the same no more\nAnd Henny don't really kill the pain no more\nNow I'm Cobain with a shotgun aimed at my brain\nCause I can't maintain no more\nTad bit extreme I know\nMoney can't save your soul\nBut there go you\n\n[Pre-Hook]\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\nAnd there go you, and there go you, and there go you\nSelling me dreams and telling me things you knew\n\n[Hook]\nSing, you got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\nYou got what I want, I got what you need\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"\n\n[Outro]\n\"How much for your soul, Anna?\"\n\"How much for your soul, Anna?\"", "image": "https://images.genius.com/fbfa7c8b3518f456c489c0bc1cf3ffd5.1000x1000x1.jpg"}], "artist": "J. Cole"}