{"songs": [{"title": "Hunger", "album": "Boiling Point: K.O.D. Collection", "year": "2012-10-30", "lyrics": "[Intro: Tech N9ne]\nI might just explode, my mind in sick mode and I can't control my..\n...ym esopxe tsuj I dna sworg tihs fo sdnik (llA)\n\n[Verse 1: Tech N9ne]\nWhat you wanna do? What you looking for?\nWanna start some shit? Boy, here we go\nWe can do it, on the double\n‘Cause I’ve been itching, for some trouble\nYou gon' get a beat down, ‘cause I got a lot of pain\nYou don’t want me to clown, ‘cause I’m feeling insane\nAnd I ain’t gonna stop, I ain’t got no brain\nI'mma hit you hard, I don’t feel ashamed\nI don’t care about shit, but I gotta get dough\nAnd I might just click, put your ass on the floor\n‘Cause you a bitch, you a fraud!\nI don’t like you, you a broad!\nI don’t got success, I don’t got no luck!\nBut I got my stress, so I need your blood!\nI can taste it, on my tongue!\nMy life is wasted, my anger’s from!\nMy (Hunger)\n\n[Hook: Tech N9ne]\nI might just explode, my mind in sick mode\nAnd I can’t control my (hunger)\nIn my wicked soul all kinds of shit grows\nAnd I just exposed my (hunger)\n\n[Verse 2: Bishop]\nThey don’t understand me, probably why they fear me\nMama said to slow down, the drugs is gonna kill me\nIn the world all alone,Can somebody hear me?\nPlease don’t knock me out of my zone\nI ease my mind when I like to steal it\nIn the mind of a psycho, middle of the night with a rifle\nPut my right hand on the Bible, I will slice you up like Michael\nMic shall pass with the knife yo, I go get, this is so crazy\nHomicide the Earth 'til the murder on the rifles\nFinna act out when I black out, Jay-Z\nGotta feed my hunger, Mr. Ouiji\nAwake me from my slumber, the gates open up and release me\nDrawn like a cartoon, niggas get to running\nWhen I’m on tectonics tell the hunter to the hunting\nSharper than the harpoon, running in the short full\nSitting in the dark room, chewing on a stomach\nKill ‘em all, kill ‘em all, quick, jigsaw bitch in Saw type 6\nDigit all up, zip it all up, rip it all up\nAnd stuff pieces then I feed it to my pigs\nThis nigga’s really sick, ain’t really with the shit\nShe know that I’m a demon, sucking semen on my dick\nSmoking on the sticky, got me drifting off a bit\nBurn like ether cause my niggas keep it lit\n\n[Hook: Tech N9ne] (x2)\n\n[Verse 3: Brotha Lynch Hung]\nAnd if he don’t like you, then I don’t like you\nMight get a bit Ripgut, see, I'm not like you\nShit, I might Tec-9 you, that’s how they find you\nIn a bathroom all chocked up, I'mma get meat when it’s time to\nAnd I got this problem, meet me, just call it\nAll you gotta do is say it, and I’m right behind you\nAnd I like that raw shit, bloody up that hard shit\nSee, I got that, I don’t give a fuck about shit and alcoholism\nI spit that cocaine, might be off the cocaine\nMaking my cigarette in propane, shit, this is no game\nMy trust is fucked up, so I might get fucked up\nAin't got nobody that got my back, so I just suck it up\nI was raised, you fucking joke, you might get tucked up\nBring the body over here, that meat is uncut!\nI can taste it, on my tongue!\nMy life is wasted, my anger’s from!\nFucking with my (Hunger)\n\n[Hook: Tech N9ne] (x2)", "image": "https://images.genius.com/b49e837c9c7732be929537953b47ac6e.700x700x1.jpg"}], "artist": "Tech N9ne"}