{"songs": [{"title": "The Curse of Money", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17", "lyrics": "[Intro - Sleep]\nHey wassup Cube?\nMan I'm glad I caught you at your momma' house homey\nWassup man? You still got your pager right or you lost it?\n(It's the curse, the curse....the curse, the curse)\nY'know my code right? I been pagin you for about a week man\n(The curse, the curse) I heard about the deal ya got\nGreed, Khop (The curse, the curse)\nCheck this out, you owe a nigga somethin man\n\n[Ice Cube]\nDo the math baby, do the math (Ch-ching)\nDo the math baby, do the math (Ch-ching)\nDo the math baby (The curse, the curse)\nDo the math baby (The curse, the curse)\n\nIt's the curse of money, once you get it, fool you got it\nBuy a new pair of drawers and motherfuckers spot it\nNiggas plotted, to have me knotted up in basements\nTill these cocksuckers see what they're faced with\nTheir fantasies of a life stress-free\nFull of orgies, in the Florida Keys\nBut this bullshit is so thick, it's like mountains\nSick of threatenin all my lawyers and accountants\nThe decibals, gold diggers goin for the testicles\nSoon they realise, I don't invest in hoes\nSometimes it's like hell on earth\nWhen everybody tryin to get your ass for all your worth\nIt's the curse\n\n(The curse, the curse) Do the math baby\n(The curse, the curse) Do the math baby\n(The curse, the curse) Do the math baby\n(The curse, the curse) Do the math\n\nWhen you hot, they think you got more than you got\nWhen you not, motherfuckers callin you a flop\nI just laugh, the curse everybody wanna have\nBefore you sell your soul better do the math\n\nI start to scream shit like \"May day, may day\"\nCos motherfuckers think it's all grav-ay wit my pay day\nAnd like I said, it's the curse of money\nThey start laughin at your jokes when they ain't that funny (Ha ha ha)\nSee this ass kissin yes man\nShakin hands with the left hand, get my weap-an, get to stepp-an\nFuck every phony ass nigga round me\nStick a shaft up your ass like Richie Roundtree (Yea yea!)\nGot to have some gas money if you goin\nIf not who you fuckin? Who you flowin? Who you owin?\nIn '98 don't shit come free\nNot even hard rhymes that's describin these hard times\n\n(The curse, the curse) Do the math baby, do it\n(The curse, the curse) Do the math baby, aha\n(The curse, the curse) Do the math baby\n(The curse, the curse) Do the math, ooh wee\n\nWhen you hot, they think you got more than you got\nWhen you not, motherfuckers callin you a flop\nI just laugh (haha), the curse everybody wanna have\nBefore you sell your soul better do the math\n\n[Mack 10]\nTo relax I smoke a stick, the shit make me sick\nGotta gang of new homies, and relatives on my dick\nNo time for drama, busters get sprayed\nBitches wanna get layed, and everybody need their bills paid (Everybody)\nMotherfuckers, sweat me like a spy\nThey wanna kick it cos I, got the curse of mulah\nMake me wanna start scrappin and look at me to make it happen\nWhat the fuck was they doin before Mack 10 was rappin ?!? Tell me\n(What the fuck?) how can I remain a man of seven figures\nWhen I'm rushed by gold diggers everytime I get bigger? (Ch-ching)\nLike David Banner, when I tweak I turn green\nAnd everytime I'm seen it's like people start to fiend\nIt's the curse\n\n[Ice Cube]\n(The curse, the curse) Do the math baby [aha]\n(The curse, the curse) Do the math baby [1 million, 2 million]\n(The curse, the curse) Do the math baby [3 million]\n(The curse, the curse) Do the math\n\nWhen you hot, they think you got more than you got\n[Yeah they do]\nWhen you not, motherfuckers callin you a flop [Motherfuckers]\nI just laugh, the curse everybody wanna have\nBefore you sell your soul better do the math [Better do it]\n\n(The curse, the curse) Do the math baby\n[Get the fuck outta here]\n(The curse, the curse) Do the math baby\n[With dollar signs in your eyes]\n(The curse, the curse) Do the math baby [Ha ha, sheeit]\n(The curse, the curse) Do the math\n\n[Outro - Ice Cube]\nLeave your ass broke\nRabbit ears, nigga for pockets, haha he\nI'm cursed! Hahaha, but I love it", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg"}], "artist": "Ice Cube"}