{"songs": [{"title": "Who Got Bodied?! (Mistah F.A.B. Diss)", "album": "The Bar Exam 2.5 ", "year": "2007-11-05", "lyrics": "[Verse One]\nNow I done told this nigga to shut his mouth\nI guess he wasn't hearin' me\nI'm beyond this peon, he's scared of me\nApparently he don't see that he don't compare to me\nCause he ain't remain silent like T.I.'s security\nIt's clear to me he'll fuck up his own cash\nNow take your little freestyle and shove it up your ass\nFollowed by the \"oohs\" and \"aahs\"\nYour foolish pride done fucked around\nAnd put you on the losing side, who got bodied?\nNigga, you sick? Then I'm a hot toddy\nCoke flow, I spit so much Whitney I got Bobby\nI'm a sound off, this nigga's a clown y'all\nFifty niggas with him wearin' jheri curls, hoppin' out of clown cars\nShows over Bozo, no mo', I'm back\nTime to face the music, I'mma just straight up abuse him\nHe choose to diss, but he don't know what he gettin'\nWhile he's spittin' funny shit, I'm gettin' money bitch\nC'mon I'm a product of my environment\nHe ain't gotta try to bring Malcolm out of retirement\nHe go at me I hit him ASAP, take that\nGet shot up like a cap gun at a race track\nHe's probably from the part of the Bay where the gay's at\nWhere the fags migrate and give each other AIDS at\nThey told me that you ain't the pistol type\nSo yo, you know to me that means you a Frisco dyke\nGet you a whoopin' like Whoopie\nYou steppin' in another circle\nI wear Purple Label you just wear The Color Purple\nEverything about your lame flow represents everything ho\nAnd every color in the rainbow\nSayin' Proof's name will get you strangled\nLet my nigga rest or I bet you gon' be sleepin' with the angels\nI'm fly, you a fly, since you lie, you die, goodbye\n\n[Hook]\nZip 'em up\nZip 'em up\nZip 'em up\nZip 'em up\n\n[Verse 2]\nC'mon, you showed you ain't got respect soon\nAs you diss me so sudden\nSo when you bow it better look like you toe touchin'\nI'm so fuckin' ridiculous with the flow cousin\nI pack heat and I will give you the whole oven\nCoke, heroin, flower, fuck it the whole cupboard\nNo publishin' for this fuck it, I'm so stubborn\nI threw the bait, you took it, I'm on the boat buzzin'\nReelin' you in, tryin' to eat you before Joe Budden\n\n[Verse 3]\nBudden said the battle was embarrassin'\nComparison, this shit here more embarrassin'\nSo I'mma use his beat to murk you\nAnd maybe he'll see that I'll murk him too\nI'm just playin' my nigga Buddens, you cool\nI'm just fuckin' with you cause I got \"Nothin To Do\"\nThis Mistah Fag, he's a waste of my time\nAnd my time is money so I'm wastin' money just makin' this rhyme\nIt ain't beef but I would like to shoot your jeweler\nYour charm look like some kind of retarded school bus\nAll you missin' is the \"duh\" and the drool\nThe wheelchair, the helmet and the confused look\nNiggas get shook when Malcolm speaks\nThere ain't no way I can hear you on an Alchemist beat\nY'all two doin' an album together, ooh shit\nOkay, I got a sample for you, loop this:\n\n[Interlude]\nStep right up! Step right up\nLet me guess your weight\nI just flew in from San Francisco and boy are my arms tired!\nStep right up and watch me shoot through birds out of my sleeve\nI'm so fuckin' funny\nLet's take it to the Bay baby\n\n[Under Interlude (Background)]\nMistah F.A.B. I'm funny\nI'm a clown, with no money\nEvery Monday, I get a haircut\nTo wear a t-shirt and jeans with airbrush\nI'm corny, I'm corny\nThere goes the real Fab, he came before me\nIt's not corny, he's still here too\nBut I don't care cause, I'm so funny\n\n[Verse 4]\nThe streets will teach you\nI love for The Bay nigga, Skee my people\nThe problem is, you think you lyrically my equal\nBut that don't balance out I gotta Keak the Sneak you\nYou be the bitch, nigga we be the shit\nYou never slang like 40, you tryin' to be B-Legit\nI will eat your soul\nMy piece's cold cause they freeze\nBut these hoes is Keyshia Cole, I'll put you in the hospital\nYou ain't the only one that got riddles, I got two\nCheck it, one: Flabby, Fabby, fuck you\nFucked yo mammy, we family cause I'm yo daddy, son\nTwo: Yeah, pussy thought you took me\nWant a cookie? Cause nobody seems to care\nSo what's the fuss 'bout\nTurn your girl's mouth to a Yukmouth\nNut, turn her out to a slut house, who got bodied?\n\n[Sample]\n\"Trick hates your guts and Proof ain't never like you\"\n\"I fuck with real Detroit niggas like Trick Trick and Chedda Boys\"\nAsk about me\n\n[Verse 5]\nI got A.K.s, A.R.s, aye y'all\nThis nigga been dead since the 8th bar\nBut I'm tryin' to overkill him\nStandin' over the silly nigga holdin' a shotty\nWith the spirit shootin' at him 'til his body disappears\nLookey here, I will put your crew in boxes\nI done put whole crew in boxes\nAnd it best he stops cause I will Freddie Foxxx him\nPut him out with the tools or boxing\nSo think about your next move, I will let you choose your option\nTop ten, dead or alive, and I got soldiers\nYou cast your little punk ass stones at me, I throw back boulders!\nOh yeah, it's over, hold that\nNigga this is G's up, I speed up right where you slow at\nLyrically you Borat, boring, do anything for a laugh\nYou know that's... annoying\nIt's sounds that perhaps you doubt me\nWell if you ever ever make it to my city, ask about me\nYour luck's over 'cause all you tried to do is be famous\nSo now you famous nationwide for gettin' fucked over\nBoy pay up, I ball, this a fo' sho' lay up\nI'm playin' Chess with a Connect Four player!\n\n[Hook]\nIt's obvious I hear you talkin' loud\nI'm clappin' all day like I'm cheerin' in the crowd\nI'm bout to catch a body, I'ma bust a mag boy\nI'm bout to catch a body, I'ma bust a mag boy\nI'll kill ya'! If you ain't never ran from a nigga\nThen you damn sure should probably pick a day to start runnin'\nGet runnin'! If you ain't never ran from a nigga\nThen you damn sure should probably pick a day to start runnin'\nGet runnin'!\n\n[Outro: Chedda Boy & Trick Trick dissing Mistah F.A.B.]", "image": "https://images.genius.com/989ea46d257edaed6a8d8a37abc11399.630x630x1.jpg"}], "artist": "Royce da 5'9'’"}