{"songs": [{"title": "Eww", "album": null, "year": "2014-04-20", "lyrics": "[Hook: Young Thug]\nEww eww eww\nEww eww eww, eww\n\n[Verse 1: Young Thug]\nWhat you gonna do when I pull up on you, nigga?\n(I don't know, I don't know, I don't know)\nPussy nigga know that he a cat like Tigger\n(For sure, for sure)\nBeat the pussy nigga with the baseball bat\nPull up with them F&Ns comin' out the hatch\nPussy mothafucka scared to say it to my front\nSo I'm blowin' out his back\nPoint it at his liver, make the nigga reconsider\nBands in my pants got me lookin' a little bigger\nRed just like Elmo but I never fuckin' giggle\nYou can suck my pickle for a nickel\n\n[Hook: Young Thug]\nEww eww eww\nEww eww eww, eww\n\n[Verse 2: Young Thug]\nHow many niggas standin' around you would die for you?\nI’m not bein' funny but if I come through there sprayin'\nAll them niggas turn to 4 wheelers\nHonestly, truth be told, YSL won't fold\nPick his ass off from the balcony\nWalk into the house and change clothes\nYSL, wipe a nigga nose\nWe don't give a damn if it's indoors or outdoors\nWe gotta have that, gon' grab that\nNigga go stab that, smack that shit\nEvery day I keep the bands on me, I'm a lick\nIf a nigga think I'm sweet then his tongue gettin' split\nI ain't doin' any features unless you give me your bitch\nI'ma fuck for the cash then she gettin' robbed by Tick\n\n[Hook: Young Thug]\nEww eww eww\nEww eww eww, eww\n\n[Verse 3: Young Thug]\nHundred bands inside of my pants\nMake the mothafucka dance on the stage\nAye, bitch, it's a parade\nPourin' 4s is a sport, Leanorade\n50 whole k spent on my hygiene\nDrinkin' so much lean that my pee clean\n808 just might be the dream team\nBitch got some good brain, call her Pinky\nBag full of weed, no lighter\nIn the kitchen wrappin', rappin' like a cypher\nYou know damn well, I like her, I'mma bite her\nIn a Bentley on West Lee gettin' trailed by sniper\nHow the fuck you feel that I don't mean nothin'?\nAll them years in the bando, no clean nothin'\nRunnin' to the cops, tell 'em I don't serve the fiend nothin'\nPullin' off like \"SIKE!\"\nBitch I got the bando, fifty hundreds\nSpot 'round the corner filled up with onions\nBig homie got a whole truckload\nMe and Scooter take a trip to New Mexico\nAll I ever wanted was the money\nAll I ever wanted was the money\nPut your hands in the air if you dare\nAny motherfucker to step over here\nF&N put 'em in a wheel chair\n\n[Hook: Young Thug]\nEww eww eww\nEww eww eww, eww", "image": "https://images.rapgenius.com/a9f25bb86135332e669a64296afed402.600x600x1.png"}], "artist": "Young Thug"}