{"songs": [{"title": "Mean Muggin", "album": "California Republic", "year": "2012-04-05", "lyrics": "[Verse 1: Game]\nWalk up in the club with the million dollar airs on\nSwinging side to side, like my hair long\nFeeling like Tunechi in this motherfucker\nEyes Japanese, blowing sushi in this motherfucker\nNo true religions, just levi's, come on down to this bee hive\nYour bitch love to play soft ball, I let her barrow them knee highs\nShe ride the dick like yee-haw, she don't fuck with no cowboys\nI beat it up like I'm He-Man, she love fuckin' them G men\nAnd after I score I do the salsa in the...\nVictor Cruz in that Phantom, drop the antenna\nI think I see some haters in here, I think I see some haters in here\nCock the ratchet\n\n[Hook: Game]\n(Dawg) Cause them niggas still mean muggin'\nNigga what you lookin' at?\n(Dawg) You nigga still mean muggin'\nWhat you lookin' at?\n(Dawg) You nigga still mean muggin'\nBitch, whatcha lookin' at?\n(Dawg) You nigga still mean muggin'\nMan, that shit don't even mean nothin'\n\n[Verse 2: 2 Chainz]\nYea, they mean muggin', the 3D version\nUgh in your face like Pee Wee Herman\nJack of all trades, no ace of spades\nBut I got a ace in my twenty ounces Gatorade\nShake, shake, shake it then pour it\nI had me a threesome, round four something\nHasta la vista, wrist on freezer\nAutomatic weapon, chopper had a seizure\nFire, snap back through your snap back\nRan out of room in my trunk so I need a hatch back\nHow you niggas leaking, hope you niggas listenin'\nBig money talk, why you niggas whisperin'\n\n[Hook]\n\n[Verse 3: French Montana]\nRoll up in the club like I own this motherfucka'\nOld niggas kicking jewels I'm like pawn up in this motherfucka'\nHoes wipe me down, Little Boosie in this motherfucka'\nRolling that La la, Fugees in this motherfucka'\nI said Lala Carmelo, in this motherfucka'\nShorty wanna puff, J Lo in this motherfucka'\nHigh rollers bank stop, tattoos, tank tops\nBad news, thanks pop, you man food, lamb chops\nYou know I run my city, please believe that\nGot that work, put them canines on rehab\nNiggas wrinkle up their face, we gon' iron that\nGet Rob Cole game, he gon' let you buy a bag\n\n[Hook]", "image": "https://images.genius.com/e6b76fdc2635fdc0e9d62ceb9907eb3c.750x750x1.jpg"}], "artist": "The Game"}