{"songs": [{"title": "Back in the Air", "album": "A Son Unique", "year": null, "lyrics": "[Verse 1: Ol' Dirty Bastard]\nWe used to sleep in the staircase, smoke weed in the staircase\nFriday night got drunk, used to pee in the staircase\nHopin' a cop might slip, I'm never known to drop the clip\nYou copped the Fifth, nigga, I'll pop the fifth\nI show no mercy, dunk like a bar of Hershey\nCall my gun, Lil' Seymour, bitch, or Big Percy\nA Dapper Dan fan, who will clap a man\nFor five grand of small bills, wrapped in a rubberband\nThen lay up in a fat pair of titties, my bitch is so saditty\nThis is Dirt McGirt, ho, not P. Diddy\nAll we got in common is the money, the only thing I want is the money\nYou see my face on the wall of every precinct\nBitches keep your pussy decent, I'm juvenile delinquent\nFor guns that I creep with, they whisper, in secret\nOnly bitch that peepin', is the one that I sleep with, nih-huh!\n\n[Hook: Ol' Dirty Bastard]\nAlotta niggas wanna dust me off\nBad bitches wanna suck me off\nRockafella dropped a million here\nAnd Dirt McGirt back in the air\nAll my gangstas, where ya at?\nThrow your guns up and make them clap\nTell me now, muthafuckas, you strapped?\nAnd bitch betta have my money\n\n[Verse 2: Ghostface Killah]\nAiyo, the bitch better have your money and mine\nCuz if she don't, we both gon' double team that bitch from behind\nAnd for them niggas outside screamin' that\n'Somebody gotta die' shit, same dudes on the cop's dick\nThis is Tone, y'all niggas be frontin'\nAnd most of y'all niggas don't got no guns\nBorrowed your man's shit, how's that for a bum?\nDum-dums emptied out of pun son, so see man, see Ach' run\nSee spots over my Reebok's, cuz he got done\nCheap shots fell out his weak Glock and he got stung\nMy cheap gun is a gangsta's protein\nTreat bitches with the utmost respect, like get 'em wetted\nTellin' to, drink the milk, boo, don't even wet it\nThis is Starky, I got a foot fetish, loot fetish\nWith the dust-head men, we got good credit\n\n[Hook]\n\n[Verse 3: Ol' Dirty Bastard]\nNotorious Glock buster, cap peelin', block hustler\nWho slap hoes, who lack feelings\nBlack building, crack dealing, black villain\nHad a taste for blood spillin', love stealin'\nAny thing that twinkle bright to my eye sight\nMany nights I used to stay up, at the twilight\nAnd wonder to myself, if's there's a Heaven or Hell\nBeen alone in these streets, since eleven or twelve\nOn my own, I run buckwild in the West\nA knucklehead nigga, used to sleep in my vest\nHad no home, my Moms used to show me no lovin'\nBurn the crib down, try'nna dry my shirt with the oven\nNow I'm exiled, destined for penal\nHyperactive off the cocaine, got me senile\nBack on the block, knowledge to build, knowledge to kill\nIntent to put a dent in your grill with the steel\n\n[Hook]", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}