{"songs": [{"title": "Piffsburg", "album": null, "year": null, "lyrics": "I wanna get blunted, my brother!\nTick-tock motherfuckers!\nGreetings!\nI wanna get blunted my brother!\n\n[Hook]\nSome days I be feelin' like I am the shit\nWearin' clothes right out the package lookin' how nice they fit\nAnd I swear I’mma be the fuckin' dopest\nAs long as I could stay up on my grind\nI'mma always know where my home is\nI’ve got a Piffsburgh state of mind!\n\n[Verse 1: Mac Miller]\nHey yo I’m comin' to, comin' to, comin' to, comin' to\nComin' around again, runnin', runnin' around with them\nMe and a thousand of my friends\nGettin' lifted, dazed and confused, controllin' this stick shift\nI’ve been workin' hard baby, feelin' like it's my sixth shift\nDealin' with different situations, gettin' a bit of congratulations\nSick with the rhymes, splittin' your minds, feelin' the good vibrations!\nExcitement, you see these different places I’m invited\nWhile you’re writin', it's in the people’s ears, they callin' you Tyson\nThe nicest, you’ve seen in awhile\nBelieve it, the people the reason I'm out\nThey throwin' me love, and open me up\nThat’s why I see em' and greet em' with smiles\nShorty be lettin' me into her house\nPickin' her up and kickin' her down\nThey passin' me weed, relaxin' with me\nThey heard that the kid was the chillest around\nSomewhere in Piffsburgh, kickin' it back watchin' the Steelers\nPut your Reggie Bush away, we got some real herb\nShorty a , so nah I don't feel her\nCause I’m just on to the next, don’t get your feelings hurt\n\n[Hook]\nSome days I be feelin' like I am the shit\nWearin' clothes right out the package lookin' how nice they fit\nAnd I swear I’mma be the fuckin' dopest\nAs long as I could stay up on my grind\nI'mma always know where my home is\nI’ve got a Piffsburgh state of mind!\n\n[Verse 2: Mac Miller]\nHey, a different city every day, the same youngin' though\nHoes from the bungalows who wanna drop and touch their toes\nLookin' for some money, we ain’t gonna give em nothin', no\nIt’s big pimpin' over here , where the fuck you go?\nI be foolin' around, chillin' and passin' the doobie around\nOut on the road, bout to be blowed\nEveryone know I’m a fountain with flow\nUp at the Telly, I'm countin' my dough\nMakin' this money you out with your ho\nGettin' a couple of thousand a show\nSo if you still don't, then act like you know\nNever done heard of a rapper before\nRappers so mad that they’re clappin' like oh!\nThat man Mac on a roll, they jumpin' with joy, see em tappin' they toes\nTold you that no one can spit it like I\nOut gettin' money you sittin' inside\nNever are they ever sick of my rhyme, need to be chiefin' this piff gettin' high\nMaybe I’ma slow it down\nThis shit blowin' your mind, I got the dopest sound\nYou better start rollin' up, the most dope around\nI’m so high, not even close to down!", "image": "https://images.genius.com/3e2d18834859a8eb1435461582b51133.375x375x1.jpg"}], "artist": "Mac Miller"}