{"songs": [{"title": "MTV Cribs", "album": "Unexpected Victory", "year": "2012-01-01", "lyrics": "[Intro: Raekwon]\nLadies and gentlemen, welcome to the most extravagant flashy lifestyle\nOf the wealthy and comfortable. I'ma be your host tonight\nWe gonna be exhibiting the fly palace of my brother Raekwon the Chef's\n19,000 square feet deluxe villa. Let's walk inside\n\n[Verse 1: Raekwon]\nHey yo, Pyrex vision, gangster intermission\nSnow fishing over the stove, frozen glisten\nWall unit 360 spin, see the digital gym\nThere's the watch rack, right near the brims\nRefrigerator see-through, walls got a different type texture\nPeeped out the sectional true\nVodka mugs, Ace of Spade rugs, Louis cups and candles\nFila forks, gold Kangols\nTravel over here, priceless lights\nTub full of ice\nGranddaddy pinecones, leather bikes\nGear junkie, monkey Timbs blunt me\nYeah, kinda sloppy, my maids, they be coming in monthly\nSilk towel, red leathers, green hats, mean sweater, jeans\nYou should let us be your stylist, get you better\nOctagon mirrors, box of sneakers\nLouis, Gucc', Nike, Clark, Avia I bought in Peru\nYeah, plasma toilet, Go Go Gadget stuff\nIf I gotta squeeze, running out of time\nThis automatic button right here blow the house down\nI'm walking slow in my fire jumper\nTom Ford and Bloomberg got too\nPolo drawers, go blast your door\nCover girl sent, tap it in the toilet seat\n\n[Interlude: Raekwon & Busta Rhymes]\nYes, ladies and gentlemen. These are the most exotic illustrious mansions in the world. We will step inside. My nigga Bus-a-Bus next level, tri-dimensional sector of his exclusive imported ceramic style-slash-frontier shit\nMr. Bus\nYo\nCan you walk us through the front, sir?\n\n[Verse 2: Busta Rhymes]\nI welcome y'all to my crib\nThe fortress of I self, lord and master\nCrystal chandeliers looking like satellite dishes from NASA\nYeah, you niggas is bugged\nShoes forbidden in the crib, especially on my Alaskan polar bear rugs\nPictures with billies and parties out in Ibiza\nLiving room floor laced with imported marble from Indonesia\nHigh ceilings, 18th century paintings is basic\nWith litters of money, many casinos in the basement\nA million letter way a nigga parlay\nWith money to wrinkle your face up like a Shar Pei\nLimited box of cigars from diplomats in Cubana\nRare art of Basquiat feeding fruit to Madonna\nCopacabana, I'ma celebrate 'til they respect a\nSuccess story with trucks unloading imperial nectar\nToo many whips, I built a valet\n100,000 dollar drapes\nDancing and swinging like a ballet\nI showed you all enough to where this shit's a hassle\nI'm sorry, your time is up, niggas, now get up out my castle", "image": "https://images.genius.com/13dc7ae0ba0ca43b8df35ea276a05728.1000x1000x1.jpg"}], "artist": "Raekwon"}