{"songs": [{"title": "You Can’t Hold the Torch", "album": "The Big Bang", "year": "2006-06-09", "lyrics": "[Intro: Busta Rhymes]\nYeah\nIt's funny how the game change, right?\nHehe\nShit feel all different\nY'all niggas complainin' left and right about how the game feel all fucked up\nNiggas only been talkin' like that since we been sittin' out the game, I think the game need us, Kamaal\nLet's talk to them niggas\nHuh!\n\n[Verse 1: Q-Tip + Busta Rhymes]\nSo many nights were spent ponderin' (Ha)\nWonderin' how we gon' come again (Hmm)\nMy golden rule is not to focus on the fame game (Uh)\nIn retrospect (Ha), the game ain't the same, mane (The same mane)\nTheir heart and soul is divided (Ooh!)\nThey ramshack the music, no control up inside it\nNow, look at this; it's all stretched out and nasty (Uh huh)\nBut—(What, what?) lettin' money pass me? (Wooh)\nI doubt that, and niggas from the bottom know (Uh huh)\nPumpin' hard, wind, sleet, hail, rain, or snow (Uh huh)\nSo (So), you got to get your gate right (Right)\nNo matter what (Uh), you got to treat your weight right (C'mon, uh huh)\nOn the block if you focused on greed then (What, what?)\nNine out of ten times you be bleedin'\nThe analogy is clear to all of my peers\nI'm a muh'fuckin' vet, don't mean to disrespect, 'cause I—\n\n[Hook: Sample + Q-Tip + Chauncey Black + Busta Rhymes]\n\"I write rhymes, I write checks\"\n(It's clear today)\nBust', ayo, what happened to the—\n(Love—)\nFor the game\n(Love—)\nFor the music\n(I need realness in my life)\nAyo, these niggas in the game don't sound the same\nBust', these niggas in the game don't sound the same\nAyo, what happened?\nThey ain't got it in 'em to make a classic\nAyo, what happened?\nThese niggas can't hold the torch, so why pass it?\n\n[Verse 2: Busta Rhymes]\nAyo, I ain't bringin' they names up (Wooh!)\nThese niggas sound trash, straight foulin' the game up (Ha)\nNeed to change up (Change up), sound so trash (Ooh)\nWhen I see 'em feel like breakin' they frame up (Ha)\nDuPont registry (Ha), talkin' 'bout somebody else cars (Ooh)\nMuh'fuckers better step up your bars (Ha)\nInstead of frontin' in the game like niggas really are stars\nLike we ain't seein' through the bullshit, we know who you are (C'mon)\nI'm like a blessing to the game when your shit sound dated\nI force niggas to improve, you should be happy I made it (Ha)\nHere to rep the game fully, change my style like the weather\nGivin' you niggas new shit to make the game feel better\nI'm sayin, I cook in the kitchen and we make the thoughts connect\nYou forced to humble yourself, give me my big respect (Ha)\nYou hurtin' the game when your shit sound off, yaknow\nA legend in this shit that's why I move like a boss, yaknow (Ha)\nYou better be tight, 'cause you can get tossed, fo' sho' (Ha)\nYou niggas know whassup, I come correct with money long 'cause I—\n\n[Hook: Sample + Busta Rhymes + Chauncey Black + Q-Tip]\n\"I write rhymes, I write checks\"\n(It's clear today)\nTip, ayo, what happened to the—\n(Love—)\nFor the game\n(Love—)\nFor the music\n(I need realness in my life)\nAyo, these niggas in the game don't sound the same\nYup, these niggas in the game don't sound the same\nAyo, what happened?\nThey ain't got it in 'em to make a classic\nAyo, what happened?\nThese niggas can't hold the torch, so why pass it?\n(Yo)\n\n[Verse 3: Q-Tip + Busta Rhymes]\nOh, my God, they'll (Uh) come ridin' around\nSome (Uh) old dream and they (Uh) can't get down\nThey (Uh) lookin' around outside of themselves\nAnd they (Huh!) sayin' things that ain't really themselves\nAnd they (Ha) keep fuckin' regurgitatin' the same script (Huh)\nSame hoes, same blow, same Glock clip (Ha)\nSame drug strip (Uh), what the fuck is this? (Uh)\nC'mon, y'all, raise the bar on this body shit (Huh!)\nYou sound stagnant, need to progress and grow (Uh huh)\nUpgrade your punchlines, finesse the flow (Uh huh)\nGet your concepts and lyrics together, ayo (Uh huh)\nThen drop the bomb shit to step up the pressure, y'know? (Huh!)\nI'm tired of niggas complainin' how the game changed (Ha)\nYou niggas should step up your game, cause you sound strange (Ha)\nThat's why you ain't sellin' no records, check the SoundScan\n(Uh huh)\nIn this rap shit I command respect, muh'fucker cause I—\n\n[Hook: Sample + Busta Rhymes + Chauncey Black + Q-Tip]\n\"I write rhymes, I write checks\"\n(It's clear today)\nTip, ayo, what happened to the—\n(Love—)\nFor the game\n(Love—)\nFor the music\n(I need realness in my life)\nAyo, these niggas in the game don't sound the same\nYup, these niggas in the game don't sound the same\nAyo, what happened?\nThey ain't got it in 'em to make a classic\nAyo, what happened?\nThese niggas can't hold the torch, so why pass it?\n\n[Outro: Q-Tip + Busta Rhymes]\nAyo, these niggas in the game don't sound the same\nBust', these niggas in the game don't sound the same\nAyo, what happened?\nThey ain't got it in 'em to make a classic\nAyo, what happened?\nThese niggas can't hold the torch, so why pass it?\n\n[Produced by J Dilla]", "image": "https://images.genius.com/be78d5f1fcdafddac07407fe6e45d552.630x630x1.jpg"}], "artist": "Busta Rhymes"}