{"songs": [{"title": "Headlights", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Produced by Emile Haynie & Jeff Bhasker]\n\n[Intro: Nate Ruess]\nMom, I know I let you down\nAnd though you say the days are happy\nWhy is the power off and I'm fucked up?\nAnd, Mom, I know he's not around\nBut don't you place the blame on me\nAs you pour yourself another drink, yeah\n\n[Chorus: Nate Ruess]\nI guess we are who we are\nHeadlights shining in the dark night, I drive on\nMaybe we took this too far\n\n[Verse 1: Eminem]\nI went in headfirst, never thinkin' about who what I said hurt\nIn what verse, my mom probably got it the worst\nThe brunt of it, but as stubborn as we are, did I take it too far?\n\"Cleanin' Out My Closet\" and all them other songs\nBut regardless, I don't hate you ‘cause, Ma\nYou're still beautiful to me, ‘cause you're my mom\nThough far be it from you to be calm\nOur house was Vietnam, Desert Storm\nAnd both of us put together could form an atomic bomb\nEquivalent to chemical warfare\nAnd forever we could drag this on and on\nBut agree to disagree, that gift for me\nUp under the Christmas tree don't mean shit to me\nYou're kickin' me out? It's 15 degrees\nAnd it's Christmas Eve, \"Little prick, just leave!\"\nMa, let me grab my fucking coat!\nAnything to have each other's goats\nWhy we always at each other's throats?\nEspecially when Dad, he fucked us both\nWe're in the same fuckin' boat\nYou'd think that'd make us close (Nope)\nFurther away it drove us, but together, headlights shine\nAnd a car full of belongings, still got a ways to go\nBack to grandma's house, it's straight up the road\nAnd I was the man of the house, the oldest\nSo my shoulders carried the weight of the load\nThen Nate got taken away by the state at eight years old\nAnd that's when I realized you were sick\nAnd it wasn't fixable or changeable\nAnd to this day we remain estranged, and I hate it though, but—\n\n[Chorus: Nate Ruess]\nI guess we are who we are\nHeadlights shining in the dark night, I drive on\nMaybe we took this too far\n\n[Verse 2: Eminem]\n‘Cause to this day we remain estranged, and I hate it though\n‘Cause you ain't even get to witness your grandbabies grow\nBut I'm sorry, Momma, for \"Cleanin' Out My Closet\"\nAt the time I was angry, rightfully? Maybe so\nNever meant that far to take it though\n‘Cause now I know it's not your fault, and I'm not makin' jokes\nThat song I no longer play at shows\nAnd I cringe every time it's on the radio\nAnd I think of Nathan being placed in a home\nAnd all the medicine you fed us and\nHow I just wanted you to taste your own\nBut now the medication's takin' over\nAnd your mental state's deterioratin' slow\nAnd I'm way too old to cry, the shit is painful though\nBut, Ma, I forgive you, so does Nathan, yo\nAll you did, all you said, you did your best to raise us both\nFoster care, that cross you bear, few may be as heavy as yours\nBut I love you, Debbie Mathers\nOh, what a tangled web we have ‘cause\nOne thing I never asked was\nWhere the fuck my deadbeat dad was\nFuck it, I guess he had trouble keepin' up with every address\nBut I'da flipped every mattress, every rock and desert cactus\nOwned a collection of maps\nAnd followed my kids to the edge of the atlas\nIf someone ever moved 'em from me\nThat you coulda bet your asses\nIf I had to come down the chimney, dressed as Santa, kidnap 'em\nAnd although one has only met their grandma once\nYou pulled up in our drive one night\nAs we were leavin' to get some hamburgers\nMe, her and Nate, we introduced you, hugged you\nAnd as you left I had this overwhelming sadness\nCome over me as we pulled off to go our separate paths and\nI saw your headlights as I looked back\nAnd I'm mad I didn't get the chance to\nThank you for being my mom and my dad\nSo, Mom, please accept this as a\nTribute; I wrote this on the jet, I guess I had to\nGet this off my chest, I hope I get the chance to\nLay it 'fore I'm dead, the stewardess said to fasten\nMy seatbelt, I guess we're crashin'\nSo, if I'm not dreamin', I hope you get this message that\nI will always love you from afar, ‘cause you're my mom\n\n[Chorus: Nate Ruess]\nI guess we are who we are\nHeadlights shining in the dark night, I drive on\nMaybe we took this too far\n\n[Bridge: Nate Ruess & Eminem]\nI want a new life (Start over)\nOne without a cause (Clean slate)\nSo I'm coming home tonight (Yeah)\nWell, no matter what the cost\nAnd if the plane goes down\nOr if the crew can't wake me up\nWell, just know that I'm alright\nI was not afraid to die\nOh, even if there's songs to sing\nWell, my children will carry me\nJust know that I'm alright\nI was not afraid to die\nBecause I put my faith in my little girls\nSo I'll never say goodbye cruel world\nJust know that I'm alright\nI am not afraid to die\n\n[Chorus: Nate Ruess]\nI guess we are who we are\nHeadlights shining in the dark night, I drive on\nMaybe we took this too far\nI want a new life", "image": "https://images.genius.com/ff9e2431dea9b70a92a5326d3631b654.1000x1000x1.png"}], "artist": "Eminem"}