{"songs": [{"title": "American Terrorist II", "album": null, "year": null, "lyrics": "[Verse 1]\nThrough the fire, smoke, and broken rubble\nWalks the secret life, bullet-proof and bulging muscle\nDeath-defying, highest flying over trouble\nCan you please come and help us out our hopeless struggles?\nSympathy is wearing off and dying out\nIn the face of all these enemies and crying out\nLosing all this energy from finding out\nThe world is filled with ills, ever so close to timing out\n\n[Hook]\nWhere, are those heroes?\nWhere, are those super-heroes?\n\n[Verse 2]\nPondering, that super-villain's got a point\nTold the captain on the roof while they was smoking joints\nFlicked the ashes down into the street below\nLooked up, said he hate the city now, even though\nHe swore that he'd protect it when he landed\nTheir perspective's now changed, all pretty much abandoned\nThe captain spray cologne around and said he understand it\nIt's getting hard to separate the saints from the satanic\n\n[Hook]\n\n[Verse 3]\nLast remarks, they did it to themselves\nI killed off heaven, now I live in hell\nSo complicit in their own non-survival\nTold them that they biggest rival is inside you\nI do possess the power to revive you\nBut if I did that, I'd just have to fight you\nCause you truly are the hero and the villain\nThe world stood froze, hearing a truth so chilling\nReporters stopped filming, somebody shouted, \"Kill him!\"\nHe looked back in disgust and flew up through the ceiling\nBusted through the roof and kicked over the building\nBefore it hit the ground, a younger hero flew around\nAnd put it on his shoulders, said you're naive now\nBut believe, you'll believe me when you're older\nEvery asteroid you stop and bomb you fly up into space\nYou ain't saving them from danger, you're keeping danger safe\n\n[Hook]\n\n[Outro]\n\nIn my hands, all the peace and all the glory\nIn my hands\nIn my hands\nIn my hands, all the peace and all the glory\nIn my hands\nIn my hands", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}