{"songs": [{"title": "Willy Wonka", "album": null, "year": null, "lyrics": "[Meek Mill]\n\nLooking like a million bucks!! Smelling like a brick or raw\nWent and bought a yellow Breitling, cuz these haters piss me off\nThrowin' all\nThat bullshit in the field, I'mma pick you off. (Interception!)\nStill play the passenger, acting like I'm Biggie Smalls. Every time I look up, these niggas getting shook up\nCuz I'm bout to drop like the raw when it cook up. On another page tell them all pick the book up. Used to be the\nUnderdog but now I'm like \"wassup!!\" I don't even know ya'll so why would I dough ya'll. Never ever catch me bitching like\nO-Dog\n\nCatch me in the kitchen trynna turn a couple O's hard! 40 on my hip line, ready to rock and roll off\nMy style, gun a nigga down then I stroll off. I don't do the shooting my niggas will drop the load off (The Goons!). I'm\nTalking special delivery. Vividly, shining on these bitches like Tiffany (Bling!!). Isn't he killing these rappers come and witness he\nHad to go the harder way to get it, like Timothy. YEAH! You grind hard then you shine hard. I'm balling the rapper version of LeBron dawg\nI be fresher than a nigga on his prime ya'll. If they don't feel me they just smell me like Pinesol. Too strong, I did this for too long\nSour Diesel and Patron got a nigga to on. Im' gone! High as my electric. She don't wanna fuck with me on to the next bitch. On to the next\nGirl. I am on the next world. With my out of space flow, hard as the bass go. Spitting 38 doe. Special, Pussy Ass Niggas got me twisted\nLike a pretzel. Wait until I catch you! Arms long like I'm Armstrong, I'll stretch you!! Beat you face in and have you looking like Van Exel\n\nEw! I be getting ugly on the beat. And I didn't even sign my deal, I'm getting money on these streets. I be eating everything, I be hungry on the beat! And I been always on some shit, since a youngin' in these streets. I said I'm 215 APhillyated ya'll niggas gon really hate it\nPull up on them flying ? Haters get A Millyated. They gon think I really made it. When I ride by. Diamonds in my wrist watch, looking Ta-Da!\nAh! Nigga is you hating cuz you mad or is you mad because you hating? Make your choice because we waiting. Pick your answer just like\nIverson. I just Micheal Myers him. Running circles round you rappers, I ain't even tiresome. All you niggas dissin' on me tell'em strap up\nCuz when I get off I'm like wrestling, I just act up!! Black 'matic, tinted windows, black truck. Spray them niggas down, and back up\n\nDo it again, you and your friend. You did dirty execute him with 30. All of a sudden these niggas didn't deserve it. There family crying a grieving all at the service. Wonder round acting all crazy. Until we roll up on them niggas slow like Mrs. Daisy\nHopped out the wheel, drop like a buck eighty. When the medics came and they ain't even try to save 'em. They said \"call the coroner, this one ain't a maybe.\" Mama came to view him she said \"no that's not my baby. He don't look familiar.\" Is that getting real enough? We gon tear your brother up and show him to your mother. Yup!!!\n\nHa!! Flamers!!!\nMeek Milly! Jahlil we did it again\nAnd it ain't gon stop", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}