{"songs": [{"title": "’Til it All Falls Down", "album": null, "year": null, "lyrics": "[Hook: TL Cross] (Jadakiss)\nThe one thing y'all don't know about me, I don't play, so just beware\nYou catch me up in V.I.P. up in the club that's my atmosphere\nPlus I got, money to spend I keep, gettin it in from the hood so I don't play fair\nAnd I'm a be (What's Up!) Livin it up (What's Up!) Keep, gettin up (What's Up!)\nKeep, throwin it up (EH HEHHHHHH!!!!) Until it all falls down\n\n[Verse One: Jadakiss]\nYeah! Yo! Break the peas down to onions, money in abundance\nI'm in the lower millions I'm tryin to get in the hundreds\nNiggas pants too tight to fight, so they don't want it\nPay for somebody to protect you so where your gun at?\nBeen there done that, seen the coke come back\nSeen niggas come home from jail then run back\nSingin the same sad song my nigga won that\nNegative energy stick to him like a thumb tack\nReal hustler probably sold a milion and one packs\nNiggas think they smart and nice but they dumb wack\nIt's only 'til you crack they skull give 'em a mumwrap\nWhen it's cold I reside wherever the sun's at\nSon's back...what!!!!!\n\n[Hook: Cross] (Jadakiss)\nThe one thing y'all don't know about me\nI don't play, so just beware (UH UH!!! What's up!)\nYou catch me up in V.I.P\nUp in the club that's my atmosphere (Uh huh! What's Up!)\nPlus I got, money to spend I keep\nGettin it in from the hood so I don't play fair (EH HEHHHHHHHH!!!)\nAnd I'm a be (What's Up!) Livin it up (EH HEHHHH!) Keep, gettin up (What's Up!)\nKeep, throwin it up (UH! YEAH! UH!!!!) Until it all falls down\n\n[Verse Two: Jadakiss]\nYo! Top of the league, three piece suits or fatuges\nAll I gotta do is look a certain way and you'll bleed\nFour words describe me, niggas can't fuck around\nFishscale verses, prices go up and down\nPut it out there, see if it taste right\nYoung Jewish bulldog keepin the case right\nApartment on the fourth floor keepin the base right\nJacksons and Benjamins keepin the safe right\nFirst and the fifteenth is when we break nights\nBunch of red beams on your head like break lights\nBitches that fucked everybody turned into fake dykes\nPlus bitin a whole day it's 'gon be a great night\nLET'S GO!!!!\n\n[Hook: TL Cross] (Jadakiss)\nThe one thing y'all don't know about me\nI don't play, so just beware (UH UH!!! What's up!)\nYou catch me up in V.I.P\nUp in the club that's my atmosphere (Uh huh! What's Up!)\nPlus I got, money to spend I keep\nGettin it in from the hood so I don't play fair (Uh huh! What's Up!))\nAnd I'm a be (What's Up!) Livin it up, keep, gettin up (EH HEHHHHHHHH!!!)\nKeep, throwin it up (UH!) Until it all falls down\n\n[Verse Three: Jadakiss]\nYeah! Yo! Dice hittin the wall, decks gettin shuffled\nNines gettin wiped down tek's gettin muffled\nCalico's in the plastic stacks in the duffle\nNiggas comin through gettin racks off the muscle\nYo asked me for money I ain't asked you to hustle\nThe industry is hurt they lookin for the next Russell\nThe hip hop cops outside waitin to cuff you\nThe Bloods is on Rikers Island waitin to touch you\nNiggas on the outside just wantin to abduct you\nDudes turned their back on you that you looked up to\nKeep throwin mine in the air, I got enough to\nI don't like spendin my money nigga I love to\nLove to.......WHAT!!!!!\n\n[Hook: TL Cross] (Jadakiss)\nThe one thing y'all don't know about me\nI don't play, so just beware (UH UH!!! What's up!)\nYou catch me up in V.I.P\nUp in the club that's my atmosphere (Uh huh! What's Up!)\nPlus I got, money to spend I keep\nGettin it in from the hood so I don't play fair (Uh huh! What's Up!))\nAnd I'm a be (What's Up!) Livin it up, keep, gettin up\nKeep, throwin it up, Until it all falls down", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}