{"songs": [{"title": "We Back", "album": "Return of the Dozen Vol. 1", "year": null, "lyrics": "(The Aphilliates-style, motherfucker. Pay attention!)\n\n[Intro: DJ Young Mase]\nAnd just like that, mixtape shit is now official\nDJ Young Mase, AKA Mr. Detroit City\nYou know what time it is\nReturn of the Dozen:\nKuniva, Big Proof, Marshall Mathers\nBizarre, Kon Artist, Swift McVay\n\n[Hook: Bizarre] [x2]\nWe, we, we, we, we, we, we, we, we back\nWe back, we back\n(It's D12, mother-fucker. It's D12, mother-fucker)\n\n[Verse 1: Swifty]\nI've been firing up my ounces in Vietnam in houses\nJust the past time. Go ask about me in the county\nI am mentally disruptive and untouched; I'm not lying\nI'll snipe you faster than a nigga that's been caught wired\nMy thought process is maniacal\nTylenol threes mixed with Vicodin can make a hella antidone\nSpeak irrelevant. There ain't enough medicine\nThat can stop me from swelling your mouths worse than pelicans\nI can sock whores that's with enough force\nTo crack the back of their skeletons; fuck having remorse\nYou'd be better off being suicidal than forfeiting\nYou can hide your horsemen, but not they vital organs\nSnitches are foes and when they see me\nFolks are quick to point their fingers at me faster than ET\nMy felonies be changing with the weather\nI'll be the nigga blacker than X-Clan and the Panthers put together\n\n[Hook]\n\n[Verse 2: Bizarre]\nBack in the studio, back on the block\nBack in St. Andrews',, got them hammers cocked\nNigga' I don't get shot: I do the shooting\nGang member: I do all the recruiting\nBall till y'all fall, out there in Reno\nBlowing ten thousand: Motor City casino\nThey say my group was wanted on some IRS shit\nThat's what happens when five niggas sell bricks\nWhen it comes to beefing, we don't need Marshall\nSt. Aubin massacre: call me Tamara Marshall\nCome on your block and get loose\nShoot niggas for a triple-fat goose. This one's for Proof\nThis is for my dawgs. This is for my peoples\nThis is for them niggas, Bacardis and the Regals\n(I see dead people) And it might be you\nIf you ever, ever disrespect my crew\n\n[Hook]\n\n[Verse 3: Kuniva]\nYour boys are back in the building; yeah, we back on the map\nBack to doing them drugs; packing the mac in the Ac'\nIf you wanna get 'em up, let's make hap' with a scrap\nNiggas be running they trap until the hammer go 'clap'\nBloody you up like a Cotex; leave your face big like Rolex\nMy guns carry 21 like 'three feet, no check'\nThe laid-back, bumping James Brown; the big payback\nI don't play that like Pat, so don't say jack\nShit is real in this killing field; where's your game face?\nFuck you, your whole family and your namesake\nSo step back and observe these little clowns\nLike they running this town, like we don't get down\nIn my crib, I got plaques: they hanging all around\nAnd the only plaque you got is hanging in your mouth\nYou're not like us: a million fans overseas\nWe can leave for a week and come back with a hundred Gs\nWe back\n\n[Hook]\n\n[Outro: DJ Young Mase]\nThe dozen: they been all over the country; overseas\nNiggas done laid low for a minute\nBut now we back. The streets is ours\nWe back like we never left, niggas\nYou know what time this is: Return of the Dozen mixtape, hosted by the general\nThe fuck y'all wanna do now?\nAll y'all hating-ass niggas get your thongs ready: we back, D12!", "image": "https://images.genius.com/ee35f41ed149c86d6fe47f68d55c39e1.450x450x1.gif"}], "artist": "D12"}