{"songs": [{"title": "Maybach Music III", "album": "Teflon Don", "year": "2010-07-20", "lyrics": "[Intro]\nJ.U.S.T.I.C.E. League\n\n[Verse 1: T.I.]\nMy garage is flawless, under a hundred thou' ain't allowed\nMaybach triple white like I'm ridin' in a cloud\nNo denim on my seats, baby you gon' need a towel\nRide sexy through the city, see me, you will be aroused\nMy bankroll so well endowed\nPull bitches from MIA to ATL in style\nAnd in crowds catch me in Tao, on the strip in Vegas\nChillin', fillin' bitches' faces with babies\nBitch bite your tongue, this just ain't a Mercedes\nTell the ATF I'm ridin' with another .380\nThat's my car cost, y'all thought I would fall off\nThat was just a small loss, we can have a ball off\nFly to NY, meet me at the Waldorf-\nAstorian, Architecture Victorian\nRidin' in the past like you're drivin' a DeLorean\nHard times, never heard of those in the 'Bach\nMy feet kicked up, gettin' my dick sucked with the curtains closed\nAnd for the record kid, my final question is\nHow yo' bitch gon' feel in that when you two pull up next to this?\nHahahah, Maybach Music nigga!\n\n[Chorus: Erykah Badu]\nEverybody knows how the story goes\nMoney and clothes, they gon' come and go\nBut guess who stays the same? You gon' see the name\nStroll real slow, when the curtains roll\n\n[Verse 2: Jadakiss]\nYo, piff that I'm blowin' on is fuckin' up the ozone\nPlus I keep a dope line similar to Cold Stone's\nIce cream, pipe dreams\nIs what they have when I pull up in that light thing\nI put a hurtin' on, I got the curtains drawn\nWhoever ain't gettin' shitted on, I'm squirtin' on\nI'm in the six-deuce, fifty-sevens for the help\nChopper in the trunk, .45 for the belt\nBunch of wax dummies, all you guys gonna melt\nLive for your kids, die for yourself\nBottles in the sky if you ride for the wealth\nPeas on the block, pies on the shelf\nIf I ain't in the back of the 'Bach, I ain't in nothin' else\nHaha, I'm somethin' else\n\n[Chorus: Erykah Badu]\nEverybody knows how the story goes\nMoney and clothes, they gon' come and go\nBut guess who stays the same? You gon' see the name\nStroll real slow...\n\n[Interlude: Rick Ross]\nHuh (J.U.S.T.I.C.E. League)\nHuh, cigar please\n\n[Verse 3: Rick Ross]\nI came alive like a moth in the summertime\nJapanese wheel blades all samurai\nShine brighter than them bitches on the other side\nTime to make a blind motherfucker recognize\nAmmunition got the competition nonexistent\nHad to bubble crack but didn't have a pot to piss in\nI'll double that, how dare you try to knock a nigga?\nStreet scholar, graduated no father figure\nStill tote chrome, check my chromosomes\nMeet me halfway with things in a mobile home\nMoney machines, yeah they \"rrring\" like a mobile phone\nI'm a 7-Up and need a Coca-Cola loan\nI'm in the hood like I'm James Evans\nCashmere hand-made sweater\nMe and money got a vendetta\nLookin' back, to tell the truth I could've did betta (woo!)\nParents never had a good job\nNow it's Black American Express cards\nUhh (\"Maybach Music\"), Rozay!", "image": "https://images.rapgenius.com/21f98d27036e0a6bfd95a7c1ed9b7036.1000x1000x1.jpg"}], "artist": "Rick Ross"}