{"songs": [{"title": "Mic, Lights, Camera, Action", "album": "Redman Presents... Reggie", "year": "2010-12-07", "lyrics": "[Redman]\nUhh~! You know\nIt's times like this\nWhen we need change nigga\nYeah, and if you really look at it\nYour life is like a movie\nAnd we all in the script playin a role\nLet's go!\n\n[Hook]\nMic bright, lights, camera, action {*4X*}\n\"You are, now, playing, a rapper\" - ACTION\n\n[Redman]\nYo, I speak clearly, for y'all to hear me\nRotate while I show the world like Mary\nSleepin rarely, too much beast for the Aries\nGilla! Get cream like, Ben & Jerry's\nToo fly to mail me, C.O.D\nOpened up my mind and let my ego free\nNow the world know my government, and I'm lovin it\nAll levels, from White House to the covenant\nBig boy, when the mics and the lights on\nYou get a three minute glimpse of the icon\nYour best rapper two-steppin to my song\nWhen he don't know, he ask I write for him\nJersey lights, that's where I live\nWhere I get lost like one of Kennedy kids\nThen I reappear when it's \"Time 4 Aksion\"\nThen disappear again like LaToya Jackson, it's\n\n[Hook]\nMic bright, lights, camera, action {*4X*}\n\"You must, now, protect, the President\" - ACTION\n\n[Redman]\nYo, by any means I protect my President\nIt's P.O.P., protect our president\nA thoroughbred on the track like the meadowlands\nThe Secret Service should bring the ghetto in\nFor example, I start up a dot com\nFor terrorism, a P.O.P. hotline\nJoin the club if you're ready to rub\nElbows with folks who feel oh-nine is our time\nThat's the motto, yeah I know Bush\nMade bein President one tough act to follow\nWatch the Lewinskis that just wanna swallow\nRemember Kobe Bryant up in Colorado\nLock me in asylum, your boy too ill with it\nYour life is campaign and that's real bid'ness\nSet up shop and group your team\nCause they ain't doin what they did to Martin Luther King\nF'real!\n\n[Hook]\nMic bright, lights, camera, action {*4X*}\n\"You will, now, save, hip-hop\" - ACTION\n\n[Redman]\nYo, they said hip-hop been gone for a minute\nI gotta find hip-hop and tour more with it\nThat's my cash cow, wow, go hard\nLike the ninth inning, tryin to score for the pennant\nSky's not the limit, I'm on a quest\nTo bring back originality, style and concept\nShow you how to write 16's with context\nMix it with a little Lil Wayne and KRS\nThat's fresh! Dummy, study the art\nStudy how it all began and see the part\nStudy how Kool Herc became King of Bronx\nLearn, how to rock Wallabees and Clarks\nI think I found hip-hop dawg, she right here\nListen up homey it might help your career\nI'm goin to the top cause I'm ready for action\nThen disappear again like LaToya jackson, it's\n\n[Hook]\nMic bright, lights, camera, action {*4X*}", "image": "https://images.genius.com/4d4f1e8f8a259cccb95855c51037a514.600x600x1.jpg"}], "artist": "Redman"}