{"songs": [{"title": "Go Away", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "[Snoop]\nLet cho' mind not be confused\nIf you can walk this walk nigga take my shoes\nNew fools, you fools, these fools, all y'all\nTalkin bad about me, and my motherfuckin dawg\nHe ain't trippin, I ain't trippin, but y'all niggas still dissin\nTo me, some of these suckers'll never get it\nFull clip and if I miss it I'mma tip it on the Crip\nAnd DoggHouse in your mouth, now tell me how you livin\nWho the villain, you the villain? Nigga, Ren is \"The Villain\"\nMy homey from the C-P-T, cold chillin\nNow as time flies by I see the game gettin mo' reala\nAs I get mo' scrilla, can you dig it?\nI always tend to come widdit\nGravy train on your brain, nigga come get it\nI'm too young to retire, I'm havin fun wit it\nSee when you learn what to do with it, I'll be done with it\nCome with it\n\n[Hook: KoKane, Snoop]\nGo.. (just go away).. go a-way!\n[S] Niggas can't be trusted\n[K] Just come back another day\n[S] Niggas be on bitch shit\n[K] Just go far, a-way\n[S] Niggas get it twisted\nJust go a-way..\n\n[Snoop Dogg]\nNow she said she don't like a G\nWell listen here bitch, get the fuck from 'round me\nYou thought you was bout to get a drink on me?\nI put hands on you bitch like Suga Free\nI always let a bitch know her boundaries\nSame with a nigga, I treat him like a flea\nYou claim to be, you aim to be in my spot\nMotherfucker - you will get popped (BLAOW)\nNot, knowin who you fuckin wit, niggas be on bitch shit\nNigga we be fuckin quick, nigga we ain't talkin shit\nWhen the heat speak, niggas be on bitch shit\nTryin to get somewhere, coverin up they biscuit\nAnd then he in the club, all up on my dilznick\nBut when I leave, you niggas pullin trick shit\nBut it's cool, cause niggas gonna miss this\nCause I'mma keep it all business, what is this?\n\n[Hook]\n\n[Snoop Dogg]\nI said let yo' mind not be confused\nIf you can walk this walk nigga take my shoes\nYou fools, these fools, new fools, all y'all\nTalkin bad about me, and my motherfuckin dawg\nHe ain't trippin, I ain't trippin, but y'all niggas still dissin\nLook here Meech, some of these niggas'll never get it\nFull clip and if I miss it I'mma tip it on the Crip\nAnd DoggHouse in your mouth, now tell me how you livin\nWho the villain, you the villain? Nigga, Ren is \"The Villain\"\nMy homey from the C-P-T, cold chillin\nNow as time fly I see the game gettin mo' reala\nAs I get mo' scrilla, can you dig it?\nI always tend to come widdit\nGravy train on your brain, nigga come get it\nToo young to retire, I'm havin fun wit it\nWhen you learn what to do with it I'll be done with it\nCome with it\n\n[Hook]\n\n[Snoop Dogg]\nYeah I'm bout to go far away\nSo far you might not see me\nMy nigga Meech on the beat\nWe takin over this motherfucker, ha ha!\nAnd they thought we fell off\nFell all up in your motherfuckin ass\nBe-ii-ee-ii-itch!\nKoKane - aww that's funky right there\nPuttin it back on the map\nUhh, let me hear some dawg\nAhhh, as we take your mind\nTo a dimension you never thought existed\n\n[Hook]\n\n{*vocals ad lib to end*}", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}