{"songs": [{"title": "Things Get Worse", "album": "E.P.I.C. (Every Play is Crucial)", "year": "2011-01-01", "lyrics": "[Hook 1: Eminem]\nThere’s no need to say shit, you already know\nThe question is just how far will this go?\nHow far will he take it?\nAnd when will he stop?\nShady man, I done told you once homie to ease up\nBut you just won’t listen will ya? Nah, I guess not\nYou just can’t can ya? Man, I can’t stand ya\nYou’re rotten, what you plottin’ for us?\nMan, when are you gonna let up?\nI guess things are gonna get much worse ‘fore they get better\n\n[Verse 1: Eminem]\nHoly Toledo, it’s Angelina Jolie, amigo\nShe told me \"Yo, Shady just hand your penis to me, I’ll deep throat,\"\nAnd Brad if you try to stand between us then we’re gonna see, bro\nWho was a fantasy, I don’t mean to damage your ego\nYou faggots wanna 'rassle?\nI shove a fucking jar of Vaseline up inside your asshole\nAnd rope it shut with a lasso\nCouple of crushed Lexapro broken up with the capsule or Paxil\nJust in case I ain't dope enough with the raps, though\nCoke is cut with tobacco, smoke it up, then go wacko\nThis is what happens when you mix a coconut with Tabasco\nShady let go, the ho has been choked enough, let her ass go\nNot till Jessica Simpson lets go of the tuna casserole\nI used to love her hooters now Carmen Elektra's cuter\nStrap an extension cord to her arm and electrocute her\nI’m off my fucking meds, but I’m on an electric scooter\nI might just scoot by and shoot my mom in the neck with rugers\nSpit in Jason's face while I vomit on Freddy Kruegar\nThey can’t even get Jeffrey Dahmer to pet the cougar\nNow I’m gone get the rectal thermometer, get the lubra-\nCation and get the patient some Darvocet to chew cause...\n\n[Hook 2: Eminem & B.o.B]\nThere’s no need to say shit you already know\nThe question is just how far will this go\nHow far will he take it?\nAnd when will he stop?\nB.o.B I done told you once homie to easy up, jeez\nThere’s no need to say shit you already know\nThe question is just how far will this go\nCause I will never lay down\nAnd I will never let up\nI guess things are gonna get much worse ‘fore they get better\n\n[Verse 2: B.o.B]\nWith the soul of a Shaman\nI'll eat a beat then vomit\nLike a bulimic woman with an uneasy stomach\nI pass by people on the street they seem like sheep and zombies\nStiffer than a therapeutic pair of jeans you run in\nSo can you hear me coming\nEminem this beat is absolutely disgusting\nIt’s probably got diseases on it\nI’m just being honest, I can see the comments\nI can see the evolution as we creep up on it\nI put that music in your veins like a needle junkie\nShit I just do this for the haters, I don't need the money\nI'm diarrhea on the track so it needs plunging\nSomebody please tell these girls to release my undies\nNobody really understands my language\nI find it complicated just to hold a conversation\nBut still I got a whole lot of patience\nSittin’ back watching Earth from my Space station\n\n[Hook 1]\n\n[Verse 3: Eminem]\nOh my gosh I put Natasha Bedingfield in a washer\nWatch it go from rinse to spin cycle\nIt's like I got ya hypnotized and I forgot ya\nMy God, ya psychologically fucked\nMichael would like an apology, what?\nTell that psycho to stick a Tyco truck and a white tricycle up his butt\nAnd glue the seat of bicycle to his nuts\nI’m as cold as a muthafucking icicle i'm a nut\nI ain't nuttin’ nice, man I like to pull knives and I like to cut\nThe poster addict for post traumatic stress\nI guess this is the most dramatic I’ve been in a while\nThis is the closest that it's come to the Marshall Mathers\nI can hear him start to gather\nI don’t paint the portrait of the picture perfect Partridge family\nThis ain't your orphan Annie, no this is more uncanny\nKick down Dakota Fanning's front door while the whore is tanning\n(\"He can’t say whore\"), of course he can, man he just saw her fanny\nThen murdered her while he danced around the room and wore her panties\n\n[Hook 1]", "image": "https://images.genius.com/e5a4565350f88e7eb8d8b6e1a5b364fb.500x500x1.jpg"}], "artist": "B.o.B"}