{"songs": [{"title": "Lil’ Homies (Original Version)", "album": null, "year": "2001-03-27", "lyrics": "[Intro: Little Boy]\nHey Junior Mafia I got something for your mothafuckin’ ass\n\n[2Pac]\nFuckin’ lil' homies\nEverybody duckin’, fuckin’ lil' homies\nLil' homies\nEverybody duckin’, fuckin’ lil' homies\n\n[Verse 1: 2Pac]\nJust pay attention, here's a story 'bout my lil' homies\nStraight thuggin', lil' bad young motherfuckers, gotta love 'em\nYou could catch him in his G ride clutchin' his Glock\nScreamin', \"Outlaw!\" (Westside motherfuckers) bustin' on my enemy's block\nEducated on these cold streets\nGettin' money, makin' dummies out the police\nAin't no peace for an adolescent nigga too wild to be a thinker\nBud smokin' 24/7, everyday drinker\nGot my diploma, but I never learned shit in school\nMo' money, mo' bitches, mo' murder, fool!\nAlways the young niggas gettin' in shit\nShe wouldn't stop to conversate, so you called her a bitch\nBustin' on paper thin motherfuckers\nDrinkin' gin before you get to sinnin' on them busters\nEmptied his clip, passed by like he didn't know me\nEverybody duckin', my fuckin' lil' homies\n\n[Chorus: 2Pac, Danny Boy, Natasha Walker]\nLil' homies on the ride, niggas gonna die tonight\n(Yeah nigga)\nLets get high tonight\n(My lil' homies)\nLil' homies on the mash, runnin' on these punk police\n'Cause lil' niggas run these streets\nLil' homies on the ride, niggas gonna die tonight\n(Yeah nigga)\nLets get high tonight\n(My lil' homies)\nLil' homies on the mash, runnin' on these punk police\n(Young muthafuckaz)\n'Cause lil' niggas run these streets\n\n[Verse 2: 2Pac]\nI remember.. when you was just a lil’ G\nFlirting with death, playin' Russian Roulette, screamin' KILL ME!\nHey there young nigga, what you smokin' on?\nMad at the world 'cause you came from a broken home\nLove to squad plus your mob is sick\nA bunch of adolescent niggas spittin' major shit\nTell me, young nigga if ya die let me know\nWould your heart feel pain, watchin' as your mother cries?\nWill all your homies ride?\nOr will they all get high, and talk about how I died?\nYoung niggas on a mission to compete\nGettin' G’s, packin' heat, bringin' havoc to the fuckin' streets\nNobody knows why he took a fo’-fo’\nAnd loaded up on the whole front row\nTry to tell him but he act like he don’t know me\nPull out his pistol and show me, my lil’ homies\n\n[Chorus: 2Pac, Danny Boy, Natasha Walker]\nLil' homies on the ride, niggas gonna die tonight\n(Hahaha, whassup nigga? YEAH!)\nLets get high tonight\n(Lil' bad ass muthafuckaz)\nLil' homies on the mash, runnin' on these punk police\n(You motherfuckers know what time it is)\n'Cause lil' niggas run these streets\nLil' homies on the ride, niggas gonna die tonight\n(Yeah nigga)\nLets get high tonight\n(Juvenile delinquent-ass motherfuckers)\nLil' homies on the mash, runnin' on these punk police\n(Under eighteen.. better protect that shit!)\n'Cause lil' niggas run these streets\n\n[Verse 3: 2Pac]\n\"First 2 Bomb,\" \"16 On Death Row\"\nBustin' on them phony motherfuckers ‘cause the big homie said so\nNiggas knew I was a nutcase, quick to blast\nLivin' underage, but he'll blaze on your bitch-ass\nIs there a heaven for a G?\nAnd if it is, will I finally get to be at peace?\nOn these streets ain't no peace, shell-shocked souls\nMakin' money off of crack sales\nYoung black male unable to change ‘cause it's a cycle\nPlus nobody knows the evil that they might do\nLil' Moo, Big Yak, K. Kastro\nBig Malc, Hussein, call 'em Outlawz\nTellin' the world to be equipped\nWhen these young motherfuckers rip shit, they don't quit\nDrew down on me, pulled a pound on me\nBust like he didn't know me; my lil' homies\n\n[Chorus: 2Pac, Danny Boy, Natasha Walker]\nLil' homies on the ride\nNiggas gonna die tonight\nLet's get high tonight\nLil' homies on the mash, runnin' on these punk police\n'Cause lil' niggas run these streets\nLil' homies on the ride, niggas gonna die tonight\nLets get high tonight\nLil' homies on the mash, runnin' on these punk police\n'Cause lil' niggas run these streets\n\n[Outro: 2Pac (Over Chorus)]\nWhassup nigga let’s do this shit! My lil’ homies!\nLil’ bad-ass motherfuckin' adolescent niggas! My lil’ homies!\nWhat the fuck you niggas wanna do? WHAT NIGGA? My fuckin lil’ homies\nSixteen, fifteen, thirteen, my fuckin' lil’ homies\nJuvenile delinquents ready to BUST on you motherfuckers\nWhat the fuck you niggas wanna do nigga?!\nNigga take yo’ shit off, lil’ homies!\nWe robbin' motherfuckers nigga, Thug Life, Outlawwwwz\nWestside! Death Row nigga\nYou know what time it is, my lil’ homies\nYou know what the fuck you gotta do nigga, Outlawz nigga\nMy lil’ homies..\nYaki Kadafi, Hussein Fatal, Napoleon, E.D.I. Amin, K. Kastro, Big Muthafuckin' Syke, Boniti, Makaveli, my fuckin' lil' homies\nWhat the fuck you niggas wanna do nigga\nDouble Glocks on you bitch made niggas\nI open fire on these new deadly streets nigga\nClosed casket, fuck you bastards\nMy muthafuckin' lil' homies don’t give a fuck about none of you niggas\nFuck your families, fuck your kids nigga\nMy fuckin' lil' homies, fuck all ya’ll niggas, outlaw westside ridahs (My lil' homies)\nBad Boy killa, fuck all you niggas, hey LL meet my lil' homies\nLL Cool J, say what, nigga?\n(Thuglife)\nI’ll rock your muthafuckin' bells, me and my muthafuckin' outlawz, my lil' homies\nWho wanna get with me this old wild shit, my lil' homies\nMuthafuckin' Mac-11, Mini-14s, AR-15s on you bitch made niggas\n.357 six muthafuckin' times, hollow points\nI’m up in this muthafucka, you niggas don’t want it, my lil' homies\nMothafuckin' police, nigga get into the car, nigga, we finna ride all these motherfuckers\nThey don't see these outlaw niggas\nNot us! My lil' homies", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}