{"songs": [{"title": "I Get Down Like That", "album": null, "year": null, "lyrics": "(Intro)\nRedman: Hehehehe, got the buddha I need to put In, put It In the blunt, put It In the blunt, put It In the blunt, put It In the blunt, put It In the blunt, put It In the blunt, put It In the blunt\n\n[Verse 1: Redman]\nAiyooo, I drops the science when I'm smoking the spliff\nBecause i be that type of nigga that be fucking yo' bitch\nI spit back to back on will still like Ron G\nWhile the Bom-zee got me and Keith on Dom P\nNow who's next to test that funk doctor Joe Pesc'\nMake shot's rain out your vest and your hoes rest\nI smash the butter-est, emcee, but cool with smotherers\nYour guzzling, the Aqua-boogie 'till your bubblin'\nYou drown in my funk doc aqueduct's\nIf their's more rocks to crush\nThen there's more cop's to bust\nThat's the hood rule\nIf it's understood, cool\nWhichever him or her? Choose emcee i'll remove\nI chill the fuck off when my cup runeth over\nWith Chandon i rhyme to blow your composure\nHit ya, wit' the, shit kodak couldn't picture\nFlip a verse make crews-a disperse real quick-er!\nNow who's the nicest on the mic baby pa-rsnip\nI'm that crazy raw\nThat you've been begging for\nHi-ho silver, [I nills?]\nI kills, I thrills I\nYou can feel the real my skills appeal the\nNigga, I get swifter when i swigger, Old E\nMy styles tight like rims on vigors, It's the\nFunk Doctor spock and I'm breaking\nBuy a new car and watch the Jersey nigga's take 'em\n\n[Hook: Redman]\n\"How you get down?\"\nI get down like that\n\"How you get down?\"\nI get down like that\n\"How you get down?\"\nI get down like that\nFake motherfuckers get dropped to the mat\n(x2)\n\n[Verse 2: Redman]\nYou better realize, analyze, recognize that I'm\nThe bomb ass motherfucker that sport Timber-linds\nThe blacker the berry sweeter the juice, yeah true\nBut when I'm through they be like \"Are you in there, boo?\"\nI'll never rock the cradle, I'm about getting paper\nI'll rape ya, for ya style, make my connect fatal\nStraight blows after blows, I'm constant with bomb shit\nMake them nonsense emcees wonder who my moms is\nThe Funk Doctor Spock, better known as Reggie Noble\nYou wanna heat shit up but nigga I'm already smokin'\nI split the back of emcees like phillies\nAnd if he out the crap than make them go multi-milly\nTotal concentrations on the mic and the money\nI'm the type to get blunted and roll dice on a sunday\nWhy don't you stick out your tongue and say \"uhh\"\nAnd you'll be happy going down like J. Blige\nI take tokes, of the bombazee smoke\nGet your nose broke\nIf your slippin' like the Pocono's slopes\nI rang out shots from my mouth a lot\nLike a thousand Glocks, pop a thousand watts\nOn your housing block, Akh!\nI got the weed by the stash!\n\n[Hook: Redman]\n\"How you get down?\"\nI get down like that\n\"How you get down?\"\nI get down like that\n\"How you get down?\"\nI get down like that\nFake motherfuckers get dropped to the mat\n(x2)\n\n[Verse 3: R.O.Z]\nIt's R-O-Z the new kid on the scene\nFlow catching more vibes than B.L.S in the magazine\nI got it, locked with each release drop I be milk like pormela\nOr the nine-five Shock, straight from Jersey, Newark I represent\nTo the fullest extent, I get bent in basements\nAnd run shit, baby sis shoot the gift\nPuff a choc and skunk mix, wylin out on this\nAin't nothing you can do, when I scream on you\nWe run through crews like dress rehearsal\nWe represent peace to niggas on [??] street, and the niggas and the bitches that flip keys\n\n[Verse 4: Redman]\nThe badder the beats, the badder the badder freaks\nI have to keep the weed and Rat-tat-tat-er stashed in the jeeps\nAnd I, smoke the lye, whoever were to die\nBecause i never seen a man high, until he hit Red lye\nPlus, my bag of vocal dust bust\nAll you fake Emcees want to be down with us\nI'm leaving no witness\nTo this, physical fitness\nThis is for the REAL\nNiggas and bitches\nHot as [???]\nMade a pit stop at your penelope\nNow i'm locked down for jayo felony\nHAH! We knock crews off mad\n\n[Hook: Redman]\n\"How you get down?\"\nI get down like that\n\"How you get down?\"\nI get down like that\n\"How you get down?\"\nI get down like that\nFake motherfuckers get dropped to the mat\n(x2)\n\n[Outro: Redman]\n[??]With the dick up in your mouth\nDef Squad hit's your ass two times\nWhile I'm on the mic busting my rhymes\nPeace to 07103 back to New Jersey back to Brooklyn (Brooklyn) All the niggas that be shooked in\nSuck my dick one time, Suck my dick one time\nDef Squad is in the house!\nSuck my dick one time\nPeace to niggas in Cleveland\nPeace to all my niggas in the Chi town\nPeace to all my niggas in Atlanta\nPeace to all my niggas in Virginia\nPeace to all my niggas up in Jersey\nPeace to all my niggas in the Ill town\nPeace to all my niggas up in Newark too\nThis is how we do [?] we run right through\nPeace to Brooklyn, peace to Uptown, peace to Queens\nYou know what I mean back to the Bronx\nLeave you stomped, that ain't no calm\nWord is bond, I be romping stomping\nJust like I was bumping of the funk set\nFunkdocter Spock left your brain wet\nDef Squad is in the house [?] dick up in yo mouth\nDJ Twins Hahaha my nigga haha", "image": "https://images.genius.com/3824b6124291995f49a74e4597faaf6e.350x350x1.jpg"}], "artist": "Redman"}