{"songs": [{"title": "My Name Is", "album": "The Slim Shady LP", "year": "1999-01-25", "lyrics": "[Produced by Dr. Dre]\n\n[Chorus: Eminem]\nHi, my name is, what? My name is, who?\nMy name is, chka-chka, Slim Shady\nHi, my name is, huh? My name is, what?\nMy name is, chka-chka, Slim Shady\nHi, my name is, what? (Excuse me) My name is, who?\nMy name is, chka-chka, Slim Shady\n(Can I have the attention of the class for one second?)\nHi, my name is, huh? My name is, what?\nMy name is, chka-chka, Slim Shady\n\n[Verse 1: Eminem & Dr. Dre]\nHi, kids, do you like violence? (Yeah, yeah, yeah)\nWanna see me stick nine-inch nails through each one of my eyelids? (Uh-huh)\nWanna copy me and do exactly like I did? (Yeah, yeah)\nTry 'cid and get fucked up worse than my life is? (Huh?)\nMy brain's dead weight, I'm tryna get my head straight\nBut I can't figure out which Spice Girl I want to impregnate (Oh)\nAnd Dr. Dre said, \"Slim Shady, you a basehead\" (Uh-uh)\n\"Then why's your face red? Man, you wasted\"\nWell, since age 12, I felt like I'm someone else\n'Cause I hung my original self from the top bunk with a belt\nGot pissed off and ripped Pamela Lee's tits off\nAnd smacked her so hard I knocked her clothes backwards like Kris Kross\nI smoke a fat pound of grass, and fall on my ass\nFaster than a fat bitch who sat down too fast\nCome here, slut; \"Shady, wait a minute, that's my girl, dawg\"\nI don't give a fuck, God sent me to piss the world off\n\n[Chorus: Eminem]\nHi, my name is, what? My name is, who?\nMy name is, chka-chka, Slim Shady\nHi, my name is, huh? My name is, what?\nMy name is, chka-chka, Slim Shady\nHi, my name is, what? My name is, who?\nMy name is, chka-chka, Slim Shady\nHi, my name is, huh? My name is, what?\nMy name is, chka-chka, Slim Shady\n\n[Verse 2: Eminem]\nMy English teacher wanted to flunk me in junior high (Shh)\nThanks a lot, next semester I'll be 35\nI smacked him in his face with an eraser, chased him with a stapler\nAnd stapled his nuts to a stack of paper (Ow)\nWalked in the strip club, had my jacket zipped up\nFlashed the bartender, then stuck my dick in the tip cup\nExtraterrestrial, running over pedestrians in a spaceship While they're screaming at me, \"Let's just be friends\"\n99 percent of my life, I was lied to\nI just found out my mom does more dope than I do (Damn)\nI told her I'd grow up to be a famous rapper\nMake a record about doin' drugs and name it after her\n(Oh, thank you)\nYou know you blew up when the women rush your stands\nAnd try to touch your hands like some screamin' Usher fans\n(Ahh, ahh, ahh)\nThis guy at White Castle asked for my autograph (Dude, can I get your autograph?)\nSo I signed it, \"Dear Dave, thanks for the support, asshole\"\n\n[Chorus: Eminem]\nHi, my name is, huh? My name is, who?\nMy name is, chka-chka, Slim Shady\nHi, my name is, what? My name is, who?\nMy name is, chka-chka, Slim Shady\nHi, my name is, huh? My name is, who?\nMy name is, chka-chka, Slim Shady\nHi, my name is, what? My name is, who?\nMy name is, chka-chka, Slim Shady\n\n[Verse 3: Eminem]\nStop the tape, this kid needs to be locked away (Get him)\nDr. Dre, don't just stand there, operate\nI'm not ready to leave, it's too scary to die (Fuck that)\nI'll have to be carried inside the cemetery and buried alive\n(Huh, yup)\nAm I comin' or goin'? I can barely decide\nI just drank a fifth of vodka, dare me to drive? (Go ahead)\nAll my life I was very deprived\nI ain't had a woman in years and my palms are too hairy to hide (Whoops)\nClothes ripped like the Incredible Hulk\nI spit when I talk, I'll fuck anything that walks (Come here)\nWhen I was little, I used to get so hungry I would throw fits\nHow you gonna breastfeed me, Mom? You ain't got no tits\nI lay awake and strap myself in the bed\nWith a bulletproof vest on and shoot myself in the head (Bang)\n'Cause I'm steamin' mad (Grr)\nAnd by the way, when you see my dad (Yeah?)\nTell him that I slit his throat in this dream I had\n\n[Chorus: Eminem]\nHi, my name is, what? My name is, who?\nMy name is, chka-chka, Slim Shady\nHi, my name is, huh? My name is, what?\nMy name is, chka-chka, Slim Shady\nHi, my name is, who? My name is, huh?\nMy name is, chka-chka, Slim Shady\nHi, my name is, huh? My name is, who?\nMy name is, chka-chka, Slim Shady", "image": "https://images.genius.com/8c9bd63a7f349272ac1c011382c725c2.1000x1000x1.png"}], "artist": "Eminem"}