{"songs": [{"title": "BET Cypher 2016", "album": null, "year": "2016-10-04", "lyrics": "[Intro: DJ Drama]\nLadies and gentlemen, yours truly DJ Drama. For the first time ever, a one-on-one cypher, a one-on-one battle, two MC's. One has sold over 80 million records, a thousand features, numerous Grammy's and BET Awards, and the other one, hasn't done a goddamn thing. Let's go\n\n[Verse 1: Lil Wayne]\nForget all my adversaries, I puff the baddest mary\nWatch your vocabulary, cause I go Conan Barbarian\nMy watch is like Halle Berry\nMan I watched my dad get burried, man I watched my ex get married\nI used to pop X with Paris, I made her lay next to Sarah\nWe used to have sex on camera, I used to pop X and viagra\nAnd act it was natural stamina, double cupping like Pamela\nDouble up her like a gambler, streetsweeper, I'm a janitor\nY'all weak like a calendar, heh, beyond weak\nYeah, I'm getting close to a billion in arm reach\nYeah, all I could see from my building is palm trees\nYeah, Katrina had us trapping out a RV\nHeh, we dripping, and y'all weak\nI leave your brains right there on your broad cheek\nAnd bloodstains all over your offspring\nI think the gang and police they all linked\nHold up, why you flinching slime? Call your henchmen slime\nYou know I draw down, you draw attention slime\nFiend searching in a haystack for syringes slime\nD-boy got em flipping like some ninjas slime\nSee em tweakin', see em crying, see em limping slime\nThat some symptons slime, I can prevent em slime\nSplit your head right in two like split decision, slime\nI been through hell and back, came back in mint condition slime\nHold up, now its time to drop the window, slime\nToss out your demo, I ain't even like your intro, slime, haha\nI go hard, like Kimbo, slime\nYou know my M.O. slime, spit that A-M-M-O, slime\nHold up, I go hard, like Kimbo, slime\nYou know my M.O. slime, spit that A-M-M-O, slime\nTunechi\n\n[Interlude: Chocolate Droppa]\n(Whoo)\nI'ma make it real simple and qaint\nBefore I start, shout out to my brother, my man Kevin Hart\nGo see his movie What Now?\nAy Drama (What's up Droppa?)\nY'all are like a old man walking down the street in a Pamper\nI'm about to shit on these niggas (What?)\nI guess that all depends\nWordplay, figure it out\nLet's get it\n\n[Verse 2: Chocolate Droppa]\nGritty grimy grits on your lady tits\nSloppy Joes, I'm spreading it, one all you hoes\nDroppa's insane, the rest of y'all, are lame\nI'm taking back what's mine, I'm talking 'bout that fucking fame\nWhoo, you did it to yourself people\nDroppa back, 'bout to do it to you people\nUh, that anger's at an all-time high\nYeah, I eat my bread, I'm talking rye\nUh, money coming out of duffel bags\nYeah look at your boy, in the duffel bag\nGot the trash bag, dark green\nComing 'round the corner in that pure mint green\nHatian, switch it up, sak pase tou ka te te\nComing back in different languages and I don't play\nUh, Droppa, Droppa, Droppa\nI'm talking 'bout my car, the old one\nMatter fact, take the gun, take your son, you better run\nSwitch my flow up, let me get real serious\nCause when Droppa come hard, I get delirious\nWhat Now? It's my sound\nI'm not playing, I'm taking it down, come back to my ground\nWhoo, Drama, drop the beat twice\nMatter fact tell everybody I hate mice, ow, uh\nRodents make me sick, they can kiss my ass\nCome back one time, Droppa, first not last, let's go\n\n[Outro: Kevin Hart]\n(Bars)\n187 bars in two minutes\nIt ain't never been done\nI did a time, get your money or let your check get you\nDisgusting\n(What Now?)", "image": "https://images.genius.com/66156e4af04a4e225aa9c7d83bcae315.700x463x1.jpg"}], "artist": "Lil Wayne"}