{"songs": [{"title": "Legendary (Success Is Certain)", "album": "Success Is Certain", "year": "2011-07-19", "lyrics": "[Intro]\nI'm legendary, legen-legendary, I'm le-le-legendary\n\n[Verse 1]\nThe theme song to my supplier, plays in the key of a ki, I'm like a messiah\nCrossed with The Wire, rapping around the Boardwalk Empire\nWho brought their Bibles? This the Christ chapter\nI'm sick enough to take my life then take your life after\nDon't take me light or play me light: we two of the same\nGod melted the Rubic's cube into fluid and threw it into my intuitive brain\nI'm eating food for moving music in the gratuitous lane\nBeen through twice, now I'm running through until I'm through with the game!\nYou can find me under a black cloud: I'm a dark star\nOnly thing I hate worse than a mark, is a marked car\nI climb mountains like Marvin Gaye, Tammy Terrell\nYou could put a face on my style; it'd be Sammy Cassell's\nI switch the fire up like I am a tranny from Hell\nWhat I got in my hand right now should remind you of Stanley Burrell\nCause it's the hammer, the cannon, you can dance with the shells\nMy pet peeves are granny panties and planning to fail\nI'm a heavyweight; I'm catastrophic\nWhen I set it like Farenheit 9/11, meditate 'til the levees break\nI tar and feather featherweights until my 'fetti straight\nThe MAC-11'll clap your melon and give your ass spaghetti face\nYou ever looked inside some dying eyes?\nYou'll see surprise and realize there's no denying God\nWhen was the last time that you heard that the \"I\" in \"try\"?\nRyan vibes like cyanide; I am proud\nTo say that I've evolved, there's only one \"I\" in defying odds\nSmall-time arrogance perishes every time to giant pride\nWho y'all respect is probably cross-dressing\nYour favorite MC can probably find himself, vibing to my Lost Sessions\nI'm legendary\n\n[Chorus]\nNow everybody wanna believe me\nBut they don't really know what's in my heart\nThis time around it's startin' to feel easy\nMy enemies starting to fall down\n(I'm legendary, legen-legendary, le-le-legendary)\nMy enemies starting to fall down\n(I'm legendary, leg-legendary)\nFall down (le-le-legendary, legendary, legendary)\nI'm legendary\n\n[Verse 2]\nI got my noodles intact\nYou want support of Detroit rap, niggas can Google this gat\nCause we the reason why you eating, we put the food on the map\nRight where the mitten is and you ain't do jack\nJust who we kidding here? This here's a different year\nSo you shouldn't assume that I'm tryna measure up to you\nWhen I tell you the ruler is back, in fact\nAs far as you new kids, what have you did?\nI know that I've burnt some bridges in the past, but I'm happy to say that I built a new bridge\nAs far as killing I'm forever willing and ready\nI will make my children's peanut butter and jelly sandwich with a machete\nYou marry the streets then we will kill at your wedding\nTell every guest at your reception they gon' get more than just hit with confetti\nNow your bitch a believer\nYou know what you get when you mix a bumblebee with a lamb?\nYou get the 'Ghini I'm sitting in\nRiding through Pittsburgh while I'm listening to Wiz Khalifa\nBlack and Yellow, the blunted joint: here's the reefer\nOne minute you tough, one minute you shook\nI know, I learned a while ago, to hide power from you, I should just put it in a book\nYou illiterate parasites: I kill you every time\nThrow a nigga' body around the room, have a nigga looking like Jamiroquai\nAnd yes I, am a firm believer that the naked truth\nLooks a hundred times better than the best-dressed lie\nAnd why you niggas is hating?\nI wonder is God really an atheist? He made me the same temperature as his nemesis Satan\nY'all need to repent cause y'all been imitating\nA statue of me, to you is a statute of limitations\nYou backwards as me and a feminist dating\nLet's tally the sales like Gladys and Patti LaBelle: I'm a big wig\nMy straw's in the hole of a volcano: I'm having a big swig\n\n[Chorus]\nNow everybody wanna believe me\nBut they don't really know what's in my heart\nThis time around it's startin' to feel easy\nMy enemies starting to fall down\n(I'm legendary, legen-legendary, le-le-legendary)\nMy enemies starting to fall down\n(I'm legendary, leg-legendary)\nFall down (le-le-legendary, legendary, legendary)\nI'm legendary", "image": "https://images.genius.com/551229ccefe42df16270c5c3dc0f9d43.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}