{"songs": [{"title": "Rock The Mic Freestyle", "album": null, "year": null, "lyrics": "[Kanye West]\nAnd I swear she a riot folks\nHow she order all that food and a motherfucking Diet Coke?\nHe said \"You lying yo, why is you lying Joe?\nCut it out, quit it G, you hurting my kid-i-neys.\"\nNaw, she talking bout a couple of kids for me\nShe's hinting at a ring from Tiffany's\nRight then and there I had an epiphany\nI swear since that day I've been treating fat girls differently\nShe told me if you read music you a genius\nI don't play but I'll introduce you to my pianist\nShe said you need a little ice just to keep me cool\nNo dimes but baby here go the family jewels\nI'm tight with my doe like my family Jews\nUh! I said \"Jews\" my career is screwed\nI ain't mean in the Hanukkah sense of the word\nI realize it's a sensitive word\nPlus a lot of best friends is white\nI mean ah, I mean my Air 1's, my diamonds and my Benz is white\nAnd I ain't one of them producers that pretend to write\nAyo, Teefa, uh why don't you come on grab the mic\n\n[Teefa]\nYo yo\nI know you use to being a womanizer\nComing at me and girls talking 'bout a men-a-\nYou're some fool\nThinking I'm gon' strip like Moulin Rouge\nWhile you biting off my garter\nI'm not easy you gotta come harder\nI want a man, not just a baby father\nTeefa no [?] no appetizer\nHaha\nWhy you kick it with your guys fo'?\nYou got eyes for girls, just spread it out\nYou done pissed Teefa off like draining my bladder out\nHaha\n\n[Interlude]\n[Kanye]: Aw, you crazy\n[Teefa]: You got me up in here tripping\n[Kanye]: Nah, but look, I said, I said look\n\n[Kanye]\nAyo my Rocafella chain hurt the game very bad\nMy girl rocking the little lamb that Mary had\nA little bit of Ghost’s style mixed with Mos's style\nI'm versatile I'm the poster child\nGetting cheese so I'm suppose to smile, get it\nWe making hits like Sosa now, hit it\nAnd I hate when girls acting bougie as hell\nAnd I already seen them naked like Blu Cantrell\n\nAw, forget it, forget it", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}