{"songs": [{"title": "Southside - Edited Album Version", "album": null, "year": null, "lyrics": "I know you're thinking, thinking that it must be\nArmor All flow cause it never get rusty\nI ain't gotta say it, man dawg trust me\nBust somebody head, GLC where was we?\nStill rock the Prada 'fore that, rock the Starter\nNiggas had the Georgetown, the Magic way harder\nThinking back to the projects, and they way they tore 'em all up\nLike when I do a project, and come back and tear the mall up\nWe coming from the\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), Side of the Chi\nThe broads, the cars, the half moon, the stars\nI'm like Jeff Fort the way I get behind bars\nBurn CDs with no regard for the stars\nCome to the crib with conflict diamonds and they ours\nBack in '94 they call me Chi-town's Nas\nNow them niggas know I'm one of Chi-town's gods\nWe eating Joe, you still talking no carbs\nA conscious nigga with mac like Steve Jobs\nWe coming from the\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), Side of the Chi\nYour fly is open, McFly\nThe crowd is open I think I know why\nI'm back from the future seen it with my own eyes\nAnd yep, I'm still the future of the Chi\nBack in college I had to get my back up off the futon\nI knew that I couldn't cop a coup with no coupons\nLook at that neutron on his green like crutons\nPeople asking him, \"Do you have any grey poupon?\"\nWe coming from the\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), Side of the Chi\nYou in the building but the buildings falling\nYou wouldn't be ballin' if your name was Spalding\nMy mind get flooded I think about New Orleans\nBout to school y'all niggas, you should call him August\nI'm the sun that goes down but I'm still revolving\nSouthside walk it out, while still you're crawlin'\nIf rap was Harlem, I be James Baldwin\nWith money in the bank like G. Rap, we're calling\nWe coming from the\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), Side of the Chi\nWith niggas masked up like Phantom of the Opera\nDreaming of the day they push a phantom to the operas\nCan't wait till they say, \"Ye ran up at the Oscars.\"\nPoppa, I heard his life is like a movie\nLike when Em' played him and Mekhi played a rasta\nMexicans gonna love it like it was for La Raza\nBut this is for the mobsters, Holla\nWe some true chi-town legends, accept no imposters\nWe coming from the\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), Side of the Chi\nUh, the un-American idol, tower like the Eiffel\nLean wit it, rock wit it, Black like the Disciples\nKnow when to use a bible, and when to use a rifle\nYou rap like you should be on the back of a motorcycle\nCaught a case of robbery, and 'Beat It' like Michael\nYour career is a typo, mine was written like a haiku\nI write to 'Do the Right Thing' like Spike do\nThrough Conflicts that's Crucial and Drama that's Psycho\nWe coming from the\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), South (side)\nSouth (side), Side of the Chi", "image": "https://images.genius.com/334bd07941665eb5b381fb51bced319d.1000x1000x1.jpg"}], "artist": "Common"}