{"songs": [{"title": "Ode to Django (The D Is Silent)", "album": "Django Unchained (Original Motion Picture Soundtrack)", "year": null, "lyrics": "[Intro: samples]\n\"Mr. Wilson!\"\n\"Good morning innkeeper! Two beers for two weary travelers\"\n\"I love you Django\"\n\"Whoa, whoa, whoa, whoa, what the hell you think you doing, boy?\"\n\"I love you Django\"\n\"Get that nigga out of here!\"\n\"Where life has little value, prepare the death\"\n\"I love you Django\"\n\"Another day, another death\"\n\"I love you Django\"\n\"Another dollar\"\n\n[RZA]\nHe who go through snow, rain, mountain or ice\nNothing can block ya, this path of vengeance\nThere's no repenting, he came to deliver\nOut the death sentence, on enemies\nBlood stains on the cotton field by the cotton mill\nCold steel keep the body hot, they rot in hell\n36 lashes on his back, left gashes\nEvery crack of the whip, he got mental flashes\nThey interrupt his baby making, and his lady's taken\nTo a far off place, more north and more forsaken\nLord help these fools, they be dead man\nBout to put a third hole in their Klan headbands\nThe good Dr. Schultz check their dental records\nThe slug make his whole mug disconnected\nThey learn to shoot, doing the dead man tango\nHe's wild like a wild durango\nBut the D is silent, Django\n\n[Samples]\n\"Django, I think you should make a last request\"\n\"I'm going to find you anyway I can\"\n\"They praying to kill, I don't mind\"\n\"It's a smart thing to do when you know that death is coming for you\"\n\"How come you haven't got your burial suit with you?\"\n\"We'll have to leave you to the vultures\"\n\n[RZA]\nHe get Cash Rule to blast you\nTie you up, have you hung from his lasso\nAnd drag you through the valley of death like ruined cattle\nThe D is silent, hear the noise from his barrel\nLearned to shoot and do the dead man tango\nWild like a durango, but the D is silent, Django\nTie you up, have you hung from the lasso\nGive him a gun, and he gets paid just to blast you\nDrag you through the valley of death, like ruined cattle\nThe D is silent, hear the noise from the barrel\nAnd whistle of the song, like a fucking carol\nIn the eyes of the sparrow\nEvery father would love to overthrow a tyrant\nIt's a simple science, Jack overthrows the giant\nNeither snow, rain, mountain or ice can block my path of vengeance\nThere's no repenting, I'm giving you the death sentence\nBlood stains on the cotton field, in the cotton mill\nCold steel heat your body up, may you rot in hell\n36 lashes, on my back, left gashes\nFor every crack of the whip, I felt mental flashes\nInterrupt my baby making, have my ladies taken\nTo a place far up north and more forsaken\nLord, help this fool he's a dead man\nBout to put another hole in his Klan headband\nThe good Dr. Schultz check the dental records\nThe slug'll make his whole mug disconnected\nI learnt to shoot the dead man with a tango\n\n[Samples]\n\"Yeah, his name is Django\"\n\"I love you Django\"\n\"Django, I think you should make a last request\"\n\"I love you Django\"\n\"I'll be glad to oblige you, anyway I can\"\n\"You can start praying if you like, I don't mind\"\n\"It's a smart thing to do when you know that death is coming for you\"\n\"I love you Django\"\n\"How come you haven't got your burial suit with ya\"\n\"We'll have you leave you to the vultures\"\n\"I love you Django\"\n\"Where life has little value, prepare the death\"\n\"I love you Django\"", "image": "https://images.genius.com/7d1192a50ee9345b577662f8d7e58779.500x500x1.jpg"}], "artist": "RZA"}