{"songs": [{"title": "Mine", "album": "Slime Season", "year": "2015-09-16", "lyrics": "[Verse 1]\nHow the fuck a nigga gon' try tell me\n'Bout the motherfucking ice that I'm rocking\n'Bout the motherfucking bitches that I'm fucking\nAnd, sucking and putting them in a bucket then\nBeat that pussy up like it's the 12th round\nUp in niggas towns with my Zoe Pounds\nI don't go around since it come around\nWet diamonds in my mouth if I kiss her she drown\nIf I leave a nigga white T-shirt red\nIt'll be a peppermint or a baseball nigga\nI know they sick and tired of hearing 'bout my jewelry\nBut if it fall on the ground\nYeah you might just slip and fall, nigga\nShe a shark she like a jaws nigga\nYour bitch says she wants a tall nigga\nYou are one midget you too small, nigga\nShe suck my dick and rub my balls, nigga\nBig money over here, man\nStill active, don't let me show all my skills, man\nYeah my jeans they blue dolphin not no SEALs man\nI run up money run up gold like a pilgrim\n\n[Chorus]\nNigga how the hell you gon' tell me what's mine?\nI remember on the block I was serving them dimes\nYeah, how the hell you gon' tell me what's mine?\nAnd them boys they had no dope I was selling you mine\nHow the hell you gon' tell me what's mine?\nLittle nigga go ahead tell me what's all on your mind\nYeah, all on your mind, yeah\n\n[Verse 2]\nNigga, big bands on my mind nigga\nNigga, catch these ones like the swine nigga\nNigga, you be cuffing with no ties nigga\nTwin dimes and they mine, fold 'em like a pork rind\nI know bloods that rock burgundy, no wine\nTold that nigga best believe I'ma stay one round\nIn the back of the car screaming YSL hold it down\nYeah, hold it down 'til he come back off on an appeal\nThat's the real deal\nI'ma eat that pussy down then I'ma roll up some kush straight out the fields\nI told her straight to her face if she don't do it I know someone that will\nYou know the deal\nI don't want to drink no lean with these niggas if it's not double sealed\nAnd that's the real\nNigga big B balling no budget\nAnd my car is rare like a mullet\nI've seen this bitch from up the stairs she ain't ugly\nBitches bome up to my room and they get slutty\nBitches ball me Jeff and the F stand for fuck it\nOne more time for my jewelry, yes it's flooded\nTake that dick up out her coochie, then I butt it\nAll these niggas with me blooded, like we cutted\n\n[Chorus]\nNigga how the hell you gon' tell me what's mine?\nI remember on the block I was serving them dimes\nYeah, how the hell you gon' tell me what's mine?\nAnd them boys they had no dope I was selling you mine\nHow the hell you gon' tell me what's mine?\nLittle nigga go ahead tell me what's all on your mind\nYeah, all on your mind, yeah", "image": "https://images.genius.com/e7c67a01f872ff7f8c60b34a636ec3f4.500x500x1.jpg"}], "artist": "Young Thug"}