{"songs": [{"title": "Who Want Some", "album": "Trouble Man: Heavy Is the Head", "year": "2012-12-18", "lyrics": "[Hook]\nAll I got is trouble, most you niggas know it\nPistols in the duffle anybody lookin for it\nWho want some? (Who want it bitch) who want some? (Who want it ho)\nYou know anybody get it if you want some\nFlyest in the city, all I do is ride\nAnybody get it think I'm lyin nigga try\nAye, who want some? (who want it bitch) who want some (Who want it ho)\nYou know anybody get it if you want some\n\n[Bridge]\nAye you can miss me with that bullshit\nAnd when you see me holla at me if you want it bitch\nOkay you can miss me with that bullshit\nAnd when you see me holla at me if you want some nigga\n\n[Verse 1]\nI'm trouble man, stay in trouble, trouble's all I know\nA snub nose 44 fitted on my clothes\nI love to hustle, trust no one, I'm countin all my dough\nIn Magic City stacks of 20 big tall I throw\nKeep it a 100 with the D cuz they all my folk\nI do a party a 100 G's to the mall I go\nThe slow flow, bought the four floor, Mansion out in Cali\nGot a matte black Rolls Royce, Bullet proof Denali\nBetter check a nigga head say he better than me\nMan if they really wanna beef I leave em dead as can be\nI'm back up in this bitch with Toomp, OG what they wanna do?\nI shoot a nigga, catch a case and beat it in a month or two, leggo\n\n[Hook] + [Bridge]\n\n[Verse 2]\nHalf a million dollar chain, shit so big it's a shame\nMillionaire still hang with niggas out there dealin cocaine\nIt's Kang mane you know I ain't finna deal with no lame\nStill might catch me in Bev Hills sittin tall in them things\nWalkin out the ?? throw them junkies all in my chain\nMy address and my ensemble that's 'bout all I'mma change\nMan play them games if you want to, all my niggas with it\nWe can bang if you want to, let all you niggas get it\nOff probation and I'm waitin for a nigga to jump\nYou disrespectin the crown and double barrel I dump\n\"Like ain't he learned from the time that he done did in the pen?\nMan here this skinny nigga go talkin bout pistols again\" aaaahhh\n\n[Hook]\n\n[Verse 3]\nWe been through this, how many times have you niggas forgot?\nI get locked up, get out on top, whether you like it or not\nLet us remember 'fore my fed case now I was a head case\nHit a nigga neighborhood tell 'em bring the yellow tape\nI calmed down for my kids and my mom now\nRun up on them sucka niggas, you can put your arms down\nAnd FYI I never put my arms down\nTell the ATF I got three more .380's left haaaa\n\n[Hook] + [Bridge]\n\n[Outro: T.I. Speaks and Skit]", "image": "https://images.genius.com/6c270013a37f81fa5c7f0606f8824d12.300x300x1.png"}], "artist": "T.I."}