{"songs": [{"title": "Kenny Lofton", "album": "Truly Yours 2", "year": "2013-04-30", "lyrics": "[Intro]\nHurt, to think that you lied to me\nHurt, way down deep inside of me\nAnd it breaks my heart...\n\n[Verse 1: J. Cole]\nGet paid a pretty Penny for my thoughts\nI'm Hardaway with grammar, I'm hot\nThey only care 'bout a nigga when he handle the rock\nOr when he dishing the pill, or when he grippin' the steel\nBailing out my brother, tell the lawyer \"get the appeal\"\nWith the flick of the pen, write the check and he out\nTwo years later he be at my shows checking me out\nKnow he proud of lil bro and how my records be out\nFlashbacks to childhood when he was deckin' me out\nNow it's clear lil Maine is the best mc out\nHands down, flow water, can't drown\nMy flow father, go harder, Cole smarter\nShout out to fiends in Queens, I'm team no daughters\n\n[Pre-Hook]\nI seen it all at this young age\nThe only thing left to do is die and hit front page\nShould I knock on wood and pray like God forbid?\nThese hoes be poppin' pills, these niggas be poppin' shit, bitch\n\n[Hook]\nPac on the mic in his prime\nThey only care 'bout a nigga when he writing a rhyme, boy\nKenny Lofton, you feelin' my pace?\nThey only care 'bout a nigga when he stealin' the base\nIt's like I'm Wilt the Stilt, I'm fucking them all\nThey only care 'bout a nigga when he dunkin' the ball, mane\nAnd it breaks my heart\nThe world’s a stage, I'll just play my part\n\n[Verse 2]\nJust caught fire like a young Richard Pryor with unforgettable quotes\nThey only care 'bout a nigga when tellin' a joke, or when he's sellin' his dope\nThey tell the reverend \"Man, I rather get to heaven with coke\nThen live in hell and be broke\"\nShout out to black man who beat the odds by yellin' for hope\nToday he asked if I could Twitter y'all and tell you to vote\nMy nigga, how could I, knowing what I know\nIt's a game of charades, masquerade for the dough\nRead the teleprompter these niggas is actors on the low\nYeah I voted for the nigga 'cause he got the best show\nLike I got the best flow\nOn your mark, set, go\nMama got us out the hood but we still ghetto\n\n[Pre-Hook]\nI seen it all at this young age\nThe only thing left to do is die and hit front page\nShould I knock on wood and pray like God forbid?\nThese hoes be poppin' pills, these niggas be poppin' shit, bitch\n\n[Hook]\nPac on the mic in his prime\nThey only care 'bout a nigga when he writing a rhyme, boy\nKenny Lofton, you feelin' my pace?\nThey only care 'bout a nigga when he stealin' the base\nIt's like I'm Wilt the Stilt, I'm fucking them all\nThey only care 'bout a nigga when he dunkin' the ball, mane\nAnd it breaks my heart\nThe world’s a stage, I'll just play my part\n\n[Verse 3: Young Jeezy]\nI said, you wouldn't know the truth if it was right there in your face\nSee I can't explain the feeling when the feds surround your place\nIn that PJ Rosé, I drink that shit by the case\nLike somebody pray for me, Reverend Run, Pastor Mase\nSee I do this for my homie he got caught with a soft eight\nWhen I say a soft eight, yeah that's two less than ten\nIf they let him out today he gon' do it all again\nSay he lost the first time it won't stop until he win\nStreet life will have you drunk, I'm talkin Seagram’s Gin\nYeah we screamin' Scarface, but we all know how that ends\nEvery word is like dope, you can snort it like lines\nIf I said it, then I meant it, they reciting' every line\nIf I had to write a book, it would be the Life and Times\nEvery verse is that work, you can weigh it like a nine\nYou see I lost a lot of niggas and it broke my heart\nLife is staged, I just played my part\nHaha, yeah\n\n[Hook]\nPac on the mic in his prime\nThey only care 'bout a nigga when he writing a rhyme, boy\nKenny Lofton, you feelin' my pace?\nThey only care 'bout a nigga when he stealin' the base\nIt's like I'm Wilt the Stilt, I'm fucking them all\nThey only care 'bout a nigga when he dunkin' the ball, mane\nAnd it breaks my heart\nThe world’s a stage, I'll just play my part", "image": "https://images.genius.com/eea3c8d569aba2182316f265944de431.896x896x1.png"}], "artist": "J. Cole"}