{"songs": [{"title": "Who You’re Around", "album": "Dreams and Nightmares", "year": "2012-10-30", "lyrics": "[Intro: Meek Mill]\nOne Night I prayed to God\nI asked could he please remove the enemies from my life\nAnd before you know it I started losing friends\n\n[Chorus: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around\n\n[Verse 1: Meek Mill]\nY'all was like my brothers\nI considered y'all as folks\nAnd I remember nights sipping liquor making toasts\nTalking about the life, trying to get it slinging dope\nNiggas say I changed, but you niggas changed first\nAnd fuck all this money nigga, we was fam first\nLooking at me balling, know that Instagram hurt\nCuz you was supposed to be that nigga in that damn Ghost\nI would have rolled for you even in the same hearse\nSame cemetery, bury me in the same dirt\nWe had a plan, but I guess it ain't work\n\"B.H we straight,\" that was the motto my nigga\nI got rich first, you was supposed to follow my nigga\nI'm gone\n\n[Chorus: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around\n\n[Verse 2: Meek Mill]\nAnd Dat Nigga Lil\nShit I can't believe you (not you)\nThat's what that syrup and that weed do?\nAnd when I came home I tried to feed you\nAnd every song I was screeming free you (Free Dat Nigga Lil)\nAnd if you bled I was down to bleed too\nNow when I ride by I breeze through\nI don't even stop, ain't a need to\nAnd you the one that left nigga, I ain't leave you\nShit got realer, niggas got richer\nI said the money train coming, niggas missed it\nI even tried to spin back around to come and get you\nBut niggas wanted more from me then my own sister\n\n[Chorus: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around\n\n[Verse 3: Meek Mill]\nThey want more than my mother\nMore than Omelly, and that nigga like my brother\nGreedy motherfucker\nCrazy thing about it, I don't hate em, I still love em\nI might have said things, I never said fuck em\nBut I'm a live my life, get the money, ball hard\nStill sending earned money for his calling cards\nRick ain't complaining, he got life behind bars\nAnd he still calling me, bet you he ain't calling y'all\nCuz none of y'all niggas ain't send him shit yet\nNone of y'all niggas send him pics yet\nI'm still writing money orders, sending big checks\nAnd remember when it rains, niggas get wet\nGone\n\n[Chorus: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around\n\n[Outro: Meek Mill]\nI still love niggas\nBut its like we just grew apart\nIf you don't grind, you don't shine\nHalf my niggas still around, and we all shining hard\nGone", "image": "https://images.genius.com/c59afafa87c6a24df220df1e2af44f8e.1000x1000x1.jpg"}], "artist": "Meek Mill"}