{"songs": [{"title": "What We Talkin’ About", "album": "The Blueprint 3", "year": "2009-09-08", "lyrics": "[Produced by Kanye West and No I.D.]\n\n[Intro: Jay-Z]\nBlueprint, trois\nYeah, yeah\n\n[Verse 1: Jay-Z]\nWhat we talkin' about? Real shit, or we talkin' about rhymes?\nYou talkin' about millions, or you talkin' about mine?\nWhat we talkin' about? 'Cause I ain't got time\nFor what people be talkin' about all the time\nWhat we talkin' about? Fiction, or we talkin' about fact?\nYou talkin' about fiction? Hold up, pardon my back\nI'm talkin' about life, and all I hear is\n\"Oh yeah, he keeps talkin' about crack.\"\nI ain't talkin' about profit, I'm talkin' about pain\nI'm talkin' about despair, I'm talkin' about shame\nI ain't talkin' about gossip, I ain't talkin' about Game\nI ain't talkin' about Jimmy, I ain't talkin' about Dame\nI'm talkin' about real shit, them people playin'\nWhat is you talkin' about? I don't know what y'all sayin'\nPeople keep talkin' about \"Hov, take it back!\"\nI'm doin' better than before, why would I do that?\nAin't nothin' cool 'bout carryin' a strap\nAbout worryin' your moms and buryin' your best cat\nTalkin' about revenge while carryin' his casket\nAll teary-eyed, about to take it to a mattress\nI'm talkin' about music, I ain't talkin' about rap\nYou talkin' about who's hot, I ain't talkin' about that\nThe conversation is changed, let's yap about that\nI don't run rap no more, I run the map\n\n[Chorus: Luke Steele & (Jay-Z)]\nThey talk, we live\nWe see what they say, they say, they say\n(I see what y'all talkin' about, ha ha)\nThey talk, we did\nWho cares what they say, they say, they say?\n\n[Verse 2: Jay-Z]\nStill they can't focus on them, they be talkin' about me\nTalkin' about what I wear, talkin' about where I be\nCheck out my hair: these ain't curls, these is peas\n\"Peasey head\" still get paid, I'm combin' through G's\nPlease, we ain't focused on naps\n'Cause I don't run rap no more, I run the map\nA small part of the reason the President is black\nI told him I got him when he hit me on the jack\nTalkin' about progress, I ain't lookin' back\nYou know I run track; try not to get lapped\nPeople keep talkin' about \"Hov left 'em flat.\"\nTry to rewrite history, let's talk about facts\nDame made millions, even Jaz made some scraps\nHe could've made more, but he ain't sign his contract\nAs far as street guys, we was dealin' crack\nThat's just how the game goes, I don't owe nobody jack\nGrown men want me to sit 'em on my lap\nBut I don't have a beard and Santa Claus ain't black\nI repeat, you can't sit on my lap\nI don't have a beard, now get off my sack—scream at me!\n\n[Chorus: Luke Steele & (Jay-Z)]\nThey talk, we live\nWe see what they say, they say, they say\nThey talk, we did\nWho cares what they say, they say, they say?\n(Blueprint 3)\n\n[Verse 3: Jay-Z]\nAnd now that that's that, let's talk about the future\nWe have just seen the dream as predicted by Martin Luther\nNow you could choose to sit in front of your computer\nPosin' with guns, shootin' YouTube up\nOr you could come with me to the White House, get your suit up!\nYou stuck on being hardcore, I chuck the deuce up\nPeace out Medusa\nWelcome to the Blue-ah-Print-ah\nTre-piece, Jay-Z your tutor\nTooter of my own horn, beep beep, moo-ya\nRass clot when rude boy come through with the roof up\nSo I could see the sky\n'Cause everybody talkin' Hov, I think we know why\n\n[Chorus: Luke Steele]\nThey talk, we live\nWe see what they say, they say, they say\nThey talk, we did\nWho cares what they say, they say, they say?", "image": "https://images.genius.com/ff10a6a0a94d002a374623bb49818293.1000x1000x1.jpg"}], "artist": "JAY-Z"}