{"songs": [{"title": "Get Me", "album": "Amerikaz Nightmare", "year": "2004-08-10", "lyrics": "(Get me) Uh-huh\n(They pretty) Uh-huh\n(Wit me) Uh-huh\n(It's crispy) Yeah!\nWhoo! Uh-huh, uh-huh, yo\n\n[Havoc]\nY'all just blowin smoke, fan in the fire\nYour wife is gettin curious homie you better hide her\nKeep it gully baby boy, share that\nEasy when you see me, I don't like to get stared at\nNiggas only mad cause they asses can't rap\nSoup the cowards up, if you want, get your man clapped\nYeah - sealed signed delivered, anthrax\nYou got a thousand niggas I'll do numbers with half that\nCatch me whylin out with a mami in Club Black\nEnough on the wheels make me feel like the tunnel packed\nYeah, if it's some'n I'm feelin you runnin that\nAnd we don't let a thing slide baby, what's up with that?\nTalk on the jack like Feds, got the phone tapped\nHavoc make tracks, didn't know, just hold that\nCareer ain't goin so well, I got that\nSlide you some hot shit, nigga it's a wrap!\n\n[Hook: Havoc]\nSee the cats in the whips wanna - get me\nBut I got the pounds and them .9's - they pretty\nSee me on the streets, them gorillas they - wit me\nBills in the pockets, know them things is - crispy\nYeah, y'all niggas pussy son\nY'all not known for bustin them guns\nSo for the .9 I got beef for days\nY'all want it wit us don't get carried away\nCall the coroner\n\n[Littles]\nYo, a closed mouth don't get fed, that's why I talk to him\nI'm hungry, niggas is eatin fo' pounds, I walk through 'em\nEither you shook or your .9 spray\nYou got a row of sixteen and a clip, one in the head around my way\nFuck with my money you be shot the fuck up\nThe name Littles got the streets locked the fuck up\nDumped off the bridge, body mopped the fuck up\nWhen them Mobb Deep boys creep or pop the fuck up\nThere ain't a nigga that can cramp my style\nFifteen get money, livin frozen out\nYou cowards softer than a bitch, get a baby wipe\n'Fore I show you what the .9 or three-eighty like\nWant beef muh'fucker come and get me\nAll this rap in the booth, or whassup in the street\nNot a nickel get sold in the park 'less I eat\nThink different the mac'll spin you like the G-Unit piece\n\n[Hook] - first 1/2\n\n[Noyd]\nAiyyo, hey hey\nLook I walk around with my pound in a glass\nPuffin my haze, missed with that dro and sprinkled some hash\nHow I roll? Why would you ask?\nKnow I'm swingin my piece, pocket full of G's, gun in the stash\nI know y'all roll with the boys with the badge\nThat's why when you kick that gangsta rap, homie I just laugh\nFrom the ave, where snitches get blast\nThey say - no Noyd, you won't blow makin songs like that\nI say - homie you sell your soul to glitter, it don't last\nI don't get no bigger, I'mma keep it realer to death\nFuck is a check if you ain't bustin a tec\nNigga we countin the scrilla with the gun on the deck\nCountin the gang that snaps, think how many straps and vests\nWe flash the pound around and knuckle down the rest\nWe hate the E-mails and the phones, the spots get blown\nIt's +Deep+, we can't even speak in certain rooms\n\n[Hook]\n\n[Prodigy]\nNope, you get outta here, fuck outta here\n\nI'm tellin you it's somethin 'bout them Mobb Deep boys, they no joke\nThey blood-thirsty for that rap music yo\nIt's not a song, it's a goddamn bomb fittin to blow\nThey not a group, they a muh'fuckin gang for sho'\nMore than a gang, we more like a troop and oh\nLet's not forget to mention our jewels is whoa\nAll our guns get blown, all my fools is loc\nE'rytime we drop a new one the streets gon' go\nStraight berserk, cause we don't play with that there\nThey know it's safe to spend they money over here\nE'rytime they cop from somebody else, the shit wack\nThat shit there is doo-doo, the shit here is crack\nGet 'em all higher than Scotty could ever beam 'em\nThey know it's safe to spend they dough over here\nFuck that new shit, they high wear off too fast\nThem niggas got garbage, this is that smack!\n\n[Hook]", "image": "https://images.genius.com/b2028bc5336e13af3d91919e570f79e6.1000x1000x1.jpg"}], "artist": "Mobb Deep"}