{"songs": [{"title": "The Young Black", "album": "House of Wax: The Vatican Mixtape, Vol. 3", "year": "2007-09-29", "lyrics": "[Intro: Ghostface Killah (Raekwon)]\nYeah... mm-hmm, yea... yea...\nYea... (what is it lord?) yo\n\n[Ghostface Killah] (Raekwon) {both}\nShootout in Stechman's, fire in the city {a block away}\n(One of Rick shots hit Missy)\nThe reason why he did it, his tank {was on E}\n(Crib got raided and lost) {about three}\nFifty in gear (ten in silverware) another sixty\n{That was married to his neck, arm and ear}\nJust got divorced, Stephanie left him for a ball player\nTook the kids and moved to Georgia\n(Should I be as a man-thinker, for every action) There's a re-action\nSeeing his case, he started spazzing\nGamma len in my only Clark, green and yellow God-God\n(Size nine Magic, show face, fucking with stars)\nCraig Mack blowout, braided (You got the new shit son?)\nBet he find a way {to out date it}\n(Timberland mineral was rusted, man made corruption, taylor made producton)\nHe had a seed in a Wally jumper, Ronny Bump nephew\nButt ass, balled up in a corner in a comforter\nPaulette was his main wiz, she guzzled 99 bananas\nSqueezing niggas dicks {in front of cameras}\n(Light skin Lil' Kim, Chanel grim) One nigga hitting that\n(This the shit that rich niggas dreamt\nRick brother Pazone'll be home, estimate 30 days, brolic arm) Fresh out the cage\n{Do the story seem intriging? When P come home\nWill he have all these niggas mouths bleeding?}\n\n[Chorus 2X: Raekwon]\nThe young black, travel to mix, we open eyes on a disc\nTry to resist, reviving the rich\nAirbrush money when we walk, most highly paid Cheeba hawk\nChecking how he walk, tell a story lord\n\n[Raekwon] (Ghostface Killah) {both}\nWent down like Wednesday, Lounge gave a party at the way\n{Seen armor truck money, everybody pay}\nNiggas in the back watching, everything butter scotch\nKelly ass, bet if they dead it, it's watch\n(Moving with the New Hampshire niggas) Ride them, catering\n(Sleeping with them) {sneaky ass wizzes}\n(Guess who appeared out the blue? Stark Drizzling)\nStood Pazone, laying in the Ac' with two women, how his whip look?\n(The shit look dressy) Bend up vest piece (you know how his vest be)\nLavender bird, two inch beak, parakeet\nName Unique, who knew the 1 to the 40 in a week\n12 o'clock on the diz-nock, we went to check the moon out\n{Vibes I'm getting, I have to clear the room out}\nTook his hat off, spiral (Used to be my idol)\n{Thirty inch telephone} (Lip to his eyeball)\nPlaying a Bob mood, just answer out his pocket\n{Real heavy} (Like he bought his rings from Liberace)\nHad his parrot with him, Unique, you see these niggas fronting in here?\n(Yo P, they pussy, with one gun in here, the music stop)\n{Bitches drop} Shit jumped off by the bathroom\n{Aiyo, oh shit, that's Sasoon}\n(P jumped up, grabbed his ratchet, felt sorry for him\nFirst shot was ill, clapped his parrot)\nBlew him off son shoulder, so many feathers had the club coughing\n{That's when Pazone lost it!} (He wigged out, crying, spit out\nHe's living like Dead Presidents, real life, he's letting it out)\nIt was a shotty that murdered pop\nGuess who did it? {The slick young bitches on the stock}\n\n[Chorus 2X]", "image": "https://images.genius.com/258ddd2b01af2188dd6ee5363048d09d.820x820x1.jpg"}], "artist": "Raekwon"}