{"songs": [{"title": "Don’t Touch Me", "album": null, "year": null, "lyrics": "This is a national security alert\nGround music\nFlipmode\nAftermath\n\nHere we go!\n\nBack with the most venomous rap\nI be the godfather of the club banger, let me hear you clap\nYou can applause me from the very beginning\nYou can give me a standing ovation while I bang your face in\nWith another banger, now call it a cliff hanger\nWatch me mangle and strangle this whole rap shit, Come On!\n\nYou can see the way I make em act sick from down bottom\nThe way I got em gimme my cash quick, Come On!\nRock on, you better grab on to something\nBecause I'm about to shake shit again to make a black bitch, Come On!\n\nI can hear the shots ring off, my bitches taking everything off\nEach other got em wilding running for cover\nThe King Kong, Big Foot gully with a scully bully of raps\nStill ugly with the money running a trap\nNow they giving me dap\nAs far as I'm concerned in this motherfucker look how I got 'em\nNow they ready to shout\n\nSo, don't touch me nigga, you might burn yourself (Ha)\nDon't touch me nigga, you might burn yourself\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\n\nHere We Go!\n\nNow you see the alcohol spilling\nAnd we got 'em, hands in the ceiling\nYou know we only come to rattle the building\nAnd break it on down just a little once again knowing we holding\nThe bank so let me keep the dice rolling\nAnd keep it traditional the way I keep my money falling\nWhile you slacking on your macking dude we always keep it going\n\nRight to the left, do it to def\nNow watch me come through with a chisel\nAnd make the game sizzle, And I\nPull out the skillet prepare for the cooking\nHow I'm wilding niggas wonder when I'm gonna bring the hook in\nThugs ice grilling every time they get to looking\nGot 'em wilding over seas all the way back to GO BROOKLYN!\n\nNow they ready to spaz, cause we bring the best of the\nShit that shut it down on the regular\nThat's with the, fly 80's nigga that was whipping in a Creseda\nFresher than, most of these niggas killing the rest of them\nVillains that was thinking that they rushing in and busting in\nBut the way we was doing, we was muscling their hustling\n\nSo, don't touch me nigga, you might burn yourself (Ha)\nDon't touch me nigga, you might burn yourself\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\n\nHere we go!\n\nYou don't really want it my dude\nI'm saying most my niggas is rude\nAnd when we come, we eat a nigga food\nBack to the fact of the matter at hand\nFor me to come and control this whole shit, was only part of the plan\nThe other part of the plan, for you to understand\nThat nothing can fuck with the kid, Let me say it again!\n\nThe Broad Back B, Busta Bust back to put out the trash\nAnd just for the record we got it on smash, now\nHow the fuck they even got the audacity\nTo fire marshal come and try to talk about the capacity\nEvery time I'm in the spot I hope you know it has to be\nExtremely packed to shut it down you'll probably cause a tragedy\n\nDon't you know that when I'm in the place I change the mood again\nI be wilding with raunchy bitches and a bunch of hooligans\n\nNow don't get it fucked up just because I flaunt it\nNiggas think that they can test me bring it if you really want it\nSee I be the type to always beat you to the punch faster\nI keep a smile on my face but carry the bush master\n\nSo, don't touch me nigga, you might burn yourself (Ha)\nDon't touch me nigga, you might burn yourself\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\n\nKeep it going!\n\nYou already know I said it word to mother\nShit is so hot you niggas think its cold up in the summer\nShh - calm the noise down lets get a little quiet\nCause the neighbors call the police, they know we cause riots\nAnd they know that we'll have them thinking they dancing with the devil\nWhen they play the music turn the volume to the highest level\n(Breathe in, breathe out, and sigh)\nYou got it right let's keep the bombs going\nLike we lit a stick Of dynamite now you know\nYou need to follow whenever you hear the god spit, Aww shit!\nYou see me nigga back in the cockpit\nI be getting this money I'll give you all a stock tip\nFirst buy a nigga till you see the sweat drop, drip\n\nSo, don't touch me nigga, you might burn yourself (Ha)\nDon't touch me nigga, you might burn yourself\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)\nWe got 'em hot in this bitch, so throw the water on 'em (Hey)", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}