{"songs": [{"title": "Gladiator", "album": "Universal Mind Control", "year": "2008-12-09", "lyrics": "[Pre-Hook: Pharrell & Common]\nNothing, nothing, nothing, nothing\nNothing you could do (straight up)\nThere's nothing you could do (you know the boy is serious)\nThere's nothing you could do\nI don't even know why you wanna play with it\nThere's nothing you could do\n\n[Hook: Common]\nThey say he's a radical, he don't fit the game\nA heart full of glory and a fist of pain\nA couple of battle scars but shit's the same\nAre you not entertained?\nSo all the onlookers and the bystanders\nWait 'til intermission, run, buy your cameras\nRecord the moment, cause it'll be platinum\nAnd you could say you seen Common rock the stadium\nThe gladiator\n\n[Verse 1: Common]\nI was told by a wise old to come from the heart\nThough I might've did \"The Light\", I don't run from the dark\nThe dark knight to spark mics and start fights\nThe warrior archetype like Kimbo Slice\nIt's strength in the beard, am I loved or feared?\nA beast amongst boys, like Paul I'm revered\nVroof, vroof-vroof vroof-vroof-vroof, well\nLike Jacob Jewel, I keep clientele\nYou frail on the mic like you might break a nail\nI might smoke a joint but I won't take the L\nI knew a fat broad that broke the scale\nStill touched down cause I was off Martell\nHad dreams of breaking Mike Vick out of jail\nTook the underground rail to the NFL\nI rebel in YSL\nHere to leave a trail like Nelson Mandel'\n\n[Pre-Hook: Pharrell & Common]\nThere's nothing you could do\nMan, why you wanna go against me?\nThere's nothing you could do (you've seen where I'm from)\nThere's nothing you could do (you've seen what I do)\nThere's nothing you could do\n\n[Hook: Common]\nThey say he's a radical, he don't fit the game\nA heart full of glory and a fist of pain\nA couple of battle scars but shit's the same\nAre you not entertained?\nSo all the onlookers and the bystanders\nWait 'til intermission, run, buy your cameras\nRecord the moment, cause it'll be platinum\nAnd you could say you seen Common rock the stadium\nThe gladiator\n\n[Verse 2: Common]\nMy words is the sword, my skill is the shield\nMy life is the style, I stay dressed to kill\nA legend like Will, Smith with the steel\nI could save the world when shit get for real\nThe skinny George Foreman, all in your grill\nMy rhyme style is blind, it's all in the feel\nTouch it and watch the blood fall with the steel\nThe weak raps you wrote you could call that your will\nMy drive (VROOM!) is how I stay the livest\nYour guys got you gassed, my flow is a hybrid\nCrashed I survived it, gashes over eyelids\nYou easy to take out cause you hot garbage\nI'm amped like wattage—the truth, nigga, honest\nAny moment opponents drop out like college\nKneel and pay homage to the rap Ziggy Stardust\nStadium, hands in the air, fists balled up\n\n[Hook: Pharrell & Common]\nThere's nothing you could do (you know what it is)\nThere's nothing you could do (the boy is raw)\nThere's nothing you could do (so who next?)\nThere's nothing you could do\n\n[Hook: Common]\nThey say he's a radical, he don't fit the game\nA heart full of glory and a fist of pain\nA couple of battle scars but shit's the same\nAre you not entertained?\nSo all the onlookers and the bystanders\nWait 'til intermission, run, buy your cameras\nRecord the moment, cause it'll be platinum\nAnd you could say you seen Common rock the stadium\nThe gladiator\n\n[Verse 3: Common]\nFeet in the dirt, blood on the shirt\nScars over bars, symbols of the work\nTight clothes the armor, center of the drama\nDefeat your whole army like this is Sparta\nSo don't violate or you'll get violated\nSome of you model bitches is so overrated\nDon't mean to underrate it but damn it, I made it\nIn the water I waded, on the corner I painted\nDraw blood like we related\nMCs get de-decapitated\nSyncopated is the style that I fight with, write with\nMr. Excitement, change your face up like a white chick\nThen light shit, up like a dread with the herbs\nGet sex in the city and head in the burbs\nThese are the words of a radical\nThe crowd applaud, I'm bowed, I'm proud\nTo be the gladiator\n\n[Pre-Hook: Pharrell & Common]\nThere's nothing you could do\nHow could you even question this?\nThere's nothing you could do\nThere's nothing you could do (now you know)\nThere's nothing you could do (the future)\n\n[Hook: Common]\nThey say he's a radical, he don't fit the game\nA heart full of glory and a fist of pain\nA couple of battle scars but shit's the same\nAre you not entertained?\nSo all the onlookers and the bystanders\nWait 'til intermission, run, buy your cameras\nRecord the moment, cause it'll be platinum\nAnd you could say you seen Common rock the stadium\nThe gladiator", "image": "https://images.genius.com/5e77fbc81fc58bc396f33872fc1ec855.1000x1000x1.jpg"}], "artist": "Common"}