{"songs": [{"title": "My House", "album": "Finally Famous (Super Deluxe Edition)", "year": "2011-06-28", "lyrics": "[Hook]\nShit, whose house is this?\nLaughin' so hard my tongue is out and shit\nI stack dead Prez, mouth to mouth that shit\nThey told me a nigga wouldn't amount to shit\nNigga, whose house is this?\nLaughin' so hard my tongue is out and shit\nI stack dead Prez, mouth to mouth that shit\nBut you don't know nothin' about that, shit\n\n[Verse 1]\nYellin', whose house is this? Huh\nBitch, Do I even gotta ask now?\nWho the fuck are you? Do you even got you a pass?\nI don't know why you cuffin' yo girl, she ain't even got her no ass\nMiddle fingers to all of the nonbelievers\nNot only did I beat the odds, I also got even\nTook a spot up on the throne, I see myself see myself\nSaid it twice cause history repeats itself 'peats itself\nMan I can't even lie, I be high I be high\nMother fuck drinkin' and drivin', I'd rather get high and fly\nI'm out of here, like outer wear\nWe are not the same, you are not a player\nMy house is somewhere off in the woods, girls in my bed like I'm papa bear\nThey say hard work pays off, wrong it pays good as hell\nYou the man huh? Sorry I couldn't tell\nClaimin' that they BIG, well I really can't lie\nFrom the top they all look the same size\n\n[Hook]\n\n[Verse 2]\nI start my mornin' with the paper\nBitch I'm rich free press, hundreds on all the pages\nAnd you can't slow me down, I'm sorry there's no delay\nMe and my committee run the city, you just tryin' to join the relay\nLeader of the new school, reportin' from the PA\nThese niggas call me cuz but I don't know why, cause we can't relate\nI got yo sister doin' thangs on camera I can't replay\nBut she's a waste of time, fuck I could've had a V8\nI turn thousands to milli's, it's time to renovate the ceiling\nI'm turning houses to buildings, hustle while you out here chilling\nWhat's the wordy I'm certainly getting rich in a hurry\nI swear I fuck 'til I'm tired, I'm getting high 'til it's blurry\nI'm from the dirty glove, where hammers turn crews into jurys\nThey'll make you sit down, but as long as you with me ain't no worries\nMan I'm puttin' on for my crew, never for these hoes\nI'm puttin' on for my city, she puttin' on her clothes\n\n[Hook]", "image": "https://images.rapgenius.com/2efe71ba2f413e6e4aa04e8d84802904.500x500x1.jpg"}], "artist": "Big Sean"}