{"songs": [{"title": "Live From Irving Plaza NY", "album": "Get Well Soon...", "year": null, "lyrics": "Intro: Talib Kweli:\n\nALRIGHT\n\nIn case y'all don't know, he did H to the Izzo, he did Takeover, he did Guess Who's Back, he did my joint, Good to You, he did [?], give it up for my nigga Kanye West, you know what I'm saying?\n\nNow Kanye, y'all also don't know my man got skills, he's a rapper, he's [?] projects, so can my man bust a verse?\n\nWhat's up Kanye what's up?\n\nVerse 1: Kanye West\n\nWoooooo\n\nMic check, mic check\n\nGolly, more of that bullshit ice rap\nI got to 'pologize to Mos and Kweli (probably)\nBut is it cool to rap about gold\nIf I told the world I copped it from Ghana and Mali? (Mali!)\nFirst nigga with a Benz and a backpack\nIce chain, Carti lens, and a knapsack\nAlways said if I rapped I'd say somethin' significant\nBut now I'm rappin' 'bout money, hoes, and rims again\nAnd it's still about the Benjamins\nBig faced hundreds and whatever other synonyms\nStrippers named Cinnamon\nMore chips than Pentium\nWhat'cha gon' buy next? Whatever new trend it is\nI'm tryin' to spend my stacks\nAnd I'm so broke I look back like \"Damn, was I on crack?\"\nI mean two platinum chains, was I on that?\nWhat the hell was wrong with me dog?\nSing along with me y'all\n\nHook:  Kanye West / Talib Kweli\n\nTalib Kweli:\n\nNew York City here! New York City here!\n\nKanye West:\n\nIts like, guess who's bizzack, back on the track with the blow\nKanye to-the, representing his gold\nI guess who's come back, better than I suppose\nHeard those beats, shit it's all I know\nGuess who's bizzack, [?]\nThe Roc' is definitely in the building\nBack on the track, yeah, yeah, yeah\n\nVerse 2: Talib Kweli\n\nIt's time to change up, my lyrics rip ya frame up\nAskin' if I'm nice like fuckin' with a chick\nWho don't give head - that's a no-brainer\nNiggas back bangers you don't even know the names of\nI'mma bout to meet my quota, you about to meet ya Saviour\nYou wack nigga, you about to get shot\nFuck with Talib Kweli, that's how you get got!\nNot that I'm wildin' or even promote violence\nIt's just you're fuckin' up my high, can a nigga smoke in silence?!\nDamn, New York City in the house!\nTalib Kweli gotta tell you what it's about\nBecause my man Kanye from the Chi' will say hi\nWave your hands from side to side\nMos Def, Kweli, [?]\n[?]\nI got my man, he represent the [?] projects\n[?]\n\nVerse 3: Mos Def\n\nI say guess who's bizzack, Kweli, Kanye, and Mos\nPunk niggas getting way too close\n[?] Broadway doing them all day\nNiggas [?] but don't take it the wrong way\n[?]\nDoing Iving Plaza, causing disaster\nYou bring the time but we bring the prescription\nPick up your ears so you all could listen\n[?]\n\nOutro: Kanye West\n\nKilling y'all niggas on this lyrical shit\nMayonnaise colored Benz, I push miracle whips", "image": "https://images.genius.com/9368e74d31ea216d410c02def5b8ec60.500x500x1.jpg"}], "artist": "Kanye West"}