{"songs": [{"title": "Phenom", "album": "Napalm", "year": "2010-05-25", "lyrics": "[Intro: Kurupt {Xzibit}]\n'Sup?\nOnce in the lifetime... (haha!)\nKurupt Young Gotti! (you can place that!) {beat starts}\nYEAH!\nIt's going down. (AOOWW, AOOWW!)\nYeah!\nX-to-the-Z, Xzibit! {YEAH!}\nRidin' on... {hahahaha!}\nROUGH!\nWest, West! (yeah, yeah!)\nWestCoast is definitely in the motherfuckeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeer! (YEAH!)\nRide on my nigga!\n\n[Xzibit {screwed voice}:]\nIntroducin' the X-Man phenomenal. - X-Files, the chronicle!\nAerostatical, nautical, magnificent beast!\nXzibit stick to the logic. You can be bullish and rollick\nYo' ass will still get demolished, polished and keeping' a mulish\nMy niggas eat like piranhas, we party stupid, retarded!\nMost niggas jaded and guarded cause they not popular product\nThis ain't no Gucci or Prada, this is a topless Impala\nNorth Hollywood body armor for when they come with the drama. {For when they come with the drama.}\nSo I continue the saga!\nMove out the path of the lava, move in position and conquer!\nYou have created a monster. - Wake up and call out the culprit!\nI never weaken or soften, might catch me weezin' and coughin'\nBecause I blaze very often, I need to knock this shit off of shit (shiiiit!)\nI got problems, my nigga, and they get bigger and bigger\nYou cannot solve with a trigger, this is a pivotal moment!\nThis is my time of atoning, this is my world and I own it!\nSo come and take if you want it! - Please God forgive me for sinnin'\nWinnin', and makin' a killin' witness revenge of the villains\nSexual healin' from women, I bust a nut to their ceilin'\nI crash a plane in their buildin'. - But now I'm \"Married With Children\"!\nKatal and balance the millions, I'm in another direction\nLife bless is taking it's blessin's, you need to hear my confession!\nForever walk with a weapon, I live and die like a soldier\n{I live and die like a soldier!} - C'mon let's take this shit over!\n\n[Interlude: 40Glocc]\nAaaayyooooooooooooooooooooooooo!\nBig Bad 4-0!\nHahahahah! (Aaaayyooooooooooooooooooooooooo!)\nA.K.A. 40Glocc!\nY'aahhh!\nLive Los Scandalous, nigga! (Aaaayyooooooooooooooooooooooooo!)\nHahahahahah!\nX-to-the-mothafuckin'-Z\nBEEYATCH! (Aaaayyooooooooooooooooooooooooo!)\nYup, yup, yoooo!\nSwallow back!\nZooLife!\n\n[Xzibit {screwed voice}:]\nMake patches and master my master piece, niggas have the audacity\nTryna adapt to capacities of your highness, your majesty!\nWhat the fuck is you askin' me? - With my accurate accuracy\nImmaculate faculties with a nation in back of me\nI see promising situations, evolve into tragedies\nI just hustle and hustle because it comes to me naturally\nI'm a Buffalo soldier, clappin' you back to Jehovah\nC'mon let's take this shit over! {C'mon let's take this shit over.}\nI'm a super nova, eclipse on your current events\nThis ain't no novelty spittin' hotter than barbeque bits\nLorena Bobbit, you dicks! - Trigger's still good in my grip!\nYou showin' off for the cameras while I just stick to the script\nPeople get Hollywood quick. - When people thinkin' you sinkin'\nI got everybody thinkin' I got a problem with drinkin'!\nI'm just enjoyin' my weekends so stay the fuck out my business!\nI roll with serial killers. {We fuckin' serial killers!} - C'mon!\n\n[Outro: Kurupt]\nYeah!\nWe in the mothafucker!\nKurupt Young Gotti!\nOoh!\nOoh, y'all thought it was a game?\nWest, West!\nPush my nigga, push!\nFUCK 'EM!\nYeeah!\nWe push the farline over here, boy!\nNo games!\nX-to-the-Z, Xzibit!\nShoot off!\nShoot off, nigga! [beat fades out]", "image": "https://images.genius.com/727e047579481405310e18c83d10416c.1000x1000x1.jpg"}], "artist": "Xzibit"}