{"songs": [{"title": "Helluva Night", "album": "#IDGAF", "year": "2013-08-27", "lyrics": "[Intro]\nI feel fantastic!\nI wanna fuck something!\n(It's about to be a hell of a night) x3\n\n[Verse 1]\nLuda!\nRollin' down the highway\nNothin' for me to do but smoke up if it's a Friday\nBreak it down, spread it out, nigga, roll up!\nAnd let's see what they about, call them hoes up\nLudacris, man these bitches want my last name\nSip slow but I'm drivin' all in the fast lane\nGet the fuck up out my way, man, move bitch!\nAnd quit yappin' if you never wanna do shit\nI'm all about it, get your mind right\nBeen makin' money since before I was in the limelight\nGrind right... Bitch what's uuup?\nTop down, but I feel like gettin' fucked uuuu-u-u-u-up\nI get high but the bass low\nA real nigga, what your woman wanna shake for\nWhen you shake it for a baller, better shake it right\n'Cuz it's about to be a hell of a night\n\n[Hook]\nIt's about to be a hell of a night x4\nI'm fucked up! (x4)\nI'm high as hell! (x4)\nIt's about to be a hell of a night\n\n[Verse 2]\nClub packed, and women gettin' they drink on\nJust looking for a reason to get they freak on\nCatch me up in the VIP and it's roped off (Why?)\nTO keep raggedy ass hoes off\nAnd I'm 'bout to have a smoke-off\nRich nigga, but I'm trying to get broke off\nTurn it up as I make the beat break down\nAss up... FACE DOWN!\nYeah, that's still the best way to get it\nDown the middle, that's the best way to split it\nI'm talkin' money, Disturbing Tha Peace racked up\nOne too many American black cards stacked uuuu-u-u-up\nBacked up and it's on\nDon't get beat down to the song\nI see these hatin' ass niggas wanna fight\nWell it's about to be a hell of a night\n\n[Hook]\n\n[Verse 3]\nI'm always looking for trouble to get into\nTell your girlfriend's friends, bring friends too\nWhat you drinkin'? I got it, I pour it all up\nSouthside, my partners they throw it all up\nI don't want a menage, so bitch, let go\nI'm tryin'a get three women, play Connect 4\nCongratulations, you made it into the Top 5\nYour mouth helped me push the Bentley into Mach 5\nShe got me speedin' in the red zone\nOr as Luda like to call it, it's the Head Zone\nHeads up! A bread winner, the bread's up\nSo make a peace sign baby, put your legs up\nIs it really that good to ya?\nDo you like it when a nigga talk hood to ya?\nDo you like a lil' scratch, lil' bite?\nWell, it's about to be a hell of a night\n\n[Hook]", "image": "https://images.genius.com/bec624b354fbecb0f16629f888e48c73.1000x1000x1.jpg"}], "artist": "Ludacris"}