{"songs": [{"title": "Paranoia", "album": "Independent’s Day", "year": "2005-06-28", "lyrics": "Call it Paranoia. Yea\nEvery day is war. Every day, niggas is gon' hate\nGotta move\n\n[Royce Da 5'9\"]\nI'm a walking target\nI'm so far from soft, I'm probably close to the hardest\nNigga you ever saw, been never thug, never had a problem\nAnd the shit he never starts, sickest artist there ever was\nNigga found dead in his house, don't know who did it\nYea, you bet it was me, niggas die at the pavement\nI'm wavin a nine out of the window and blazin\nIs your house shakin\nWho's inside nigga, it's funeral time nigga\nThey die from stray hits, pride wasted\nCry your face, I ain't your suit and your tie\nNow look what you made us\nLook at the witnesses, all of them look shakin\nAnd alls they seen was the back of a green car with the plate flipped\nLook at the news, I did it without puttin a hit out own\nYou homies in chrome, watch that nigga\n\n[Hook: Royce]\nI got my back, because it's my gat\nAnd my mouth that *Started the War*\nLookin around me, got a gun on my lap\nWhile I'm drivin, taking the back routs *Home*\nIf your headlights is in my rearview\nFor longer than three lights, and I don't know you\nI'mma pull over, And I might shoot you\nYou should go around me, and don't look at me\n'Till after you pass me, cuz I might blast you nigga *I'm at war*\nI'm Paranoid, always on point\nAlways holding nigga, always sober. Call it paranoia\n\n[LA the Darkman]\nIn your bushes, on the side of your house\nWaitin to smoke you when come in from hangin out\nFriday night, perfect, I timed it just right\nI know you at the club cuz your car is nowhere in sight\nI'm like the DC sniper, Mr. Malvo\nStrategically precise when I squeeze the cali-co\nYou look like a asshole, full of shit\nNiggas sure to get hit, when my fo-fo spit\nBlack shirt, black jeans, black boots, black whip\nBlack mask, paif of black leather gloves for my grip\nI don't need no print, a killer with a plan\nMakin sure I dont get, gunpowder on my hands\nAll drama I'mma end it, murder game splended\nLeavin all crews for the fucker in forensics\nI got, two dependants, I gotta make it home\nClean get-away, two bullets through your dome\nIs locked nigga\n\n[Hook] - La the Darkman\n\n[Royce Da 5'9\" - spoken word]\nAnd that's just how the story goes y'all\nAny nigga where I'm from already knows\nFunny, my homie cuz said niggas gon' bring you a bowl of soup when you sick\nBut if you die, then gonna love you later\nThink you a fuckin statue or some shit\nGod bless these streets, God bless these streets right now\nI'mma just be doing my thing so maybe, you know, I could show you how\nDon't come lookin for trouble, cuz you just might find it\nDon't stand too close to me, I'm always on point, never blinded", "image": "https://images.genius.com/5296587baa4eefd1b2b1ef7daff66f78.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}