{"songs": [{"title": "ROSE TINTED CHEEKS", "album": null, "year": "2018-04-18", "lyrics": "[Intro]\nHello, no one is available to take your call\nPlease leave a message after the tone\nBeep\n\n[Verse 1]\nI never had the courage to tell you I adore you\nI did it in a song, I was too afraid to call you\nI know, I know, I'm sorry, I know I'm annoyin'\nI just want your attention\nEver since I saw you, knew nothin' was important\nYour gravity is too strong and it's fuckin' up my orbit\nContact avoided by the time I record this\nI just want you to listen\n\n[Pre-Chorus]\nEverytime I see you, yeah, you brighten up my day\nYou're the cashmere to my cotton and I wished you felt the same\nMore options in the alphabet, I know I'll be okay-kay-kay\nNo, I won't...\n\n[Chorus]\n'Cause it's them rose tinted cheeks (cheeks, cheeks)\nIt's them rose tinted cheeks (cheeks, cheeks, cheeks, cheeks)\nAnd it's them rose tinted cheeks (cheeks, cheeks, cheeks, cheeks)\nIt's them rose tinted cheeks (cheeks, cheeks, cheeks, cheeks)\n\n[Verse 2]\nThey Black Flag we AF\nWe BF as AF\nBut they won't get that\nThat's that 20 Century Women reference\nYou so hard to get like intricate metaphors\nCompanies? I own four\nBut all I want is yours\nHit the 'plex and catch a band (ooh)\nSushi spot I recommend (ooh)\nFloat around hittin' wheelies, leg or engine-based, it all depends\nEither one is cool to me\nAnd you're way too cool for me\nI'ma freeze to death tryna keep up\nThirsty I am, I may need three cups, what's up?\n\n[Pre-Chorus]\nEverytime I see you, yeah, you brighten up my day\nYou're the cashmere to my cotton and I wished you felt the same\nMore options in the alphabet, I know I'll be okay-kay-kay\n\n[Chorus]\nIt's them rose tinted cheeks (cheeks, cheeks, cheeks, cheeks)\nIt's them rose tinted cheeks (cheeks, cheeks, cheeks, cheeks)\nAnd it's them rose tinted cheeks (cheeks, cheeks, cheeks, cheeks)\nIt's them rose tinted cheeks, uh\n\n[Verse 3]\nLa-la-la, la-la-la, la-la-la\nEye contact, eye contact, eye contact, yeah\nSpeedin' down the 5 in my newest ride\nYou was kinda high, speakers mild high\nTrack 10 track 10, dirt bike afternoons\nAs long as pale skin's near, I didn't have to leave the room\nSwitch gears\nRoamed around fell in love (fell in love)\nBroke my leg, got stuck, what the fuck?\nHit my head, wait, I wish you would fall in too, I said\nI wish you would fall in and snap them legs\nCause I'ma be stuck here until I'm dead and gone\n\n[Bridge]\nLa-la-la, la-la-la, uh\nLa-la-la, la-la-la\nYeah\nLa-la-la, la-la-la\nLa-la-la, la-la-la\n\n[Outro]\nI remember when we first met\nMy eyes, like jeans too tight, I couldn't take 'em off you\nYou're precious metal I was a magnet just lookin'\nI've been searching for somethin'\nBut didn't know what I was looking for\nThen you popped and it became so clear\nLike that water up north, so clear\nGot me sayin'\nAlright, alright\nAnd truthfully now\nI'm intimidated by your existence\nFlustered because of your presence and\nYour absence leaves me, leaves me in a state of confusion... I mean... (uh huh, alright)\nI really can't function (ahhh)\nLa-la-la-la (uh-huh)\nI can't explain it (uh-huh)\nI'm aware enough to know this is just a temporary pool of emotion, shit (uh-huh, alright)\nBut since I'm here, I might as well drown, so\nPlease don't save me (uh-huh)\nHa ha ha, woo!\nYeah, alright (uh huh, alright)", "image": "https://images.genius.com/fefb6be939bcd3d05e9ec5b0edc22da1.1000x1000x1.png"}], "artist": "Tyler, The Creator"}