{"songs": [{"title": "Round Here", "album": null, "year": null, "lyrics": "[50 Cent]\n\nIt ain't good to good in front of niggas in the hood, right\nIt ain't good to good in front of niggas in the hood, right\nEverybody know that\n\n[Verse 1]\n\nDoin' good in front of niggas in the hood cause problems\nTrey-eights, trey-pounds and .44's solve 'em\nI hate when hoes get on some loudmouth shit\nYour man gangsta? Me too\nGo on and get 'em bitch\nI just bought new toast to spit\nNext nigga gettin gully gettin' laid out quick\nWhere ever rich touchin' niggas is gettin hurt\nCause a broke nigga always down to put it in work\nDon't run up on me, I don't know you nigga\nSo what you bought my cd, I don't owe you nigga\nI know you love the way the goutti beat bump\nGot you license plate rattlin' all over your trunk\nI confuse these chumps with my style, yo\nI'm from Queens but I'm mother fuckin BK hard\nI sound like I move bricks uptown\nOr like a thug from the Bronx who stays with a 4-pound\nShook nigga (shook nigga, shook nigga)\nI'm a Guiness Book nigga\n\n[Hook 2x]\n\nWe don't play that pussy shit 'round here\nYou can get your fuckin wig split down here\nDon't be reppin' where you come from too much around here\nYou can get your fuckin cap filt\n\nQueens, nigga!\nBrooklyn\n\n[Verse 2]\n\nIf I can't get my gun in the club, why whould I come in the club?\nSo niggas I done stuck up could cut me he fuck up, nah\nI'm outside to jump off in a Benz jeep\n4 deep strapped with all kinds of heat\nNiggas think they want beef\nThey don't want beef\nThey find out that somebody they love (is) layin' in the street\nWhen you rap, you keep it gangsta dog it's all good\nJust don't go poppin that shyit in the wrong hood\nWhere I'm from the young boy'll come and try ya nigga\nShell will make ya feel like your on fire nigga\nIf you thinkin we thirsty cuz, we right\nWe lookin at your watch and chain like that's an S-type\nPromoter sayin \"don't play 50 in the club\"\nLast time it came nigga tore the shyt up (what)\nI don't where you from and I don't care\nBut nigga we don't play that pussy shit round here\n\n[Hook 2x]\n\nThe only Spanish I know is \"coño, cállate la boca puta\",\n\"no inglés, no inglés\" motherfuckers will shoot ya'\nThe Latin Kings don't like me, I don't care\nWe don't talk that \"mira, mira\" bullshit around here\nMan, I done did so much dirt in the hood\nNiggas heard I got shot they was all sayin 'good'. (\"Good for him\")\nFuck ya'll, ya' ain't got to like me\nI'm gettin knocked, ya'll nigga ain't got to write me\nI'm on the same bullshit I been on\nIt's the same bullshit ya' niggas need to get on\nY'all shit sound too commercial\nCome cruisin' through the hood mother fuckers will hurt you\nYou should know when and when not to flash jewels\nCause niggas will run up on y'all fools and flash you\nThey want your money, the watch, and you tennis shoes\n\"I ain't gotta tell ya not to move\nYa know the rules!\"\n\n[Hook 1x]", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}