{"songs": [{"title": "Ricky Ticky Toc", "album": "Encore", "year": "2004-11-12", "lyrics": "[Eminem]\nOnce you call my name out things will never be the same\nThey should've never let us get our foot in this game\n\nEver since I was introduced to rap music\nI been missing a screw like Bishop in Juice, I could lose it\nAt any moment, those who know me know it\nSo they probably told to go with the flow, just so that\nI don't explode and, have another episode\nWhere I let it go as far as the one with Benzino did\nI'm waiting for that next beef, I'm cocked, locked and loaded\nI'm ready to go so bad\nI'm going bananas, my dick's so hard Anna Nicole could\nUse it to fucking pole vault with\nOh shit! I mean when she was still bloated\nBefore they cut her stomach open and lypo'd it\nAnybody I throw flames at, gets a name\nIt's a game, 'cause they know that they don't spit the same\nIt's a shame, what people do for ten minutes of fame\nEveryday it's the same thing\nPeople in this game try to buddy-buddy us\nJust to get close enough to study us\nEverybody just wants to have something to do with that\nThey all trying get that stamp\nThey after that Shady/Aftermath money\nIt's like a monopoly\nThey probably just now finally understand \"How to Rob\" fully\n50 Cent was like a fucking jackpot for me\nAnd Dre, it's like we hit the fucking lottery\nAnd the damn slot machine at the same time as each other\nWhy the fuck you think we ride like we brothers?\nWhen we rhyme with each other, in time we discovered\nThat we had more in common that we thought with each other\nBoth robbed of our mothers, our fathers ain't want us\nWhat was wrong with us, was it our fault?\n'Cause we started thinking God doesn't love us\nTwo odd motherfuckers who just happened to meet at the right time\nWhat a coincidence it is, 'cause when 50 got shot up in Jamaica\nQueens, I still remember the call up at Chung King 'cause\nBig L had just got popped just a month before\nIf 50 lives he's getting dropped from Columbia\nTwo years later me and Doc had to come and uhh\nOperate, that's when he popped up at number one\nAnd we ain't never gonna stop if you wondering\nEven if I'm under the gun\nYou ain't got to agree all the time with me or see eye to eye\nThere'll always be animosity between you and I\nBut see the difference is, if it is, I could give a shit\nI'm still gonna conduct motherfucking business as usual\nEgos aside 'fore I bruise 'em all\nSwallow your pride 'fore I step on it with shoes you call\nNikes, Earthlings, how do you like these?\nYou gotta love 'em, look at the bottom of 'em, they're like cleats\nStomping, I been romping\nSince Tim Dog was, hollering, \"Fuck Compton\"\nI was whiling, freestyling\nBack when, they were still making, Maxell casettes\nI wasn't even rap's Elvis yet, that tells us that\nAny doubts in your head that seals the shit\nRicky ticky toc, ticky ticky toc\nStill with the Diggy Diggy Doc, Diggy Diggy Doc\nAnd ya don't stop", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}