{"songs": [{"title": "Fuck with me", "album": "Trap House III", "year": "2013-05-21", "lyrics": "[Verse 1]\nI get it’s the clothes I'm wearing (wearin')\nBaby girl she keep starin'(starin)\nAnd I'm looking like I've been getting money all day\nYour boyfriend run errands (errands)\nI don’t want to meet your parents (Nope)\nShe angry I'm not carin' (nah)\nToo high to greet your mom\nDo your daddy know what your wearin'? (yeah)\nI just can't hold all this gualla (gualla)\nGotta give some to my partna (holy)\nGot a stash bag for these hunneds\nBut I Gotta sneak in with this choppa (bow)\nDon’t give a damn about coppers\nLocal police can't stop us (what)\nAll my hoes say I'm thoughtful\nBut my attitude is I'm awful (so)\nThat’s your girlfriend for life\nBut the next hour I bought her\nLook at all that shit I bought her\nShe my homie we partnas\nShe's the realest bitch, a shopper (shopper)\nLike a high fashion model (gucci)\nKnow you broke so she don’t bother\nWhen she call me tell her I got her (got her!)\n\n[Hook]\nUh she fuck with me, she fuck with me (I'd fuck with me)\nTo tell the truth if I was her I'd fuck with me (I'd fuck with me)\nA body like that she can't fuck for free (damn)\nAnd that ass so fat you gotta have some cheese (uh)\nDo you agree, do you agree? (yes i agree)\nShe know everything one thousand when she fuck with me (thousand)\nDo you agree, (I agree) do you agree?\nShe's so fine a married man will tell his wife to leave\n\n[Bridge]\nGo! Go!\n\n[Verse 2]\nShe so fine married man and tell his wife to dip (dip)\nMomma broke the news and told the kids that daddy slipped\nBut I don’t even know if dad know what he dealin' with (whatchu getting into)\nIt costs a grip for these 2012 relationships\nRed bottoms, gold bottles\nWhere she go that bread follows (go)\nHad a boyfriend but the feds got em\nThey ball players we bread partna\nI can't lie she got a big posse\nNext day she forgot about ya\nStop before she get the Audi out\nShe's so busy about ya suck the engine out ya\nHer home girl a trap star\nCould track a bitch like Hershel Walker\nAin't Usher baby its Gucci baby\nNo moonwalker I'm a smooth talker\nYou were dead fine when I first caught ya\nFell off so I ain't thought ya\nGod shames how you looking at me\nSo I seen you girl but I ain't saw ya\n\n[Hook]\nUh she fuck with me, she fuck with me (I'd fuck with me)\nTo tell the truth if I was her I'd fuck with me (I'd fuck with me)\nA body like that she can't fuck for free (damn)\nAnd that ass so fat you gotta have some cheese (uh)\nDo you agree, do you agree? (yes i agree)\nShe know everything one thousand when she fuck with me (thousand)\nDo you agree, (I agree) do you agree?\nShe's so fine a married man will tell his wife to leave\n\n[Outro]\nGo! Go!", "image": "https://images.genius.com/2d6a6af130abeb84aebd2824e7c3ef8a.500x500x1.jpg"}], "artist": "Gucci Mane"}