{"songs": [{"title": "I Don’t Kare", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "Give it to me, yo yo give it to me\nYo, give it to me.. give it to me\nBitch give it to me.. give it to me\nNigga give me that cash, bitch give it to me\nBitch give it to me, or I'll smack the shit out you\nGive it to me.. yo yo yo yo yo!\nGive it to me..\nYo, yo yo yo, yo, yo check it\n\nYo I'm too old for these young whippersnappers out here\nI'm a legend, you should be poppin corks to my beer\nWhen I appear, full gear, down from the rear\nSliced so quick, you thought Doc -- whispered in your ear\nYeah, there's too many MC's, but not enough MC's\nAre raw like that liquid that you pour on mint leaves\nLook around the premises, spot blemishes\nCall me Doc O-Dog, more Menace than Dennis\nIt's him in this, the raunchy shit I prefer\nSo every word be hard to turn when you stir\nMy grill, my balls, my jaws, stretch twelve floors\nVacate your college dorm halls\nI can stand still and ricochet off the walls\nThe gun sparks yourself cause your pee ate the stall\nWho Shot J.R.? I did, right in the melon\nSo I could own a ranch and start fuckin Sue Ellen!\nI do murders that's hard to solve through forensic\nAny class of hash able to burn I bent it\nYou push a 6 while I push a rented Tempest\nRockin, ho hoppin, bumpin Lil' Kim shit!\n\nAiyyo, niggas poppin shit Red - \"I Don't Care\"\nBitches say you don't got money - \"I Don't Care\"\nYo niggas say he nicer than you - \"I Don't Care\"\n\"I'm Knockin Somebody Right the Fuck Out\" (Milk - \"I don't care!\")\n\nHe got a big icy chain - \"I Don't Care\"\nHe got a Benz and a Range - \"I Don't Care\"\nHis records get mad airplay - \"I Don't Care\"\n\"I'm Knockin Somebody Right the Fuck Out\" (Milk - \"I don't care!\")\n\nYo yo, fuck all you radio that wanna play clean singles\nI cleaned mine for years and still ain't hit a million (WHY??!?!)\nI get the buddha heads buggin, shit\nI should be four mil' and better for that shit I'm Unpluggin\nDoc rocked every corridor in Florida\nWatch the formula pour sucka absorb it up\nAnd while you foamin up from the two in your Nautica\nI orchestrate the orchestra to Arkestra\nNever trust no bitch, map your click\nShe ain't with it, Call Tyrone to pack her shit\nFunk Doc, Goldeneye, Double-Oh agent\nI be in court more than them dollar cap Haitians\nLick a shot, BLAOW, think the Doc is goin pop?\nEat a cock, BLAOW, ready for real hip-hop to\nRock you block, BLAOW, all chicks I turn em out\nSend they boyfriends back home, takin the garbage out\nHa ha, yo, I'mma sewer rat the tracks\nWith gats bigger than Will Smith gat in Men in Black\nAnd if it's Friday, you better double your lap\nI hit you on the floor sayin, \"My neck and my back!\"\nYo, let's settle it out of court for ten dollars smoke\nTwo-fifty in Jawbreakers, dollar in envelopes\nYo, how tight are you? -- Tighter than a Federal jail\nHow High? -- You better check XXL!\n\nYo niggas say you ain't shit - \"I Don't Kare\"\nYo bitches say you broke as fuck - \"I Don't Kare\"\nNiggas say he better than you - \"I Don't Kare\"\n\"I'm Knockin Somebody Right the Fuck Out\" (Milk - \"I don't care!\")\n\nYo yo, he got a lot of fuckin ice - \"I Don't Kare\"\nYo, he got a Benz and a Range - \"I Don't Kare\"\nHe get forty spins a day! - \"I Don't Kare\"\n\"I'm Knockin Somebody Right the Fuck Out\" (Milk - \"I don't care!\")\n\n\"I Don't Kare\"\n\"I'm Knockin Somebody Right the Fuck Out\" (Milk - \"I don't care!\")\n\"I Don't Kare\"\n\"I'm Knockin Somebody Right the Fuck Out\" (Milk - \"I don't care!\")", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}