{"songs": [{"title": "Rockabye", "album": "Something Else", "year": "2013-07-30", "lyrics": "[Intro]\n- Hey, hey Mr. Big, how you doing, man? Thanks so much for having me here to your house\n- Welcome to my home\n- You have a beautiful home, man, this is, this is wonderful\n- Thank you, I never invite anyone to my home, but this is very special sign here\n- No, I'm honored, man, I'm really honored, thank you so much\n- But before we get started, you mind if we just chill out here, it's a beautiful night, can just relax?\n- No, I don't, I don't mind it all, man, let's just chill\n- Here, sit right here, take a sit\n- Oh, okay\n- Yeah\n- Hey, this is nice\n- Here, have a drink\n- What's this?\n- Oh... it's just something to relax you, go ahead\n- Oh, okay\n- Gives you swagger\n- Uhm, feels good\n- You need that swagger to be big?\n- Yeah\n- I want you just to relax\n- Huh-uh\n- Go to sleep\n- Yeah\n- You will all be paid to be...\n\n[Hook: Ben-G Da Prince of Soul]\n(Rock, rock) rockabye (rock, rock) rockabye\n(Stop, stop) stop, you won't play me\n(Not, not) not a guy (hot, hot) hot as I\n(Rock, rock) rockabye, baby\n(Go to sleep, go-go-go to sleep) you make me go\n(Go to sleep, go to sleep) oh, you make me go\n(Go to sleep, go-go-go to sleep) you make me go\n(Go to sleep) rockabye, baby\n\n[Verse 1: Tech N9ne]\n(THERAFLU)\nThat's what it be feelin like when they bear you through\nEvery stereo radio, and they swear you true\nBut the dopey delivery is unbearable\nDrink (CARIBOU)\nGotta grab your nads, you in the building\nRip it 'til you blast, they ass, up in the ceiling\nLook a lot of rappers trash, ain't got the feeling\nNot in your brain, to wanna change, up your energy game\nWhat a shame, you got a name, but you're lyrically lame\nSedated, save it, cause your memory stained\nFrom 'caine you're faded, a beginner remains\nWith fame you're jaded, and you give me your lane\nI came to spray it, and it finna be pain\nWill you please, stop...\nRappin' that crap that you givin' me, mayne?\nI been fiendin' foe, meaning flow\nBut they thought process seemin' slow\nYou ain't gotta rap hella fast for me to like you\nBut wake the fuck if they screamin', bro\nAnd that's good, you're able to get your green and go\nBut a lot of you shouldn't wanna be seen in show\nCause when I go to your set you be leanin' low\n\n[Hook: Ben-G Da Prince of Soul]\n(Rock, rock) rockabye (rock, rock) rockabye\n(Stop, stop) stop, you won't play me\n(Not, not) not a guy (hot, hot) hot as I\n(Rock, rock) rockabye, baby\n(Go to sleep, go-go-go to sleep) you make me go\n(Go to sleep, go to sleep) oh, you make me go\n(Go to sleep, go-go-go to sleep) you make me go\n(Go to sleep) rockabye, baby\n\n[Verse 2: Tech N9ne]\nNever do you really gotta be ill as me\nLyrically, stalled\nLot of rappers gonna wanna grit they grill at me\nFuriously, y'all\nBut when you run up and then you find out villains we\nFear is recalled\nMusic and murkin niggas don't really wanna deal with me\nSeriously, dawg\nYour flow's on NyQuil, or them night pills\nOr that codeine, that y'all drank\nIt's a funny sight for real, the people like you still\nWhen you so lean, that you can't\nSpit one of your verses, worse, you just faint\nBetter get a nurse, a hearse, and kiss paint\nWatch a nigga urk and jerk, he's on the purp\nA Percocet alert, to Earth, if it's quaint in a...\nBox, see me comin' but can't even swing at me (weak as fuck)\nWhen you be rappin', you mummy, you don't wanna see me\nScreamin' up to the tip-top, a lot of you rappin', it be Ziploc\nAll I'm sayin', is I never wanna have no MSG in my hip-hop\n(Ehe-haha! Can you feel it? Feel the swagger, hahaha)\n\n[Hook: Ben-G Da Prince of Soul]\n(Rock, rock) rockabye (rock, rock) rockabye\n(Stop, stop) stop, you won't play me\n(Not, not) not a guy (hot, hot) hot as I\n(Rock, rock) rockabye, baby\n(Go to sleep, go-go-go to sleep) you make me go\n(Go to sleep, go to sleep) oh, you make me go\n(Go to sleep, go-go-go to sleep) you make me go\n(Go to sleep) rockabye, baby\n\n[Verse 3: Tech N9ne]\nLast thing I'm gon' say\nThe people don't really have green or gold pay\nSo when you think of rapping and go lay\nYour vocal, you better, mash mean and go cray\nBut if you a beginner still, in a deal\nAnd your remedial rappin' is in a mill\nI guess I better slow it down a little bit\nAnd go pop me a couple of (Benadryl)\nFuck, nigga, why you wake me up, nigga?\nMakin' million dollars layin' in the cut, nigga\nFuck what you say, I been 'sleep for two day\nGo to sleep, Tech N9ne, nigga, too paid\n\n[Outro]\nStay alive, homeboy, that's all I want you to do\nYou make me go (go to sleep, go to sleep)\nOh, oh, you make go (go to sleep, go-go-go to sleep)\nYou make me go (go to sleep) rockabye, baby", "image": "https://images.genius.com/9d1e1c938850d53aa216f2bec0e2ef9c.1000x1000x1.jpg"}], "artist": "Tech N9ne"}