{"songs": [{"title": "Can It Be All So Simple (Remix)", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Skit: Raekwon + Ghostface Killah]\n[Raekwon]\nYo, hold up, let me talk to this cat\nYo, kid, what' up, Starks? What' up?\n(What's goin' on, whassup? Whassup, baby?)\nAyo, yo, I just seen this kid over there, over there, right over there by your building and shit\nI know he ain't down with your team\n(Who?)\nI dunno, some skinny-lookin', big-head nigga, youknowwhatI'msayin'?\n(He ain't makin' no sales though)\nYo, son, I just seen five fiends around a nigga, son\n(Fuck it, let's do what we gotta do)\nFuck it, let's go over there, I'mma show you this nigga\nCome on, come on, right over there, there you go, right there\n(That cat?)\nWord up, I'm right behind you\nAyo, kid, what the fuck is you doin', man, huh? Huh\n(Who the fuck you talking to?)\nI'm talking to you\n(You ain't talking to me)\nThe fuck you talking about?\nOpen your hand—what the fuck is that in your hand man?\n(Sounds of Ghost slapping the kid)\nWhat the fuck I say?\nThis is my shit, grab that nigga, grab that nigga (Why? Why? Why?)\nCome here!\n(Sounds of gunshots)\nMove, son! Move, son! Oh, shit! Oh, shit! Oh, shit, yo\nYo, I'm hit, yo, son, I'm hit, I'm hit, I'm hit\n(Damn, son, you bleeding, son, bad)\nAyo, grab this, grab this, take this, take this\nI'm going over to the God's house, go ahead before the cops come, go ahead, go ahead, son, man, fuck that\nNiggas tried to assassinate me, man\n\n[Verse 1: Ghostface Killah]\nYo, check what happened out of state\nI'm knocking off a half-a-cake cash rule, flying at a fast rate\nI smoke the black dust, kept my hands clutched, I'm falling in lust\nSpoilt plush I played my hand like a royal flush\nBaggy jeans, Wallabee Clarks, pretty women\nI put it in 'em, shot up in 'em, deadly venom\nI hung around the big time bosses\nIllegal force exchange thoughts, showing love to all my sources\nSpades tried to bag me, like Cagney and Lacey\nChef had that bitch Stacey slippin in Macy's\nI doze off, catch a flashback on how I got trapped\nAnd got licked like Papsy in a mob flick I got hit\nStumbling, holding my neck to the God's rest\nOpened flesh burgundy blood colored my Guess\nEmergency trauma, black teen headed for surgery\nCan it be an out of state nigga tried to murder me?\nI should've stayed in Job Corp, and now I'm a outlaw\nRay Catena; carry a .44, nigga\n\n[Chorus: Ghostface Killah & Raekwon]\nDedicated to the Gods and Earths\nDedicated to babies who came feet first\nDedicated to Up North and down state\nDedicated to rich niggas who sell weights\nDedicated to projects with black kids\nDedicated to man who build pyramids\n\n[Interlude: Raekwon]\nWord up! What the fuck, yo?\nWe taking you on another chamber\nWord up, son, you know how we be on it\nYeah, it's real\nShow these crabs how to rhyme man\nI think it's time to bless them, word up\nBulletproof\nFirst chamber\nYo, Chef, yo\n\n[Verse 2: Raekwon]\nIt started off on the Island aka Shaolin niggas wilding\nOld folks scream stop the violence!\nTrue. laying up yo, watching these crack niggas\nPlaying nuff crap games for what, see\nBack in days, crime pays in mad ways\nSporting Tommy Hil with caves, 360 waves\nAnd no searching for loose ends, now I flex 300 Benz\nMad Timbs with mad diamonds\nNow that's the life of the good life, sometimes niggas act trife\nI paid the price throughout my hood life\nRemember I got blasted, now that's in the past kid\nGod forbid I lay in the casket\nBut now I'm all about G-notes, no time for weed, mixed with coke\nI wash my mouth out with soap\nAnd got my act together, Lo sweaters and better\nAnd phat leathers, so whatever, bring it on", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}