{"songs": [{"title": "Judgement Day", "album": "Tical 2000: Judgement Day", "year": "1998-10-20", "lyrics": "[Intro: Method Man]\nFirst, there was the collapse of civilization, anarchy, genocide, starvation. Then, when it seemed like shit couldn't get any more fucked up, we got the Plague, the Living Death, closing his icy grip around the whole planet. Then the rumors started, the last hardcore MC's were working on a cure, that would end the pestilence, why? I like the death. I like the misery, I like this world!! Space, the Final Frontier. These are the voyages of the Starship Tical\n\n[Verse 1: Method Man]\nAs I walk in the shadow of death\nSixteen men on a dead man's chest\nYour host this even Mr H-O-T\nN-I-X, you get splashed with the Tec\nNobody go 'til the God say so\nYou got a second or more to run for the door\nBefore I blow back off the map, contact\nYou didn't know Stat' could get down like that\nWho want them test rocket launcher, yes\nMr. Meth, hold the fort, most def\nCats is dead wrong, song's too long\nGet swung on, can't we all get along?\nSee my pinkie, see my thumb\nSee that kid with the pump shot gun?\nBust your gums, leave your whole shit numb\nHmm, now what's this? Smell like fish\nMr. Big Mouth, the gat be trout\nYou need to douche out your style no doubt\nJohnny struck through the Shaolin slum\nPrum-prum-prum on my Shaolin drum\nNiggas don't dare to step in the square\nKids ain't playing over here, playa\nOnly one way, and that's my way\nGrim Reaper calling, Judgement Day\n\n[Hook]\n(10) Ten let the countdown begin\n(9) I was born in the mind\n(8) Take the head of a snake\n(7) Behold Armageddon\n(6) Ain't no love for the rich\n(5) Only strong will survive\n(4) Cause we live by the sword\n(3) Plus sixty degrees\n(2) For the black and the blue\n(1) For the Sun, step into millennium\n\n[Verse 2: Method Man]\nThe name of this one is Judgement Day\nNo more B.S., can't come out and play\nDon't blame me, blame society\nType of chemistry for a live MC\nHands in the air like you just don't care\nYou all get a share, there's a party over here\nYear 2000, keep bouncing\nT-Minus, thirty seconds and counting\nNew York's finest, still wilding, Shaolin\nAt the full moon howling\nGet 'til it's gone, Killa Bee kills\nOnly time will reveal like the words in the song\nCause love's what I feel for my crew, bust steel\nNiggas don't got to pay my bills\nP.L.O. pack the slingshot flow\nPlant the seed, let the garden grow\nAnd stick that rhyme where the sun don't shine\nDarts pierce your heart like a Valentine\nThis my Tale From the Crypt that's sick\nBloodbath, body bags and shit\nUFC fighting championships\nG.I. Joes with the Kung-Fu Grip\nNow you don't dare, to step in the square\nKids ain't playing over here, playa\nOnly one way, and that's my way\nGrim Reaper calling, Judgement Day\n\nCome on, I said come on\n\n[Hook + Verse 1 + Hook]", "image": "https://images.genius.com/2f23c933c7f14bc5a24d017a336ba6ac.300x300x1.jpg"}], "artist": "Method Man"}