{"songs": [{"title": "Who Can It Be?", "album": null, "year": null, "lyrics": "[Hook]\nWho fright you in your dreams, tell me who can it be?\nWho's got the shit on lock, but doesn't have a key?\nThey think he's tight, and all the kids like him\nHe knows he's fly, 'cause all the girls like him\nHis name is Hopsin\n\n[Verse 1]\nI'll be that nigga who get that loose when a zip come through\nDroppin' that funky shit on the regular's what I meant to do\nNiggas be thinkin' I'm illiterate 'cause I ain't finish school\nTalkin' 'bout he an animal, that nigga belong in the zoo\nI prolly do but I gotta do what I gotta do\nWhy do you think I'm hoppin' through obstacles that are hard to do\nAll of you motherfuckers who talkin' really and startin' to get me started\nAnd I'm gettin' to the point I'ma slaughter you\nPsych, I just like to play like I'm a psycho\nThat's why every place I go I just look suspicious so they know\nBefore they go and talk to me, niggas possibly spark somethin'\nUp in my brain and, I can just flip and go out and start somethin'\nThat's why they leave me in [?], they  know I'm a crazy man\nThink I need to tone it down, 'cause I don't get no ladies, man\nNigga started back in the day when I was a baby, man\nMaybe I should just stop it, 'cause everybody hate me, man\n\n[Hook]\nWho fright you in your dreams, tell me who can it be?\nWho's got the shit on lock, but doesn't have a key?\nThey think he's tight, and all the kids like him\nHe knows he's fly, 'cause all the girls like him\nHis name is Hopsin\n\n[Verse 2]\nI'm more than scary, I'm mightier than ordinary\nExtraordinary, and horror galores, hard to bear me\nI'm the nigga all the hoes are married, it's mind-boggling\nBut if you ask 'em about it then they'll deny all of it\nYou ain't gotta like my style but you're drawn to it\nRap ain't workin' out for you, then you should try college then\nYou're lying if you say I'm not the man\nGot the game pocketed, murder niggas and remain anonymous\nI ain't a hater, dawg, I bang a lot of shit\nUp inside my tape deck, if the shit's wack I take it out of it\n'Cause I'm tired of it, you niggas soft like some cartilage\nMe evolve in rap homie, you don't want a part of it\nI run around slaughtering, clobbering, stop bothering\nY'all got me yelling on the mic, so much of slobbering\nWant magic in the booth, call Harry Potter then\nHuh, look at the situation I got 'em in\n\n[Hook]\nWho fright you in your dreams, tell me who can it be?\nWho's got the shit on lock, but doesn't have a key?\nThey think he's tight, and all the kids like him\nHe knows he's fly, 'cause all the girls like him\nHis name is Hopsin\n\n[Break]\nHopsin, Hopsin, Hopsin, Hopsin, Hopsin, Hopsin\nHopsin, Hopsin, Hopsin, Hopsin, Hopsin, Hopsin\n\n[Verse 3]\nI'm not an illusion, where's my brain? How did I lose it?\nAnd how the fuck do I be jottin' my music?\nYeah don't be gossip and stupid, the microphone I show how to abuse it\nWithout no bullshit idiotic excuses\nI'm a straight ill nigga, you and I knew this shit\nDope since I with the hella unified school district\nStep to me upon the mic, then you will die doin' it\nWord to describe me, you should try \"Lunatic\"\n\n[Hook]\nWho fright you in your dreams, tell me who can it be?\nWho's got the shit on lock, but doesn't have a key?\nThey think he's tight, and all the kids like him\nHe knows he's fly, 'cause all the girls like him\nHis name is Hopsin\n\nWho fright you in your dreams, tell me who can it be?\nWho's got the shit on lock, but doesn't have a key?\nThey think he's tight, and all the kids like him\nHe knows he's fly, 'cause all the girls like him\nHis name is Hopsin\n\nHopsin, Hopsin, Hopsin, Hopsin, Hopsin, Hopsin\nHopsin, Hopsin, Hopsin, Hopsin, Hopsin, Hopsin\nHopsin, Hopsin, Hopsin, Hopsin, Hopsin, Hopsin\nHopsin, Hopsin, Hopsin, Hopsin, Hopsin, Hopsin", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}