{"songs": [{"title": "What Kinda World", "album": "The Sneak Attack", "year": null, "lyrics": "There's no such thing as a government\nThere's only people rulin over people\nPeople jerkin around people\nPeople lendin a hand to people..\nWhat part of the system do you play?\nWho do you oppress? .. Uhh!\n\n[Hook]\nWhat kinda world are we livin in?  Yo\nWhat kinda world are we livin innnnnn?\nCan I get with my people?  Can I sit with my people?\nBreak bread with my people?  Move ahead with my people?\n\n[Hook] - 1/2\n\n[KRS-One]\nWhen every day, seven thousand kids are gettin locked up\nWhen every day the justice system seems to stay stocked up\nWhen every day they cuttin 'em down 'fore they even pop up\nWhen every day you gotta duck 'fore you get shot up\nWhat kinda world are we livin in, spinnin in\nWinnin in, sinnin in, let us begin again\nChurches are ran like corporations makin me holla\nCorporations are ran like churches praisin the dollar\nThere's no way out, or is it?  Release your doubt and live it\nTeachin metaphysics don't listen to these critics hear it\nWhat kinda world are we livin in?\nBelieve in yourself, achieve for yourself, see for yourself\nSpeak for yourself, never weaken yourself, by deceivin yourself\nBelieve in your wealth, c'mon!\n\n[Hook]\n\n[KRS-One]\nYo, yo, yeah\nWhat kinda world are we livin out, we move about\nIn fear and doubt, tryin to get more clout\nJust check it check it out, we took the wrong route\nTo a morality drought, basically I'm callin 'em out\nWhat kinda world are we livin in, when a song\nWill not get on, unless it talks 'bout thongs\nNow where did we go wrong?  We don't have long\nPreference all torn all worn not norm and all gone\nWhat kinda world do we live around, when we lay around\nLet me break it down, they shuttin us down\nWhile we play around, we fallin, stallin\nWhile God's callin, all in to fall in\n\n[Hook]\n\n[Hook] - 1/2\n\n[KRS-One]\nWhen every day another unwanted pregnancy ends\nWhen every day another person is betrayed by a friend\nWhen every day it never ends, and the people pretend\nLike the President is there cause of them, let me ask\nWhat kinda world can we really trust\nWhen the cops they can shoot at us?  Bo bo!\nWhat kinda world can we really grow (ohh)\nWhen our daughters wanna be hoes (ohh)\nAnd a father that nobody knows (ohh)\nAnd a mother wearin them sexy clothes (ho)\nWhat kinda world are we livin in, yo\nWhat kinda world are we livin in, uhh\n\n[Hook] w/ variations\n\n[KRS]\nCan I get with my people?  Can I sit with my people?\nBreak bread with my people?  Move ahead with my people?\nCan I sit with my people?  Can I get with my people?\nBreak bread with my people?  Move ahead with my people?\nCan I sit with my people?  Can I get with my people?\nBreak bread with my people?  Move ahead with my people?\n\nFresh.. for two-thousand-one.. you SU-CKAZZZZZZ!", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}