{"songs": [{"title": "Joy", "album": "The Cookbook", "year": "2005-07-04", "lyrics": "ALBUM INTRO SKIT:\n\n\"Someone's in the kitchen with Dinah. Hey! Hello? Who is it??\"\n\"BOY SCOUTS!\"\n\"Oh no! Don't you know not to ever disturb a woman when she's cooking her favorite recipe?!\"\n\"Hey lady, look. This a jack move!\"\n\"Fried chicken, pork chops, chitlins, collard greens... What's wrong with you, eh? I have to get back to the kitchen. My cabbage is burning.\"\n\"Yeah, I want the cabbage and your collard greens. All of it. Right now.\"\n\"Besides, you're making me miss my favorite episode Fear Factor! I wonder if the ribs are done. You boys want to know chef's favorite recipe for musicals?\"\n\"I don't wanna know no chef recipe?! Go 'head. Get the pump! Gon' and get the pump.\"\n\"Well I tell you. You take a half a teaspoon of Mary J. and Ciara with a dash of Slick Rick.\"\n\"Yeah, yeah, he gon' come back with the burner. Yeah, I'mma stick-- Yeah... Okay. Well, you play. Play!\" \"I'm back. Oh I'm back!\" \"Now what now!\"\n\"It's easy as 1-2-3 play. Next, you mix [?] Qu'ran in a Bangladesh style bowl to make some Nissan Stewart. Mix some Campbell's soup...\"\n\"And then???\"\n\"...I prefer Warryn style myself personally. Add a pinch of Fantasia...\"\n\"And THEN???\"\n\"...and a Grand sized Puba. You sprinkle one Scoop Fatman throughout to add flavor and a dab of Soul Diggaz. Then you throw a tablespoon of Timbaland and half a Neptune smothered in hot Scott Storch dressing.\"\n\"We gon' smother you in some hot sauce. Whatever you said.\"\n\"...and you serve with a side order of Mike Jones.\"\n\"Mike Jones?\" \"Who?\" \"Mike Jones!\"\n\"It's best served with a cold [?] brew, whichever you prefer. And there you have it kiddies. This is my perfect recipe for a delicious meal. Enjoyyyyyyyyyyy!\"\n\nSONG:\n[Elliott] Joyyyyyyyyyyyyyy\n[Scratch] Oh-oh, oh-oh-oh, oh-oh-oh\n[Elliott] Joyyyyyyyyyyyyyy\n[Speak'n'Spell] {*vowel sounds*}\n[Elliott] Joyyyyyyyyyyyyyy\n[Scratch] Oh-oh, oh-oh-oh, oh-oh-oh - so sick!\n[Elliott] Joyyyyyyyyyyyyyy\n[Scratch] Oh-oh, oh-oh-oh, oh-oh-oh\n[Speak'n'Spell] {*vowel sounds*}\n\n[Missy]\nTimbo, what they do\nThey try to be like Missy but they have no clue\nOn how I'm spittin over beats the way I move\nI move so smooth in my shell toe shoes\nNow put the needle on the record, show'n'prove\nSince ninety-two I came to win and never lose\nThey try to stop a chubby chick from comin through\nMy belly out and sellin out these venues\nMy skills, will fulfill, those who drink booze\nMy attitude is super cool like I'm subdued\nAnd those who fake I take on you and your dudes\nI rule the streets I break 'em down with no tools\nAnd Misdemeanor give the finger to y'all fools (HOLLA!)\nWhoever doubted that I'm 'bout it check the news\nAnd if you snooze on me this year your ass will lose\nCause I will bruise, my loose screws is like ooh\nWhen I come out, get your release dates moved\n\n[Hook: Missy]\nThis year y'all gon' all lose sleep\nI break 'em off somethin, break 'em off somethin\n[Scratched] This year y'all gon' all lose sleep\nThis year y'all gon' all lose sleep, when I\nBreak 'em off somethin, break 'em off somethin\n(BIG SHOUT OUT TO TIMBALAND)\nThis year you hear a real MC, when I\n[Slowed up] break break b-b-break break break...\n\n[Missy]\nI flow over a beat that make a chick weave blow\nAnd those who try to compete to the wall I throw\nSo I drop it low, 808 kick low\nLike oh oh-oh oh, oh oh-oh-oh, oh-oh-oh\nMr. Mos', this beat he compose\nWhile I kill the track, leave your ears decomposed\nFake rappers, this year your lies will be exposed\nLike oh oh-oh oh, oh Missy steal the show-ow-ow\nSpit on breakbeats, make rappers lose sleep\nMake labels unable drop they artists on leak\nI keep 'em knee deep, need me, be me\nHardly, and basically, I do it nice and slow-ow-ow\n\n[Slowed]\nI'm slowin, the track down, so you don't miss the shit\nThat Misdemeanor talkin like that chronic get you super high\n\n[Hook: Missy] + (Mike Jones)\nThis year y'all gon' all lose sleep\nI break 'em off somethin, break 'em off somethin\nThis year you hear a real MC\n[Scratch] Oh-oh, oh-oh-oh, oh-oh-oh\nThis year y'all gon' all lose sleep, when I (MIKE JONES! WHO?)\nBreak 'em off somethin, break 'em off somethin (MIKE JONES! WHO? MIKE JONES!)\nThis year you hear a real MC (GEYEAH!)\nBreak 'em off somethin, break 'em off somethin\n\n[Mike Jones]\nSee I'm a pimp that's on my grind, I hustle like all the time\nI speak what's on my mind, my teeth'll make you blind\nMy heat'll lay you down, whenever you come around\nForsaken out there mistreated your life'll be deleted\nCause I don't play dat, you know I don't play dat\nWherever you talkin noise is where you gon' lay at\nI'm supa dupa fly like Missy Missy\nBefore the fame majors used to diss me\nBut now I'm on top, I'm hot I can't stop\nBefore my deal came my shows was sold out\nHouse been on the hill, diamonds been in my grill\nI'm trill like U.G.K., you know I keep it real\nI'm who, Mike Jones, WHO? Mike Jones\nWHO? Mike Jones and I can't be cloned\n2-8-1, 3-3-oh, 8-zero-zero-fo'\nThat's my cell phone number, hit me on the low\nI got\n\n[Missy]\nHold up, I see a lot of folks in here sittin 'round like your shoes too tight\nIf you wear a size 10, don't cram yo' shit up in a size 6 ladies\nBe proud of yo' big-ass feet\nWe came to party up in this bitch", "image": "https://images.genius.com/49c23ba7107cf9bb93749df01b30111c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}