{"songs": [{"title": "Long Time", "album": "10 Day", "year": "2012-04-03", "lyrics": "[Produced by Beirut]\n\n[Intro]\nOh, no, no, no, no-no\nWell, it's been a long time, long time now\nSince I've seen you smile\n\n[Verse 1]\nI wonder if Gladys smiles when angels bring my name up\nOr change language and subject change up\nHer boy's a long way from red dogs and green rangers\nThings ain't been the same since Ms. Patterson called me famous\nI saw your reflection in a toilet full of vomit water\nYou don't think I felt ya hand on my head, yelling: \"Call his father\"?\nBut people don't hear ghosts, so how they gon' play me?\nMoney saved me, so I'ma do the same thing\nYou're droppin' pounds, gettin' small on some sick shit\nLike, how you got the drive, but don't know how to use a stick shift?\nYou better not miss this, overdose, dope and mixes\nLet ya throat close with a boatload of dope quotes within it\nBlast off\n\n[Verse 2]\nDropping tapes 'til I losted count, coughing out blood\nDropping weight like I lost an ounce\nThrowing words and tossing nouns\nNY traveling, I'm Boston bound, bossing 'round homies\nAnd talking down to shorties while I'm jotting down\nNotes to spit to Harlem crowns\nSurfing through the Harlem crowds\nAt the crib, I'm falling down\nYeah, I'm steady crawling 'round\nI'm calling out to God\nYour little angels falling down\nSave me from my darkened cloud\nReach your hands and arms around\n\n[Bridge]\nOh, non je t'en prie, nous ne sommes pas chez nous\nOh, je t'assure que ce n'est pas grave\nNon laisse-moi!\nMais qu'est-ce que tu as aujourd'hui?\nJ'ai que les hommes me dégoûtent. Vous ne pensez qu'à ça\n\n[Chorus]\nWell, it's been a long time, long time now\nSince I've seen you smile\nAnd I'll gamble away my fright\nAnd I'll gamble away my time\nAnd in a year, a year or so\nThis will slip into the sea\nWell, it's been a long time, long time now\n(Oh, it's, oh, it's been so long)\nSince I've seen you smile\n(It's been so long)\n\n[Outro]\nSaid it's been a long time, long time now, now, now\nSaid it's been a long time, long time now\nAnd it's been a long time, long time now", "image": "https://images.genius.com/04c687414ea567ebf44f05a92c3e86ff.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}