{"songs": [{"title": "You Can’t Stop Us Now", "album": "Untitled", "year": "2008-07-15", "lyrics": "[Verse 1: Nas]\nFrom Willie Lynch to Willie Hutch, right on, we Superfly\nMade Gucci the shit, Louie too, suits and ties\nPlayer trophies, pray to Goldie\nPicture wax museums full of Black Panth's and triple OGs\nAunt Jemina hoes, historic horse shit\nGirls from long time ago, stagecoach with the horse, kid\nWitchdoctors, good ol' pickpockets\nSip moonshine, so-called coons, shines, and darkies\nI love y'all, pyramids to cotton fields\nTo Wrigley Fields, forgotten men who did get killed\nCrispus Attucks, the first blasted\nPeace to the rich lady purse snatcher shot in the back\nI know your hunger kid, I know they hung your dad\nBurnt ya mama crib, I know that hurt you bad\nMinstrel shows, from gold to shackles and back to gold\nWe act like we home, matter of fact, we are home\nBad attitudes, octoroon skin tones\nSlave food turned to soul food, collards to neck bones\nBetsy Ross sewed the first American flag\nBet she had a nigga with her to help her old ass!\n\n[Interlude: Eban Thomas]\nAs James Baldwin says:\n\"You can only be destroyed by believing that you really are\nWhat the white world considers - a nigga\"\n\n[Chorus: The Last Poets]\nOhh, no matter how hard you try\nYou can't stop us now (oh, no matter)\nNo matter how, hard you try\nYou can't stop us now (no)\n\n[Verse 2: Nas]\nCan't be stopped\nYo, on Dateline, the other night they showed hate crimes\nGave a blood time cause he fought with his canine\nBestiality, humane society\nGo to China, see how they dine, see what they eat\nBetter yet, ask PETA, whoever, which animal makes suede?\nIf not for suede, would you have survived the Dark Ages?\nCannibal ways of the ancient Caucasians\nStare you like you're steak tartar, pinot noir\nDavid Star on the chain of Sammy Davis\nHe helped pave the way for Southern crankers and them Harlem shakers\nNow we gettin' our papers, they try to censor the words\nAnd stop our money comin' but you can't escape us - haters\n\n[Chorus: The Last Poets]\nOhh, no matter how hard you try\nYou can't stop us now (oh, no matter)\nNo matter how hard you try\nYou can't stop us now (no)\nYou can't stop us now", "image": "https://images.genius.com/b494ca4151f14803123849b4f34be37f.700x700x1.jpg"}], "artist": "Nas"}