{"songs": [{"title": "Bad Influence", "album": "The Singles", "year": "1999-11-02", "lyrics": "[Chorus]\n(Just pull the plug!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol (C'mon!)\nC'mon, do as I do, go ahead, get mad and do it!\n(Just pull the plug!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol (C'mon!)\nC'mon, do as I do, go ahead, get mad and do it!\n(Just let it go!)\n\n[Verse 1]\nHand me an eighth, beam me up and land me in space\nI'ma sit on top of the world, and shit on Brandy and Mase\nI'm more than ill, scarier than a white journalist\nIn a room with Lauryn Hill human horror film\nBut with a lot funnier plot and people'll feel me\n'Cause I'ma still be The Mad Rapper whether I got money or not\nAs long as I'm on pills and I got plenty of pot\nI'll be in a canoe paddling, making fun of your yacht\nBut I would like an award for the best rapper to get\nOne mic in The Source and a wardrobe I can afford\nOtherwise I might just end up back strikin' at Ford\nAnd you wonder what the fuck I need more Vicodin for?\nEverybody's pissin' me off: even the No Limit Tank\nLooks like a middle finger sideways flippin' me off\nNo shit, I'm a grave danger to my health\nWhy else would I kill you then jump in a grave and bury myself?\n\n[Chorus]\n(Just pull the plug!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol (C'mon!)\nC'mon, do as I do, go ahead, get mad and do it!\n(Just let it go!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol (C'mon!)\nC'mon, do as I do, go ahead, get mad and do it!\n(Just do it!)\n\n[Verse 2]\nI'm the illest rapper to hold the cordless, patrollin' corners\nLookin' for hookers to punch in the mouth with a roll of quarters\nI'm meaner in action than Roscoe beatin' James Todd Senior\nAcross the back with vacuum cleaner attachments\nI grew up in a wild hood as a hazardous youth\nWith a fucked up childhood that I used as an excuse\nAnd ain't shit changed, I kept the same mindstate\nSince the third time that I failed ninth grade\nYou probably think that I'm a negative person, don't be so sure of it\nI don't promote violence, I just encourage it\nI laugh at the sight of death, as I fall down a cement flight of steps\nAnd land inside a bed of spider webs\nSo throw caution to the wind; you and a friend\nCan jump off of a bridge, and if you live, do it again\nShit, why not? Blow your brain out, I'm blowin' mine out\nFuck it, you only live once, you might as well die now\n\n[Chorus]\n(Just let it go!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol (C'mon!)\nC'mon, do as I do, go ahead, get mad and do it!\n(Just pull the plug!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol (C'mon!)\nC'mon, do as I do, go ahead, get mad and do it!\n(Just do it!)\n\n[Verse 3]\nMy laser disc'll make you take a razor to your wrist\nMake you satanistic, make you take the pistol to your face\nAnd place the clip and cock it back\nAnd let it go until your brains are rippin' out your skull\nSo bad to sew you back would be a waste of stitches\nI'm not a role model, I don't wanna babysit kids\nI got one little girl, and Hailie Jade is Shady's business\nAnd Shady's just an alias I made to make you pissed off\nWhere the fuck were you when Gilbert's paid to make me dishwash?\nI make a couple statements and now look how crazy shit got\nYou made me get a bigger attitude than eighty Kim Scotts\nAnd she almost got the same fate that Grady's bitch got\nI knew that \"Just the Two of Us\" would make you hate me this much\nAnd \"Just the Two of Us,\" that ain't got shit to do with us\nAnd our personal life, it's just words on a mic\nSo you can call me a punk, a pervert or a chauvinist pig\nBut the funny shit is that I still go with the bitch!\n\n[Chorus]\n(Just pull the plug!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol (C'mon!)\nC'mon, do as I do, go ahead, get mad and do it!\n(Just let it go!) People say that I'm a bad influence\nI say the world's already fucked, I'm just addin' to it\nThey say I'm suicidal, teenagers' newest idol\nC'mon, do as I do, go ahead, get mad and do it!\n(Just do it!)", "image": "https://images.genius.com/f57687dfa42cf60c073d1fba033b635e.500x480x1.jpg"}], "artist": "Eminem"}