{"songs": [{"title": "I Want To Be Free", "album": null, "year": null, "lyrics": "You think oakland california is a city of punks\nIt only takes a second, to pop the trunk\nAnd just like that you know it's real\nYou're in the right damn town to get killed\nIt's all about the game, and nothin else\nYou come out here, you better watch yourself\nCause you can wear what you want, even blue or red\nBut cross the wrong brothers, and end up dead\nYou catch a body full of bullets, and get blasted\nTryin to be a gangsta but you just ain't lastin\nThis little town is gettin wild as hell\nCheck the penetentiaries and all the jails\nIf they could lock us all up that would be just fine\nGot my partners from oakland doin serious time\nYou can't argue with the truth it's hard to be black\nBut it's a mindgame, and you gotta deal with that\nI wake up everyday and I just can't wait\nTo make mo money, cause back in the days\nWhen I rapped, I did the same damn thing I do now\nGrab the microphone, and show you how\nBut I was broke, the only thing I had was game\nI started makin money and knew things would change\nBought a benz, thought it might earn respect\nBut the opd, found it hard to accept\nI got jacked by the task and jacked by the vice\nFace down on the ground keep my hands in sight\nPut the handcuffs on backseat I'm in it\nIllegal search for about thirty minutes\nAskin me, where's the dope\nWhere's my gun, but I don't know\nI said I'm rappin, they laugh like I told a joke\nAnd to this day they think I'm sellin coke\n\nI want to be free! (and that's the truth) ohhh yeahhh\nI want to be free! ohhh yeahhh\n\nI be in oakland california every day of my life\nBass so hard you think I'm smokin a pipe\nAnd if I don't smoke it, I gots to grind\nSearched all my stuff, and all you find\nIs a pocket full of money count seven g's\nNow you wanna think I'm sellin keys\nCause I'm a black man, but I run my own business\nSo why the police wanna send me to prison\nThey see a brother makin major cash\nThey knock a patch out his black ass\nAnd that's the truth, you can't argue you at all\nTryin to give you ten years for a phone call\nAin't even trippin on the dank smoke\nCause all they wanna find, is guns and coke\nIn court all the time tryin to fight it\nWe get rich, we get indeibted\nSo what's the problem officer this time?\nIs havin big money bein black a crime?\nOr did you take me to jail, to teach me a lesson\nCharge me with somethin, or just ask questions\nAbout the brothers I hang around\nWhat's really goin on in the oakland town\nTell me who went broke, and who got rich\nBut too $hort baby just ain't no snitch\nYou say you're just doin your job\nBut you're gettin on my nerves, just like bob\nEverytime I hit a corner, I see you\nAlways tellin brothers what to do\nYou lock me up cause I don't know how to act\nBut I'm down for mine so I be talkin back\nAnd when I do, you treat me bad as hell\nI'm sick of spendin nights in jail\n\nI want to be free! (and that's the truth) ohhh yeahhh\nI want to be free! ohhh yeahhh\n\nGot out of jail about fo'-fifteen\nWalkin down the street like a broke dopefiend\nHad a pocket full of money tryin to play the role\nBenz got towed and I was hella cold\nBut I ain't trippin, I'm gettin used to it now\nHandcuffed your boy took me straight downtown\nFor three warrants, had to catch me sooner or later\nCause the five-oh's always tryin to jack a playa\nFor no reason, wasn't doin nothin wrong\nYou think I'm lyin, singin that same ol song\nWell I'm a black man, ridin in a benz\nHow in the hell did I make these ends? here we go\nI pull over to the right\nStop the engine keep my hands in sight\nI start cursin, cause it don't make sense\nWhy would I run and try to jump a fence\nIf I was plannin, a smooth getaway\nI never woulda stopped in the first place\nYou'd be high speed chasin me but this time you ain't\nCause all I got on me is a big fat bank\nAnd I hope I don't get robbed by you know who\nMake me donate some g's to the boys in blue\nAnd if I sue, I won't get nothin back\nBut I ain't mad... I'm just black...\n\nI want to be free! ohhh yeahhh\nI want to be free! ohhh yeahhh\nI want to be free! ohhh yeahhh\nI want to be free! ohhh yeahhh", "image": "https://images.genius.com/f7947ca6d18485b4713ba9c89b2980c7.800x800x1.jpg"}], "artist": "Too $hort"}