{"songs": [{"title": "One Mic (American Epic Session)", "album": "American Epic: The Sessions", "year": null, "lyrics": "[Verse]\nYo, all I need is one mic‚ one beat‚ one stage\nOne  person front‚ face on the front page\nOnly  if I had one gun, one girl and one crib\nOne God to show me how to do things his son did\nPure, like a cup of virgin blood\nMixed  with 151‚ one sip probably'll make me flip\nWrite  my name on my hollow tips, plottin' shit\nMad violence, who I'm gon' body? This hood politics\nAcknowledge  it‚ leave bodies chopped up in garbages\nSeeds watch us, grow up, try to follow us\nPolice watch us, roll up, try knockin' us\nOne knee I ducked, could it be my time is up?\nBut  my luck, I got up, the cop shot again\nBus stop, glass burst, a fiend drops his Heineken\nRicochetin' between the spots that I'm hidin' in\nBlackin' out as I shoot back—fuck gettin' hit!\nThis is my hood, I'ma rep to the death of it\n'Til everybody come home, little niggas is grown\nHoodrats, don't abortion your womb\nWe need more warriors soon\nSent from the stars, sun and the moon\nIn this life of police chases, street sweepers, coppers\nStick-up kids with no conscience, leavin' victims with doctors\nIf you really think you ready to die\nThis is what Nas is 'bout\n\n[Chorus]\nYo, all I need is one mic\nAll I need is one mic\n\n[Verse 2]\nAll I need is one blunt, one page, one pen\nOne prayer, tell God forgive me for one sin\nMatter of fact, more than one\nLook back at all the hatred against me—fuck all of them!\nJesus died at age 33, 33 shots\nFrom twin Glocks, there's 16 apiece, that's 32\nWhich means one of my guns was holdin' 17\n27 hit your crew, six went into you\nEverybody gotta die sometime\nHope your funeral never gets shot up\n?? through the innocent\nNothin' is fair, my heart is racin'\nTastin' revenge in the air\nI let this shit slide for too many years\nStrapped up, too many MACs, too many 9s\nIf y'all niggas really with me, get busy, load up the semis\nDo more than just hold it, explode the clip until it's empty\nThere's nothin' in our way: they bust, we bust, they rush, we rush\nLead flyin', feel it? I feel it in my gut\nThat we take these bitches to war, lie 'em down\n'Cause we stronger now, the time is now!\n\n[Chorus]\nI need one mic\nAll I need is one mic\n\n[Verse 3]\nAll I need is one life, one try, one breath, and one man\nWhat I stand for speaks for itself, they don't understand\nDon't wanna see me on top, too egotistical\nTalkin' all that slick shit the same way these bitches do\nWonder what my secrets is\nNiggas'll move on you only if they know what your weakness is\nI have none, too late to grab guns\nI'm blastin' ‘cause I'm a cool nigga\nThought I wouldn't have your ass done? Fooled you niggas\n\n[Chorus]\nI need one mic\nAll I need is one mic\nAll I need is one mic\nAll I need is one mic", "image": "https://images.genius.com/03ebaa2577c1b04eef67f029b56d79b8.500x500x1.jpg"}], "artist": "Nas"}