{"songs": [{"title": "Apostle’s Warning", "album": "Hell On Earth", "year": "1996-11-19", "lyrics": "[Intro: Havoc]\nUhh GOD, uhh, y'know what we gotta do son!\nY'knowhutI'msayin? Word up!\nMake that millions fam!\nNo doubt! It's only there for the takings son\nMatter of fact let me get some of that beer son\nWe drunk all that shit, hey yo!\n\n[Verse 1: Havoc]\n41st Side convention, Queens connection\nThe Bridge we reppin'\nAny party that we step in get the Henny up\nVSOP immediately, extra bent\nRob then out son is evident\nWe stash CREAM, mansions fulfill my dream\nIce 'reams gleam, spread love throughout the whole team\nDominate the game, let's have a rule, combinations\nNo conversation, bring all ya good confrontation\nYou hesitatin', ass bettin', that's bad business\nFor the game, nigga, get out the business\nYou waste of space, substitute, here's a replace\nWe deface, smack the smile off ya fuckin face\nTaint the taste, send ya home back to vacate\nGet your shit together plus your mind straight\n\n[Verse 2: Prodigy]\nYo, my empire strikes with the strength of poisonous snakes\nMy entire unit loaded up with snake niggas that hire stakes\nWe pull off a high stakes, great escapes, expand, shift team downstate\nDreams of growing old with my son to live great\nLittle man I'm plannin' to enhance your mindstate\nThe rebirth, a nigga who lived an ill life\nThe one before me was of an even more trife\nMy understandin', I'll raise you with precise plannin'\nAnd put you on to the whole game of this planet\nBut I gotta survive in order to follow through\nPlans to live lotto, me and my little kicko\nAny man tryin' to stop us, he get wet tho\nHe couldn't withstand the snake bite, there is no antidote\nDon't you put your hands too close and try to approach\nI won't snap at you I'm goin' for throats\nAnd when you feel my bite, ya sing high notes\nI peeped you from deep and then you got cut close\nMy formulae: I live life do or die\nStare into the eyes of a deep wiseguy\nProdigy, turnin' niggas to protegés\nMy protegé, I advise ya ass to make way\nMake way...for fully-auto gun spray\nYou're small prey, I'll easily bait and trap game\nThis man is half mad scientist-half sane\nCreate a rhyme labyrinth like poisonous cannabis\nHere, take a toke of this deadly rare vocalist\nOverpower y'all, tiny noise like locusts\nLike sunlight thru a magnifying glass I'll focus and burn\nA hole straight through ya brain and leave ya open (Oh shit!)\nAnd let the venom soak in\nYou start sweatin' and goin' through convulsions from dope shit I writ\nLeavin' niggas stuck, I let stick\nTrapped up in a web of a nigga that's sick\nI'll wrap you up in cocoon, get caught up in the midst\nA dangerous, it's risky business fuckin' with this\nContender number one I put you on top of the list\nYou're the best challenger so far, I'll give you this\nBut peep this (What?) fatal shots that solar plex\nMan Down...now who dares to go next?\nLike General Monk Monk orders to chop necks\nI send a message to my whole clique to bomb shit\nAtomic, no time for calm shit\nWe hyperactive when it’s time to Vietnam it\nYa whole alliance gets singlehandedly bombed-ed\nTake heed to the Apostle's Warning\nWord up!", "image": "https://images.genius.com/2c1555f27e44bd87876d75ca225fcb3a.600x600x1.jpg"}], "artist": "Mobb Deep"}