{"songs": [{"title": "It Appears", "album": "Never Forget", "year": null, "lyrics": "[Intro]\nIs this thing on?\nIt's on?\nLet me know when you want me to stop\n\n[Verse 1]\nRight foot in the left hand, gospel in the other\nSisters in the front seat, I'm back with my brothers\nI can go farther if I'm guided by the mother\nWhatever level rappers on, KRS is on another\nThis that raw Emceein' you don't want none of\nBlastmaster KRS-One-uh\nOriginal boom bap beats with just the drummer\nSeems like people nowadays is getting dumber\nThey don't see they're getting older, not younger\nSo I split the Stevie and make them all wonder\nI come with than Donna Donna every summer\nThey want the high ground, me? I want the under\nRhyme books, rap hooks, I got a ton of them\nBut here's just one more of them\nNow you're about to hear the style of someone who has mastered this\nNow it's time to show you what boom-boom-boom-boom-boom bappin' is\nThis that '86, but from Gecko, we coming back again\nShowing you the difference between what MC'ing and rap again\nMany have attempted and wrecked it, this very style I spit\nPeace to them but you are now hearing the very off the tech\nWhen it comes to music, good music, I'm all on top of it\nCriminal Minded, you can find it with Scott LaRock and it\nThis mix drive, you have to get\nYou must have forgot what real Hiphop can get\nI haven't stole a topic yet, or a beat\nI don't get cash every week, I get cash when I speak\nI throw it out anywhere, like trash in a street\nI spaz on these beats, see the passionate heat\nEntrepreneur, I'm not asking to eat\nI'm off to Geneva, I'll be back in a week\n\n[Hook]\nAll through the years, in the end ?\n\n[Verse 2]\nMe stopping with hip-hop\nThat's like MJ no longer being regarded as the king of pop\nYou're thinking of the commercial flop could make me stop\n20 years in this game, I ain't aiming for the top\nI stay up in that underground cozy spot\nThat in-cognito nobody knows me spot\nMost MC's rhyme but don't know their plot\nMaxing out their credit 'til their bank closes shut\nYou went from holding jewels to holding a mop\nFrom talking about, \"Don't snitch,\" now you roll with a cop\nIt's like you erased your mind and forgot\nWhat the founding fathers truly saw posses ? with Hiphop\nWe're screaming back to the ? knowledge, culture, and overstanding\nWhile beats are slamming and the people are jamming\nSick of all these talentless hustlers scamming creating mental famine\nDon't you think it's time we re-examine?\nLet them know what the truth and the facts is\nThat the game nowadays is manipulated by masonist blue-collared fascists\nMarketing schemes is controlling the scene\nFiends for the green, I'm just a man trapped in a machine\n\n[Hook x2]", "image": "https://images.genius.com/8219c6b423edb4d95b5c842a51f3b31e.640x480x1.jpg"}], "artist": "KRS-One"}