{"songs": [{"title": "Whatcha Gonna Do", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "Hell yeah (2Pac yawning)\nHahaha\n\n[Verse 1: 2Pac]\nAnd uh, I started out dumb, sprung off a hood-rats\nListenin' to the radio, wishin' that I could rap\nBut nothing changed, I was stuck in the game\n'Cause everybody in the industry was fuckin' me, mayne\nListen, I got a scheme, break away, do my own thang\nDrop some conversation, sit back and let the phone ring\nNiggas ain't wanna see me rise\n97 watch me cut these motherfuckers down to size\nAnd if I catch another case, Lord knows how they hate me\nGot a player in the court room, please don't let 'em frame me\nI've been dealt a lot of bad cards livin' as a thug\nCount my blessings and throw my stressings in this land with no love\nMaybe they seen me rollin', look at all this green I'm holdin'\nI get this why they envious and get they eyes swollen\nHopin' the heavenly father love a hustler\nMeet the hardest nigga on the Earth to ever bust a nut\nMy homies tell me, \"Have a heart\" — fuck they feelings\nI've been tryin' to make a million since we started, we cold hearted\nNiggas in masks that'll blast at the task force\nEmpty out my clip, time to mash, they asked for it\nMe, Makaveli, I'm a motherfucker\nWe break bread, now we thug brothers, haha\nNiggas talk a lot of non-shit I choose to ignore it\nA war? They ain't ready for it haha\n\n[Hook: 2Pac & Young Noble]\nNow whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?\nNow whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?\nTell me now whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?\nNow whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?\n\n[Verse 2: Kastro & Young Noble]\nMy nine is Thug lord, my mind on my grind\nOutlawz is my heart, they shine when I shine\nMy rhyme is my grind, my team be on role\nProceed with the onslaught, indeed they all talk\nThey all marks and it's an Outlaw holocaust\nWhen I got the sawed-off, niggas gettin' hauled off\nYeah, nigga beware, stand clear\nThis nigga's scared, man, I don't really care\nI've been lost love, my heart need a hug\nMy bite need blood, I fight with a grudge\nThe life of a thug nigga might need gloves\nBut you'll never know with a price on your mug\nThem fight strips snug right around your hands\nMakin' sure you can never grab the mic again\nDog, you fuckin' with a grown man\nCan't I can't afford to lose\nWhere we from niggas torture dudes\nSo whatcha wan' do?\n\n[Hook: 2Pac & Young Noble]\nNow whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?\nTell me now whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?\nTell me now whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?\nNow whatcha gonna do, when my niggas come for you\n\n[Verse 3: 2Pac]\nHaha, watch me clown, give me lovin' when I'm high\nI'm a outlaw baby, I'll be thuggin' 'til I die\nIn my drop-top, double-R, life as a rap star\nHustle like a crack fiend 'til they catch me\nGo ask somebody to your show\nWatchin niggas out of sight, in my night scope\nCookin' white dope, got my nigga 25-to-life stressed out\nTryin' to have all the better things in life\nWhile Makaveli — a born leader, 10 millimeter\nChange a nigga's future like a schizophrenic palm reader\nHeed, from out the Bible I read\nSee the meek shall inherit the Earth and the strong will lead\nHittin' weed like it's alright\nI'm in the studio makin' music all night\nMy enemies cry whenever I rise, they hated 'til the death\nTryin' to beat me out my last breath\nWhatcha gonna do?\n\n[Hook: 2Pac & Young Noble]\nNow whatcha gonna do, when my niggas come for you (now nigga now)\nWhat y'all gonna do?\nNow whatcha gonna do, when my niggas come for you (throw you hands up)\nWhat y'all gonna do?\nNow whatcha gonna do, when my niggas come for you (would you wanna fuck?)\nWhat y'all gonna do?\nNow whatcha gonna do, when my niggas come for you (bust 'em, when my niggas come for you)\nNow whatcha gonna do, when my niggas come for you (come for you)\nWhat y'all gonna do?\nNow whatcha gonna do, when my niggas come for you\nWhat y'all gonna do?", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}