{"songs": [{"title": "Just Have Fun", "album": "These Days…", "year": "2014-06-24", "lyrics": "[PART ONE: \"JUST HAVE FUN\", produced by Like]\n\n[Intro: Ab-Soul & Da$H]\nHave some fun out there\nSmells like fuckin' dope in here\nSo, do the drugs, don't let drugs do you\nSo, do the drugs, don't let drugs do you\nSo, do the drugs, don't let drugs do you\nSo, do the drugs, don't let drugs do you\nSo, do the drugs, don't let drugs do you\nSo, do the drugs, don't let drugs do you\n\n[Verse 1: Ab-Soul]\nUp jumps the Boogie bitch, I boogie board on these instruments\n(Roll that weed, nigga)\nRiding the wave like a lie detector, if I'm lying I'm flying, nah\n(Shake that ass, ho!)\nIf I'm lying I'm lying, in dirt, that's a metaphor for dying\nMiming like Morpheus foresaw me saving Zion, that's\nMore fire, that's more fire, that's more fire, that's more\n(Roll that weed, nigga)\nSet that mouse trap, you fuck around, yeah you fuck around and get smoked\nGot that loud pack in these Backwoods like summer camp,  dwell on that (roll that weed, nigga)\nWe used to dub cassettes, but now we poppin' Percocets\nI don't be in no pain, I just like how it feels\nI close my eyes and follow beetles in strawberry fields\nMunchie munchie, Welch's fruit snacks and Mrs. Fields\nWicked as Aleister Crowley, you niggas know the deal\n(Son, do the drugs, don't let the drugs do you)\nPsy-Psy-Psychedelic savage and I'm telepathic too\n(Shake that ass, ho!)\nAsk Al Boy and A-Mack about when me and Q did shrooms!\nAnd that one ho was getting grooved in the next room\nI flow like, Russell Crowe in \"A Beautiful Mind\" (roll that weed, nigga)\nThat's a colorful touch like homosexual hugs (shake that ass, ho!)\nAnd I try to tell these motherfuckers all of the time (roll that weed, nigga)\nDon't forget my dash, or you'll get left behind! (shake that ass, ho!)\nI'm fast, another one bites the dust just at the sight of us\nThey liking us, to lightening striking over Mount Everest\nThat ever so, talented establishment\nTDE. Jay Rock, K Dot, ScHoolboy, me... Soul\n(What up, Zay? What up, SZA?)\n\n[Hook]\nWhen I cross the street I look both ways\nGazelle frames, paparazzi in my face\nNiggas talk more than bitches these days\nAnd the new drugs got a nigga trippy these days!\nJust have some fun (got that dopamine, I mean dope)\nYeah, let's have some fun\nJust have some fun (that dopamine, I mean dope)\nYeah, let's have some fun\nJust have fun\n\n[Verse 2]\nI just wanna teach you all about the mind (roll that weed, nigga)\nThe power in it, the very power of mine (shake that ass, ho!)\nIt makes sense I take interest in the third eye\nDue to my lack of sight, I guess it's a sacrifice\nCause I've already envisioned what the world looks like\nSo when it's handed to me, I won't need to look twice\nThey swear I read a lot of books, or I got straight A’s\nKatrina cleared my absences so I could walk the stage\nI never paid tuition, but I paid attention\nThat's why I gotta make it count when they pay admission\nTook my third hit of DMT and then I melted in\n(Met the devil in God's elbow)\nAnd this is what he said...\n\n[Hook]\nWhen I cross the street I look both ways\nGazelle frames, paparazzi in my face\nNiggas talk more than bitches these days\nAnd the new drugs got a nigga trippy these days!\nJust have some fun (got that dopamine, I mean dope)\nYeah, let's have some fun\nJust have some fun (that dopamine, I mean dope)\nYeah, let's have some fun\nJust have fun\n\n[Skit]\nHi, my name is Jimmy\n(Hi Jimmy)\nI'm a friend of a rapper\nYou may, you may, also know me as the white Ab-Soul\nI'm from Pittsburgh, Pennsylvania\nI like Denim Jeans\nAnd I'm an alcoholic...\n\n[PART TWO: \"THESE DAYS\", produced by Blended Babies]\n\n[Hook: The O'My's]\nThese days I've seen my best\nNeed be lay me to rest\nSmoke, drink, relieve my stress\nHard times, they got the best of me, I guess\nThese days I've seen my best\nNeed be lay me to rest\nSmoke, drink, relieve my stress\nHard times, they got the best of me, I guess\nThese days I've seen my best\nNeed be lay me to rest\nSmoke, drink, relieve my stress\nHard times, they got the best of me, I guess\n\n[Verse: Ab-Soul]\n(Swear to God, this the only time I’ve used this flow)\nI'm more than man, I died and I rose again\nI left these holes in my hand just so you know who I am\nAn alien, extraterrestrial, ET's a mini me, you understand?\nLook what I did, smoke like a chimney\nThen add to that, that I smoke like the hippies did back in the 70's\nSo many styles I write with a ghost\nLike I had assistance, but this is just dope\nBottles of Belaire, the prince is the freshest\nTree by the elbo we get for the LO\nSo I should be happy, but this shit is stressin'\nStaring at heaven like ''Fuck is perfection?''\nI'm popping downers to deal with depression\nCause when you the plug here come the finessing, finessing\nSmoking dope with the hitters\nDon't know no new niggas and business is business\nCan I get a motherfucking witness?\n\n[Hook]\nThese days I've seen my best\nNeed be lay me to rest\nSmoke, drink, relieve my stress\nHard times, they got the best of me, I guess\nThese days I've seen my best\nNeed be lay me to rest\nSmoke, drink, relieve my stress\nHard times, they got the best of me, I guess", "image": "https://images.genius.com/077bbd628ad3b7383f095afde8670b76.560x560x1.jpg"}], "artist": "Ab-Soul"}