{"songs": [{"title": "Until the End of Time (Remix)", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Produced By: Johnny J & Trackmasters]\n\n[Verse 1: 2Pac]\nPerhaps I was addicted to the dark side\nSomewhere inside my childhood witnessed my heart die\nAnd even though we both came from the same places\nThe money and the fame made us all change places\nHow could it be? Through the misery that came to pass\nThe hard times make a true friend afraid to ask for currency\nBut you could run to me when you need and I'll never leave\nHonestly, someone to believe in, as you can see\nIt's a small thang to a true, what could I do?\nReal homies help you get through\nAnd come to knew he'd do the same thang if he could\nCause in the hood true homies make you feel good\nAnd half the times we be actin' up call the cops\nBringin' a cease to the peace that was on my block\nIt never stops, when my mama ask me 'will I change?'\nI tell her yea, but it's clear I'll always be the same\nUntil the end of time\n\n[Hook 1: Richard Page]\nSo take, these broken wings\nI need your hands to come and heal me once again\n(Until the end of time)\nSo I can fly, 'til the end of time\nTake, these broken wings...\n\n[Verse 2: 2Pac]\nPlease Lord forgive me for my life of sin\nMy hard stare seem to scare all my sister's kids\nSo you know, I don't hang around the house much\nThis all night money makin' got me outta touch, shit\nAin't flashed a smile in a long while\nAn unexpected birth worst of the ghetto childs\nMy attitude got me walkin' solo, ride out alone in my lo-lo\nWatchin' the whole world move in slow-mo\nFor quiet times, disappear, listen to the ocean\nSmokin' 'Ports, think my thoughts, then it's back to coastin'\nWho can I trust in this cold world?\nMy phony homie had a baby by my old girl\nBut I ain't trippin' I'm a player I ain't sweatin' him\nI sexed his sister, had her mumble like a Mexican\nHis next of kin, no remorse it was meant to happen\nBesides rappin' the only thing I did good was scrappin'\nUntil the end of time\n\n[Hook 1: Richard Page]\nTake, these broken wings\nI need your hands to come and heal me once again\n(Until the end of time)\nSo I can fly, 'til the end of time\nTake, these broken wings...\n\n[Hook 2: Richard Page]\nTake, these broken wings\nYou got to learn to fly, learn to live so free\n(Until the end of time)\nSo we can fly away, 'til the end of time\nTake, these broken wings...\n\n[Verse 3: 2Pac]\nNow who's to say if I was right or wrong?\nTo live my life as an Outlaw all along\nRemain strong in this planet full of player haters\nThey conversate but Death Row full of demonstrators\nAnd in the end drinkin' Hennessy made all my enemies envy me\nSo cold when I flow eliminatin' easily\nFalls to they knees, they plead for they right to breathe\nWhile beggin' me to keep the peace (haha)\nWhen I conceive closer to achieve\nIn times of danger don't freeze, time to be a G\nFollow my lead I'll supply everything you need\nAn ounce of game and the trainin' to make a G\nRemember me, as an outcast Outlaw\nAnother album out, that's what I'm about, more\nGettin' raw 'til the day I see my casket\nBuried as a G while the whole world remembers me\nUntil the end of time\n\n[Hook 1: Richard Page]\nTake, these broken wings\nI need your hands to come and heal me once again\n(Until the end of time)\nSo I can fly, 'til the end of time\n\n[Hook 2: Richard Page]\nTake, these broken wings\nYou got to learn to fly, learn to live so free\n(Until the end of time)\nSo we can fly away, 'til the end of time\n'til the end of..\n\n[Outro: 2Pac]\nI don't know what it is that got me actin' all crazy out here\nGuess it's just my environment, how you people be treatin'\n(Until the end of time)\nShit, I'll be back in a while?\nAin't no mystery, you get what you give, feel me?\nWhen it comes I'll be like, I can't tell you what?\nMaybe it's the thug in me", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}