{"songs": [{"title": "Ja in a Bra (Ja Rule diss)", "album": "I Miss the Hip Hop Shop", "year": "2004-06-15", "lyrics": "[Sample: Ja Rule]\nIt's Murda (Ha-ha-ha)\nIt's Murda\nWe back up in this motherfucker!\nIt's Murda\nY'all know who we be\n(Yeah, ayo don't let me catch you runnin' from the back of BET either, nigga)\nR.U.L.E. I.N.C.\nMy nigga Fatal on the mutherfuckin' ones and twos\nHolla back, you bitch ass niggas\nYo, cocksucker\nIf y'all haven't heard yet, that nigga change is loose and I got proof\nGet it? \"I got Proof\"\n\n[Intro: Proof]\nWoof!\nYou know my name, it's like this: Proof!\nD12, Sicknotes\nIt's war now! Let's man up! (Woof!)\nNo prisoners! No casualties!\nAll my riders, let's ride! C'mon! (Woof!)\n\n[Verse 1: Proof]\nWord on the street is I murdered this Inc.\nYou're wack with your hands, not deservin' the heat\nYou're nervous in beef, to Irv and his peeps\nI ain't rappin' no more\nI speak through the curb in the streets (Woof!)\nYa henchman got this bitch to get a poor job\nThat midget Cookie Monster hangin' from a door knob\nY'all lucky I don't like touchin' women\nAnd don't send no peace talks\nComin' through Russel Simmons (Woof!)\nGot the right connections, mic conceptions\nYo, with beef you sleep\nYour life is definitely gone\nDon't ever seep at least a woof of rap\nYou'll need more than a Bush Attack to push me back (Woof!)\nYou think it's just 50 and Sha\nListen up, Ja, no kissin' or not\nDetroit City wishin' you die\nI know you just wanna rap and be pop\nBut before it's said and done, you gon' see 'Pac (Woof!)\n\n[Hook: Proof]\nY'all don't want war, y'all want talk\nIn the dark my dogs all bark like (Woof!)\nProof nigga, I'm a wolf\nNow you all shook\nAbout to get your brains pushed back\n\n[Verse 2: Proof]\nChris Gotti\nThis nigga had the nerve\nTo have 10 niggas sneak me\nJust to get wit' me\nI'm only 1,60, and the fact is\nMurder Inc. is DJs and kittens\nI only walked out with scratches\nWearin' a Rolex shirt\nSo if that's your streets speakin'\nYour threats don't hurt (Woof!)\nYou cowards, do something before we do ours\nI could write a Ja Rule album in two hours (Nigga!)\nRight down on your back, run your pockets flat\nLike federal tax, put your head on a rack (Woof!)\nIt's so bad, only be good is death\nIn LA, G-Unit posted and Suge left (Fat bitch!)\nI'm from Detroit, went to holla in Hollis\nNiggas is like, \"Ja's garbage, don't even bother\" (Ha ha ha) (Woof!)\nPlus your over witness, gangstas is mad\nThat 50 made \"Wanksta\" and wanksta's definition is \"ain't tough\"\nWith bitches with ya'll wanna brawl with a paint brush\nPaintin' his war marks, I'm losin' my patience\nIt ain't just D12 and Obie, homie\nCancel your shows, respect\nAnd act like you know me\nIf you say Hailie's name again and I'm catchin' a jet\n911 style, to your face and your chest\n911 style, to your face and your chest\nIt's over, nigga, gettin' wet on the set\n\n[Hook: Proof]\nY'all don't want war, y'all want talk\nIn the dark my dogs all bark like (Woof!)\nProof nigga, I'm a wolf\nNow you all shook\nAbout to get your brains pushed back\n\n[Hook: Proof]\nY'all don't want war, y'all want talk\nIn the dark my dogs all bark like (Woof!)\nProof nigga, I'm a wolf\nNow you all shook\nAbout to get your brains pushed back\n\n[Outro: Proof]\nHa! I ain't even talkin' no more\nI can't believe my name came out yo' ho ass mouth, nigga\nTalkin' 'bout like, \"We gave it to Proof\"\nYo' bitch ass was scared to come in that club, nigga\nY'all ain't got that\nI'ma tell you like this: Black-Child, Chris Gotti\nI'm on that ass, word is born!\nSo y'all niggas go get your wannabe street niggas\nRecruit who you wanna recruit\n'Cause I'ma murk all ya soldiers and recruit your bosses when it's over\nNigga, Big Proof, D12\nOnly 163, I left out with scratches, nigga\nWait 'til y'all niggas come to the D\nOh, y'all want New York? I just left Summer Jam\nI'll be back fuckin' with yo' bitch!\nAyo, Cookie Monster, come get me, nigga\nHo ass nigga\nAnd don't make me really write some shit", "image": "https://images.genius.com/d8f208c3ea47250c484492346287c1bf.571x571x1.jpg"}], "artist": "Proof"}