{"songs": [{"title": "Perfect Symmetry", "album": "E.P.I.C. (Every Play is Crucial)", "year": null, "lyrics": "[Verse 1: B.o.B]\nOpening doors like an answer key, I make the life answer to me, no fantasy\nAn evil genius, I leave my mark of the beast on the beat\nActually, I'm all like a natural disaster, I make you a causality\nAdded up, mathematically, putting numbers up, like 23\nAnd I'm Manning up like Peyton be, game is over, I should take a knee\nAnd bow out gracefully, even if you look me in my eyes\nSee you wouldn't be facing me\nSo what the fuck is pain to me?\nAnd what the hell is rain to me?\nMy life is very impressionable, like a Van Gogh painting be\nCall me Vincent inside the dimension, that's my mantra\nListen there is no competition, the mission's conquered\nDid I mention? These girls at my concert, addicted, no double entendre\nWhich is why I'm colder than a tundra on Christmas, put your hands up, can I get a witness?\n\n[Verse 2: 2 Chainz]\nWhy kill? the dark side's where I live\nHorny devils in a red dress and high heels\nYou don't have an idea how many niggas done took my ideas\nI take flight, I'm so bright, I don't even get no light bill\nYou road kill while I'm driving\nI'm high-fiving, my dime riding, My time shining\nFrom at the club and I'm outta town but I'm lying around it\nDeuce chains I'm feng shui, everyday is my birthday\n2 gats at the park, you don't wanna see these guns play\nPatron and lemon lime, I got her back, all in her spine\nI look my wife up in the eyes, and I think about  another dime\nMy atmosphere is ratchet here this right here is Bally gear and\nI keep on killing shit\nAnd I don't even have no tatted tear\nYou can put the motherfucker Caddie here\nYou can put the motherfucker Beemer there\nStill got 2 more garage places, Louies on I unlaced it\nEvery verse I'm going crazy, every girl it's going crazy\n2 guns, 2 chains, 2 rings, 2 bracelets\n\n[Instrumental Solo]", "image": "https://images.genius.com/e5a4565350f88e7eb8d8b6e1a5b364fb.500x500x1.jpg"}], "artist": "B.o.B"}