{"songs": [{"title": "False Pride", "album": "The Sneak Attack", "year": null, "lyrics": "[KRS-One]\nOkay now, listen to this..\n{*sound effect: seagulls*}\nA mystical teacher sat by the seaside\nIt was about five o'clock cause we heard the free ride\nAnyway; the teacher was talking in stride\nSitting upon a rock that was wide\nAnd warning against false pride\n\"Come to where I reside!\" a woman cried\nAnd the teacher replied, \"Do you serve your fish fried?\"\n\"Yes,\" she replied, \"with potato salad on the side.\"\nAnd the teacher replied, \"Well where do you reside?\"\nShe said, \"Up on the hillside, it's not a far ride\nIf you came to have dinner, I would be so gratified.\"\nThe teacher replied, \"It's six o'clock, seven o'clock, you decide.\"\nShe replied, \"Seven o'clock, do you like stir-fried?\"\nShe was mystified and felt so dignified\nThe teacher was coming to the house where she resides\nSo she purified with pesticides\n{*sound effect: chemicals sprayed*}\nCalled her friends up nationwide\n{*sound effect: phone being dialed*}\nSome of her friends were tongue-tied they felt so glorified\nShe made steamed fish, baked fish, fish that was fried\nSoup, steamed vegetables, potato salad on the side\n{*sound effect: food cooking*}\nYou could smell the bread in the oven far and wide\nNatural juices and water purified\nOrganic fruits brought from the countryside\nWith silver forks and knives placed side by side\n{*sound effect: silverware clinks*}\nYou could not be dissatisfied;\nLooking out the window staring at the mountainside\nYou would have died\n6:59 she's swollen with pride\nAs the moment intensified, there's a knock from outside\n{*sound effect: door knocking*}\nShe opens the door, for the teacher has arrived\n{*sound effect: door creaks open*}\nBut to her surprise, it was a bum who cried\n\"Please, I smelt the bread from outside!\nOne piece,\" and then she replied\n\"The teacher is coming, he's soon to have arrived\nYou're making me look bad, come on now, step aside!\"\nThe bum then replied\n\"When I say I'm hungry I haven't lied\nGive me some of that chicken that you just fried.\"\n{*sound effect: food cooking*}\nShe replied, \"Chicken - fried?\nNo that's for the teacher, you're not purified\"\nThen she slammed the door and went back inside\n{*sound effect: door closes*}\nSat on the couch with the TV Guide\nShe looked at the clock, it was 7:09, then 7:30;\nHe still hasn't arrived\nEight o'clock, she's on the downside\nNine o'clock, by now she's teary-eyed\nShe's pissed off and her anger multiplied\nShe cried, then fell asleep dissatisfied\nNext day she woke up, and was preoccupied\nWith meeting the mystical teacher who lied\nWhere could he hide?\nShe ran down by the seaside\n{*sound effect: seagulls*}\nHe was there teaching about - false pride\n\"You lied!\" she replied, \"You lied!\nYou said you'd be there at seven o'clock, you lied!\"\nHe replied, \"No I have not lied\nI came at 6:59, and you told me to move aside\nI asked for bread and the chicken that was fried\n{*sound effect: food cooking*}\nAnd you said, that I wasn't purified.\"\nShe replied, \"I wasn't notified!\nI had no idea that you was the bum that cried!\"\nAnd the teacher sighed, then replied\n\"This concludes our lesson on false pride.\"", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}