{"songs": [{"title": "I’m Not a Saint", "album": "Something Else", "year": "2013-07-30", "lyrics": "I'm not perfect (x2)\nThat ain't right (x4)\n\n[Intro]\nAnimosity surround me\nAnd it's all because I found me\nHow deceptive can the clown be?\nEnough to leave the frowns upon the face of those who foul me\nSo much evil in my mindstate\nMany think that they can define Yates\nBut can not tame the wicked primate\nWho preaches sinful thoughts and lead the listeners on blind faith\n\n[Verse 1]\nI didn't mean to hurt a soul here\nBut my inner demon has no fear\nOf making choices that'll make you po' tears\nBlack transparent flies show me that the soul near\nI see 'em then they disappear quickly\nCould this be some other shadows signaling the sickly?\nForgive me\nGood people, I gotta let them know before they pick me\n\n[Hook]\nI tell 'em (I'm not a saint,) no, (oh my Lord)\nI'm crying out\nI'm crying out\nI tell 'em (I'm not a saint,) no, (oh my Lord)\nThat ain't right (x4)\n\n[Verse 2]\nBrian Dennis was in love with her\nI exchanged kisses and hugs with her\nI never should've but I dugged in her\nNever say no names but her thing was that she loved pictures\nAnother nigga told my nigga\nHis reply to me was \"Why, nigga?\"\nI learned my vices, they divide niggas\nHad a chance to say I'm sorry and then he died\nMan...\nSo hurt that I couldn't stand\nMeanwhile my dark blob expands\nAnd touching my loved ones dissolving their helping hands\nMy heart loves\nMy brain takes\nThey never know they stepping with a bane date\nI put a gun to my insane face\nThat way your loving hearts I can't break\n\n[Hook]\n\n[Verse 3]\nBlack transparent flies again\nCould be spots on your eyes, my friend\nI thought that the love was gonna try to win\nBut now I see I'm stuck in here to see the evil rise again\nMy brain is so gung-ho\nThis all started when I was young though\nThis thing I won't keep running from, so\nI got molested by my 7th grade teacher, Mrs. [censored]\n\n[Hook]\n\n[Outro]\nDamn... To the people who love me, I apologize for me back then\nI was intoxicated, I was on drugs, and now there's a new me\nNow let's turn up", "image": "https://images.genius.com/ae74b38ee85ff63c76433b31ae507a23.1000x1000x1.png"}], "artist": "Tech N9ne"}