{"songs": [{"title": "The Martini", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Intro: Krizz Kaliko]\nThe Martini\nIn movie terms, directors use this phrase\nTo describe the last shot of the day while on set\nThe stories you are about to hear are true\nNames have been kept the same to reflect the Strange\nThis is the Martini..\n\n[Verse 1: Tech N9ne]\nThis is Sam\nHe was so in love with her\nBut she was young and so that put her off in a jam\nThough she was sweet as a yam\nShe wanted to explore other options with her man\nStraight sending Sam into a rampage\nAnd no matter what his fam says\nHe's lost without this woman and don't wanna live any damn ways\nNow he's thinkin', if he ain't gon' live, she ain't gon' live\nAnd the other man's mercy, he ain't gon' give\nThis what love do, it cops a .38 snub to\nKnock on your door, and take somebody that used to love you\nRub you, the wrong way, then it's blood true\nLove through, she's slug one and he's slug two\nThen on a rainy evening, with a panicked feelin'\nWent to her home and looked in the window and Sammy sees them\nThe door's between her and the Necromancer\nAnd what you think is gon' happen if she answers?\n\n[Hook: Krizz Kaliko]\nTake a drink, it's more than what you think\nI gotta let you know, don't plan on letting you go\nBut if you have to leave, that's where we'll end the scene\nThis is the Martini, last shot's for you or me\n\n[Verse 2: Tech N9ne]\nYo, this is Isaiah\nI guess he was, I'd say a\nLadies man, everyone used to call him the KCI Playa\nFlying multiple chicks in, give the stick then dismiss them\nBut somethin's gonna happen that'll twist him\nHe fell in love with a beautiful black woman\nBut he ended up having a couple problems with that woman\nTalkin' to other men, did it behind his back on 'em\nFacebook, computer love, crept on the Mac on 'em\nNow he's salty, 'cause he found the woman he loves is faulty\nHe told her at the very beginning, \"Don't you ever cross me\"\nNow that she did it, he plans to do something unlawfully\nGet a gun off the street, because he was treated so awfully\nOne bullet for her, one bullet for him\nCrimes of passion, ain't no more pullin' for them\nAnd the worst way, we broke apart, it really hurts lady\nI've gotta go, but yo, you gotta go first baby\n\n[Hook: Krizz Kaliko]\nTake a drink, it's more than what you think\nI gotta let you know, don't plan on letting you go\nBut if you have to leave, that's where we'll end the scene\nThis is the Martini, last shot's for you or me\n\n[Verse: 3 Tech N9ne]\nThis is Brian\nHe was a rebel and stayed on another level\nAnd had no intentions of dying\nHe loved Kim a lot, above them was not\nBut a jealous ex-husband would love them to rot\nI guess he loved Kim still\nHis only thoughts him, them, kill\n'Cause he a coward motherfucker\nOn Christmas Eve he broke in and waited in they house for hours\nCrazy motherfucker!\nBrian pulled up with Kim and little Alissa in the car\nSaw a shadow in the house from afar and said, \"Wait\"\nGot out the car, opened the gate\nWalked in the house and her fucking ex sealed my nigga's fate\nThat was my best friend, bitch-ass nigga\nWalked out the house and shot Kim right in front of Alissa\nThen he saved the last shot for him, blast!\nNow you better hope I don't go to hell, because I'ma be on your ass!\n\n[Hook: Krizz Kaliko]\nTake a drink, it's more than what you think\nI gotta let you know, don't plan on letting you go\nBut if you have to leave, that's where we'll end the scene\nThis is the Martini, last shot's for you or me\n\n[Outro: Krizz Kaliko]\nExecutive producer: Travis O'Guin\nAssociate producer: Dave Weiner and Ron Spaulding\nProject consultant, general management: Bob Grossi, Brian Shafton and Ben Grossi\nProduction assistant: Cory Lloyd, Glenda Cowan, Don O'Guin, Cory Nielsen and Brian Fraser\nProject management and publicity coordinator: Korey Lloyd\nAnd publicity by: Richie Abbot and Megan McLean\nA&R: Travis O'Guin and Aaron D. Yates, Tech N9ne\nLegal: Bob Liberman, photography: RW2\nArt direction and design: Liquid 9\nMarketing and promotion: Britton Kimler and Chris Rooney\nStreet marketing: Aaron Bean and Josh Rickards\nInternet marketing: Brad Morrow-ow-ow\nCreative consultant for Strange Music: My main man David Temple\nAlbum score by: Michael \"Seven\" Summers\nRecorded and mixed by: Robert Rebeck\nMastered by: Tom Baker and additional vocals by me (Kali Baby)\nThis is the end of K.O.D", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}