{"songs": [{"title": "Leslie Nope", "album": "Fuck the Money", "year": "2015-12-11", "lyrics": "[Hook]\nI don't fuck with these niggas, nope\n\n[Verse 1]\nWhy all these lames wanna riff?\nIt's an ass-kickin' party and your name's on the list\nShe keep my name on her lips\nGood year like my name on the blimp\nI get insane off the rip\nFlip, let the beef cook like the flame on the rib tip\nGoin' out in a blaze with the biscuit\nGot the streets hooked like the 'caine that you sniffin'\nWhy? Why would you ever go against it?\nIf I gave a fuck about you it'd be borderline offensive\nIt's senseless, stalkin' on my page and my mentions\nWalkin' on eggs and you soundin' all defensive\nHear dogs hollerin'\nThat's your ego talkin' and you're listenin'\nWhen it get to whisperin' them snakes start slitherin'\nRappin' how they're rich and all their jewelry is glistenin'\nYour mortgage underwater like I walked in on a christenin'\n\n[Hook]\nThat's why, I don't fuck with these niggas, nope\nI don't fuck with these niggas, nope\n\n[Verse 2]\nI'm smoother than a criminal\nI never trust niggas with no books in the livin' room\nWhen there's no electricity, what the fuck is digital?\nBeyoncé married Jigga but they think we all jiggaboos\nDon't get confused by the lyric\nProtector of my city, stand alone on the citadel\nWake up in the mornin', say a prayer cause I'm livin' well\nProof of a miracle, it's spiritual\nThese niggas go from robbin' punchlines, to bein punchlines\nFor lunchtime, you ain't got the heart when it's crunch time\nSoldiers gettin' shot on the front line\nNot really for a cause but for they brothers they lay their lives when it come time\nTrust being brave is a challenge\nIf every soldier was brave, there'd be no word for valor\nThe nerve of these cowards, who are you, the herb of the hour?\nI treat my girl like horiculture, I'm preservin' the flower\n\n[Hook]\nThat's why, I don't fuck with these niggas, nope\nI don't fuck with these niggas, nope", "image": "https://images.genius.com/23223285f9cac119c15336b3e08cd741.498x498x1.jpg"}], "artist": "Talib Kweli"}