{"songs": [{"title": "No Introduction", "album": "Life Is Good", "year": "2012-07-17", "lyrics": "[Produced by J.U.S.T.I.C.E. League]\n\n[Intro]\nJ.U.S.T.I.C.E. League\n\n[Verse 1]\nPS 111 had free lunch\nEmbarrassed but managed to get a plate...\nWe was kids hungry\nMom's working, I was famished\nShe getting home late...\nSo I decided now I'm in charge\nEither stay full or starve\nCorner store like \"Mister, spare-a-quarter\"\nBefore Air Jordans, Kareem Abdul-Jabbars\nTrying to cop quarters and trying to move that hard\nRoll with a shooting squad\nHow could I not succumb? How could I not partake?\nFifteen, I got a gun\nSixteen, I robbed a train\nLicked off a shot for fun\nWhat's got inside my brain?\nA hustler's job ain't done, til he becomes a king\nBut I'm a righteous son, despite I'm in the midst of\nDudes who switch up and change\nThey wanna carry me like I'm some kind of lame\nI never let them though, I just forgive them though\nEither that or the pistol blow\n\n[Break: sample]\n\"Say YEAH! Haha, thank ya! Ahhh, Hallelujah!\nY'all don't hear me now! Somebody help me!\"\n\n[Verse 2]\nI remember early mornings, syrup sandwiches, sugar water, yeah\nWalking up the dark stairwells, elevators was out of order, yeah\nWorth two hundred million now\nBicentennial nigga, flat screens and condominiums\nBrazilian women on Xannies they pulling off panties\nI'm pushing forty, she only twenty-one\nDon't applaud me, I'm exhausted G\nMe and my red cup, my blunt and my red cup\nY'all wouldn't know me without one, I keep a fresh cut\nRemember talking to Biggie inside his Lex truck\nSaid stay fly when you bummy, keep your pajamas Armani\nHood forever, I just act like I'm civilized\nReally what's in my mind is organizing a billion Black motherfuckers\nTo take over J.P. and Morgan, Goldman and Sachs\nAnd teach the world facts and give Saudi they oil back\n\n[Break: sample]\n\"Say YEAH! Haha, thank ya! Ahhh, Hallelujah!\nY'all don't hear me now! Somebody help me!\"\n\n[Verse 3]\n1990's Polo Ralph Lauren on him\nGone a few years, the whole world snoring on him\nGirls all up on him\nI spread em, hit 'em and dead 'em\nShe says, third leg from a legend is sheer heaven\nShe says, it is the greatest loving\nThe tales you hear is the truth on me\nWho wasn't the most faithful husband\nReveal my life, you will forgive me\nYou will love me, hate me, judge me, relate to me\nOnly a few will, this how it sounds when you're too real\nThey think it's just music still\nWell I am a graphic classic song composer\nMusic notes on sheets, I wrote this piece to get closure\nSome of y'all might know Kelis\nThis goes to her with love, also goes to y'all, let's see\nThe craziest things already happened to me\nSo either you'll be laughing at me or you're laughing with me, ha\n\n[Break: sample]\n\"Say YEAH! Haha, thank ya! Ahhh, Hallelujah!\nY'all don't hear me now! Somebody help me!\"", "image": "https://images.genius.com/d77829b400779c24c98b27bec8d6bfda.800x800x1.jpg"}], "artist": "Nas"}