{"songs": [{"title": "Fuhgidabowdit", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Verse 1: LL Cool J, Redman & Method Man]\nGet the fuck out of here, I'm LL Cool\nSoakin' wet with bad bitches in the indoor pool\nYo what am I, an animal?\n'Cause I bagged your's too\nOne bad mooley, nigga you can't school me\nI'm the G.O.A.T., what I wrote cause fire and smoke\nTo think I started on the choir singin' solo for the pope\nTell your mama please, get up off her knees\nYou can't wear yellow spandex with a ass like cottage cheese\nOpen toed shoes, feet smell like collard greens\nToes Kriss Krossed like she on J. Dupri's team\nBunyon you're sittin' up like beach balls in the sand plus\nA mouth full of rotten teeth with a dildo in her hand\nWho the fuck let you in, all my assistants are fired\nNow I'm lookin' for some washed up rapper that I can hire\nYou know some old school nigga with a bit of attitude\nPay him $1500 to fuck a girl in an interlude\nYou say I'm souped up, well, soup is good food\nSo what I scratch my nuts, HOW THE FUCK IS THAT RUDE?\nFor soul glowin, afro pickin'\nS-curl hatin', Jamaican rum sippin'\nKid I'll burp on your girl buttcheeks\n'Cause honey had my nuts like two red beets\nI'm bananas, out of my fuckin mind they won't let me back in\n'Cause I was down before the hype like Dusty Rhodes and Bob Backlund\nBruno Samartino, Stan Staziak\nNow The Rock and Stone Cold are my favorite maniacs\nThe top rooster pluckin', chickens when I’m cluckin'\nWWF stands for When and Where we Fuckin\n\n[Chorus: LL Cool J]\nFuhgidabowdit\nYo kid\nFuhgidabowdit\nFuhgidabowdit\nYo, Fuhgidabowdit\nYo, ey, Fuhgidabowdit\nEy, ey, Fuhgidabowdit\nEh, Fuhgidabowdit\n\n[Verse 2: Redman, LL Cool J & Method Man]\nYo, yo, yo, yo, yo, yo\nI'm like Menace II Society\nI roll through the drive-thru like Kane\nJack you for the cheeseburgers and chicken wings, and Daytons too\nSee my boys down the ride crack patience too\nBricks, walk around, snorkel down\nMacaroni and cheese Timbs broke out the orphan house\nTransportin out, the poison in 'em\nBox 'em up in the aisle with the frozen dinners\nAnd them niggas that ran...\nMy goal's to get 'em\nWith the heat seekin' flow with, fo' antennas\nDoc's Da Name, that's why y'all fuck with me\nI'm pocket change, the bums don't fuck with D\nObjective in 'em, Carlo inspection sticka\nCheck the pen, I write like a X was in 'em\nTeeth grittin', I brawl with a major league mitten\nWhere the stash at, punk?\nYo, yo, and he takin me with him\n\n[Chorus: Redman]\nFuhgidabowdit\nYo, Fuhgidabowdit\nAyo nigga, Fuhgidabowdit\nYo, yo, yo, Fuhgidabowdit\nYo dog, Fuhgidabowdit\nYo you heard, Fuhgidabowdit\nAyo you hear me, Fuhgidabowdit\nYo nigga, Fuhgidabowdit\n\n[Verse 3: Method Man & Redman]\nYo, this be a Cool J function, music get my blood pumpin'\nDown for whatever, which usually means I'm up to somethin'\nWho owe me somethin', them niggas in the back frontin'\nThey rockin' cuffs and, put the eight up, repercussion\nYou know my name, so there's no need for introduction\nI'm Mr. Done it all, so none of y'all can do me nothing\nBitch I'm grown, puffin on that one and bone\nBet me and Queen Bee be swingin' 'til the honey come\nBacks get blown, trash get thrown\nIn headlocks, from this view, I'm fuckin Star Jones\nI'm red hot just like candy, in '95 won the Grammy\nYo, he use it as an ashtray now\nNiggas can't stand or understand me, yeah\nEither or, funky headhunter wild comanchees with shitty draws\nWhat's that shit, what shit, that shit on your lip\nI can't smoke with ya kid, but I'll save ya the clip...\n\n[Chorus: Redman Method Man]\nFuhgidabowdit\nAyo nigga, Fuhgidabowdit\nYo, what the fuck, Fuhgidabowdit\nYo, Fuhgidabowdit\nUh, Fuhgidabowdit [DMX growl]\nAyo dog, Fuhgidabowdit [DMX growl]\nBitches can't stand me, Fuhgidabowdit [DMX growl]\nStill pullin' down her panties, Fuhgidabowdit\n\n[Verse 4: DMX]\nThe shit I see every day brings tears to my eyes\nHow I holla at my niggas brings ears to my cries\nStick niggas for not knowin', then teach 'em somethin'\nBitch niggas talki' 'bout you from the streets you frontin'\nI never liked you, and you, I don't know\nSo what the fuck you think is 'sposed to happen, we gon go\nMano a mano, whatever nigga, I'm gon dust you\nIf you can't take that ass whoopin', I'm gon' bust you\nTalkin to you like a lil nigga 'cause you is\nBut don't forget that daddy's gonna always love his kids\nFaggot niggas got the nerve to wan' know why I rob\nYou guys are livin' phat while everybody else'll starve!\nThat pretty shit is lame, fuck what your name hold\nBreak a nigga off somethin', watch a nigga gain fo'\nNow you layin somewhere cold, stiff as shit\nAnd all that riffin' shit, mens will get you hit, bitch\n\n[Outro: DMX]\nFuhgidabowdit", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}