{"songs": [{"title": "Second Place", "album": "Success Is Certain", "year": "2011-06-06", "lyrics": "[Intro: DJ Premier & Royce da 5’9”]\nNickel, tell 'em what it is\n(This is a world premiere)\n\n[Verse 1]\nLook, I'm in a zone for reala\nIn a freezer with Medusa, I'm fucking a stone-cold killer\nYour bitch vibing, I'm inside her and I tell your kids this:\nDaddy's been doing more dick riding than Kari Wigton\nI'm very venomous, you very innocent and\nI will send a monster to your house, call him Harry Henderson\nOh my God, I was just in jail, then the\nDevil caught pneumonia, and it made me sick as hell\nYou niggas counting me out can get the riches still\nYou're all in the Matrix, shoulda picked a different pill\nYou about to see how far that Paul Rosenberg will go\nThe height of my game is like DeMar DeRozan vertical\nNo one understands me, only one sicker than me is Em\nI'm the new 'D' MC, it runs in the family\n\n[Interlude]\n\"Man why that nigga gotta bring Em name up all the time?\nMan that nigga wouldn't even be rich without that nigga\"\nShut up faggot!\n\n[Chorus]\nI come to embarrass y'all rappers\nI should run a marathon backwards\nSo I could see what second place look like\n(Too many sick niggas, Nickel bring the remedy)\n(Make it real clear)\nI come to embarrass y'all rappers\nI should run a marathon backwards\nSo I could see what second place look like\n(You not ready for the raw deal, it's all real, kiss the ring, be gone!)\n\n[Verse 2]\nI'm the magnificent with the sensational style\nMy wedding with the streets got the cake but no vows\nI'm arrogant as fuck, who cares? You suck\nRappers talking about \"We the best\" have been to Paris too much\nWho hot? Who sick? Shit, I'm like a Theraflu slush\nY'all ain't fly, y'all fallin' slow with the parachute up-up\nI'm a face-slapper, niggas sleeping on an outfit\nCall us Taylor Gang 'cept we Wake and Bake rappers\nSlaughter/Yelawolf responsible for haters' actions\nY'all on Gilligan's Island, find a greater Captain\nHa-ha, victory laugh\nEven my photographer's happy, picture me mad\nI feel well, your bitch sucked my dick, I nutted on the floor\nLeft her standing there crying over spilled milk\n\n[Chorus]\nI come to embarrass y'all rappers\nI should run a marathon backwards\nSo I could see what second place look like\n(Too many sick niggas, Nickel bring the remedy)\n(Make it real clear)\nI come to embarrass y'all rappers\nI should run a marathon backwards\nSo I could see what second place look like\n(You not ready for the raw deal, it's all real, kiss the ring, be gone!)\n\n[Verse 3]\nMy swing's like chains on a playground\nI bust fly plus I'm about to put some wings on a Greyhound\nMy theory of you is: you lie and you drink beer\nAnd I ain't hearing ya so you must be from Liberia\nI wave bye like Hitler, 100-round Thumper\nBulletproof what? You gon' need an underground bunker\nI aim where you should go\nI put my whole life on the net, even my weapons\nI am Bazooka Joe, ugh\nWe the shit, nigga eat a dick\nWe'll make him eat his words, we the stones, he the sticks\nI'm going yelling Shady everywhere\nSmacking niggas' bitches with they lipstick and they baby with they teddy bear\nTo you and your man: ain't gon' be no Talladega Night\nI come to question y'all and y'all don't know what to do with your hands\nNickle Preme, killer team\nAt a different dealer every day like a fickle fiend\n\n[Chorus]\nI come to embarrass y'all rappers\nI should run a marathon backwards\nSo I could see what second place look like\n(Too many sick niggas, Nickel bring the remedy)\n(Make it real clear)\nI come to embarrass y'all rappers\nI should run a marathon backwards\nSo I could see what second place look like\n(You not ready for the raw deal, it's all real, kiss the ring, be gone!)", "image": "https://images.genius.com/0400a9a36500f68a15def09fbe59a648.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}