{"songs": [{"title": "Worldly Angel", "album": "Special Effects", "year": "2015-05-04", "lyrics": "[Verse 1: Tech N9ne]\nOooh\nYeaaah\nMama told me I was her angel sent down from heaven\nWhen I was a little one enthusiasm caught my dome and lessons\nTeachin' me 'bout the Seven and how I should be a reverend\nShe really gave me a \"this world is not my home\" impression\nSent down to help lost souls and fight their foes\nAngels chose to toss woes when the night air's cold\nBut it got to me when she looked up and said (I'll soon be gone)\nThen I was right there, froze, cause that meant, I'd be alone\nThe second, that she was gone, I was beckoned by my brethren\nThen my head spinned like (buzz), Tech went to be a grown\nA complex gent, that freed the wrong\nAnd blessed it with the best scripts\nI invested my whole life, chose light\nBut the people down here, don't know what to do with it\nWhen I fly away, cause I really don't know\nToo many that's true with it, ya know?\n\n[Bridge]\n(I know)\nYa know?\n(I know)\nYa know?\n(I know)\nMan...\n\n[Hook]\nThis world is not my home\nThis life will soon be gone\nAnd one day, I'll spread my wings\nGonna fly away, I'm gonna fly away\n\n[Verse 2: Tech N9ne]\nThey don't understand me, when I say everybody's family\nWith the evil deeds they proved me wrong, I failed\nTo the heavens you can hand me\nCause my god will never just land me\nDown deep with Satan, that is not my home in hell\nBut where I'm living now, people are living foul\nThey keep they heaters on the key to stone\nI'm mentally stiffened, wow\nA lot of love is missing now, so (I'll soon be gone)\nCause they don't wanna listen to what I'm giving thou\nLove, but who gets it usually disperse\nB-b-but wait, it gets worse, I found out that it never helped it hurts\nI thought my job was to give it all the works\nTo many it's worldly, when you can't control your thirst\nSo if I can't bring happy, I'll go\nFlings that this queen catch me really seems tacky, ya know?\n\n[Bridge]\n(I know)\nYa know?\n(I know)\nYa know?\n(I know)\nMan...\n\n[Hook]\nThis world is not my home\nThis life will soon be gone\nAnd one day, I'll spread my wings\nGonna fly away, I'm gonna fly away\nI'm gonna fly away\n\n[Verse 3: Tech N9ne]\nFear not, cause this ain't the point when you hear shots\nMe, and my peers got, by God's will dropped in the weird pot\nI wanna ascend cause I'm feelin' like I'm near shock\nMama gone I'm feelin' like I want the rest of my years blocked\nYou got your ears locked?\nI wanna fly away cause inside I have eternal tear drops\n\n[Hook]\nThis world is not my home\nThis life will soon be gone\nAnd one day, I'll spread my wings\nGonna fly away, I'm gonna fly away\nI'm gonna fly away\nI'm gonna fly away\nI'm gonna fly\n\n[Outro]\nStrange Music", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png"}], "artist": "Tech N9ne"}