{"songs": [{"title": "Gangsta Shap", "album": "Misery Loves Kompany", "year": "2007-07-17", "lyrics": "[Verse 1: Krizz Kaliko]\nHuh, yo, it don't start until I get there\nShow 'em how to Gangsta Shap\n'Cause where I'm from, that's where all the gangstas at\nAnd when we come, yo we get to actin' a ass\nSo we go dumb if we get to moving too fast\nSee we go stewie-ooee, rep from the Bay, all the way\nTo Missouri-ouri, back it up on me mama\nLook what you do to me-ooowee\nWe do it wrong gone off Caribou Lou-ee-ooee\nOr that super dewy-ooee\nCheers!\nOne or two beers and you shap, it's like\nLean and rock with it, only you don't lean and snap, you like:\nLeft side, right side, hands about chest high\nThen you wink at shorty in the corner with the left eye\n(How you doing?) I'm off a little somethin' leanin'\nWeed got me nervous, got a lil' trouble breathin' (breathin')\nMe and my heathens is about to turn this mother out\nDip in the whip, burn rubber out Gangsta Shap\n\n[Hook]\nGangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\n\n[Verse 2: Kutt Calhoun]\nKutty wait a minute, hold up\nIt's too many chiefs and not enough soldiers\nFor the world wars, standin' on the front line\nTighten my toga, I'm a Greek god\nBlood affiliated, Deuce Klik Street Mob\nAnd I put this souly on my dookie brown dickies\nHail to the B side\nCapnaptavate these Killa City killings\nNigga you can't calculate big cli-dips long\nInner City menaces, these kids get it on!\nWe don't fight no more, all we do is this\nAll we do is this, lately it's been through a bitch\nAnd that's the cost for livin' in the center of Killa City\nWhere these niggas Willy Wonka chop at any men\nWho feeling they really raw, get to pullin' dogs\nAt the dark da-nin-nin-nents, nobody for you to call\nWhen they do dissolve, just a harsh remembrance\nYou might've got through it all, but was too involved\nAnd it's very scary, it's kind of pathetic\nNobody is sympathetic, when you dead and buried\nWe rugged and rigid, no pun is intended\nAnd when them thangs go clap\nWe gangstas mane, we bang and trap\nRemember killas don't dance, man\nWe G-G-G-Gang-G-G-G\n\n[Hook]\nGangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang-\n\n[Verse 3: Tech N9ne]\nI remember my school days, when I was a dancer\nBack when LL Cool J was walking with a panther\nActually dancing was not, but rap was the answer\nBut with the shap, it's cool for the gangsta to dance too\nStill here we stand with this dance that spread like a cancer\nCool for the man, even the woman or the baby in pampers\nDance that is deep and it's dirty like the crevice of your hamper\nRaisin' your hands up high in this bitch 'cause you amped up (go!)\nNike Air Jordan at the bottom in the middle was a Nautica pair\nLot of erotica there, but up top I got the gangsta black\nDoin' the Gangsta Shap, nigga thanks for that Imperial nigga\nYou don't want to see me go speedy, bro need to see me flow\nNever get this shappin' up out of me, he better see the dough\nWe be so cold with it, boy we need some wool mittens\nLadies just roll with it, everything is cool, kitten\nTilt your head like you got some screws missin'\nBut have that look on your face like when you say you bullshittin'\nGangsta Shap\n\n[Outro]\nOoh man, that Gangsta Shap shit, man\nI'm feeling that shit, man\nYa gotta show me how to do that dance, man\nWhere y'all from anyway, man?\nY'all from Missouri? Ya talking 'bout KCMO?\nRoll on Missouri, man\nI'm feeling that shit, man\nThat 'ight there, man, that there\nThat shit dope, baby\nAll day, every day, man\nThis KCMO\nFrom the hood where it's all good, man\nWe Gangsta Shap\nKansas City, that's where them gangstas at, you know\n\n[Hook]\nGangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang- Gangsta Shap\nGang- Gang-", "image": "https://images.genius.com/d568b86ce102e78c9c49f201c1a48234.953x953x1.jpg"}], "artist": "Tech N9ne"}