{"songs": [{"title": "Darkside", "album": null, "year": "2013-03-19", "lyrics": "[Verse 1: Tech N9ne]\nYou don't really know what I can do to niggas if they penetrate the home of mine\nLoad it up and hit the motherfuckers with the Smith and Wesson 729\nDirty Harry on them real quick\nMake a nigga feel real sick\nFunny how they wanna get me now that everybody swingin' on my dillznick\nWhat you wanna do?\nNigga what?\nTrippin' with the crew give it up\nI'ma live it up\n6 6 triple 8 46 99 3\nFind these niggas overseas makin' hella cheese\nFuckin bitches lookin' Chinese\nIf you gettin' down with the sickness\nIf you clowns you can get this\nI know it sounds hella wicked\nIf you frown you a dipshit\nWe can do it nigga if you wanna but you never will prosper\nNever fuck with the darkness I'ma hit the playa haters\nGet a little cocky nigga I'ma live it up!\nI'ma get what money can't get us, never with the funny brand niggas\nStick 'em with the sickening shit and really wicked like a nicotine (BITCH)\nGimme the big (car)\nGimme the big (house)\nGimme the big booty bitches\nMe and Ockwizzle livin' in Cockdizzle\nOn the mission for them riches\n\n[Hook: Hopsin]\nNow I'm on the darkside representin'\n'Cause I lived a hard life and heaven didn't\nArrive in time enough to save me\nSo I'm givin' you back what you gave me (Don't blame me!)\nDon't bother me while I'm trying to pack\n'Cause I'm goin' away and I ain't comin' back\nDoctors say my brain's a little off track\nAllow me to tell you a few small facts\n\n[Verse 2: Hopsin]\nYo, do you know what the fuck it's like stuck inside this hell hole tryna crush a mic?\nThere ain't a buck in sight\nI'm sleepin' with the dust and mites\nI scream because I ain't got the guts to cry\nWhat the fuck did I, ever do to be put here?\nIs it because I'm a black nigga who looks weird?\nI try making 2010 a good year\nBut I don't even see an outlet I could gear\nEvery single morning when I be waking up I'll be tryna develop a dope new age rap\nBut before doing it I going to the kitchen\nAnd get me a couple noodles and a Kool-Aid pack\nMotherfuckers wanna slow the momentum\n'Cause when I kick a syllable I never caught up the venom\nI done battled a lot of niggas but they don't get to win 'em\nThe minute I pin 'em up, hell's where I'm hoping to send 'em, come on\nMy careers got no solution\nCan't wear my contacts I got no solution\nEverybody keep on tellin' me I'm s'posed to do shit\nIf you was on the edge how close would you get\nTo cutting a neck for some fuckin' respect?\n'Cause you stuck in a debt and they ain't cutting a check\nThe pain up in your chest\nAll the sudden ejects\n'Cause you turned a record in but they wasn't impressed\n(Fuck that!)\n\n[Hook: Hopsin]\nNow I'm on the darkside representin'\n'Cause I lived a hard life and heaven didn't\nArrive in time enough to save me\nSo I'm givin' you back what you gave me (Don't blame me!)\nDon't bother me while I'm trying to pack\n'Cause I'm goin' away and I ain't comin' back\nDoctors say my brain's a little off track\nAllow me to tell you a few small facts", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}