{"songs": [{"title": "Tha Shiznit", "album": "Doggystyle", "year": "1993-11-23", "lyrics": "[Verse 1: Snoop Dogg]\nPoppin', stoppin', hoppin' like a rabbit\nWhen I take the Nina Ross, ya know I gots to have it\nI lay back in the cut, retain myself\nThink about the shit, and I'm thinkin' wealth\nHow can I makes my grip\nAnd how should I make that nigga straight slip\nSet trip, gotta get him for his grip\nAs I dip around the corner, now I'm on another\nMission, wishin', upon a star\nSnoop Doggy Dogg with the caviar\nIn the back of the limo, no demo, this is the real\nBreakin' niggas down like Evander Holyfield, chill\n'Til the next episode\nI make money, and I really don't love hoes\nTell you the truth, I swoop in the Coupe\nI used to sell loot, I used to shoot hoops\nBut now I make hits every single day\nWith that nigga, the diggy Dr. Dre\nSo lay back in the cut motherfucker 'fore you get shot\nIt's 1-8-7 on a motherfuckin' cop\n\n[Verse 2: Snoop Dogg]\nBoy it's gettin' hot, yes indeed it is\nSnoop Dogg is on the mic, I'm 'bout as crazy as Biz\nMarkie, spark the chronic bud real quick\nAnd let me get into some fly gangsta shit\nYeah, I lay back, stay back in the cut\nNiggas try to play the D-O-G like a mutt\nI got a little message, don't try to see Snoop\nI'm finna fuck a bitch, what's her name? It's Luke\nYou tried to see me on the TV, you'se a B.G\nD-O-double-G, yes I'm a O.G\nYou can't see my homie Dr. Dre\nSo what the fuck a nigga like you gotta say\nGotta take a trip to the MIA\nAnd serve your ass with a motherfuckin' AK\nYou can't see the D-O-double-G, 'cause that be me\nI'm servin' 'em, swervin' in the Coupe\nThe Lexus flexes from Long Beach to Texas\nSexist hoes, they wanna get with this\n'Cause Snoop Dogg is the shit, biatch!\n\n[Verse 3: Snoop Dogg]\nAhhhh, I'm somewhat brain boggled\nSo I look to the microphone and slowly start to wobble\nGrab it, habit, stick it to the plug\nIt's Snoop Doggy, I got a got a fat dub\nSack of the chronic in my back pocket loc\nNeed myself a lighter so I can take a smoke\nI toke everyday, I loc everyday\nWith the P-O-U-N-D and my nigga Dr. Dre\nLay back in the cut like I told your ass\nGimme the microphone and let me hit you with a blast\nI got a little cousin by the name of Daz\nAnd bitches who fuck him gimme the ass\n'Cause they know about the shit that we be goin' through\nAnd they know about the shit that I be puttin' up\nAnd they be knowin' bout the shit I do when I'm on the mic\n'Cause Snoop Dogg is Trump tight like a virgin, the surgeon\nIs Dr. Drizzay, so lizzay, and plizzay\nWith D-O-double-Gizzay the fly human being seein'\nNo, I'm not European bein' all I can\nWhen I put the motherfuckin' mic in my hand, and\nYou don't understand what I'm kickin'\n'Cause Snoop is on the mic and I gets wicked, follow me\nListen to me, 'cause I do you like you wanna be done\nSnoop Doggy Dogg on this three two one, umm\nDum, diddy-dum here I come\nWith the gat, and the guitar will strum, I'm\nNot that lunatic nigga who you thought I was\nWhen I caught you slippin', I'ma catch you then I'll peel your cap\nSnap back, relax\nYa bet' not be slippin' with them D's on that '83 Cadillac\nSo we gon' smoke an ounce to this\nG'z up, hoes down while you motherfuckers bounce to this", "image": "https://images.genius.com/d31a03639b8f8f4259b9b9da07972d52.996x1000x1.jpg"}], "artist": "Snoop Dogg"}