{"songs": [{"title": "Stunt Hard", "album": "Heartbreak Drake", "year": "2009-12-19", "lyrics": "[Chorus: Drake]\nI did it all on my own, turned a chair to a throne\nI'm a king in this world, stunt hard\nI put my whole city on to some things\nThat they never would've known if I didn't stunt hard\nAnd every night is a premiere (yeah)\nIf I ever disappear (look), best believe I'm comin' back, stunt hard\nGot rich, went broke, and got rich again (yeah)\nOn that same shit again (alright), all I ever do is stunt hard\n\n[Verse 1: Drake]\nI tell her, I'm getting motherfuckin' busy\nSo many spins my records is motherfuckin' dizzy\nHaters wanna turn to their girl and be like, \"Who is he?\"\nBut I bet a million she tell you that's motherfuckin' Drizzy\nAnd I'm focused on my survival\nKeep an eye on the door, focus on my arrival\nWho do you look up to when you're better than your idol?\nAnd how you 'posed to look when you do it with your eyes closed\nI'm everything you just haven't become\nI spend my time trying to outdo what hasn't been done\nNow hopefully I'll let them see what they say that I'm gon' be\nAnd if not then I hope future does in the memory of me\nGet your team in order, assembly is key\nAnd all my niggas shut up at the mention of a plea\nThey rather be apprehended and keep quiet than to be\nOn the stand jeopardizing an inch of their loyalty\nPick a lane, pick a lane, that's all I ever heard\nBut I'm just trying to swerve, without hitting the curb\nThat's why I spend thousands on bottles so I can pop them\nAnd take photos with hater niggas and crop them\nI am not them, I photoshop them out\n'Cause they don't understand what I'm about\nYeah, the Chris Paul of this fall\nSittin' this tall, I float high, goodbye, I will miss y'all\n\n[Chorus: Drake & Lil Wayne]\nI did it all on my own, turned a chair to a throne\nI'm a king in this world, stunt hard\nI put my whole city on to some things\nThat they never would've known if I didn't stunt hard\nAnd every night is a premiere\nIf I ever disappear (yeah), best believe I'm comin' back\nStunt hard (I'm leanin')\nGot rich, went broke, and got rich again\nOn that same shit again (alright), all I ever do is stunt hard\n\n[Verse 2: Lil' Wayne]\nIf I don't do nothin', I'mma stunt my ass off\nMoney sittin' in the pocket, 'bout to get a passoff\nAnd I smoke that shit that smell like when you take your cast off\nAnd I got them beach bitches, like David Hasselhoff\nBaby I'm an acrobat. Sweetie, I'm a stuntdevil\nYou can't get on my level cause I am so unleveled\nI'm a young rebel and I got a babyface\nI need a young Pebbles, I need a stunt double\nYeah, me, Drake and Kid and you know it's trouble\nWe got 'em drownin' in the flow, you see 'em blowin' bubbles\nYeah, I stick my landin' in a freak drawers\nI'll have her bouncin' back like Dominique Dawes\nYeah, but I ain't stuntin' these hoes\nI been pimpin' since Hulk Hogan was N.W.O, yeah\nI'm wild, Drizzy tough, and the Kid vicious\nThe three horseman, we just need Sid Vicious\nYeah, I'm on the cup of that tilt\nAnd if you hatin' on me I'll say fuck you like wilt\nYeah! I'm a wilderbeast. You're just a wildebeest\nMy two fingers make a gun, shoot and kill ya peace\nYeah! Talkin big big shit\nI am rude, I take food from a kid picnic nigga\nYeah and we can bang like bumper cars\nYou know I stunt shit 'cause I write all Stunna bars, haha\n\n[Chorus: Drake & Nutt Da Kid]\nI did it all on my own, turned a chair to a throne\nI'm a king in this world, stunt hard\nI put my whole city on to some things\nThat they never would've known if I didn't stunt hard\nAnd every night is a premiere (haan)\nIf I ever disappear ('bout time)\nBest believe I'm comin' back, stunt hard (they'll know)\nGot rich, went broke, and got rich again\nOn that same shit again (yeah, okay)\nAll I ever do is stunt hard\n\n[Verse 3: Nutt Da Kid]\nI stunt hard, I stunt harder\nBoy they call me Jackie Chan in New Orleans\nI ball hard, So I'm a ball hogger\nAnd I go hard in my dunk like Vince Carter\nI hustle harder, I live in the Carter\nI think forward, all I see is tomorrow\nI need meat I'll turn your shop into a horror\nSo if you tryin' to see more, better feed me\nI'm back on my grizzy like \"Izzy\" after \"gr\"\nDon't he look like a black grizzly in that black fur\nAnd the feds will never get me like a backwards password\nBlack spur, ghost I'm like Pacman, Casper\nVanilla Ice got 'em hangin' over the banister\nAsk her, am I her man? Her answer is yessir\nShit, I'm tourin' state to state\nI played the RTA 'bout a quarter a day\nNow tell them bitches\n\n[Chorus: Drake]\nI did it all on my own, turned a chair to a throne\nI'm a king in this world, stunt hard\nI put my whole city on to some things\nThat they never would've known if I didn't stunt hard\nAnd every night is a premiere\nIf I ever disappear, best believe I'm comin' back, stunt hard\nGot rich, went broke, and got rich again\nOn that same shit again, all I ever do is stunt hard", "image": "https://images.genius.com/405c9bcb0dcbee7d15bcc86cd8e8366a.500x500x1.jpg"}], "artist": "Drake"}