{"songs": [{"title": "Never Lettin’ Go (The Stalker Song)", "album": null, "year": null, "lyrics": "Yo what you doing here huh?\n(Hi I thought I'd drop by so nice to see you)\nNice to see you too okay\n(It's been too long)\nYeah you can leave now\n\n[Verse 1]\nKanye that nigga with heavy dough\nRoll dro and a chevy low\nTold a long time ago you can't fuck every ho\nWhether in Jamaica or Cancun, Mexico\nBaby don't be scurred, shake that ass like Mystikal\nWe got physical now she calling and beeping\nCall when I'm sleepin, call my girl claimin we creepin\nBitch you nuts, look I only fucked you once\nHow you gone get the message, I ain't called you in months\nActing like Super Dave with them dumb ass stunts\nTalking bout girls I could get her whatever she want (Whatever I want)\nI'm like girls like you be wanted for warrants\nStalking of course, alone on the phone disguising your voice\nGot your girls asking for Kay on the three way\nTalking bout (You can't call a bitch on her BDay?)\nHmm, Tanisha its over with stop playin\nNah nah it's over. (So what you saying?)\nLook you gotta bounce. (I don't wanna fuck with you)\n(Get your hands off me!) Bitch I ain't touching you\nStop, Chill. Relax. okay\nYou know what she told me?\n\n[Hook]\nI'm never letting go\nNever letting go\nNever letting go\n\nI'm crazy about you\n(No you just crazy)\n\n[Verse 2]\nYou believe this ho, pop up everywhere I go\nPop up at the show, pop up at the grocery store\nPop up in my kitchen like, \"Oh you wash dishes here?\"\nPop up in my bathroom, \"Oh you take pisses here?\"\nListen here we gone need some distance here\n(Where I'm gone go?) I don't care, just disappear\nYou ain't my main bitch not even my main squeeze\nAnyway, how the fuck you get a set of keys?\nFirst she used them on my crib, then she used them on my whip\nAnd wrote on the side, \"Kanye you ain't shit\"\nYou believe this bitch? Man, did you see this shit!?\nDid she just knock my windows out on my Escalade? (Ha yeah nigga!)\nThat's a twelve fuckin' hundred dollar estimate\nShe must've took off all yesterday just to hate\nRestraining orders ain't stopping her\nShe the reason caller I.D. so popular\nAcross the street now with some fuckin binoculars\nScreaming at the top of her lungs, \"I'm never letting go!\"\n\n[Hook]\n\n[Verse 3]\nHad enough of the stalker shit got to put her in line\nCount back from ten when I got to nine I grabbed mine\nBefore I gotta do what I gotta do after blue she lying\nLike \"Nigga you put your hands on me for the last time\"\nTried to get you over your uncles to come and jump me\nTake my cash and punk me\nWith my ass and trump me\nI stump them fuckin chunkies\nJust look at yo niece\nShe beat her own ass and called the police\n(Pregnant with his baby yeah he still getting rough with me!)\nAnd to my crib scuff me up and put the cuffs on me\nMy momma dropped that five hundo and got me out of custody\nGirl left a note on my door (Nigga don't ever fuck with me)\nAnd all the time I got to thinkin that I'm the man\nHottest nigga on the block and shit I got a fan\nI'm like a swole nigga thought that he could lift the van\nSomebody please come and take this bitch up off my hands!\nYou don't understand, man\n\n[Hook]\n\nUh oh, uh oh, these hoes, these hoes, all the same, all the same\nAll want a nigga with a chain\nUh oh, uh oh, these hoes, these hoes, all the same, all the same\nWant a nigga whippin that range\nUh oh, uh oh, these hoes, these hoes, all the same, all the same\nWant a nigga banging they brains\nUh oh, uh oh, these hoes, these hoes, these hoes, these hoes, these hoes", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}