{"songs": [{"title": "Soul Food", "album": "Under Pressure (Deluxe Version)", "year": "2014-10-21", "lyrics": "[Verse 1]\nGoddamn, goddamn—conversations with legends\nCrazy how one day yo' idols can turn into your brethren\nBitches we severin', hit up my jeweler, watch him freeze us\nBreaking bread like I'm Jesus\nMoney ain't everything, but somehow eases\nBetter believe than think down and leave us, the baby cryin'\nCrack cooking where my sister be frying soul food\nPlus my other sister just went back to her old dude\nHe whoopin' her ass—I'll kill him, I'll kill him\nI'll motherfuckin' kill him\nI said, I really want to kill him—but I can't\n'Cause if I do, po-po gon' claim I'm the villain, but I ain't\nSee my vision from pictures I paint\nDo you feel it like I feel it?\nI grip the mic and then kill it—okay, I'm gone\nAs memories resurface from hella long in my past\nChillin’, sippin' Sinatra from a flask\nLittle Bobby, just a youngin’, skating was my hobby\nTryna stay out of trouble, my homie in jail for robbery\nWelfare, food stamps, and stealing from the store\nCome home and see an eviction notice taped to my door\nCan’t take no more, mama on drugs, daddy M.I.A\nWhat can I say? I just wanted to be a kid and play\nTo this day, I pay homage to the gods, to the greats\nNever stolen, I’m from Maryland\nWhere they shoot you in the dark of the night\nLike Christopher Nolan, for talking outta your colon\nCatch me rollin’ with the realest\nLyricism the illest, my chain is the chillest, Sub Zero\nFar from a hero, bitch, I’m De Niro in Goodfellas\nIf your bitch around me, best bring an umbrella\nLet me tap into my inner southern killer, none other illa\nMurder the game and then resurrect it like \"Thriller\"\nYeah, my skin is vanilla, but bitch I dare ya to test my killa\nWe don’t do it for the skrilla, we do it for love\nWord to my homies up above, we slingin' like drugs\nAnd overdose 'em like the dealer does (Logic)\nYeah\n\n[Break: Thalia]\nHip-hop\n\n[Chorus]\nI swear this music in my genes like Denim\nLyricism seep in 'em like venom\nYes, I know the flow hotter than Lucifer\nEven though heaven sent him\n\n[Verse 2]\nSee my vision as I've elevated and risen\nOpen your eyes, despise lies told with deadly precision\nI finally made my way up out that section 8 division\nNot by busting and killing though I've had my share of stealin'\nBut by putting pen to this pad and dispersing these feelings\nWhile the label only care about making a killin'\nFeel my energy—I ain't talking E-N-E-R-G-Y, I mean inner G\nThat's the shit they never see\nBut I own supremacy, number one—I better be\nBitch, I said, \"I bet I be.\"\nTake my kindness for weakness, trying to get the better of me\nTell me, how is they gon' remember me?\nAs the artist that concocted the perfect recipe?\nOr will they be addressing me, talking less of me\nJust 'cause I was different\nJust 'cause I was doing what I love?\nAnd the fans they say they love you\nBut they push and they shove\n'Cause they want what they want\nHow they want when they want it\nI just gave them twenty songs, now they want another hunnid\nI just see it as a challenge, I could do it, bitch, I run it\nWorldwide tours, type of shit I always wanted\nWhile the rest of 'em just worry\n'Bout bitches and getting blunted\nStill that same motherfucker from that YS1\nOnly difference is I'm stronger\nAnd better from when I've begun\nSo when people that never knew me\nThey tell me that I changed\nThat my music is different and my vision's rearranged?\nI just stop, and do my best to refrain\nFrom having conversations with people that ain't in my lane\nWill I die? (Will I die?) Will I live?\nGive the world everything I have to give?\nThis is feelings on the page, know my wisdom, not my age\nUnderstand that I'm a man not defined by his wage\nEven though it's in the millions\nThat shit don't define my brilliance\nOpen your mind and maybe you can see the billions\nOf people that separated, but all equal\nTo know the ending, one must understand the prequel, uh\n\n[Chorus]\nI swear this music in my genes like Denim\nLyricism seep in 'em like venom\nYes, I know the flow hotter than Lucifer\nEven though heaven sent him\n\n[Outro]\nSpit it like Holy water\nProphetically repent 'em, then we gone", "image": "https://images.genius.com/6d3ae39514ef99749706fb3ccdc22dd2.1000x1000x1.jpg"}], "artist": "Logic"}