{"songs": [{"title": "Fools", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Intro: RZA]\nAnd I told him, \"Don't fuck with me, don't fuck with me.\"\nYo, yo..\n{​​*singing*}​​ Everybody, everybody, everybody\nEverybody..\nYo, come on..\n\n[Hook: RZA {​​*singing*}​​]:\nEverybody plays a fool, sometimes\nThere's no exceptions to the rules\nGet your nines\n\n[RZA]\nDigi Digi, Shaolin Shaolin..\nBut in Brownsville..\nCheck it out..\n\nNiggas was psyched out, Beretta brought the dirt bike out\nEverlast just came home, it was his first night out\nHe was arguin' with these bitches how they don't mind their business\nWhen he was locked the fuck down, no one came to visit\nHe was snuffed, black, his little cousin Moe stuck Cap\nThat's Miss Sommers on the bike with the gat like, \"Fuck that\"\nBut finessin' over here, he could've wished he had ten more years\nCracked a cold beer then bust a shot in the air\nEverlast, ego went full blast, didn't splash it\nHe'd act like his head was too big for the casket\nI told him, \"Slow down God, you ain't wild\nYou ain't been in these projects in a while\nRunnin' 'round with that old school style\"\nDon't think these young bucks won't lay you down like tile\nA hard head makes a soft ass, these New York lads\nChopped faces, you talk fast - they bust off fast\nAnd chase you out the hood, in a bloody hood\nYo, son, you seen that kid was actin' Hollywood?\n\n[Killa Sin]\nYeah, I mean that nigga, clap happy Cali, clap when he 'ttack\nMost get astounded by sorrounded sound effects in the back\nAdidas shoe, phat laces, packin' buldge in his jacket\nHead nappy, black and nasty, but he nasty for gats\nHe nas', passed me, bumped me and laughed, then flashed me his Mac\nSaid, \"I got sixteen for you, we could bang on the track\"\nSo strap this, nah, this bar's a bullet, par pull it\nIn fact, blast me bastard, I done came to far for this\n\n[Solomon Childs]\nBoulevard life, remember late nights?\nMama stomach touchin' a bed, two bids\nCats sacky in Comstack, retire from the crack\nI'm askin' Allah that the warm Hennessy help me\nI ain't chose the struggle, the struggle chose me\nLord forgive me fore I have stolen from my brothers\nSnaked my brothers, even killed my brothers\nFamiliar fishscale, everybody plays the fool\nThe +Older Gods+ givin' me jewels\nThe younger Gods givin' me tools\nSolomon Allah, I feel I was jerked\nTo the drug dealers, my baby mother's a flirt\nHoley socks, one fatigue suit, what you feel it don't hurt?\nThat's my problem now, I ain't afraid to talk\nStill cop coke from the well Willy\nWhen I was young I got robbed from the neighborhood bully\n'Til he forced me to hit him with the nine milli'\nNow him and his click know that I'm a thug fully\n\n[Hook x2: Solomon Childs]", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}