{"songs": [{"title": "Wherever U R", "album": "One Nation (Bootleg)", "year": null, "lyrics": "[Verse 1: Big Daddy Kane]\nWatch me, ain't no question\nI'm sufferin' a bad case of lyrical congestion, not the one for testin'\nCome mess with and end up with your chest split\nNo, not because of cardiac, but because how hard he act, ha\nI'm recognized as the microphone destroyer\nCompetition minds up in the state of paranoia\nI told him if you're scared, go get a dog, so by tomorrow\nYou'll probably see 20 rappers walkin' with Rottweilers\nYour gimmick is primitive, and impotent, you won't win with it, so limit it\nBefore I make your body start to hemorrhage\nJust when you thought that you was burnin' me\nYou found yourself bleedin' internally, now you heads is learnin', see\nI stayin' there sincere, you commence prayer\nYour heart begets fear, cause there ain't no wins here, huh\nNever kid, cause even with leverage\nI can rock your domepiece worse than the wop ever did\nWhat?\n\n[Pre-Verse: 2Pac]\nAre you out your fuckin' mind?\n\n[Verse 2: 2Pac]\nAsk me to blast, no need to ask 'cause I'm mashin'\nPeepin' the latest fashion, copy-cats in plastics\nGet me to flashin', my adversaries shipped in caskets\nMurdered them bastards, witness the past, got boom-bastic\nNow that they freed me, no one can see me\nI completely eradicated my competition, Father forgive me\nAssemble the troops, prepare my loots for combustion\nRushin' them muthafuckas, the deadliest nigga bustin'\nHow can they touch me when they lost in thought?\nOn Death Row we lock shit down across the board\nNow flash and watch me get in that ass like a bikini\nLyrical legendary so niggas'll never see me\nCompletely defeat me, can never happen, whether rappin' or scrappin'\nNiggas get smashed on they muthafuckin' back\nHard to kill, and even harder to stop\nWatch Kane and 'Pac drop the sho' shot! Tell them motherfuckers\n\n[Pre-Verse: Big Daddy Kane]\nHere's how we'll do it\n\n[Verse 3: Big Daddy Kane & 2Pac]\nThe meet us and the plan's to put the cash in the hand\nSo that I can spend a grand of benjimans up in Japan\nNow who's the man? And therefore my Luchi, eatin' sushi\nCheckin' out a subtitled movie featurin' Sho Kasugi\nTell me, Kane, when will niggas learn?\nIn this game, fuck with us, niggas gettin' burned\nWe takin' turns on you bitch-made nigg-ar-os\nI hope it hurts, cause you're worse than these groupie hoes\nOne more time baby\nI'll be forever, the gogetter of the chedder\nThinkin' ahead of my competitor, just too clever to sever\nI got it together to represent with my true nigg\nThe first syllables of our name together is 2 Big\nThink about that!", "image": "https://images.genius.com/a1a90553105ad6af8fac203ba73284bf.480x360x1.jpg"}], "artist": "2Pac"}