{"songs": [{"title": "Where’s My Money", "album": "Grand Theft Auto IV Soundtrack", "year": "2008-04-29", "lyrics": "[Intro]\nMotherfucker, where\nWhere my fucking money, money, money?\nBitch, where my fucking money?\nAyo, Green, I feel like I'm turning green too\nFrom Bill Bixby to some Incredible Hulk shit\nI don't even know why you give me shit like this to spit to\nI'm sure we speak the same language\nFuck you bitches, pay me\n\n[Verse 1]\nWait a minute, came to go get it, ranger fitted\nWhenever it come to paper, better know I'm major with it\nMake it rain a major blizzard, leather alligator lizard\nI Talledega race any challenger; name a digit!\nEven if on the slightest, you take a smidget\nOr dare touch my revenue, I'll slice you with the razor, quit it!\nIcy till I make it frigid, burr\nThe laws of physics says it's getting cold\nMy money taller than a hall of midgets\nI get up all up in it, kicking down the door, who is it?\nBitch, I be the crew of bill collectors, pay them all a visit\nAfter cleaning bank accounts you questioned\nIf I gave a shit, if not I tell the truth\nSo you could tell 'em that the player did it\nIt's OK, I say a prayer, it's the mayor bitch slayer\nGiving you another layer of the data trick\n\n[Bridge]\nBust Rhymes, hitting you with punch lines\nFunny how I fuck dimes\nBitch, you know I want mine\nWhere my fucking money?\n\n[Hook]\nI ain't speaking foreign, you know what I'm sayin'\nBetter have my bread, nigga, I ain't playin'\nBitch, where my fucking money?\nMark every word spoken\nReddish so you're pussy if you think I'm jokin'\nMotherfucker, where my fucking money?\nThink I still ain't crazy ‘cause I cut my dreads\nAnd if you short my cake, I'm off side of your head\nBitch, where my fucking money?\n\n[Verse 2]\nCritical, it's pitiful, I'm cynical\nHow I deliver lyricals and take these other niggas paper\nTopsy-tervy controversy, I'm so thirsty, got no mercy\nFor some of these bitches, I collect my money now and later\nKeep it moving with the clique\nWhile making bitches hit the strip\nCake up everyday I wake, I rate the way my money flip\nI want it's mine, borderline, call it crime\nAll the shine I'm taking it, ain't no mistaking it\nNigga, what's yours is mine\nNo need to second guess it, check it, I'm the gloss and grind\nThe gritty and the floss, the profit and the loss, all intertwined\nBecause I profit from your losses\nYou don't want it, you should get it\nIn the hood with your money, I extended my line of credit\nThe medic, doctor rhymes that put you on a diuretic\nShrinking up a nigga pockets, simple niggas style pathetic\n\n[Bridge]\nBust Rhymes, hitting you with punch lines\nFunny how I fuck dimes\nBitch, you know I want mine\nWhere my fucking money?\n\n[Hook]\nI ain't speaking foreign, you know what I'm sayin'\nBetter have my bread, nigga, I ain't playin'\nBitch, where my fucking money?\nMark every word spoken\nReddish so you're pussy if you think I'm jokin'\nMotherfucker, where my fucking money?\nThink I still ain't crazy ‘cause I cut my dreads\nAnd if you short my cake, I'm off side of your head\nBitch, where my fucking money?", "image": "https://images.genius.com/2cf779787e35a13222931556ae8cd712.600x600x1.jpg"}], "artist": "Busta Rhymes"}