{"songs": [{"title": "Plan Up Your Family", "album": "Booty Call (Music From the Motion Picture) ", "year": "1997-02-25", "lyrics": "You better check this\n\n*sung part*\nPlan up your family, ha-high, me say\nPlan up your family, ha-high\n\n*sung part again*\n\nYeahhh...\nThis one's dedicated to the girl you see\nAnd all bwoy big D, livin in the ci-ty, I sing\n\n*sung part*\n\nUhhhhh...\nSex is part one but every story has a sequel (try)\nNot to live with your parents now people\nLet part two be planned by you, not fake (why?)\nCause your baby you'll start to hate (cry)\nLike if you can't afford a sausage\nYou on edge, baby cries, you throw him in the garbage\nYou know the stories that you hear in the news\nBabies being killed, infants being abused (right)\nDo people life they live like a movie\nYellin, \"Do me!  Do me!\"  Too much loose booty\nThey wanna be Blowfish like Hootie (chill)\nPremature pregnancy is ill\nYou never hear the other side of the story (like)\nLike what happens after you hit the shorty\nRight (right), you check it before you get butt naked\nHeed the science in the record\n\n*sung part* 2X\n\nYeah...\nThis one dedicated to the girl, you see\nAnd all bwoy big D, livin in the city, I say\n\n*sung part*\n\nYeah, yeah...\nYou know the time y'all, you know the time y'all\nHear the rhyme y'all, time to free your mind y'all\nSchool's open here's the message comin next\nSome dumb-ass kid feels proud he had sex\n(\"I knocked it out! Yeah I'm the mack and I'm all that!\")\nNine months later, you can't afford Similak (why?)\nYou look back on your life, you say it can't be\nI never asked or planned to have a family\nThinkin back in bed you was a happy camper\nAnd uhh, now your partner can't find the Pampers\nEvery day more sex you pursuin (sex is good)\nBut think about what you doin\nEverybody yellin revolution\nBut still on the ave cruisin, not seeing we losin\nControl your life and choose your direction\nWith sex and foreplay use protection\nControl your life and choose your direction\nWith sex and foreplay use protection\n\n*sung part* 2X\n\nYeah this one's dedicated to the girl you see\nAnd all bwoy big D, livin in the city, I say\n\n*sung part*\n\nYou know\nI got to add this last piece to the song\nSo no one gets me wrong, and we can live long\nHavin a child is good for your health\nBut how you gonna have a kid yo, when you a kid yourself?\nIt's your life, not hers, or his (true)\nNow you want someone to come and watch your kids? (ooh)\nYou try to give em to your moms, she ain't with it\nAnd with no sisters, a job you can't seem to get it\nNow you applyin for welfare, medicare for health care\nNow your whole life is goin nowhere\nI'm gonna say it, you might not respect it\nBut most pretty little girls wind up pregnant\nYou wanna wear tight clothes and act loose\nBut now someone gave you the truth!  Yo\n\n*sung part* 2X\n\n*sung part*", "image": "https://images.genius.com/8151f63a8e710989ca032395cb3bd933.934x934x1.jpg"}], "artist": "KRS-One"}