{"songs": [{"title": "100 Miles and Running", "album": "YSIV", "year": "2018-09-28", "lyrics": "[Intro: Logic]\nWoo, woo, yeah\nAlright, here we go\nYeah yeah, yeah\n\n[Verse 1: Logic]\nMoney on my mind, so I'm too paid\nReal all the time, never Kool-Aid, sippin' on D'usse, sike\nCame a long way from G'burg\nPuttin' in work like Ferg\nNew York to L.A., Hawaii and Japan\nI'm the motherfuckin' man, 'least I'm feelin' like I am\nGot the whole wide world in the palm of my hand\nBut don't give a goddamn, I'm Sam-I-Am\nWhat that even mean? I don't know what you talkin' 'bout\nWhy nowadays everybody got a palm out?\nPLP, yeah that be me and that be what I rhyme 'bout\nI have arrived, all you rappers are in timeout\nRattPack, where you at? (Everywhere worldwide!)\nI know you been waitin' for this world to collide\nB. O. double B. Y., H. A. L. L., and Folarin\n'Bout to take it back like Doc and Marty inside the DeLorean\nI am no historian, but here to make my predecessors proud\nAll you bitch niggas not allowed?\nI put it on everything, I really want a cop out\nBut I did good for a dropout\nHop out the coupe, chicken heads go crazy\nGotta sound swag when the flow get lazy\nWhat up? What good? Where you at? What you been on?\nAnybody steppin' to me, promise they get shit on\nBetter hop up on the train 'fore you miss the chance to—\nHop up on the—hop up on the train 'fore you miss the chance to get on\nMixtape Bobby, that's the type of shit I spit on\nWoo!\n\n[Chorus: John Lindahl & Logic]\nAnd it's on now\nEverybody know that it's on now (I'll be damned)\nGet in the zone now\nOhh, no, no, no (I'll be damned)\nI said it's on now\nEverybody know that it's on now (I'll be damned)\nOhh, get in the zone now\nOhh, no, no, no\n\n[Post-Chorus: Logic, John Lindahl and Wale]\nEverybody alive, everybody alive\nEverybody that's listening to this feelin' alive\nCome on now feel the vibe, come on now feel the vibe\nCome on now, come on now, come on now, you gotta survive\nEverybody alive, everybody alive\nEverybody that's listening to this feelin' alive\nCome on now feel the vibe, come on now feel the vibe\nCome on now, come on now, come on now, you gotta survive\nI said you gotta survive, gotta survive\nGotta survive, I said you gotta survive\nGotta survive, gotta survive (Wale though)\nGotta survive, I said you gotta survive (Yeah, RattPack, Blue Moon)\n\n[Verse 2: Wale]\nUh, smooth criminal, Mike Jack\nThrow a subliminal, put your woman in black dress\nThey was in Timberlands, I was reppin' them Nike boots\n'Member them nights that momma couldn't come right back\nI'm on the path right now, put the plight on the mic\nIf I write mine down, I incite my crowd\nI put Solbiato down (wholetime, wholetime!)\nUsed to go to Mark Twain, Mo County co-signed me\nGot many flows that any ho would vouch for\nI got many foes cause many hoes be out for\nHad the Penny Foams, remember those was copper\nHad so many homies talkin' 'bout, \"How you got those?\"\nI'm Phil Knight in real life, I'm real Nike\nIt's flight club in my house, they not like me\nMore than likely they ain't got the heart to fight me\nIt's a lie, somebody seein' me needs some Visine, yeah\nLet me let it breathe\nSaint Laurent level, weather never worry me\nI'm well aware they be wildin’ when they talkin' me\nThey bitches in the ballot but whenever I be on the scene, oh\nHammers in the Uber, I be limousine though\nDiamonds lookin' fluke but I got the same glow\nAnd I got a juice back around the way though\nMy chain like a penguin's Pellegrino (woo!)\nWe cold, we cold\nUsed to be in LakeForest with the Kobe fro\nEddie Bauer coat, Foams and a load of dope\nBoat load of white hoes I sold it to nigga\nI was tryna survive, tryna survive\nI was tryna survive, yeah, yeah\nI was tryna provide, I was tryna survive\nI put it down every time\nGot some niggas alive, I got some niggas that not\nPour a little of brown liquor and look in the sky\nBeen the talk of the town, nigga, Virginia, Maryland\nDid it all for the capital, hope you haven't forgot\nHoes love me a lot, niggas hate me a lil\nAnybody can hear me for real give me they props\nHookin' up with a couple models, nobody's gon' try to play us\nThe motto is get your paper and make you a lot\nPulling up with the Young Sinatra, I'm looking like Sammy Davis\nThe MGM or the Vegas to shake up the rocks\nAnd the Stadium poppin', the Palladium poppin'\nIt's a fifty a place nigga, she thinkin' about it\nI'll be damned\n\n[Chorus: John Lindahl & Logic]\nAnd it's on now\nEverybody know that it's on now (I'll be damned)\nGet in the zone now\nOhh, no, no, no (I'll be damned)\nI said it's on now\nEverybody know that it's on now (I'll be damned)\nOhh, get in the zone now\nOhh, no, no, no\n\n[Post-Chorus: Logic & John Lindahl]\nEverybody alive, everybody alive\nEverybody that's listening to this feeling alive\nCome on now feel the vibe, come on now feel the vibe\nCome on now, come on now, come on now, you gotta survive\nEverybody alive, everybody alive\nEverybody that's listening to this feeling alive\nCome on now feel the vibe, come on now feel the vibe\nCome on now, come on now, come on now, you gotta survive\nI said you gotta survive, gotta survive\nGotta survive, I said you gotta survive\nGotta survive, gotta survive\nGotta survive, I said you gotta survive\n\n[Verse 3: Logic]\nUh, woo, goddammit, I'm back at it\nNever out of breath like an asthmatic, I done had it\nFor this shit, I'm an addict, back in Maryland livin' in the attic\nFlowin' erratic, bringin' the static, bustin' like an automatic\nI'm badder than the baddest and madder than the maddest\nMy flow the fattest, hotter than a desert in Nevada\nNone of the badder, fuck all the chitter and chatter, none of it matter\nPull the trigger and listen to the pitter and patter, let 'em shatter\n'Cause I'm rippin' and livin' and strivin', the killer\nThe Ripper, he callin', we'll go and he'll flow and you know\nHe pursuin' it, doin' it, movin' it, groovin' it, stoppin' it, rockin' it\nTalkin' it, walkin' it, flippin' it, rippin' it, no, no, no, no, no, no, no!\nGoddammit, I'm back at it\nNever outta breath like an asthmatic, I done had it\nFor this shit, I'm an addict, back in Maryland livin' in the static\nFlowin' erratic, bringin' the static, bustin' like an automatic\nI'm badder than the baddest and madder than the maddest\nMy flow the fattest, hotter than a desert in Nevada\nNone of the badder, fuck all the chitter and chatter, none of it matter\nPull the trigger and listen for the pitter patter, let 'em shatter\nI'm rippin' and livin' and strivin' the killer\nThe Ripper, he call and we'll go and he flow and you know\nHe pursuin' it, doin' it, movin' it, groovin' it, stoppin' it, rockin' it\nTalkin' it, walkin' it, flippin' it, rippin' it, no motherfuckin' script, no\nI'm rippin' and livin', strivin' the killer\nRipper, he callin', we'll go and he flow\nListen, rippin' and livin' and strivin' the killer, the-\nAlright, we gon' do this one more time (Listen listen)\nI'm rippin' and livin' and strivin', the killer\nThe Ripper, he call and we'll go and he flow and you know\nHe pursuin' it, doin' it, movin' it, groovin' it, stoppin' it, rockin' it, talkin' it, walkin' it\nFlippin' it, rippin' it, no mother to fuck up his script, no, no, no, no, no, no, no!\n\n[Interlude: Logic]\nThis what we gon' do right now\nI'ma test my syllable ability, you know what I'm sayin'?\nI like to call this shit my syllability\nI've been sippin' on this tequila right now\nThis one of the last songs we recording for this motherfucker\nSo I'ma really gonna go off on y'all right now\nWe gon' do this shit in one breath, alright?\nThis ain't no bullshit, this ain't-, nah, nah, nah, nah\nThis ain't no editin', we gon' do it like this\nAre y'all ready? (Yeah)\nNo, no, no, no, are y'all ready? (Yeah!)\n\n[Verse 4: Logic]\nI'm rippin' and livin' and strivin' to kill it\nThe Ripper, he'll call and we'll go and he flow and you know\nHe pursuin' it, doin' it, movin' it, groovin' it\nStoppin' it, rockin' it, talkin' it, walkin' it\nFlippin' it, rippin' it\nLike the motherfuckin' script and I'm ready to go\nWhen I buy it then break it, roll it (Daaaaaamn!)\nThen lick it and smoke it, choke on it later, yeah\nSlicin' emcees like Darth Vader\nDecapitate a hater the second I spit it\n\n[Outro: Logic]\nSay hell yeah (Hell yeah!)\nSay hell yeah (Hell yeah!)\nSay hell yeah (Hell yeah!)\nSay hell yeah (Hell yeah!)\nSay hell yeah", "image": "https://images.genius.com/04d1c970904a534f622b012d9599fc9b.440x440x1.jpg"}], "artist": "Logic"}