{"songs": [{"title": "Live Life", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "[Intro: DJ Drama]\nDJ Drama for life\nA Tribe Called Weezy\nDJ Drama, fuck these niggas up\n\n[Verse 1: Lil Wayne]\nI'm a live my life, have my fun, act like I don't give a fuck\nLive my life, have my fun, smoke like I don't give a fuck\nLive my life, have my fun, fuck that shit, you only get one\nFuck that shit, I gotta sip some\nI gotta bitch leaving, I gotta bitch coming (Aye)\nI'm getting more pop on my skateboard\nNiggas don't want me to pop like a bungee cord\nI got my redbone head gone\nThat Bugatti go skirt like the legs showing\nYou think you street? I'm a jaywalker\nI'm a basket case, where the fucking lawyer?\nYeah, Tunechi Li in this motherfucker\nNiggas fuck with me in this motherfucker\nI'ma smoke 'em until I get lung trouble\nAnd these... niggas saying they the truth\nBut your pants on fire\nLike I was born in the pool\nI came up from the bottom\nI'm a live my life, have my fun, skate like I don't give a fuck\nKeep a brand new bitch, bout to get her ribbon cut\nRich, but I ain't rich enough\nYour bitch is down, you bitchin up\nRolls Royce, topless, it's about to get titty fucked\n\n[Verse 2: Euro]\nOkay, live my life, have no fun, 'less you give my niggas some\nLive my life, what the fuck, can't recall me giving one\nLive my life, have my fun, fuck like I don't give a fuck\nAnd question, who the realest niggas?\nOkay, that's a given one\nWell welcome to the murder show\nShow starts when the curtains close\nPass the scalpel to me, on my open-hearted surgeon flow\nWhy are all these coppers trippin?\nBitches down there, searching clothes\nYeah, I'm drinking stupid\nWhat the fuck you think I'm swerving for?\nLook, I be with that nigga from New Orleans\nWho be asking if you heard me, even though he wasn't talking\nSeen a straight chick do some dyke shit and didn't pause\nAnd she was probably brokenhearted\nI'm so gone, I probably caused it\nI'm just saying\nThey ain't fucking with me\nBet they talking bout murdering me\nBut, look, Tune, I just don't see the killer in these niggas\n2Pac's hologram was realer than these niggas\n\n[Verse 3: T@]\nI'm a get this money, live my life and ball like I don't give a fuck\nGet this money, live my life and ball like I don't give a fuck\nGet this money, live my life and ball like I don't give a fuck\nRudy Gays up on the coupe, and Black Mambas on the Truck\nI'm a dream chaser for stacking cheddar\nI'm in my Olympic Dream Team's Retros Number 7s\nWhat you know about getting money?\nHop out the coupe, I got your bitch in there, I leave the engine running\nI hit the block, talk shit, roll a few stogies\nPop a bar, kill a lil' time on my Rollie\nDavid Copperfield, I make a hundred disappear\nLike I know magic, but ball like Jordan\nNigga hating on my new deal, James Harden\nI guess cause I'm the shit, and you lil' niggas fartin'\nWith the weed, I did coke numbers, real talk\nA buck fifty every three months, real talk\n\n[Verse 4: Lil Wayne]\nW-T-F, what the fuck nigga?\nTell them fuck niggas get the fuck nigga\nNow who the fuck is with the fuck nigga?\nIt's just us, it's just us nigga\nWe the fuss nigga\nThat's a plus nigga\nAnd we don't fuck with snitches trying to bust niggas\nSo tell them fuck niggas get the fuck nigga\nI'm a live my life, have my fun, skate like I don't give a fuck\nLive my life, have my fun, act like I don't give a fuck\nGet this money, live my life, and ball like I don't give a fuck\nSmoke weed with the windows up\nHigh as fuck, but inching up\nPussy niggas tensing up\nAre these niggas men or what?\nI got your bitch antennas up\nMoney talks, your minutes up\nYou can judge us, but don't sentence us\nBlow me like the wind would gust\nWe trukfit and we supered up\nW-T-F, who to fuck?\n\n[Outro: Lil Wayne]\nAnd this, bitch I'm rolling with is cute\nAnd her ass on fire\nAnd the whole time, I ain't feel a tooth\nThen I ate that pussy 'til I lost a diamond and I'm gone...", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}