{"songs": [{"title": "Let’s Go", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro]\nEep Opp Ork Ah-Ah\nThat means I love you if you clock dollas\nYes, ain't no stoppin' there\nLet's go, let's go if you choppin' broccoli\n\n[Verse 1: Tech N9ne]\nLet’s go\nIf your sittin' at home talking to him on the phone\nAnd he a clone without no style of his own\nYou wishin' that you was gone, throwin' back the Patrón?\nYou ain't wrong because you’d rather be with me in the zone\nLet’s go\nSorry, your lady has been taken\nYou can find us up at the M.O. with the flo' shakin'\nAnd I ain't even the one that’s bringin' her home the bacon\nYou the one been talking 'bout kickin' my face in?\nLet’s go\nYou can do whateva' you gonna\nMy rebel persona that got me dressin' red as I wanna, ahead ya', stronger\nThe problem is you dead as a coma\nYou sick of me, but I’m right here to put the medicine on ya\nLet’s go\nGot 'em all frightened of the titan\nYou mice men too light to get fights in with the bison\nIt's so exciting, my Benz reeled your wife in\nI ruin your life when I produce a license\n\n[Hook: Tech N9ne]\nLet’s go\nComing through the do', hella fast, never slow\nGot the cash, and the pedal to the flo'\nLet’s go\nIf you wanna ride, let me know\nWe can slide on the low, whatcha' standin' there fo'?\nLet’s go\nYou can hate 'cause I’m dippin' witcha' mate\nOut the gate, let’s roll, let’s bounce, let’s skate\nLet’s go\nTo the room\nLet’s go\nTo the lick\nLet’s go\nYour boyfriend ain't talkin' 'bout shit\nLet’s go\n\n[Verse 2: Kutt Calhoun]\nPosted up, squatin' low like a pit\nYa' know this Patrón changed the whole motion of ya' shit\nAnd I ain't got a desire to proceed without a grip\nSo we can just do it movin' if it's all on the bitch\nLet's go\nThey likin' the skinny jeans and the kicks\nAnd jewl-e-wels\nBut I ain't into pleasin' a trick\nI'm in the topless Porsche's and keys to a six\nSo sit back and let the engine breathe a lil bit\nLet's go\nBut I'm highly into hoochie holla harry mode\n\"Money over beezys\" got it from my uncle Larry though\nSuperstar to many without playin' on your radio\nAddicted to va-gina when she ain't around ve-nereal\nLet's go\nKutt Kutty Calhoun is the scenario\nKansas City to Oakland\nFolks them be like there he go\nTell 'em it's Raider game\nHe soakes it up everywhere he go\nAnd give you a problem for denerio\nThere you go\n\n[Hook: Tech N9ne]\nLet’s go\nComing through the do', hella fast, never slow\nGot the cash, and the pedal to the flo'\nLet’s go\nIf you wanna ride, let me know\nWe can slide on the low, whatcha' standin' there fo'?\nLet’s go\nYou can hate 'cause I’m dippin' witcha' mate\nOut the gate, let’s roll, let’s bounce, let’s skate\nLet’s go\nTo the room\nLet’s go\nTo the lick\nLet’s go\nYour boyfriend ain't talkin' 'bout shit\nLet’s go\n\n[Verse 3: Mistah F.A.B.]\nGiddy up down, gotta skip town, girl is you ready to roll?\nWell shit, let’s go. Hit that K.C. M.O. straight from the O'\nI got that dro, sip that purp. we call it Bow\nI hit that burb, and get that urge to knock down all your doors\nGet in this car. I’m a star, you ain't noticed yet?\nLook at these shoes, look at these jewels shinin' on my neck\nI spit that venom, then I send 'em in then remove her denim\nAnd once I'm in 'em, then I bend 'em, not I can’t remember 'em\nI stay persistent and consistent when it comes to pimpin'\nYour ho gets sentenced from when sin 'tis hit with no repentance\nI go the distance when I hit it fuck like I'm demented\nPositions switchin' positions shiftin' like I invented\nThe art of fuckin' suduction we goin' tit for tat\nAnd when she suckin' I'm bustin' I'm tryin to hit here tat\nThey say her dude name, but really he's too lame\nFabby and Tech N9ne you know that we are too strange\n\n[Hook: Tech N9ne]\nLet’s go\nComing through the do', hella fast, never slow\nGot the cash, and the pedal to the flo'\nLet’s go\nIf you wanna ride, let me know\nWe can slide on the low, whatcha' standin' there fo'?\nLet’s go\nYou can hate 'cause I’m dippin' witcha' mate\nOut the gate, let’s roll, let’s bounce, let’s skate\nLet’s go\nTo the room\nLet’s go\nTo the lick\nLet’s go\nYour boyfriend ain't talkin' 'bout shit\nLet’s go", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}