{"songs": [{"title": "House of Pain", "album": null, "year": null, "lyrics": "[Intro:]\nIt's the same murder!\nYou made out streets into what these people call the 'killing field!'\n\n[Verse 1: 2Pac]\nThe motherfuckin' dust kicker, who can you trust?\nDo you have the heart to see a nigga, before you bust?\nMy name is spoken on the tongues of so many foes\nBustin' motherfuckers out the box, I ain't even go!\nNow how the hell do you explain my claim to fame?\nFrom doin' flicks to bustin' tricks out the fuckin' frame\nGot these bitches on my jock, niggas on my block\nJealous ass suckers got 'em duckin' from my smokin' Glock\nAnd bustin' niggas asses is to stay alive\nSkinny ass player watchin' bigger motherfuckers fry\nThey ask me how I'm livin', I'm a hustler\nBuckin' busters 'til they die\nNow it's on in the ghetto you ain't heard?\nNiggas got they AKs headin' for the 'burbs\nAimin' at them skin headed bitches let it rain\nGivin' 'em a wet welcome to the house of pain\n\n[Interlude:}\n\"When you think -- when you really think about it, the challenge of racial tension in many levels; the level of violence, higher this year than last--\"\n\"Our city is a war zone.\"\n\n[Verse 2: Stretch]\nYo I'm hunting down this nigga and he know so he stressin'\nHe better count his blessings and get ready for this lesson\nThe Stretch 'bout to teach him when I reach him with the MAC\nAnd lay that ass down on his motherfucking back, Jack\nSlack is something that a nigga don't take\nHis mom run the church so I'mma see her at his fucking wake\nMake way, the nigga paid me the other day\nI'm fucking with my son and the nigga got somethin' to say\nHey! The nigga tried to diss, boy he got it twisted\nHe shoulda watched America's Most, I'm listed\nFor killing motherfuckers like him\nSo I'mma bring him to the House of Pain and kill him with a grin\nFlim flam, god DAMN I'm not the one\nBefore I choke him and smoke him\nI'm gonna smack him with my fuckin' gun\nSon, you made your last mistake and I don't know your name\nBut welcome to the House of Pain\n\n[Interlude 2:]\n\"In the second such case in recent memory, a Ross woman being charged with murder and the shooting death over the death of her daughter over a crack addict.\"\n\n[Verse 3: The Notorious B.I.G.]\nCoughing\nHuh, the country bud got me chokin'\nI'm on a mission to the point that motherfuckers think I'm smokin'\nYea that sick nigga Biggie wit the 8-shot fifth\nWit the extra clip for that extra shit\nDon't you know that a killing is thrilling\nAll the blood spilling, is all a part of drug dealing\nA born gangsta my daddy was a thug\nHad a .38 wit the hollow point slug\nSo when he licked shots\nNiggas dropped quicker than a bootlegger sells his liquor\nA little nigga tried to squeeze .22's in my Reebok shoes\nPayin' dues, while kids was on their one's and two's\nNow I'm much older, colder, fuck a holster\nGot the MAC-11 swingin' from my shoulder\nIt's a damn shame I got to put my momma through the strain\nI'm livin' in a house of pain\n\n[Outro:]\n\"He reportedly tried to hide behind a parked car and then beg for his life before he was killed.\"\n\"A hostage in Brooklyn rather suggests we have--\"\n\"Grant said this morning he was kidnapped and held for ransom and strangled to death.\"\n\"They hurt us, humiliated us, took stuff for granted, stole from our--\"", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}