{"songs": [{"title": "Dead Bent", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Produced by MF DOOM]\n\n[Verse 1]\nGoddamn it\nSuper motherfucking villain goddamn it\nAbout to get these millions, stacks and shit\nYo, his dip tried to tell him\nOoh, you're like the sun\nChasing all of the rain away\nWhen you come around, you bring brighter days\nShe told him\nYou're the perfect one\nFor me and you forever will be\nHe told her\nI will rock this microphone ... always!\n\n[Verse 2]\nI hold the mic, like niggas hold their girls tight\nBut I ain't after her, probably your Acura pearl white\nThe hooker? Nah, as many times as I done hit it\nTo be specific more times than dimes in a briz-nick\nWhen you broke North, I crashed the barbecue like Riddick\nAt the Garden, true, that's the God in me, pardon you\nJeepers! I was tore back, the ho gained access to my beeper\nCalled back my secretary gatekeeper\nLike I ain't peep her, I said, \"Darling you was stupid though\nYou know the Super Villain, (He is a super) ho\"\n\n[Verse 3]\nI had this style ever since I was a child\nI got this other style I ain't flip in a while, it goes\nPure scientific intelligence, with one point of relevance\nEmcees whose styles need Velamints\nAnd once the smoke clear, tell 'em it's\nThe Super motherfucking Villain, nigga came through raw like the elements\nOn 99 plus one of them\nAnd with a flow to pull a fraud nigga file from out in front of him\nWhen we with y'all, we had tons of fun\nMe and my duns and them\nActual true and living sons of them\nDead planets and God-U's\nThrowing divine rules to come through, we will over charge you's\nFool, and won't feel remorse for shit\nExcept for one time, once I had took my fronts out and lost them shits\nScientific going berserk like Red Alert\nI really went to pick up wiznork for cheddar dirt\nTo fund these experiments is where I went\nObviously dead bent, and spent every red cent\nTo rule you, and still drop more jewels than schools do\nOr even TV news that's designed to fool you (who?)\nYeah you, who hear the most grimy suggestions\nFrom brothers with fly names and I.D. questions\nThat's a Secret like Victoria teddy sets that's edible\nThem's not ready yet for the incredible\nTeam of MC's who broke all fakes\nWho thought they were slaughter proof\n\n[Outro]\nStomping through like North Face waterproof\nTat-tat, that's the end of that\nAfter hit the bar where baby girl bartender at\nI told her more wine, mingling with no single mentions of\nStay tuned for more spine tingling adventures of ...", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}