{"songs": [{"title": "Valley of Chrome", "album": "Skull & Bones", "year": "2000-04-25", "lyrics": "[Verse 1: B-Real]\nYou can't hide from the man with the master plan\nHuntin' for your head, \"How I Could Just Kill a Man\"\nAyo, where you at, baby? Keep your head low, damn\nGot you on the camcorder in the black minivan\nYou crossed line, time for the light to blind\nYou can run but I never be far behind\nYou never know when it's gonna come, paranoid\n'Cause the mentality is seek and destroy\nBetter look around before you come out your door\n'Cause shit catches up but you don't want no more\nOnly time will provide the right sign for real\nYou might die 'cause you hesitate to find the steel\n\n[Chorus: B-Real & Sen Dog]\nYou better never let me catch you alone!\nBring it on, bring it on! Bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on, keep, keep, keepin on!\nYou better never let me catch you alone!\nBring it on! Bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on! Keepin' on!\n\n[Verse 2: Sen Dog]\nListen up, motherfuckers, I got shit on my mind\nThe spotlight's on me and it's time to shine\nI smack any brat that be jumpin' outta line\nI smoke any fool try to diss on my rhyme\nI get y'all when no one can't protect y'all\nWash your brain and have you infiltrate the\nSame bunch of suckers that be tryin' to hate me\nWanna take me out so they can try and replace me\nFuck what ya heard, have ya seen lately?\nThe size of my clan is improving greatly\nNo holdin' back, bringin' the big heater\nWatch a nigga run scared, faster than a cheetah\nSpeed of light, move faster than sound\nBut I'm still on they back and I'm gaining much ground\n\n[Chorus: B-Real & Sen Dog]\nYou better never let me catch you alone!\nBring it on, bring it on! Bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on, keep, keep, keepin' on!\nYou better never let me catch you alone!\nBring it on! Bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on! Keepin' on!\n\n[Verse 3: B-Real]\nNo matter what you seen, we still smokin' the green\nRepresent for all the people still a part of the scheme\nPlaya haters, imitators wanna roll with the team\nBut they fade away, hate away, all for the cream\nThey wanna instigate and get me to forget my stake\nTake advantage of the Real-a, rob killa who scrapes\nStupid motherfuckers who don't know who I am\nBetter step aside suckers watch the heater expand\nGet outta hand, see the light, you and your clan\nBetter scram outta here before you get slammed\nI stand strong, keepin' on, when I'm rollin' alone\nBut you sorry bitches hide away, place unknown\n\n[Chorus: B-Real & Sen Dog]\nYou better never let me catch you alone!\nBring it on, bring it on! Bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on! Keepin' on, keepin on!\nYou better never let me catch you alone!\nBring it on! Bring it on, bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on! Keepin on!\nYou better never let me catch you alone!\nBring it on, bring it on! Bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on! Keepin' on, keepin on!\nYou better never let me catch you alone!\nBring it on! Bring it on, bring it on!\nYou might die in the Valley of Chrome!\nKeepin' on, keepin' on! Keepin on!", "image": "https://images.genius.com/af5085b228c3f1b6bc3a2ac39f6c6be8.1000x977x1.jpg"}], "artist": "Cypress Hill"}