{"songs": [{"title": "I Met Oprah", "album": "Freshmen Adjustment Vol. 2", "year": null, "lyrics": "[Verse]\nNiggas old as hell, trying to get they rapping on\nIn the club looking like a fucking chaperone\nI'm in the club, posted up, \"Guess Who's Back\" is on\nIf not that then the Just Blaze track is on\nIt's all Roc the world, we all got your girl\nCaught your girl, never gave back your girl\nWatch the rap unfurl, after Beanie Mack confirm\nKanye best producer-rapper in the world\nNow I have beans, I'm going after MCs\nShow 'em that this rap game made for me\nMade for us, they bite and they plagiar-us\nThey spit the style for the niggas that made it up\nThat's like me buying soul beats for my album\nDog, I had to eat, I sold beats from my album\nNow I got heat, I hold beats for my album\nFebruary 18th, reach for my album\nNiggas forcing me to keep the heater\nBlack strap, white handle, I got Jungle Fever\nBlack Benz, white truck, and one 2-seater\nI'm in the game getting change like a parking meter\nAnd since Takeover\nIt feel like the whole hood try to get a Jimmy Jones makeover\nI got the hood on my shoulder, city on my back\nThey like \"Damn, I heard you charging 50 a track! I mean\nYou can at least give me a stack\nYou can't do all that hard work yourself and not give nothing back!\"\nYou know how shit change when your name get to buzzing\nThis year alone I got two dozen new cousins\nNiggas popping out the woodworks, talking about \"you owe me\"\nMama, I'm famous, niggas hate me that don't know me\n\n[Outro]\nYo, I know you all suprised and shit when you see me on MTV\nBut keep your eyes glued to...I don't know what channel that is out here\nIn Chicago that's Channel 7, ABC\nYou might fuck around see me on Oprah Winfrey or something\nMatter of fact, true story, true story\nLast week...I got a little cold right now, true story, though\nI'm on 40th and like 5th or something\nI see an SUV and the window rolled down and shit!\nAnd this black lady from Chicago, she like\n\"Yo, um, I just bought one of these in black.\"\nYou know I just got the G5 or whatever\nShe like, \"I just got one of these in black\nHow does it drive?\"\nI'm like, \"it drive more like a truck than my last one.\"\nI'm like, \"yo, but I'm from Chicago, too. I wanna be on your show!\"\nShe said \"yo, well, oh, ok, well, who are you?\"\nAnd I told her, \"I'm Kanye West, a rapper.\"", "image": "https://images.genius.com/96319570be9d2165984a99be5ecf2edf.500x500x1.jpg"}], "artist": "Kanye West"}