{"songs": [{"title": "Taylor Gang", "album": "Cabin Fever", "year": "2011-02-05", "lyrics": "[Chorus: Wiz Khalifa]\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nYou know I'm reppin' Taylor\nAll my weed from Cali so you know I’m smokin' flavor\nAin't fuckin with blunts, you know we only smokin' paper\nAnd I throw it up so that you know just what my name is\nMothafuck a hater\n\n[Verse 1: Wiz Khalifa]\nLeft the crib with 10 grand, bought a hundred pair\nI’m the coach, I can show you how to be a player\n5/8 is the fitted, bitches love my hair\nCamo shorts go with anything I wanna wear\nThey let me in the club, fuck a dress code\nMe and all my niggas rollin' up the best smoke\nOG Kush from the West Coast\nOh you down to fuck? Well shorty let's go\nDiamonds in my chain, niggas trying to steal my lane\nChronic in my brain bitch, I’m reppin' Taylor Gang\nSmoke 'til I’m insane, drinking til' I’m throwing up\nOnly papers if you Taylor’d nigga throw it up\nHigh socks, low cuts\nSmell that good weed, then you know it's us\nThat yellow car pulling up\nThem niggas ain't high so they ain't close to us\nDown to fly, yeah, two fingers and hold em up\n\n[Chorus: Wiz Khalifa]\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nYou know I’m reppin’ Taylor\nAll my weed from Cali so you know I’m smokin' flavor\nAin't fuckin with blunts, you know we only smokin’ paper\nAnd I throw it up so that you know just what my name is\nMothafuck a hater\n\n[Verse 2: Wiz Khalifa]\nBought a crib like Scarface's, this is my world\nAll my niggas down to bang but we can try words\nSmoking ounces to the head 'til my mind twirls\nI’m the mayor and my bitch look like a flag girl\nTopic of discussion, talk shit cause they bitches love us\nPlus them niggas suckas, I got that in living color\nAll my cars are different colors, all my broads are different colors\nAll I do is fuck 'em once and I don't call or give ‘em numbers\nRo-lex, more, sex\nGood, weed, no, stress\nRun my town, arms, chest\nLift, weights, Bow-flex\nThrow your set up, what you rep when you twistin' ya fingers?\nReal recognize real and my nig, you a stranger\nGot a bank full of scrilla, a brain full of papers\nGot a phone full of hoes, and a gang full of Taylors\n\n[Chorus: Wiz Khalifa]\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nYou know I’m reppin’ Taylor\nAll my weed from Cali so you know I’m smokin' flavor\nAin't fuckin with blunts, you know we only smokin’ paper\nAnd I throw it up so that you know just what my name is\nMothafuck a hater\n\n[Verse 3: Chevy Woods]\nYou see me out, I rep my gang, used to serve that John McCain\nThat John McCain, hold up, they don't know my name?\nChevy (who?) Chevy (who?) look at all that shit them dollars do\nGettin' all this money with you know who, it's Taylor Gang over you\nWe poppin' bottles gang signs, all my niggas' gang signs\nRollin up gang signs, niggas trippin', bang time\nHold up, what they say 'bout us?\nSame niggas gotta get the okay bout stuff\nThey ain't in the same league, they don’t play like us\nNo stems, no seeds, keep that rolled up\nBang on them hoes, we does that\nSocket work, I just had a plug for that\nGet your Taylor on, hold for whatever you rep\nThrowin up the gang, 4800 still reppin' a set\nGot these niggas trippin’, and these bitches too\nThey just haters though, no matter what we do\nWhat up cuz, on the left side\nIt's Taylor Gang, and that's or die\nCHEVY!\n\n[Chorus: Wiz Khalifa]\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nTaylor, Gang, Taylor, Gang\nYou know I’m reppin’ Taylor\nAll my weed from Cali so you know I’m smokin' flavor\nAin't fuckin with blunts, you know we only smokin’ paper\nAnd I throw it up so that you know just what my name is\nMothafuck a hater", "image": "https://images.genius.com/d237f9965c42bac000a231b8fb6b39a5.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}