{"songs": [{"title": "Anything", "album": "The State vs Radric Davis 2: The Caged Bird Sings ", "year": "2013-01-01", "lyrics": "[Hook: Gucci]\nYou can't tell me anything, no you can't talk to me\nYou can't tell me anything, no you can't talk to me\nUnless want 2 or 3, bricks they go for cheap\nShop with me, I got what you need\nWhat you wanna get, two or three, nigga fuck with me\nI be in the dope game, and I can sell ya anythang!\nThat boy that price too high, he a lie, he can't fuck with me\nGucci Mane got fire, I got fire, come and fuck with me!\n\n[Verse 1: Gucci Mane]\nTrash bag fulla this shit\nThat bitch so ugly, can't get a pull of this shit (naw!)\nTreat me off my dick, that bitch so slick, I might just sue that bitch! (damn!)\nTrap house ballin' so hard, they makin me - Lord I might just move this bitch! (woop!)\nLost 200 grams on water wippin', need some better bricks (fuck!)\nPeep my new shit, Gucci Mane glue brick\nI'm so slick, one brick be two bricks (yea!)\nCooler than a penguin in a cooler with a lot of juice\nShawty swallow yea your daughter and she use a lotta spit\nI'm Mr. Million dollar dick, and I can pluck your bottom bitch\nYou better pay me in full, a nigga fully auto\nBefore I have your black ass burnt like charcoal (haaa)\nMan-hunt for me just like Chapo (chapo)\nAnd French Montana can bite my swag, but I'm still head honcho (wop!)\n\n[Hook: Gucci]\nYou can't tell me anything, no you can't talk to me\nYou can't tell me anything, no you can't talk to me\nUnless want 2 or 3, bricks they go for cheap\nShop with me, I got what you need\nWhat you wanna get, two or three, nigga fuck with me\nI be in the dope game, and I can sell ya anythang!\nThat boy that price too high, he a lie, he can't fuck with me\nGucci Mane got fire, I got fire, come and fuck with me!\n\n[Verse 2: Guwop]\nSellin' bow after fuckin' bow, I just broke the bow\nServe it half or I serve it whole, I just broke the stove\nCash drop on the fucking spot, need another spot\nI get top, get a nigga top, Gucci Mane got guap!\nDrop my top with your main bitch, damn she off the leash!\nGotta mean lookin' at them jeans, as she po' my lean\nTry to refrain from smoking the green, cause of all my friends\nMy girl said, \"Me or the fucking lean!\"  , and I choose the codeine\nBitch go 'head and leave, Ho just leave my keys\nYou can take this bullshit cause it means nothing to me\nSaid, \"She ain't got nothin' on ya\" , bitch he ain't got nothing on me!\nAnd matter of fact bitch where's my pint at, cause you ain't my cup of tea!\n(Guwop!)\n\n[Hook: Gucci]\nYou can't tell me anything, no you can't talk to me\nYou can't tell me anything, no you can't talk to me\nUnless want 2 or 3, bricks they go for cheap\nShop with me, I got what you need\nWhat you wanna get, two or three, nigga fuck with me\nI be in the dope game, and I can sell ya anythang!\nThat boy that price too high, he a lie, he can't fuck with me\nGucci Mane got fire, I got fire, come and fuck with me!\n\n[Verse 3: Young Thug]\nIf I can't top ya pridna, I got fidna\nI got fidna for you widnite\nTake a one-five put it in ninite\nTake another one-five tryna hercule\nAnd buy that bitch a burganby\nYou know that big convert for me (damn)\nThat all blue Bentley, pew! , I drop the top they papa smurfin' me\nYou fake-ballin' like Nerf\nYou on the turf\nAnd you not worth a fuckin' thing, I think you're cursed\nMy ice is water you can surf (whoosh!)\nYea-yea-yea you can surf, that's what its worth\nWussup Lil' Dirk, 3 Hunna spent on a shirt\nYo' bitch wanna go berserk\nOn this stick, I'm on this stick wussup Lil' Tic\nI left like seven bricks on the table, came from Eagles like Mike Vick\nI got like six bitches controllin' me, like a muthafuckin' theist\n(woop woop woop)\nI drink that lean I got that fisker, got that fisker just like this bitch!", "image": "https://images.genius.com/ed96462712d87ed0675a5df07b951a5b.640x640x1.jpg"}], "artist": "Gucci Mane"}