{"songs": [{"title": "Project Hallways", "album": "Juvenile Hell", "year": "1993-04-13", "lyrics": "Niggas catchin bodies in the project hallways\n\nProject hallways, the project hallways..\nProject hallways, the project hallways..\n\nStep in to my highrise hell\nYou gots to be on the up and up\nWatch your back, pump your crack\nBut don't forget to re-up\nA burner's your God and you pray to it all day\nThen at night, you catch a body\nBut it's just the shit you got to do\nCause if you wasn't watchin, they'd catch your ass too\nYou gotta go all out if you want props\nOr you can just kill a man, and it's the same for cops\nNow you want a little fame from the drug game\nWhether you shoot em up, or pump cracks, it's all the same\nBut fuck it you're in it to win it\nFat uptown, cookies in the rocks, your spot's hot\nNow you're livin the life of a project sad song\nMakin your loot from all the right wrongs\nBut that's the way it goes when you choose your path\nAnd you might just, feel the pain of a tec 22 blast\nAll out war, with niggas from the next block\nYou're pullin out the Glock, to shut em down\nNow you're Mr. Big Shot in your tribe\nNiggas know your name from Mt. Vernon, to Southside\nComin from the streets of Fright\nWhere the only thing you'll know is how to roll it up right\nAnd load it up, tight, you're startin a block war\nNigga pull the trigga if you want a little more\nFrank Nitty style, buckwild\nThirty-eight slugs from uptown thugs\nNo question, you're true to the game\nSince the age of a little Brand Nubian\nFrom skelly tops to props ? and all that\nNow you're puttin your block on the map\nA role model to the petty drug dealers\nBanana clip style, my neighborhood's buckwild\nYou can't forget who you came from\nSee you later maybe sooner in the project hallways\n\nProject hallways, the project hallways\nNiggas catchin bodies in the project hallways\nProject hallways, the project hallways\nNiggas catchin bodies in the project hallways\nProject hallways, the project hallways\nNiggas catchin bodies\n\nA little hellbound nigga, shoot em up, light em up\nPull the trigger, pass the 40 in the project hallways\nRunnin through the doorways, back in the days\nJust a little snot nosed bastard\nAlways causin' havoc, with a blade\nBut now it's a burner, used, for murder\nStep a little closer and your ass is grass\nYou better move fast 'fore I kick that ass\nCause I'm sharp like glass, but I won't break\nWalk into the project hallways is your big mistake\nYou little bitch ass nigga, you shoulda known better\nYou'll get done, did, a kid from the 'Bridge\nWho gets buck, and couldn't give a fuck about your daze\nI'm talkin bout the project hallways\n\nCatchin bodies in the project hallways\n\nProject hallways, chillin in the project hallways\nTo survive around my way\nYou gotta play a knuckle game every day\nLost in the shuffle of hardrocks\nAnd knocks on the streets of the uptown blocks\nLoad the Glocks, who got the mox'\nA little gun bangin bad-ass project thug\nYou're in the wrong part of town kid\nMr. Buddha on the 13th floor, gimme some more\nSess bag it up real quick kid\nTap the ? shit, the brew, pass the Phil'\nWhat's my name? Niggas call me little shorty gets ill\nAnd bag em up on the street corner\nAnd bust em open in the project hallways\n\nCheck it out, yo\nAround the way kid the sun don't shine\nPhillie blunts kid I got what you want and it's time\nMy dialogue with the project cause motivate\nMove, what? I never lose\nFreestyle project hallway style\nBut the shit ain't real unless you got that buddha filled\nChalm, keep me goin on when I perform\nCharge the brain, lick em up, that's the name of the game\nSo it's the move when I move little smooth\nOn the motherfuckin mission and I just improve\nUpstairs, niggas dyin on the 6th floor\nCause in the projects, shit is mad rough\nSo take a puff and relax your mind\nJ.V. crimes, most of the time\nYou might catch my crew, with a sixty-four brew\nWatch your back, cause we're comin through\nWith a fat sack of 1-2-1 son\nAnd the shit ain't fun, unless I get some\nOf the action, little shorty execute\nI'm killin niggas in the hallways\nTil there ain't no more left to shoot\nSo if you can't take the heat, stay out of the ways\nBefore you 'come a victim of the project hallways\n\nProject hallways, the project hallways\nNiggas catchin bodies in the project hallways\nProject hallways, the project hallways\nNiggas catchin bodies in the project hallways\n\nProject hallways, the project hallways\nNiggas catchin bodies in the project hallways\nProject hallways, the project hallways\nNiggas shoot em up in the project hallways", "image": "https://images.genius.com/2ca92566d6769c85797a1f455575d4b8.597x597x1.jpg"}], "artist": "Mobb Deep"}