{"songs": [{"title": "49ers (Orange Shirt)", "album": "I AM JUST A RAPPER", "year": "2010-01-05", "lyrics": "[Verse 1: DC Pierson]\nWhoa!\nWhat'd you get, amnesia?\nI bet you wouldn't sleep on me if I was Lil' Weezy, huh?\nBet you wouldn't sleep on me if I was in a band or something\nAnd my bank balance were around a grand or something\nAsk you something:\nDo you think I'm common like sense is?\nThat heaven didn't send this\nUniquely perfect dude so just discard me like a toy, then\nBut you know, I know, I'd make a damn good boyfriend\nOil can, oil can\nYou think I'm the Tin Man\nYou took my little heart and you kicked it like a tin can\nAin't you heard I got the kind of shine can make your skin tan?\nIn the lean time don't come crying for the thin man\nIn the meantime I'll be building my portfolio\nAll these other dudes eradicated like polio\nWith any luck you'll see me everywhere like Starbucks\nI bet you'll wanna fuck me when it's time to star fuck\n\n[Verse 2: Childish Gambino]\nI didn't have green like an Arizona front lawn\nNow they try to touch my face like an iPhone\nNow I'm all gassed up like Exxon\nGirls see the money like I fucking got checks on\nI don't even know if this girl really likes me\nPicking up the check like I'm working at Nike\nTalking to this girl and I'm thinking that she's into me\nThen I find out she's trying to break in the industry\nThat's really lame\nI still hit it\nBut I refuse to be home girl's meal ticket\nI'm looking for a sick girl to be a part of me\nNot a girl who will try to McCartney me\nYes, homie I'm a man of my word\nGot this shit in the can like a toilet of turd\nAnd, yes, these gold diggers trying to get at my sperm\nWell, I'm not a 49ers fan, in case you haven't heard\nI know my girl out there somewhere\nAnd if you hear this, you should come here\nUnless you don't give head like a weird beer\nElroy, Bam-B, yeah, I'm outta here", "image": "https://images.genius.com/71b32f259d92f0db0dfeba38136bbd3e.320x320x1.jpg"}], "artist": "Childish Gambino"}