{"songs": [{"title": "Maybach Music IV", "album": "God Forgives, I Don’t", "year": "2012-07-30", "lyrics": "[Intro: Rick Ross]\n(Maybach Music)\nIt's no finales around here, baby\nNo finales (J.U.S.T.I.C.E. League)\n\n[Verse 1: Rick Ross & Ne-Yo]\nYeah, such a breath of fresh air\nGet a blow job, have a seizure on a Lear\nOr get a new car, I could lease it for a year\nOr bring it back tomorrow, that's a lease that disappear\nCount new money, peelin' out a venue\nNew Maybach after it was discontinued\nNever question mine, my mind is so inventive\nQuadrupled my net worth and threw in a few incentives\nMaybach IV the allure that I adore\nAll money game, we got ones in the floor\nSee me on the wood, nigga, pause at the game\nTwo mil, the jewels, no flaws, ask them lames\nBow to the boss in the presence of a don\nStarted on the corner, nigga, didn't have a coin\nPlayin' my position for a club that I can join\nNever in the draft, but that boy know he goin'\nThrow me a bomb (Dreams), get me a brick\nThat's on the Quran, I'mma go and get the chips\nGo and get a rental (Dreams), I got a cute bitch\nShe's showin' some potential, so we takin' trips (Ooh)\nNigga, assets last while memories fade\nI'mma patch that ass, I don't get paid\nI'm a Mike Tyson typer, typewriter sniper\nDouble M life 'til a nigga pay the piper\nI love when the beat dip\nSame way I love to see a ki' flip\nGo and pay your mama house off\nGet sucked off, shawty wipe your mouth off\nI'm alive, you could never write the South off\nSouth paw, box a nigga off like a outlaw\nQuick thinker, big better shut your mouth boy\nBlack chips, gold bottles, ship it out raw\nPullin' up slow, look at that boy\nYoung B.I.G., Lil Kim on tour\nLil Cease with me, all the cheese with me\nAll the G's with me, Maybach Eazy-E\n\n[Hook: Rick Ross & Ne-Yo]\n(Oh-oh-oh)\nThe good times don't last long\nJust rewind the last song (Ooh, ooh)\nWe all shared some great times (Uh, uh)\nAs I read some great rhymes (Ooh)\nWhat we does, is what dreams are made of\nCome and get this love, all of this love, aye\n\n[Verse 2: Rick Ross]\n500 for the car that I got on the strip\nThat's another 100, what I got on my wrist\n800 for the jar that I'm about to twist\nIt's a female strand, you know life's a bitch\nAs I get high, move my curtains to the side\nAge like fine wine, ambitions they never die\nNiggas get abused like boys at Penn State\nGreatest that ever did it, decided my own fate\n\n[Verse 3: Ne-Yo]\nDreams, everything we are\nThe life that we're living, baby it's ours\nDreams, money, homes, and cars\nBaby that's a given\nI'm talking 'bout every fantasy\nBe good real with me\nSo don't miss something move, ayy\nBaby, come with me and live the dream\n\n[Interlude: Rick Ross]\nJ.U.S.T.I.C.E. League (Maybach Music)\nIt's a whole 'nother different element\nIt's Maybach Roman numeral, four (Maybach Music)\nYou couldn't fathom this, you couldn't imagine this\nYou can't produce this, you won't reproduce this\n\n[Bridge: Ne-Yo & Rick Ross]\nI'll be dreaming of you, yeah (Ooh)\nI'll be dreaming of you, yeah\nCome and make it come true, ooh (Maybach Music)\nI'll be dreaming of you (Maybach Music)\nI'll, I'll (Maybach Music)\nI'll be dreaming of you, yeah (Maybach Music)\nI'll be dreaming of you, yeah (Maybach Music)\nCome and make it come true\nRozay! Huh (Maybach Music)\nI'll be dreaming of you\n\n[Outro: L.A. Reid & Ne-Yo]\nYessir, this is LA Reid\nCome and make it come true (Maybach Music)\nIt takes a boss to know a boss\nI'll, I'll\nIt takes greatness to recognize greatness\nRicky Ross, the boss, Maybach IV", "image": "https://images.genius.com/52547754f795d4ff94def40716ed3a2e.1000x1000x1.jpg"}], "artist": "Rick Ross"}