{"songs": [{"title": "One More Road to Cross", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "[Intro]\nUhh, this is life (this is life)\nThis is what I know (this what I know)\nSo to me (so to me)\nThis is life (this is life)\n\n[Chorus]\nOne more road to cross\nOne more risk to take\nGotta live my life\nLike there's one more move to make\n\n[Verse 1]\nI'm up at like 6AM to check this nigga\nHe work the nightshift and I gots to check them figures\nKnock on his door, peoples talkin' 'bout, \"He ain't there.\"\nBut the house is packed, shit I know he here somewhere\nSee, money get high, I don't knock what a nigga do to get by\nJust make sure you gettin' by don't fuck with you gettin' mine\nAin't the first time he ran off, shoulda split his shit then\nHate to think of what he's did and if I catch him slippin'\nWon't be an ass-whippin, I can tell you that\nI keep it real with this cat, he go and sell two packs\nAnd run off (damn) tell me he was locked down up North\nAnd you out a week later? That's bullshit! I bust off\nI need this dough—fuck you think, I'm here for my health?\nI need this wealth because I feed myself\nYou play with my life when you play with my money\nPlayin' round but this'll be the last time you think somethin's funny\n\n[Chorus]\nOne more road to cross\nOne more risk to take\nGotta live my life\nLike there's one more move to make\n\n[Verse 2]\nYo, I've been casin' the liquor store for a month now\nBut me and two other niggas\nIs about to run up in there and shut it down\nI got four people on the inside, one stay in the back\nTwo stock boys, one at the register but he count the stacks\nAight bitch, put on the ski mask!\nMake sure that when we ask\nFor the dough they know that we takin' all three bags\nNow see that? We got a hero, shoot that nigga!\nMatter of fact, you hit the back, I'll put two in that nigga\nHard-head motherfuckas always get it\nI told him what would happen if he moved\nThat nigga moved so I did it\n\"Did you get it?\" I asked my man as he was comin' from the back\nNigga opened his mouth, said nothin' and fell out flat\nThis cat come out spittin', hittin' my mans, his mans\nCouldn't control what was in his hands\nI'm hit, damn! I bust back and got the fuck up outta there\nDidn't get a dime, but at least I got up outta there\n\n[Chorus]\nOne more road to cross\nOne more risk to take\nGotta live my life\nLike there's one more move to make\n\n[Verse 3]\nAyo I see it, try to avoid it, but it comes\nThat's how it's goin' in the slums over crumbs\nSomethin' little becomes somethin' major\nNiggas gettin' blown up like a pager, ear to ear with the razor\nPour out my soul, took control of hurt\nWhy must Earl Simmons swim in dirt?\nI'm gon' make it work, 28 and tryna get baptized\nPriest scared to touch me 'cause he said I gave him bad vibes\nRide when I die, straight down but I'm plottin'\nWe all gots to go, but who wants to be forgotten?\nI'ma leave a mark and it won't be the mark of the devil\nThrow dirt and may your hands burn when you touch the shovel\nThe level of animosity is stoppin' me from thrivin'\nFuck what them niggas is talkin' about, I'm survivin'\nAlive and goin' through it, but I made my bed\nSo now it's in these flames that I lay my head\n\n[Chorus]\nOne more road to cross\nOne more risk to take\nGotta live my life\nLike there's one more move to make", "image": "https://images.genius.com/57efb548310ed90e73d9200fd01a3e59.630x630x1.jpg"}], "artist": "DMX"}