{"songs": [{"title": "Rhymes", "album": "Life Is... Too $hort", "year": null, "lyrics": "Without a doubt I'm coming back and if you don't know\nCall me S-I-R T double O\nI like to say these rhymes, I do it all the time\nI make my own damn beat now all the money is mine\nI carry big fat wads, I treat my girls like gods\nAsk 'em \"who do they love?\" and they all say \"Todd\"\nI'm just an M.C. rapper and nothin' else\nI keep rhymin' and I do it by myself\nCould you be like me? I rap my nonstop rhymes\nYou will never hear pause when I say these lines\nI go on and on, I'm sir Too Short\nJust what you've been lookin' for\nLike PCP or cooked cocaine\nDJ universe got you sprung in the game\nWe make money, hear my rap from coast to coast\nFrom host to host, I hear that toast:\n\"Too Short, love the way you make that hit\nHere's to you, keep rhymin' and boy don't quit\"\nI say this is how it goes when I say my rap\nMost times when I rhyme wouldn't be like that\nCause the way I write rhymes you will comprehend\nI keep rappin' to the very end\nAnd if you call me fake I'll say so what?\nGot you standin' and noddin' like you just shot up\nSo boy straightin' up I'm still rappin'\nComin' at you fresh. Do you know what happened?\nI'm sayin' rhymes messin' with your mind\nI didn't want your girl cause she really ain't fine\nI took her to a motel couldn't have been the hotel\nIt costs me 20 dollars but I did it so well\nShe had to tell your sister, your sister told you\nNow the whole damn town calls me playboy too\nI got rhymes, keep 'em comin', they don't stop\nI'm lookin' at an empty page about to fill it up\nI write only the truth, speak only to you\nSo if I tell you to say somethin' then you know what to do\nI got rhymes, keep 'em comin', they never stop\nI live in California, drive a drop top\nRoll by the beach, look at the freaks\nJump in my car, do it every week\nDJ's who know call me Mister Short\nAll you wanna be mothers get no child support\nI'm Too Short baby gettin' rich\nGet on the mic and then say... Like left to right\nRight to left girl stealin' your heart is like petty theft\nLike 10 to 9, 3 to 2\nI'll always be one up on you\nLike nightfall makes the sun go down\nCRAZY RACK laid the beat changed your life around\nFrom the sea to the mountains the mountains to the sea\nAll you're gonna do is wanna rock this beat\nIt's so rough so tough when I talk this stuff\nWhen I get on the mic I can't get enough\nI'm the rapper of the season, fresh and recent\nAll my raps are smooth undecent\nI'm that rapper known place to place\nFor the hardest rap with the hardest bass\nYou see I rap all the time, that's the point\nWhen I walk in the place , just jam the joint\nSingin' old Too Short's on the microphone\nThe beat's so fresh can't leave me alone\nYou see I rap so cool I will not shout\nI keep comin' so hard I might knock you out\nIf you're battlin' Short that's the chance you take\nSo you better come fresh and don't be fake\nAll you weak MC's with your weak drum beats\nTellin' all your people you can hang with me\nCount 1 to 10 count 10 to 20 and I'll just keep on makin' money\nLife is Too Short I don't stop\nI'm hooked on money like a junkie on top\nI got to make it every day, I won't go broke\nAsk me am I rich and I'll say \"no\"\nI'm your homeboy Too Short back again\nPuttin' Oakland on the map my rap will never end\nI'd like to send a special thanks to the dangerous crew\nFor believin' in me when they thought I was through\nI got rhymes, I keep 'em comin'\nI'm on the mic, I won't stop rappin' till it comes out right\nAnd when it's beatin' I'll just say \"let's roll\"\nI make another record and buy some gold\nI keep rhymin' and I do it by myself\nI'm like a one man crew, you see I don't need help\nI get the job done so all you fake rappers, MC's, rap masters\nGive it up leave that rappin' to me\nRealizin' young buck you can't rock that beat\nI rap on the mic and you'll believe\nNothin' ain't kickin' like the BIG OLD C\nIt's just one hard rapper spittin' a rap\nNot 3 or 4 sucka's or a couple of saps\nLike born to Mack I'll cash a check\nWalkin' 'round like a fool livin' up to his rep\nI'll tell you life ain't long\nWhat you waitin' for?\nThought you wanted to be like Too Short?", "image": "https://images.genius.com/9ed3ca4bcc64d64446ff7e9bea94be4e.600x600x1.jpg"}], "artist": "Too $hort"}