{"songs": [{"title": "Self Conscious (A.K.A. Yeah)", "album": "Freshmen Adjustment Vol. 1", "year": null, "lyrics": "[Intro]\nNow you know you gotta turn this super loud\nC'mon now, let's go, uh\n\n[Chorus]\nLet me hear you say\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nOkay, uh, let me hear you say\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\n\n[Verse 1]\nI know you're wondering, how is Kanye spittin' so hot?\n'Cause I listen to the Roc and I listen and watch\nAnd the first thing I copped was a glistening watch\nOff that Blueprint money, yeah, I know I'm a dummy\nBut what I'm supposed to tell a girl in the club\nWhile that ass is getting feeled on\nWhat, I bought a couple build-ons?\nSeems like I got more brain off my fake chain than my real one\n'Cause on the real, son\nIf a girl think you broke, she just wanna fuck and smoke\nIf you paid then she's thinking 'bout her children, feel him?\nProbably not though, 'less you got dough, you know what I mean\nYou would think the grass greener when you finally get green\n\n[Chorus]\nLet me hear you say\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nOkay, okay\n\n[Verse 2]\nMan, I promise, she's so self conscious\nShe has no idea what she's doing in college\nThat major that she majored in don't make no money\nBut she won't drop out, her parents will look at her funny\nNow, tell me that ain't insecure\nThe concept of school seems so secure\nSophomore three years, ain't picked a career\nShe like, \"Fuck it, I'll just stay down here and do hair\"\n'Cause that's enough money to buy her a few pairs of new Airs\n'Cause her baby daddy don't really care\nShe's so precious with the peer pressure\nCouldn't afford a car so she named her daughter Alexis\nShe had hair so long that it looked like weave\nThen she cut it all off, now she look like Eve\nAnd she be dealing with some issues that you can't believe\nSingle black female addicted to retail and\n\n[Chorus]\nLet me hear you say\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nOkay, okay\n\n[Verse 3]\nMan, I promise, I'm so self conscious\nThat's why you always see me with at least one of my watches\nRollies and Pashas done drove me crazy\nI can't even pronounce nothing, pass that Versace!\nThen I spent 400 bucks on this\nJust to be like, \"Nigga, you ain't up on this!\"\nAnd I refuse go to the grocery store\nWithout some ones that's clean and a shirt with a team\nIt seems we living the American dream\nBut the people highest up got the lowest self esteem\nThe prettiest people do the ugliest things\nFor the road to riches and diamond rings\nWe shine because they hate us, floss 'cause they degrade us\nWe tryna buy back our forty acres\nAnd for that paper, look how low we a'stoop\nEven if you in a Benz, you still a nigga in a Coupe\n\n[Chorus]\nLet me hear you say\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nOkay, okay\n\n[Outro]\nAnd uh, I decided to stop fuckin' with y'all\nUh, wack ass niggas\nAnd, uh, hatin'-ass, dream killin'-ass niggas\nAnd since I quit\nEveryone that supported me, thank you very much\nAnd everyone that doubted me, thank you very little", "image": "https://images.genius.com/f19f8ff1e7651fa913e52a6ab656d7ce.500x500x1.jpg"}], "artist": "Kanye West"}