{"songs": [{"title": "It’s Like That", "album": "The Beautiful Mixtape Vol. 2: The Struggle Continues", "year": null, "lyrics": "[Ludacris]\n(Intro)\nYEAH! Ludacris in this muthafucka\nWhat up Talib\nDisturbing tha Peace Godamnit\nWe just getting started\nMixtape style it goes like this, look here:\n\nNow Ludacris out the gate and damn it it's hunting season\nWhen you shot remember everything happens for a reason\nAnd you never hit it right: that's why I'm snatching your girl\nShe calls me Mr. Drummond - cause Diff'rent Strokes rule the world\nI got a, thirst for knowledge and a appetite for drama\nOr appetite for destruction, and a thirst for your mama\nEither way I keep it going 'til that thang is empty\nBeen nice since Mike Tyson punched Soda Popinski\nChicks keep getting stung cause they're all in my swarm\nPlus I step in they dorm and get more cheers than Norm!\nIt's 2004 the world needs more lesbians\nAnd more drunk drivers, to hit drunk pedestrians\nThey walk around here with two left feet\nBut warm milk and cold gat'll put yo ass to sleep\nI'm in these streets still no matter how ugly it seems\nLong as I got on my bulletproof Buddy Lee jeans\n\n[Talib Kweli]\nKweli and 'Cris\nNiggas never heard no shit like this\nYeah, I got your chick feeling moist\nYou coming softer than an ad in the back of the Village Voice\nYou still a toy\nThe cops is still the boys\nThey trying to get me to vote by saying the lesser of two evils is still a choice\nWell maybe or maybe not\nNiggas rhyming like they got 80 Glocks\nYou home watching I Love the 80's - STOP\nPicture the ocean with the panoramic view\nMy flow the iceberg that the Titanic ran into\nOoh I, rock like suicide victims who wear flannel\nWhile your rhymes sound like they was written by Clear Channel\nI used to, drive through 50 states and hear 50 flows\nNow every city knows the same song, It's just a game of pimps and hoes\nAnd the kids think the key to get down in the game\nIs to copy the hot nigga and start sounding the same\nNow you trying to be heard but your shouts is in vain\nCause you drowned out by the buzz that's surrrounding my name, you lame\nThe mic is something that you can't pry from me\nShout out to I-20\nSha my rhymes is good money\nWhether rollin' with Achmed and Dervin swerving the street\nTo where Chaka Zulu, Shawnna and Luda Disturbing tha Peace\nI murder the beat\nI'm the nightmare that recur in your sleep\nMy word is the flesh like the wafer that the nun got the converted to eat\nThey say he's the lamb of God herded the sheep\nA whole flock of followers, nigga do you believe?\n\n[The Game]\nYo what's poppin' it's the kid Game\nAnd my nigga Ludacris\nMy homeboy, my dawg, my brother from another mother, Talib Kweli\nAnd this is how we do it man, hate it or love it\n\nYes who fresher than I?\n'didas red and black lumberjack 45 in his Levi's\nYeah since knee highs\nI watched Easy E rise\nPut LA on illmatic but they ain't believe Nas\nNow it's '96 in the Jeep high\nTa told me they don't believe you start writing rhymes after B-I-G died\nEyes puffy, some niggas saying fuck me\nCause I'm from the west, I'm fresh and I idolize Doug E\nNow NY hug me still niggas want to hate\nI'm embraced by 50 states and the westside love me\nBids[?] told Dre I'm the nigga to chase\nAnd it been that way since the beef with Jigga and Mase\nAnd my Chuck Taylors red ones with the phat laces\nTan khakis desert eagle with the hollow tip laces\nFresh white tee, yellow rocks in my necklace\nReal gangstas drink 40 ounces for breakfast\nI eat Fatburgers three times a day\nSo fuck you if don't like the red paint on my six tre'\nI was born in the hood, I be who I be\nAnd me and Kweli is like Mack 10 and WC", "image": "https://images.genius.com/77b2cb0937e1d9604da173026219d5ac.705x706x1.jpg"}], "artist": "Talib Kweli"}