{"songs": [{"title": "No Sunshine", "album": "Simmz Beatz Presents - The Best Of DMX", "year": "2001-01-01", "lyrics": "It's dark, and hell is hot\n\n[Hook]\nAin't no sunshine when it's on\nOnly darkness every day\nAin't no sunshine when it's on, cause when it's on\nYa niggas know to be gone, everytime, cause we don't play\n\n[DMX]\n\"Who turned out the lights?\" is what niggas be sayin\nNow you don't wanna fight, but y'all niggas be playin\nThinkin it's alright, keep playin with that role\nAnd you gonna know the night, when you layin in that hole\nDirt gettin tossed in yo' grave, now it's all over\nPreacher said \"You was brave,\" but now it's all over\nYou just one of the many, plenty, I done gave it to\n(*boom*) Ain't no savin you\nNo matter how many tears your moms' cried\nAin't gon bring yo' ass back, plus in hell you gon' fry\nWhy? But now the only two relative questions\nIs \"Do we bury him or burn? Any suggestions?\"\nEither way, you up out of here for good\nNow when niggas mention your name they knockin on wood\nDid I, get my, point across?\nAnother body on the shottie another joint I toss\n\n[Hook]\nAin't no sunshine when it's on\nOnly darkness every day\nAin't no sunshine when it's on, cause when it's on\nYa niggas know to be gone, everytime, cause we don't play\nEverytime, cause we don't play..\nEverytime, cause we don't play..\n\n[DMX]\nIt ain't no sunshine when the Dark Man comes out\nAnd I want mine, so I plan to keep my gun out\nWe got four 9's, so niggas run in and run out\nBut I bust mine, cause I'd like to hear some shouts\nGet at me dog, niggas know how its goin dizzy\nWhen it comes to that flow, I gets busy\nWho is he? Dark Man, of the unknown\n(GRRR, ARF!) One dog, one bone\nNow who ain't goin home? Looks like you\nYou hear strike one, talkin shit, strike two\nWon't be a strike three, cause I don't play fair\nI'mma look you in your eye while he hit you from the rear\nBe like - yeah, holdin you up cuz you fallin (WHAT?)\nThe Lord ain't comin, 'til niggas stop callin\nYou was ballin, a minute ago, in it for dough\n'til it was, \"Yo, I swear to God, I didn't know\"\n\n[Hook]\nAin't no sunshine when it's on\nOnly darkness every day\nAin't no sunshine when it's on, cause when it's on\nYa niggas know to be gone, everytime, cause we don't play\nEverytime, cause we don't play..\nEverytime, cause we don't play..\n\n[DMX]\nAnd I know, I know, I know, I know, I know\nWhatchu think you gon' get, fuck around with my dough\nJust so it ain't no mistakes, this is my show\nOne (one) two (two) three, here I go!\nYour shit is quick, and your shit is slick, but this shit is thick\nAin't you hear this shit? Damn right, I can finish shit\nIf you caught that verse without a rewind you can see mine\nBut you be blind, I'll do it 360 and come up from behind\nTap you on your shoulder, have you turnin around\nHit you with somethin that'll have you burnin the ground\nBe like, \"Damn, ain't nuttin left of money, but a pile of ash\"\nLife is good, so please enjoy it while it lasts\nCause you know ain't got much longer to go\nThe quicker you go depends on the stronger the flow\nAnd niggas know, I don't give a FUCK, right or wrong\nThere ain't no sunshine when it's on\n\n[Hook]\nAin't no sunshine when it's on\nOnly darkness every day\nAin't no sunshine when it's on, cause when it's on\nYa niggas know to be gone, everytime, cause we don't play\nEverytime, cause we don't play..\nEverytime, cause we don't play..", "image": "https://images.genius.com/48668269c1848d851640948861b065de.300x293x1.jpg"}], "artist": "DMX"}