{"songs": [{"title": "Splash", "album": "Prophets vs. Profits", "year": null, "lyrics": "Word up!  It's just a little somethin to tide you over, word up\nThe \"KRStyle\" album comin soon, KRS-One all in the room\nWe gonna bounce these cats this year, word up\nWhy they do this?  Ha - yo, yo\n\n[KRS-One]\nI climb up the back of rappers\nReach over they head, and rap backwards at 'em\nExcuse me madam, I used to throw these uzis at 'em\nBut I'm a teacher, skills I truly have 'em\nThese clubs I duly pack 'em\nPotential lawyers engineers and doctors, I do attract 'em\nGo to your professors and ask 'em\nIf the songs of the \"Edutainment\" in college they didn't blast 'em\nYes - I'm that ancient one\nI set the framework for today's rappers to make they funds\nBut no you don't know me son\nMy facial features matches the Sphinx with it's nose redone\nYou know how many clubs we done rocked?\nYou know how many guns we done popped?\nYou know how many funds we done dropped?\nYou know how many ones we done got?\nWe been gettin live since the days of Chubb Rock\nWe know how to survive; these other cats\nBe in at nine o'clock then be out at five, uhh\nWe doin the overtime, on stage I over-rhyme\nMakin these whack rappers tow the line\nSteppin to me, I know you blind; cause your whole flow\nYour show, your style, you know it's all mine!\nThe first time you learned to spit\nIt was either me, Kane, Rakim or Slick Rick!\n{*water splashes*}\n\nWelcome to the \"KRStyle\"\nThis year I had to switch styles and bust off two miss-iles\nAnd that's not all, rappers have the gall\nTo pray and pray for my downfall - but still in all\nI have X amount of lyrics to get 'em all\nLive at the club I spit 'em all\nRappers backstage lookin sad and piti-fal\nCause they know I'm the pinna-cle and they mini-mal\nI spit the metaphysical, the spiritual\nThe oracle, the lyrical, the oratorical\nRookie!  I'll mop the floor witcho'\nI'm the lyrical foundation to all your flows\nAll your clothes, all your shows and I'm not alone\nYou wouldn't even know how to hold the mic or the phone\nYou couldn't even bite on the bone\nWhile we was rockin mics out in Rome\nNow you hyped cause you grown?\nYou know we internationally known, the people love it\nBut what they learnin bout is on the whole, look above it\nBut let us get back to what we call hip-hop\nBefore you whack rappers went pop\n{*water splashes*}", "image": "https://images.genius.com/32bf9790e346029d7cf0897f83ab18fa.1000x1000x1.jpg"}], "artist": "KRS-One"}