{"songs": [{"title": "Heavy Hitters", "album": "I’m Good", "year": "2003-01-01", "lyrics": "[Intro: Kanye West]\nHeavy hitters fo' life, heavy hitters fo' life\nMm, mm\nMm-mm\n\n[Verse 1: Kanye West]\nYou rappers think I give a fuck about the way that they spit\nWanna be on my album but don't want me on they shit\nEverybody thought I was makin' a compilation\nI was really makin' myself they compe-tation\nFresh off the plane from the All-Star game\nBone girls on TV so it's All-Star trains\nJust picture man (Uh-huh), no snitchin' man (Uh-uh)\nSomethin' for the fiends fresh out the kitchen, man\nLast 9/11 I was poor on the ave, 'til I pluraled my math\nNow it's Porsche 911 and I'm floorin' the gas (Errr!)\nGot a lot of problems, money's one that I not have no more\nUh, well, Dame look at how everybody changed\nTell Jay that I'm 'bout to change the game\nTell Biggs that we about to get paid\nAll my niggas is 'bout to have it made\nThis makes everything else sound played\nGoddamn, Kanye! (Kanye! Kanye!)\nNow hold up! Ain't nobody messin' with me, dog\nNow, you say it! (\"Ain't nobody messin' with you at all!\")\nI told dude, \"You can't even rap on my interlude\"\nNow does that make me as rude as Jude?\n(\"When the album comin' out?\") Man, the people is askin'\nYamamoto Adidas is sick with the fashion\nY'all already got dough so you spit for the passion\nThe way you rhyme give me Tribe Called Quest\u008b flashbacks\nAnd let's not even bring up the tracks, man\nNope, nope, let's not do that, man\nYou eatin' up the game like Pac-Man\nAnd got the whole world shakin' just like crack fiends\n\n[Hook: Kanye West]\nHeavy hitters, fo' life (Woo!)\nRoc-a-Fella is fo' life\nThrow your diamonds up, throw your diamonds up\nThrow your diamonds\nJust let the beat ride out for a minute\n\n[Interlude: GLC & Kanye West]\nLet's take it there, take it there, man\nChamp 'posed to be what you see\nThe People's Champ, you ugly\nGLC, where you at homie?\n\n[Verse 2: GLC]\nHow many niggas you know that put their life on the line\nTo get signed? Did a few high crimes, almost had lights out\nAfter the sunshine, you thinkin' it might count\nHow could I might doubt? Just look at my account\nI used to work at the mall with nothin' at all\nSeeing niggas that ball, that shit was depressing\nKeep my clothes in the cleaners, I ain't with the pressing\nWhen I copped them pounds, it was my best investments\nDre got shot (Ugh) and that taught me a lesson\nFor stickin' niggas up and them rubbery masses\nMask like Batman, minus the tight pants\nWould hit your baby momma but her elbows is ashy (Uh-uh)\nFour different blues, man, your outfit is clashin' (Ha!)\nYou ain't got no muscles, you weakling bastard (Haha)\nMan, look at your haircut\nMm-hmm, mm-hmm, NAW, your hair sucks!\nHow many niggas you know is really heavy hitters?\n'87 Go-Getters, two hoes like John Ritter\nEven did it on his crime picture and yeah (Uh, uh, uh)\nAnd offers to sell and yell, uh\n\n[Hook: Kanye West]\nHeavy hitters fo' life\nRoc-A-Fella is fo' life\nThrow your diamonds up, throw your diamonds up\nThrow your diamonds", "image": "https://images.genius.com/f2d6d3b797bf7bae8ff7011f2fb7b351.811x811x1.jpg"}], "artist": "Kanye West"}