{"songs": [{"title": "Nail in the Coffin (Benzino Diss)", "album": "Raw and Uncut", "year": "2002-11-21", "lyrics": "[Intro]\nThis motherfucker, man!\nJust won't shut up, will you?\nTalking 'bout I owe him\nBitch, you owe me!\nI'm promotin' you right now\nYo, let's put the nail in this coffin!\n\n[Hook]\nI don't wanna be like this\nI don't really wanna hurt no feelings\nBut I'm only being real when I say\nNobody wants to hear their grandfather rap (nope)\nAnd old men have heart attacks\nAnd I don't wanna be responsible for that\nSo, put the mic down and walk away\nYou can still have a little bit of dignity\n\n[Verse]\nI would never claim to be no Ray Benzino\nAn 83-year-old fake Pacino\nSo how can he hold me over some balcony without\nBlowing his lower back out as soon as he goes to lift me?\nPlease don't—you'll probably fall with me\nAnd our asses'll both be history\nBut then again you'd finally get your wish\n‘Cause you'll be all over the street, like 50 Cent\nFuckin' punk pussy! Fuck you, chump!\nGive me a one-on-one, see if I don't fuck you up\nTried to jump the Ruff Ryders and they cut you up\nAnd you put Jada on a track, that's how much you suck\nDick in the industry, swear that you in the streets hustlin'\nYou sit behind a fuckin' desk at The Source butt-kissin'\nAnd beggin' motherfuckers for guest appearances\nAnd you can't even get the clearances\n'Cause real lyricists don't even respect you or take you serious\nIt's not that we don't like you—we hate you, period\nTalk about a mid-life crisis, damn\nLast week you was shakin' Obie Trice's hand\nNow he's a buster? What the fuck's with that?\nGet on a track dissin' us, kissin' 50's ass\nAnd askin' me what I know about indictments, bite me!\nBitch, I got two cases and probation—fight me!\nWhat do I know about standin' in front of a judge like a man\nReady to take whatever sentence he hands?\nWhat you know about your wife slicin' her wrists\nRight in front of the only thing that you have in this world\nA little girl?\nAnd I put that on her, when this is all over\nI would never try to make her a star and eat off her\nI don't know shit about no choppin' rocks\nBut what you know about Hip Hop Shops rockin' spots\nWhere you the only white boy up in that bitch just rippin'?\nPressin' up your own fliers and your stickers, stickin'\nThem bitches up after spendin' six hours at Kinko's\nJust makin' copies of your covers of cassette singles\nTo sell them out of the trunk of your Tracer\nSpendin' your whole paychecks at Disc Makers\nWhat you know about being bullied over half your life?\nOh, that's right, you should know what that's like\nYou're half white; Vanilla Ice, spill the beans and rice\nI'm eatin' you alive inside, Jesus Christ!\nIf you're that much of a gangsta, put the mic down!\nYou should be out killin' motherfuckers right now\nKill a motherfucker dead, kill him dead, bitch!\nShoot 'em in the fuckin' head—go ahead, bitch!\nSlap my mom! Slap the fuck out of her!\nShe can't sue you, she wouldn't get a buck out of ya\n‘Cause you're broke as fuck, you suck, you're a fuckin' joke\nIf you was really sellin' coke, well, then what the fuck\nYou stop for, dummy? If you slew some crack\nYou'd make a lot more money than you do from rap\nYou'll never have no security, you'll never be famous\nYou'll never know what it's like to be rich\nLife's a bitch, ain't it? Raymond?\nHere, let me break the shit down in layman's\nTerms for you, just to make sure that you can understand it and\nCanibus ain't using too many complicated fuckin' words for you\nHere, let me slow it down for you\nSo that you could understand if I say it slower\nLet it go, dog, it's over\n\n[Hook]\nI don't wanna be like this\nI don't really wanna hurt no feelings\nBut I'm only being real when I say\nNobody wants to hear they grandfather rap (nope)\nAnd old men have heart attacks\nAnd I don't wanna be responsible for that\nSo, put the mic down and walk away\nYou can still have a little bit of dignity\n\n[Outro]\nHaha… talking 'bout I have motherfuckers callin' your crib\nBitch, you ain't even got a fuckin' crib!\nYou ain't even got a fuckin' phone… fuckin' bum!\nThreatenin' to shut me down at your lil' fuckin' Source magazine, if I come back on you and attack you\nBitch, you attacked me first!\nTake it like a man, and shut the fuck up!\nAnd fuck your little magazine too!\nI don't need your little fuckin' magazine\nI got XXL's number anyways\nAnd y'all can't stand it, ‘cause they gettin' bigger than y'all\nOh, and by the way, how'd I look on the VMA's?\nWhen you was watchin' me\nFrom whatever fuckin' TV you was watchin' me from\nFrom Boston… the mean streets of Boston\nFuckin' sissy! And you got us scared up in here, motherfucker\nSuck our motherfuckin' dicks!\nOh! And for those that don't know\nDon't get it twisted, y'all: The Source has a white owner!", "image": "https://images.genius.com/9aa2b669d2a5f46dc081ba18ab21f7aa.500x500x1.jpg"}], "artist": "Eminem"}