{"songs": [{"title": "Words of Wisdom", "album": "2Pacalypse Now", "year": "1991-11-12", "lyrics": "[Intro]\nKilling us one by one\nIn one way or another\nAmerica will find a way to eliminate the problem, one by one\nThe problem is the troublesome Black youth of the ghettos\nAnd, one by one, we are being wiped off the face of this Earth\nAt an extremly alarming rate\nAnd even more alarming is the fact that we are not fighting back\nBrothers, sisters, niggas\nWhen I say \"nigga\" it is not the nigga we have grown to fear\nIt is not the nigga we say as if it has no meaning\nBut, to me\nIt means \"Never Ignorant Getting Goals Accomplished\", nigga\nNiggas, what are we going to do?\nWalk blind into a line or fight?\nFight and die if we must\nDie, like niggas\n\n[Verse 1]\nThis is for the masses, the lower classes\nThe ones you left out, jobs were giving, better living\nBut we were kept out\nMade to feel inferior, but we're superior\nBreak the chains in our brains that made us fear ya\nPledge allegiance to a flag that neglects us\nHonour a man that that refuses to respect us\nEmancipation Proclamation? Please!\nLincoln just said that to save the nation\nThese are lies that we all accepted\nSay no to drugs but the governments' kept it\nRunning through our community, killing the unity\nThe war on drugs is a war on you and me\nAnd yet, they say this is the Home of The Free\nBut if you ask me, it's all about hypocrisy\nThe constitution, yo, it don't apply to me\nAnd Lady Liberty? Stupid bitch lied to me\nThis made me strong, and no one's gonna like what I'm pumpin'\nBut its wrong to keep someone from learning something\nSo get up, its time to start nation building\nI'm fed up, we gotta start teaching children\nThat they can be all that they wanna to be\nThere's much more to life than just poverty\n\n[Interlude]\nThis is definitely uh... words of wisdom\nAMERICA! AMERICA! AMERIK-K-KA\nI charge you with the crime of rape, murder, and assault\nFor suppressing and punishing my people\nI charge you with robbery for robbing me of my history\nI charge you with false imprisonment for keeping me\nTrapped in the projects\nAnd the jury finds you guilty on all accounts\nAnd you are to serve the consequences of your evil schemes\nProsecutor, do you have any more evidence?\n\n[Verse 2]\nWords of Wisdom\nBased upon the strength of a nation\nConquer the enemy armed with education\nProtect yourself, reach for what you want to do\nKnow thyself, teach by what we've been through\nArmed with the knowledge of the place we've been\nNo one will ever oppress this race again\nNo Malcolm X in my history text, why's that?\n’Cause he tried to educate and liberate all blacks\nWhy is Martin Luther King in my book each week?\nHe told blacks, if they get smacked, turn the other cheek\nI don't get it, so many questions went through my mind\nI get sweated, they act like asking questions is a crime\nBut forget it, cause one day I'm gonna prove them wrong\nNot every brother had his mother on the welfare line\nThe American Dream, though it seems like it's attainable\nThey're pulling your sleeve, don't believe\n’Cause it will strangle ya\nPulling the life of your brain, I can't explain\nBeg as you can obtain from which you came\nYou swear to your mother that you living in equality\nForgetting your brother that's living here in poverty\nThought they had us beaten when they took out King\nBut the battle ain't over till the black man sings\nWords of Wisdom\nThe battle ain't over 'till the black man sings\nWords of Wisdom\n\n[Outro]\nNIGHTMARE! That's what I am\nAmerica's Nightmare\nI am what you made me\nThe hate and the evil that you gave me\nI shine as a reminder of what you've done to my people\nFor four hundred plus years\nYou should be scared\nYou should be running\nYou should be trying to silence me\nHa, but you can not escape fate\nFor it is my turn to come\nJust as you rose you will fall\nBy my hands\nAmerica, you reap what you sow\n2Pacalypse, America's Nightmare\nIce Cube and Da Lynch Mob, America's Nightmare\nAbove The Law, America's Nightmare\nParis, America's Nightmare\nPublic Enemy, America's Nightmare\nKRS-One, America's Nightmare\nNew Afrikan Panthers, America's nightmare\nMutulu Shakur, America's Nightmare\nGeronimo Pratt, America's Nightmare\nAssata Shakur, America's Nightmare", "image": "https://images.genius.com/839619da9eb2d92ecf5367044a1fb2ba.500x500x1.jpg"}], "artist": "2Pac"}