{"songs": [{"title": "Bone (Babylon Remix)", "album": null, "year": null, "lyrics": "[Intro]\nBone\nCome play with it baby\nUh\nYou know what I'm saying?\nYeah you already know\n\n[Hook 1]\nShe's  feeling herself a little too much\n(Come play with it, you can stay in it)\nShe's killing her self, why you gotta be so rough?\nYou done worked your fingers to the bone\nShe's  feeling herself a little too much\n(You stay in it, so play with it)\nShe's killing her self, why you gotta be so rough?\nYou done worked your fingers to the bone\n(Yeah) their bones\n\n[Verse 1]\nYou can talk to us, you can walk to us\nBut you still lost to us\nWorth your worth wait in waiting\nBut that ain't how much you cost to us\nYou dope though, worth your weight in weight\nBorderline fine, but you can't get back across to us\nYour dime bags ain't freeway\nAnd you're Ross to us, your cartel, you ain't barball\nYou a Barbie, you can't maintain that\nThat's why your bar fell\nAnd your pussy waxed\nFrom letting all them niggas push it back\nNasty nostalgia from all the places you took it at\nFlashbacks are where you looking at\nNow what? You clear cut\nSwitching heels, and your hair up?\nYou know how many bills been inside your pudding pack?\nYou done clique'd up with some lame\nWe got to see in a different frame\nYou the same picture to the same\nNiggas that came all inside of your brains\nSelf approved but don't stunt\nSwitch it up but don't front\nJust to return back to getting turned out\nAnd fucking for what you want\nSucking for what you need\nBut you don't even really need that\nYou just suck for love\nBut you don't even really believe that\n\n[Hook 2]\nYou feeling yourself a little too much\n(Stayed up all inside you, self)\nShe's killing her self, why you gotta be so rough?\nYou done worked your fingers to the bone\nTheir bones\nShe's feeling herself a little too much\n(She played with it, but she can't stay in it)\nShe's killing her self, why you gotta be so rough?\nYou done worked your fingers to the bone\n(Yeah) their bones\n\n[Verse 2]\nYou gonna break your back tryna be like these televised hoes that you see on TV\nTryna keep up with a magazine cover, living unreal lives that they heard on CD's\nFake ass, fake face, fake titties, that's great shape\nThey don't make sense, let's make papes, that's real food but saying fake grace\nBut we don't care cause it tastes great, this bullshit on these great plates\nBut who am I to say what's what? But if God real then we fucked up\nIf God real then we fucked up, if God real then we fucked up\nAnd I can only blame myself and BET uncut\nSo many shades of gray, in the new generation, they young sluts\nHas it always been this way? Squirrels only really happy when they nut bust\nYou can take a look at the animal kingdom if you don't agree\nThey be going hard just to get a mate, then get the pussy then leave\nAnd lions be having like four hoes with no clothes, that's so cold\nThat justifies what's in a nigga mind, they do the same shit for the homos\nStuck up girl be like, \"oh no\" J. Cole got her looking for a J. Cole\nShe gon' pass up somebody way cool and end up on some pimp nigga pay roll\nCause...\n\n[Hook 3]\nShe feeling herself a little too much\n(Stayed up all inside you, self)\nShe's killing her self, why you gotta be so rough?\nYou done worked your fingers to the bone\nTheir bones\nShe's feeling herself a little too much\n(She played with it, but she can't stay in it)\nShe's killing her self, why you gotta be so rough?\nYou done worked your fingers to the bone\nTheir bones\n\n[Outro]\nI'm sorry I'm just being emotional\nI just wanted to get really close to you\nBut you was being so unsociable\nPlayed this game, it's being so uncoachable\nOr is it me and you're really approachable?\nBut I don't know cause I'm too intimidated\nI overcompensated and started roasting you\nFrom afar, and I don't even know who you are\nOr maybe I do\nBut you ain't impressed by my car and that shit ain't cool\nLuxury clothes equals fucking hoes, and those are the rules\nBut you breaking it, these frame change ring, watch, bracelet\nThis champagne, tasting it, we've been talking like five minutes\nAin't you already supposed to be naked bitch?\nBut you feeling yourself?\nYou feeling yourself?\nYou feeling yourself?\nYou feeling yourself?\nYou feeling yourself?", "image": "https://images.rapgenius.com/958946926e1807c091884771475577e0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}