{"songs": [{"title": "Get Fresh (feat. Burtono)", "album": null, "year": null, "lyrics": "[Verse 1: Tyler, The Creator]\nMost niggas think I'm redundant\nBecause I like to take my shopping sprees out in London\nI go to the can\nI go shop in Japan\nA diamond black card I get as much as I can, man\nMy set of chains seems so real\nImagination change the way that it feels\n'Cause it's soft\nIce Creams and Dunks\nMy girl rock Louis Vuitton pumps you'd ask how much it costs\nMy nigga I go hard, I rock Goyard, Supreme- oh God\nThought I had to wear black just to kick bush\n'Till a mechanic button pushed me just to get pushed\nNiggas know I'm a teenage millionaire\nGot Polos to match every color Care Bear\nI get fit with Ralph Lauren, white tees is borin'\nThat's why I rock the best\nMy nigga get fresh\n\n[Hook: Tyler, The Creator]\nI'm color coordinated (get fresh)\nMan I color coordinated this so (get fresh)\nHe is color coordinated (it's fresh)\n\n[Verse 2: Burtono]\nYeah, all white Polos, self title'd jeans\nPhiliano Burtono, dog on everything\nYa boy Philiano is OTC\nAnd as a boy I'd shop out this country\nYa boy Philiano got his own clothing\nWhat's the name of it? It's named after me\nYou ain't gotta stay tuned, this ain't a cartoon\nSon, where in apartments Burtono, it's coming soon\nRed, white, blue, that's so fresh\nBlack on black, you look like a mess\nThe funny part about it, I'm so funny\nI'm so fresh to death, I sweat money\nI love it, chillin' in the public\n300 bucks for the Rock & Republics\nI don't know, but I'm not the best\nI stay, I'm just tryna impress\nBut just get fresh\n\n[Hook]\n\n[Verse 3: Tyler, The Creator]\nI go to Beverly Hills for perfection\nJust so I can scope out the new Polo Hanson\nMy own clothing gives me an erection\nI like to jack off to my own clothing\nNigga, check my wallet and see how much I'm holding\nA new Bathing Ape t-shirt I'm unfolding\nCuffed pants, Bloxhead main attraction\nWhere my jeans now have a creative reaction\nWhen my jeans get ripped up from my crew\nProbably because my new printing label look blue\nOrange, yellow, green, pink I got fits\nMy closet has thicker silicone than Lil Kim's tits\nAnd as you could tell I'm on a mission\n'Cause I got more True Religion than a Christian\nI'm rockin in public, Banana Republic\nYou rockin Akademik jeans? I'm rockin Rock & Republic\n(????) My flow is sicker than (???) havin sex\nAnd you know what's next, I'm one of the best\nYes, I'm not even gonna tell you the rest\nMy nigga get fresh\n\n[Outro]\nOooh, yeah", "image": "https://images.genius.com/e037690384c02196ed7ef6e7a7377803.166x166x1.jpg"}], "artist": "Tyler, The Creator"}