{"songs": [{"title": "Purple Swag REMIX", "album": "LONG.LIVE.A$AP (Deluxe Version)", "year": "2012-03-23", "lyrics": "[Intro: Paul Wall]\nWhat it do, baby?\nIt's Paul Wall, come on\n\n[Verse 1: Paul Wall]\nPurple pint, that's Gucci rap\nDriving slow, black on black\nBackwood lit, windows cracked\nDime in my lap with her hair pulled back\nAnd a hand full of diamonds all on my wrist\nMouth full of ice, pardon my lisp\nWorld full of hate is fear a few rips\nSo I open my mind and stack up my chips\nLollipop grind, whole lotta licks\nFrom paper planes to a house made of bricks\nBig ol' cold cup with codeine mix\nSo I'm so throwed and I'm still gettin' lit\nAnd everything is purple, baby\n\n[Chorus: A$AP Rocky]\nI said, everything is purple (Swag)\nEverything is purple (Swag, swag, swag)\nI said, everything is purple (Swag)\nEverything is purple (Swag, swag, swag)\n\n[Verse 2: Bun B]\nTrill OG and I rep the South\nNigga, I rep the streets and I rep the hood\nAnd I'm grippin' grain, grippin' stains\nAnd I'm flippin' mane and it's kinda good\nI'm holdin' wood with diamonds on it\nHittin' the block and I'm grindin' on it\nWith a big ol' chain and a big ol' piece\n‘Cause when I'm in these streets I be shinin', homie\nHaters better get they ass behind me, homie\n‘Cause I'm in the front and I'm takin' charge\nAnd when I'm done, I'mma have a homie run\nAnd they be hard to find like they's El Debarge\nAnd my swag is large, extra large\nI can barely fit it up in this room\nBut don't sweat the size and don't be surprised\nWhen your bitch reminds that I'm the shit to swoon\nI lick the blunt and I pass the 'dro\nSpit my game and I smash your ho\nBut no, I ain't trick, it's no passin' dough\nThen I hop up in this slab and I mash it, bro\nI got a passion for this Southern flow\nThis that purple life and we thuggin', bro\nThese haters might not really understand it\nBut that's all good ‘cause we love it though\nThis PAT, that's where I'm from\nThat's what I rep and that's how it go\nI roll with rocks so get up off the jock\nFrom New York to PA, this that purple flow\nIt's that swag\n\n[Chorus: A$AP Rocky]\nI said, everything is purple (Swag)\nEverything is purple (Swag, swag, swag)\nI said, everything is purple (Swag)\nEverything is purple (Swag, swag, swag)\n\n[Verse 3: A$AP Rocky]\nPurple swag, purple swag, I'm in the zone, I'm getting throwed\nThat purple swag, purple swag, that purple smoke up in my clothes\nThat big booty, juicy fruity, yellow bone, I wanna bone\nI'm getting dome, I took her out, dick in her mouth, she getting on\nI'm flexing steel, I'm flexing still, I'm sitting high, I'm tipping slow\nI'm Texas trill, Texas trill, but in NY we spit it slow\nI got these boppas going crazy, they see me comin'\nRobitussin, quit discussin', A$AP, tell these niggas somethin'\n\n[Chorus: A$AP Rocky]\nI said, everything is purple (Swag)\nEverything is purple (Swag, swag, swag)\nI said, everything is purple (Swag)\nEverything is purple (Swag, swag, swag)\n\n[Interlude: Killa Kyleon]\nHa-ha-yeah\nCheck, one, two, what it do?\nRun it!\n\n[Verse 4: Killa Kyleon]\nFo's spinnin' like the shit under my wave cap\nJust rock it like a nigga named \"A$AP\"\nFast money man, I get mine ASAP\nAlways stacking and I'm paid, that's ASAP\nWood grippin', candy drippin'\nFour in my 20, I'm candy sippin'\nFill my prescription, I'm leanin', ho\nNightmare cup, I'm dreamin', ho\nTrill nigga like Chad and Bun B\nCrocodile seats insides, I'm Dundee\nSlow that down, Screw, Watts or Ron C\nI'm getting rap money but I used to run D\nMC, rep, run it\nFrank Cyser shit, any beat get punished\nY'all got problems, I get money\nSo my neck, fist, wrist always look sunny\nI stay fresh, y'all niggas look bummy\nCold with the flow, so I ball like Tommy\nMartin, I keep a yellow bone like Gina\nThick like Serena, my pockets on Venus, nigga!\n\n[Chorus: A$AP Rocky]\n(Swag) Everything is purple (Swag)\nEverything is purple (Swag, swag, swag)\nI said, everything is purple (Swag)\nEverything is purple (Swag, swag, swag)", "image": "https://images.genius.com/75621d1119a70043aadbe3fbf4387d88.640x640x1.jpg"}], "artist": "A$AP Rocky"}