{"songs": [{"title": "Topless (Remix)", "album": null, "year": null, "lyrics": "[Intro: T.I.]\nYeah, yeah, no roof\nLive life topless, can't nobody stop this\n\n[Verse 1: T.I.]\nAy, this the DR., in charge of saving artists out the ER\nBring them back to life, beats like CPR\nMade the westside worldwide, no PR\nGangsta rap god, I'm the end all, be all\nCalifornia love, from the Bloods to the C-Dogs\nThe Compton monsters make you wanna cut your MP off\nThe greatest in the game, haters should be ashamed\nFor not acknowledging the brain of the west coast king\nBrought Chronic to the scene, folded pills in the lean\nNow the game full of puppets, look at me: no strings\nAgain and again I've shown, you seen me\nPiss on niggas' egos, ruin they self esteem\nSky the limit, no roof, I can do what you dream\nDone it all 'fore you ever did a thing, knamean?\nTees and black jeans, no bling, just bang\nOfficially deranged, clinically insane\nLook Eazy, ain't a damn thing changed, I promise\nStill live like we did back with Straight Outta Compton\nTaught niggas how to have attitudes on some hood shit\nShowed them what to smoke when they were blazing that bullshit\nThat's why you smell the drug aroma when my record play\nNot a blemish on my image, decorated resume\nA legendary legacy\nAll that I was, you'll never be, fuck is y'all telling me?\nForever on top\nFace it, you'll never be better than the Doc, ask Pac\nAgain, I say it's never gon' stop\nFace it, you'll never be greater than the Doc, ask Pac\n\n[Hook: Dr. Dre]\nGuns blaze when I shine\nMake a wish quick, no star and I'm the shooting kind\nFront page all the time\nYou boys think sick, but I ain't got no roof on mine\n(I dream topless, I live topless)\nLike my girl is the game with her titties out\n(I dream topless, I live topless)\nSky is the limit, I'm paid to run the city now\n\n[Verse 2: Eminem]\nMy motto is live by the bottle, so why is my supply low?\nBring in a truckload with a high-low\nStay grounded, but I still reach for the sky, though\nGhetto idol, I think, but what do I know?\nShit, I know a lot more than I should\nThe hood stood by me just like I thought it would\nDon't act like I'm Hollywood when I probably could\nI don't polly, Muhammad Ali of rap, I don't lolly gag\nWest coast, the home of the body bag\nThe shotty, the mag, Los Angeles, where the party at?\nYou can catch me anywhere where there's Bacardi at\nYeah, Andre is back, so have a cardiac\nStarted back with the black, Raiders starter cap\nGangsta rap, we practically fucking started that\nEveryday with this game I'm getting smarter at\nSky's the limit so every time I get on the track\n\n[Hook]\nGuns blaze when I shine\nMake a wish quick, no star and I'm the shooting kind\nFront page all the time\nYou boys think sick, but I ain't got no roof on mine\n(I dream topless, I live topless)\nLike my girl is the game with her titties out\n(I dream topless, I live topless)\nSky is the limit, I'm paid to run the city now\n\n[Verse 3: Dr. Dre]\n1996, I left it all behind\n'Cause I ain't got no roof on mine\nI had to jump ship, I double back for my chips\nMy captain handle my shit\nI've never been the losing kind\nGrind, I feel it like it's year one\nI'm a fool anywhere near square one\nBut ain't no glass ceilings, I crash through 'em\nAin't no coal spills, I light a match to 'em\nAin't no haters right, just say congrats to him\nThis is Detox, it's rehab to 'em\nI bring it back years later, let it flow through 'em\nPutting that Chronic in their systems like I used to do 'em\nRespected so it's proven that's what I've been doing\nMoving the game like weight and everybody been using\nBitch, it ain't really nothing left to say\nYou're tuned in to Detox, I am Dr. Dre\n\n[Hook]\nGuns blaze when I shine\nMake a wish quick, no star and I'm the shooting kind\nFront page all the time\nYou boys think sick, but I ain't got no roof on mine\n(I dream topless, I live topless)\nLike my girl is the game with her titties out\n(I dream topless, I live topless)\nSky is the limit, I'm paid to run the city now\n\n[Verse 3: Nas]\nYour skin's your travelling bag of your existence\nYours is shabby and scab, while mine's glistenin'\nVivid on my skin, how many continents I visit then\nYou can journey with me to different places by listenin'\nShitting on them, your brother got it covered\nWe can slug it, knuckle it, however you want it, I love it\nA hustler's wit, the grit, the grind\nMy genetic code make up, murderer by design\nOn Mayan calendar time, when night meets day\nI'm in the light grey Bugatti like a high speed chase\nAdrenaline like jogger, the jumping rope in place\nMuhammed Ali hobbies, no Pilates, try'na keep the ocean by me\nHit a rich man's wife, see what these hoes can buy me\nLooking forward, but it's nice to see the road behind me\nHotel's a seven star, Baguette's glowing\nKeep your lid, yet dawg, the private jet Boeing, topless\n\n[Hook]", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}