{"songs": [{"title": "In The Mornin’", "album": null, "year": null, "lyrics": "[Intro]\nNaw, I'm just saying like, I'm just trynna see you, you know what I'm saying? What you was doing after this\nNaw, I stay not too far from here, like right down the street-yea like right there\n\n[Verse 1]\nBaby you summertime fine\nI'll let you get on top, I'll be the underline, I'm\nTryna get beside you like the number 9, dime\nYou fine as hell\nI guess I met you for a reason only time could tell, but well\nI'm wondering what type of shit you on\nDo you like the finer things or are you a simple woman?\nWould you drink with a nigga, do you smoke weed?\nDone be ashamed, it ain't no thang, I used to blow trees\nGetting lifted\nI quit the shit, I might get high with you\nIt's only fitting cause I'm looking super fly with you\nA flower you, a powerful, you do something to me\nCause girl I caught the vibes\nLike you threw something to me-so I threw em back\nNow all my niggas hollering \"who is that?\nOh boy she bad nigga, what you bout to do with that?\"\nI'm finna take you home sip a little Patron now we zoning\nBaby you so fine\n\n[Hook]\nAy can I hit it in the morning?\nCan I hit it in the morning?\nThe sun rising while you moaning\n\n[Verse 2]\nYea, yea now are you shy or is you freaky lady?\nAre you shallow cause if not I'll take it deeper baby\nTell me what turns you on\nYou like the slow songs?\nYou like some candles lite?\nThat ain't really my style\nBut see I planned a trip\nAnd yea we both coming\nJust tell me how you want it\nI give it to you like I owe you something\nWhen I'm on it, on it like my job\nI'm hoping I confess\nThis life gets hard I can take away your stress if you let me\nYou knew just what this was when you met me\nSo let your guard down girl\nI'll take your bra down girl and undress ya\nReal slow yea I'll make you feel special\nI can feel your heart beating fast\nFrom the passion, ya hands reaching for the sheets to grab\nAnd now ya leaking, freaking ain't no speaking but you moaning!\nYa so fine I got to give it to you\n\n[Hook]\nAy can I hit it in the morning?\nCan I hit it in the morning?\nThe sun rising while you moaning\n\n[Verse 3]\nI got a slight obsession-of watch your face while ya moaning\nDo you like caressing or do you like aggression?\nYou the fighting, wrestling, biting pillows\nDo you want it in the dark or while the lights is still on?\nI'm fantasizing in my mind bout how your body feel\nWhile we sweating you dripping wet from what your body spill\nNow if your nervous and hesitant just let it go\nSee baby lately seems my life been hell and heaven knows\nThat you looking like an angel-sent from the heavens, God bless your every angle\nGot a nigga tangle in your spider web\nI'm doing shit I never might of did\nAnd I ain't stopping baby even if the light is red\nYour body's right as rain\nSo where the hydroplane\nThat ass is fat baby ain't no way to hide your frame\nThank God I found you\nJust holla when you want it\nCause girl your so thorough", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}