{"songs": [{"title": "By My Side", "album": "The Last Kiss", "year": "2009-04-07", "lyrics": "[Intro: Ne-Yo & Jadakiss]\nRight by my side\nHA-HAH! Uh-huh (Yeah)\nE. Hudson, Jadakiss (Hey), Ne-Yo\nI think it's me and you tonight ma, lets go (Uh, uh-huh)\nYou see every good woman needs a thug\nYou see every good woman needs a thug\n\n[Verse One: Jadakiss]\nGo baby, you so wavy\nAnd I ain't never felt this way 'bout no lady\nConsiderin goin half with you on yo' baby\nSomethin about you, makin me go crazy\nKnow if I ain't soured up, I'm so hazy\nMe and you on the same page, so amazin\nNeed your love girl, so many ways\nAnd you could only hold in out for so many days\nAnd, got enough points to score but you shavin\nHell yeah I'm anxious, but you cravin\nTime keep flyin, I'mma keep tryin\nBottom line, I need your L-O-V-I-N\nCome on!!!\n\n[Hook: Ne-Yo]\nYeah I made no mistake, right by my side\nLil' mama that's your place, keep holdin me down (Hey)\nAnd you can help me spend this cake, right by my side\nRide with me, all I need is you right by my side\n\n[Verse Two: Jadakiss]\nHe such a small fella, to recognize the Mason Martin Margiela\nWhat could I tell her\nMan I swear you got to see her to believe her\nThen maybe you could understand why I need her\nBesides her bein a diva she wasn't bothered by the chiba\nZodiac sign was a libra\nDefinetly a keeper, I just wanna put her in a sleeper then fall out underneath her\nWake up, take a shower, then get deeper\nJuice up get some power and then freak her\nAfter the feedback then I could G Mack\nBut it's somethin about her love makin me need that, come on!\n\n[Hook: Ne-Yo]\nYeah I made no mistake, right by my side\nLil' mama that's your place, keep holdin me down\nAnd you can help me spend this cake, right by my side\nRide with me, all I need is you right by my side\n\n[Bridge: Ne-Yo]\nWhen the drama comes my way (Way)\nLong as I got you, girl it's nothing\nBaby, it's nothing - I'm good\nWhen these streets, girl, come what may (what may)\nShorty, we do what we do, so it's nothing\nBaby girl, your love is something I need\n\n[Verse Three: Jadakiss]\nYo, they say every good woman needs a thug\nI totally agree, that's why I need your love (yep)\nAnd I can't help it, if I'm selfish\nCause I need your love and nobody else's\nStartin to taste it, pardon the bracelet (pardon)\nChance of a lifetime and I can't waste it\nIf being beautiful was a test, should've aced it\nHer skin is flawless, her hair is waist length\nHi I'm Jason, ma I'm patient-ly waitin for us to have relations\nKissin me is just history in the makin\nSqueezin and huggin I need your lovin, come on!!!\n\n[Hook: Ne-Yo]\nYeah I made no mistake, right by my side\nLil' mama that's your place, keep holdin me down\nAnd you can help me spend this cake, right by my side\nRide with me, all I need is you right by my side\n\n[Outro: Jadakiss]\nBounce! Bounce! I think we got one what you think?\nBounce!", "image": "https://images.genius.com/75c2f3412c499c95b6634fa53869c680.500x500x1.jpg"}], "artist": "Jadakiss"}