{"songs": [{"title": "Oh You Didn’t Know", "album": "The Gates Mixed Plate", "year": "2010-07-27", "lyrics": "[Intro: Tech N9ne]\nThe clubs used to say nay\nBack in the day I had to pay but now everybody say hey!\nYou lookin good bro, you makin good dough\nI be like yo you didn't know? they say\n\n[Hook]\nOh\nAnd 3 more didn't know saying\nOh oh oh didn't now the know now they know they say\nOh, and when we step in the club the say\nOh oh oh there they go there go they like oh\nNow 3 hoes want to go like\nOh oh oh didn't know now they know they say\nOh your girl be like oh oh oh\nNow I got it for the night screaming oh\n\n[Verse 1: Tech N9ne]\nThey didn't know I sell out shows in Amsterdam\nAnd in Switzerland\nTecca Ninna spits for grands\nShe really dont know she about to ditch her man\nAnd give her pants to me cuz this her jam\nDamn\nTecca Ninas everywhere keep it necessary to\nSteer very clear\nIf he dare to stare and glare that's very fair\nBe drinking, Be merry\nWhere the ladies with the derrière?\nMore black women popping up at my shows\nLike Tyler Perry there\nOh\nAnd they didn't know I won an MTV award?\nNew York yelling for me like they've seen me before\nThey know that underground clown come so sick and dark\nBut they didn't know they'd see the N9ne on 106 & Park\nI'm kixin it and the foes can not stop\nNo hoes can cock block it\nMy clothes in Hot Topic\nThey froze when I pop it\nI glow in the MO\nThrowing the dough\nCause I got that paper\nOh you didn't know?\nThey say\n\n[Hook]\n\n[Verse 2: Irv Da Phenom]\nHey yo we kixin it the Friday night\nEven though it's a Thursday\nEyes on us when we stepping out on the curb free\nChickens want the business giggling\nActing flirty\nLittle momma swallowed all of her vodka\nShe still thirsty\nProlly cause she’s all the way in midst of forbidden and I head straight to the VIPer\nOr maybe is you wet lil’ momma diggin’ on my feather\nGot her dancing like a stripper\nWe super cold head to toe\nWe sharp as a machete\nWe the hottest show in KCMO\nThe new Malcom & Eddie yeah\nIt's me and Big Yates\nHe know my spits ape\nShit so sick he got me spitting on The Mixed Plate\nLike a disgruntled employee that just quit Gates\nYou read the front of the fitted homie and it's\nKC\nAsk who the president and they are going to say\nPhe\nNom\nAnd now I'm rocking with the king (TECH N9NE!)\nSo every time we hit the clubs like a movie scene\nFilling your women up with them cups of that Kansas City Tea\nPHENOM!\n\n[Hook]\n\n[Verse 2: The Popper]\nThat's the noise you make you lady do\nFresh hypemen had me on the turn tables in 82'\nSleeping with women\nVodka sipping\nWhile he was eating baby food\nMurdering raps and spitting facts\nWas something I was made to do\nSee I raised a few eyebrows when I started up\nThe Veteran Click gave me worldwide we was hard to touch\nYa'll can start the fuss\nAnd I'm going to close you down\nPopping you dick licker\nOnly when there is hoes around\nOh\nThat's what your girl be like\nKiller city will show what that world be like\nMy world be tight\nBut my flows be sicker\nBehind the counter and cut you\nAt that Paul's Liquor\nI'm a show me nigga\nI rep for the land\nMarks swear that I got kool aid pumping through your man's heart\nI've been marked\nAnd respect the niggas who've been whacked\nFuck with Tech and Irv at the club and spin racks\n\n[Hook]", "image": "https://images.genius.com/7efd1fa33fbd953a08bc1d44fae9f6a7.600x600x1.jpg"}], "artist": "Tech N9ne"}