{"songs": [{"title": "Tha Past", "album": "Against the Grain", "year": null, "lyrics": "Keep it hood...\n\n[Hook]\nAlways seems to be, something in the past, won't let me go\nAlways seems to be, something in the past, won't let me live\n\n[Verse 1]\nTwo niggas came together\nTrying to get their game together\nSeparate and change directions\nSeparating chain selections\nNow they in separate sections\nAlways used to ride together\nSlide and get high together\nUsed to always make it happen\nOne was stuntin, one was clappin\nNow they both feeling trapped and\nUsed to bang Eric Clapton\nEveryday in every way\nSmoking each and everyday\nDumped to Curtis Mayfield on a load of Layla Hathaway\nThis is what I have to say\nI remember...you don't stay down with me, but fuck it\nWhatever's gonna be, just let it be, don't just say nothing\nSoon as I do something for me to get a little further\nEverybody wanna trip like I didn't deserve it\nNow when I see niggas like two or three years later\nThey still ain't got over the fact that I'm making some paper\nStop tripping boy what's done ain't no changing up\nGlocks spitting boy it's done ain't no changing up\nAll over the past\n\n[Hook]\n\n[Verse 2]\nNigga, let the past go\nStop tripping nigga, before a nigga have to start chipping niggas\nBefore a nigga have to get to chipping niggas\nGet to busting niggas, like fuck them niggas\nIn the middle of the warzone it happens\nAll the games is over, full metal jackets\nI ain't tripping y'all, all about the cash\nThat's all a nigga 'bout, from the inside to out\nI run amok nigga, don't give a fuck nigga\nSuge and Kurupt nigga, don't give a fuck nigga\nI roll the streets nigga, cock back the heat nigga\nY'all niggas weak nigga, nickels spreading leak niggas\nYou know about Gotti, run up on anyone\nYou helped create me nigga, stop trying to quake me nigga\nI'm 'bout to toss fire, since I ain't a dog\nReborn to rebirth of a pure hog\nFuck the past nigga!\n\n[Hook]\n\n[Over Hook]\nRight after that\nSomething about the past nigga\nYou know...shit...\nKnow what I'm saying\nIt's like they told me, it's natural\nKnow what I mean? roll with niggas for so long\nYou know, but when I go and do something for myself\nYou know, shit...I used to smash for y'all\nSomething about that past man\nNiggas don't know how to let shit go, just roll\nKnow what I mean?\nYou gotta love me for who I am\nFuck the past (my ups and down)\nIf it's not positive nigga, fuck the past\nKnow what I'm saying, nigga (my rights and my wrongs)\nMark Sparks these niggas is bitches\nSup Dave\nOh man, tell these niggas man\nAlways seems to be, in the past nigga, won't let me live, let me live\nLet me live nigga, let me live nigga, let me live nigga", "image": "https://images.genius.com/901ee868384c5cb1f3a23f4bff250845.500x500x1.jpg"}], "artist": "Kurupt"}