{"songs": [{"title": "Thumbalina", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro]\nStraight up, I just wanna say one time after two years at this mothafuckin' crib: fuck all y'all mothafuckers, living all over this mothafucker tryin' to kick me out. That goes for you, Mrs Watson witcha little ass kids always fuckin' crying. You got your little chihuahua, fuck you and your motherfuckin' mama bitch, I'm out here!\nSuck my motherfuckin' dick! Yeah. REMember Music. Old Jewish. Go ahead. This is my [?]\n\n[Pre-Verse]\nYeah, yeah, yeah\nThat's how it's going down, one time [?]\nOkay, okay, yeah\n\n[Verse 1]\n(Oh my Lord) He's on drugs again\nMy neighbor's yellin', I don't give a fuck again\nAnd I swear to God if the cops come again\nI'ma open up this door, get to rumblin'\nStart bussin', bussin', bussin', bussin'\nMy dick, your mouth, no discussion, yeah\nIt's all happenin', I must be imaginin'\nTake a hit, time travelin'\n\n[Pre-Chorus]\nTurn up the mothafuckin' volume\nYeah, yeah, yeah ([?] bust like a condom)\nAnd you a freak, why you hidin' in a costume?\n([?] look up)\n\n[Chorus 1]\nLet me see them nipples, baby\nOu ([?])\nDon't give it all up, just a little, baby\nOu ([?])\nI'm just tryna free your mind\n([?] free your mind)\n'Cause all you see is dollar signs\n(Blinded by the streets)\n\n[Verse 2]\nYeah\nLine crosser, real life flyin' saucer\nNothin' straight 'bout her but her posture\nYoung prodi-gy, I'ma eat lobster\nPull Spanish bitches but I speak nada\nAnd she got a need to roll the weed all up\nYou ain't got a chance when it's me on ya (Shit)\nI'm a mothafuckin' legend, girl\n[?] pussy killed: bitches out in Edinburgh\n\n[Pre-Chorus]\nTurn up the mothafuckin' volume\n([?] bust like a condom)\nAnd you a freak, why you hidin' in a costume?\n([?] look up)\n\n[Chorus 2]\nLeave that pussy crippled, baby\nOu ([?])\nLet me slide right down the middle, baby\nOu, yeah, where the fuck my Thumbalina?\nHas anybody seen her\nFaces?\nShe blinded by the streets\n\n[Outro]\nOu, 'bout to start my own motherfuckin' committee and it’s gonna be me and Josh and it’s gonna be motherfuckin' bitches with their motherfuckin' ass and titties, I don’t give a fuck… shit", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}