{"songs": [{"title": "I’ll Be That", "album": "Ghostdini: Wizard of Poetry in Emerald City", "year": "2009-09-29", "lyrics": "[Hook: Adrienne Bailon]\nI could be your friend, I could be your tease\nI can be a freak, I can be a P.Y.T\nIf you ask, I'll be that\nI could be your girl, I could be your wife\nI complete your side, I could be watching me\nIf you ask, I'll be that\nI'll be your homey, lover, friend, I'll be your everything\nIf you ask, I'll be that\nSay you want me, I'll come running\nI can be your baby, just you ask, I'll be that\n\n[Ghostface Killah]\nMy girl, my love, come through, rescue me\nThrow me on the bed, no clothes, wrestle me\nAfter smashing that, then will you cook for me\nPromise I won't hit you, you don't have to be shook of me\nWashing my boxers, shirts folded nice and creased\nPlus when we argue, she will never pull a beast\nClap for my baby, award winning, best nookie\nI been in the whole wide world, that's why I stay spending\n\n[Hook]\n\n[Ghostface Killah]\nI want you in a scarf, boy shorts around the house\nWife beater, undercover, sitting on the couch\nIsley's is playing, lights dim, vanilla candles is melting\nIt's a long time, don't let no one else in\nFresh out the tub, sweetness and peaches\nBody work splash around your neck, the kid admire all your features\nNiggas be hollering; peace ma, what up boo?\nYou suck your teeth and keep it moving with the screw, yes\n\n[Hook]\n\n[Ghostface Killah]\nHappy birthday, red roses, big cakes\nDonna Karen slippers, got your birthday gift by the lake\nBig boats, thick ropes, ostrich purses\nSnakeskin boots, Jared Jewelers, the mink cost mad loot\nSki trips, resorts, close your eyes, baby, make a wish\nBlow your cake out, earrings is snowflaked out\nWill you marry me? Will you carry me?\nThrough rain, hail, sleet and snow\nDon't say no, you'll embarass me\n\n[Hook]\n\n[Outro: Adrienne Bailon]\nI'll be that...\nBaby...\nYeah, yeah, yeah...\nI'll be that, I'll be that...", "image": "https://images.genius.com/ea54fa933d61e534fbf14d9509cc7146.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}