{"songs": [{"title": "Letter to the President (OG)", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nMy letter to the President\nTell me what to do, these niggas actin' up\nIn the hood Send mo' troops\nDear President\nTell me what to do, these niggas actin' up\nIn the hood Send mo' troops\n\n[Verse 1: 2Pac]\nWhy should I lie, when I can dramatize?\nNiggas fell victim to my lyrics, now traumatized\nSimply by spittin' I’ve been blessed given riches, enemies suspicious\n'Cause I’m seldom in the company of bitches\nPlus the concepts I depict, so visual, that you can kiss\nEach and every trick or bitch, inside the shit I kick\nMy heaviest verse’ll move a mountain\nCasualties in mass amounts, brothers keep countin'\nFuck the friendships, I ride alone\nDestination Death Row, finally found a home\nPlus all my homies wanna die, call it euthanasia\nDear Lord, look how sick this ghetto made us, sincerely\nYours I’m a thug, the product of a broken home\nEverybody’s doped up, nigga what you smokin' on?\nFigure if we high they can train us\nBut then America fucked up and blamed us\nI guess it’s 'cause we black that we targets\nMy only fear is God, I spit that hard shit\nIn case you don’t know, I let my pump go\nGet ride for Mutulu like I ride for Geronimo\nDown to die, for everything I represent\nMeant every word, in my letter to the President\n\n[Hook: 2Pac]\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, send mo’ troops\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, send mo’ troops\n\n[Verse 2: E.D.I. Amin & Kastro]\nOh you's a baller in the White House\nI hope you comfortable 'cause yo' I spend my nights out, with the lights out\nUnder the safety of darkness\nAmongst the crazed and the heartless\nAnd young soul bros\nAnd a Mr. cobra contest\nWith all these problems my world\nSpendin' this drama on earl\nMy President never seen senate with pleasure like\nWhatever momma tell me she hit it\nNo not the lottery shit\nMeanin' she do what I ain't do\nBreak her off before I did\nSlip deep into the mind of a loner\nMy foes say fuck him, he’s a goner\nBut it ain't no shorts up on these corners\nOn a mission\nListen, let’s ease my guard with precision\nPersonally my decision\nWhen I realized this ain't livin'\nHow you really ain't know\nHow this ghetto life go\nFor me and all my homies, when our enemies bone\nYou got the C.I.A\nAnd we got our A.K\nFor protection, in our section\nIn the felony days\nTo the President, (Ha ha)\n\n[Verse 3: Mussolini]\n( Check it )\nMr. President I represent the ghetto\nTell your wife hello, I got to go\nI be brief with this pedigree\nNiggas is locked and said blocks on Penitentiary life\nMore niggas in jail than baptized\nFor centuries minority families how you stay lackin'\nHomeless shelters over-crowded and you still taxin'\nHomies dyin' out who got the clout, not me\nYou get more time for five grams, than a half a key\nBlack poppin' rocks, and whites on the potty rhyme\nAnd why don’t test mine, rather die than let you see me cry\nAcross the border ask the lord to put somebody in your seat that cares\nHow can we stay in this world we supposed to share\nDemocrats, Republicans scum me to the concrete\nNo education inflation's covered by white sheets\nTry to ball legally conspiracy surrounds me\nSo I’m a outlaw from now until eternity\nForever Mussolini\n\n[Hook: 2Pac]\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, send mo' troops\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, send mo' troops\nDear Mr. President, tell me what to do\nThese niggas, actin' up\n\n[Verse 4: 2Pac]\nHeavenly Father may I holla at you briefly\nI wanna meet the President, but will he meet me?\nHe’s scared to look inside the eyes of a Thug Nigga\nWe tired of bein' scapegoats for this capitalistic drug dealin'\nHow hypocritical is Liberty?\nThat blind bitch ain’t never did shit for me\nMy history, full of casket and scars\nMy own black nation at war, whole family behind bars\nAnd they wonder why we scarred, thirteen lookin' hard\nSister had a baby as an adolescent, where was God?\nSomewhere in the middle of my mind\nIs a nigga on the tightrope, screamin' let him die\nCan’t lie I’m a thug, drownin' in my own blood\nLookin for the reason that my momma’s strung out on drugs\nDown to die, for everything I represent\nMeant every word, in my letter to the President\n\n[Verse 5: Mussolini]\nBlacks is broke, think it’s a joke that we livin' low?\nY’all sniffin' blow and postin' what they hittin' fo’?\nTell the secretary it’s necessary we get paid\nLook what you made, little kids gettin' sprayed\nDay after day, and night after night\nBattles and wars to the daylight\nWe might change and rearrange if you do somethin'\n'Til then we gonna keep it comin', Mr. President\nAnd I meant every word in my letter to the President\n\n[Ad-libs: 2Pac]\nHehe\nWord motherfuckin' life\nFuck this nigga think?\nCuttin' taxes, takin' off welfare\nWe 'sposed to just sit here, go broke and die, starvin'?\nMotherfuckers crazier than a motherfuckin' scout\nNigga this Thug Life, Westside Outlaw Immortalz nigga\nWe fin' to hustle 'til we come up\n\n[Hook: 2Pac]\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, (send mo’ troops)\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, (send mo’ troops)\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, (send mo’ troops)\nDear Mr. President, tell me what to do\nThese niggas actin' up in the hood, (send mo’ troops)\n\n[Overlapped  Hook: 2Pac]\n(Dear Mr. President) niggas actin' up in the hood, (send mo’ troops)\nDear Mr. President is here\nNiggas actin' up in the hood, (send mo’ troops)\nDear Mr. President\nNiggas actin' up in the hood, (send mo’ troops)\nDear Mr. President\nThese niggas actin' up in the hood, (send mo’ troops)\nDear Mr. President\nNiggas actin' up in the hood, (send mo’ troops)\nDear Mr. President\nThese niggas actin' up in the hood, (send mo’ troops).. Outlaw\nThese niggas actin' up in the hood, (send mo’ troops).. Outlaw!!\nNiggas actin' up in the hood, (send mo’ troops).. Outlaw!!\nNiggas actin' up in the hood, (send mo’ troops).. Outlaw!!\nNiggas actin' up in the hood, (send mo’ troops).. Outlaw\nNiggas actin' up in the hood, send mo’ troops\n\n[Collision: 2Pac]\nDear Mr. Clinton… it's gettin' harder and harder for a motherfucker to make a dollar in these here streets\nI mean shit, I hear you screamin' peace\nBut we can't find peace\n'Til my little niggas on these streets get a piece\nI know you fear me 'cause you too near me not to hear me\nSo why don't you help a nigga out?\nSayin' you cuttin' welfare\nThat got us niggas on the street, thinkin' who in the hell care?\nShit, y'all want us to put down our Glocks and our rocks\nBut y'all ain't ready to give us no motherfuckin' dollars\nWhat happened to our 40 acres and a mule fool?\nWe ain't stupid, think you got us lookin' to lose\nTryin' to turn all us young niggas into troops\nYou want us to fight your war, what the fuck I'm fightin' for?\nShit, I ain't got no love here\nI ain't had a check all year, taxin' all the blacks\nPolice beatin' me in the streets… fuck peace!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}