{"songs": [{"title": "This Is Me/Goodbye", "album": "Everready [The Religion]", "year": "2006-11-07", "lyrics": "[Intro: Tech N9ne]\nHahahaha, in the world of BET\nI'm looked at as too rock'n'roll\nIn the world of MTV\nMy name is too gangsta huh, hahaha\nMan, Strange Music we got this baby\nThis year we got this one baby\nRed hair, red everything\nIt's Tech N9ne baby like it or not\n\n[Verse 1: Tech N9ne]\nNever been a harder rhymer in my region or globally\nThat's holdin' me, I'm totally hard and bossed up\nWhy you think that the majority of the rap musical authority\nSword me and barred and crossed up\n'Cause they don't wanna let the crazy kid in\nThen spit his hymns, begin a grim religion\nOf rhyme, forbidden my isms are hidden\nMy mind to written then spittin' the kid in\nThe N9ne is playin' you, slayin' you, sprayin' you\nPermanently delayin' you, swayin' through, it's the gay in you\nThat's hatin' who, something's that hella beyond us\n(I love Kanye, his shit is bombay, but I'm rough)\nAnd you can see it in my retina, that I won't be lettin' ya\nThreatening us better respect Tech the messenger\nToo dope on ‘em for this to be history, listen it’s a mystery\nWhy they spittin’ and dissin’ me\n\n[Hook: Tech N9ne and (Krizz Kaliko)]\nThis is me (This is me)\nI'm a king, I'm a clown, I'm a G (I'm a G)\nI believe what I want, got you singin' my song\nBut you're seein' me wrong, so what's the matter with me?\nThis is the belief (The belief)\nThe religion has arisen from the deep (From the deep)\nDarkest prison if you listen you will see (You will see)\nIf collision's your decision you will reap\nWhat you sow, so forget what you know this is me\n\n[Verse 2: Tech N9ne]\nThis is Tech bruh, for years I've been the next to\nCollect a plethora of checks let's get extra\nIs what I set ta Travis let's go select the\nBaddest rappers infect the planet leave 'em in ecsta-\nSy, I'm a vet the powers don't really wanna let the best\nCome and wreck your sets and test your sector\nInstead of rawness like Inspecta Deck, the\nEldest rather set they specs on Mason Betha\nSlept on my records If you knew my music's Hannibal Lector\nWhat the hell you callin' for Funkmaster Flex for?\nDon't pester me I won't sweat you be on a quest to\nInvestigate your techma respect the\nChakra tease in hop to these\nHot degrees me and Mr. O Apostrophe\nNever listen to these pop pussies 'cause they suck!\n(I love 50 Cent, he gritty when he vent, but I'm rough)\nAnd you can see it in my demeanor\nThe Tecca Nina will blast arenas, the grass is greener\nMade it ma, top of the world\nKiss me, miss me (This is, this is me)\nCan't you see?\n\n[Hook: Tech N9ne and (Krizz Kaliko)]\nThis is me (This is me)\nI'm a king, I'm a clown, I'm a G (I'm a G)\nI believe what I want, got you singin' my song\nBut you're seein' me wrong, so what's the matter with me?\nThis is the belief (The belief)\nThe religion has arisen from the deep (From the deep)\nDarkest prison if you listen you will see (You will see)\nIf collision's your decision you will reap\nWhat you sow, so forget what you know this is me\n\n[Verse 3: Tech N9ne]\nThe industry treat me like a ride on the short bus\nThat's why I'm tellin' they youngsters when your retourt cuss\nAnd make a fort fuss, 'cause you went out on Sam Goody\nOn F.Y.E. with their money and you support us\nStrangers, Shadys, Psychopaths and Juggalos\nLosers, Shootas, College women and gutta hoes\nRock it for precious dough, drop it, just let it flow\nCop it don't knock it you block us stop at the record store\nThis is Aaron Yates, this Alyia and Reign\nThis is for little Donnie this is for all Lacoya's pain\nThis is for the sickness of Maudie Sue\nThis is for all the love of Sara, Suzy, Ira Mae and Izeta Lou\nThis is for Ike and Ricky, Rufus, Rhonda, Barbara and Marla really\nThis is for B'zle and I know that rest of my family is with me\nThis is my friends, this is the end, this is a G\nThis is life, this is wrong, this is right, this is me\n\n[Hook: Tech N9ne and (Krizz Kaliko)]\nThis is me (This is me)\nI'm a king, I'm a clown, I'm a G (I'm a G)\nI believe what I want, got you singin' my song\nBut you're seein' me wrong, so what's the matter with me?\nThis is the belief (The belief)\nThe religion has arisen from the deep (From the deep)\nDarkest prison if you listen you will see (You will see)\nIf collision's your decision you will reap\nWhat you sow, so forget what you know this is me\nThis is me (This is me)\nI'm a king, I'm a clown, I'm a G (I'm a G)\nI believe what I want, got you singin' my song\nBut you're seein' me wrong, so what's the matter with me?\nThis is the belief (The belief)\nThe religion has arisen from the deep (From the deep)\nDarkest prison if you listen you will see (You will see)\nIf collision's your decision you will reap\nWhat you sow, so forget what you know this is me\n\nGoodbye", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}