{"songs": [{"title": "Money Trees (OG)", "album": null, "year": "2018-10-15", "lyrics": "[Produced by DJ Dahi]\n\n[Verse 1: Kendrick Lamar]\nUh, me and my niggas tryna get it, ya bish (ya bish)\nHit the house lick: tell me, is you wit' it, ya bish? (ya bish)\nHome invasion was persuasive (was persuasive)\nFrom nine to five I know it’s vacant, ya bish (ya bish)\nDreams of livin' life like rappers do (like rappers do)\nBack when condom wrappers wasn't cool (they wasn’t cool)\nI fucked Sherane and went to tell my bros (tell my bros)\nThen Usher Raymond \"Let It Burn\" came on (\"Let Burn\" came on)\nHot sauce all in our Top Ramen, ya bish (ya bish)\nPark the car, then we start rhymin', ya bish (ya bish)\nThe only thing we had to free our mind (free our mind)\nThen freeze that verse when we see dollar signs (see dollar signs)\nYou lookin' like a easy come-up, ya bish (ya bish)\nA silver spoon I know you come from, ya bish (ya bish)\nAnd that's a lifestyle that we never knew (we never knew)\nGo at a reverend for the revenue\n\n[Hook: Kendrick Lamar]\nIt go Halle Berry or hallelujah\nPick your poison, tell me what you doin'\nEverybody gon' respect the shooter\nBut the one in front of the gun lives forever\n(The one in front of the gun, forever)\nAnd I been hustlin' all day\nThis-a-way, that-a-way\nThrough canals and alleyways, just to say\nMoney trees is the perfect place for shade\nAnd that's just how I feel, nah, nah\nA dollar might just fuck your main bitch\nThat’s just how I feel, nah\nA dollar might say fuck them niggas that you came with\nThat’s just how I feel, nah, nah\nA dollar might just make that lane switch\nThat's just how I feel, nah\nA dollar might turn to a million and we all rich\nThat’s just how I feel\n\n[Verse 2: Kendrick Lamar]\nDreams of livin' life like rappers do (like rappers do)\nBump that new E-40 after school (way after school)\nYou know, “Big Ballin' With My Homies” (my homies)\nEarl Stevens had us thinkin' rational (thinkin’ rational)\nBack to reality, we poor, ya bish (ya bish)\nAnother casualty at war, ya bish (ya bish)\nTwo bullets in my Uncle Tony head (my Tony head)\nHe said one day I'll be on tour, ya bish (ya bish)\nThat Louis Burger never be the same (won't be the same)\nA Louis belt will never ease that pain (won't ease that pain)\nBut I'ma purchase when that day is jerkin' (that day is jerkin')\nPull off at Church's, with Pirellis skirtin' (Pirellis skirtin')\nGang signs out the window, ya bish (ya bish)\nHopin' all of 'em offend you, ya bish (ya bish)\nThey say your hood is a pot of gold (a pot of gold)\nAnd we gon' crash it when nobody's home\n\n[Hook: Kendrick Lamar]\nIt go Halle Berry or hallelujah\nPick your poison, tell me what you doin'\nEverybody gon' respect the shooter\nBut the one in front of the gun lives forever\n(The one in front of the gun, forever)\nAnd I been hustlin' all day\nThis-a-way, that-a-way\nThrough canals and alleyways, just to say\nMoney trees is the perfect place for shade\nAnd that's just how I feel, nah, nah\nA dollar might just fuck your main bitch\nThat's just how I feel, nah\nA dollar might say fuck them niggas that you came with\nThat's just how I feel, nah, nah\nA dollar might just make that lane switch\nThat's just how I feel, nah\nA dollar might turn to a million and we all rich\nThat's just how I feel\n\n[Bridge: Anna Wise]\nBe the last one out to get this dough? No way!\nLove one of you bucket-headed hoes? No way!\nHit the streets, then we break the code? No way!\nHit the brakes when they on patrol? No way!\nBe the last one out to get this dough? No way!\nLove one of you bucket-headed hoes? No way!\nHit the streets, then we break the code? No way!\nHit the brakes when they on patrol? No way!\n\n[Verse 3: Kendrick Lamar]\nUh, What's on a young niggas mind, ya bish? (ya bish)\nBenjamins and killin' time ya bish (ya bish)\nThe quickest way to make the quickest pay (the quickest pay)\nEven if it's doing crime, ya bish (ya bish)\nDreams of livin' life like rappers do (like rappers do)\nBut for now I guess this sack will do (this sack will do)\nThey told 'em money the root of all evil (that's all evil)\nHe hugged the devil the moment he seen 'em\n\n[Hook: Kendrick Lamar]\nIt go Halle Berry or hallelujah\nPick your poison, tell me what you doin'\nEverybody gon' respect the shooter\nBut the one in front of the gun lives forever\n(The one in front of the gun, forever)\nAnd I been hustlin' all day\nThis-a-way, that-a-way\nThrough canals and alleyways, just to say\nMoney trees is the perfect place for shade\nAnd that's just how I feel", "image": "https://images.genius.com/f3db37bb8953d6e671d8bb532da2e855.220x220x1.jpg"}], "artist": "Kendrick Lamar"}