{"songs": [{"title": "Fuckin’ With D", "album": "Live At Woodstock", "year": null, "lyrics": "There's a lot of motherfuckers out here that dont give a fuck!\n\nAyo! How many y'all motherfuckers don't give a fuck?\nHow many y'all really don't give a fuck?\nC'mon!\n\nGrrrrrrrrrrrrrrr...........\nWhat's on y'all niggas minds (what?)\nFuckin' wit' me, y'all know somebody has\nTold you about fuckin' wit' D, stuck in\nA tree is what you will be, like a cat\nAnd I'm the dog at the bottom, lookin' up\n(Man: yo, what's that?)\nYour worst nightmare is I take it right there\nYou got niggas comin' where they at, right\n(Man: where?)\nI make 'em like air (yeah!), floatin' away, wouldn't\nTell what he was thinkin' so I opened a way, (c'mon!)\nWent from broken away, you know he hurt before he died\nMakes you wonder if he lost his shirt before he died, only\nTwo knew the answer and one of us is dead, so anyone who\nSeeks the truth can get it straight to head!\nThan you and him can discuss what I did, yeah it was\nWrong dog but I slid, i'll repent one day, just not right\nNow, you hear my shit all on the street i'm kinda hot\nRight now!\n\nCome on!\n\nI DON'T GIVE A FUCK ABOUT\n... NIGGAZ CAUSE ...\nAIN'T KILLIN' NUTTIN'!!!\n(Man: What?)\n\nI ... GIVE ... FUCK ...out\n... NIGG... CAUSE ...\n(Man: AIN'T KILLIN' NUTTIN'!!!)\n\nI wanna break bread wit' da' katz\nThat I starve with, wanna hit the malls with the same dogz\n(I rob wit')\nWanna be able to laugh with the niggas\nThat I cried with, when it's over be like\nThese is tha niggas that\n(I died wit')\nWhat do you do when you find out in the hall there's a rat, what do you do when\nYou find out that your dog is a cat\nShit, on niggas back, can't hold but two so while you gettin' more gatz i'm puttin wholes in you, snubnose will do, break 'em off real proppa'\nI ain't gonna stoppa', cocka, unlocka, let 'em go, give it to his man just to let him know\nAll things considered it was real for' a minute, (what?)\nGot what was yourz and tried to steal sometin' wit it, now\n(Feel sometin' hit it)\nYour chest that is, the best that is, is probaly the best that slid, yo stress that kid!\n\nI DON'T GIVE A FUCK ABOUT\nCH'YALL NIGGAZ CAUSE Y'ALL\nAIN'T KILLIN' NUTTIN'!!!\n\nWhat?\nI DON'T GIVE A FUCK ABOUT\nCH'YALL NIGGAZ CAUSE Y'ALL\nAIN'T KILLIN' NUTTIN'!!!\nWhat?", "image": "https://images.genius.com/51a03343cda7f249ce0b54b8d422e204.500x500x1.jpg"}], "artist": "DMX"}