{"songs": [{"title": "Difficult", "album": "Straight from the Lab Part 2", "year": "2010-12-31", "lyrics": "[Verse 1: Eminem]\nThey ask me am I okay, they ask me if I'm happy\nAre they asking me that because of the shit that's been thrown at me?\nOr am I just a little snappy and they genuinely care?\nDudey, most of my life it's just been me and you there\nAnd I continuously stare at pictures of you\nI never got to say I love you as much as I wanted to, but I do\nYeah, I say it now when you can't hear me\nWhat the fuck good does that do me now?\nBut somehow I know you're near me in presence\nOh, I went and dropped some presents off for Easter\nTo them two little beautiful boys of yours to try to ease their\nMinds a little, and dog, you'll never believe this\nBut Sharonda actually talks to me now—Jesus!\nAnd everyone else is just tryin' to pick up the pieces\nMan, how could you touch so many fuckin' lives and just leave us?\nThey say grievance has a way of affectin' everyone different\nIf it's true, how the fuck I'm s'posed to get over you?\nDifficult as it sounds\n\n[Chorus: Obie Trice]\nDudey, I drop a tear in a rhyme\nThe day you find it is the day I stop missin' DeShaun\nHolton, it was written, it was woven\nFor a soldier to leave so suddenly, got me wide open\nHow could God take a soul so dope and\nTurn around, leave us all heartbroken?\nKnow that you're sayin', \"Keep goin'!\nBe a man! No emotion! It's your duty!\"\nUntil we meet again, dudey\n\n[Verse 2: Eminem]\n\"dudey,\" that's what we'd call each other\nI don't know where it came from\nBut it just stuck with us, we was always brothers\nNever thought about each other's skin colors\n'Til one day we was walkin' up the block in the summer\nIt was like 90 degrees, I was catchin' a sunburn\nTryin' to walk under the trees just to give me some comfort\nI'm moanin', I just wanna get home and\nI look over and your shirt is off\nI'm like, \"You're gonna fry,\" you're like, \"No, I won't\nI'm black, stupid! And black people they got melatonin\nIn their skin—we don’t burn,\" meanwhile my face is glowin'\nAnd I feel like I'm on fire\nAnd the entire time you're just laughin' at me\nAnd snappin' at me with your shirt, bastard\nAnd I still have to get you back for that shit\nAnd by the way, them Playboy rings my mother stole from you\nWell, Nate finally got 'em back, shit\nIt must've been at least sixteen years ago\nWell, I put 'em in your cask—oww\nMovin' past it, it still ain't registered yet\nBut you can bet, your legacy they'll never forget\nThe Motor City, Motown, hip hop vet\nHip Hop Shop, dreads, it don't stop there\nYeah, as difficult as it sounds\n\n[Chorus: Obie Trice]\nDudey, I drop a tear in a rhyme\nThe day you find it is the day I stop missin' DeShaun\nHolton, it was written, it was woven\nFor a soldier to leave so suddenly, got me wide open\nHow could God take a soul so dope and\nTurn around, leave us all heartbroken?\nKnow that you're sayin', \"Keep goin'!\nBe a man! No emotion! It's your duty!\"\nUntil we meet again, dudey\n\n[Verse 3: Eminem]\nAnd this might sound a little strange but I'ma tell it\nI found that jacket that you left at my wedding\nAnd I picked it up to smell it\nI wrapped it up in plastic until I put it in glass\nAnd hang up in the hallway so I can always look at it\nAnd as for all me and D12 we feel like \"Fuck rap!\"\nIt feels like our general just fuckin' died in our lap\nWe shut off all our pagers, all our cell numbers is changed\nOur two-ways are in the trash\nSo some cats will have to find a new way\nAnd I know it feels like the dreams will die with you today\nBut the truth is they're all still here and you ain't\nPurple Gang, you gotta keep pressin' on\nDon't ever give up the dream, dog, I got love for you all\nAnd dudey, it's true you brought people together\nWho never woulda been in the same room if it wasn't for you\nYou were the peacemaker, dudey\nI know sometimes you were moody\nBut you hated confrontation and truly hated the feuding\nBut you was down for yours whenever it came to scrappin'\nIf it had to happen, it had to happen\nBelieve me, I know you're the one who taught me to throw them bows back on Dresden\nFrom eggin' cars to paintballin' and gettin' arrested\nTo sittin' across from each other in cells, laughin' and jestin'\nThey tried to hit us for five years for that, no question\nI guess them hookers and bums that we shot up didn't show up for court, so we got off on a technicality, left sweatin'\nMe, you and… what's his face? I forgot his fuckin' name\nShame he even came to your funeral, he betrayed our team\nAnd if I see him again I'ma punch him in the fuckin' face\nAnd that’s on Hailie Jade, Whitney Laine and Alaina’s name\nI'll let the pistol bang once just to lick a shot\nIn the air for you and pour some liquor out\nWith Obie in the parking lot of 54 just before\nWe were supposed to get in cars to come and see you once more\nDifficult as it sounds\n\n[Outro: Obie Trice]\nDudey!", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Eminem"}