{"songs": [{"title": "OK BITCH", "album": "The Play Don’t Care Who Makes It", "year": "2018-02-08", "lyrics": "[Intro]\nOkay bitch, okay bitch we goin' up\nOkay bitch\nJune, you're a genius\nOkay bitch, I'm in the zone\nOkay bitch, I got a home that got a home that got a home\nYo, yo\n\n[Verse 1]\nUsed to make hard, make it look easy\nTake the top back and make it look Jeezy\nTwo double cups, make it look Weezy\nToo much shrimp got me lookin' queasy\nThat's how I'm feelin' on the runway (the runway)\nOutfit lookin' like the runway (runway, yo)\nEvery day I'm tryna get a couple stacks (couple stacks, uh)\nDouble park the double R then double back (skrt)\nKnown to give an old school a heart attack\nKnown to buy a new car if I got a flat\nBetter ask about me, bitch you better know (better know)\nOkay bitch, this a AP, this a Rollie (this a Rollie)\nYou ain't never make it rain, Tony! Toni! Tone! (Tony)\nDon't you know you're homophonic? Please, don't approach me (no)\nChronicles of the chronic and the Digi-scale (yeah)\nA stripper pussy on my motherfuckin' fingernail\n\n[Chorus]\nOkay bitch, I run it up (yay)\nOkay bitch, you goin' back (ayy)\nOkay bitch, I'm from the trap (ayy)\nOkay bitch, you heard of that (ayy)\nOkay bitch, you know they flexin'\nOkay bitch, you know we strapped (ayy)\nOkay bitch, I'm from the Southside of town, you better ask\nOkay bitch, we goin' up (ayy)\nOkay bitch, I'm in the zone (ayy)\nOkay bitch, I got a home (ayy) that got a home that got a home (ayy)\nOkay bitch, we're goin' on (ayy)\nOkay bitch, I got a pool (ayy)\nOkay bitch, I got a pool (ayy) that got a pool that got a pool (yah)\n\n[Verse 2]\nYeah, Versace for the weekend\nThe devil wear Prada, I'm a demon\nA heathen, I gave the meat to vegans\nThe last time I hit the Gucci store, I had to sneak in\nI'ma need a girl tonight, I need someone to sleep in\nPool in my backyard, I never stuck my feet in\nRapper made the league and your pockets look petite\nOkay bitch, I'm goin' off (okay), okay bitch, I got that sauce (okay)\nOkay bitch, I'm on (okay) a double (okay) date, it's her and Nina Ross\nOkay bitch, I got a cross, layin' on top another cross\nLayin' on top another cross, I'm killin' 'em, sorry for your loss\nSomebody gotta call it off, a lot of bodies haulin' off\nThe marble floor and countertop, I got a gun know how to talk\nI got a scale that don't lie (lie)\nLegends don't die (no), where would I be if I ain't try? (uh)\nRemember Troop came through Godby Road with AI\nGucci slippers on, nigga, you could never tie\nAlright\n\n[Chorus]\nOkay bitch, I run it up (ayy)\nOkay bitch, you goin' back (ayy)\nOkay bitch, I'm from the trap (ayy)\nOkay bitch, you heard of that (ayy)\nOkay bitch, you know they flexin'\nOkay bitch, you know we strapped (ayy)\nOkay bitch, I'm from the Southside (ayy) of town, you better ask\nOkay bitch, we goin' up (ayy)\nOkay bitch, I'm in the zone (ayy)\nOkay bitch, I got a home (ayy) that got a home that got a home (ayy)\nOkay bitch, we're goin' on (ayy)\nOkay bitch, I got a pool (ayy)\nOkay bitch, I got a pool (ayy) that got a pool that got a pool (ayy)\n\n[Outro]\nAyy, mmm, mmm, mmm\nMm, mm, mmm", "image": "https://images.genius.com/36ea96fb9aee3d82e5685a543e312975.717x717x1.jpg"}], "artist": "2 Chainz"}