{"songs": [{"title": "Paper Route", "album": "Underground Luxury", "year": "2013-12-17", "lyrics": "[Verse 1]\nYou don't know who you're fucking with\nAin't no Democrat, and by far I'm no Republican\nThis is the type of talk that'll probably piss off my publicist\nAnd I ain't even started, the water ain't even bubbling\nThe type of talk that'll probably get me in trouble with the law\nOr make the government come after me in public\nWon't hear this on the radio, this here is not for publishing\nThis ain’t that bubble gum shit, no, this ain’t that Double Mint\nConsider this a risk, I swear I see them building pyramids brick by brick\nThey'll aim at anyone bold enough to go against the shit\nYou don't believe me? Look what happened to the Dixie Chicks\nIt's like nobody else complains\nUntil you try to be more than a nigga with a chain\nCube already told you: \"they corrupted everything\"\nAnd we're just out here trying to function, trying to maintain\n\n[Hook]\nA hundred miles an hour, running when I hit the ground\nThoughts moving through my head at the speed of sound\nI pray my prayers make it through the clouds\nI pray in heaven that them fuck niggas ain’t allowed\nA hundred miles an hour, running when I hit the ground\nThoughts moving through my head at the speed of sound\nI pray, I pray my prayers make it through the cloud\nUntil then it's back to the paper route, the paper route\n\n[Verse 2]\nAnd of course, it's unfortunate that niggas out here robbing for Jordans\nCan we not afford them, but got enough to get a Glock 40\nIs our views on reality kinda distorted\nBut still, even though I understand the story\nI still fall weak for a booty that's proportionate\nOn the sexy short bitch, so what's the score?\nChilling with some Red dogs, drinking White man's poison\nNow that's a forfeit\nSelling what's for free, that's extortion\nBut still I'm wondering what families were present when history was recorded\n\n[Hook]\nA hundred miles an hour, running when I hit the ground\nThoughts moving through my head at the speed of sound\nI pray my prayers make it through the clouds\nI pray in heaven that them fuck niggas ain’t allowed\nA hundred miles an hour, running when I hit the ground\nThoughts moving through my head at the speed of sound\nI pray, I pray my prayers make it through the cloud\nUntil then it's back to the paper route, the paper route\n\n[Verse 3]\nYou think you really know what's going on?\nThey're passing laws where they can run up in your own home\nCameras on your laptop, TV and your iPhone\nThe battery don't come out, that means it's always on\nSmile and say cheese, yeah niggas, gotcha!\nI told you fuckers three years ago about The Watchers\nIf you don't take the microchip, then you can't make no dollars\nThis ain't no lovely day for a neighbour, this ain't no Mr Rodgers\nDon't let them fuckers rob us for our freedom and our rights\nAnd you be like: \"it's on the news so it must be right\"\nWho's pulling the strings? Who's rolling the dice?\nWho's calling the shots and who's starting the fight?\nThink twice...\n\n[Hook]\nA hundred miles an hour, running when I hit the ground\nThoughts moving through my head at the speed of sound\nI pray my prayers make it through the clouds\nI pray in heaven that them fuck niggas ain’t allowed\nA hundred miles an hour, running when I hit the ground\nThoughts moving through my head at the speed of sound\nI pray, I pray my prayers make it through the cloud\nUntil then it's back to the paper route, the paper route", "image": "https://images.genius.com/d3cd5182aae0c27fc3ee1ef77656f879.500x500x1.jpg"}], "artist": "B.o.B"}