{"songs": [{"title": "Impostas", "album": "MF EP", "year": "2000-11-28", "lyrics": "MF DOOM - “Impostas”\n[Emcee(s): MF DOOM]\n[Producer(s): MF DOOM and Ill Clown]\n[Sample (Melody): Setsuo Yamamoto, Shun Nishigaki, and Tatsuro Suzuki - “Charlie Ending” (0:31)]\n\n[Intro: MF DOOM]\nThe Supervillian versus the gold-digger\nDOOM mild-mannered old nigga\nSupporter for the daily blues\nReporter for the jewel, drop news, pop Israeli tools\n\n[Verse 1: MF DOOM]\nThe world-renowned master of word game\nWho lay low sometime behind iceberg nerd frames\n(Ayyo, MF) They heard the name, but just couldn’t\nQuite place the rep if they retraced they steps\nNext EP, who to give thanks ta?\nHere lies the pranksta who tried to test a gangsta\nThe last thing he saw was a potato\nFrom the lone NATO who hosts his own late show\nKeep a low lab on Monsta Island like Seinfeld\nWhite-wine clientele connected like Mind Meld\nI can tell they sees these styles as too tricky\nThey’re too picky on this microphone doohickey\nMF, Monday through Friday, get money\nSaturday through Sunday, the brown Al Bunday\nWaiting for the shit you’re kicking as the plot thickens\nHe wrote these rhymes in 3-D with red and blue BIC pen\nAnd to the chickens, only hoes who say, “Let me hold ‘em”\nTake him in their mouth while he’s semi-swollen—semicolon\nI told him words would do a nigga brutal\nFor not using his noodle, F up and get bamboozled\nHe was the one to open to her up, blow her brains\nBack, dope her up or rope her to the train tracks\nOr he would choke her ‘til she collapse, steal/steel\nTo poker/poke her with the wood, and tell her, “Be good”\nHe could take a phrase like “Peter Piper picked a pepper”\nAnd put it where he couldn’t peep a sniper, sicker repper\nNigga poppa, stick a chick proper\nDouble-platinum, Oprah, soap-opera watchers, gossipers\nOn top of her\n\n[Bridge: MF DOOM and (Sample)]\n(I keep forgetting) can’t go\nRaw anymore\n(I keep forgetting) rappers is\nImpostas.  Been a show-stopper since a ho-hopper\n\n[Verse 2: MF DOOM]\nNever came second place in a neck-and-neck race\nTo the naked face who wanna battle: bring a neck brace\nWe supply the insult to injury\nWhoever in the industry getting money is too stingy\nViolate, you might as well smoke me, loc\nRelocate, migrate, or get caught with the okey-doke\nIt’s guaranteed it’s your last step, so step to me\nWith the Uzi, watch that first step—it’s a doozy\nTime flies as the hourglass trickles sand\nOne last thing before I blao this popsicle stand:\nA rolling stone, and that’s that.  At home\nOn the microphone like, “That’s where he laid his hat at”\n\n[Outro: MF DOOM and (Sample)]\n(I keep forgetting)\nKeep making dough\n(I keep forgetting)\nMad Flow, MF, Metal Face hoes\n(I keep forgetting)\nFactual stacks at shows\n(I keep forgetting)\nWorldwide, ‘cross the globe, let the beat rock", "image": "https://images.genius.com/1cb996b05bf93651b8cfa75da57a2a1a.805x805x1.jpg"}], "artist": "MF DOOM"}