{"songs": [{"title": "Purp & Patron", "album": "Purp & Patron", "year": "2011-01-24", "lyrics": "[Intro:]\nFinna pop the bottles now\nSit back and watch while the models dance around\nIt's about to go down!\nTonight is gonna go down!\nIt's about to go down!\nTonight its gonna go down\nPurp and Patron Now\n\n[Verse 1: Game]\nEverything is so beautiful, beautiful\nAnd this is why I do it for\nPurple haze smoke it to the face, no passing\nNeed a couple blunts for this four or five traffic\nT.Vs in the dash and Amex on the gas and\nHit the carpool lane I got these bitches playing Madden\nRims and them rubba bands\nRolling while I'm rolling and I roll them shits the fastest\nCan't tell we're smoking cause of the tint\nGranddaddy purple from Comp Town to Oakland is the shit\nAnd you know I came with assorted of flavor, so take your pick\nI'm a cool nigga, 100 dollars for half a sip\n\n[Hook:]\nPurp light it up\nPatron fill it in\nAnd we gonna let this mother fucker spin\nAll in my system!\n\n[Verse 2: Menace]\nAy yo I walk up in the spot, Welches and some rock\nGotta set the mood, I make love to the block\nBetty Crocker with them pots\nI'm rocking shit, thinking you can top it, better stop, Watch your droppin shit\nPresidential on my presence nigga, I should of wore a suit\nKush and Patron, now I'm tearin up the coop\nBut you know a nigga Bowling(Ballin)\nCause every time we hit your block up, you nigga start hating\nAnd You bitches start calling!\nBBut I just laugh and take a hit of the Swisha Sweet\nCause life is like the smoke in the air when you're in the streets\nOh, we're gonna got it in ain't no body pitching in\nThis is celebration for the gangstas, but all we got is..\n\n[Hook:]\n\n[Verse 3: TD]\nI said we up in this session recording purple and Patron\nAll my nigga up in here gone off that purple and patron!\nI stopped blowing that purple but A.R pass me that Patron\nTequila got me feeling it, and now my ass in the zone\nI got two bad bitches at home\nWaiting for me to get finish,told her call at least two more\nCause I'm bringing Compton Menace\nAnd my nigga fresh is coming, they gon roll about a onion\nThen yall gon take different strokes and I ain't talking Phillip Drummond\nI'm from Philly you feel me, but all them Cali bitches love him\nCause I'm ballin with the king, like that boy Demarcus Cousins\nYou's can hate them all you want, but you still gotta feel 'em\nBlack Wall Street Gang, We in the building bitch!\n\n[Hook:]", "image": "https://images.genius.com/2ac5b9e1da222cb025aa059f64716e53.500x500x1.jpg"}], "artist": "The Game"}