{"songs": [{"title": "Days Before", "album": null, "year": "2019-07-10", "lyrics": "[Intro: Young Thug]\nYeah\nAyy\nListen\n\n[Verse 1: Young Thug]\nS-N-Double-O-P, I'm a dizz-og\nShit, he was talking brazy, I ain't lie, I knocked the nigga off\nI ain't tryna give him a chance to kill me or take the stand on me\nHe know I just had 100,000 piece saran'd on me\nI had to hand my [?]\nI tried to take back all the watches, rings and the necklaces\nShe said I'm taking full advantage 'cause I'm never stressing\n'Cause I had feelings for this girl that daddy homed as restless\nDon't get me wrong 'cause it ain't nothing 'bout that money, nigga\nI meant to tell you, since a kid, I been getting my own figures\nI was bringing in the racks and she was steady shopping\nI'm talking big bills, all colors, nigga, Monolopy\nI ain't trippin', bitch, I'm sharper than a damn machete\nSuper different, I even stood out on my own partners\nSince a kid I been a dresser, Thousand Island\nI was shitting my diamonds, green, piss a port-a-potty, woah, yeah\n\n[Verse 2: Mac Miller]\nBitch talk to me while I'm sleeping, yeah, yeah\nSwimming in the linen like deep-end, yeah, yeah\nAll I never needed was a alibi, yeah, yeah\nI don't need a motherfucking reason, yeah\nOut of mind, so I keep a pizzy\nEverything 100, I don't ever leave a 50, yeah\nDid my own half-time, if I was simple\nWhat the fuck you think I'm rich for?\nWhy you think I'm always talking shit, with my hand on my dick?\nIn the crib, this bitch turn into a strip show\nIt's what it is, though\nYeah, yeah, it's what it is, though\nYeah, whoa, leave me alone, take your ass home\nIf it ain't another million, I ain't picking up the phone\nPhony motherfuckers always sittin' on the throne\nAll I want's some pussy, baby, give a dog a bone, yeah, yeah\nI don't need a lot but I got a lot\nI don't need a lot but I got a lot\nYeah, 200 for the whip in the parking lot\nEverything cuttin', turn this shit into a barber shop\nSwear I'm always shining, couldn't tell you if it's dark or not\nJust a couple things I thought about, yeah, yeah\n\n[Verse 3: Trippie Redd]\nHow the fuck you ever try to play me?\nI thought you was my love, man, I even called you baby\nYou played me, went from my mud to Slim Shady\nNow demonic thoughts in my head, this shit crazy\nThanking God for everything I got, told him to save me\nDo whatever for my OGs, nigga, that's who raised me\nYou made me blind to reality, that shit fugazi\nYeah, I said that shit is so fugazi\nNow I'm swervin' round in this Mercedes\nYeah, you can love me or you hate me\nHe just mad 'cause that pussy nigga ain't me\nI'm gettin' money, I ain't gon' let that shit faze me\n\n[Outro: Trippie Redd]\nI'm good, bro, what's up?\nNo cap", "image": "https://images.genius.com/835c42a04850a53e4e07167e21d558c7.1000x1000x1.jpg"}], "artist": "Young Thug"}