{"songs": [{"title": "Z-Day", "album": null, "year": "2016-01-13", "lyrics": "[Intro: Ski Mask The Slump God]\nHaha, bitch, haha, skrt, fwoof, bitch\nYou fall like coddled bourgeois!\nRicky Bobby\nInsta-Kill!\nHahahaha, whip whip whip\nJeff Gordon, haha, bitch\nAyy, Z-Day, ayy, ayy\n\n[Verse 1: Ski Mask The Slump God]\nParkinson's, Parkinson's, Parkinson's\nWrist game on Parkinson's like I can't park again\nYour girl is feeding me chocolate in Charlie's factory\nBitch you my moccasins\nI then might cut out your arteries\nI done a- I done smile at the thought of it\n\"I ate the heart of a Baphomet\"\nIs what I say when they ask for start of this\nHickory, hickory, guns with the thickery\nJust gave your ass an epiphany\nJewelry, jewelry, your jewelry foolery\nLook like you got it from Tiffany (Woo!)\nRide on your bitch like a swing, wee!\nI steady doing my thing, ee!\nCheckmate me bitch I'm a king\nShe sucked me, R. Kelly, I sing\n\n[Verse 2: Yung Simmie]\nI'm sending shots at your skeleton\nWrapping my flag, no Confederate\nI pull up and my niggas pop at you\nYou talking, my niggas ain't hearing it\nI'm from the city you better go get it\nOr you gon' get left by yourself\nI be fucking these bitches, no loving these bitches\nThe chopper is right on the shelf\nI'm just a young nigga, I don't know these niggas\nI came in the game by myself\nAnd I am too cold, I won't sell my soul\nReal nigga I'll never fold\nMy young niggas wylin', you slipping\nThey get you, you better be tucking your gold\nMy young niggas riding, they with me\nWe gooning and we sending shot at your dome\n\n[Verse 3: Denzel Curry]\nLook at me looking luxurious\nDiamonds dancing it's the federation\nI'm the overlord dressed in all black\nAnd I'm balling no Voldemort\nNone of the sorcery could penetrate my forcefield\nLord willing, imperialism\nPistol popping on the crackers at the 181st Street Mall\nDamn them crackers wanna see a nigga fall\nNo Niagara but the boy be flowing\nLike a record spinning in the DJ Quik\nMan the situations getting kinda thick\nCan't envision niggas out here getting rich\nSince you up, and you black and you innocent\nI am significant, I wanna step my rich market\nBanana clips when I'm busting\nCurry the killer the nigga I'll shoot up your squad", "image": "https://images.genius.com/67d94f1dc829415736dd3b0099512c1a.489x483x1.jpg"}], "artist": "Ski Mask the Slump God"}