{"songs": [{"title": "U Don’t Know (Remix)", "album": "The Blueprint 2: The Gift & The Curse", "year": "2002-11-12", "lyrics": "[Produced by Just Blaze]\n\n[Sample: Bobby Byrd]\n(I'm not trying to be no big thing, no no)\n(I'm not trying to give you no advice)\n(I don't claim to be) (no philosopher)\n(But I sure know, this is life, baby, baby)\n\n[Intro: Jay-Z (over sample)]\nYou gotta let this one breathe, Just\nJust let it breathe for a second\nYup! Hovi's home!\nThe newest addition to The Roc, M.O.P\nThe Blueprint 2 is on its way\nI know y'all hear my footsteps out there, I'm coming\nLet's go get 'em Just!\n\n[Interlude: Lil' Fame]\nTime to dump (fiyah!) dump (fiyah!)\nDump (fiyah!), dump (fiyah!), dump (fiyah!!!)\n(You don't know, what you're doing, doing, doing, doing)\nIt's the M.O.P.!\n\n[Verse 1: Lil Fame]\nAnd the zip code is 1-2-3, and motherfucker we coming\n100 miles and gunning, I'm still running with cats that rob\nFrom the era of XL 80's and hatchback Saabs\n(SAME GAME!) Operation for this industry lockdown\nWe still tote hammers that go blak-ow, run up if you wanna\nBelieve me dawg, these hammers with they owners\nFuck your G up, have ya with blue Pampers in a coma\nAnd your family now moan, look seventy pounds gone\nA little fuck, shriveled up with a hospital gown on\n(WE HOLDING IT DOWN HOMES!) Keep pushing we fell, bastards\nTo get over, we prowl with slippery shell tactics\nChippety frail bastards, your tracks need tune-ups\nLil' nigglet,, what the fuck you recording for, Nick Jr?\n(THE GAME AIN'T CHANGED) it just got harder\nPlus we sponsored by Laze, Dame Dash and Mr. S dot Carter\nBrownsville (YEP!), we stomp through this bitch all day\nRock with my cock out, face the crowd and piss off stage\n\n[Verse 2: Billy Danze]\nI'm from the G side of thangs, where we ride and bang\nWith a heat that'll flame, that's how we got the name\n(WARRIORS!) Embedded in ya brains\nAnd someone should be telling 'em the veterans have came\nAnd we're better in the game, you better make it rain\n(27 a gram) My man, it's better than cocaine\nNow everything will change and this Family will rule the world\nAnd you haters can eat a dick up 'til you hiccup and earl!\nA decade on the grind, nigga I paid mine\nSo it's my time to shine and for you to ride the pine\nI won't sit back and rap like these dumb-ass kids\nI been around, I put it down, I ain't these young-ass kids (M.O.P.)\nThe O.G.'s repped and survived around this motherfucker\n(FIRST FAMILY!) We kept it live around this motherfucker\nWhen it's crunch time, we do it our wizzay\nFo' shizzle my nigga, learned to grip pistols in B.K\n\n[Interlude: Jay-Z]\nTurn my music high, high, high, high-er\n\n[Verse 3: Jay-Z]\nMo' fire, more Rocawear attire\nMo' money, mo' murder now that M.O.P.'s hired\nMo' further for the Roc Empire, y'all won't serve us, y'all nervous\nKnow them guns on full service, ready to fire\nOne body, two body, three body, four\nYoung sitting on paper, I'm above the law\nYoung shitting on haters, I ain't fucking with y'all\nFor my Brownsville neighbors, How About Some Hardcore\nAnd it just get worser every time I sign my signature in cursive\nJust add another million to these verses\nOne million, two million, three million, four\nAnd the money's really worthless, I'm pissing you off on purpose\nMy nephew's situated and my mom is straight\nSo I'm ready for whatever drama should come my way\nAnd you niggas rapping to me, so your drama is fake\nYou dudes is noodles, I got more ziti to bake\nYou dudes is cake, I keep two biscuits on the waist\nRazor blades under the tongue, I will eat your face\nAppetite for destruction, I am starving today\nGot a money hungry lawyer that'll eat the case\nAnd that's just food for thought, don't let it go to waste\nNigga bite the bullet until you stuffing your face, ha\nI done forgot more than you ever learned\nWhat you don't know will make yo' home a permanent urn, nigga\n\n[Outro]\nDo you believe it?\nYou don't know, what you're doing - doing - doing - doing\nDo you believe it?\nYou don't know, what you're doing - doing - doing - doing\nDo you believe it?", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg"}], "artist": "JAY-Z"}