{"songs": [{"title": "Bang Bang", "album": "Rise Up", "year": "2010-04-04", "lyrics": "[Intro: B-Real]\nThis is fucking weed is good holmes! (Fuck!)\nYou know, the first time I fuckin' blazed up, eh? I was listening to those watto's Cypress Hill!\nYou ever heard of them holmes? (Yeah, I heard of 'em... They fuckin' suck!)\nAre you fuckin' stupid, eh?\nWhat the fuck are you talking about?\nThose watto's are feed man, holmes! (Naaaahhhh!)\nYou're fuckin' hater, eh?\nDon't fuckin', just gonna shoot you, boy! (Whatever...)\n\n[Bridge 1: Voice]\nShot down!\nShot down!\nShot down!\nShot down! (Bang, bang!)\n\nShot down! (Bang, bang!)\nShot down! (Bang, bang!)\nShot down! (Bang, bang!)\nShot down!\n\n[B-Real:]\nThis is for those haters and imitators\nTake your medicine you won't like the flavor!\nThe taste ain't sweet! - We lace that beef\nNever forget how we play in the street!\nNever forget what you say in the street!\nIf you talk too loud, get laid with the heat\nWe want that cake and Jay. - You can't stop us!\nOut the gate we take those dollars\nGet a crew while we do us some real shit\nMe and the dogs we rock steady pushin' the Hill shit\nWe flip scripts like dough boys clip bricks\nGet money like lottery quick picks!\nWe stick with it and homie I'm quick witted\nStill in the game and sane we still spit it\nTop level. - Livin' like a rebel\nSettle down bitch while we skip that medal!\n\n[Hook: B-Real (Voice)]\nRemember when you motherfuckers (shot down!)\nTried to take what's mine! (shot down!)\nNigga's left me for dead. (shot down!)\nBut I'll never forget! (shot down!)\n\n[Bridge 2: Voice (Sen Dog)]\nBang, bang! (PAYBACK!) Shot Down!\nBang, bang! (PAYBACK!) Shot Down!\nBang, bang! (PAYBACK!) Shot Down!\nBang... [8 seconds instrumental]\n\n[Sen Dog:]\nI came up in the game doin' my thang for the paper, (doin' my that for the paper!)\nNever gon' change! Bringin' bang on the haters. (bringin' bang on the haters!)\nThey used to gangbang on the corner black came out\nDrop then sayin': \"Not the world for this flava! \"\nI remember when you niggas used to front on me. (front on me!)\nEverywhere I ride kept the gun on me. (gun on me!)\nI only used to listen to my one O.G., (one O.G.!)\nHe said: \"Get money, but stay low key! \" (STAY LOW KEY!)\nSo it's a payback - with pain in the back (PAIN IN THE BACK!)\nThe whole world gettin' high (GETTIN' HIGH!), when I say it on the track! (on the track!)\nAnd I say it with a Gat! (WITH A GAT!) - I never gon' sleep! (never gon' sleep!)\nFuckin' hit 'em up, if you ever wanna trick. (ever wanna trick!)\nAll it takes is a hit and you never forget\nWhen you smoke on the Hill, wanna kill level twist. (WANNA KILL LEVEL TWIST!)\nFuck a shot! We drinkin' the whole Fifth! (DRINKIN' THE WHOLE FIFTH!)\nThen I ride with them killa G's, know we don't miss! (KNOW WE DON'T MISS!)\n\n[Hook]\n\n[Bridge 2] [43 seconds instrumental]\n\n[Bridge 1: x2]", "image": "https://images.genius.com/f469b84836527dfec52206e182dfacce.220x220x1.jpg"}], "artist": "Cypress Hill"}