{"songs": [{"title": "Take Sword Pt. I", "album": "Afro Samurai Soundtrack Album", "year": "2007-01-30", "lyrics": "[Intro: \"Shaolin Vs. Wu-Tang\" sample]\n\"Take the sword\"\n\"The sword?\"\n\"Come on, give me the sword\"\n\"Huh?\"\n\"Heh, you Wu-Tang are never gonna win\"\n\"My lord, don't be afraid of the Wu-Tang techniques\"\n\"Pick up the sword!\"\n\n[RZA]\nYo, ayo; chumps are in trouble, boy, tongue pay double, boy\nI'm trump tight, you better go home, and cuddle, boy\nI leave you ducks in a puddle, buried under tons of rubble\nTurn your body, to sparks and stubbles\nHot lead from the cylinder, from my two-shot dillinger\nPut that hot steel in ya, bigger not feeling ya\nBio hazard, to ya flesh and ya fabric\nNo need to scratch your hair, son, the clean to my static\nStrange apparatus and gadgets, my bullets got magnets\nPop pop pop, we attract to that crab shit\nSuper superior stamina, there's a Clan of us\nAll of what bulldozers, hard hats and jack hammers\nAnd leather Old Testament copies, I'll probably\nGive you a out of body experience, then hide your body\nSo there's no return, so burn, baby, burn\nMy clique fucking sick, nigga, learn, baby, learn\nI got Milwaukee chicks like Shirley and Laverne\nThey bite ya dick off, after swallowing your sperm\nThey slice ya fucking throat while you lay there and squirm\nThey related to the judge, so the case get adjourned\nYou chumps are in trouble, boy, I said tongue pays double, boy\nI\"m trump tight, you better go home, and cuddle, boy\nI put your head in a puddle, buried under tons of rubble\nTurn your body, to sparks and stubbles\nFrickles and fragles, nigga, you're too fragile\nMotherfucker, my brain is on Scrabble!\n\n[Beretta 9]\nAiyo, back for this annual conference, confronted on\nYou wack MC's, it's duck season, the hunt is on\nWhat B9 squeezing and game is locked, a run upon\nThinking that you were the shit, nah, that's once upon\nI doubt my run while you sit, I bust my gun from the hip\nWhy even make you a song, and when you ain't worth a skit\nMy niggas kill for the sum, and the'll be cursed for the flick\nProbably til midnight until, scheeming on pussy to split\nAnd then we back like crack, nigga, take a swig of that\nTwist a twenty sack of black, figure, oh he a good kid\nSuch a nice smile he had, oh one more state\nThen I whip it on that, slip slipping in the grass\nSip sipping on the glass, now I'm dipping down the ave\n\n[Outro: \"Shaolin Vs. Wu-Tang\" sample]\n\"Take the sword\"\n\"The sword?\"\n\"Come on, give me the sword\"\n\"Huh?\"\n\"Heh, you Wu-Tang are never gonna win\"\n\"My lord, don't be afraid of the Wu-Tang techniques\"", "image": "https://images.genius.com/934a82446b3da7846960f0df79197fa9.592x592x1.jpg"}], "artist": "RZA"}