{"songs": [{"title": "My Life", "album": "Dretox", "year": null, "lyrics": "[Hook]\nJust smokin' weed for hours\nDrinking Hennessy for hours\n\n[Verse 1: Dr. Dre]\nThat's when I started flipping shit, mixing at the EVE\nIn '83 World Class beats for free\nI hooked up with this fool slinging cookies and shit, just rookies and shit\nStomping out the CPT\nIt was five niggas showin' muthafuckas the streets\nPicked up this cat from Dallas then we went back east\nShit was wild when we broke them muthafuckas a piece\nThey said 'as long as you don't sing that shit about the police'\nNow back on the coast, I don't bother no one\nI keep strictly with the business 'til that shit gets done\nMakin' money muthafucka, supposed to be havin' fun\nBut my faculty got fucked cause we fucked off one\nThey got me drunker than a skunk gettin' paid and shit\nNever really considered what was made and shit\nLike a Renegade and shit, thanks to shit\nNiggas couldn't fade muthafuckin gansta shit\nIce Cube was performin', yeah he ain't no joke\nHim and a bunch of Brooklyn niggas servin' nothin' but dope\nAnd we all stayed down, we all kept winnin'\nStudios and hoes was just the beginnin'\n\n[Chorus]\nIn sunshine\n(Yeah, I'm just tryin' to live)\nMy life, my life, my life, in the sunshine\n(Yeah, I gotta live)\nMy life, my life, my life\n\n[Verse 2: Dr. Dre]\nThey said them niggas was real look how they ballin' and shit\nWhen the business get up in it, it's all new shit\nMake sure it's straight cause you gon' hate when yo' shit fake\nBe like I can't fuck with that, back to servin' them cakes\nI went to the liquor store so I could get me a drank\nThen I ounce and just bounce get some pussy and thank\nI see my nigga D.O.C. him and the security ballin'\nIn one of his foe's that muthafucka was crawlin'\nHe holla'd and shit but I can't hear that nigga jawin'\nSo I said hold up nigga, got my shit, we all in, he said\n\n[The D.O.C.]\nThese papers fucked up my nigga you can check it out\nIf yo' shit fucked too let's put our own fuckin' records out\n\nI got his information and went on my way\nWent home and realized, shit I'm givin' paper away\nThen there's a knock at the door, my brother Warren G\nWith some niggas out of Long Beach called 213\nWe started workin' on Deep Cover, said fuck it, we made it\nThey played it and they played it, got faded and replayed it\nThey said it's the shit, G funk shit be knockin'\nThe Row was bouta' drop and it was on and poppin'\n\n[Chorus]\nIn sunshine\n(Yeah, I'm just tryin' to live)\nMy life, my life, my life, in the sunshine\n(Yeah, I gotta live)\nMy life, my life, my life\nJust smoking' weed for hours\nDrinkin' Hennessy for hours", "image": "https://images.genius.com/25779bcfc8841f55d4f76cefa93fbd73.636x634x1.png"}], "artist": "Dr. Dre"}