{"songs": [{"title": "Bong Bong", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Intro - RZA + U-God]:\nYeah, yeah, yeah, yeah, come on\nYeah, my nigga, come on\nThis is Digital, this is sizzlin'\nIt's like a vamp, it's like a genie in the land\nYo\n\n[Hook x2 - RZA & Beretta 9]\nBong bong, bong bong, BZA, bong bong, bong bong...\n\n[Intro - RZA] (Beretta 9):\nCome on!\nAll my real niggas push up to the front (word up)\nOh shit, look at shorty over there\nCaramel deluxe type bitch, yo\n\n[RZA]\nAin't know she suck dick like that\nWith those big fat lips and those hips like that\nShe said \"Bobby, why you spit like that?\nAnd why you Shaolin Gods push whips like that?\"\nI said \"Ho, we got chips like that\nAnd Park Hill niggas make flips like that\"\nAnd Brass Monkey, yea we sip like that\nAnd we might get drunk and empty clips like that\nThen again the Gods build like that\nYo Kinetic, tell em son, we keep it real like that\n\n[Beretta 9]\nCarry 9s all the time it's concealed like that\nHoney-dipped blunts, we get high like that\nYo we dipped every day, yo we fly like that\nBitches always sayin \"Why you talk like that?\"\nWe B-Boy niggas, you know we walk like that\n\n[RZA]\nWhy them R&B niggas tryin to sing like that?\nAnd you fake crossovers tryin to bling like that?\nYou know, my clique snatch ice like that\nTake it down to the scale and get a price like that\n\n[Beretta 9]\nSnub in the club, don't be nice like that\nCatch a body and escape, pull a heist like that\n\n[RZA]\nUp front, up front, come on, come on\n\n[Hook x2]\n\n[RZA]\nCheck it\n\n[Madam Cez]\nY'all niggas talkin shit\nWe out here tryin to get paid in a major way\nCome on\n\nI rock a six like that\nFrom my dubs in the club, sippin Cris' like that\nPop a bitch, turnin trick, get my ish like that\nCheck the ice, lookin nice on my wrist like that\nI'm the shit like that, dicky-dick like that\nRoll with baller sheist types that be sick like that\nSet up shop on your block, flip a brick like that\nIt's the Wu comin thru with a chick like that\nSticky spit like that, what?\n\n[Beretta 9]\nWhat? What?\nNine inches, ho, we packin dick like that\nSix on the dice, we rollin licks like that\nHalf a mil on the deal, we politic like that\nRemember '94, we sold mix like that\n\n[RZA]\n4 Sho, the whole crew used to sling like that\n\n[Beretta 9]\nIndeed, you know the fam, we was the king at that\n\n[RZA]\nGuaranteed, now it's Killa Bee sting like that\nAnd I'll punch you in the head with pointed rings like that\nAnd why's this fuckin crab bleedin like that?\nWhile you crack-head bitches treatin seeds like that\nMy nigga Johnny Blaze smoke weed like that\nAnd the Killa Bee Clan run the streets like that\nBig Bobby makin beats like that\nPlatinum on the wall, son I eats like that\n\n[Beretta 9]\nDamn, you 85's eatin swine like that\nWe ain't tryin to be cause y'all blind like that\n\n[RZA]\nTo all my thugs or who smoke like that\nAnd you coke-head niggas sniffin coke like that\nAnd you ecstasy cats poppin dope like that\nIt's all love cause we folk like that\nGuaranteed, now we bout like that\nKinetic 9, Bob Digi\n\n[Beretta 9]\nYo we out like that\n\n[Hook x2]\n\n[RZA]\nFor y'all niggas gettin high we go like this\nBong bong..\nPop that shit..\n\n[Hook x2]", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}