{"songs": [{"title": "Lonely People", "album": "The Beautiful Mix CD", "year": null, "lyrics": "[Hook]\nAll the lonely people, where do they all come from?\nAll the lonely people, where do they all belong?\n\n[Intro: Talib Kweli *over hook*]\nYeah I like to go out to clubs\nLas Palmas, you know\nShe this envy if I wanna get grimey wit' it at Bungalow Eight\nOpium down in Miami\nBut when I walk in, I look around and I think\n\n[Continuation of Hook]\nI look at all the lonely people (x4)\n\n[Verse 1: Talib Kweli]\nYo, I'm headin' out, 'bout to do some fleshin' out\nI know my flesh endowed\nWith somethin' to prove, I'm settin' out\nOn a trip to Heaven's mouth, yeah\nI'm steppin' out in the name of love\nWho knew the Devil could slow dance?\nWe have pathological romances with technological advance\nInfatuated with infatuation and\nIntellectual masturbation with premature ejaculation\nMake a baby mama's all bastardization and\nLonely people all through the city\nThey club hoppin' and they love shoppin' and they thug posturin'\nThugs be lockin' horns with Crips on them drug blocks\nAnd them dollars flow right out of the 'hood\nWhen you tryin' to make paper out of the wood\nYou know that money don't grow on trees\nFor paper people change colors like leaves\nAnd they fall off in the mud like a filthy pig\nMakin' you and your dogs who store all call off\nThat much deserved ass whippin'\nHe snitchin', he twitchin', he bitchin', he all soft\nNever work with his hands\nLittle kid on the block who always ran\nAt all costs, gotta be in the club\nLookin' for happiness or the meaning of love\nThen it hit him, out the blue like a vision\nAll of a sudden he don't like the way he been livin'\nAnd wanna be forgiven\nHow I know? Cuz I'm right there wit' him\nYo, yo\n\n[Hook: Beatles/Latoiya Williams]\n\n[Verse 2: Talib Kweli]\nTattoos tell 'em who you are\nPlastic Surgery coup d'etat the God\nUh, lasers to remove the scar\nAnd then you are, you a supastar, supastar\nIt's your birthday and you in the club\nTalkin' \"Holla back\" and \"Nigga what\"\nSo much cleavage and asscrack\nIf pussy were a stock it would plummet on the Nasdaq\nBlank stares like nobody care\nIn a room so exclusive nobody there\nBut really, truth is that nobody there\nCuz it's feelings inside that nobody share\nI want God to smile on me\nBut see, fame is a drug and you wild on E\nCelebrities decorated like Christmas trees\nGod complex like they born on Christmas Eve\nSing a song to yourself and you stand alone\nGet nominated for a gold gramophone\nWalk the red carpet, left your man at home\nSecurity snatchin' people camera phones\nYou got rose gold yellow bottles, pink Cashmere\nSo ahead of the trend, that's so last year\nLast month, last day, last hour, last minute\nYour pursuit of cool is so passionate\nDoin for the cash in it, laugh in his face\nIf it's def or anybody who don't stay in his place\nSo popular can't go nowhere, folks stoppin' ya\nMight want to check a thermometer\nWhen you go to a movie heat rises\nSurrounded by people still lonely, that's why you need disguises\nProbably\n\n[Hook: Beatles/Latoiya Williams]", "image": "https://images.genius.com/1ae9c01fa93b65ac976de548b8d4b472.640x640x1.jpg"}], "artist": "Talib Kweli"}