{"songs": [{"title": "Nothin’", "album": "Sickology 101", "year": "2009-04-28", "lyrics": "[Verse 1: Tech N9ne]\nI used to press my Dickies with Sta-Flo\nSold pieces for my reli chasin' peso\nNow they want me with nothin' cause I let my pay show\nSo I hop inside of my Mercedes and let the bass go\nOn you hatin' ass niggas, I deserve everything I get, a creatin' cash getter\nI ain't puttin the 2 on the 10 I'm makin' vast figures\nYou fags bitter mad wanna be fakin' class with us\nHow they thinkin' they gonna come and conquer us?\nLittle Mini Cooper hatin' on a monster truck\nPonder such, I'll have you up in yonder stuck\nNot a nare not a breath a stutter that conjure a\nNothin', nathin', the ruger's penetration\nInside of ya head it was soundin' like it's bassin'\nBoom bing bang on you haters in the game\nStrange lane takin' aim ain't a damn thang sane\nI get it in, want some drama? Well I can fit it in\nWe can make it so you're no longer a citizen\nSuction, from beneath you we just a little dust'n\nAll because I'm bringin' the bucks in\n\n[Hook: Tech N9ne]\nThey wanna leave me with nothin' (Uh-uh)\nBut they ain't talkin 'bout nothin' (Uh-uh)\nSo I ain't trippin' on nothin' (Uh-uh)\nThey come to get me I'm bustin' (Uh-huh)\n\nThey wanna leave me with nothin' (Uh-uh)\nBut they ain't talkin 'bout nothin' (Uh-uh)\nSo I ain't trippin' on nothin' (Uh-uh)\nThey come to get me I'm bustin', bustin' (Uh-huh)\n\n[Verse 2: Big Scoob]\nOn the block it was hot to not to run from the cops\nI used to cop and used to chop and dump my rocks at Ms. Scott's\nAnd on the late night at Ms. White's I'm fuckin with Will\nWe used to play fight then one night we came up with Vill\nYoung thugs dump drugs nigga hungry for meals\nYoung thugs jumped blood nigga itchin' for kills\nShit was real in the field man this shit was too real\nLost my homies to this shit man this shit is for real\nBut nigga nowdays the streets they go hard on the hustla\nAll these pussy niggas rattin' so us real niggas suffer\nNot plentiful for me no more it's hoes in the game\nSince I smell when paper foldin' man I'm rollin' with Strange\nPour some whiskey party with me tell the Feds if they miss me\nThey ain't comin' for me now then nigga bet they don't get me\nSo all you muthafuckin sucka niggas wishin' me gone\nBig homie Strange Music Resurrection I'm home\n\n[Hook]\n\n[Verse 3: Messy Marv]\nAll I do is sell dope and nigga talk bricks\nTalk with bananas and tote clips\nRide around and smoke kush with the yurner on me\nDrink them champagne bottles with the flower on 'em\nAll that talkin' loud, will get a nigga a hit\nYou see them cherry red chucks? Yeah I'm with the shit\nAnyway I bounce out man I hit 'em up\nAnd I'll lock up with you we could get 'em up\nI still wear a gold grill 10 across the bottom\nThey call me 19-5 cause a nigga got 'em\nClick-Clack nigga yanka get yanked on\nThere's been alotta hatin' nigga since I came home\nAnything a nigga do homie it's federal\nAnd come with football numbers in the level 4\nThey wanna bee a nigga dead man but nathin'\nTech fuck them muthafuckaz they could keep hatin'\n\n[Hook]", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}