{"songs": [{"title": "Party and Bullshit", "album": "Who’s The Man? (Original Motion Picture Soundtrack)", "year": "1993-06-29", "lyrics": "[Verse 1]\nI was a terror since the public school era\nBathroom passes, cutting classes, squeezing asses\nSmoking blunts was a daily routine\nSince 13, a chubby nigga on the scene\nI used to have the trey-deuce\nAnd the deuce-deuce in my bubblegoose\nNow I got the Mac in my knapsack\nLounging black, smoking sacks up in Ac's and Sidekicks\nWith my sidekicks rocking fly kicks\nHoneys want to chat\nBut all we wanna know is where the party at\nAnd can I bring my gat?\nIf not, I hope I don't get shot\nBetter throw my vest on my chest, 'cause niggas is a mess\nIt don't take nothing but fronting for me to start something\nBugging and bucking at niggas like I was duck hunting\nDumbing out, just me and my crew\n'Cause all we wanna do is\n\n[Hook]\nParty and bullshit\nAnd party and bullshit\n\n[Verse 2]\nHugs from the honeys, pounds from the roughnecks\nSeen my man Sage that I knew from the projects\nSaid he had beef, asked me if I had my piece\nSure do, two .22s in my shoes\nHoller if you need me, love, I'm in the house\nRoam and stroll, see what the honeys is about\nMoet popping, ho hopping\nAin't no stopping Big Poppa\nI'm a Bad Boy\nNiggas wanna front, who got your back? (Biggie!)\nNiggas wanna flex, who got the gat? (Biggie!)\nIt ain't hard to tell I'm the East Coast overdose\nNigga you scared you're supposed to\nNigga, I toast ya, put fear in your heart\nFuck up the party before it even start\nPissy drunk, off the Henny and skunk\nOn some Brand Nubian shit beating down punks\n\n[Hook]\nParty and bullshit\nAnd party and bullshit\n\n[Verse 3]\nBitches in the back looking righteous\nIn a tight dress, I think I might just\nHit her with a little Biggie 101, how to tote a gun\nAnd have fun with Jamaican rum\nConversation, blunts in rotation\nMy man Big Jock got the Glock in his waist and\nWe're smoking, drinking, got the hooker thinking\nIf money smell bad, then this nigga Biggie stinking\nIs it my charm? I got the hookers eating out my palm\nShe grabbed my arm and said \"Let's leave calm\"\nI'm hitting skins again\nRolled up another blunt, bought a Heineken\nNiggas start to loc out, a kid got choked out\nBlows was thrown and a fucking fight broke out\n\n(Music stops\nIndecipherable sounds of people yelling and arguing\nBiggie breaks it up yelling \"Yo, chill, man, chill!\")\n\nCan't we just all get along?\nSo I can put hickies on her chest like Little Shawn\nGet her pissy drunk off of Dom Pérignon\nAnd it's on, and I'm gone\nThat's that...\n\n[Hook]\nParty and bullshit, and party ...\n\n[Puffy]\nJunior M.A.F.I.A. like to...\nUptown likes to...\nBad Boy likes to...\nBrooklyn Crew likes to...\n3rd Eye likes to...\nMo Bee likes to...\nWe like to...", "image": "https://images.genius.com/51f742a1e8029a8aab9ccf973c564777.483x483x1.jpg"}], "artist": "The Notorious B.I.G."}