{"songs": [{"title": "40 Oz.", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro (background \"WHAT! WHAT! WHAT!\")]\nYeah nigga! It's D12 up in this motherfucker!\nYou know how we get nigga we wild in the club\nMotherfuckers, everybody get crunk in Detroit too nigga!\nSo wile the fuck out!\n\n[Hook]\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Bitch!)\n\n[Verse 1: Bizarre]\nWe fucked up\nLet us in the club\nOne of y'all niggas gon' catch a slug (Yeah)\nI'm so drunk I could hurl for a month\nAny nigga pop shit, go to the trunk\nD12 start shit, nigga come get us\n7 Mile Runyan, wild niggas with us\n'Cause all my niggas is talkin' that shit\nAin't got no problem, with smackin' no bitch\nI'll have my wife cut your throat\nBlunts, gans, that's all we smoke\nWild the fuck out, stab you with a knife\nIt's D12, nigga, we ready to fuckin' fight\n\n[Hook]\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Bitch!)\n\n[Verse 2: Eminem]\nWho tryin' to be the first one to catch this blade in the throat?\nYou know the po-po don't let me hold them toasters no mo'\nI just cut three people, you gon' be number four\nIf you don't back the fuck up, and get the fuck up off the flo'\nMy crew is takin' over as soon as we hit the do'\nYou hit the door, but we comin' in and you goin' home\nSecurity, they can't even stop us because they know\nRunyon Avenue soldiers hold us down wherever we go\nChuggin' on our 40s and holdin' up .44s\nWe come with toasters like we just opened savings and loans\nAnd we don't need your brew tonight, homie, we brought our own\nSo grab whatever you sippin' on and let's get it on!\n\n[Hook]\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Bitch!)\n\n[Verse 3: Kuniva]\nWe deep as a motherfucker, we 'bout to get it crunk\nYou just another punk in the club about to get jumped\nI settle my vendettas with AK's, Berettas\nWe don't 'posed to be in here with our weapons, but still they let us\nSwitchblade, brass knuckles, nickel plated belt buckle\nBroken beer bottles, when we walk in you can smell trouble\nElbows flyin', bitches cryin', niggas bleedin', you retreatin'\nRun into your car and skatin' off, we G'ing\nWe make example out of you haters runnin' your mouth\nYou the reason why your peoples is pourin' they 40s out\nDirty Dozen wildin', beat niggas bloodied\nAnd you gon' have to pour out a keg for all your homies\n\n[Hook]\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Bitch!)\n\n[Verse 4: Proof]\nI was raised by drunks, so I became a drunk\n80 Proof on this vodka, that's the name I want\nI'm in the club to beef, you gotta murder me dead\nOnly talk to a bitch with burgundy hair\nOr the aisle in the 'Vette, bumpin' Seven-Deuce\nSee that top on that 40, you know it's comin' loose\nSee me on the ave daily, be runnin' this shit\nIf your chick get loud, I g-money that bitch\nPackin' mags and clips, I'll smash your clique\nBecause of Proof they put the \"G\" in the alphabet\nSmokin' weed, drinkin' Henny, Remy, and that Jimmy\nDon't worry if we run out, the corner store got plenty\n\n[Hook]\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Guzzle it)\nPour your 40 out (Bitch!)", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}