{"songs": [{"title": "Stick Up (Part 2)", "album": "Legit Ballin Vol. 2", "year": null, "lyrics": "Whatcha gon' do when we come for you?\nIt's a stick up\nPut yo hands up\nTell me whatcha gon' do when we come for you?\nIt's a stick up\nPut yo hands up\n\n[Hook]\nWe came for them, now they comin' for us\nWhatcha gon' do when yo time is up?\nWe was unprepared for this lickin' plus\nWe been on the run from dawn to dust\nWrong nigga, wrong place, wrong car, wrong time\nGuess I was greedy, shoulda kept the shine\nBut it ain't nowhere to run, nowhere to hide\nFuck it, ain't givin' up nigga it's ride or die\n\n[Buck]They got us on the run now, in a high-speed chase\n\tHoldin' the Feds at gun point with no getaway place\n[Benn]Nigga look quit bitchin', I ain't even ask for yo help\n\tYou keep talkin', I'ma burn both of y'all and get away myself\n[Buck]Man them streets got roadblocks, there's choppers in the ghetto\n\tShinin' them lights on us, and them streets gettin' narrow\n\tNigga the path I chose got exposed by yo ass\n\tEither get the ?? plenty ice and more cash\n[Benn]Nigga shut the fuck up, I got another plan\n[Buck]Here we go again\n[Benn]Bust 2 warnin' shots to remind 'em, we still got it man\n\tTell 'em to lose the choppers, and if they don't we pop 'em\n\tSee all them cars behind 'em, shit I'm itchin' to stop 'em\n\tMy adrenaline's rushin', these bitches done ???\n\tRobert Taylor raised me, nigga the hood got me scarred\n[Buck]Damn Bennie, but this that real dilly\n\tAnd we done showed our asses like Mr. Billy\n\tMan here they come!!\n\nHook\n\n[Benn]Man I ain't in no joint, I got 2 strikes plenty\n\tI'm finna exit on 51st so we can get loose in a buildin'\n[Buck]Man we got a quarter tank of gas and a briefcase full of cash\n\tBack seat full of yay and the PIG's right off on our ass\n[Benn]Nigga look the yay counterfeit, remember this a hit\n\tThey was supposed to escort dude but shit the bank we done hit\n\tMan it's the only chance we got to bust shots at them hoes\n\tHand out the first meal so maybe the rest'll fold\n[Buck]Nigga you watch too many movies\n[Benn]Fuck that, it's our only chance\n\tGrab the wheel muthafucka so I can aim at the van\n[Buck]Man you stole a ride, sittin' on some shit that I ain't never seen\n\tBy you bein' too greedy, this shit still all a dream\n[Benn]Man what the fuck, you givin' up nigga I don't need that\n[Buck]But in how the fuck we supposed to get away with just two straps?\n\tNow I could see if it wasn't no choppers nigga we might can escape\n[Benn]Fuck it nigga here go the Nextel, negotiate\n\tTell 'em what we want\n[Buck]Shoot!!\n[Cop]\tHey c'mon guys, I know you guys can do better than this\n\tNow you need to slow it down\n\tWe gettin' the whole ? surrounded\n\tGot the choppers and everything\n\tWhat is it? I mean you guys can talk - c'mon let's negotiate\n\tYou guys are goin' down, I mean what is it you guys want?\n[Buck]We need a helicopter at 552 . . \n[Benn]Gimme that!!\n\tMan I'ma give you a list of 20 muthafuckaz at the MCC Buildin'\n\tIf they ain't released in 24 hours, yo boy outta here!!\n\nHook\n\n[Benn]Now you see what the fuck I'm talkin' about, they offerin' us shit\n\tThey don't give a fuck about me, you, or this Fed bitch\n\tFuck negotiatin' with them niggas, I'm finna off this nigga\n[Buck]Now what the fuck we gon have as collateral if you pop this nigga?\n\tRemember dude in the trunk, he don't really mean nothin'\n\tLook at the gas tank, Oh no lie, Bennie I'm runnin'\n[Benn]You ol' fool ass nigga, how far you think you gon' get?\n\tMan that's the whole damn state\n\tDo you know how much time we \tfacin'?\n\tBasically look at the situation, man I ain't got nothin' to lose\n\tIt damn 2001, my shorty need more shoes\n[Buck]Probable cause, duckin' from laws, used to be fun\n\tNow this'll cause us to probably to live a life on the run\n[Benn]Man this negotiatin' shit ain't workin' fast, they need to hurry\n\tWe could probably get into the buildin' but I sho' ain't certain\n[Buck]Yo was this really worth it?\n[Benn]That's some shit you shoulda asked yourself\n\tWe in to deep and ain't nothin' but action left - c'mon\n\nHook\n\n[Benn]Man what the fuck, man this muthafucka done ran outta gas man\n\tMan shut the fuck up (Man please let me go man)\n\tMan both of you muthafuckaz shut the fuck up\n\tNow I'ma ? this muthafucka and you gon' escort him in the buildin'\n\tAnd yo cover me man (I can't go in no buildin' man)\n[Buck]What about dude in the trunk man?\n[Benn]Man fuck dude in the trunk\n\tWe gon' ?? nigga you gon' escort him in the buildin'\n\tAnd stand-off till they give us what the fuck we want\n\nHook", "image": "https://images.genius.com/b61c84cf38b4d4f2133ce851fe5c6b1c.500x500x1.jpg"}], "artist": "Twista"}