{"songs": [{"title": "Simple And Plain", "album": "Rise To Power", "year": "2007-09-18", "lyrics": "[Intro]\nYeah, I'm really a nice guy, I say that to say this\nI've seen a few dirt bags i head I need to be knocked off\nI can't get to you right now, I'm under surveillance\nSo basically, the government giving you a lifeline\nBut me and my nigga finna keep it simple and plain baby\nYou know, I'ma come see you tho'\n\n\n[Verse 1]\nIt's not important how the dough made\nOr if revolvers spin like waves, in my low fade\nI'll recall coppin' work with tips my hole saved\nI'mma smack Al B. if I get no played\nNo hard feelings, I gotta ball my heart\nTime to scar the city, who ridin' with me?\nNext in line, the ballman right hand of the Don\nYour life lie right here on my palm\nAnd when you fuck up that, right there in my ball\nThug issues handled with scud missiles, fuck pistols\nCome and get me gangster, I left the doors unlocked\nAnd when terf's not around, I'm the one that call the shots\nBall the blocks, ? the Glocks, keep all the blocks\nAnd bitches ? the tops ? stop\nWe all on top ? we call the tops\nSpeak for the block, speak French for the cops\nSweet links full of rocks hit brinks for the narcs\nPig meat to the socks, Beijing bitch in the drop\nWink to the cops, we could make a bitch stop speak to the cop\n\n\n[Hook]\nSimple and plain, we comin' to it triple the game\nSniffing the caine, dipping the rain sick in the brain\nSimple and plain, we comin' to it triple the game\nCripple your fame, dip in the range, we sick in the brain\n\n\n[Verse 2]\nWho would ever think it would come down to us?\nWhen so much jealousy surrounded us\nBack to back when weaponry surrounded us\nSurvive the hit, we coming with the loudest shit\nIn the path I supply the bricks, I handle dimes and nicks\nClothes, shop around five or six\nShop for clothes, spread around five or six\nApply the rules, Arm & Hammer when we fry the fools\nSilent gooks, violent moods, Carol city it's fine as cool\nHide the tools, in a violent ? play ? rules\nYou ride with who? Allies join hands, lets unite the states\nI don't like to wait, I like to waste, celebrate, light the cake\nMake a wish and keep it to yourself\nThe way I spit, I can't keep it to myself\nTook a leap into the wealth, keep you bleedin' in yourself\nI came from semen on the shelf\n\n[Hook]\n\n[Verse3]\n? you know treadin' I walk on water\nSign autographs, have you chalk for a porter\nAny further information please contact my lawyer\nUnder surveillance, by agents across the border\nSqueeze fund from slums, to south Florida\n? and guns, throughout my quarters\nYour negative vibe, tellin' me you're beggin to die\nThe weapon will fry your left side, from your head and you die\nAK back seat and at a '75 ready to fire\nTouch me for my rollie you better be lyin'\nLet it be flyin' I'm at the head of the line\nRapper body with a head of a lion\n\n\n[Hook]", "image": "https://images.genius.com/29b46b5e6777c0cfddcc1b604d7a2597.600x600x1.jpg"}], "artist": "Rick Ross"}