{"songs": [{"title": "The Most Interesting Man", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "[Intro: Will Lyman]\nWhoo... Kid!\nHis charm is so contagious\nVaccines have been created for it\nYears ago, he built a city out of blocks\nToday, over six-hundred-thousand people live and work there\nHe is the only man to ever ace a Rorschach test\nEvery time he goes for a swim, dolphins appear\nAlien abductors have asked him to probe them! [Vincent Price laughs]\nIf he were to give you directions, you'd never get lost!\nAnd you'd arrive at least 5 minutes early\nHis legend precedes him the way lightning precedes thunder\nHe is... The Most Interesting Man in the World. [kids ovation]\n\n[Interlude: Royce da 5'9\"]\nB-E-3, GO!\n\n[Verse One: Royce da 5'9\"]\nInternational rapper flow\nThe leader of the rat pack who’s back for more\nBackpack packed that’s equipped with gats and more\nArtillery than what I had before\nPlastic explosive flow, act a ass\nLeave shit stains on the game after I pass\nWhoa, gotta get it, sickness, your ho, got it, get it\nAll I really need is one nine, na-nine, na-NOT!\nYou are about to get into the mind of a psycho\nMalcolm, looking out of the window with a rifle\nOther hand on the bible\nCut a nigga face up, make a muhfuckin' nigga look tribal\nIf he got a trigger then he prolly [probably] gonna pull it\nTil' he runs out, prolly won't sweat it, cuz' he got\nEeny meeny miney mo bullets!\nI hit the roof, do number two, Hex Murda this one's for you\nYou too, Guru, wake up, this one's for you\nHold up (AHHH!) [Wilhelm scream]\n\n[Interlude: Royce das 5'9\"]\nHit a nigga with the Jay-Z hold up, \"Hol'up!\"\nTake a drink for my niggas\nYou lil' fruit (Haha) [Vincent Prince laugh]\nThat's right, I'ma bring it from the soul, nigga\nB-E-3, GO!\n\n[Verse Two: Royce da 5'9\"]\nOnly competition's the chronic gun\nGoing simmalimma tillamimma simmalimma tillamimma\nIt's supersonic! (uh!) It takes one to know one, a killer\nGunshot (gunshot) gunshot (gunshot)\nOne, next thing you know, no one's iller\nPo po fill ya up, piss on your chinchilla\nFuck you and your tight pants (AHHH!) and that dance\nI admit, I attack fans\nTwitter beef's the shit, finna plead the fifth\nStanding in front of a hung jury with one worry\nUh, and a bitch ain't that\nPatron, Patron, come on, come on\nDrink 'til I talk to the bottle\nRoyce da 5 all spent out\nWith the 9 at the end, follows! (Damn!)\n\n[Outro: Royce da 5'9\"]\nLadies and gentlemen\nWelcome to the Bar Exam 3\nFuck you very much\nWe got Eli Porter on the guitar\nPlay it, Eli, play it! Bring it from the soul\nWe got Tay Zonday on the keys\nPlay it, Tay! Bring it from the soul\nLet Eli play something on the keys\nEli, play something on the keys\n[piano keys clunking] That's right\nWe gonna bring it from the soul, Ricky Bobby\nWhoo Kid! [DJ Whoo Kid]", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}