{"songs": [{"title": "COFFEE BEAN", "album": "ASTROWORLD", "year": "2018-08-03", "lyrics": "[Intro]\n(This is all)\nThis is all\n\n[Chorus 1]\nBad-bad news\nI'm just bad, bad news\nGood thing, the two\nBonnie and Clyde, the money and who?\nIt's bad news\nBad, bad for you\nBut I'm back on the coffee bean (Bean)\nAnything in between, yeah (This is all, this is all)\nBack of the coffee line\nBack, back, back in the bathroom line (This is all)\n\n[Verse 1]\nHow would you feel if I had you? (This is all)\nTrust me, you would be mad too (This is all)\nShawty, we can be mad cool\nJust hit me if anything past due\nYour family told you I'm a bad move (This is all)\nPlus, I'm already a black dude\nLeavin' the bathroom, my hands is half-rinsed\nIf only a nigga just had sense\nSpeaking in past tense (This is all)\nIt's been a week and a half since\nWe ain't been speaking and that meant\nYou feeling free in my absence\nI've been going through a lot behind this glass tint, yeah\n(This is all, this is all)\n\n[Chorus 2]\nBack of the coffee line\nBack, back, yeah, back in the bathroom line (This is)\nI know they told you I'd be bad for you (This is all)\nDon't worry, I'll be back for you\nAll the money and cars, stripper hoes and the tattoos\nBad news\nBack off a coffee bean, reflecting on all you see\n(This is all, this is all)\n\n[Verse 2]\nStressing over award shows\nShe's stressin' over her wardrobe (This is all)\nBought the mansion on foreclose (This is all)\nNo matter how many tickets your tour sold\nYou feel this deep in your torso\nFeel like someone's readin' your horoscope (Ooh)\nSome shit only me and the Lord knows (Ooh)\nSOS is for those who hear this in morse code (Ooh)\nToo many doors closed, cul-de-sacs and fork roads (Ooh)\nStill ended up at the North Pole\nThis is where remorse goes (This is all)\nThis shit'll have you in divorce court (Ooh)\nFighting over your seeds\nFighting over your deeds, sliding over your keys (Ooh)\nAlimony and fees (Ooh)\nAs your lawyer proceeds (Ooh-ooh-ooh)\nTo give out bad news\n\n[Chorus 1]\nI'm just bad, bad news\nGood thing, the two\nBonnie and Clyde, the money and who?\nIt's bad news\nBad, bad for you\nBut I'm back on the coffee bean anything in between\n(This is all, this is all)\nBack of the coffee line\nBack, back, back in the bathroom line, yeah (This is all)", "image": "https://images.genius.com/89e4a4dfbe3ff3a4f82963ff097ff443.1000x1000x1.jpg"}], "artist": "Travis Scott"}