{"songs": [{"title": "Gods", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro: Tech N9ne]\nGod status\nMusical, omnipotent\n\nIt's time to go, brothers\n11 years and we're finally here\nBeyond the stars, the trinity\nGod status, let's go!\n\n[Hook: Krizz Kaliko & Tech N9ne]\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe?)\nDo you believe? Do you believe?\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe)\nDo you believe? Do you believe?\nWho do you believe in?\nGods!\n\n[Verse 1: Krizz Kaliko]\nMe and Tech and them started on a quest for\nM... O-N-E-Y, we touching so many, why?\n'Cause we spiritual, feeling every syllable we spit out\nWe angels, that's the way we telling demons to get out\nSo bled out, baddest nigga representing the Mi-ddle\nFeeling like the world cannot live with-out, Ta-dow!\nNow we immortal! Somebody open up the portal!\nRap is [?] when me and Nina was caught on!\nWe God status, God threw a task at us\nTold us he make us angels but our mission's to kill the baddest\nSo we gotta blast the bastards with our rapping apparatuses\nNever let off the ravage on 'em like rabbits on radishes\nWe're like the Grateful Dead, our fans are the new dead heads\nRepeat every word we saying like it's a pled-edge\nAnd when you hear them gods and love how it sounded\nWhen you see the king, kneel to the ground, make a fist and pound it\n\n[Hook: Krizz Kaliko & Tech N9ne]\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe?)\nDo you believe? Do you believe?\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe)\nDo you believe? Do you believe?\nWho do you believe in?\nGods!\n\n[Verse 2: Kutt Calhoun]\nI told you I'm forever, didn't I?\nThe highly exalted the christen (your souls)\nThose grounded I aspire to lift 'em up\nThe holy goes through the frequency of your audio speakers\nThey're set on all that can reach us, by now we're adios\nWitness the blessings, beliefs and hopefulness I bestow\nUpon a fan or foe, man or those opposing the Chanet growth\nI plant it so everyone on the planet can evoke\nThe entity sent to be this music industries' manifold\nI manifested; it's been suggested that I arose up\nFrom under the sheets of God's baby cradle sent down to pose\nA threat to Masonic rappers, protest against moral lackage\nInvested in this infested depiction of worldwide gibberish\nS-suffer no more here it is, a little experiment with Jesus\nBlood and mortal when the spirit mix\nDrink it, it's so refreshing - just like the air of my message\nThe breeze carries and once you inhale it\nThen I will ask you\n\n[Hook: Krizz Kaliko & Tech N9ne]\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe?)\nDo you believe? Do you believe?\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe)\nDo you believe? Do you believe?\nWho do you believe in?\nGods!\n\n[Verse 3: Tech N9ne]\nExalted, bosses, can't off his office with crosses\nThat's what he fought within darkness' mosses\nNo caustic losses 'cause the brain's embossed with the word auspiciousness\nFeed my fam flows fluidly, they would never leave my land no truancy\n'Cause I am the reason they stand for unity\nUnlike me with whackness you give your fans no immunity\nI am the air they share, I am the heir to the throne\nWhere no compare in my own zone, this lair is home grown\nIt's rare but it's on strong\nBeware: long gone if you dare got the wrong tone\nNow! We are beyond those who got fame\nGave my heart and many souls were obtained\nSo my lane will definitely not change\nCause G.O.D.S. means the Great Omnipotent Doc Strange\n\n[Hook: Krizz Kaliko & Tech N9ne]\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe?)\nDo you believe? Do you believe?\nWho do you believe in?\nIs it he, is it me? W-E, them G-O-Ds?\n(Do you believe, believe, believe)\nDo you believe? Do you believe?\nWho do you believe in?\nGods!\n\n[Outro]\nStrange Music", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}