{"songs": [{"title": "Stoplight", "album": "Paid Tha Cost To Be Da Bo$$", "year": "2002-11-26", "lyrics": "[Intro]\nHow else could you capture the world\nIf you don't attack from the back\nTo the million march... hehehehe\n(Yo, Snoopa Donna - what?)\n\n[Hook]\nWhen I pull up to the stoplight\nI gotta have the paper right (paper right)\nAnd if you come back right then we can boogie, boogie, boogie\nWhen I pull up to the stoplight\nI gotta have the paper right (paper right)\nAnd if you come back right then we can boogie, boogie, boogie\n\n[Snoop Dogg]\nBoogie boogie boogie.. I'm goin 65, 75, 80\nMashin down the boulevard downtown movin like crazy\nIn the fast lane, High beams shinin\nTryna keep the timin on the track with the diamond in the back\nMoon roof wide open, scopin, loc'in\nThe bitches believe, the hoes keep hopin\nThey can get it, fit in, back seat, just sit in\nFo' hoes on the block tryna put they bid in\nGirl put it to work, you gon' do the damn thing\nHop in, the rest of y'all eat dirt\nI'm rollin in the Mackmobile, I'm back for real\nOne hundred percent, pimp-motion, that's the deal\nBack wheel spinnin, number one I'm winnin\nHoes lookin inside, and they just to grinnin\nWaitin to choose, while the rest wait to pay y'all dues\nDon't trip I keep my hoes in two\n\n[Hook]\n\n[Interlude]\nYeah, this is radio station 187.4 FM on your dial\nAnd you're caught up inside the five o'clock traffic jam\nWe gon' be taking requests right now at 87752-Snoop\nCall the station namin' ya game...\nAh, yeah, hello, ah yeah, this Soopafly here\nMan I wanna get a piece of that Stoplight shit\nMan that motherfuckin bangin church\n\n[Snoop Dogg]\nYou see them pretty buttons on my stereo?\n(Yea can I touch it?) Don't touch 'em ho!\nYou see Snoop Dogg on the floor mac\nPimpin ain't DEEEAD, now sit the fuck back\nI'm the man in charge, +Boss+, my backhand is hard\nSimple slim, man I'm large\nMashin so big like a fo' by fo'\nShow my do', and if not it's ho by go\nAin't a ho out there that can slow my flow\nMy wheels cost a fortune, bitch I'm scorchin\nSeen some niggas who love to talk shit\nReach for my thang in my glove compartment\nDidn't have to use it, blasted my music\nKids in the streets askin - Doggy how I dooze it?\nFirst place in the race and don't wanna lose it\nNiggas better watch out and bitches better mooooove it\n\n[Interlude 2]\nYeah baby, you gots ta move your groove\nTo prove that you supposed to groove in the move\nAs I recite naughty nothings in yo' eardrums\nIf you cruisin up the boulevard in your car\nPut it in park and let the Dogg spark\nYeah baby!\n\n[Hook] - repeat 2X\n\n[Interlude 3]\nOhhhhhhh noooooo, not the track of funk!\nI am Sir Dunk, DPG Funk\nAnd I hate Stoplight!\nI always ran to the next like a Minnie\nI told you I wouldn't C-Walk\nLet me out, yarhhhhhhhhhhhhhhh!\n\n[Snoop Dogg]\nHalf past late and I'm still rollin\nReal ho'n, make a nigga pocket still swollen\nStill goin, black and white tip-toe'n\nFlashin my player's card (why you play so hard?)\nCause I'mma Don, sippin Moet, smokin chron'\nDoggy wanna see that dress my loc's are on\nPimp from black-red, brunette back to blonde\nCan't tell the sunset from the crack of dawn\nHalf tank of gas\nRollin' down the window, reach out and spank that ass\nGettin hot, turn down the heat, burn down the street\nMy hoes love to earn my keep\nIt's only five miles left, so I whipped it\nSkipped it, flipped it in ovedrive\nStraight bonafide pimp nigga on the rise\n85, 95, 100 and good night and fuck that stoplight!\n\n{*car crashes*}", "image": "https://images.genius.com/020258c5b50e382d2763d8439947dad4.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}