{"songs": [{"title": "Light Years", "album": "Dedication 6: Reloaded", "year": "2018-01-26", "lyrics": "[Intro: Lil Wayne]\nThey give her bread, I give her head\nI'm light years ahead, gone\nThey give her bread, I give her head\nI'm light years ahead, gone\n\n[Chorus: Lil Wayne]\nI know she gon' hold the gun for me\nHold it down in court, and hold her tongue for me\nShe swallow all my kids, then pop a gun for me\nMakes some runs for me, all the way cross country\nShe love me, she even rep the blood for me\nI said the plug trippin'\nShe gon' pull the plug for me, I love it\nAnd all she know is Young Money\nHer ex is always trippin', nigga is too clumsy\n\n[Verse: Lil Wayne]\nMake up on the pillow, make me wanna kill her\nBut she naked in the villa, taking E I call it Sheila\nI took half of a half, she took 3 like Reggie Miller\nI just feel her like chinchilla, had to kill her, Bryson Tiller\nI know they gon' play this over, ankles on my shoulder\nMy face all in her chocha, for my bae go South Dakota\nBut my bae go even lower on that roller coaster\nShe just want a Tesla roadster, I'ma get her somethin' slower\nBet a Bentley Truck to show her, tinted up to hide her ass\nWho in that Wraith behind her ass, you ain't even got to ask\nShe ain't even gotta dance, thinkin' boutta a wider ass\nAnd she already gotta an ass, leave it in the doctor hands\nOther niggas, not a chance, she already gotta dare\nWhen I be in and out your ass, baby you sound like jazz\nYou ask me can your partner crash, you ain't even gotta ask\nI'm breaking out the powder bags, turn into Iron Man\nWhat happens in this house stays in this house\nDon't worry 'bout that\nIf what happens in this house gets out\nGo check your girl 'bout that\nI'm 'bout to put you in my will, where my attorney at\nI ain't the type to turn my back, got every type of Percocet\nI'm working with the perfect bitch, her body like 187\nThen we come together, then we cum together\nRainy weather, ain't it heaven\nAin't no telling what I think, I think I'm ready\nMy lil married homie Terry talking 'bout a gangster wedding\nOh my god\n\n[Chorus: Lil Wayne]\nI know she gon' hold the gun for me\nHold it down in court, and hold her tongue for me\nShe swallow all my kids, then pop a gun for me\nMakes some runs for me, all the way cross country\nShe love me, even rep the blood for me\nI said the plug trippin'\nShe gon' pull the plug for me, I love it\nAnd all she know is Young Money\nHer ex is always trippin', nigga is too clumsy\n\n[Bridge: Lil Wayne]\nGoddamn\nHe give her bread, I give her head, I'm light years ahead, pyoom\nHe give her bread, I give her head, I'm light years ahead, pyoom\nHe give her bread, I give her head, I'm light years ahead, gone\nHe give her bread, I give her head, I'm light years ahead, gone\nShe lie in the bed, I lie in the bed, the shower instead, yeah\nWe got out of the shower, got back to the bed\nThat's flowers in bed, that's magic\nShe lie in the bed, then cry in the bed, I lie on her leg, damn\nSee they give her bread, I give her head, I'm light years ahead, pyoom\n\n[Chorus: Lil Wayne]\nI know she gon' hold a gun for me\nAlways down in court and hold her tongue for me\nShe swallow all my kids and pop her gun for me\nMake some runs for me, all the way across country\nShe love me, yeah\nEven wrap the blunt for me\nShe gon' pull the gun for me\nAll she know is Young Money\nEx is always trippin' niggas too clumsy, Goddamn\n\n[Outro: Lil Wayne]\nThey give her bread, I give her head\nI'm light years ahead, gone\n\n[Skit: Lil Wayne]\nMy favorite person to debate sports with is, um, Skip Bayless off top. Like Skip Bayless, that's just the homie, you know what I mean. Like when I say the homie, I mean, like when you goin' to Skip Bayless, when I go to the Skip Bayless show, there's always more conversation off camera, and its always like he can't wait for them to say 3,2,1 and we off. For him to engage in a, um, more whatever, realer conversation, I don't know if real is the right word, a more real conversation, just things like that, so you know\nMy favorite person to debate sports with Skip Bayless. I do have a second favorite as well, if it's not even a second favorite, but another favorite person I love to debate sports with: Max Kellerman. That's my dude. Love to debate sports with Max Kellerman, that's my slime. And every time I go on his show, he always got a verse for me. You know what I mean, that's the homie\nI'ma be alright", "image": "https://images.genius.com/3622689a5172c789024942436b11dce2.800x800x1.jpg"}], "artist": "Lil Wayne"}