{"songs": [{"title": "Doctor’s Advocate", "album": "Doctor’s Advocate", "year": "2006-11-14", "lyrics": "[Intro: Game & Busta Rhymes]\n(Day after day, feel like I...)\nG: Yo Bus, I think I got it..the answer to all my problems\nB: Fuck you talkin' about nigga? Wha-whats that?\nG: Belvedere and Banana Snapple\nB: Look, get your fuckin' ass up nigga\nYou over here trippin' on yourself nigga\nGet in the fuckin' car man, we gotta bounce man\nG: I'm a man...and most of these niggas, they don't know how to be a man. I got a son...\nB: What the fuck you talkin' about nigga?\nCome on nigga, lets take yo' ass to the crib man, you tired nigga\nAnd put the drink down nigga. We gotta go nigga\nG: One more shot\n\n[Chorus: Shorty of Da Lench Mob]\nI didn't mean to walk away\nBut I hear every word they say\nI guess my mind just drew a blank, like la-la-la\nNow I'm sittin' in this god damned cage\nRreminiscin' about my day with your blood all over my slate\nAs the devil sings la-la-la\n\n[Verse 1: Game]\nDre, I ain't mean to turn my back on you\nBut I'm a man, and sometimes a man, do what he gotta do\nRemember, I'm from Compton too\nI saw you and Eazy in 'em, so I started wearin' Khaki suits\nI was 12 smokin' chronic, in '92\nI had a choice, be like Mike, or be like you\nI made a choice, now its be Crip or be Piru\nWhatever I was, I was bangin' Gin & Juice\nNever knew back then, I'd be friends with Snoop\nNow I gotta keep it gangsta, 'cause its in my roots\nSo I owe you my life, when I betrayed you\nI tried to think of what the fuck, Eminem might do\nIf every nigga hated him, for the Black Bitch track\nAnd niggas stopped bumpin' Dre after Dee Barnes got slapped\nWhen Doc say its a wrap, its a wrap\nIts still Aftermath, and ain't nothing after that\n\n[Chorus: Shorty of Da Lench Mob]\nI didn't mean to walk away\nBut I hear every word they say\nI guess my mind just drew a blank, like la-la-la\nNow I'm sittin' in this god damned cage\nRreminiscin' about my day with your blood all over my slate\nAs the devil sings la-la-la\n\n[Verse 2: Game]\nI never said Thank You, and I took for granted\nYou let me in your house, and made me a part of your family\nNow I'm eatin' with you, Eve, and Busta Rhymes\nI wasn't starstruck, I was just glad to be signed\nAnd even though sometimes I run loose\nYou still my homeboy Doc, I'd take a bullet for you\nI'm not askin' you to take my side in the beef\nBut you told me it was okay to say Fuck The Police\nNow its my turn to carry the torch\nAnd I still got the chain that you wore on the cover of The Source\nRemember when we got drunk, to do Start From Scratch?\nI told you, you was like a father to me I meant that\nSittin' here lookin' at my platinum plaques\nThinkin' what the fuck am I without a Doctor Dre track\nWhen Doc say its a wrap, its a wrap\nIts still Aftermath, and ain't nothin' after that\n\n[Chorus: Shorty of Da Lench Mob]\nI didn't mean to walk away\nBut I hear every word they say\nI guess my mind just drew a blank, like la-la-la\nNow I'm sittin' in this god damned cage\nRreminiscin' about my day with your blood all over my slate\nAs the devil sings la-la-la\n\n[Verse 3: Busta Rhymes]\nSee when the world is on your shoulder and the stress grows bigger\nThe fire in 'em, made it difficult to talk to the nigga\nMost of the time I let 'em know, I don't agree with what he do\nBut he a hardhead Dre, that's why I'm talkin' to you\nSee, when I first met my nigga, son was layin' in the cut\nType reserved, homie was quite and kept his mouth shut\nUntil you told him to spit for me, he flippin' from the gut\nI dug his spirit, and I thought the dude was talented as fuck\nAs time went on, now he was workin' with the finest\nI saw the pressure started to build, so I gave additional guidance\nYou gave him something that can make or break a nigga, you should face it\nSo big, I don't even think he was ready to embrace it\nWith the potential to be a strong nigga with conviction\nThe only problem was our little nigga wouldn't listen\nBut when Doc say its a wrap, it's a wrap\nIts still Aftermath and ain't nothing after that\n\n[Chorus: Shorty of Da Lench Mob]\nI didn't mean to walk away\nBut I hear every word they say\nI guess my mind just drew a blank, like la-la-la\nNow I'm sittin' in this god damned cage\nRreminiscin' about my day with your blood all over my slate\nAs the devil sings la-la-la\n\n[Outro: Game & Busta Rhymes]\nB: Aiyo, Game! Aiyo Game! Wake up, nigga!\nG: I'm up man, I'm up\nB: We at your crib, nigga, get the fuck out the car nigga, get up, man!\nG: This ain't my house... my house is.. is green..\nB: The fuck you talk- look, come on, nigga, let's go man\nLet me walk you up to the.. come on...\nB: Nigga where the keys at, nigga we need to open your door nigga!\nG: I got love for you, Bus', you my nigga\nB: Nigga get in the fuckin' bed nigga, go to sleep nigga You tired nigga and don't fucking drink like that no more, man\nYou fuckin' look like Ned the Wino, you drunk motherfucker\nG: Just goin' to the studio\nB: Go to sleep, nigga", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg"}], "artist": "The Game"}