{"songs": [{"title": "Drop Top Wizop Freestyle", "album": null, "year": "2017-04-03", "lyrics": "[Intro]\nHuh, Drop Top Wop (skrt)\nHa\n\n[Verse]\nTell the valet to be careful, when he park my whip\nHol' up, he don't even look like he can park my whip\nJump out right in front of the club like I own this bitch\nWho that ridin' with cha? Oh, that's just the dopeman bitch\nGot my arm out the window showin' off my wrist\nGot the top chopped off like I ain't got good sense\nCall me Vert Gucci, it's a lotta niggas wanna murk Gucci\nNo Gucci, not the old Gucci, not the fat Gucci\nPlease don't bring him back, not the old Big Cat Gucci\nStanding in the trap, use a eggbeater that Gucci\nThis ain't hip hop this is drug dealer music\nI won’t give a fuck if you don’t listen to it\nSee this one for my nigga just came home and did a ten piece\nNow he on some M's in the Flame every Wednesday\nZone 6, 5 plus the fucked up penitentiary\nIf you ain't signed to 1017, you against me\nAnd I ain't got no friends, I ain't motherfucking friendly\nIf you ain't got more money than me you can't really diss me\nThis the type of vibe, make a trapper buy a Bentley\nKnow you tryna tempt me but ain't nobody listenin'\nSee, when I walk on stage they give me a quarter ticket\nMy watch a quarter ticket, I'm givin' them the business\nAll my artists dipped, guess they thought it was over\nI knew they'd all jump ship cause they was part time soldiers\nGucci Mane LaFlare and I will never roll over\nYou act like you's my man but you's a cold heart cobra\nI think these fools forgot that I'm a self-made mogul\nNo hard top, drop top, Lambo, doors up\nSoft top, Rolls-Royce, white bitch, dough up\nGot grown men wanna be like Gucci when they grow up\nMaybach, backseat, no shirt iced up\nWhite Ghost, no sir not mine all hers\nDouble R, new truck all white mink floor\nBenz Jeep, all red, red rims, trap car\nWhite Range, small change that's my everyday car\nGod take my breath away if all of them ain’t paid for\nWhy the call you Drop Top? What I need a top for?\nKnown to drip excessively that's what she brought the mop for\nWhy they call you Guwop? 'Cause a lotta guap, bra\nHaters done tried everything but ain't no way to stop us", "image": "https://images.genius.com/38c58b1f51607da5837467606794e519.500x500x1.jpg"}], "artist": "Gucci Mane"}