{"songs": [{"title": "Invasion Of Flat Booty Bitches", "album": "Raw, Uncut and X-Rated", "year": "1986-11-05", "lyrics": "[Intro]\nBaby, check this out!\nYeah, you\nI wanna ask you a question:\nWhere is your ass?\nBaby, what happened?\n\n[Verse 1]\nA nigga like me I know what's up\nI want a nasty bitch with a lot of butt\nIf I can't find one anywhere\nIt turns my dreams to nightmares\nBaby right there ain't got no ass\nBut she's OK if she's got cash\n\n[Chorus]\nBitches, bitches, bitches\nInvasion of the Flat Booty Bitches\n\n[Verse 2]\nI'll tell you 'bout a day that I had\nSeen nothin but bitches with no ass\nI woke up early feeling shabby\nGot juiced up with a big fat Cabby\nCuz every morning you know I have\nA big fat Cabby and a nice hot bath\nJust soakin, smokin, Sir Too Short\nThinkin about the day before\nThirty minutes after I woke out\nI pulled a freak and took her to the house\nShe was hella young, with alotta butt\nShe sucked my dick and then we fucked\nThat [?] tight pussy, I wouldn't pass\nA light-skinned freak with so much ass\nAt 1 P.M. I was fuckin away\nI wanna do the same thing again today\nI want bitches, bitches, and more bitches\nInvasion of the Flat Booty Bitches\n\n[Verse 3]\nThe day my story made itself\nEvery bitch I saw was flat as hell\nI told myself I must need glasses\nWhere's them bitches with the big round asses\nMe and my group just wanna be tough\nFreak two bitches then switch 'em up\nIt was 3:35, the strip was lit\nEvery two blocks I seen a bitch\nBut that ain't nuthin' but a cap\nNone of them bitches didn't have no ass\nWaitin' on the bus, some was walkin'\nMe and my homie just started talkin'\nI said \"Homie, she looks good\"\nHe said that ass is flat as wood\nI said what about Vicky in the black\nHe said, Short, she's all that\n\n[Chorus]\n\nThe Invasion was on...\n\n[Verse 4]\nEvery single day of the week\nFor every nigga living there's a freak\nIf you've got game and a bed\nWhy not get fucked and get some head\nCuz bitches all over wanna get worked\nI just need one with alotta turf\nMe and my homie, rollin' and smokin'\nFlat booty bitches took over Oakland\nI told my homie, I hate to say\nAll the bitches with booties stayed home today\nAnd he said Short, what now?\nPut the pedal to the metal and hit the B-Town\nI thought them bitches out there was fine\nBut the invasion was on and it fucked my mind\n\n[Chorus]\n\n[Verse 5]\nWe hit the B-Town like Oakland players\nI knew it, bitches was everywhere\nThe first one had tits so fat\nBut that don't work, her ass was flat\nThe second bitch was flat too\nI capped on her like a motherfuckin fool\nI said \"Biatch!\" I know I'm cappin\nWhere's your ass, baby what happened\nShe turned around and capped on me\nShe said, fuck you nigga, where's your teeth\nI damn near fell jumpin out the car\nBut I slapped that bitch, and slapped her hard\nMy homie said Short we gots to cut\nBut I was kickin that bitch in her big flat butt\nI kicked her ass, got in the ride\nLooked at the bitch and said bye bye\n\n[Chorus]\n\nThe invasion was on..\n\n[Verse 6]\nWe parked the car and took a walk\nI saw another bitch and I had to talk\nI said baby, baby, baby come here\nYeah you baby with your long long hair\nBaby came over from across the street\nShe was standin on the corner just talking to me\nI was spittin' the game but I talked too fast\nCuz I didn't even notice that big flat ass\nShit, and I was ready to go\nWe was rollin back to the O\nI told that bitch I changed my mind\nShe looked at me and she said why?\nI said I'm Sir Too Short, the Oakland player\nI'm not one of them niggas who don't care\nIt's no thang to do my duty\nBut not with you and yo flat booty\nFlat ain't the [?] superstar\nI could see if you was white, but you're black as tar\n\n[Chorus]\n\n[Verse 7]\nIn the Berkeley temp, what did we find?\nFreak after freak with no behind\nOne long day, I never got in\nI'm glad that shit never happened again\n\n[Outro]\nInvasion of the Flat Booty Bitches\nDamn, I must be dreamin\nInvasion of the Flat Booty Bitches\nWake me up 'fore I start screaming\nInvasion of the Flat Booty Bitches\nWhat's this world comin to?\nInvasion of the Flat Booty Bitches\nWhere's your ass, what happened to you?\nInvasion of the Flat Booty Bitches\nThe invasion is on...", "image": "https://images.genius.com/5596228ae8537847e97db188cbe62640.1000x952x1.jpg"}], "artist": "Too $hort"}