{"songs": [{"title": "New York, New York", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Intro]\nTurn the beat up, yeah\n\n[Verse]\nNew York, New York; wake up LA\nWave hi to the Chi, let's get right today\nI heard them lil' niggas takin' their life away\nI heard a couple lil' niggas got life today\nIs it Farrakhan, Buddha, or Christ today?\nShe on her knees so she know what it's like to pray\nShe got religious so she doin' it twice a day\nI strap up, no I ain't throwin' dice today\nWhen you got money on yo' head it's a price to pay\nAnd it get cold in the hood, put your ice away\nThey locked Rick Ross up and they ain't give him no bail\nBut a cracker shoot a whole church up and it's \"Oh well\"\nOh well, oh well\nHang him with a confederate flag in his cell\nLet him sit there and rot 'til his body turns to bones\nJust remember who casted the first stone\nNew York, New York; good morning LA\nSay hi to the Chi, celebrate with the Bay\nNo hesitation like Steph, shoot it right in your face\n'Cause I'm a Golden State warrior strapped with a K\nHow's it land of the free, when we're trapped in a cage?\nSome shit just never make sense like Magic and AIDS\nSome shit just never make sense like bashin' the gays\nObama must be in the city, it's traffic today\nNiggas trappin' today just like back in the day\nWe like Roc-A-Fella Records, we packagin' yay\nAnd that Dirty Sprite 2 shit slappin' today\nWe got these niggas boxed in like Cassius Clay\nAnd my Ferragamo belt where that ratchet stay\n'Cause the police killing too many blacks today\nI wake up in the morning like: \"Who gon' pass away?\nWho gon' blast today? Who gon' have to pray?\"\nNew York, New York; good morning LA\nMy nigga Hayes blew him and his wife away\n\n[Outro]\nThis song is dedicated to Stephanie Mosley, who was murdered from a single gunshot wound inflicted by her husband, Earl Hayes, in Los Angeles, California; December 18th, 2014\nI knew Hayes since we were both signed to Aftermath back in 2005\nAnd if I can keep it 8 more than 92 with you, he was a good nigga\nI never saw that coming\nMy prayers are with Stephanie's entire family\nI am truly and deeply sorry for your loss", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}