{"songs": [{"title": "The Breakup", "album": null, "year": null, "lyrics": "Hey, Hey, Hey Come on in baby (Hey Baby)\nHey, what's goin on (Okay How you doin'? Just been out running around, and what you up to?)\nYeah I'm doin' good gon' sit down let me take your coat (ok)\nYou know they make this little jacket in leather don't you? (Oh they do so you gon' get it for me?)\nYeah, let me gon' and hang it up for you, gon' and sit down (How you doin'?)\nI'm doin' good, I'm doin' good...I'm doin' so good That bitch I followed you today!\n(What nigga? Is you crazy? What you mean you followed me?!)\nYeah, nah don't gon stutterin now de-de-de-de-de yo ass, gon' and sit down (What is wrong wit you?)\nYeah I followed you today... (You ain't follow nobody.)\nYou had just came out the chicken place, you gat you a 6-piece wing wit a greenbean and yam\nBitch I seen what you had ordered (Nigga you ain't see shit.)\nYou had dat ol monkey ass nigga wit you (You the only monkey ass nigga I know!)\nThis nigga had baby powder on his chest wit a whole bunch of little kinked up necklaces and shit wit\n\"I love you mom and dad\" and fake uzis and shit\nConnected to the chain (You talkin' 'bout yo'self ol' extra regular ass nigga.)\nNow see my first reaction was to run up on you and just grab the back of yo pants and give you a wedgie\n(Oh but you know, you know better though) Just\nPut the thong all up in your ass (Don't touch nobody...Dont touch me)\nBut I said naw, bitch I said naw\n(Don't wanna be dealin' wit yo ass, you need to stop talkin' to me crazy faggot!)\nAnd then had the nerve, you had the nerve to go get yo' hair cut down low like a nigga...\nBitch yo head look like a dirty tennis ball now!!!\n(Do you talk to yo mama like this that's why dont like yo' ass either!)\nYou the only bitch I know right now to this day that take a pair of dirty pants\nOut tha clothes hamper and iron 'em till they look like blue leather\nPants, nigga just iron chicken stains and jelly stains all in the ass of the pants...\n(You wanna talk about somebody jeans but nigga you can't spray cologne\nOver dirty ass clothes, okay you betta watch yo back nigga I'm a have you touched!)\nBitch how you gon have me killed with $439 a month?! (Somebody need to have you killed ol sorry ass.)\nBitch if you have me killed you gettin' kicked out the house, period!\n(Nigga shut up you suck, okay, always talkin' shit, make me sick which your broke ass. You\nAin't got shit, you ain't shit, your feet sucked nigga your nasty\nYou dirty, you look bad, you talk stupid, you dumb...\nSay this shit to T.I", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}