{"songs": [{"title": "Welcome to Strangeland", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro: Tech N9ne]\nI've landed, but which way now to go?\n'Cause it's Strangeland everything goes up vertical above the clouds I flow\nHow I got here I don't really know or remember like The Alamo\nSo to give me direction on this journey is Big Krizz Kaliko\n\n[Verse 1: Krizz Kaliko]\nNow here is a beautiful world for you to enter\nYou can hear how we kill everyone, we're Helter Skelter\nOn this fear that is fearing us spear chuckers that love to bust\nShear stroke of genius since we appeared out the penis\nWe just the lost boys like we sons of Donald Sutherland\nWe done struggling we forced our way in and forced to weigh in\nThe big swinging cocks of rap, R&B and rock\nWe been seeing lots of cats copying ya not\nThem G-O-D's and we can bless ya like we was a pastor\nWe past ya long ago ya concentrate on rapping faster\nThis is the temple of making it look simple to y'all\nI wasn't really into rap or in the rap 'cause I seen too many flaws\nWhy they fall for Strangeland go up filled with streams of Caribou Lou\nFill ya cup and toast how they blow up\nMy team captain is you Nina I'm the first lieutenant\nEnjoy your visit this is Strangeland that you invented\n\n[Hook: Krizz Kaliko]\nWelcome!\nWelcome to Strangeland\nThis is for everyone around the world\nThe women and the boys and girls are welcome!\nThis is the Strangeland\nAnd it don't matter what you listen to\nWe got all the [?] for you so welcome!\nWe'd like to welcome you\nIf you're new then you're overdue\nTake a quick peeking overview\nLet the strangers take over you\nWe'd like to welcome you\nIf you're new then you're overdue\nTake a quick peeking overview\nLet the strangers take over you\n\n[Verse 2: Tech N9ne]\nWow, Juggalos, Kottonmouth Kings and Queens\nGangbangers, metalheads and the college kids\nThen everything in between\nThey love when Tech spitting, know he's the best ripping\nBlessed this when all of these titles can equal technician\nSo let's get it into some retro Tech's vision\nComplex written scripts are always sex driven\nBehold us we've had it so rough so what's the slogan we have at Strangeland?\nIt goes up!\nWhen I ask you what goes up mane if it's all good then you say that it goes\nMane if it's no, you simply just say that it don't, then I'mma label you foe\nThat's when they hit the flow if you hating in my land we can throw\nBut I prefer with drinking 'Bou Lou that's cold\nThen hit the vertical path and get on these hoes\nI love it Eep Op Ork Ah Ah\nEven if you're brand new come meat shock your faja\nAnd I'm looking for the girls with them deep bra's more tatas\nOn the vertical then get horizontal then I'mma beat up your nana\n\n[Hook: Krizz Kaliko]\nWelcome!\nWelcome to Strangeland\nThis is for everyone around the world\nThe women and the boys and girls are welcome!\nThis is the Strangeland\nAnd it don't matter what you listen to\nWe got all the [?] for you so welcome!\nWe'd like to welcome you\nIf you're new then you're overdue\nTake a quick peeking overview\nLet the strangers take over you\nWe'd like to welcome you\nIf you're new then you're overdue\nTake a quick peeking overview\nLet the strangers take over you", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}