{"songs": [{"title": "Turd In The Oven", "album": null, "year": "2010-01-05", "lyrics": "[Intro]\nI do not talk, I am just a rapper\n\n[Verse 1]\nC.G. but I'm real light talk\nI know these motherfuckers wish I'd turn my mic off\nFuckin' Teddy Roosevelt\nBig stick, walk soft\nOn top of this hill of pussy where I get my rocks off\nYeah my raps kill laundry\nKnock socks off\nRappers think they're on the court\nAll they do is trash talk\nBut I do not talk, I am just a rapper\nHe's rapping over indie songs? This is a disaster!\nBut I made it dope like I'm cookin' in the kitchen\nAnd these niggas couldn't see me now I'm fuckin' with they vision\nAnd these bitches wasn't listening\nNow they fucking listening\nShoot from the hip, motherfucker I'm a hipster\nDo big things like a whale is your sister\nBitches get all dolled up, Westminster\nFake niggas ain't happy, are ya dude?\nMore raps than vegetarian barbecues\nCan't learn, this rapping has to be part of you\nBig dog, I'm steady reppin', I'm Marmaduke\nAnd I'm trying to do\nEverything\nSick Boy\nMedicine\nAnd I kill beef\nBurger King\nElroy, and I jettison\nOut the atmosphere\nI was always here\nGirls tremble when they see me like it's cold in there\nI do not talk don't chat neither\nIf it ain't about me then you shouldn't talk either\nBambi mixtape got poppin'\nAll the super late girls asking when the album droppin\nIf you ain't gettin yours then you better get something\nMy shit hot shit like turd in the oven\n\n[Verse 2]\nMy mouth drops classics\nLips are historic\nTongue is amazing\nAsk your clitoris\nUnderground king like the young Bun B\nAnd these haters are pussy so they should love me\nCuz I'm so T-I-T-E\nNiggas can't believe that my shit is free\nIndie rap niggas smoke purp, drink tea\nNigga, pop quiz: what you know about me?\nAnd what you should know, I do a lot of this\nI mean business, I'm the Economist\nBig bad wolf, blowing over your cottages\nNigga on Twitter, but ain't easy to follow this\nI'm dropping new shit, like the early bird\nShout out to Silver Lake\nShout out to Williamsburg\nTo all my Slick Rick kids looking dapper\nDo your thing and you are just a rapper", "image": "https://images.genius.com/71b32f259d92f0db0dfeba38136bbd3e.320x320x1.jpg"}], "artist": "Childish Gambino"}