{"songs": [{"title": "Never B Peace", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Verse 1: 2Pac]\nNow of course I want peace on the streets, but realistically\nPaintin' perfect pictures ain't never worked, my misery\nWas so deep, couldn't sleep through all my pressures\nIn my quest for cash I learned fast, usin' violent measures\nMemories of adolescent years, there was unity\nBut after puberty, we brought war to our community\nSo many bodies droppin', it's gotta stop, I wanna help\nBut still I'm steppin', keep my weapon, must protect myself\nThe promise of a better tomorrow ain't never reached me\nPlus my teachers was too petrified in class to teach me\nSippin' Thunderbird and grape Kool-Aid, callin' Earl\nSince my stomach was empty it seduced me to fuck the world\nWatch my lil' homies lose they childhoods to guns\nNobody cries no more, ‘cause we all die for fun\nSo why you ask me if I want peace if you can't grant it?\nNiggas fightin' across the whole planet\nSo it could never be peace\n\n[Hook: 2Pac]\nWill there ever be peace, or are we all, just headed for doom?\nStill consumed by the beast?\nAnd I know there'll never be peace\nThat's why I keep my pistol when I walk the streets\n‘Cause there could never be peace\n\n[Verse 2: Kastro]\nSomebody owes me. Will they control me? Not\nI ain't a hater player, but I want all you got\nY'all babies had babies, now we fightin' each other\nMy dawgs got frabies, they bitin' each other\nAnd it ain't hard to find a friend like mine\nBigfully is a bullet and he don't mind dyin'\nAnd I gotta be blind, missed sign after sign\nTime after time after time after time\nAnd I don't like nobody, they don't like me more\nAnd I'm good with that finally, but they heard it before\nDawg, we livin' in a prison, losin' our religion\nOn Thanksgivin' we thankful, just for livin' in Hell\nDamn, homie, I don't mean to be harsh\nBut there's a devil in the ghetto tryin' to tear it apart\nAnd if we make it up out, we still stuck in the dark\nWill there ever be peace? Just a piece of my heart. Never!\n\n[Interlude: Outlawz]\nThe only peace we got is a piece of our heart, piece of our mind, or that damn piece that we hold in our waistline\nYou feel me, dawg? C'mon, uhh\n\n[Middle hook: 2Pac]\nSo will there ever be peace\nOr are we all just headed for doom?\nStill consumed by the beast?\nAnd I know there'll never be peace (never)\nThat's why I keep my pistol when I walk the streets\n‘Cause there'll never be peace\n\n[Verse 3: E.D.I.]\nThangs is changin', nigga, you better read the signs\nI'm only concerned about me and mine in these times\nThe world is a ghetto and peace is not a part of it\nWe all believe God's new plan to make it out of this\nNiggas spendin' too much time hatin' on each other\nNiggas buyin' guns, loadin' 'em up, aimin' at each other\nAnd the victim is you and me, it's sick, but it's true indeed\nThe good die, mostly over bullshit, repeatedly\nDeep in me there's a part that wants nothing but love\nBut the rest of me know, war is what's waitin' for us\nSo I stays ready, keep my pay heavy and boss up\nStack my funds and my guns, never rely on luck\nAskin' God to point out the impostor\nNever let no weapon formed against me prosper\n‘Cause there'll never be peace, so don't rely on it, soldiers dyin' for it, and in the ghetto, they cryin' for it. But fuck peace!\n\n[Final hook: 2Pac]\nWill there ever be peace, or are we all just, headed for doom?still consumed by the beast?\nAnd I know there'll never be peace\nThat's why I keep my pistol when I walk the streets\nFool, there'll never be peace\nWill there ever be peace, or are we all just, headed for doom?still consumed by the beast?\nAnd I know there'll never be peace\nThat's why I keep my pistol when I walk the streets\nNigga, there'll never be peace\nWill there ever be peace, or are we all just, headed for doom?still consumed by the beast?\nAnd I know there'll never be peace\nThat's why I keep my pistol when I walk the streets\nNigga, there'll never be peace\nWill there ever be peace?\n\n[Outro: 2Pac]\nWill there ever be peace? Shit, fuck peace!\nOn the strength 'til my niggas get a piece, we can't have peace\nHow the fuck we gon' live happy when we ain't got nothing?\nYou motherfuckers are smilin', but I'm mean muggin'\nWhy? ‘Cause I gotta be thuggin'\nIt seems drugs done turned this whole mothafuckin' hood out\nAll us niggas actin' up, wild-ass motherfuckin' adolescents\nThese niggas ain't even got no childhoods no more\nHow the fuck can you have a childhood\nAnd you at the funeral every motherfuckin' weekend?\nPssh, and you motherfuckers talkin' about peace?\nNigga, it ain't no motherfuckin' peace\nYou ain't seen the news motherfucker? You ain't heard? Lil' babies gettin' smoked, motherfuckers killin' they whole family\nLil' kids gettin' thrown off buildings\nMotherfuckers gettin' abused\nPeace? Nigga, is you out your fuckin' mind?\nFuck peace! We can't never have peace 'til you motherfuckers clean up this mess you made\n'Til you fuckin' clean up the dirt you dropped\n'Til we get a piece, fuck peace! Westside", "image": "https://images.genius.com/216ae23689a7aed39777e19d6600aa3b.500x500x1.jpg"}], "artist": "2Pac"}