{"songs": [{"title": "Where the Shit Goes Down", "album": "VI - Return of the Real", "year": null, "lyrics": "Ice-T, nigga\nRepresentin\nStrictly Westside, nigga\nSouth Central in the muthafuckin hiddouse\nCheck the technique, nigga\nRepresentin for my real niggas out there\nFuck all you buster-ass niggas\nWord\n\n[ VERSE 1 ]\nSaturday night in L.A., time to play\nMy beepers hummin like a vibrator, gotta make crime pay\nI'm packin two gats and I wish I could carry more\nMight sound crazy, but I ran out of slugs before\nYeah, I know the feds watch me\nBut my vest clashes hard with the Versace\nSo I'm just rollin in the black five hun'\nI used to lowride, now it's just for fun\nI had 5 cars, but now I got one\nHard to keep up ballin when you're on the run\nI got two ki's in my trunk and a shovel\nStepped on the one, so now I gots double\nThe shovel's for drama, need I say more?\nGot the fat stash spot under my passenger floor\nThat's for the other strap, the automatic type\nI gotta keep it close in case shit gets hype\nGot a bitch in jail, she didn't snitch, she did three\nI'mma have to roll solo till they set her free\nCause I got some other crimeys down, true gees\nBut they got all day, so now it's just me\nAnd I'mma kick this slang until the day I die\nI can't go straight, I won't even try\nI'm stuck in the game, so don't ask me why\nIt's life in L.A\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nLong Beach and Compton are some down-ass towns\nBut South Central L.A. is where the shit goes down\n\n[ VERSE 2 ]\nNow niggas like they credit and they like to get they loans on\nSo I hooked up with my boy who turns them phones on\nHe told me bout this nigga who won't pay\nHe also said he knew excactly where the muthafucka stay\nSo I went and got some homies I hang with\nSome crazy muthafuckas who I used to bang with\nWe took a trip to his crib\nI snatched his ho and his kids, and this is what we did\nI tied they punk ass up\nI cracked the safe with an axe, and then the phones we cut\nI didn't hurt his wife\nBut I promised next time that I would take her life\nI shot a nigga in his neck for disrespect, caught a body\nGot a murder in Miami for a shoot-out at a party\nGot blood in my trunk from a punk who squealed\nHad a partner tried to play me and his cap I peeled\nNow I rest with my finger on my heater\nHand on my beeper, a light sleeper\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nNew York and Philly are some down-ass towns\nBut South Central L.A. is where my shit goes down\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nFrisco and Oakland are some down-ass towns\nBut South Central L.A. is where my shit goes down\n\n[ VERSE 3 ]\nI use to sling enough water you could float a boat\nYou could ski on the mountains of fuckin coke\nBut now most niggas serve chronic\nSo I let em check the bank, and then I'm all up on it\nI serve em with a cute ho\nIn a week they tell my bitches 'bout all they dough\nThen I jack and I kill\nThe jack's for the money, the kill's for thrills\nI got 9'000 blacks that still serve crack\nGot a bitch who works the Plaza too on the track\nGot a GTA connection and I fence for jewels\nGot some little kids that move my fuckin dope in schools\nGot warrants for arrest in about 20 states\nGot a bigger body count than fuckin Norman Bates\nI'm a killer, jacker, dealer, pimp supreme\nI'm livin out the hustler dream\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nHouston and Atlanta are some down-ass towns\nBut South Central L.A. is where that shit goes down\n\n[ VERSE 4 ]\nTonight I gotta meet this nigga from around the way\nSome think he's cool, I think he's DEA\nHe said he want it bad, he heard that I got it good\nI bagged up ten ki's of flour and met him in the hood\nI met him at my spot, cause I know it's cool\nPat him down on sight to remove his tool\nI made him name 10 niggas he should know\nBut that still ain't shit in the game of blow\nHe asked to see the dope, I asked to see the cash\nHe reached for that briefcase too fast\nA fuckin pig, yo, he thought he had the jump\nI had my nigga in the closet with a bull pump\nAnd now there's fuckin shot-up body all on the floor\nBut that's what the shovel's for...\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nNewark and Miami are some down-ass towns\nBut South Central L.A. is where my shit goes down\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nDetroit and Chicago are some down-ass towns\nBut South Central L.A. is where that shit goes down\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nD.C. and Cleveland are some down-ass towns\nBut South Central L.A. is where the shit goes down\n\nI lowride and I sag and cuss\nI cover my face with the rag and bust\nI know all my niggas live in down-ass towns\nBut South Central L.A. is where my shit goes down", "image": "https://images.genius.com/8794c719c37c748d62c37145c9babe1a.700x700x1.jpg"}], "artist": "Ice-T"}