{"songs": [{"title": "Ill Mind of Hopsin 7", "album": "Pound Syndrome", "year": "2014-07-18", "lyrics": "[Produced By Hopsin]\n\n[Hook]\nIt's us, find power\nLive life, mind power\nIt's us, find power\nLive life, mind power\n\n[Verse 1]\nYo, fuck anybody I might alarm\nLife is a tour, I sit and ride along\nTakin' some notes and then I write the songs\nI’m starin' down the road my life has gone\nIs this where I belong?\nIs it wrong to not believe in right and wrong?\nMy mental state is fuckin' me up, and I cried a pond\nWhile asking you for some answers\nBut we don’t have that type of bond\nThat my desires gone with the way that I’ve been livin' lately\nIf I died right now, you’d turn the fire on\nSick of this bullshit, niggas call me a sell-out\n'Cause I hopped to Christianity so strongly, then I fell out\nNow I’m avoidin' questions like a scared dog with his tail down\nFeelin' so damn humiliated\n'Cause they lookin' at me like I’m hellbound\nWhat story should I tell now? I’ll just expose the truth\nI'm so close to the fuckin' edge, I should be close to you\nBut who the fuck are you? You never showed the proof\nAnd I’m only fuckin' human, yo, what am I supposed to do?!\nThere’s way too many different religions with vivid descriptions\nBeggin' all fuckin' men and women to listen\nI can’t even beat my dick without gettin' convicted\nThese ain’t wicked decisions, I got different intentions\nI've been itchin' to get it, I’ve been given assistance\nBut the whole fuckin' system is twisted\nNow I’m dealin' with this backlash because Marcus isn't a Christian\nAnd I’ve been told that my sinful life is an addiction\nBut I can’t buy it, it’s just too hard to stand beside it\nI need an answer, and humans can’t provide it\nI look at the Earth and Sun and I can tell a genius man designed it\nIt’s truly mind-blowin', I can’t deny it\nIs Heaven real? Is it fake? Is it really how I fantasize it?\nWhere’s the Holy Ghost at? How long’s it take a man to find it?\nMy mind’s a nonstop tape playin' and I can’t rewind it\nYou gave me the Bible and expect me not to analyze it?!\nI’m frustrated and you provoked it\nI’m not readin' that motherfuckin' book, because a human wrote it\nI have a fuckin' brain, you should know it\nYou gave it to me to think, to avoid every useless moment\nIt was a mission that I had to abort\n'Cause humans be lyin', we're such an inaccurate source\nIt’s gon’ be hard to put me back on the course\nNext Jehovah’s Witness to come on my porch\nI swear I’m slammin’ the door\nA lot of folks believe it though, but I’m not surprised\nHumans are fuckin' dumb, still thinkin' that Pac’s alive\nI ain’t tryin' to take your legacy and torch it down\nI’m just sayin', I ain’t heard shit from the horse’s mouth\nJust sheep always tellin' stories of older guys\nWho were notarized by you when you finally vocalized\nNow I’m supposed to bow my head and close my eyes\nAnd somehow let the Holy Ghost arise?\nSounds like a fuckin' Poltergeist!\nShow yourself, and then boom, it's done\nEvery rumor’s gone, I no longer doubt this shit, you’re the One\nI’ll admit that my sinful ways was stupid fun\nAnd all my old habits can hop on top of a roof to plunge\nI’ll donate to a charity that could use the funds\nFuck the club; instead of bitches, I’d hang with a group of nuns\nAnd everyone I ran into would know what I came to do\nI wouldn't take a step unless it was in the name of you\nI hate the fact that I have to believe\nYou haven’t been chattin' with me like you did Adam and Eve\nAnd I ain’t seen no fuckin' talkin' snake unravel from trees\nWith an apple to eat, that shit never happens to me\nI don’t know if you do or don’t exist\nIt's drivin' me crazy, send your condolences\nThis is me reachin' to you, so don’t forget\nIf Hell is truly your pit of fire and I get thrown in it\nI’ma probably regret the fact that I ever wrote this shit\nMy gut feelin' says it’s all fake\nI hate to say it, but fuck it, shit, I done lost faith\nThis isn’t a small phase, my perspective’s all changed\nMy thoughts just keep pickin' shit apart all day\nAnd in my mind I make perfect sense\nIf you aren’t real, then all my prayers aren’t worth a cent\nThat would mean that I could just make up what my purpose is\nAnd I could sit in church and say “fuck” in the services\nMan, what if Jesus was a facade?\nThen that would mean the government’s God\nI feel like they’ve been brainwashin' us with a lot\nSo much that we don’t even notice that we’re stuck in a box\nMan, everything is “what if?” — why is it always “what if?”\nPlanet Earth “what if?”, the Universe “what if?”\nMy sacrifice “what if?!”, my afterlife “what if?!”\nEvery fuckin' thing that deals with you is fuckin' suspect\nI’m fuckin' done! I’m fuckin' done!\nThis is my fuckin' life and I’m livin' it, I’m havin' fun\nIf you really care for me\nProve that I need to live carefully!\nBut I’ll be damned if I put my own pleasure aside\nFor an afterlife that isn’t even guaranteed\nWe are you, and you’re us — stop playin' games!\nMy life’s all I got, and Heaven is all in my brain\nAnd when I feel I'm in Hell, my ideas are what get me through pain\nDo as you please, and I’ll just do me\nI’m a human, I’ll stay in my lane; Ill mind\n\n[Hook]\nIt's us, find power\nLive life, mind power\nIt's us, find power\nLive life, mind power", "image": "https://images.rapgenius.com/07e4fcc91215270d9360cf774cb946f5.500x500x1.jpg"}], "artist": "Hopsin"}