{"songs": [{"title": "King of Kings", "album": "The Lex Diamond Story", "year": "2003-12-16", "lyrics": "[Intro: Havoc Raekwon]\nLet's go Yeah, nigga\nGood lookin' Rae that's what I'm talkin' 'bout\nIt's all good don't worry about it\nYou feel what I'm sayin'? Don't worry about it\nYeah Word up, let's go\nYou know how we gotta come at this niggas, man\nYeah, come on, yo\n\n[Verse 1: Havoc]\nStuck, y'all like gum underneath my kicks\nBetter move little fucks when the heat I'll spit\nThe hammer clap like the ass on a meat-out chick\nDump clips like a triflin' ass bitch to drop\nIf you short you're a chance in the box\nBut I ain't lettin' you play with the guns in the club, I'm boothin' the ox\nGot my eyes on the ho's and I'm a peripheral\nGot you cowards poppin' that Moe', my hand on the 'istol\nWild out, have a ball, you could drink 'til you 'url\nThought the Firewater was strong, the pound'll leave you curled\nOn the floor, like a new born baby, God\nWhat you mean \"Is he dead?\", what type of shit is leakin' out of his head?\nWhen you cowards see the drama and it come to a head\nI'm hittin' Rae up on the jacket, it ain't much to be said\nIf it's on, go without sayin' somethin', deliverin'\nVisa verca, this is Havoc, baby, we those niggas (we those niggas)\n\n[Chorus: Raekwon]\nAll that money is us, now what's fuckin' wit' us?\nAy yo all around hungry, that's us and can't get nothin' get it\nAy yo all that money, all them niggas\nAll them shorties, everybody yell, \"All lovely\"\n\nAll that money is us, now what's fuckin' wit' us?\nAy yo all around hungry, that's us ,and can't get nothin' get it\nAy yo all that money, all them niggas\nAll them shorties, everybody yell, \"All lovely\"\n\n[Verse 2: Raekwon]\nI chop meat out ya face, Daddy, gladly\nMad breeze on, rubberband currency and I splash ya visa\nYou know the code, yo Caesar low straddlers\nFront Streets, cracks all in the front seat spazzin'\nImperial wizards, Staten\nKnife game off the chain and I'm with four hundred with wagons yo\nLive wires, shoot darts for bread\nAny map, I assist that, I'm holdin' it, all niggas dead\nWhat? Battle for cake and fuck wizzes\nWe do it straight business, all mount ride, ain't no fake niggas\nReminisce, spit faces\nPissin' on the fake little swindler's list, Rae gave them niggas cake\nBattle the gun, you're wildin'\nI might levitatate well, I might take ya shit, push up, stylin' it\nOxes, reefers, police need us\nThe regime of Shaolin with Queens re-up\nFuckin' with the poisonous hand\nRemember y'all, no commercial, I hurt you, yo go get ya mans\n\n[Chorus: Raekwon]\nAll that money is us, now what's fuckin' wit' us?\nAy yo all around hungry, that's us and can't get nothin' get it\nAy yo all that money, all them niggas\nAll them shorties, everybody yell, \"All lovely\"\n\nAll that money is us, now what's fuckin' wit' us?\nAy yo all around hungry, that's us and can't get nothin' get it\nAy yo all that money, all them niggas\nAll them shorties, everybody yell, \"All lovely\"\n\n[Verse 3: Raekwon]\nAy yo select me, Gucci sneaker recipe\nNot the S dot Carters, no disrespect but respect me\nOne of the top five gangstas alive\nMy element is just the Elliott Ness, niggas who hide\nYo, I ran from some niggas that was police\nThese niggas heard about me bringin' marked money in, I had the whole East\nI've been the greatest, been flippin' the latest\nSomethin' like the new haggler on the Ave., ham it up, pullin' haze\nAnd all the young niggas praise me\nIt's like the talent of the Six Million Dollar Man, 'yana pace\nCome on, banana squeeze, aim at these Caravans\nHeard he had his man and that ugly Keish'\nComin' from a galaxy of hood, hard real people gettin' ki's\nFuck wit' the media, it's all good\n\n[Chorus: Raekwon]\nAll that money is us, now what's fuckin' wit' us?\nAy yo all around hungry, that's us and can't get nothin' get it\nAy yo all that money, all them niggas\nAll them shorties, everybody yell, \"All lovely\"\n\nAll that money is us, now what's fuckin' wit' us?\nAy yo all around hungry, that's us and can't get nothin' get it\nAy yo all that money, all them niggas\nAll them shorties, everybody yell, \"All lovely\"", "image": "https://images.genius.com/8703b73c19201fea3baccb6c300ec07e.1000x1000x1.jpg"}], "artist": "Raekwon"}