{"songs": [{"title": "Play This on the Radio", "album": null, "year": null, "lyrics": "[Intro]\nYo what's up, it’s the kid 50 cent, this is new shit right here on ThisIs50.com exclusive\nYou got me feeling crazier than a motherfucker\nRemember where you heard it first\n\n[Chorus]\nPlay this on the radio (hell nah)\nPlay this on the radio (Damn, nigga)\nPlay this on the radio (What the fuck you say?)\nPlay this on the radio\n\n[Verse]\nFirst they said that faggot hot, then they let that junkie shot\nKeep them motherfucking trophies, tell me where the fuck is mine?\nI'm back on the underground, back where I belong now\nTold you how I felt then, this is how I feel now\nFocus on my lyrics now, I'm having a melt down\nI don’t wanna sip tea or chit chat on your sofa\nBitch, I ain't Jay-Z, fuck you, Oprah\nSuck dick, deep throat and gag, now I'm mad\nYou don’t like hip-hop, then we don’t like your ass\nFuck the award shows, don’t even mention my shit\nI'm the hottest nigga on the net, they can't censor my shit\nI say what the fuck I wanna say, I done been through some shit\n\n[Chorus]\nLook, shit, damn, cocksucker, punk bitch motherfucker\nPlay this on the radio, play this on he radio\nFaggot, ho, slut, cunt, suck a dick, roll a blunt\nPlay this on the radio, play this on the radio\nWhite bitch, Black bitch, Asian bitch, crazy ho\nPlay this on the radio, play this on the radio\nCracker spit, horny trick, buy a pussy, here we go\nPlay this on the radio, play this on the radio\n\n[Outro]\nYeah, turn it up now, so you can hear me\nIt’s the return of the heartless\nCreative monster\nEminem, Dre, 50, Shady Aftermath\nNiggas can't tell me nothing, son\nI was broke and fucked up, now what?\nI dare you to say something, I'll break your fucking neck\nAny one of these niggas, son, I'm waiting\nAnd I'm on your heels, Mr. Carter, I heard you\nYou want me to...die ugly? Okay\nDon’t end up on the list, nigga\nBe a missing person\nLike Cam'ron, like Ja, like Joe\nWho want some? Who want it? What up?", "image": "https://images.genius.com/6b42f520f150e52b5e7d725d4452f93d.200x187x1.jpg"}], "artist": "50 Cent"}