{"songs": [{"title": "Respiration - dr. luke remix", "album": null, "year": null, "lyrics": "\"what'd you do last night?\"\n\"we did umm, two whole cars\nIt was me, dez, and main three right?\nAnd on the first car in small letters it said\n'all you see is.' and then you know\nBig, big, you know some block silver letters\nThat said '.crime in the city' right?\"\n\"it just took up the whole car?\"\n\"yeah yeah, it was a whole car and shit...\"\nEscuchela. la ciudad respirando\n(translation of spanish: listen to it. the city breathing)\n* woman repeats 3x *\nEscuchela\nThe new moon rode high in the crown of the metropolis\nShinin, like who on top of this?\nPeople was hustlin, arguin and bustlin\nGangstaz of gotham hardcore hustlin\nI'm wrestlin with words and ideas\nMy ears is picky, seekin what will transmit\nThis ain't no time where the usual is suitable\nTonight alive, let's describe the inscrutable\nThe indisputable, we new york the narcotic\nStrength in metal and fiber optics\nWhere mercenaries is paid to trade hot stock tips\nFor profits, thirsty criminals take pockets\nHard knuckles on the second hands of workin class watches\nSkyscrapers is collosus, the cost of living\nIs preposterous, stay alive, you play or die, no options\nNo batman and robin, can't tell between\nThe cops and the robbers, they both partners, they all heartless\nWith no conscience, back streets stay darkened\nWhere unbeliever hearts stay hardened\nMy eagle talons stay sharpened, like city lights stay throbbin\nYou either make a way or stay sobbin, the shiny apple\nIs bruised but sweet and if you choose to eat\nYou could lose your teeth, many crews retreat\nNightly news repeat, who got shot down and locked down\nSpotlight to savages, nasdaq averages\nMy narrative, rose to explain this existance\nAmidst the harbor lights which remain in the distance\nSo much on my mind that it can't recline\nBlastin holes in the night til she bled sunshine\nBreathe in, inhale vapors from bright stars that shine\nBreathe out, weed smoke retrace the skyline\nHeard the bass ride out like an ancient mating call\nI can't take it y'all, i can feel the city breathin\nChest heavin, against the flesh of the evening\nSigh before we die like the last train leaving\nBreathin in deep city breaths, sittin on shitty steps\nWe stoop to new lows, hell froze the night the city slept\nThe beast crept through concrete jungles\nCommunicatin with one another\nAnd ghetto birds where waters fall\nFrom the hydrants to the gutters\nThe beast walk the beats, but the beats we be makin\nYou on the wrong side of the track, lookin visibly shaken\nTaken them plungers, plungin to death that's painted by the numbers\nWith crime unapplied pressure, cats is playin god\nBut havin children by a lesser baby mother but fuck it\nWe played against each other like puppets, swearin you got pull\nWhen the only pull you got is the wool over your eyes\nGettin knowledge in jail like a blessing in disguise\nLook in the skies for god, what you see besides the smog\nIs broken dreams flying away on the wings of the obscene\nThoughts that people put in the air\nPlaces where you could get murdered over a glare\nBut everything is fair\nIt's a paradox we call reality\nSo keepin it real will make you casualty of abnormal normality\nKillers born naturally like, micky and mallory\nNot knowing the ways'll get you capped like an nba salary\nSome cats be emceeing to illustrate what we be seeing\nHard to be a spiritual being when shit is shakin what you believe in\nFor trees to grow in brooklyn, seeds need to be planted\nI'm asking if y'all feel me and the crowd left me stranded\nMy blood pressure boiled and rose, cause new york niggas\nActin spoiled at shows, to the winners the spoils go\nI take the l, transfer to the 2, head to the gates\nNew york life type trife the roman empire state\nSo much on my mind i just can't recline\nBlastin holes in the night til she bled sunshine\nBreathe in, inhale vapors from bright stars that shine\nBreathe out, weed smoke retrace the skyline\nYo don't the bass ride out like an ancient mating call\nI can't take it y'all, i can feel the city breathin\nChest heavin, against the flesh of the evening\nSigh before we die like the last train leaving\nEscuchela. respirando??\nYo... on the amen, corner i stood lookin at my former hood\nFelt the spirit in the wind, knew my friend was gone for good\nThrew dirt on the casket, the hurt, i couldn't mask it\nMixin down emotions, struggle i hadn't mastered\nI coreograph seven steps to heaven\nAnd hell, waiting to exhale and make the bread leavened\nVeteran of a cold war it's chica-i-go for\nWhat i know or, what's known\nSo some days i take the bus home, just to touch home\nFrom the crib i spend months gone\nSat by the window with a clutched dome listenin to shorties cuss long\nYoung girls with weak minds, but they butt strong\nTried to call, or at least beep the lord, but didn't have a touch-tone\nIt's a dog-eat-dog world, you gotta mush on\nSome of this land i must own\nOutta the city, they want us gone\nTearin down the 'jects creatin plush homes\nMy circumstance is between cabrini and love jones\nSurrounded by hate, yet i love home\nAsk my god how he thought travellin the world sound\nFound it hard to imagine he hadn't been past downtown\nIt's deep, i heard the city breathe in its sleep\nOf reality i touch, but for me it's hard to keep\nDeep, i heard my man breathe in his sleep\nOf reality i touch, but for me it's hard to keep\nSo much on my mind i just can't recline\nBlastin holes in the night til she bled sunshine\nBreathe in, inhale vapors from bright stars that shine\nBreathe out, weed smoke retrace the skyline\nYo how the bass ride out like an ancient mating call\nI can't take it y'all, i can feel the city breathing\nChest heavin, against the flesh of the evening\nKiss the ide's goodbye, i'm on the last train leaving", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}