{"songs": [{"title": "Ghostface X-Mas", "album": "GhostDeini the Great", "year": "2006-12-16", "lyrics": "[Intro: Ghostface Killah]\nHoly Jesus, I gotta drop all these toys off\nMrs. Claus, Mrs. Claus, bring me my robe & my slippers\nI gotta go!\n\n[Ghostface Killah]\nSmell the pinetrees in the air, sleigh bells are ringing\nToy stores are out of control, and kids singing\nThat night before Christmas, dashing through the snow\nRudolph the Reindeer, red nose that glow\nIt's all about the candycanes and Christmas list\nNorth Pole and that chubby jolly old Saint Nick\nThe little elves getting busy, in Santa workshop\nAnd how gingerbread men keep they buttons on top\nWooden soldiers and chestnuts, rosting like marshmellows\nGoodfellas, chocolate pudding pops and Jell-O's\nIt's the gift, the cookies and milk on the mantle\nThe mistletoe, that scent from that peppermint candles\nThat warm French vanilla, mean coat with zippers\nBareskin robe dragon with Versace slippers\nAround the fireplace we breathe, shirts are short sleave\nWe stayin' up all night on Christmas Eve\n\n[Chorus: Shawn Wigs]\nIt's the season for sharing, season of the gift\nSeason for snow, it's December 25th\nThat time of the year, we dress like Saint Nick\nStirring whipcream into that hot cup of Quick\nIt's the season for sharing, season of the gift\nSeason for snow, it's December 25th\nThat time of the year, we suprise all the kids\nBuy gifts for your loved ones and diamonds for ya wiz\n\n[Ghostface Killah]\nI see snowmen, snowflakes, cinnamon cakes\nSisters and brothers, sliding down garbage can covers\nSnowball fights, eggnog splashed with Hennessey\nBet Christmas is Christmas from New York to Tennessee\nThe Kris Kringles, the Jingling Babies\nAll them late nights wrapping gifts, driving you crazy\nAnd Jack Frost is outside, freezing it up\nGot the hood and the goose just to loosen you up\nAnd all the homes is all lit with some many lights\nSee the trees through the windows, glittered up at night\nGingerbread house, bumping that Jingle Bell Rock\nAnd all them little bad kids get coal in they socks\n\n[Hook: Ghostface Killah]\nGhost knows when you be sleeping\nAnd Ghost knows when you are awake\nAnd I know if you been bad or good\nSo be good for old Ghostface\n\n[Chorus]\n\n[Outro: Ghostface Killah]\nHahahaha, we made it, wish you all a Merry Christmas\nAnd a Happy New Year, hahahaha\nAnd to all a good night, good night to all\nTo Staten Island, hahah, nah, cut it, cut it off - son", "image": "https://images.genius.com/469fdc23501d689480b2d8fa549f0636.240x240x1.jpg"}], "artist": "Ghostface Killah"}