{"songs": [{"title": "Yasss Bish", "album": null, "year": "2014-05-03", "lyrics": "[Refrain: Soulja Boy]\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\n\n[Verse 1: Nicki Minaj]\nMe, I'm just me, me, I'm just real, me, I'm that bitch that be footing the bill\nOnly a real nigga could cop a feel, credit card blacker than that nigga Seal\n25 million to broker the deal, Jewish my lawyer, he Kosher the deal\nAnd I am still poppin' them pills, I don't give a fuck how you bitches feel\nJealousy, jealousy that's how you feel? I am still living in Beverly Hills\nTell 'em to chill, tell 'em to chill, tell all them people, my wrist is on chill\nBitches can't beat me, they ain't got the skill, eye of the tiger they ain't got the kill\nLook up to Jada, I love her and Will, bitches my sons, but they not in my will\nThe fuck, be wrong with these bitches? (woah)\nThe fuck, be wrong with these niggas? Hey! (kyuh)\n\n[Refrain: Soulja Boy]\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\n\n[Hook: Nicki Minaj]\nTell 'em give a bad bitch her proper due\nWhat they say ain't never what they gon' do\nIt say 250, on that fucking sticker\nPinkprint hot, it should be in some slippers\nNiggas know me, yeah\n\n[Verse 2: Nicki Minaj]\nI don't fuck with you niggas, I own the Clippers\nI own some homes, I own my own liquor\nBitches is bitter, my titties is bigger, you bitches my sons, I need a babysitter\nI am the dream, on the dream team, I am Olajuwon, I am Hakeem\nDul Jabbar, I am Kareem, I am the Queen because I'm a machine\nYou are not ready, you are not seasoned, go against me I say, \"Fix it Jesus\"\nThinking they hot, talk shit a lot but when they shit drop, I say \"Fix it Jesus\"\nOh, your shit, ain't gold!\nWord, to my bank roll\nReal niggas ain't sold (soul)\nDropping my single in two weeks, The Pinkprint album, a movie\nBitches be thinkin' they hot but these bitches be using that term, so loosely\n\n[Refrain: Soulja Boy]\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\nYasss bish, yasss\n\n[Hook: Nicki Minaj]\nTell 'em give a bad bitch her proper due\nWhat they say ain't never what they gon' do\nIt say 250, on that fucking sticker\nPink Print hot, it should be in some slippers\nNiggas know me, yeah", "image": "https://images.rapgenius.com/a8713ca7154ddeee33be756ad44e7157.475x475x1.jpg"}], "artist": "Nicki Minaj"}