{"songs": [{"title": "Wild Cats", "album": "Meth Lab Season 2: The Lithium", "year": "2018-11-01", "lyrics": "[Intro: Method Man & Redman]\nWe in the lab smokin' that good-good\nDoin' everything hood-hood\nHey, man, let me get some weed, nigga\nLike we should-should\nWoo\nArrh-arrh-arrh-arhh\nI don't think they ready for this\nWild cats\nBoom boom\nMeth Lab, second season\nThis how you make a song nigga\nAyy, ayy\n\n[Verse 1: Method Man]\nKey to my city, my G is tricky, my tree is sticky\nStairway is pissy, the crown they give me don't even fit me (Huh)\nKing me, it's risky, if jiggy get me, I plead the fiffy\nThey'll never snitch me, judge'll convict me, so just acquit me\nThe fuzz against me, I'm butter-slippery, they think I'm shifty\nZero to sixty, it's just a quickie, you blink, you miss me\nI'm just a fishy, got my bread and my chedda crispy\nMy queen prissy, I kill her dead if she ever quit me\nThese hoes only look good when tipsy, they said I'm picky, that's perfect\nYou done scratched the surface, go 'head and sniff me\nI'm pushin' fifty, can't find your woman? She pushin' wit' me\nWas pushin' lifty, the family business was pushin' piffy\nThat pusher in me, I did it gritty, no pretty in me\nI'm pretty trendy, I had to spend me a pretty penny\nOne outta many, last to fend me, too many envy\nDon't gimmie-gimmie\nI do it dirty, no shimmy-shimmy\n\n[Verse 2: Hanz On]\nIt's Hanz-arello but you can 'em Shameek from Belly\nMethod giselle, we comin' out, we gon' catch a felly\nAbout the jelly, the P-L-O what we call the deli\nThe Lab we smelly, could smell it all in your Pelle Pelle (Woo)\nBarq or Cola like refrigerators but ain't no Perry\nCareful fuckin' with regulators across the ferry\nIt's necessary, I gotta bury my adversary\nThese niggas scary, we commandeering this commissary\nThis shit is manly, a little somethin', so don't get weary\nWild cats from Missouri, I be your judge and jury\nI love a girly who get it poppin', you'll feel the fury\nWe tellin' Siri to call the pigs to come get near me (C'mon)\nHit a killer to be a killer but ain't no skelly\nPissin' on 'em, we shittin' on 'em, but no R. Kelly\nSpeakin' country to country, grammar, but ain't no Nelly\nOnce upon a- from Shaolin wit' no Shkreli\n\n[Chorus: Redman, Streetlife & Method Man]\nYow, We them wild cats\nYou don't want that dope, we keep slangin' 'til it's right on your Coach, come on\nWhere the Bricks & Staten Isle at?\nI got 'em right in my scope, leave 'em dead 'til I turn 'em ghosts, you know?\nYow, we them wild cats\nYou don't want that smoke, we ain't rich, so we goin' for broke, nigga\nWhere the Bricks & Staten Isle at?\nWe fittin' to go at they throats\nYou must be a kiddin' tryna go with at the goats\nCome on\n\n[Verse 3: Redman]\nYo, when I ain't sober, I'm bi-polar, invite me over\nDoc be dumpin' his ashes in your baby stroller\nWhen I was young I ate paint, lead, with quarter waters\nNow Red red linin' the Range Rover motor\nI smoke west of the border, your bud outta order\nI go apeshit, I'm a Caesar with a little Koba\nTell your boss I'm the opposite of a Trump voter\nYo dude, this wild cat not from Villanova\nI'm in the cut, like a buck fifty, I Tony Toka\nYour side piece, I'ma poke her and then I adios her\nMy hood house on the block, we real estate brokers\nWe make it sound like Forth of July in October\nThe Bricks, Tommy Motolla, yeah, I'm a high-roller\nI write the crack that'll bring back Lamar Odom\nThat girl got good brains, I know she got diplomas\nShe fuckin' with a Goodfella, Ray Liotta\n\n[Verse 4: Streetlife]\nI'm kind of a big deal, I'm from the killin' hill\nYou shackin' a fool, barbeque chicken on the grill\nI'm not your run of the mill, so play your peep skills\nI hope your girl's on the pill 'cause she's a cheap thrill\nWe shoot to kill, blood spill for that dollar bill\nYour body parts'll be landfilled in Potter's Field\nYou ain't really real, you bust when pressure build\nLike steel water in pipes when the winter chill\nMy Louieville slugger, I call it Lucille\nSee Lucy Lou, you like Kill Bill, the kid's ill\nThe doc fillet 'em like veal, you see his last meal\nYour brains spill on your duck bill when caps peeled\nMight rupture my Achille heel chasin' this hunnid mills\nStreetlife, I'm hard to kill, call me the man of steel\nReal recognize real, I got mass appeal\nYou Massengil, you all ass like Tip Drill\n\n[Chorus: Redman, Streetlife & Method Man]\nYow, We them wild cats\nYou don't want that dope, we keep slangin' 'til it's right on your Coach, come on\nWhere the Bricks & Staten Isle at?\nI got 'em right in my scope, leave 'em dead 'til I turn 'em ghosts, you know?\nYow, we them wild cats\nYou don't want that smoke, we ain't rich, so we goin' for broke, nigga\nWhere the Bricks & Staten Isle at?\nWe fittin' to go at they throats\nYou must be a kiddin' tryna go at the goats\nCome on", "image": "https://images.genius.com/834d315e43e6cc76e0586de505dd61f9.1000x1000x1.jpg"}], "artist": "Method Man"}