{"songs": [{"title": "Freaks and Geeks", "album": "EP", "year": "2011-03-08", "lyrics": "[Verse 1]\nAlright, Gambino is a mastermind, fuck a bitch to pass the time\nMass appeal, orange rind, smoke your green, I'm spendin' mine\nThe beat is witches brew, but beware, this shit is potent\nE.E. cummin' on her face, now that's poetry in motion\nYeah, Gambino make it work, I'm the boss, move somethin'\nYeah, this cool fuckin' suits me, swag two button\nYeah, these girls be actin' crazy when they're dancin': Black Swan\nI ain't fuckin' at the club, put your clothes back on\nYeah, this beat is a disaster, 9/11 this track\nRappers wanna battle me, I have to mail their heads back\nAnd my clique make that dinero, so it's time to meet the fuckers\nI am runnin' this bitch, you are just a dog walker\nLeavin' with your girl when we last seen each other\nYeah, you fuckin' with the baddest like we tag team Rihanna\nFly girl on her knees, she don't wanna come near me\nYeah, my dick is too big, there's a big bang theory\nGot her picture in my iPhone, what do y'all think?\nWhile y'all niggas masturbate, I'm in that Ariel Pink\nIf I am just a rapper, man, you could've fooled me\nI'm the shit, when these dudes talk, they talkin' bull me, ah\n\n[Interlude]\nYeah, rah, rah, okay\n\n[Verse 2]\nAlright, I'm down with the black girls of every single culture\nFilipino, Armenian girls on my sofa\nYeah, I like a white girl, sometimes we get together\nNeed a thick chick though\nSo it's black and yellow, black and yellow\nLove is a trip, but fuckin' is a sport\nAre there Asian girls here? Minority report\nPut your team on the map, Blake Griffin on the court\nNiggas bitin' off my tracks, need a knife and a fork\nWe the illest, need a nurse, here's the check, grab your purse\nUnless we fuckin', then I'll pay for all the food on the Earth, man\nI got some pussy that was insane\nSo insane, it's an enemy of Batman\nI'm dominant, niggas call me faggot 'cause they closeted\nI'm hot as shit, comin' out the backside of a rocket ship\nIt's monster shit, you dudes are the opposite of Loch Nesses\nRespond to this, we can squash the beef right now like sausages\nChillin' with my n-words, say it like a white kid\nYes, your booty's big as hers, say that to my white bitch\nSo she don't get embarrassed, my dick is made of carrots\nBunnies wantin' to be fed it, I meant honeys, oh, forget it\nI have worked all winter, I will not fail summer\nIn the back of a bush, like Gavin Rossdale's drummer\nYeah, my stinger's in her flower, I hope she let me pollinate\nWorkin' hard as shit, yeah, this beat is made from concentrate\nNigga, can't you tell that my sample of Adele\nWas so hot, I got these hood niggas blowin' up my cell?\nSwag out the ass, I'm the man, fuck chico\nTook the G out your waffle, all you got left is your ego\nThink about it for a second\nMan, we eatin', where's your breakfast?\nMan, you hungry, have this sandwich\nGot my wallet, cheese, and lettuce\nAn elephant never forgets, so my dick remembers everything\nGreen inside your wallet is that pussy open sesame\nRunnin' the game, fuck am I sayin'?\nRunnin' the Earth, give me a month\nTold all you niggas I'm in it to win it\n'Cause havin' an Emmy just wasn't enough\nYou get sloppy drunk, I stay whiskey neat\nMy clique should be cancelled: Freaks and Geeks", "image": "https://images.genius.com/be9197ecbcd58f7631a1c17709d6dff2.500x500x1.jpg"}], "artist": "Childish Gambino"}