{"songs": [{"title": "Talkin’ 2 Myself", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Intro: Eminem]\nAyo, before I start this song, man\nI just wanna thank everybody for being so patient\nAnd bearing with me over these last couple of years\nWhile I figure this shit out\n\n[Chorus: Kobe & Eminem]\nIs anybody out there?\nIt feels like I'm talkin' to myself\nNo one seems to know my struggle\nAnd everything I've come from\nCan anybody hear me?\nYeah, I guess I keep talkin' to myself\nIt feels like I'm goin' insane\nAm I the one who's crazy?\nYeah, whoa-whoa, whoa-whoa\nWhoa-whoa, whoa-whoa, whoa-whoa\nSo why in the world do I feel so alone?\nNobody but me, I'm on my own\nIs there anyone out there who feels the way I feel?\nIf there is, let me hear\nJust so I know that I'm not the only one\n\n[Verse 1: Eminem]\nI went away, I guess, and opened up some lanes\nBut there was no one who even knew\nI was goin' through growin' pains\nHatred was flowin' through my veins\nOn the verge of goin' insane\nI almost made a song dissin' Lil Wayne\nIt's like I was jealous of him 'cause of the attention he was gettin'\nI felt horrible about myself, he was spittin' and I wasn't\nAnyone who was buzzin' back then coulda got it\nAlmost went at Kanye too\nGod, it feels like I'm goin' psychotic, thank God that I didn't do it\nI'da had my ass handed to me, and I knew it\nBut Proof isn't here to see me through it\nI'm in the booth, poppin' another pill, tryna talk myself into it\nAre you stupid? You're gon' start dissin' people for no reason?\n'Specially when you can't even write a decent punchline even? You're lyin' to yourself, you're slowly dyin'\nYou're denyin' your health is declinin' with your self-esteem\nYou're cryin' out for help\n\n[Chorus: Kobe and Eminem]\nIs anybody out there?\nIt feels like I'm talkin' to myself\nNo one seems to know my struggle\nAnd everything I've come from\nCan anybody hear me?\nYeah, I guess I keep talkin' to myself\nIt feels like I'm goin' insane\nAm I the one who's crazy?\nYeah\nSo why in the world do I feel so alone?\nNobody but me, I'm on my own\nIs there anyone out there who feels the way I feel?\nIf there is, let me hear\nJust so I know that I'm not the only one\n\n[Verse 2: Eminem & Kobe]\nMarshall, you're no longer the man, that's a bitter pill to swallow\nAll I know is I'm wallowing, self-loathing and hollow\nBottoms up on the pill bottle, maybe I'll hit my bottom tomorrow\nMy sorrow echoes in this hall though (Oh-oh, oh)\nBut I must be talkin' to the wall though, I don't see nobody else\n(I guess I keep talkin' to myself)\nBut all these other rappers suck is all that I know\nI've turned into a hater, I put up a false bravado\nBut Marshall is not an egomaniac, that's not his motto\nHe's not a desperado, he's desperate\nHis thoughts are bottled inside him\nOne foot on the brake, one on the throttle\nFallin' asleep with writer's block in the parkin' lot of McDonald's\nBut instead of feeling sorry for yourself\nDo something 'bout it, admit you got a problem\nYour brain is clouded, you pouted long enough\nIt isn't them, it's you, you fuckin' baby!\nQuit worryin' 'bout what they do, and do Shady\nI'm fuckin' goin' crazy\n\n[Chorus: Kobe & Eminem]\nIs anybody out there?\nIt feels like I'm talkin' to myself\nNo one seems to know my struggle\nAnd everything I've come from\nCan anybody hear me?\nYeah, I guess I keep talkin' to myself\nIt feels like I'm goin' insane\nAm I the one who's crazy?\nYeah\nSo why in the world do I feel so alone?\nNobody but me, I'm on my own\nIs there anyone out there who feels the way I feel?\nIf there is, let me hear\nJust so I know that I'm not the only one\n\n[Verse 3: Eminem]\nSo I picked myself up off the ground\nAnd fuckin' swam 'fore I drowned\nHit my bottom so hard I bounced twice, suffice, this time around\nIt's different, them last two albums didn't count\nEncore, I was on drugs; Relapse, I was flushin' 'em out\nI've come to make it up to you now, no more fuckin' around\nI got somethin' to prove to fans, 'cause I feel like I let 'em down\nSo please accept my apology, I finally feel like I'm back to normal\nI feel like me again, let me formally\nReintroduce myself to you for those of you who don't know\nThe new me's back to the old me\nAnd homie, I don't show no signs of slowin' up\nOh, and I'm blowin' up all over\nMy life is no longer a movie, but the show ain't over, homos\nI'm back with a vengeance, homie\nWeezy, keep ya head up, T.I., keep ya head up\nKanye, keep ya head up, don't let up\nJust keep slayin' them, rest in peace to DJ AM\n'Cause I know what it's like\nI struggle with this shit every single day, and um…\n\n[Chorus: Kobe & Eminem]\nIs anybody out there?\nIt feels like I'm talkin' to myself\nNo one seems to know my struggle\nAnd everything I've come from\nCan anybody hear me?\nYeah, I guess I keep talkin' to myself\nIt feels like I'm goin' insane\nAm I the one who's crazy?\nYeah\nSo why in the world do I feel so alone?\nNobody but me, I'm on my own\nIs there anyone out there who feels the way I feel?\nIf there is, let me hear\nJust so I know that I'm not the only one\n\n[Outro: Eminem]\nSo there it is, damn\nFeels like I just woke up or something\nI guess I just forgot who the fuck I was, man\nAyo, and to anybody I thought about going at\nIt was never nothing personal\nIt was just some shit I was going through\nAnd to everybody else, I'm back! (I'm back!)\nHa-ha (Ha-ha)", "image": "https://images.genius.com/8267d6f45cdffed8db78f53fa00991c5.1000x1000x1.jpg"}], "artist": "Eminem"}