{"songs": [{"title": "Get Like Me", "album": null, "year": null, "lyrics": "Here I go. Im a rapper turned singer. And you can tell that he smoke, but I don't need my vocal cords all I hit is C-Notes\nN.E.R.D flow, i spaz if im prevoked\nI'm about to change the fuckin game, pass the re-mote\nMoney is everythang, and its every other thing\nI'm part of the choir, its the motto that my brotha sang\nCash is the right now, women are the post game\nMoney-over-bitches dot com check the domain\nIt's comin too soon, album on the way\nPeople ask me if I pray, I say yup, once in the blue moon\nOops I mean a red moon... I did it again to 'em\nLet me leave a space in for your blood affiliation\nI say, heavy metaphors, flow so over weight\nI can rap around these other youngins like a cobra snake\nFrost bite drizzy nigga, no body as cold as Drake\nKeep yo ass in-line, don't be tryin to roller skate\nFuck all the discreet shit, I get on some deep shit\nI am twenty-one tell me who do I compete with?\nI'm on my elite shit, you can tell I'm real cause I'm getting hood lovin I ain't even talkin' street shit\nYoung angel, young lyin and I'm done tryin\nI'm just doin, who's drinkin cause I'm buyin\nIt's on meee, everything is on meee\nAnd my girl is still down like she's fuckin john B\nAnd when I go dumb, I tend to do dumb shit\nI just listen back and now I'm sounding like a trumpet\nThis is for all the stripper cause I know that they gonna bump it tellem back it up and dump it, back it, back it up and dump it\nAin't no pistols here, yo money will disappear\nMy accountant will feed his family off my fiscal year\nTax brackets and back and forth faxes\nMy money comin full circle, get up on my axis\nNebby Imma kill 'em, only cause I promised\nThey think I'm being cocky but I'm only being honest\nI'm swallowin the goose, got a model gettin loose, and I never party unless I got some bottles and a booth\nI just walk up on the scene, I'm about to take this, I'm just having patience cause I want it to make sense\nWhite cup, orange pop, Tennessee state shit, drop a fo in it and appreciate the greatness.. Drizzy!\n\nWayne: Yeah, p-p-pass the dro. I am such a beast and you ask them hoes. And they might even say you should leave me alone\nHomie scared. Cause they just like me\nStuntin' is a habit, get it from my daddy\nJust like Shaggy I toat dat boom bastic\nI'm a rude bastard, I don't give a fuck bout ya'll\nI ain't talkin moths but you can pluck my balls\nAnd yes I'm falling but up I fall and if ya bitch in heat she can fuck my dog\nI went from penny pinchin to private planes\nNever sat on any benches, I got in games\nStarter carter ball harder, ten girls penthouse suit ya'll order\nWhatever ya'll please.. wine crackers and cheese\nThey take off their clothes and put on my t's\nThis supplement im on got me feeling mighty\nMy gun and money don't split call that shit Siamese\nMy watch make the frickin' time freeze\nYah girl bless me she suck my dick when I sneeze\nCheap ass apartment, just the kitchen I need\nAnd eighteen G's is why the chicken cross the street\nWhatchya know about it my niggas so about it\nIf we kill everybody they can't go to court about it\nWeezy I ignore the liars, baby I ignite the fire, I am like a Michael Myers, leave your body in the dryer\nGot the shoty on the side of me, my bad boys follow me\nIm a bad boy obviously, pop one at your ivy league\nI dont have a rivalry if so you will have a casualty, oops I meant a casualty, oops I meant catastrophy, oops I meant actually\nYou niggas is just ass to me, and big wet pussy is more like what I'm rathering\nWelcome to the gathering, welcome to the burying, or I hang ya on the wall like an art gallery\nYou got short salary, and I got long money, I got cash money, I got young money.. bitch...\n\nDj Drama: See I told ya'll it'd be well worth the wait right?\n\nWayne: Dedication threeee", "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg"}], "artist": "Drake"}