{"songs": [{"title": "Flowers", "album": "Bulletproof Wallets", "year": "2001-11-13", "lyrics": "[Verse 1: Raekwon]\nSee me in the club, got a gun on my leg\nSelect paper and invade all the illest niggas tally up paid, yo\nLive Crew meetin', layin' in the lab with robes of fly Mo\nWe hold all niggas eatin'\nRacquetball gangsters, unleash the law straight up\nColorful drawers, bad whores on the weekend\nEat it raw style like Flounder\nFuckin' with mine or how we design, my niggas might find ya\nLayin' in the Tropics, big dick shit on park\nThe way his Clarks look, niggas on topics\nMovin' out, colored Durangos, picture me broke\nThat's like picture rich niggas with the same coats\nOr rich niggas with the same coke\n\n[Verse 2: Method Man]\nYou can catch us cruisin', ballin' a ship, fully equipped\nOn a StarTAC, callin' a bitch, I'm what you get\nWhen that Absolut and Hennessy mix (Ultimate! Ultimate!)\nWu shit, my whole clique (Ultimate! Ultimate!)\nRub-a-dub, ass in the club, showin' me love\nSayin' \"Peac\" to the nigga that thug, I got the drugs\nAnd the .38, snub-nose, striking a pose\nBaby girl spilled her drink on my clothes, the new Girbauds\nLouis Rich, Hot Nikks, nigga, what's happenin'?\nAin't shit, holdin' my dick, smokin' a clip, thanks for askin'\nMashin', the latest fashion\nDance floor packed in, whites, blacks and latins\nAll in together, together for worse or better\nNow I put it down whether it's Methy, Method, or Meth-Tical\nRock, skate, roll, bounce\nI'm bound to wreck your body as they turn the party out\n\n[Verse 3: Raekwon]\nAll magazines lay, fly life we live\nThe lingo was to let y'all niggas know how niggas rep\nI'm set lightin' the Purple in a new Lex\nTriflin work, let's murder everythin' that move on the set\n\n[Bridge: All]\nI better pay Big Mama for using his lyrics\n\n[Verse 4: Superb]\nAnd my mouth stay dry cos I swallow the struggle\nI might connect you to a VCR after they plug you\nI'm not a gangster and I hate thugs, too\nI'm just a nigga that paint a picture without a paintbrush, too\nWithout a paintbrush, too\n\n[Verse 5: Ghostface Killah]\nBulletproof Wallets, 20G kitchens sets made out of Korea\nTop Sear, gots to be a lots to see a rocks\nKnots we re'd up behind the stove askin' how Maria popped Lea\nCursed out Nia, burst out her purse\nWith the gods you jeer from Stark's Pizzeria\nPeace, hate to be ya, especially when them shots ring off\nIn slow motion when yo' head hit the meter\nYou lost two liters, at the same case speeder\nPeter slid through, shook 'em down for his reefer\nJames chased Theresa with a hatchet on Easter\nTwo murders in the hood, we call it double features\nWatch how I eat this, freak the best teacher\nAfter prayer with the preacher, I get skied in the bleachers\nAnd your girl, I might eat her\nI'm a lover, not a biter, I still catch her for a pizza\n\n[Superb]\nYou can be as good as the rest of 'em or as bad as the worst\nSo don't hate me, you better move over yeah!\n\n[Outro: Ghostface Killah]\nYou fucking idiots!\nWallets motherfucker!\nAll my shit is bulletproof\nBulletproof projects, bulletproof wallets\nR.A.G.U., you heard, you bird-ass niggas\nY'all niggas ain't got a chance", "image": "https://images.genius.com/f4093661813b3ac25f7c044e4b1e305d.899x899x1.jpg"}], "artist": "Ghostface Killah"}