{"songs": [{"title": "The Meth Lab", "album": "The Meth Lab", "year": "2015-08-21", "lyrics": "[Intro]\nI'll give you three seconds to come out wit' your hands up, one, two\nThis is my own private domicile\nI will not be harassed, motherfucker!\n\n[Verse 1: Method Man]\nWelcome to the Meth Lab, listen, it's time to cook\nNot confessions of a video vixen, we by the book\nStart the fire, I can tell what you thinkin' just by a look\nI'm a crook, like some fish in a barrel, I got 'em hooked\nBlame the Method, your sanity took, go 'head, admit it\nYou a meth head that live on the edge, just need a push\nI'm your pusher, supplier, I'm back, the cheese on the wire\nIf a snitch burnin', wouldn't even piss on the fire\nNow you kids learnin', I ain't tryin' to preach to the choir\nNow the kids earnin' like them dealers that he admire\nGot that whip workin' like I'm sacrificin' a virgin\nThat's a burden, but I'm certain you're feelin' it, after you try\nYou can't deny I cook a batch like, 'Woo'\nHazardous material, you'd need a hazmat suit\nNow you lookin' at me like, 'What's a hazmat suit?'\nSomethin' used to move a body, you don't have that loop\n\n[Bridge 1]\nLet's talk about trust\nI told you not to cook my recipe\nAnd you went ahead and did it anyway\nCause I never said I wouldn't cook it\nCause it ain't yours, it's ours, bitch\n\n[Verse 2: Hanz On]\nHookers in the kitchen, chemistry is the best recipe\nEspecially this shit, I'm takin' on bets\nPressure cookers, percolate 'em like chefs\nMeth labs here to the West, wools on them gear trims grassed\nMr. Barker, General, front and center (What up?)\nGot them burners wit' them bodies on them, have me in cuffs\nKiller's focused, slam it up in them trucks\nEyes low, grippin' the toast, trigger finger, playin' it close\nYou think it's a game? It's imperative, we show 'em we live\nThese niggas playin' wit' this money, funny how niggas die\nThey say it's over when the fat kid cry, ratchets fly here to the Chi'\n\n[Bridge 2]\nYou think you can stop me from cookin'?\nYou cook whatever you like, as long it's that B work\nThese niggas be runnin' around in the street wit' everyday\nDon't even think about usin' my grade A\nYou should try and stop me, bitch\n\n[Verse 3: Streetlife]\nI'm in the meth lab concoctin' another concoction\nDecisions, decisions, just weighin' my options\nThe formula highly addictive, it's habit forming\nSide effects life-threatenin', the surgeon's warnin'\nI write a prescription just for meth abusers\nRegulate your dose intake for heavy users\nFor generations, I been servin' these rap fiends\nBabies born addicted to the metric, know what I mean?\nYou're recoverin', but you still use frequently\nSo wet your court hearin', judge show some leniency\nCan't escape old habits, so you copy the new shit\nWit' your kids in your cars, see, pumpin' that Wu shit\nWe worldwide, supply and demand, I got the upper-hand\nCheck my passport, global support\nInformant lands non-commercial goods, that raw and uncut\nThat got them breakin' bad at the gate for the re-up\n\n[Outro: Method Man and Streetlife]\nWhat up, Street?\nYo, what up, man?\nWe gon' put some \"Welcome to the meth lab\" on there\nMan, you know, it's straight gutter shit, nigga\nYeah, you ready to get 'em this time?\nYeah, always, man\nAlright, so I'm a leave it up to you\nGo 'head, show 'em what you got", "image": "https://images.rapgenius.com/fafd5b6184e352f00d35852ac8b31946.1000x1000x1.jpg"}], "artist": "Method Man"}