{"songs": [{"title": "Magnus Carlsen", "album": "The Documentary 2.5", "year": "2015-10-16", "lyrics": "[Produced by Bongo]\n\n[Verse 1: Anderson .Paak]\nTie on a bandana, then we lay him out\nFighting over two colors in the crayon box\nIt's no love, It's no love\n40 ounces in my cup, I'm po'd up\nWe out here killin' each other, but so what?\nKeep it up and there's gon' be no Crips and no Bloods\nNigga take a look around, the crack game has slowed up\nThe government versus the people, now tell me\nWho rules the world with only one desire?\nI don't believe there's anything higher\nRather get it now than to read about the outcome\nI'd rather have the crown, than a ribbon or medallion\nAnd oh my days, I guess it's okay\nIf I lay up in the shade when my rent is in the mattress\nBut be at the course if I have to use patience\nI'm shootin' a premature dream in the napkin\nBattlin' the evils in the flesh that I'm wrapped in\nWaiting for my eagle, but the seagulls are distractin'\n\n[Bridge: Anderson .Paak]\nWhat's happenin', niggas?\nWhat's happenin'?\nWhat's happenin'?\nWhat's happenin'?\nWhat's happenin'? Yeah\n\n[Verse 2: The Game]\nWhat's happenin'? My nigga just died from AIDS\nWhat's happenin'? ISIS throwin' grenades\nWhat's happenin'? White boys shootin' up a church\nWhat's happenin'? My nigga 2-2 just got some work\nWhat's happenin'? You can get it if you got it, nigga\nBut I ain't got it, nigga, I'm just a solid nigga\nWho run Compton, fuck bitches and flick Impala switches\nEven if I was born blind, you niggas couldn't stop my vision\nRight on time with mine thanks to them old Doc prescriptions\nWest side flourishin' again, this what 2Pac envisioned\nObama freeing lifers, that was locked in prison\nEl Chapo said he ran the world, and they forgot to listen\nNot me, nigga, one split second, I say \"Fuck rap\"\nAnd if I ran into El Chapo, he had work as one his captains\nAnd gave me 100 bricks and said \"'Migo, get it bracking\"\nI walk into a Mexican Mafia meeting like\n\n[Bridge: Anderson .Paak]\nWhat's happenin'? Pac's gone, Brenda's still got a baby\nWhat's happenin'? Lost ones in the land of the crazy\nWhat's happenin'? You can have a bad bitch in a Mercedes\nBut that don't make your basic ass Beyoncé or Jay-Z\nWhat's happenin'? Obama 'bout to move out the White House\nWhat's happenin'? Couple 'hood niggas 'bout to roll them dice out\nWhat's happenin'? Is you gon' let me use your EBT card? (yeah)\nI wonder if I could slide it for commissary, yah\n\n[Chorus: Anderson .Paak]\nAin't it a shame?\nAnother lost one runnin' again\n(You know I bust my thang for you)\nYou do the same old thing that your brothers did before you\nPlannin' your whole life under concrete in the soil\nJust a continuation, I wonder where you get your game from\nIf I know anythin' it's that my old head taught me all alone\nAnd it's a cold game, better get your coat, get your snow chains, man\nIt's a chess game full of kings and pawns\nBlack and white squares, just depends what side you on\n(What side is you on? What you want?\nWhat you want? What you want?)\nI want a red '64 Impala with them things on it\n\n[Verse 3: The Game]\nBlack out inside an abandoned crack house\nOnly thing from last night was dead bodies and glass pipes\nThat was the age 4, and by the age 10\nThey opened up the caged doors and let the fuckin' beasts out\nFuck my auntie couch, I'm 'bout to take the street route\nAnd get my shit the gangsta way, cause I can't be no Steve Stoute\nI'm too Nas for these niggas, I got a surprise for these niggas\nPotato cookin' on the barrel, I bring the fries to these niggas\nFuneral hall, casket fit to the size of you niggas\nChrome 45, no lie, come say goodbye to you niggas\nSway got all the answers, Kanye lied to you niggas\nI don't even wanna be in no top 5 with you niggas\nI break ties with you niggas, then pay tithes for you niggas\nLos Angeles king, I will no fly zone you niggas\nTake a caravan and Impalas and drive to you niggas\nClose one and aim, Fetty Wap's eye to you niggas\n\n[Chorus: Anderson .Paak]\nAin't it a shame?\nAnother lost one runnin' again\n(You know I bust my thang for you)\nYou do the same old thing that your brothers did before you\nPlannin' your whole life under concrete in the soil\nJust a continuation, I wonder where you get your game from\nIf I know anythin' it's that my old head taught me all alone\nAnd it's a cold game, better get your coat, get your snow chains, man\nIt's a chess game full of kings and pawns\nAll I ever wanted was to ride my '64 down 'Shaw\nUh, I'ma spit them verses for my niggas\nDreams comin' true, don't it always paint a perfect picture", "image": "https://images.genius.com/72a00bceccb1bffdad5f44c0094145dd.1000x1000x1.jpg"}], "artist": "The Game"}