{"songs": [{"title": "Freestyle On Tim Westwood", "album": null, "year": "2000-01-01", "lyrics": "{Freestyle over Jay-Z's 'So Ghetto'}\n\n[Intro: Eminem (Proof)]\nYeah. Now I'm getting distorted. (Can you turn it down) When I was...I should've been aborted. But it was too late...uh oh. (Uh oh) Yo, just turn up the beat a little bit. I don't care if the mic is distorted. Fuck it\n\n[Eminem]\nThat's it, that's it, gotta hit than pass it\nI'm blasted off a tab of acid\nFlabbergasted\nHopped in a cab and blasted the cab driver\nI said...haha\nHold on a minute\nGive me infinite beats that I can kick for a minute\nY'all don't understand\nThe way that I got this mic in my hand\nKilling any MC who stands or sits or walks\nOr is handicapped\nIt doesn't matter, Mr. Handicap, hand me that\nHaha\nI clap hands with the rap fans\nJump in their wheelchairs and give 'em a lap dance\nI'm the illest MC who will kill this\nAnd what?\nAnd Die Hard like who?\n(Bruce Willis)\nThank you very much that's a fucking cliche\nBut I will rock the microphone and don't care about what he say\nOr they say or I say or we say or them say\nEminem say shit that only Slim say\nOr Slim says\nFuck a les\n-bian in her ass\nKorean or a...\nHaha\n\n[Interlude: Proof talking]\nAyo, let me try something. Uh uh uh uh uh uh. I'm not free in here, check it out\n\n[Proof]\nI rap if there was no rap within a soul clap\nExpose wack rappers and smack 'em with my bozack\nFlatten 'em like inner tubes\nPunch my fist through the torso of thinner dudes\nAnd when I'm in the mood make a serious winner lose\nGet high of gin and booze\n\n[Eminem]\nHahahaha\nIn an inner tube\nWhile I'm in the nude\nWith a centerfold\nIn the winter cold\n\n[Proof]\nAyo we give it though\nGive me an envelope\nI get open with Tim Westwood show\nAnd Cypher Sounds I strike you down\nDon't like the way you sound, you wack now\nYou got my style packed down or should I say down pack\nAny MC's will tell you right now that you sound wack\nCall us up and then we make noise then see shells\nWe shall prevail you faker than Lee Nails\nAnd we tell D-12 to all those that don't know\nFlow for flow we rocking your radio\nHow you feel right now?\nC'mon Shady flow\nYo, yo, yo\n\n[Interlude: Eminem and Proof talking]\n[E] Yo, turn the beat up a little bit\n[P] I know, it's like the beat is like mad low\n[E] Hello, hello, hello, check, check, check\n[P] Hello\n[E] Check, check, check\n\n{beat switches to LL Cool J's 'Ill Bomb'}\n\n[E] What, what?\n[P] Awwww shit\n[E] Yo, turn it up a little bit\n[P] Yeah, just turn it up, up, up, up\n[Cypher Sounds] C'mon Tim turn it up\n[E] Yeah, just turn it up Tim\n[P] Let it be distorted. Yo, yo, yo\n\n[Eminem]\nTrapped in a cinema, in a material world\nCriminal, cops scour the rural area thorough\nCause I kissed a girl, married a girl\nCarried a girl to the cemetery, buried a girl\nAnd I'm desperate, no one to mess with\nAlways get arrested for something domestic\nAnd I kill the way you met me\nYou'll never catch me, cops can't sketch me\nYou can't upset me, no matter how bad\nHow mad you get me\nProblem with y'all, I'm letting the Tec speak\nWent from sweet to hard\nBeat the odds\nFrom no hoes to show, quit the pizza job\nNo more fools to rob, no more geeks to rob\nNo more stolen cars, no more Visa cards\n(Visa cards)\nSlim Shady\n(Slim Shady and D-12)", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}