{"songs": [{"title": "The Wash", "album": null, "year": null, "lyrics": "[Dr. Dre (Snoop Dogg)]\nAs the wheels turn city to city, hundred-spoke\nChronic smoke, twist up another Phillie (Done dilly)\n(Them niggas still trippin' off that old shit) Really? (How silly)\nIt's a whole nother day (Yeah it is)\nSnoop Dogg (and Doc Motherfuckin' Dre) Nigga can ya feel this?\n(It's the D-O-double, ya don't run up ya won't see no trouble)\nIf you caught up in these fuckin' streets\n(Who you gon' call when them niggas gettin' ready to blast?)\nYeah, and if that shit's gettin' ugly\n(Who you gon' call when them niggas come to get in ya ass?)\n\n[Snoop Dogg]\nI came to get in that ass\nBigg Di-Dogg, push the big hid-ogg\nYou're hoppin' and poppin', how bout you hop up off my bid-alls\nGot dirt on my pid-aws, I broke a few lid-aws\nIt really don't matter cause I'm only here to spit on\nAnd get on and shit on niggas\nDo it to 'em D-O-double, right on nigga\nI'm saggin' it, baggin' it, slangin' dubs\nYou motherfuckers think The Wash is all soap and suds?\nWhat's up cuz? If you tryin' to get a dub sack page me\nThe hoes say \"Dee Loc, you so crazy\"\nPoppin' that shit don't faze me\nI need my chips and the dip, it's like gravy\n\n[Dr. Dre]\nNow back to the lecture at hand\nPerfection is expected and I'm feelin' that demand\nLos Ang', broad day gunnin'\nThat ain't no earthquake it's just Dre comin'\nIf this shit ain't played the party ain't bumpin'\nIf I don't show up the hoes ain't fuckin'\n(Real talk) Cali sunshine, come visit\nJust don't stop at stop signs with bullet holes in it\nAll-Star League, you ridin benches\nI handles my business, FUCK fake niggas\nI sell game a quarter million a track\nSnoop and the Good Doc back with a brand-new sack\nShit's wrong, money gone, I'll blast\nOut of town, out of bounds, no pass\nRunnin' up, talkin' shit, get smashed\n(Shoot first) Ask questions last\n\n[Snoop Dogg]\nFallin' back on that ass\nHit the switch and let the ass just drag\n2001, 2002 tags... My nigga what you holdin'?\nStep out with the Stacey's and the Snoop Dogg Clothin'\nRollin', with the braids in my hair\nCripped out, way pimped out, oh yeah\nYou gots to pay the cost to be the boss\nAfter all that dirt I gots to get my shit washed\n\nThe Wash\n\nThe Wash\n(ahhhh)\nThe Wash\n(ahh, ahh)\nThe Wash\n(ahhhh, ahhh)", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}