{"songs": [{"title": "Mosh", "album": "Encore", "year": "2004-10-26", "lyrics": "[Intro: Kids' voices + Eminem]\nI pledge allegiance to the flag\nOf the United States of America\nAnd to the republic for which it stands\nPeople!\nOne nation, under God, indivisible\nIt feels so good to be back!\nWith liberty and justice for all\nMosh with me now!\n\n[Verse 1]\nScrutinize every word, memorize every line\nI spit it once, refuel, re-energize, and rewind\nI give sight to the blind, my insight through the mind\nI exercise my right to express when I feel it's time\nIt's just all in your mind, what you interpret it as\nI say to fight and you take it as \"I'ma whip someone's ass\"\nIf you don't understand, don't even bother to ask\nA father who has grown up with a fatherless past\nWho has blown up now to rap phenomenon that has\nOr at least shows no difficulty multi-taskin'\nAnd juggling both, perhaps mastered his craft slash\nEntrepreneur, who's helped launch a few more rap acts\nWho's had a few obstacles thrown his way through the last half\nOf his career, typical manure, moving past that\nMr. Kiss-His-Ass-Crack, he's a class act\nRubberband Man – yeah, he just snaps back\n\n[Hook]\nCome along, follow me\nAs I lead through the darkness\nAs I provide just enough spark that we need\nTo proceed, carry on, give me hope\nGive me strength, come with me\nAnd I won't steer you wrong\nPut your faith and your trust\nAs I guide us through the fog\nTo the light at the end of the tunnel\nWe gon' fight, we gon' charge, we gon' stomp\nWe gon' march through the swamp\nWe gon' mosh through the marsh\nTake us right through the doors, come on!\n\n[Verse 2]\nAll the people up top, on the side and the middle\nCome together, let's all form and swarm just a little\nJust let it gradually build from the front to the back\nAll you can see is a sea of people, some white and some black\nDon't matter what color, all that matters we're gathered together\nTo celebrate for the same cause, no matter the weather\nIf it rains, let it rain – yeah, the wetter the better\nThey ain't gon' stop us, they can't\nWe're stronger now more than ever\nThey tell us \"No!\" we say \"Yeah!\" They tell us \"Stop!\" we say \"Go!\"\nRebel with a rebel yell, raise hell, we gon' let 'em know\nStomp, push shove, mush; fuck Bush!\nUntil they bring our troops home, come on, just—\n\n[Hook]\nCome along, follow me\nAs I lead through the darkness\nAs I provide just enough spark that we need\nTo proceed, carry on, give me hope\nGive me strength, come with me\nAnd I won't steer you wrong\nPut your faith and your trust\nAs I guide us through the fog\nTo the light at the end of the tunnel\nWe gon' fight, we gon' charge, we gon' stomp\nWe gon' march through the swamp\nWe gon' mosh through the marsh\nTake us right through the doors, come on!\n\n[Verse 3]\nImagine it pourin', just rainin' down on us\nMosh pits outside the Oval Office\nSomeone's tryin' to tell us somethin', maybe this is God just\nSayin' we're responsible for this monster, this coward\nThat we have empowered, this is Bin Laden\nLook at his head noddin', how could we allow\nSomethin' like this without pumpin' our fists? Now\nThis is our final hour\nLet me be the voice and your strength and your choice\nLet me simplify the rhyme just to amplify the noise\nTry to amplify it, times-it, and multiply it by six\n-teen million people, all equal at this high pitch\nMaybe we can reach Al-Qaeda through my speech\nLet the President answer a higher anarchy\nStrap him with an AK-47, let him go\nFight his own war, let him impress Daddy that way\nNo more blood for oil, we got our own battles\nTo fight on our own soil, no more psychological warfare\nTo trick us to thinkin' that we ain't loyal\nIf we don't serve our own country\nWe're patronizin' a hero; look in his eyes, it's all lies\nThe stars and stripes have been swiped, washed out and wiped\nAnd replaced with his own face, mosh now or die\nIf I get sniped tonight, you'll know why—‘cause I told you to fight!\n\n[Hook]\nCome along, follow me\nAs I lead through the darkness\nAs I provide just enough spark that we need\nTo proceed, carry on, give me hope\nGive me strength, come with me\nAnd I won't steer you wrong\nPut your faith and your trust\nAs I guide us through the fog\nTo the light at the end of the tunnel\nWe gon' fight, we gon' charge, we gon' stomp\nWe gon' march through the swamp\nWe gon' mosh through the marsh\nTake us right through the doors, come on!\n\n[Outro]\nAnd as we proceed\nTo mosh through this desert storm\nAnd these closing statements\nIf they should argue, let us beg to differ\nAs we set aside our differences\nAnd assemble our own army\nTo disarm this weapon of mass destruction\nThat we call our President, for the present\nAnd mosh for the future of our next generation\nTo speak and be heard\nMr. President! Mr. Senator!\n\n[Hailie Jade]\nCan you guys hear us?", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}