{"songs": [{"title": "You’re Not Gangsta", "album": "Return of the Dozen Vol. 1", "year": null, "lyrics": "[Hook: King Gordy]\nI say he always talking that Gangster shit\nWell tell me just how much dirt have you done?\nWell if you ask me, frankly I think you a bitch\nNever sold no dope, never shotted my gun\nYou're not a G please, you're not a G see, there ain't a gangster bone in his body no!\nYou're not a G please, you're not a G see, this poor guy wouldn't hurt nobody no!\nYou're not a G!\n\n[Verse 1: Bizarre]\nBarking at the video, looking all tough\nWild ass background, hood looking rough (Yeah)\nNigga you ain't a G, softer than Anne Marie\nFuck boys, wouldn't even harm a flea\nThis nigga ain't no fool, went to Catholic school\nFive bedrooms, large swimming pool\nThis niggers a clown, he ain't carrying no pound\nOnly dirt he did when he played in the playground\nHe claiming 7 mile\nBut that ain't his hood\nHe from 18 in Gratchet\nOff in the woods\nBeef, he's the first nigga to say something\nWhen its time to scrap, he's the first nigga running\nPour that burner, snipe like Wesley\nNiggers start fighting and this nigga left me\n\"Where da fuck you at, man?\nMan what?\nYou ain't see me getting rushed?\nNo man, I was smoking a square\nYou ain't see me getting rushed\nWhere they at?\nMan!\"\n\n[Hook: King Gordy]\n\n[Verse 2: Swifty McVay]\nYou're fake and forging it\nHanging with impostors\nYour fathers a pastor\nHe graduated from Harvard\nThere's not a hustle in you\nStanding in the line for a couple hours at the venue\nCause ain't nobody tryin' let your broke ass in\nAnd you're street cred is horrible\nWe be shootin' dice while you're partner shootin' marbles\nWhen the car pull up you look at them like 'what the fuck?'\nWith enough shit in your pants to hide them little nuts\nYou wearing wife beaters\nBut ain't never beat your wife, guy\nShe's too busy tying up that t-shirt in a not (ha)\nThe only thing you ever saw you stole it from your pops\nAnd never lift a shop cuz you're stupid-ass to not put the bullets\nIn it and left the house gotta snatch about the blouse\nHow do you lit a Glock with no slugs get inside your mouth?\nThat's the shit I'm talking 'bout\nA straight snitch, a bitch with black leather on your birth certificate\n\n[Hook: King Gordy]\n\n[Verse 3: Kuniva]\nFirst name is \"Spender\", middle name is \"About To\"\nLast name is \"Almost\" its easy to spot you\nCuz is always speaking on 'what he was spend to do'\nHe was about to fuck somebody up, and almost did it to\nThe last one to swing but the first to book out (I'm Out!)\nThe niggas get dirt he always wanna be look out\nRunning with the real ones, getting in the beef\nBut when shit goes down he ain't nowhere in the streets\nWalk with me quick\nThe loudest of the bunch, talking reckless\nActing tough, starting shit because in deep you know a nigga like that\nPlease stay away cuz is most likely he gonna get your ass shot one day\n{Blaow!}\n\n[Hook: King Gordy]", "image": "https://images.genius.com/ee35f41ed149c86d6fe47f68d55c39e1.450x450x1.gif"}], "artist": "D12"}