{"songs": [{"title": "The Nation", "album": "No Genre Pt. 2", "year": null, "lyrics": "[Hook: Victoria Monet]\nBaby, don’t you know\nEverything you do away from home\nCould leave me here alone\nSo baby don’t you go, no\nNo, no\nNo-o-o-oo\nNo, no\nNo-o-o-oo\n\n[Verse 1: B.o.B.]\nI saw a kid 12 years old, with a pack of cigarettes and a Glock\nCause in this ‘partments it was easy to cop\nLooking for a nigga slipping, yeah they easy to spot\nIn the streets the enemies are just as evil as cops\nThe only word he ever heard from his pops was\nIf this the devil’s world then who hangs out at the top\nHe had cocaine dreams, and Scarface nightmares\nI thought to myself, does anyone in this life care\nGrowing too fast like his days are lightyears\nHis mama says go to church, you need a light prayer\nYou think the streets need you? Well I need you right here\nYou need to slow it down, cause the streets don’t fight fair\nFor real!\n\n[Hook: Victoria Monet]\nBaby, don’t you know\nEverything you do away from home\nCould leave me here alone\nSo baby don’t you go, no\nNo, no\nNo-o-o-oo\nNo, no\nNo-o-o-oo\n\n[Verse 2: Jake Lambo]\nIt’s easy to get in trouble in the place where I’m from\nNiggas lacking the education but be packing a gun\nI just kick it with the homies and be having some fun\nMama keep calling, I understand you protecting your son\nYou found that I be smoking and I know it makes you mad\nAnd I know you see his trace, scared I'ma be just like my dad\nScared I’m doing something bad, scared I might end up dead\nWell look I chose another path so get those worries out your head\nI'ma keep on doing it how I’m doing it\nStay working hard, making this music and\nShow you I got to get it, I do\nThey asking my motivation and I reply that it’s you mama\n\n[Hook: Victoria Monet]\nBaby, don’t you know\nEverything you do away from home\nCould leave me here alone\nSo baby don’t you go, no\nNo, no\nNo-o-o-oo\nNo, no\nNo-o-o-oo\n\n[Verse 3: B.o.B.]\nA deadly trend that never ends\nCity full of negligence, pregnant pedestrians\nI used to think, 'am I a prisoner or a resident?'\nThey book us for possession but they keep shipping weapons in\nEither the Glock shoots you or a cop do you\nThey set the system up to lock you up a lot sooner\nEverything you try to do they try to out do you\nMy mama said hallelujah cause I got a future\nI got a future after something newer\nThey try to sell you bullshit because it sounds cooler\nAnd if you stand out from the crowd they label you a loser\nDon’t throw your life away, don’t let your eyes fool you\nThat’s how they use you\n\n[Hook: Victoria Monet]\nBaby, don’t you know\nEverything you do away from home\nCould leave me here alone\nSo baby don’t you go, no\nNo, no\nNo-o-o-oo\nNo, no\nNo-o-o-oo", "image": "https://images.genius.com/07af9b12b2956baf31b88d2ae47697d2.500x500x1.jpg"}], "artist": "B.o.B"}