{"songs": [{"title": "Ludaversal (Intro)", "album": "Ludaversal", "year": "2015-03-31", "lyrics": "[Intro]\nMic check, 1 2\nI'm just going to get right to it\nLuda!\n\n[Verse 1]\nAin't nobody fuckin' with me when it come to getting lyrical\nMurdering the rapper and killing beats nigga\nI'm cinematic making everybody panic\nI be bustin' like a fully automatic feel the heat nigga!\nWe can battle in the Phantom in Atlanta the rover in Minnesota or the Arizona streets nigga\nThey sayin' all these offensive lines I snapback it's the quarterback sneak nigga!\nOne time for the sneak dissers Ol' puss ass fuckboys say my name!\nAnybody coming at me know I never back down killing a rapper is my claim to fame!\nYou lame\nAnd my flow is what expose in these hoes even on a nigga worst day\nThey say Luda don't want it no mo'\nNo nigga I'm as hungry as the first day\nWhat you want how you want it you can get I'm the definition of a real g from the south side\nThe crime scene be the studio get the yellow tape and the chalk and I'm leaving everybody outline\nI'm all about mine\nGetting paid getting laid getting clothes getting hoes getting green back\nUsed be like everybody is a lil kid now Big Boy,  outcast like three stacks\nLaying all it in the Cadillac with a red bone giving me dome my music on with the seats back\nLudacris this is album number 8 and my pockets gonna be straight\nEven if a nigga leak that\nTimmy all up on the David Banner track with Janet Jack in the back like \"Damn Luda freak that!\"\nBreak it down like you dropping to the ground but we like the 808 in Atlanta so bring the beat back\nSample had to eat that\nCouldn't control alt or delete that\nBut put any other rapper on the track and I guarantee they'll never know how to treat that\nI'm a boss I'm a king I'm a legend Imma drill it in your head till you doze off\nAnd I just so happen to be the type of rapper that make your women want to take her clothes off\nSo let's get to the action\nLet's get to the show\nI'm been getting to the Forbes list six year straight let's get to the do'\nShout out to the Luda Nation\nAll my fans just got live\nAnd they waitin' for everybody to put me in the rapper category of ya top five\n\n[Instrumental Bridge]\n\nLet me get it back\n\n[Verse 2]\nEver since I\nCame in the game it ain't never been the same\nCan't nobody do it like me\nIs it ever gonna be another Luda you know that'll never happen that's highly unlikely\nKnowing that I'm better than everybody you put me up against I'm in the hall of fame\nSo fuck call to call we can go bar for bar I'll put your name up on the wall of shame\nAnd everyday is the same thing\nLooking for another way for me to make paper\nI think it's time for every single rapper to go to church\nWhoever is my opponent you better pray first\nThey like \"Luda why you rapping so fast?\"\nI'm like \"Bitch why you listen too slow?\"\nI'm the truth in the booth and they can't keep up hardly cause I always hit em with a new flow\nAnd the two door with the coup low with the Hublot off the window with the two low blades from the top like judo listening to bruno on the way to school though getting kudos from a few hoes and they from the choose though\nCuz I'm numero uno and the crew know it's a couple loop holes when it come to fluke hoes cuz some of they pussy bite like Cujo\nBut back to the you know who\nI can't stop till you tell me I'm the greatest\nIf you need a reminder then put the whole song on repeat and continue to play this\nBetter turn your stereo louder\nListen up and let me preach\nAnd let's get arrested for disturbing the peace\n\n[Outro]", "image": "https://images.genius.com/62819740802d113d74cdf35e32db7990.1000x1000x1.jpg"}], "artist": "Ludacris"}