{"songs": [{"title": "One Shot 2 Shot", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro: Fatt Father]\nI told y'all motherfuckers I was coming back (oh shit)\nWhat now nigga? What now? What? Brewster Projects nigga\n\n[Hook: Eminem]\nOne shot, two shot, three shots, four shots\nAll I hear is gunshots, this is where the fun stops\nBodies drop, hit the floor, music's off, party stops\nEverybody hit the door, somebody's licking shots off\n\n[Verse 1: Bizarre]\nSecurity's gone, I'm trapped in the club\nAnd I'm trying to run and get my motherfucking gun\n(Nigga what about yo' wife?) Nigga fuck my wife\nI'm trying to run and save my motherfucking life\nOh, shit! The shooter's coming\nBitches hollering, niggas running\nPeople, shot all over the floor\nAnd I'm trying to make it to the Saint Andrew's door\n(Hey man) ...That's the sound of the Glock\nEven DJ House Shoes fucked around and got shot\nI done messed around, and forgot my TEC\nI don't see nobody, but Fatt Father and Hex\n\n[Verse 2: Kuniva & (Eminem)]\n(Kuniva, you alright?) These niggas is tripping\n(Where's Bizarre at?) (I don't know, man)\nI'm trying to slip through the exit and get to where my car is at\nBitches screaming everywhere and niggas is wylin'\nTwo minutes ago we was all joking and smiling\nThis chick is clinging on to me, sobbing and sighing\nSaying she didn't mean to diss me earlier and she crying\nBut it's real and it's on and caps is getting peeled\nSo I hugged her and used her body as a human shield and\nShe got hit and now she's yelling (Don't leave me!)\nI told her I'd be right back and the dumb bitch believed me!\nI squeezed through the back door and made my escape\nI ran and got my .38 I hope it's not too late!\n\n[Hook: Eminem]\nOne shot, two shot, three shots, four shots\nAll I hear is gunshots, this is where the fun stops\nBodies drop, hit the floor, music's off, party stops\nEverybody hit the door, somebody's licking shots off\n\n[Verse 3: Swift & (Kon Artis)]\n(I been trying to call you all day motherfucker where you at?)\nI'm on 7 Mile...what the fuck was that?\nDamn, somebody hit me from the back!\n(What with? They car?) With a gat nigga, and my tire flat\nAnd I just hit a pole, them niggas some hoes\n(Is you hit?) I don't know, but I can tell you what they drove\nIt was a black Mitsubishi (Shit, that's the clique we beefing with)\nMan! (I swear) And I was on my way there\nBelieve me, I'm leaving a carcass today\nAnd I'ma park my car and walk the rest of the way\nI'm in the mood to strut, my AK ain't even tucked\nI'ma meet you at the club, we gon' fuck these hoes up!\n\n[Hook: Eminem]\nOne shot, two shot, three shots, four shots\nAll I hear is gunshots, this is where the fun stops\nBodies drop, hit the floor, music's off, party stops\nEverybody hit the door, somebody's licking shots off\n\n[Verse 4: Eminem]\nI never seen no shit like this in my life before\nPeople are still camped out from the night before\nSleeping outside the door, waiting in line still\nTrying to get inside the club to see D12 perform\nThe fire marshals know the venue's too small\nPeople are wall to wall, three thousand and some odd\nFans and some cum-wad from out the parking lot\nGets in an argument over a parking spot\nDecides to pull his gun out and lets a few of them off\nMissed who he's aiming for, six feet away’s the door\nInto St. Andrew's Hall, now the strays flying all over the place\nGrazed one bitch in the face\nAnother one of 'em came through the wall\nBefore anyone could even hear the first shot go off\nI'm posted up at the bar, having a mazeltov\nBullet whizzed right by my ear, damn near shot it off\nThank God I'm alive, I gotta find Denaun\nAnd where the fuck is Von? He usually tucks one on him\nWait a minute, I think I just saw Bizarre\nNah I guess not, what the fuck? Oh my God, it was!\nI never saw him run so fast in my life\nLook at him hauling ass, I think he left his wife\nThere she is, on the ground, being trampled\nI go to grab her up by the damn hand, but I can't pull her\nGod damn, there just went another damn bullet\nI'm hit, my vest is barely able to handle it\nIt's too thin, if I get hit again I can't do it\nI scoop Dee, follow Bizarre's path, ran through it and\nMade it to the front door and collapsed\nOn the steps looked up and I seen Swift\nShooting it out but I can't see who he's shooting it out with\nBut Denaun's right behind him, squeezing his four-fifth\n\n[Hook: Eminem]\nOne shot, two shot, three shots, four shots\nAll I hear is gunshots, this is where the fun stops\nBodies drop, hit the floor, music's off, party stops\nEverybody hit the door, somebody's licking shots off\n\n[Verse 5: Kon Artis]\nYo, it's Friday night, came to this bitch right\nBig ass on my left, hand Desert Eagle in my right\nI ain't come in this bitch to party, I came in this bitch to fight\nAlthough I can't stay here to fight 'cause I'm popping niggas tonight\nThat's right bitches I'm drunk with revenge\nShot a bouncer in the neck for trying to check when I get in\nSwift told me to meet him here, so it's clear that the schmuck\nThat shot out the back of his truck is up in this motherfucker\nSo one shot for the money, two is to stop the show\nThe third's for the bartender (bitch bring me a bottle of Mo')\nI just wanna know who driving the black Mitsubishi?\nHe tried to run, so Proof shot him in the knee with a three-piece\n\n[Hook: Eminem]\nOne shot, two shot, three shots, four shots\nAll I hear is gunshots, this is where the fun stops\nBodies drop, hit the floor, music's off, party stops\nEverybody hit the door, somebody's licking shots off", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}