{"songs": [{"title": "So Hardcore", "album": "When Disaster Strikes...", "year": "1997-09-23", "lyrics": "[Intro]\nZiggy, ziggy, ziggy, ziggy, ziggy, ziggy zig\nHa-ha-ha, yo\nYo, yo, yo, yo, yo, yo\nYo, yo, yo, yo, yo, yo, yo, yo\nYo, yo, yo, yo, yo, yo\nYo, yo, yo, yo, yo, yo, yo, yo\n\n[Verse 1]\nYo, I walk through brick walls\nFuck around hijack your whole shoppin' malls\nI be rippin shit, that's my word bond\nScream, then I watch the whole planet earth respond\nDo just what ya told, the remote control\nCrash course ya shit, you know how we roll\nWhen I tumble and drive and you reply\nMy, my, my, my-my-my!\nYo, I execute all plans\nRun up in two bitches for me and my mans\nHa, breakin fool, ha, for my fans\nIn return niggas give me the hot SoundScan\nHa, strike matches, golden egg hatches\nRequest line is open send all your faxes\nFreaks the flows with no rehearsin\nRollerskate backwards when the beat start reversin\nYou're so wack you make people start cursin\nFlows contradict worser than the King James version\nTurn on your mic but yo' shit will stop workin\nBeats brutalize ya whole rhyme, yo' head hurtin\nBroomsticks and witches from rags to riches\nWe give mad love while y'all niggas to BURN bridges\nAmateur, why won't you look right at the calender\nA matter of time before I start to damage ya\nSo starvin to just bust my rhyme caliber\nConsecutive wounds like a nigga stabbin ya\nYO! My whole team get WILD cream!\nPolitickin every move to the EX-treme!\n\n[Chorus]\nSo hardcore like Quickdraw McGraw\nFuck what you heard, you ain't heard this before\nSo hardcore like Quickdraw McGraw\nFuck what you heard, you ain't heard this before\nSo hardcore like Quickdraw McGraw\nFuck what you heard, you ain't heard this before\nSo hardcore like Quickdraw McGraw\nFuck what you heard, you ain't heard this before\n\n[Verse Two]\nHa, yo! I come right through the door\nWith rhymes galore Busta Rhymes be ambassador\nExplore my metaphor you beg for more\nHardcore see we a show they insecure\nI said my whole squad of niggas come through and break the law\nMy family tight more than Connect Four\nI come through and create the masterpieces\nBend your mind with rhyme telekenesis!\nYO, I will break shit down!\nLost or found flow will blast like a four pound!\nRight before I hit you off with my vaccine ('cine)\nStarch, carbohydrates, lots of protein!\nMaxine, baby girl yo I hope yo' ass clean!\nMagazine frontin, fly lips is lime green!\nYo, every time, yo, I'm on the scene!\nHigh beam the lights and watch who will remain supreme!\nHa! Yes, you know when I keep it comin'\nBlow the fort, make you resort to handcuffin\nBounce on the beat and watch how a nigga work it\nBuck wild makin yo' speaker short circuit\nThis heavyweight tip the scale on the triple beam (beam)\nBusta Rhymes blast and still bang the mainstream!\nBLAOW! I had to make ya all mad\nHit ya off, interludes, bounce to Trinidad\nNow I see a bitch-nigga soundin so soft\nMake a nigga cough, breakin and turn yo' ass off (off)\nExtra raw lay on yo' back get on the floor\nBusta Rhymes, got to headline the whole tour!\nCause we\n\n[Hook] w/ minor variations", "image": "https://images.genius.com/c81a637e4015a2a4f63a6790ebd3ee6f.1000x1000x1.png"}], "artist": "Busta Rhymes"}