{"songs": [{"title": "What’s My Name", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "[Intro: DMX]\nThis is the fuckin shit I be talkin about\nHalf rappin' ass mothafuckers\nYou think it's a game? You think it's a fuckin GAME?\nCome on, uh, uh, uh\nCome on, uh, uh...\nWhat'cha really want\nWhat'cha really want, what\nD-M-X, uh, uh...\nCome on, Ryde or die\nAiyo, aiyo, aiyo\n\n[Verse 1: DMX]\nWhat's my name?\nDMX and I be the best, you see the rest they looking like they need a rest\nOne more time\nI'ma spit at you some shit that's gon get at you be fuckin with your mind\nStop talkin shit\n'Cause you out there runnin' your mouth and really don't know who you fuckin with\nHere we go again\nHow many times do I have to tell you rap niggas I have no friends?\nYou still actin up\nRunnin around here like some brand new pussy that's about to get fucked\nThe game don't stop\nI'm still gettin down for whatever whenever that's why my shit is hot\nCan't keep it real\nNow, some of us do but most of us don't that's just how a nigga feel\nI shed blood for my people\nThat'll keep you lookin see-through whenever you try to creep through\n\n[Hook x2: DMX]\nD-M-X, If you want it we got it\nCome and get it nigga we wit it, all you gotta do is set it baby\nRyde or die\nWhat ya niggas want, uh, uh, what ya niggas want\n\n[Verse 2: DMX]\nYou still playin games\nYou gon' think it's a joke until they no longer remember your name\nThat's how we do 'em\nMake cowards disappear into thin air by puttin shit through 'em\nNever comin' back\nLast time you saw that nigga is the last time you'll see that nigga\nNo more deaths\n'Cause in a minute you gonna have grandma bein the only family member left\nBust my gun\nIf I gots to kill a nigga but I'm always down for the one on one\nDog for life\nWe gon get to the bottom of this shit if it takes all night\nStop drop, open up shop\nFake up-north niggas screamin' for the cops\nRyde or die\nWhat that mean is that a tell a nigga bye-bye and pop him in his right eye\n\n[Hook x2: DMX]\nD-M-X, If you want it we got it\nCome and get it nigga we wit it, all you gotta do is set it baby\nRyde or die\nWhat ya niggas want, uh, uh, what ya niggas want\n\n[Verse 3: DMX]\nLook at all these off brand niggas\nRunnin' around yappin' about they be holdin figures as big as Jigga's\nThat's that bullshit\nHope they know that around me talkin' about what you got will get you hit\nI'm not a nice person\nI mean I'd smack the shit out you twice dog and that's before I start cursin'\nI stay flippin'\nOne minute I'm cool, the next minute I'm up on a nigga, rippin'\nThat's my style\nI'm a cruddy nigga leave you all bloody nigga, service with a smile\nSuck my dick\nAnd while you niggas that's been to jail before know it's about to get thick\nLet's get it on baby\nYou gonna be goin' against 4 niggas at once and you think I'm crazy?\nI've lost my mind\nAnd I'm about to make you lose yours too from far away one time\n\n[Hook x4: DMX]\nD-M-X, If you want it we got it\nCome and get it nigga we wit it, all you gotta do is set it baby\nRyde or die\nWhat ya niggas want, uh, uh, what ya niggas want\n\nD-M-X!", "image": "https://images.genius.com/f8bed7cc3f32ae94e6747b763836c0fc.220x190x1.jpg"}], "artist": "DMX"}