{"songs": [{"title": "Homicide", "album": "Pluto", "year": "2012-04-13", "lyrics": "[Hook: Future and Snoop Dogg]\nYou say you wanna take a ride? Get in\nI grew up on that other side, getting it in\nYou niggas selling bunch of pies, snatch a Benz\nI heard you say it's going down, I'm going in\nGo tell 'em it's a homicide (murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide, ya ya\n\n[Verse 1: Snoop Dogg]\nFighting, shooting, killing, riding, cripping, tripping, spitting fire\nIn the kitchen, baking pies, taking mines, making mines\nYellow tape, black gun, fill it with them hollow shells\nAnd leave the scene bloody, buddy can't nobody tell\nCatch a plane to the ATL, lay low in a cheap motel\nWhatever suits ya, and get a few thangs from my cousin Future\nNow I'm back on and popping like\nTrapping, rapping in the cut, talk shit, I fuck you up\nThey don't recognize who I am or where I'm from\nSo I hit the strip club banging 20 Crip cuz\nTreble with the bass, put that thang up in yo shavening\nAnd leave yo body bleeding on the pavement\n\n[Hook]\nYou say you wanna take a ride? Get in\nI grew up on that other side, getting it in\nYou niggas selling bunch of pies, snatch a Benz\nI heard you say it's going down, I'm going in\nGo tell 'em it's a homicide (murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide, ya ya\n\n[Verse 2: Future]\nHow many will ride open up that fye\nYou gotta question a nigga standing next to you, cut him off\nI grew up on the side you gotta make yourself a boss\nNiggas'll shit on you any chance they get\nCross you out on a lick\nIf you ain't ready for the ending then quit\nIt's a dirty world, you gotta get your hands dirty\nI'm going for the title with my hands on the rifle\nI put in the same work you put in, survival\nLooking at my rival, they looking suicidal\nKeep them bodies off wax, I can spot a rat\nLet the guitars play, brraaat!\n\n[Hook]\nYou say you wanna take a ride? Get in\nI grew up on that other side, getting it in\nYou niggas selling bunch of pies, snatch a Benz\nI heard you say it's going down, I'm going in\nGo tell 'em it's a homicide (murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide, ya ya\n\n[Verse 3: Future]\nSlang a bunch of packs, and go and snatch a Benzo\nI played them streets as a young nigga, ain't never liked Nintendo\nThem gangstas in the yard, them my motherfucking kinfolk\nThey'll kidnap you and yo broad (in broad) daylight, no pretendo\nI grew up 'round a bunch of monsters, apply that pressure on ya\nBe so scared for ya life, you call the police on ya\nYou ready say you ready\nYou gon' starve or you want fetti? Yo life'll change a second\nGood or bad, don't open yo mouth, make sure you shut it\nAin't no telling who listening, make a wise decision\nI'm from 'cross the tracks, like Boosie\nIf you ride, you better know who shooting\n\n[Hook]\nYou say you wanna take a ride? Get in\nI grew up on that other side, getting it in\nYou niggas selling bunch of pies, snatch a Benz\nI heard you say it's going down, I'm going in\nGo tell 'em it's a homicide (murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide (murder, murder)\nGo tell 'em it's a homicide, ya ya", "image": "https://images.genius.com/14df23a17c7b6fc85a08177f858e5d64.1000x1000x1.jpg"}], "artist": "Future"}