{"songs": [{"title": "Rollout (My Business) - Album Version (Edited)", "album": null, "year": null, "lyrics": "[Timbaland sings repeat 6x]\nRoll out! Roll out! Roll out! Roll out! Roll out! Roll out!\n\n[Timbaland sings roll out! in Background]\nI got my twin Glock .40s, cocked back\nMe and my homies, so drop that\nWe rollin on twenties, with the top back\nSo much money, you can't stop that\nTwin Glock .40s, cocked back\nMe and my homies, so drop that\nWe rollin on twenties, with the top back\nSo much money, you can't stop that\n\n[Ludacris Verse 1]\nNow where'd you get that platinum chain with them diamonds in it?\nWhere'd you get that matchin' Benz with them windows tinted?\nWho them girls you be with when you be ridin' through?\nMan I ain't got nothin' to prove, I paid my dues\nBreakin' the rules, I shake fools while I'm takin a cruise\nTell me who's your weed man, how do you smoke so good?\nYou's a superstar boy, why you still up in the hood?\nWhat in the world is in that bag, what you got in that bag?\nA couple a cans a whoop ass, you did a good ass job of just\nEyein' me, spyin' me\n\n[Timbaland sings roll out! in background]\n\n[Ludacris Verse 2]\nMan, that car don't come out until next year\nWhere in the fuck did you get it?\nThat's eighty-thousand bucks gone!\nWhere in the fuck did you spend it?\nYou must have eyes on your back, 'cause you got money to the ceiling\nAnd the bigger the cap, the bigger the peelin\nThe better I'm feelin, the more that I'm chillin\nWillin, drillin and killin the feelin\nNow who's that bucked' naked cook fixin three-course meals?\nGettin goosebumps when her body tap the six inch heels\nWhat in the world is in that room, what you got in that room?\nA couple a gats, a couple a knives\nA couple of rats, a couple of wives\nNow it's time to choose\n\n[Timbaland sings roll out! in background]\n\n[Ludacris Verse 3]\nAre you custom-made, custom-paid, or you just custom-fitted?\nPlaystation 2 up in the ride and is that Lorenzo-kitted?\nIs that your wife, your girlfriend, or just your MAIN bitch?\nYou take a pick, while I'm rubbin the hips\nTouchin lips to the top of the dick, and then woo!\nNow tell me who's your housekeeper and what you keep in your house?\nWhat about diamonds and gold, is that what you keep in your mouth?\nWhat in the world is in that case, what you got in that case?\nGet up out my face, you couldn't relate\nWait to take place at a similar pace\nSo shake, shake it\n\n[Timbaland sings roll out! in background]\n\n[Timbaland sings for outro]\nGet out my business, my biznass\nStay the fuck up out my biznass, ah\n'Cause these niggas all up in my shit and it's my business\nMy biznass\nStay the fuck up out my biznass, 'cause it's mine, oh mine\n(Ludacris Talk)\nAh ah\nTimberland\nLudacris\nDisturbin da peace", "image": "https://images.genius.com/d211edacb8de02968540124c6801063d.1000x1000x1.jpg"}], "artist": "Ludacris"}