{"songs": [{"title": "Israel (Sparring)", "album": null, "year": "2015-08-12", "lyrics": "[Produced By Cam O'bi]\n\n[Verse 1: Chance The Rapper]\nSparring is training, chain-snatching the slaves\nBut a rap song is a match in a cave\nDim lit, wet wick, wicked wrath in its way\nDrunk off of light, lies, laughing\nClaiming asylum while shying in shade\nI can't stay silent, I go violent when my violets is gray\nAnd my roses is black\nFuck the pharaohs and the Pharisees, Moses is back\nI don't need to see a Sphinx to know they noses was black\nI don't know one Temptation that had Otis's back\nSparring is training; this a jumping jack\nI'm the scariest Jack in the pumpkin patch\nFloat like my jumper wet, sting like a bumblebee\nI swing like a lumberjack, go back when I'm up at bat\nThey tried to label me a non-rapper\nI'm an independent contractor, card cracker\nSparring is training without the training wheels\nYou made it, you made it, you made it, yeah, you made a deal\nYou played it straight, hated, graduated\nWaited-waited, you still a waiter still\nMice will always find out ways to steal\nPicture me, fifth of Hennessy and a Swisher Sweet\nFake identity, 'til a plug named Trinity shook me\n\"Wake up, wake up,\" like \"Remember me?\"\nSaid one plus one make three, and you finna see\nYou ain't as grown as you finna be\nYou got them young nigga tendencies\n\n[Verse 2: Noname]\nMm... Sentimental energy\nI let the light in beside him, I stand like angel\nSparring is training for an apathetic halo\nApologetic, nonreligious, consequential fable\nLike good is good, the love in me is goodly, or godly\nThe Bible say mistakes is necessary\nSo I Mississippi monologue to granny house\nMy soloist is sold out to attentive God\nCornbread on my table when I say my prayers\nOn airs, to stairs where shadiness is time to rest or manifest\nSparring is training, I know they think me bumblebee\nAfro-Americano Sunny D, but bet I sting, no die\n\n[Verse 3: Chance The Rapper & Both]\nSparring is training, Jacob wrestled with God\nIn the desert 'til he broke him and he blessed him\nAnd he rescued his heart\nI struggle with love, I juggle my loves\nI cuddle and coddle, ship wreckin' bottle, I huddle in hugs\nSparring is training bra, Ramses watching raining frogs\nJigga watching Damon, Damon watching Wayans Bros\nA tandem unicycle with two pilots in different maps\n\n[Transition: Noname (Chance The Rapper)]\nYou giving back? (I'm giving back)\nTit for tat\n\n[Verse 4: Noname]\nSynagogue and bottle caps\nA body in the underpass says, where's my Jesus?\nPledge allegiance to the money now\nWe runnin down to kiddie parks where darker kids be casualty\nLike come with me, to the museum\n\n[Transition: Noname & Chance The Rapper]\nExcuse them, they know of what they do\n\n[Verse 5: Chance The Rapper]\nSparring is training, don't let Denzel Training Day you\nSensei could catch a fade too\nWe be on that elegant, hella melanin\nPelle Pelles since they crayons and jelly pens\n\n[Outro: Chance The Rapper & Noname]\nAnd now you know Noname ain't never for none\nAyo, you know Chano ain't never for none\nAnd now you know Noname ain't never for none\nAyo, you know Chano ain't never for none\nHa-HA!! And you don't stop\nAyy! Ayy!\nBoom bap, and you don't stop\nHahahahaha!\nI told you that was gonna be fun though\nNah that was... Oh shit!", "image": "https://images.rapgenius.com/9c9553c23366eefea89fc896c49e9303.500x500x1.jpg"}], "artist": "Chance the Rapper"}