{"songs": [{"title": "Nigga Whut", "album": null, "year": "2014-07-05", "lyrics": "[Intro]\nYo yo whats good my nigga I got it nigga, nigga I got it what you need nigga?\nI need that sour!\nBrick City let's go!\n\n[Verse 1]\nYo Redman my nigga, who else?\nA double O.G. in the game with two g's on the belt\nThe flows I create, it'll drown Mike Phelps\nIts no sleeping here I'm anti NyQuil\nLook at this nigga here, I control the stage\nBoy I do it like Moses I part niggas waves\nAnd white boys brains, they know I'm pure death on iTunes and they could choose 6 million ways\nI want lazed chips, that old folks money\nYou know, getting paid but unemployed like Tommy\nBrick city designed me, they don't wanna blame\nBanana clip rounded neck that's a food chain\nWhat up Homie, is time getting hard?\nWell I'm like an alcoholic, its all about bars\nMy truck so big, I need a six cars garage,'\nAnd all challengers better dodge\nHey\n\n[Hook]\nI got my game face on whut you know about it?\nIm rolling up that Grand daddy whut you know about it?\nIm driving in an exotic whut you know about it?\nI pull up my car (errr) and looking at you punk like nigga whut?\nNigga whut? Nigga whut? Nigga whut? Nigga whut?\nNigga whut? Nigga whut? Nigga whut? Nigga whut?\nNigga whut? Nigga whut? Nigga whut? Nigga whut?\nNigga whut? Nigga whut? Nigga whut?\n\n[Verse 2]\nYes sir, yo I'm on a highway cruising, loving my life\nThat 8 0 8 like  yeah the D nice\nI've seen Tina and Robin, sitting at the light\nI said I beat it up I be the new Mike and Ike\nRedman on blast, perfecting the craft\nSmoke all ya cut, then ride off and laugh\nAll types of girls love Red I ain't mad\nShit I got Islamic women tryna bag dad\nYo you need crack? I move like a cartel\nEven smack and B say URL\nWhen the Wu tang sprang out of park hill\nI turned up my C.R.E.A.M game getting Carvel\nYo dogs, when times getting hard\nI'm like an alcoholic, it's all about bars\nI'm like an AmEx card nigga, I take charge\nAnd all challengers better dodge\nHey\n\n[Hook]\nI got my game face on what you know about it?\nIm rolling up that Grand daddy what you know about it?\nIm driving in an exotic what you know about it?\nI pull up my car (errr) and looking at you punk like nigga what?\nNigga whut? Nigga whut? Nigga whut? Nigga whut?\nNigga whut? Nigga whut? Nigga whut? Nigga whut?\nNigga whut? Nigga whut? Nigga whut? Nigga whut?\nNigga whut? Nigga whut? Nigga whut?\n\n[Outro]\nRedman in the building\nI got that sour diesel nigga\nYo DJ Naim, you a fool for this one nigga, yea\nBrick City all day, haha\nYo Jaws, what's good nigga?\nYessir, Mr. Yella what's good my nigga?\nLet's go", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}