{"songs": [{"title": "Hope You Niggas Sleep", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Verse 1: The Notorious B.I.G.]\nCheck the pain I inflict, like a convict, the Fulton digger\nJump in the Acura Vigor, after I stick ya\nRip ya like a razor, straight up Henny with no chaser\nWatch me erase ya, misplace ya\nPut you in the back with the derelicts\nYeah, I pop plenty shit\nChump, I'm making hits\nNo time for the crack rock and shit\nTook it to another level\nNow I'm getting crazy papes, getting paid from the devils\nAnother amateur trying to damage the pedigree\nOf the B-I-G-G-I-E, you know it's me\nHoes, I thought you know I'm smooth as a baby's ass\nSmooth as Teeddy Pendegrass, smoke the grass, get in your ass\nThe Brooklyn-born Teflon Don, wrecking shop\nGetting props, proving nobody drops\nWords as potent as the blunt smoking Bed-Stuy bandit\nAnd niggas just can't understand it\nI bust a cap for the brothers in Nap Nap, Comstock, and Clinton\nYou know my shit is hitting\nYeah, ya'll, a fly nigga, Biggie Smalls\nKicking flavor, make a nigga wanna dig up in their drawers\nFor the burner, catch a body\nI got styles like karate\nJujitsu, when I hit you then I split you\nLike a cantaloupe\nHope you got a rope to hang yourself\nI rob for self; from Brooklyn, where else?\nFat like a Lexus coupe, I ripped your troop\nNot even Lois Lane could get the scoop\nWhat you think, I'm stupid?\nMy crew is mad deep\nI hope you niggas sleep\n\n[Verse 2: B.G.]\nI throw a bomb through your window\nBurn you up and your ho\nI catch your mama going to therapy and cut her throat\nYour little sister walking home from school\nI abduct her, then I fuck her\nI hit your park close up with the Louisville Slugger\nB.G.-zy is the hustler, ignorant motherfucker\nI was taught how to bust heads by the best head-busters\nCluckers, you know I got 'em, two for one, my nigga\nI'm on V.L. if you want me, get some my nigga, come on\n\n[Verse 3: Big Tymers (Baby]\nThugging is my thing; if I'm beefing, I'm banging\nSlanging, it's in my nature, gotta be about my paper\nHaters, I don't like 'em; bitches, I don't trust 'em\nNiggas, I can't stand 'em, I creep down and pluck 'em\nStrap stay in my hand, I gotta protect mine\nNiggas trying to pull it off, \"pop,\" goes the nine\nThat's how it got to be in these uptown streets\nAnd a nigga like me, I play the game for keeps\n\n[Verse 4: Juvenile]\nI remember when niggas slang heroin up in balloons\nI paid attention to everything, from killings to cartoons\nGot a picture of Malcolm X on the wall in my room, bitch\nWant some old nigga? Fuck with me, I'mma do 'em, shit\nNigga give me dope, I accept it, but don't respect him\nPut my foot in their rectum right after I dome checked 'em\nI be popping D, smoking weed, and full of that Hennesey\nFresh off the streets on my way to the penitentiary\nEverybody whisper in ears when they gonna mention me\nI been out doing it for years--since elementary\nReal good relationship with guns and drugs\nBecause my whole neighborhood consists of crook and thugs\nEverything is my own shit cause I don't fuck with scrubs\nI don't need you harassing me when I'm up in the club\nTrying to hustle a nigga, asking me for a dub\nQuarter, ki's, and halfs is what I sling, cause that's what I love\n\n[Verse 5: Turk]\nI know you bitches know that I ain't to be played with\nDont have no picks and chooses who get they head split\nThey die quick, fucking with Turk, wodie get whacked\nSpend a bin with Kevin and Randy leave ya flat on you back\nAnd trust that, ain't bout to let no nigga steal me\nFuck that, I bust back with a .223\nBig and full of that raw with no cut and be ready to creep\nInnocent people move cause somebody fixing to get split\n\n[Verse 6: Lil' Wayne]\nNa, Na, it's iceberg shorty, Lordy have mercy\nCome from under my shirts and flip'em and reverse'em\nI'm coming so alert them\n(Ur, Ur) fore I hurt them, desert eagle bursting\nYou haven't seen the worst and\nI'm right near you and my gun blast quick, dog\nCould kill you so run, dash, get gone\nWodies movin slow around this time they got bricks dog\nI ain't got bricks dog, nigga break it off, what\n\n[Outro: Puff Daddy]\nUn huh, B.I.G. with the Cash Money Millionaires, forever\nJuvenile, Lil' Wayne, Baby, Turk, B.G., Manny Fresh\nSlim, CEO, and me P. Diddy, B.I.G, Born Again\nAnd we won't stop, get money niggas", "image": "https://images.genius.com/d4fe589e61d6a1ea910f4acd62330a24.220x220x1.jpg"}], "artist": "The Notorious B.I.G."}