{"songs": [{"title": "Seepage", "album": "Seepage", "year": "2010-10-25", "lyrics": "[Verse 1: Tech N9ne]\nMoral is shorter\nMy heart and my brain and spirit's out of order\nAnd now the lord of phallus have thou recorder\nFallen angel warrior at the bottom drained to boiler\nAll remains a horror destroyer\nIn the middle of Sodom and Gomorrah!\nPunk shit, all around, everybody been calling clown\nThe crawling town, get wicked\nRip this sickness is falling down\nOver this basic gay shit, erase it, face it\nWake this hatred and make this place get apeshit!\nNo kinda way you stopping this\nFlow gonna make apocalypse\nPower's stop lots of mocking shit\nLot of us often is blocking this, optimist\nPositive, hope for the future's loss of awesomeness\nI can get boss and a lot of us will rot and pop like hot sausages\nI am not the light, I'm the opposite\nThrough narcissistic awfulness, I'm keeping Tech off of this rocker\nBlack heart and darker\nPeep it, this is the thesis wrote in feces\nI'm as beast as broken leashes, little secret - I am the Seepage\n\n[Hook: Tonesha Sanders]\nHeartless darkness, I feel it seeping out of me\nWatch this raw shit seeping out the anatomy\nHeartless darkness, I feel it seeping out of me\nIt's gotten me nauseous, the seepage deep inside of me\nTouch it (touch it) feel it (feel it)\nLove it (love it) seepage (seepage)\nTouch it (touch it) feel it (feel it)\nLove it (love it) seepage (seepage)\n\n[Verse 2: Tech N9ne]\nDo you believe in KOD? Yes, when you see them nod\nHe's in season, the reason light is leaving, he's even odd\nAll 6's And 7's, mauled bitches and reverends\nFrauds quick gotta get steppin' when the hog pit it is in heaven\nDog shit if he's the messenger\nWhen he take a threat then bless a wet nigga\nInstead of getting a stretch and put death on a replica\nThat is the weakest piece of release\nBut the seepage has no discretion for checkin' bro\nWith a plethora of weapons to lesson ya\nBig Yates, he's stuck in the sick state\nSome speaking that his fate's to be wack when he gets cake\nWell, he gets cake and the critics they spit hate\nBut the sinister shit shakes, so long to the Mixed Plate\nI just ate, pretty punani and mustard\nPsychos in lust are skeeting seepage, these nuts charred\nWhat I got to say to the people who pick at and gut stars\nThinking I'mma lose the ability to bust hard, you fucktards!\n\n[Hook: Tonesha Sanders]\nHeartless darkness, I feel it seeping out of me\nWatch this raw shit seeping out the anatomy\nHeartless darkness, I feel it seeping out of me\nIt's gotten me nauseous, the seepage deep inside of me\nTouch it (touch it) feel it (feel it)\nLove it (love it) seepage (seepage)\nTouch it (touch it) feel it (feel it)\nLove it (love it) seepage (seepage)\n\n[Verse 3: Tech N9ne]\nThe KOD's a hothead\nThe shocks and the socks red\nAnd the darkness is not dead\nWe can lock up like mop-heads\nChop heads off suckers like my name was Ahmed\nAllahu Akbar rugged Aaron Dantez Yates\nOh muhfuckas I'm coming out of his nose\nI'm running out of his toes\nHis throat and clouded his soul\nPeep his crowd as it grows\nNo matter which route he's chose\nHe's climbing right out his globe\nDon't doubt it how loud it blows!", "image": "https://images.genius.com/3ed7175a0f7277bde88f182d8942b8d9.749x768x1.jpg"}], "artist": "Tech N9ne"}