{"songs": [{"title": "You Don’t Really Want It", "album": "Prophets vs. Profits", "year": "2002-08-27", "lyrics": "[Hook]\nMy rhymes still be ill\nYou don't really want it\nI suggest you chill\nYou don't really want it\n#1 I'm still\nYou don't really want it\nThe prophecy is fulfilled\nYou don't really want it\nKRS in the streets\nYou don't really want it\nI drop the rawest beats\nYou don't really want it\nNo ice just heat\nYou don't really want it\nPlaya face defeat\n\n[Verse 1]\nThat was a nice try Nelly, I don't mean to be bold\nBut put that \"Hot in herre\" bullshit on hold\nAnd let's get down to the facts of the matter\nIn the dictionary, under whack rap: you the rapper\nIt's simply cuz you're lacking the spectacular vernacular\nAnd hip hop's character seems to be in back of ya\nEither that or you're truly amateur, I'm asking ya:\nHow does it feel to have the whole world laughin at ya?\nYou just too stupid to see\nI was made on the streets, you was made on MTV\nHow you gonna talk about my nose to attack me?\nWhen you steady guzzling them pills for your acne?\nMy nose comes from a line of kings\nYour acne comes from you eatin the wrong things\nYour words don't make me hurt, they make you work\nYou'll hurt when you find it's you getting jerked\nI tell ya, it don't take me to say\nDon't buy your album, street cats ain't buying it anyway\nYou telling me make up my mind\nYet on your album, you don't know if you wanna sing, or rhyme\n\n[Hook]\n\n[Verse 2]\nYou trying to diss me? How?\nIf it wasn't for the true-school your bitch-ass wouldn't be here now\nBlau blau, show me respect from the gate\nOr I'mma have to drown you kids like Andrea Yates\nYou can't handle the break, I'm a flamethrower, you a bic lighter\nYou think I'm cocky cuz you a dick rider\nI spit tighter, I'm not like all the rest\nI'm not a playa, but I did stay at a Holiday Inn Express\nSo nevertheless I'mma teach ya, teach ya\nBut when them slugs hit you, you'll be screaming, \"Momma, EI! EI!\"\nYou never seen me sing? You don't know what I bring?\nYou'll be singing the blues like B.B. King\nI'm all about the unity of Miss and Mistas\nYou all about grabbing money and dissing our sistas\nTake your ass back to TV land\nAnd let this be a lesson, you can't see me, man!\n\n[Hook]\n\n[Verse 3]\nJust when I thought I could do my gospel\nAnd become an apostle I got a whole to get hostile\nI don't mean to knock ya Nelly\nBut ain't you that MTV house nigga with a spine like jelly?\nI'mma do this by the book, for the art\nI heard what you said on BET's 106 and Park\nBut what you don't know, is right around the corner on 3rd\nI hold a Desert Eagle, and no, it's not a bird\nYou sound absurd, you're gonna bring me back?\nI taught all year round the spot ??? had\nYou copycat, with sloppy raps\nYou chill with N'Sync, I chill where hip-hop be at\n\n[Hook]", "image": "https://images.genius.com/47add5b76aff66374496d71d637e04ca.220x222x1.jpg"}], "artist": "KRS-One"}