{"songs": [{"title": "The Festival", "album": "GO:OD AM ", "year": "2015-09-18", "lyrics": "[Intro]\nYeah, yeah\nLet me get a little bit more beat\nYeah\n\n[Verse: Mac Miller]\nAsk God if she believe in me and will she accept me as a deity\nAnd tell me the secrecy won't keep you free\nI'm sleeping, won't dream until the demons leave\nI took a nap, beneath a tree in the shade\nFeel the sharpness of the swords and blades of grass\nPicturing the images that make you laugh\nI left you out to die, but will you take me back?\nSomewhere in between the crazy and the conscious\nShe's naked underneath them shadows\nLet the sunlight undress her slow\nI don't know who I am, I'm so good at doing impressions though\nI'm going to the festival, the festival need to let me go\nI wake up, pop a couple Benadryls, go back to sleep\nIt's all made up, everything they said was real, it has to be\nCause actually the master fast asleep\nAnd the castles back back in his private quarters (private quarters)\nThat's a master for you, this a revolution, we don't have no order (no)\nAll this torture, thought I had to warn you\nLeave it all behind and go to California\nI'm past the signs, it's the real thing, try analyzing this feeling\nYou can't fathom (Can't)\n\n[Bridge: Yukimi Nagano of Little Dragon]\nMy hands are ahead the clouds\nFrom the clap-clap thunder looking down\nWhile you're running around\nI lift you up when you drown\nUnlock the mission, the planet in rotation\nFull speed chasing and you're always running ahead\nYou're always running ahead\nYou got second chances, happy birthday, sweet romances\nAnd you battle like a champion, why\nDo you wanna go, do you wanna go\nDo you wanna go to the festival\nYou got angels weeping, we can see them dripping from the sky\nYou watch 'em with your third eye (so so)\nDo you wanna go, do you wanna go\nDo you wanna go to the festival (to the festival)\nTo the festival (to the festival)\nTo the festival (to the festival)\nFestival (to the festival)\nFestival (to the festival)\n\n[Outro: Ab-Soul]\nHola, Malcolm\nHey man, it's Luis man\nI'm calling, man, to tell you about the album\nI listened, it's good\nI need to tell you, man\nI tell everyone to listen to the music\nAnd it sound like they like it, man\nIt sound like it good. I tell my wife \"I'm so proud of him.\"\nI tell my girlfriend \"I'm so proud of him.\"\nAnd the album is good\nIt's so good\nI cannot believe it\nAnyone can be you\nNo one can beat you", "image": "https://images.genius.com/3fafe062032c4ec3d42f4b11c25a02a1.375x375x1.jpg"}], "artist": "Mac Miller"}