{"songs": [{"title": "Fuck ’Em All", "album": "Macadelic", "year": null, "lyrics": "[Verse 1: Mac Miller]\nI have a vision to add to give to subtractin' limits\nIf everything was gone tomorrow, who would miss it?\nAnd if I pack my bags and moved away, who would visit?\nIf you knew what you should say who would listen\nYeah I'm talkin' bout a new religion\nSomethin' to feed off, we searchin' for it like groups of pigeons\nKinda futuristic, yeah it's cool, we different\nCause what I do's terrific, I'm just hopin' you could feel it\nYeah, so tell me if you can, are you numb enough? Can you listen in?\nI will lose it all to show 'em I'll get rich again\nBut matter fact, fuck that, cause I don't give a damn\nYou see it's simple when it's only cigarillos\nIn the world, no one should feel you, don't expect it from a little man\nFuck empty, my glass is filled\nCountin' roses, daises and daffodils\nChill\n\n[Hook]\nGet ya money, fuck 'em all\nEverything, could be gone tomorrow\nWhat's if it's gone tomorrow?\nGet ya money, fuck 'em all\nGet ya money, fuck 'em all\nEverything, could be gone tomorrow\nEverything, could be gone tomorrow\nSo get ya money, fuck 'em all\n\n[Verse 2: Mac Miller]\nI say my prayers, but I don't know who they to\nLayin' on my back, lookin' through the roof\nJust tell me, am I gettin' through to you?\nStickin' to it, super glue it, make it beautiful\nFuck, what am I missin'? Speak to your soul so, shut up and listen\nGimme a reason to pop, gettin' me goin', ain't lettin' me stop\nHead to the top, it's better they not, call me a phony, so they sendin' me shots\nI, got a girl, we in love, she my money, she my drugs\nThis my pain, this my pleasure, last forever, keep me up\nLate at night, tell me it's alright, I believe her\nI don't question she who knows me best, I know you wouldn't either\nSomethin' happen when I see her, it's right out of a fairy tale\nGot some shit you going through it's something that she handle well\nLife a bitch but she my bitch\nGold rollie and it's timeless\n\n[Hook]\n\n[Break]\nWe all wanna know what to do in this world\nWhen it seems that there's nothing left\nAnd we dream just to dream\nBut we don't know exactly how to get there yet\nAnd we all wanna know what to do in this world\nWhen it seems that there's nothing left\nAnd we dream just to dream\nBut we don't know exactly how to get there yet\n\n[Hook]", "image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg"}], "artist": "Mac Miller"}