{"songs": [{"title": "Late Night (O.G. Version)", "album": "Death Row Sessions", "year": null, "lyrics": "[Intro: DJ Quik]\nHey 'Pac, it's yo' boy Quik\nMan so far I've been listenin' to your album\nAnd I ain't heard nuttin you could just kick back and smoke a beadie to\nYou know what I'm sayin'?\n\nYeah like that\nSome of that old smooth shit\nSome of that shit that make niggas drink\nMake bitches think\nAnd help you check a fat-ass bank, hahah\nSo why don't you do a favor nigga and uh...\nDrop that shit only you know how\nHahahah, feel me?\n\n[Verse 1: 2Pac]\nI'm barely standin', and plus my secondhand say it's midnight\nSome Alize and Cristal guaranteed to get right\nLike misdemeanors it's a small thang\nWith DJ Quik in this bitch, I let my balls hang\nRunnin' through the street lights, cause we like\nYo' nigga get your mob on show 'em what a G like\nAround the corner it's like Vegas, or better yet like Reno\nNiggas poppin', welcome to our casino, cause you and me know\nHundred percent like a C-note\nLookin' for a bitch that's half-black and Filipino\nAnd when I meet her I'ma offer her some Indo\nTongue-kissin' out the window of a pearl white limo\nDon't wanna be your man, I'm your nigga\nTouch me here, I'll get bigger\nWhile I'm diggin' I'll get deep into your liver\nI'm game type\nLove fuckin' bitches in the same night\nMy words are aphrodisiacs if you say 'em right\nThe club be poppin' so I'm stoppin' at the Fat Burger\nLook through the paper it's another black crack murder\nThe city's full of surprises, you can live or you can die\nYou can fuck on the first night, or try\nIn the late night\n\n[Hook: Sample & 2Pac]\n\"Last night.. last night changed it all\"\n(In the late night!)\n\"Last night..\"\n\"I don't give a fuck, where you gon' be. Be home by eleven!\"\n(In the late night!)\n\"Last night.. last night changed it all\"\n(In the late night!)\n\"Last night..\"\n\"I don't give a fuck, where you gon' be. Be home by eleven!\"\n(In the late night!)\n\n[Verse Two: AMG]\nNow that my nigga ‘Pac is out I’ma have to hit him\nSwoop him up in the coupe\nWith the window’s tinted, wait a minute\nNigga you got the bud I got the Henney\nDon’t worry about the pussy cause there’s plenty\nNow in the city of L.A\nI’m the mayor to the player’s\nSuede to the gators, millionaires baby no haters\nNow we up in the mix\nFrom ’91 to ’96\nStackin’ the hit’s and fuckin' tricks\nIt’s a G thang, baby I’m the AM\nFrom the Bay to L.A\nThis is how we play ’em\nWe get around, fuckin’ hoes then we dick ’em down\nDeath Row is the name, DJ Quik the sound\nBallin’ for day’s but you never catch us slipping’ nigga\nI got old and wise and now I’m gettin’ richer\nPicture a nigga in the villa gettin’ fame again\nAll you hoes better know what game I’m in\nFrom L.A.X. to Laguardia, the late night partiers know\nWho got the pussy and the Indo\nMe and 2Pac and Quik makin’ niggas sick\nHookers ridin’ the dick\nAnd want to join in the clique\nIn the late night\n\n[Hook: Sample & AMG]\n“Last night.. last night changed it all”\n(Yeah bitch in the late night!)\n“Last night..”\n“I don’t give a fuck, where you gon’.. be”\n(This one’s for you ‘Pac nigga, in the late night)\n“Last night.. last night changed it all”\n(Uh, In the late night)\n“Last night..”\n“I don’t give a fuck, where you gon’.. be”\n(Ayo Quik)\n(Tell ’em how it is)\n\n[Verse 3: DJ Quik]\nNow I’m kickin’ it at the top of my tree house\nI’m runnin’ outta beady so I gotta get down and be out\nNow on my way to the store\nI see bitches galore that say they never ever been to a studio before\nNow it’s a golden opportunity for me to get tossed\nI got work to be done, and bitches to floss\nShe say she *Nikki with 2 K’s, i’m dickin' with 2 balls\nAnd all we need it Hen’ to set it off\nNow those are the days of my horny and rugged adolescent\nFuckin’ bitches with no rubber’s today is a lesson\nNow we stop to get \"Lifestyles\" because i'm a gent\nYo, what’s ya’ flovour baby\nHope it’s nutty peppermint\nFuckin’ bitches on a weekly basis I’m lovin’ to play\nBut tell me why always turns out this way?\nShe be alright when you meet her\nFine when you drunk and fuckin’ and ugly as hell the next day\n(What you say?)\nNow, in ’96 this is how it’s goin’ down\nPlayer’s like 2Pac and AMG up\nAnd them hoes down\nAnd baddies, no need to feel sorrow\nJust tune in, same Bat channel tomorrow\nBut in the late night\n\n[Hook: Sample & DJ Quik]\nLast night.. last night changed it all”\n(Yes in the late night!)\n“Last night..”\n“I don’t give a fuck, where you gon’.. be”\n(Don't be mad hoe, just come back in the late night )\n“Last night.. last night changed it all”\n(I ain't fuckin' with you, only in the late night )\n“Last night..”\n“I don’t give a fuck, where you gon’.. be”", "image": "https://images.genius.com/3f252acdfdcdb57b5155fca2d8499d9b.500x500x1.jpg"}], "artist": "2Pac"}