{"songs": [{"title": "Southside", "album": "Who Got Game?", "year": "2005-01-11", "lyrics": "[Voice whispers]\nSouthside\nSouthside\n\n[Hook: Game (Lil' Scrappy)]\nYall don't want it with the Southside (ay-5x)\nYall don't want it with the Southside (ain't nuttin-4x) (ay)\nYall don't want it with the Southside (ay-4x) (crank it)\nYall don't want it with the Southside (ay-2x) (ain't nuttin-2x) (ay)\n\n[Lil' Scrappy]\nI'll leave yo' ass crispy like some Frosted Flakes\nWhat you call sneakin' nigga, man Jake the snake\nEvery nigga on the street got something to say\nUntil they get sprayed in the face with a K like Mase\nI don't fuck with fag niggas lets get that shit straight\nI was lifted by a preacher so my mom pushed weight\nNow I hooked up wit game real nigga with flame\nThe nigga show me Cali' love and I ain't in no gang\nAny nigga that roll wit me betta keep it G\nI'll Break ya vertebrate, push a DDT\nLets get the sippi yall niggas ain't even gifted\nBust a shot at your chin your top getting lifted\nG's up get your G's up Scrappy with your weed up\nI fuck with G-Unit So yall state get they ass lumped\nYour homeboy really going through something I can't change\nI fuck hoes that would make Mya look lame\n\n[Hook]\n\n[Game]\nThe realest of niggas I role wit them killas (yeah)\nThe world gotta feel us my clique is Gorilla\nYou niggas in trouble I'm on the track with the BME clique\nYou ain't gotta know I'm signed to Dre to know that he sick\nP89 thats what I handle my beef with\nPut them hollow tips under your arms like speedstick\nRide through your hood in a blue impala like we crips\nRoll down the tints, G-Unit\nI'm a head busta, lil scrappy when the lead touch ya\nAnd they ain't no coming back when you dead fucka\nSleep in your earn and get eaten by worms\nTrying to fight a fire with bottled water he'll get burned\nThey tampered my phones like D-R-E and the firm\nCuz I'm buzzing like Wu-Tang and it ain't even my turn\nSo who it may concern, you'll get your whole mouth wide\nFuckin with them gang bangers in the SOUTHSIDE\n\n[Hook]\n\n[Outro: Lil' Scrappy (Game)]\nHey hold the muthafucka up my nigga\n(hold up)\nThis your boy little scrappy shorty\n(BME) A-town (A-town)\nMi nigga game (Comptown)\nYou know, its westside (G-G-G-G) in this bitch\nThey want (G-G-G-G-G-G Unit) to get that ass hit\nThey wanna get that ass hit\nAy, ay, ay, (G-G-G-G)\n\nWho you lookin at?\nNah not me nigga\nWho you lookin at?\nNah not me nigga\nWho you lookin at?\nNah not me nigga\nI'm for real\nNah not me nigga\n\n[Hook]\n\n[Voice whispers]\nSouthside\nSouthside", "image": "https://images.genius.com/fbebd680b8d48ca4c032f64b0c59bf19.581x581x1.jpg"}], "artist": "The Game"}