{"songs": [{"title": "The Gauntlet", "album": null, "year": null, "lyrics": "[Verse 1: Logic]\nUh\nNow who the fuck am I to say that you won't ever make it?\nBut the way that you rap, the people just won't ever take it\nI don't understand why you think you finna live it up\nLike a honey on prom night, give it up\nAin't no way you 'gon make it man, you need to conform\nStop everything you doin', start rappin', and still perform\nYou think that you really can record then go and perform\nAll the stupid lyrical shit that you been doin?\nThink twice, boy, you never had a shot wit it\nGo tighten up your game, Botox wit it\n'Cause we all know, I'm your worst critic\nSo what you need to do, you need to do wit it\nIs stop, drop, roll out and forget it\n'Cause like I said, all those people, they won't ever ever get it\nSo listen up man, stop in yo' tracks\nStop droppin' tracks and just relax\nNow who the fuck am I to say that you wrong, my man?\nBut it's untouchable, they way I devise the plan\n'Cause when I'm on it, I'm on it, and homie I ain't playin'\n50/50 like a Gin and Tonic, y'know I'm sayin?\nHalf emcee, other half listener\nHalf capturer, and half prisoner\nThey shit MIDI homie, my shit primo flow celsius and y'all twenty below\n\n[Verse 2: Redlineres]\nLook, I'm all about passin', I ain't got no time to fail\nFeelin' this wrath every time when I spit this hell (yeah)\nYou a fraud nigga (uh)\nYes, I can tell\nPlayin' with your life is gonna get you in the box, in jail\nIt ain't nothing harder than the bars (nah)\nMy passion and everyday gift will take me far\nAnd no time for real, no time for lames\nStart drinkin' the liquor straight so it can take the pain\nI'm on the red line reminiscing on the train\nThink positive, and every day, just maintain\nYou know?\n\n[Verse 3: J-Artz]\nUh, Mr. Johnson, all-star Stockton\nGot a couple golden guns, double O marksman\nA double kill is needed to prove the skill\nGot the eyes outflow, no radar low\nI'm a black ho, no escape, let's go\nTo the edge of the universe, homie let's roll\nPyramid perfect point\nDouble top blind spot\nNano-tech injected, call me a Robojock\nNever seem fatigued, 'cause I'm airless\nSpace travel with no ship, techless\nI'm naturally superior to other stage dwellers\nSneak attack, body bag, dig a hole, Goodfellas\nD.C. Flash with this, others can't target it\nGot the speed force, welcome to the dark abyss\n\n[Verse 4: Steph]\nCaught up in a secret society\nAnd the money just feeds my anxiety\n'Cause I know, I don't talk to the lord (uh)\nMy heart dark for having to endorse such\nPain as youngin' so to numb it I sip lean\nLet the weed fill up my lungs, and pop champagne\n'Til I get sick stomach, just disgusting what we do for a Lil' money\nThey say, \"You gotta change your ways, 'cause the Lord's comin'\"\nAnd I just gotta get paid, the landlord comin'\nSo I'm like, \"Forget God, just cut my check\"\nJust like a Nike sweatshirt (uh)\nCaught up in the rapture, fashion and swagger\nSnapback, award shows sharper than a dagger\nPolo sweater made the same year that I was born\nAnd hand on the bible to the in crowd I'm sworn in", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}