{"songs": [{"title": "Smacked Silly (Rack City Freestyle)", "album": null, "year": null, "lyrics": "Rack rack city bitch....\nGet get smacked silly bitch\nI'mma give ya'll 50 bars on this one.....Ready?\n\nSo what they tryna hate for\nThey know I'm gettin' paid more\nAnd when I'm in the club, everything I drink is paid for?\nYou left the picture and missed everything u stayed for\nThe game gettin' tough but this the shit that I was made for\nSo act up, best believe you gettin' smacked up\nPedal to metal I ain't lettin' niggas catch up\nAnd we could match up homie we gonn smoke too\nCause it's our time and we gonn shine like we supposed to\nI told you, I'm the illest with this mic shit\nSpit it off the top, I'ont even gotta write shit\nMy tight shit sounds the best when I be dumb high\nCause I get Harvard brain and I'm far from an alumni\nYou dumb guys, I do rap and soccer shit\nYou don't see me glow? I'm bout to blow like a rocket ship\nU talkin' shit I think its best that u dip and hide\nCause when I start to flow it be wet like a slip n slide\nI'm gettin high u can tell my eyes is bloodshot\nTake a lotta pictures but I stay away from mugshots\nI do my thing boy I always do my shit well\nRest in peace to em but I'm bout to smoke a Big L\nBrain twisted, soul being lifted\nYou should hand over the mic like Taylor Swift did\nSee what the piff did, feel like I'mma die slow\nHit it and a nigga spit fire like I'm Spy-ro\nMy eyes low, compliments cause I rhyme well\nI'm runnin' in your crib like I'm Kramer off of Seinfeld\nYou sleepin' boo? I slide thru, like PeekaBoo\nYou frozen in shock now ya nickname is Pikachu\nJeez - I swear I'll try and take it easy\nA nigga need a wife but need some bitches who are sleazy\nFor when I'm feelin' low, they know exactly how to please me\nTo all my niggas listenin' I know ya fuckin' sees me\nYeaa\nCause I got bitches on the side\nThat'll hop on the dick, if I feel like gettin' sidetracked\nThey ride that til I nut and then I pass out\nThen I give em food and and cab and kick they ass out...\nThat's how a player do\nAnd I'mma player who\nLoves gettin' brain so shout outs to all my players too\nAnd they say hate the game not the player boo\nBut bitches doin' circles like muhfuckin dreidel do\nAnd I'll shake up the whole damn place\nMy punchlines'll punch lines in ya whole damn face\nI smoke weed and sip goose til I start to get loose\nFake niggas gimme dap, I leave em hanging no noose, damn\nYou can't battle? well I'll kill him myself\nA registered sex offender how I'm feelin' myself\nYou feelin' the wealth, well I got paper in sight\nA lotta niggas can't stand how I'm rapin the mic\nBut all this herb got me lookin' like a china man\nEverybody know I rap so I rhyme when I can\nTry and name somebody with as many lines as ya man\nTime is money guess I gotta lot of time on my hands\nAnd I got paper in my pockets I'm just achin' to burn\nN you could shine when its ya time but keep waitin' ya turn\nCause its mine n I'mma grind til this paper I earn\nAnd ion preach but ill teach til they blatantly learn\nUnderstand I'mma boss, I could never take an off day\nCause I'mma be a star who got bucks, no latte s\nPapi what the ladies love to call me\nCause they love when I get it up like wall street\nI'm good lookin', rhyme tight, and I flow nuts\nKrispy Kreme workers even sayin' that my dough nuts\nI go nuts boy....", "image": "https://images.genius.com/383bdf7e658c81236926af98a9211465.780x780x1.png"}], "artist": "Future"}