{"songs": [{"title": "On Top (Bonus Track)", "album": "Grand Champ", "year": "2003-09-16", "lyrics": "[DMX]\nUhh.. yeah, uhh\nUhh, uhh, uhh, uhh - WHAT!\n\n[Hook 2X: DMX] + (Big Stan)\nWe gon' make these cats (WHAT!) STOP!\nWhy they waitin to (WHAT!) GO!\nWe gon' keep it (ON TOP!) ON TOP!\nWhy these cats is like (YO!) AIYYO!\n\n[DMX]\nSong ain't a song without X and the B.S\nEarl, Stan - initials E.S\nAbout to shut it down, y'all don't see this?\nOh my God (WHAT!) Y'all don't see this?\nStarted with a little, raising the pups\nNow I'm a home-run hitter, we raising our cups\nToastin, to all the roastin we done (UHH)\nBite hard, done bit hard but don't run (UHH)\nMy dogs is dogs with official +Bloodlines+\nCats want - mine?  X Blood-line?\nOh you tryna get hit in the HEAD one time\nStraight to the body with the whole .29 (WHAT!)\nIt's gon' be whatever it's gon' be (UHH!)\nAnd I'm gon' see whatever I'm gon' see (UHH!)\nAnd I'm gon' do whatever I'm gon' do\nSo if it's fuck me nigga, then FUCK YOU too! (C'MON!)\n\n[Hook]\n\n[Big Stan] + (DMX)\nOff the chain I'mma run through, walk through, gun do haunt you\nA gun puts a spark through, no tellin what the hawk do (WHAT!)\nOnly speak for me, no tellin what the Dog do\n(Dog do what the fuck Dog do, shit!)\nYo' crew leave it alone (uh-uh!)\nYou got your eyes on the bone? (uh-uh!)\nCan't keep your eyes of the throne? (Go on now)\nWith that shit you did (man, c'mon now!)\nI'm gettin sick of niggas fuckin with D\nYou fuckin with D?  You fuckin with me\nYou fuckin with me?  You fuckin with X\nFuckin with X?  You fuckin with a softball-sized hole up in your vest\nAnd the rest? (WHAT!) Ain't nothin to rap about\nAin't no (\"I ain't mean it!\") when the strap is out\nAin't no (\"Yo, sorry!\") when the rats is out\nCause the rats don't know shit but POINT MONEY OUT! (UHH!)\n\n[Hook]\n\n[DMX]\nSchool Street, Moulfred, Whitney Young\nBeen there, lived there, now it's become\nA place where the face I'm not familiar with\nThese new cats done got me on some \"I'MA KILL YOU SHIT!\"\n\n[Big Stan]\nAnd I remember when you came through flyin, a 1-2-9\nScooped ya man up and he signed to the 'Line\nI got a deal, shit I'm still in the grind (WHAT!)\nGot the steal, cause shit is still on my mind\n\n[DMX]\nYou gots to watch niggas that you talk to\nCause sometimes they talk to you funny, whassup wit'chu money?\nOh you think it's sweet?  My name must be Honey\nFunny, 'til you leave with your head bloody\n\n[Big Stan]\nAnd what he gon' do when a 6-foot-3\n430-pound motherfucker come through? (WHAT?)\nNOTHIN! (C'MON!) Breathe easy!\nWhen cats talk slick dogs get GREASY!\n\n[Hook]\n\n[Big Stan] WHAT!\n\n[DMX]\nWhy these cats is like (YO!) AIYYO!\nWhy these cats is like (YO!) AIYYO!", "image": "https://images.genius.com/e730418bfaada4fc845d1179160af643.999x999x1.jpg"}], "artist": "DMX"}