{"songs": [{"title": "Flashing Lights (Live From VH1 Storytellers)", "album": "VH1 Storytellers", "year": "2010-01-05", "lyrics": "Let’s go, let’s go, let’s\n\n[Verse 1]\nShe don't believe in shooting stars\nBut she believe in shoes and cars\nWood floors in the new apartment\nCouture from the store's department\nYou more like \"love to start shit\"\nI'm more of the trips to Florida\nOrdered the hors d'oeuvres, views of the water\nStraight from a page of your favorite author\nAnd the weather so breezy\nMan, why can't life always be this easy?\nShe in the mirror dancing so sleazy\nI get a call like, \"Where are you Yeezy?\"\nAnd try to hit you with the ol-wu-wopte\n'til I got flashed by the paparazzi\nDamn, these niggas got me\nI hate these niggas more than a Nazi\n\n[Hook]\nAs I recall I know you love to show off\nBut I never thought that you would take it this far\nWhat do I know? (Flashing lights)\n\n[Verse 2]\nI know it's been a while sweetheart\nWe hardly talk, I was doing my thang\nI know it was foul, baby\nAye babe, lately, you've been all on my brain\nAnd if somebody woulda told me a month ago\nFronting though: yo, I wouldn't wanna know\nIf somebody woulda told me a year ago\nIt'll go get this difficult\nFeeling like Katrina with no F.E.M.A\nLike Martin with no Gina\nLike a flight with no visa\nFirst class with the seat back, I still see ya\nIn my past, you on the other side of the glass\nOf my memory's museum\nI'm just saying, hey Mona Lisa come home\nYou know you can't roam without Caesar\n\n[Hook x2]\n\nYou know, I’m ‘sposed to talk about what some of these songs mean\nAnd some of the stuff is so personal to me\nAnd some of the things I’ve been through is so real\nIn the form that I’m ‘sposed to break down certain things\nAnd this is one of the first times, because I feel like I’m placed in front of the audience right now\nAnd uhm, certain things are just hard for me to talk about\nAnd I’m sorry VH1 for that\nBut it uhm, certain things are too serious\n\nAnd I stand before you, just a human being trying to improve under the microscope\nJust the star of the Truman show\nAs every day I take as calculated\nEvery time I put on my shoes\nUnder the flashing lights\n\nJust got an email today\nA new book coming out\nDoctor Adams: the Truth about Donda West\nWhat the media doesn’t want you to know\n\nAnd you know, now that my momma passed\nWould she really want me to put myself in a situation where I go to jail?\nFOR KILLING ‘EM\n\nUnder the flashing lights\nAnd the public perception\nWhere I feel like I’m always in defense of myself\nAnd I realize that I’ve made some mistakes, but I grow from them\nIt’s like I’m fighting to be me, but I have to leave the fight\n‘Cause it helps everyone else be who they wanna be\n\nThat’s a story for your ass…", "image": "https://images.genius.com/3c0aee76b72a24d6c01e44a72adb029c.1000x871x1.jpg"}], "artist": "Kanye West"}