{"songs": [{"title": "The Next Episode 2006", "album": null, "year": null, "lyrics": "[Intro: Snoop Dogg & Nate Dogg]\nDa da da da da\nIt's the one and only D-O-double-G (Snoop Dogg!)\nDa da da da da\nYou know I'm mobbin' with the D.R.E\n(Hope you ready for the next episode)\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go, there they go\nThere they go, there they go, there they go, there they go\n\n[Verse 1: Dre Dre]\nWhat's my name, my name is Mr. Game\nWest coast big change Mr. Fame\nBad bitch scooped her up same ol' same\nFuckin in the drivers seat while I'm switching lanes\nGettin brains Long Beach, Compton thang\nShit ain't changed thats how we do the damn thang\nDraws down nuts platinum, let em' hang\nWife missin 5 AM, who's to blame\nI'm the reason used magnum is in your range\nAnd while she bounced out wit me before you came\nFuckin lame you be handcuff sluts I banged\nI trippin take em' back shit my nuts is drained\nOn everything this dick is shootin novocain\nHave a bitch waitin bus stop, in the rain\nSimple and plain cuz we's be off the chain\nNigga Nate Dogg, pimp game, please explain\n\n[Verse 2: Nate Dogg]\nGive me a bomb instrumentals\nStraight from Gangbang central\nKeep that bomb weed coming\nWheres my bomb\nOne thing I know, know that these rats want cheese\nWe set a trap and caught her on her knees\nI heard him coming and I dropped my keys\nI hit the window, yep, khakis still creased\nDon't like to drink big\nSmoke cos I got big trees\nGirls pause when they see me\nBlue '64 on these\n\n[Verse 3: Snoop Dogg]\nWho am I\nMr. D-O-G, he's fine\nI don't fuck with 8's just 9's and dimes\nHolla at me dog, I'm tryna find some time\nAnd if I do, we'll sit back and recline\nUntill then, you can put your mind on mine\nAnd we can have a good time\nI put my dick on your spine\nHit you from behind, make your sun shine\nI won't tell, oh bitch quit lying\nMatter o' fac' ho, get off my line\nCos right about now, I need my peace of mind\nSippin' Hennesy with a twist of lime\nSmoking on a dime, beach, snortin' a line\nCalvin, not Calvin Klein\nOriginal, so genuine\nMy office hours are from, 10 to 5\nGod Bless you and good night is how I end my rhyme\nBut meanwhile\n(Fades)", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}