{"songs": [{"title": "Nothing Lasts Forever", "album": null, "year": "2011-09-27", "lyrics": "[Hook]\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try though, can't say we didn't try, hey)\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try tho, can't say we didn't try, hey)\n\n[Verse 1: J. Cole]\nWhen this shit end, man it's gon get ugly\nReal real ugly, your grandmama love me\nAnd your mama love me, little sister hugs me\nEven got a few homegirls that wanna fuck me\nSoon as this shit end, forget about it\nYou been stayin' in my crib, you gotta get up out it\nCause if you layin' in my bed, let's admit about it\nOne time fuckin' and we no longer upset about it\nCause when this shit ends it's either all or nothin'\nI thought you loved me, how the hell you gon call ya cousin?\nYou know the diesel ass, half slow, evil ass\nNigga in that Honda showin' up with that drama\nOn my mama, we been through it all\nFrom the goods to the bads, rise to the fall\nYou done seen me at my best, seen me at my worst\nSo when this shit ends, know it's gon hurt\n\n[Hook]\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try though, can't say we didn't try, hey)\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try tho, can't say we didn't try, hey)\n\n[Verse 2: J. Cole]\nThey say we won't last\nI know you suspicious, but you don't ask\nAnd I don't tell, that's where we both fell\nA good nigga gone bad\nGood chick, alone, mad as fuck, she done had enough\nI be, out here tryna raise my status up\nBut success bring bitches, and they bad as fuck\nAss fat as fuck, with a little ol' waist\nI ain't want the whole meal, just a little ol' taste\nShould have looked both ways fore I crossed you\nI guess I never thought I could have ever have lost you\nNow I'm out stuntin' with this bitch, who ain't about nothin'\nWhile some nigga learnin' all the shit I taught you\nDamn, guess you deserve that, a new start\nBut deep down you know we grew apart, long before I broke your heart\nIf I lost your respect, I'm just hopin' you don't look at me as you somethin' you regret\n\n[Hook]\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try though, can't say we didn't try, hey)\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try tho, can't say we didn't try, hey)\n\n[Verse 3: J. Cole]\nI got your message I been meanin' to respond, know it's been a while\nApologies, I ain't been around\nI wanna kick it, but I know that shit is different now\nAnd times have changed\nLet me know if I'm out of bounds, are the lines the same ?\nI mean ya, lookin' good, yeah you still got it\nBeen reminiscin' and I'm not sure how I feel about it\nNow we can say that all good things come to an end\nBut we know each other way too well to pretend\nWe went from friends to somethin' much more\nTo breakin' up to makin' up and fuckin' once more\nSecond chances, we gave enough\n'Til finally we gave it up, but some days I be wakin' up and wantin' one more\nBut what for? Maybe it's just the weather\nWe break each others heart's, so maybe it's for the better\nHoller whenever, cause you always got a friend in me\nAnd nothin' lasts forever, least we got these memories\n\n[Hook]\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try though, can't say we didn't try, hey)\nI tried, you tried, we tried\nAll of the times that we had together\nWe should've known nothing last forever\n(Can't say we didn't try tho, can't say we didn't try, hey)", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}