{"songs": [{"title": "T.O.D.A.Y", "album": "Death is Certain", "year": "2004-02-24", "lyrics": "[Intro: Ingrid Smalls]\nNa, na, na\nHooooh-ooooh-ooooh\nNo, no, no\n\n[Verse 1]\nI done been in this game for years, it made me an animal\nI learned that nobody else can be held accountable\nBut you for your career, not your manager, face it\nEven he can fuck up a relationship\nI learned it don't matter who's spittin better\nWhile these rappers kill each other, them Jews they stick together\nLike glue; and generate more money than FUBU\nFor somethin made 'for you by you'\nEvery hip-hop nigga listen and wishin' he had your style'll\nGo against you if you rip him or pass him by (yeah)\nA mastermind is somebody who's actually kind\nTo everybody, and try to see every autograph is signed\nThe humblest way to look at your career\nIs every nigga in here is one hit away (yeah)\nWhatever goes around in rap\nHappens to not come back to me, and I ask you\n\n[Pre-Hook: Ingrid Smalls]\nIf I was to die today\nWould you pick me up because I'm down and out?\nNa, na, na\n\n[Hook]\n\"T\" represents the time when my hope fades\n\"O\" is just a sign on my mind on my broke days\n\"D\" is for the dangerous way that the flow stray\n\"A\" represents the answer to the question I'm askin'\n\"Y\" is it today I should (die)\n\n[Verse 2]\nDamn, right after one quick summer\nAm I a Young MC or a one-hit wonder?\nIs it a following that supports me\nBET, MTV, or \"E! True Hollywood Story\"?\nCan I hold my own and rap\nWithout havin' to go back to Pharrell or Poke & Tone?\nCan a married man still appeal to broads\nKnowin everything he's spittin from here on in gon' be raw?\nCan a nigga simply spit that real shit\nJust for niggas that feel me or will the system kill me? (uhh)\nIf I drop this album and it sells\nAnd the next one don't top it, will it be considered a failure?\nIf I had to drop outta the limelight for a while\nWould you still mob me? Hell naw!\nYou would not give a fuck about me\nIf I worked a regular job, I don't even gotta ask y'all\n\n[Pre-Hook: Ingrid Smalls]\nIf I was to die today\nWould you pick me up because I'm down and out?\nNa, na, na\n\n[Hook]\n\"T\" represents the time when my hope fades\n\"O\" is just a sign on my mind on my broke days\n\"D\" is for the dangerous way that the flow stray\n\"A\" represents the answer to the question I'm askin'\n\"Y\" is it today I should (die)\n\n[Pre-Verse: Ingrid Smalls]\nWe just wanna see you survive\nAnytime you wanna talk, maybe either one of y'all\nWanna give a holla this way (yeah)\nEvery lady involved is rootin for the underdog\nYou don't let him die today, no!\nOh no - we ain't tryin' to see\nYou go - I want you here beside me\nI don't want it to change - don't die!\n\n[Verse 3]\nNow as far as my weaknesses\nI have a hard time competin' or charting on SoundScan\nAnd Mediabase, I respect Dre for teachin' me that\nMoney is easy to make, but hard to keep\nAs far as my nigga 'Los, I love him\nHe showed me you can do a dope album with no budget (yeah)\nWith lethal rhymes - they get that\nHe brought you into the game, he can take you out outta people's minds (yeah)\n(Die) Those who feel my career will die\nThose who choose to leave me behind\nAre confused cause they don't hear me cry; rather ya ears\nIs ready or not, I know you can hear me now like Mary J. Blige\nI will take the shit\nI will burn yo' bridges and I ain't talkin 'bout our relationship\nWhat goes around comes around with every person\nRather it's life or rap whatever, \"Death Is Certain\"\n\n[Pre-Hook: Ingrid Smalls]\nIf I was to die today\nWould you pick me up because I'm down and out?\nNa, na, na\n\n[Hook]\n\"T\" represents the time when my hope fades\n\"O\" is just a sign on my mind on my broke days\n\"D\" is for the dangerous way that the flow stray\n\"A\" represents the answer to the question I'm askin'\n\"Y\" is it today I should (die)\n\nHooooh-ooooh-ooooh\nNo, no, no\nDie", "image": "https://images.genius.com/2e15d971471dc5a14cf09f1d638b3456.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}