{"songs": [{"title": "Right Now", "album": null, "year": null, "lyrics": "Get it right nigga I don't play\nNigga play the six shooter you oh me hombre\nI got\nBitch witt an ass big as beyonce\nMy money long gettin paid way beyond yey\nYou pussy niggas gay in some neon shades\nSo what the fuck I care about for what a peon say\nBut anytime any place for five in my waist talk shitt get hit from yo thighs\nTo yo waist and back down\nDon't test me dogg I can only be as coo as you let me dog\nYou betta leave me alone nigga let mew ball before I pull this A. Are. And\nMake you wett yo draws\nI lett loose this shitt I'll get messy dog\nBut I'm a shoot in you in yo leg nigga just because\nRather the middle of the mall or your granmama post\nTry me when I you see ya boy yo ass gotta go... Right now!\n\n[Chorus:]\nSee you bitches say ok don't trip\nI got a clip for the next nigga hate on tip (right now!) fuck boy what it is\nWhat it look like\nChrome dessert eagle got yo pussy ass shook rite\n(Rite now!)chest boolet proof vest and all\nTucked in the chevy you don't wanna upset me dog\nI got chopper in the back bout one or two Glocks ever see me run up on you\nKnow you gonna get shott (rite now!)\n\nSee hatters finna run out of time betta mind yo damn buisness stay the fuck\nOut of mind\nBecause... I gotta calla cotted one of a kind\nSince niggas livin from the bullets you could bus out a nine\n357snugg nose and a new for for\nTo let you know that I ain't fuckin round with you no mo\nIn the streets or the club bought a g or a dub if you oh me betta pay me or\nYo ass gettin cuved... (right now!) what you take me for I'm from the hood I\nAin't neva been played before\nI guess it's obvious you never been sprayed before no appologys should have\nHollard at me way before\nOh and don't let the tuff talk scare you when I walk up on you nigga buck I\nDare you\nYou betta be prepared cause them bullets comin fast you could run jump dash\nBut I'm dumpin on yo ass (right now!)\n\n[Chorus:]\nSee you bitches say ok don't trip\nI got a clip for the next nigga hate on tip (right now!) fuck boy what it is\nWhat it look like\nChrome dessert eagle got yo pussy ass shook rite\n(Rite now!)chest boolet proof vest and all\nTucked in the chevy you don't wanna upset me dog\nI got chopper in the back bout one or two Glocks ever see me run up on you\nKnow you gonna get shott (rite now!)\n\nCoward situation like a mob boss bring the sawed off tare niggas body parts\nOff\nSittin in the dark till he dropp his broad then the street sweeper come and\nTear doors to his car off\nIt starts off small talk till drift shawt blood loss cutt the circulation\nTo yo heart off\nI ain't finna play boy yo ass betta pray I ain't waitin another day the\nGage finna spray right now... Hu since you wann make a big scene I'm a bust\nThe car with fifteens till yo shitt lean\nDeliver sixteens to yo misceens 12 to yo geans that every nigga in yo click\nSeen\nMan I heard every nigga in yo click sceam runnin like a horro flick on the\nBig screen\nIf he ain't blastin then I suggest that he start relaxin for thos things\nGett to click clackin hittin niggas asses right now!", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}