{"songs": [{"title": "Lowrider (Edited LP version)", "album": null, "year": null, "lyrics": "Lowrider\"\n(feat. Mellow Man Ace)\n\n(Mellow Man Ace: repeat 2X)\nLow-ri-der.. low-ri-der..\n\n(Intro: B-Real + (Mellow Man Ace))\nAww, comin through fo' real we Cypress Hill, ohh baby\nGot that junk, for yo' trunk, goin gangsta crazy\nWe some real life hustlers, playin games in the street\nWe got that low-ri-der, scrapin dippin on three (low-ri-der)\nSo pop your collar, give a holla, throw yo' dubs in the air\nWe tear the roof, off the mother, lady let down yo' hair\nPlaya do that thang, that make you feel alright (low-ri-der)\nSmoke that tree, crack that brew, we gettin freaky tonight\n\n(B-Real)\nNow when people are done, bumpin they head to this\nYou wonder why you wanted anything instead of this\nWe been makin you bounce, for many years already\nRock steady and cut, many niggas to confetti\nBut I just want to blaze it up; whether it's the mic or a spliff\nYes my gift is to amaze you all\nThought I couldn't come for ten my friend, but guess what?\nI slay niggas and still savin my best nut (low-ri-der)\nBut you better cover your eyes, cause you never know when\nI spit it out and start some flowin\nI drop rhymes that grow like trees you're smokin\nEar drums feel like lungs, your brain's chokin\nJust let it soak in, seep in, creep in\nI'm keepin, all you motherfuckers in the deep end (low-ri-der)\nYou wanna trip? Then I got luggage\nI stuff you in and send you off, cause you ain't rugged\n\n(Chorus + (Mellow Man Ace))\nAww, comin through fo' real we Cypress Hill, ohh baby\nGot that junk, for yo' trunk, goin gangsta crazy\nWe some real life hustlers, playin games in the street (low-ri-der)\nWe got that low-ri-der, scrapin dippin on three\nSo pop yo' collar, give a holla, throw the dubs in the air (low-ri-der)\nWe tear the roof, off the mother, lady let down yo' hair\nPlaya do that thang, that make you feel alright (low-ri-der)\nSmoke that tree, crack that brew, we gettin freaky tonight\n\n(B-Real & Sen Dog)\nCause, we're Cypress Hill, come on and ride with us\nJust get inside, we bouncin dippin, chop it up real tough\nLean to the side, pimp yo' hat, tilt yo' seat on back\nDon't front on me, baby boy, and break bread with the sack (low-ri-der)\n\n(Sen Dog)\nI be the vato with the fine hoodrat in the ranfla\nAlways roll deep on the streets like the mafia\nPleito, just might come back and haunt ya\nFlossin too much, no vato's gonna want ya\nNot right here homes, we're past all of that\nMakin that feria, spittin that raps\nYa me conoces, I'm down for my calle\nCypress Ave, y a pudo les madre (low-ri-der)\nYa tu sabes, we don't play that shit\nAny pendejo's gettin hit up quick\nWhassup ese? What hood you claim?\nNow throw it up and down like it ain't no thang (low-ri-der)\nHands in the air with the pinky rings\nSoul Assassins, runnin everything\nTo all you vatos, make sure you check this\nIn every barrio, I'm well respected (low-ri-der)\n\n(Chorus)\n(Mellow Man Ace: repeat 4X to fade)\nLow-ri-der.. low-ri-der..", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}