{"songs": [{"title": "Itchin", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "[Verse 1: Lil Wayne]\nShe say my dickhead need a crown on it\nShe say my cum tastes like holy water\nShe say she get hiccups just thinkin' of me\nI said, \"Next time, bring your drinkin' buddy\"\nI told her, this that Dedication 5\nAnd anything else is a consolation prize\nI said, \"I'm cumming,\" she say, \"Take your time\"\n\n[Hook]\nYeah, I told her take her drawers off and she says I ain't wearin' none\nI asked her, \"Who this pussy for?\" She said \"Ransom\"\nAnd when she says \"I Love You\", I say, \"Shut up, take this dick\"\nShe treat me like a God and tell her man she atheist\nAnd then he calls with all that bitchin'\n\"Who is this?\" She busy, call her later\n\n[Verse 2]\nNow we switchin' positions, we in here getting creative\nI put Champagne on her titties, then sip it out her navel, boy\nI live in pussy, let me speak to my neighbors, I say\nClean the puke off of the toilet bowl\nTreat the pussy like revolving doors\nRan outta rubbers at the corner store\nShe in my ear, like \"What you want them for?\"\nWell, give me brains since you a smart-aleck\nFuck her all night and don't smell it\nOpen her mind like a watermelon, haha, you jealous\n\n[Hook]\nI told her take her drawers off and she says I ain't wearin' none\nI asked her who this pussy for, she said ransom\nAnd when she says \"I Love You\", I say,  \"Shut up, take this dick\"\nShe treat me like a God and tell her man she atheist\nHe on that phone with all that bitchin'\n\"Who is this?\" She busy, call her later\nNow we kissin', we twisted, my dick in a tornado\nShe say, \"Hit it,\" I hit it, I hit it raw like yayo, I admit it\n\n[Bridge]\n(That fuckin' corner store man)\nUh, we makin' love like money\nYeah, yeah, like money\nLike money\nTold her this that Dedication 5\nDedication 5\nI killed that pussy, it came back to life\n\n[Hook]\nI told her take her drawers off and she said \"Why you playin' dumb?\"\nI asked her \"Who this pussy for?\" She didn't answer\nAnd she say \"Ooh, I love you,\" I said \"Shut up, take this dick\"\nWould tell her say my name, but I gave her an alias\n\n[Verse 3]\nAnd oh my god she swallowed triplets, she gripped with\nThe hand that rocks the cradle, I'm so lifted, what is this? This here a Dedication\nIt was scripted, predicted, and shout out to my skaters\nBoy, I live in pussy, let me speak to my neighbors, I say\n\n[Outro]\nD5\nWhat up 5?\nI told her this that Dedication 5\nWe makin' love like money", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}