{"songs": [{"title": "Running", "album": "Build and Destroy", "year": null, "lyrics": "[Royce Da 5'9\"] + (Cha Cha)\n(Stick up, stick up) Gangs 'til we play brains\nWe pick up (pick up) when them thangs spray\nThis how it goes down in the hood that you can't stay\nI'll invite a nigga over then make him leave in the same day\nCan you meet her?\nI'm talkin bout a chick wit a Coke bottle figure but never the 2-liter\nWhatever you choose, especially you\nDefinitely I rhyme better than who rhymes better than you!\nCause this is your sire, I spit in the fire\nThinkin that I'm fittin to retire? {\"BITCH, you a liar!\"}\nAh-hah! The home of the willest, I'm only the illest\nI only'll steal it, phony-est niggas'll feel it, c'mon widdit\nBut when the battle is through\nIt's all-out \"Jerry Springer\" every arena, I'm on the panel, too\nSpit shit for my peeps, shit for the Jeeps\n(Stick up, stick up) Strange pick-ups, brains hittin your feet\nStained in ya mayn, listen, change in dissin\n(And recognize) You MC's, nothin; you leave with nothin\n(And recognize) Fuck it, hold on - I hear somebody comin\n{\"Ooh-ooh-ooh-ooh-ooh-ooh, what is his name?\"} 5-9!\n\n[Hook]\nCan't keep comin around me baby\nMake my girls say (OHHHH!)\nCan't keep running awayyyy\nGive it to me now (RUN)\n\n[Interlude: Cha Cha]\nYou can't leave, you can't breathe, you can't sleep\nHearts beat's goin - bu-bu-b-b-BUMP!\n(It's like) Precious comin, can't turn your back from it\nAnd your heart keeps drummin - bu-bu-b-b-BUMP!\nSee deep, see the world from beneath\nAnd all you hear is that beat - bu-bu-b-b-BUMP!\n(YO!) Evictions (YO!) enrichment (YO!)\nContentment - bu-bu-b-b-BUMP! (YO! YO!)\n\n[Royce Da 5'9\"] + (Cha Cha)\nYeah, then after THAT I just thu-thu-th-thump, for fun\nI'm COCKIN back my (pu-pu-p-p-PUMP!)\nYeah, what nigga man, you better be du-du-d-dumb\nYou better stutter, you better SAY I'm th-th-th-the one\nCause I'm the, rap oxy moron, feel that?\nCause I bring tracks to life while I kill, cracks\nLadies say (Royce I wanna get with, you!)\nAnd it's cool cause I got a whole (get with) crew\nAnd I hit, writers, right where it hurts\nDon't call me no hit, writer; I am a fighter, first\nNiggas try to murk on my fire since fireworks\nNow you hurt, have you goons in a drive-by verse\nCause I'm STRONG in that area thuggin\nI just, LOVE leavin niggas layin there like a area RUG\nPlus you, yeah, smellin my game\nEv-ery girl +Wanna Be Bad+, ask Willa Ford, tell her my name\nIt's, 5-9! Hah, now I see why you can't see\nSee why you can't breathe, why you can't beat or be ME!\nMan please, you better be Sam Sneed\n(And recognize) You just feet, a piece of a stampede\n(And recognize) Shh, hold on - I think somebody comin\n{\"Ooh-ooh-ooh-ooh-ooh-ooh, who could it be?\"} 5-9!\n\n[Hook]\n\n[Outro: Royce Da 5'9\"]\nA round of applause for the brand new Mrs. Montgomery\nMy lil' sister Cha Cha, Rush!\nOf course my name is Royce 5'9\"\nWhen you think of my name\nThink of a fresh new sound\nA fresh new face, let's go\n\n[Interlude]", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}