{"songs": [{"title": "Like So", "album": "Fuck A Mixtape", "year": "2010-05-27", "lyrics": "[Hook:]\nAy suckas hate to see me get it like so, so\nBitches say they dig the way I kick it like so, so\nFilthy rich and still I keep it pimping like so\nStill the realest nigga in it with a image like so, so\nShawty just might pull up in a ride like so, so\nWith a bad bitch with him inside like so, like so\nSuper fly like so, niggas lying like \"SO?\"\nStill spit it how I live it on the Hill, here I go, go\n\n[Verse 1: T.I.]\nHey all I do is go and go by this and that to so-and-so\nLil' PeeWee say \"They hate to see ya ballin bro,\" you know I know\nSo what though? They can't stop it, they just watch it as this dough I blow\nWith millions in my pocket, shut it down in every store I go\nAtlanta on my shoulders, oh I tow it like a soldier though\nSuckers I expose or minimize in exposure so\nThey trying to make me kill 'em, I'm controlling my emotions though\nWhy you niggas lookin so surprised? They not supposed to blow?\nFrom trapping to the club scene, rapping to the big screen\nFashion, television, listen shawty doin big things\nGet team money, fuck a bitch if she ain't coming\nSo conceited ain't funny, if she ain't fly well she ain't for me\nPretty face, fat booty with a magazine stomach\nCatch me somewhere where it's sunny, it ain't us if we ain't stunting\nSay we running we ain't fronting, they be tripping, ain't nothing\nIf they kick it we be putting in, man I'm tryna teach you something man\n\n[Hook]\n\n[Verse 2: T.I.]\nIs there a message from the greatest? Yeah, go get yourself some paper playa\nTry to do as I do, God but I anticipate you'd fail\nIt could be that my greasy yellow deuces make them hate me where\nThey try me bruh, they get tore up just like Drake did his ACL\nRespected foreign and domestic in the A as well\nFeel like 'Pac did when he said y'all act like y'all want me to stay in jail\nI'm raisin hell today cause yeah I heard about you suckas\nUse my absence as a present, so fuckin ass time to suffer\nRappers keep on tryin to catch-up(ketchup) but they just can't cut the mustard, huh?\nI'm way ahead, gone stay ahead, so fuck if they say such-and-such\nYou keep the credit, what I need a trophy and a statue for?\nMillions stackin up and I don't give a fuck what awards show pass me up\nMy movie agent Brian always ask me what I'm rapping for\nIt's passion, I wouldn't trade it for all the diamonds out in Africa\nSahara hot, everything you dropping coming after us\nMy character is rare and for that reason they be starin, huh?\n\n[Hook]", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg"}], "artist": "T.I."}