{"songs": [{"title": "Sweetest Girl (Remix)", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Intro: Wyclef Jean and Lil Wayne]\nSome live for the bill\nSome kill for the bill\nShe whine for the bill\nGrind for the bill\n(and she used to be the sweetest girl)\nSome steal for the bill, if they got to pay they bill\n(and she used to be the sweetest girl)\nTonight Wyclef, Akon, Weezy on the bill\n\n[Verse 1: Wyclef Jean]\nHigh school, she was that girl\nThat make me do the hula hoop around the gym\n(Just to get a peek again, she's a 10)\nHigh school she was that girl\nThat make me do the hula hoop around the gym\n(Just to get a peek again, she's a 10)\nNever thought that she would come and work for the president\nMr. George Washington (where my money at?)\nShe balls, he calls (where my money at?)\nShe had a good day, bad day, sunny day, rainy day\nAll he wanna know is (where my money at?)\nClosed legs don't get fed\nGo out there and make my bread\nAll he wanna know is (where my money at?)\nShe ended up in the wrong car\nBruised up, scarred hard\nAll he wanna know is (where my money at?)\nShe balls, he calls (where my money at?)\n\n[Hook: Akon]\nSee I'mma tell you like Wu told me\nCash rules everything around me\nSingin' dollar dollar bill y'all (dollar, dollar bill y'all)\nSingin' dollar dollar bill y'all (dollar, dollar bill y'all)\nSee I'mma tell you like Wu told me\nCash rules everything around me\nSingin' dollar dollar bill y'all (dollar, dollar bill y'all)\nSingin' dollar dollar bill y'all (dollar, dollar bill y'all)\n\n[Bridge: Wyclef Jean, Niia, Lil Wayne]\nMoney, money, money, money\nMoney, money, money, money\nIt drives the world crazy\nWeezy, she used to be…\nAnd she used to be the sweetest girl!\n\n[Verse 2: Nicki Minaj]\nBut when a good girl gone, she gone forever\nSee, you can't make it rain without the stormy weather\nAnd it's funny when it rains, when it rains it pours\nWould've never happened if I would've stayed indoors\nWould've never happened if I never traded in my textbooks\nCause now I'm hot but the critics say I'm just looks\nThey say I'm too sexy, they say I'm selling out\nCause when I come out niggas get their umbrellas out\nI take the L 'cause I don't want to see my brother lose\nBeen through it all but I can never fill my mother's shoes\nAnd now, I don't want a handout\nI just want my ad-libs to get panned out\nAnd I just wanna tell the girls that could feel me\nThat I just play the cards that a nigga deal me\nSee, everything I been through coulda killed me\nThat's why there really ain't nothing you could tell me\nYou see, I live for the bill, I die for the bill\nAnd I still make sure I read the bi– to the –ble\nAnd every time I write I'm precise in my skill\nIt's more to life than just ice in your grill\nFuck me, blame me, fuck you, pay me\nThis is what you made me (where my money at?)\nSay you want to drape me, turned around and rape me\nNow you ain't mistake me (where my money at?)\n\n[Hook: Nicki Minaj}]\nWhere my girls at, where my girls at?\nIf they frontin' then tell them \"yo, where my money at?\"\nWhere my money at?\nWhere my-where my money at?\nWhe-whe-whe-whe-whe- yo, where my money at?\nWhere my girls at, where my girls at? (oh, oh, hey, heyeah)\nIf they frontin' then tell them \"yo, where my money at?\" (where my money)\nWhere my money at? (oh, oh, oh)\nWhere my-where my money at?\nWhe-whe-whe-whe-whe- yo, where my money at?", "image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg"}], "artist": "Nicki Minaj"}