{"songs": [{"title": "Serious", "album": null, "year": null, "lyrics": "[Eminem]\nWhat's up with everybody beefin'\nEverybody seem like they wanna beef\nYou know what I'm saying?\nEverybody beefin' with everybody\nThis shit is crazy\n\n[Verse 1: Dogmatic]\nThis is a bomb scare, fires on your hair\nTerrorists live here, but I don't care\nI'm making pot holes when I stomp, so don't stare\nI stop to stomp competiton, with both fair\nHow dare, little soldier at ease\nWe shake down these streets, like Parkinson's Disease\nWe parking the road trees, plus load the weapons\nEverything to six shooters, to high tech ones\nIf a green beans things, to my suggestion\nBurn a big whole in your belly, like indigestion\nWith one question, who the fuck is Dogmatic\nAn underground nigga but this nigga's above average\nIt's serious! who can understand what I'm saying?\nYo Slim, tell them niggas (Eminem: We ain't playing!)\nIt's like you open a can of worms or smoked yams\nI got bloody hands and burners that make you dance!\n\n[Hook: Eminem]\nThis shit is serious! Do you really want beef\nDo you really wanna end up, missing yo front teeth\nAnd see yo family, getting smoked like a blunt leaf\nAnd wrapped up in a zip-lock bag, like lunch meat\nThis shit is serious! Do you really want beef\nDo you really wanna end up, missing yo front teeth\nAnd see yo family, getting smoked like a blunt leaf\nAnd wrapped up in a zip-lock bag, like lunch meat\nThis shit is serious!\n\n[Verse 2: Swifty McVay]\nI'm the only one your bitch let touch her\nType a brother that'll, fuck yo mother, wit a fishnet rubber\nI'mma misfit slash, nitwit\nI love to put up biscuts, straight to a niggas lips, it'll fit\nA biligerent and rowdy fellow\nI'll dump yo body, and still fly away to Maui, on a teller\nWhen it comes to beefin', it ain't no explain'\nI'll change ya lauguage, wit a stainless\nI'll contain, wit a name which to make you famous\nI'mma deranged pit, I'll bend you till ya back touch ya anus\nDon't ever take me to court, I'll whack the plantiff\nThen beat the fuck out the baliff\nA heinous, miscellaneous, nigga never miss, when the AK lift\nI paint ya face wit, any weapon, just like \"The Matrix\"\nThey ain't steppin', don't even say shit\nYou heard about the bodies in my basement, you joinin' them, face it\n\n[Hook]\n\n[Verse 3: Proof]\nLaugh indictive, like Kim lipstick, and get a nose bleed\nMy blow speed, is like my hands working ten stick shifts\nCaptain ask, to stick my finger in the barrel of a Mac 10\nAnd snatching the driver out the black Benz\nSmashing his contact lens, my life start when his contract ends\n\"Go kiss-and-tell, and contact Kim!\"\nLet's be factually, actually, y'all ain't after me\nGot (???) wit +Regis+, y'all beef is without the +Kathy Lee+\nTold y'all my battlery, and go to war happily\nHow you gon' call my bluff, when you scared to send a fax to me\nMy factulty guns drawn, one wrong move dudey\nAnd it's too heads on ya body, into a gangster movie\nFor lot being real, scared to pop wit the steel\nIt got skeletons in my house, every closet is filled\nNow how does it feel, with this Baretta to ya dome\nAnd to know that ya mom's know, that you was never coming home\n\n[Hook] w/ Ab-libs\n\n[Outro: Eminem]\nYou know what I'm sayin'\nYou want beef, we taking it to yo face\nFuck it, Dirty Dozen, Slim Shady\nD-12, this shit is serious!", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}