{"songs": [{"title": "Issues", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "Meech\nBow Wow\nYeah\nDogg House\nOh serious\nSo I didn't know about all that\nYeah\nKeep my industry as much as possible\nYou got too\nFound out, found out\nOn all ya'll niggas\nCheck me out homie\n\nEverywhere I go\nI got niggas and bitches on my dick trying to take my shit\nNow, I don't really know\nBut I try to keep my head to the skitta\nSlice my piece of hitta\nWhatcha hatin' for?\nYou better get up, get out and get your own, Nigga\nPick up the phone and holla at your folks\nYoung locs in the hood, mashing Dogg House\nFuck them other fools\nD-O-double G\nKick back, blaze the sack\nAnd catch a muthafucking big, Mack Attack\nWe blazin' up the dough\nIt'll hurt you\nNothing but purple in my circle\nTo the day we die\nWe gon' get money, bitches and high\nDogg House Gangsta Crip\nRight back in your muthafucking ass for the R-2-G, bitch\nWhat ya'll wanna do?\nSeems like these niggas wanna talk all night\nWhat we gonna do?\nWe ain't gonna say nothing more, we gonna get with ya'll, on side\nThat's how suppose to see\nSo all that straggling in the gate trying to get close to me\nYa'll niggas need to stop\nTrying to flip the hip hop scrip\nI snap, crackle and POP\nTell your friends and foes\nIt's a whole new year and situation and I'm still hating hoes\nWill it ever stop?\nLook I really don't know but on the up, I doubt that, lo\nNow what about your hood?\nMan, I'm doing mine they're doing their's\nSo I guess It's all good\nAnd, what about your crew?\nShit, my crew is the Eastside\nFool, I thought u knew\nDogg Pound ain't the same?\nYeah, them niggas split up and did they own thang and went made their own gang\nMoney is thicker than blood?\nThat's fuck up but on the real that's how it is cuz, damn\nThe world just ain't the same?\nAnd come to find out these niggas crossing out my muthafucking name\nSo what am I to do?\nI put it on mind continue to shine\nEverything fine\nIn G-O-D we trust\nThat's why ya'll suckers can't \"Touch us, Touch us\"\nMeech u made the beat\nAnd you know when we get together\nShit, we like bread and meat\nWe coming with the heat\nClose your mouth cause Dogg House is definitely turning it out\nAnd what about the cops?\nI paid them and the ones I didn't I slayed them, haha\nWill it ever stop?\nIt's like asking \"Who is it\" before a nigga even knock\nThe game is here to stay?\nAnd I'm here to change the rules cause I'm a player that loves to play\nDid you thank the lord today?\nThink I did and on that note young loc, I'm getting ghost\nWhy you tell the truth?\nCause I'm hundred twenty proof from the turf to the roof\nBigg Snoop", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}