{"songs": [{"title": "Limos, Demos & Bimbos", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17", "lyrics": "[Intro]\n(Hey did you hear that?)\nYeah just get the fuckin door! *car door opens and closes*\n\n[Ice Cube]\nLimos, demos and bimbos! (Hey slow this motherfucker down man)\nLimos, demos and bimbos! (ugh ugh ugh ugh)\n\nHit the sunroof, and let's contemplate the freaks we can run through\nGot the chauffer pullin over\nSnatch one inside, she wanna ride with this mission\nClose the partition, he like to listen\nAll fuckin, no kissin, just smokin and drinkin\nSuper vets in a super stretch Lincoln\nThinkin bout the good ol' days of hip hop\nIn its purest form before the eye of the storm\nI could give a fuck about you hatin, on my way\nTo the Colliseum with seventeen-five waitin\nThey scream for the limousine, it's all clean\nTinted, your shit is rented, you know we spend it\nWhile you worry bout the five mics, I'm in the limelight\nWit movies comin out, yo' time is runnin out\nI just finished doin \"Live At The Apollo\"\nIndication from my driver damn we're bein followed\n\n[Mr. Short Khop] You're livin so trife you need Jesus in your life\n[Ice Cube] I'm livin so trife I need Jesus in my life\n[Mr. Short Khop] You're livin so trife you need Jesus in your life\n[Ice Cube] I'm livin so trife I need Jesus in my life\n\nLimos, demos and bimbos! (I'm only fuckin with the...)\nLimos, demos and bimbos! (I'm livin so trife, ugh ugh ugh ugh)\n\n[Mr. Short Khop]\nCaught him in motion, had me potent, let him know about the showin\nAnd how I'm knowin to keep it cracked open\nCans of ass-beatin, plus on how I crash meetins\nAnd have your whole staff leavin half-breathin\nGot shit to hold my own, big bucks\nBut Khop's soon to run it through em, nigga check nuts\nPut to the test then put two to rest\nWiped out with lights out, two to the chest\nHold it now tell a few, legitimate\nWe loaded, for revenue, let's get this shit\nAnd split this shit for three days, count it three ways\nNigga fuck what he say, havin heat pays\nIt's all about the thoroughbred, top choice with the voice\nThat keep twats moist\nMr. Short Khop expected the truest, dare you niggas step to us\nI stay connected til death do us\n\n[Ice Cube] You're livin so trife you need Jesus in your life\n[Mr.Short Khop] I'm livin so trife I need Jesus in my life\n[Ice Cube] You're livin so trife you need Jesus in your life\n[Mr.Short Khop] I'm livin so trife I need Jesus in my life\n\nLimos, demos and bimbos! (I'm only fuckin with the...)\nLimos, demos and bimbos! (I'm livin so trife I need JESUS, JESUS)\n\n[Ice Cube]\nThe alley was pitch black, I'm in the back of this black Lac\nThese fuckers pull up in a Ac\nThey don't understand the impact\nTwo thousand dollar three-piece suit, can you spend that?\nThey call me the Don Mega (Don Mega) *motorcycle speeding past*\nCos I'm down to play a double-header in stormy weather\nSuperstar, goddamn them niggas got me\nStop the car and blast the paparazzi *gun shots, motorcycle*\n\n[Mr. Short Khop] You're livin so trife you need Jesus in your life\n[Ice Cube] I'm livin so trife I need Jesus in my life\n[Mr. Short Khop] You're livin so trife you need Jesus in your life\n[Ice Cube] I'm livin so trife I need Jesus in my life\n\nLimos, demos and bimbos! (I'm only fuckin with the...)\nLimos, demos and bimbos! (I'm livin so trife I need Jesus, ugh)", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg"}], "artist": "Ice Cube"}