{"songs": [{"title": "Purple Gang", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Intro]\nYeah, ha hah!\nIt's your boy DJ Seven-Duece\nIt's a lot of hoes in here fellas, ha hah!\nSo why you lookin at that other nigga?\nHa hah! All the ladies with burgundy hair get in free!\nHeh, I got live on stage\nPurple Gang and B.U., let's go!\n\n[Verse 1: Famous]\nFeelin old as ever man I came with a buzz\nTwo shots, beer in my hand, I'm gettin drunk\nPills kickin in and my eyes gettin lowwww\nReek of heat, cologne mixed with hydroooo\nIce grillin niggas with the Roley on the wrist\nTwo steps, hands in the air, this my SHIT\nLook at shorty light-skinned, damn she's so thick\nHow she poppin, I can't wait 'til she drop it on my DICK\nI ain't in the mood for pistol poppin\nBut we can get it poppin if you be gettin outta pocket I'm good\nCause when I'm in the club I'm usually off a Bud\nWith a hundred Purple Gang thug niggas, I'm Hollyhood\nIf you can't really handle my team, so think the plan out\nYou runnin low on yo' cream, I'm rubber band out\nBeen gettin money like the only thing to get\nYou run up talkin reckless, dude I tell 'em this\n\n[Chorus: Famous]\nI'mma knock you ouuuuut\nYou keep runnin yo' mouuuuuth\nHere's how it's gon' beeeee\nI can't see it no other way, I gotta be me\nI'mma knock you ouuuuut\nYou keep runnin yo' mouuuuuth\nHere's how it's gon' beeeee\nI can't see it no other way, I gotta be me\n\n[Verse 2]\nI ain't dancin, I got a cup and I'm posted on the wall\nWon't get too drunk cause niggas might open up a brawl\nYou holdin on a broad and you off of some liquor\nAnd she got your mind blown so you offer to lick her\nDon't care about flossin my nigga\nReason you see a bitch every day cause you look in the mirror\nSpill some beer on my kicks and you catchin a fist\nSo hold your drink, don't be tough and go mess with a bitch\nV.I.P. with somethin sharp in my boot\nJust in case you got beef and wanna start with my group\nHoes eyes on me when I step in the club\nThey don't fuck with button-up boys, they wanna mess with a thug\nCoward niggas see me comin so they exit the place\nHundred deep and we don't care about catchin a case\nStop lyin by the gun that rest on your waist\nBefore you on the flo' where niggas two-step on your face\n\n[Chorus: Famous]\nI'mma knock you ouuuuut\nYou keep runnin yo' mouuuuuth\nHere's how it's gon' beeeee\nI can't see it no other way, I gotta be me\nI'mma knock you ouuuuut\nYou keep runnin yo' mouuuuuth\nHere's how it's gon' beeeee\nI can't see it no other way, I gotta be me\n\n[Verse 3]\nUhh, yeah\nAnywhere that my crew party the freaks all on us\nAnd valet get the keys with peace signs on 'em\nAny club that I'm at, I walk right through\nThe hoes wanna sexually assault my crew\nI ain't handcuffin a bitch, unless it's to a bedpost\nBut slip up with your chick, we take her\nGet buck if you wanna, I throw a couple apes on your heels\nAnd I talkin 'bout the kicks from Asia\nI get a lot of hate cause my clique is major\nSo I furnished the inside of the boots with razors\nThe owners get mad, they like\n\"Fame, we got enough strobe lights, please remove the bracelet\"\nI'm on the dance floor where the hoes all sweatin\nThough I get love from the roped off section\nWhen I pop bottles you can get your whole crew wet\nScreamin Purple Gang while we doin the two-step\n\n[Chorus: Famous]\nI'mma knock you ouuuuut\nYou keep runnin yo' mouuuuuth\nHere's how it's gon' beeeee\nI can't see it no other way, I gotta be me\nI'mma knock you ouuuuut\nYou keep runnin yo' mouuuuuth\nHere's how it's gon' beeeee\nI can't see it no other way, I gotta be me", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}