{"songs": [{"title": "Me and My Girlfriend", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-11-05", "lyrics": "[Intro: Virginya Slim]\nShit, you mothafuckin' right!\nI'm the bitch that's keepin' it live and keepin' it hot\nWhen you punk-ass niggas don't\nNigga, west side! What?! Bring it on!\n\n[Refrain: 2Pac]\nLook for me, lost in the whirlwind\n'96 Bonnie and Clyde, me and my girlfriend\nDoin' 85 when we ride\nTrapped in this world of sin\nBorn as a ghetto child, raised in this whirlwind\n\n[Verse 1: 2Pac]\nOur childhood years recall the tears, heart laced with venom\nSmokin' sherm, drinkin' malt liquor — father, forgive 'em\nMe and my girlfriend, hustlin'\nFell in love with the struggle\nHands on the steering wheel, blush while she bail out bustin'\nFuck 'em all, watch 'em fall screamin'\nAutomatic gunfire exorcisin' all demons\nMy mafioso messiah, my congregation high, ready to die\nWe bail out to take the jail back, niggas unite\nOur first date, couldn't wait to see you naked\nTouch you in every secret place\nI could hardly wait to bust freely\nGot you red-hot, you so happy to see me\nMake the front page, prime time, live on TV\nNigga, my girlfriend, baby 45 but she still live\nOne shot make a nigga's heartbeat stop\n\n[Interlude: Virginya Slim]\nWhat?! I'm bustin' on you punk-ass niggas\nRun, nigga, run! I'm on yo' ass, nigga\nRun, nigga! Duck and hide\nWhen I'm bustin' on all you bitches!\nRun, nigga! Yeah, Westside!\nUh! Uh! Uh! Die, nigga, die!\n\n[Verse 2: 2Pac]\nMy girlfriend blacker than the darkest night\nWhen niggas act bitch-made she got the heart to fight\nNigga, my girlfriend, though we separated at times\nI knew deep inside, baby girl would always be mine\nPicked you up when you was 9\nStarted out my life of crime with you\nBought you some shells when you turned 22\nIt's true, nothin' compares to the satisfaction\nThat I feel when we out mashin'; me and my girlfriend\n\n[Chorus: 2Pac]\nAll I need in this life of sin\nIs me and my girlfriend\nDown to ride to the bloody end\nJust me and my girlfriend\nAll I need in this life of sin\nIs me and my girlfriend\nDown to ride to the bloody end\nJust me and my girlfriend\n\n[Verse 3: 2Pac]\nI was too immature to understand your ways\nInexperienced back in the days\nCaused so many arguments and strays\nNow I realize how to treat you, the secret to keep you\nBeing faithful, ‘cause now cheating's lethal\nWe're closer than the hands of time\nDeeper than the drive of mankind\nI trust you dearly, I shoot blind\nIn time I clock figures, droppin' niggas as we rise\nWe all soldiers in God's eyes\nNow it's time for war, never leave me, baby\nI'm paranoid, sleepin' with you loaded by my bedside, crazy\nJealous when you hang with the fellas, I wait patiently alone\nAnticipated for the moment you come home\nI'm waitin' by the phone, this is true love, I can feel it\nI've had a lot of women in my bed, but you the realest\nSo if you ever need me, call, I'll be there through it all\nYou're the reason I can stand tall: me and my girlfriend\n\n[Chorus: 2Pac]\nAll I need in this life of sin\nIs me and my girlfriend\nDown to ride to the bloody end\nJust me and my girlfriend\nAll I need in this life of sin\nIs me and my girlfriend\nDown to ride to the bloody end\nJust me and my girlfriend\n\n[Verse 4: 2Pac]\nI love finger-fuckin' you, all of a sudden I'm hearin' thunder\nWhen you bust a nut, niggas be duckin' or takin' numbers\nLove to watch you at a block party, beggin' for drama\nWhile unleashin' on the old-timers, that's on my mama\nI would trade my life for yours, behind closed doors\nThe only girl that I adore, everything I'm askin' for\nTalkin' to me, beggin' me to just take you around\nSeventeen, like Brandy you just wanna be down\nTalkin' loud when I tell you be quiet\nYou move the crowd, bustin' rounds, activatin' a riot\nThat's why I love you so, no control, down to roll, unleash\nAfter a hit, you break apart, then back to one piece\nMuch love to my one and only girlfriend, the world is ours\nJust hold me down, baby, witness the power\nNever leave a nigga alone, I love you black or chrome\nTurn this house into a happy home: me and my girlfriend\n\n[Chorus: 2Pac]\nAll I need in this life of sin\nIs me and my girlfriend\nDown to ride to the bloody end\nJust me and my girlfriend\nAll I need in this life of sin\nIs me and my girlfriend\nDown to ride to the bloody end\nJust me and my girlfriend\nAll I need in this life of sin\nMe and my girlfriend\nDown to ride to the bloody end\nMe and my girlfriend\n\n[Refrain: 2Pac]\nLost in the whirlwind\n'96 Bonnie and Clyde, me and my girlfriend\nDoin' 85 when we ride\nTrapped in this world of sin\nBorn as a ghetto child, raised in this whirlwind\nLook for me, lost in the whirlwind\n'96 Bonnie and Clyde, me and my girlfriend\nDoin' 85 when we ride\nTrapped in this world of sin\nBorn as a ghetto child, raised in this whirlwind\nLook for me, lost in the whirlwind\n'96 Bonnie and Clyde, me and my girlfriend\nDoin' 85 when we ride\nTrapped in this world of sin\nBorn as a ghetto child, raised in this whirlwind\nLook for me, lost in the whirlwind\n'96 Bonnie and Clyde, me and my girlfriend\nLost in the whirlwind\n'96 Bonnie and Clyde, me and my girlfriend\nMe and my girlfriend", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}