{"songs": [{"title": "The Best Thing Yet", "album": null, "year": null, "lyrics": "[Royce Da 5'9\" - Intro to Verse 1ne]\nOne, two..\nOne, two...\nThis one's for you..\nYeah\n\nI love him more than I love me, trust me\nLove at first sight, is there a such thing? There must be\nThis is how it goes huh? My lil' man growin up\nFaster than I'm blowin up, don't wanna hit the road now\nCan't even tell him no now\nEvery line from here on in is for him, put somethin on the flo' now\nRapping ain't accept me 'til the night I met Slim\nHe was born the same night, tell me that he ain't special\nMy grandmama died the same night\nSame hospital that he was conceived in, God has His reasons\nYou can probably imagine mournin a death\nAnd rejoicin a life at the same time - but you prol'ly haven't!\nFate has a way that it turns\nHad a death, in the family, had a baby, couldn't turn, that away\nHe knows that his daddy sellin (sellin), records\nWhen he grew, old enough to understand me\nYou KNOW I had to tell him\n\n[Hook: sample from Anita Baker's \"You're the Best Thing Yet\"] (Royce)\nYou're the best thing yet (This is for you!)\nTo ever come in to my liiiiiii-iiiiife, oooh...\nYou're the best thing yet\nTo ever come in to my liiiiiii-iiiiife, oooh...\nYou're the..\n\n[Verse 2wo]\nFor him, I could get so selfish\nIt's strange how love can make you contradict yo'self\nHow could I tell him not to steal and, I would steal for him\nTell him killin is wrong and I would kill for him\nI told him I would never take myself away from him\nI would fight for him, at the same time, I'd do life for him\nJump in front of a slug for him, this is unconditional love\nAnd I wouldn't wish none of the above on him (above on him)\n..I best be, on my best behavior\nMistakes made by me don't only affect me\nAffects him too, check what I been through\nThey say your money's only as long as your next pencil\nWhen you livin the rap life\nAnd you givin your fans, verbally what you would get for a crack pipe\nThis is the main reason I write\nRoyce Daniel, the single most important thing in my life\n\n[Hook]", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}