{"songs": [{"title": "Back Up Off Me", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "[Mean Green]\nWhat's up y'all? It's the Mean-ster Green-ster\nTHIS should be played in residential neighborhoods\nClubs, cars, at high volume\nGet (?) wodies, at high volume\n\n[Master P - over Mean Green]\nUNNNNNGHHH! Where all my No Limit Soldiers at?\nWHAT? WHAT? WHAT? WHAT? Where y'all at?\nWHAT? WHAT? WHAT? WHAT? (Throw 'em up, throw 'em up, throw 'em up)\nWHAT? WHAT? WHAT? WHAT? (Get 'em up, get 'em up, get 'em up)\n\n[Hook 2X: Master P]\nI'm a Down South nigga so FUCK Y'ALL NIGGAZ\nI'm a West coast nigga so FUCK Y'ALL NIGGAZ\nI'm a East coast nigga so FUCK Y'ALL NIGGAZ\nI'm a Midwest nigga so FUCK Y'ALL NIGGAZ\n\n[Master P]\nRented gat in his ride, wodie throw 'em up high\nWe some No Limit Soldiers 'til the day that we die\nAnd everybody in my click be rowdy (UNNNNGHHH)\n(?) boot up, or shut up, or get routed!\nI'm from the streets and I hang with killers\nI make music by the ghetto for the thugs and killers\nWodie respect my hood, screamin C-P-3\nNigga and Magic and Snoop, over there with me\nCause I'm a Uptown nigga so FUCK Y'ALL NIGGAZ\nIf we got problems we gon' bust them triggers\nThrow them thangs boy, like Sugar Shane Mosley\nShake them haters, cause y'all can't hold me\n\n[Hook]\n\n[Mr. Magic]\nGet bucked up, nigga tear da club up\nIf you ain't bout gettin rowdy then back the FUCK UP\nY'all, know when I'm comin you hear the chopper go BLAKA BLAKA\nI came to tear the ROOF off this motherfucker\nThe hyper y'all get the harder I spit (WHOOO!)\nAnd won't stop until they start a fight in this bitch!\nWhen I touch the mic I set the bitch on fire\nWho say they harder? They a motherfuckin LIAR!\nI touch the stage the crowd go crazy (AHHH!)\nThe Devil raised me, you motherfuckers can't fade me\nMr. 9th Ward, better respect this\nI keep my head in the air because I know I'm the shit!\n\n[Hook]\n\n[Snoop Dogg]\nB-O-U-T bout it (bout it)\nTear this motherfuckin club up, nigga get rowdy\nBig Snoop D-O-double-G in this sonuvabitch (beitch)\nGotcha runnin cause I'm comin with that South shit\nClose your mouth BITCH, DoggHouse BITCH\nWhatchu thought motherfucker? We gon' stay rich\nWell, the sayin goes, we slangin hoes\nWhile y'all be payin hoes, we G'd up\nAnd we pushin these pony-ups\nAnd the heat goes where the homie goes\nAnd the homie knows\nNo Limit and DoggHouse keep it crack-a-lackin\nMackin actin, rip-rackin, gun clappin and chip stackin\n\n[Hook] - 1/2\n\n[Magic] Back up off me!\n[M.P.] Bitch, get off me!\n[Magic] Better back up off me!\n[M.P.] Bitch, get off me!\n[Magic] Better back up off me!\n[M.P.] Bitch, get off me!\n[Magic] Better back up off me!\n[M.P.] Bitch, get off me!\n[Magic] Better back up off me!\n[M.P.] Bitch, get off me!\n[Magic] Better back up off me!\n[M.P.] Bitch, get off me!\n[Magic] Better back up off me!\n[M.P.] Bitch, get off me!\n[Magic] Better back up off me!\n[M.P.] Bitch, get off me!\n\n[M.P.] I'm a 3rd Ward nigga so FUCK Y'ALL NIGGAZ\n[Magic] I'm a 9th Ward nigga so FUCK Y'ALL NIGGAZ\n[Snoop] I'm a Long Beach nigga so FUCK Y'ALL NIGGAZ\n[M.P.] I'm a No Limit nigga so FUCK Y'ALL NIGGAZ\n\n[Master P]\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nNow which one of y'all motherfuckers (??)\nBACK THE FUCK UP!!\n\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\n\nShake them haters off, shake them haters off\nFuck the world nigga, haha (BEOTCH)\nWe back wodie! No Limit! Snoop! (WOOF WOOF) P! And Magic\nSo what I want y'all to do right now\nBOUNCE! (Shake them haters shake them haters shake them haters off)\nMotherfucker\n\n[Snoop]\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\nShake them haters off, shake them haters off\n\n[Master P]\nYo Snoop, it's your country uncle Master P man\nThe black Tony Montana, I wanna tell you\nThank you for ery'thing you did for No Limit\nWe won the fuckin war together\nWe can do what we wanna do after this\nIt ain't No Limit Snoop, you been good to me\nNow it's time for me to be good to you\nI'm bout to give you your own blocks wodie\nYou do what you wanna do\nBring 'em in, we get the kilos from the South to the West\nWe ship 'em, give it to the world\nSell it to the fuckin record stores!\nTell the fuckin haters to shut up!\nCause it still ain't No Limit\nI know they thought this was \"Tha Last Meal\"\nBut they don't realize it ain't the last deal Snoopy\nIt's me and you baby, let's toast to success!\nDoggHouse, No Limit, to the fuckin world man!\n\"Last Meal\" on that puta, you fuckin cockroaches!", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}