{"songs": [{"title": "SUWU", "album": "Dedication 6", "year": "2017-12-25", "lyrics": "[Intro: Lil Wayne (DJ Drama)]\nYeah, I really don't wear shades when I do my verses\nBut uh, sometimes I don't want to see my words\nThis for you, Six shit\nYeah, hello?\n(Free 6LACK)\nBrrr, Hello?\nFuck it, fuck it, yeah, yeah, yeah...\n(Mafia Family, that is)\nDedication 6\n(Free C5!)\n\n[Verse 1]\nRoses are red, our eyes are too, yeah\nThe pillows, the bed, the light bulbs too, Suwu\nThe scarf on my head and her drawers too\nNone of this shit she heard before\nMy lies all new, true\nI cross my heart, I won't cross you, damn\nRide me so good I need horse shoes, ohh\nEat that shit out like some soul food, yeah\nCut the shit down, you'll hear old Tune, brrp\nShe come to my house and I got drugs layin' 'round\nSo easy to pick up, and they so hard to put down\nGift and a curse\nAnd she don't mind fuckin' with girls\nAs long as Tiffany's first\nHello, fuck it\n\n[Hook]\nThat's my little baby, that's my little baby\nShe get a little brazy, but she still wavy (Suwu)\nThat's my little baby, that's my little baby\nShe get a little faded, but she still savin' (Fuck you)\n\n[Verse 2]\nRoses are red, our eyeballs too\nWe go from the sofa, to floor, to the bed, these nice walls too\nRoses are red, our skin tone too, yeah\nLet's go off to space, the way stars do, (Pewm)\nWe gone, it's all in our heads, and our hearts too, (Vroom)\nI'm gone, she waitin' in bed for that part two, (Skrt)\nI'm back, and we argue all mornin', fuck all noon, (Err-Ehh)\nThat's what the bed and the walls do\nHel-Hello? She come to my house and I got guns layin' 'round\nBut, she treat each one of them like it's her own child\nGift and the curse\nAnd she don't mind fuckin' with girls as long as Tiffany's first\nHello, fuck it (Suwu)\nRoses are red and my stones too\nThe roses are dead and my phone too\nDamn, I'm changin' her life, her ringtone too\nCut that shit down, you'll hear old Tune\n\n[Hook]\nThat's my little baby, that's my little baby\nShe-she get a little brazy, but your bitch basic\nThat's my little baby, that's my little baby\nShe said, \"Fuck that nigga, Baby, I'm your real baby.\"\n(Fuck it)\nThat's my little baby, that's my little baby\nShe get a little faded, but she steal safely", "image": "https://images.genius.com/380dd8ad2dd34e87e19877a3ba6ee494.598x598x1.jpg"}], "artist": "Lil Wayne"}