{"songs": [{"title": "The 5th", "album": "VI - Return of the Real", "year": null, "lyrics": "He yo, Ice\nThis guy here say he wants to get in, man\nYou're sure homeboy's ready?\nYo Ice, this nigga said he's ready, man\nYo, kid you're sure you wanna be down with this, right?\nYeah, I'm sure, I'm ready\nAight\nKnow what you're in for, right?\n\n[ VERSE 1 ]\nBlood flows like sands in the hourglass\nCash moves everything\nBitches in g strings\nGats flashin, mothers make cream on a stick move\nImprove your dope flow\nCold max with the long dough\nHigh rollin, back breakin plot diggers\nThe ill niggas\nComanche style\nBlood letting weapons of death\nStop your breath\nIf you trip on the click\nA hot thump to your chest\nAnd your back just rips\nYou wanna be a made man\nThe fam accepts no mistakes\nChopped up bodies, lots of funeral wakes\nMake your bones\nBring a rat back dead just ahead\nA cop's better\nUse this beretta\nSnitch, bet your bitch\nShe in a pre-dug ditch\nCause I command a whole batallion of life takers\nPlus the other bosses wanna see yo guts\nCheck your nuts\nDump the bodies in the desert\nHere's the keys to a truck\nMe, I'm overloaded, born hard and scarred\nCrime intellect\nMore complex than nerves in your spinal chord\nBank job my forte\nNot off of gunplay\nHostage taker\nI killed my brother with a salt shaker\nHe tried to short me a buck\nWhat the fuck?\nA nigga that lies\nIs a nigga that dies\nNo cries for the punk\nHe got trunked and bombed\nSince he tried to steal I chainsawed his arm\nI drink blood from a cup when I wanna then\nPlus the bosses up north made me kill my friend\nThey told me, \"This ain't no game, kid, you're in it\nYou're down with the Syndicate, but never admit it\"\n\n[ Hook ]\nMuthafucka, now you're down for life\nRat on the fam and we'll kill your wife\nFuck up a scam and you'll feel the knife\nWho is this?\n(The Syndicate does not exist)\n\n[ VERSE 2 ]\nA thousand ki's, off-shore private yacht\nReally ain't no sweat, Coast Guard and customs are bought\nColumbian-Mexicano connect\nRaise the bet\nOne DEA woudn't roll, we pulled his tongue through his neck\nJust a message to the rest: don't test\nHousing developments are built on the bodies\nOf punks who wouldn't party\nBig shots are called from the pen's inner sanctum\nWhere the mega-gees\nRegulate the streets, fuck release\nThey got power that you can't comprehend, my friend\nThey want you dead, yo, you're dead before the daylight ends\nYour eyes shiver and you grit your teeth\nYou sold your soul, now cold blood's how you get relief\nNow you do what we do, say what I say\nMuthafucka, don't blink unless I say okay\nThis is a organization, not a one-man gang\nAnd you die if I ever hear you spilled my name\n\n[ Hook ]\n\nMy friend, I thought this day would never come\n(What do you mean, man? Hey!)\nWho was there when your wife had your first child?\n(Hey, why you're lookin at me like that, man?)\nWho looked out for you when no one else was there?\n(Hey, I'm your friend, man!)\nNow word's out you're talkin to the feds about me\n(..they lyin, man)\nThere's only one thing I can do\n(Hey man, wait a -)\nYou treat me like a bitch\n(Hey yo - )\n( *shots* )\nNow look at you!\nLook at you, muthafucka!\nNow look at you!\n\n[ VERSE 3 ]\nCops on the take, I got moves to make\nFeds ain't that easy, I still got em to shake\nThey had my man's bitch wired for a month and a half\nSnatched my nigga up in Aspen, bail's five million\nBounced him out in a hour - power\nWent and met him quick, hit him with a ice pick\nCan't take no chances, he romancin with whores\nNo tellin what he spilled when behind closed doors\nThe fam's protection and loyalty is top priority\nViolate, your body is found in three states\nCargo is heat on a Hong Kong cruiser\n??? contact ???\nNo cash, they want a ton of crystal meth\nHigh risk'll bring more riches than the national debt\nWe launder money through he s&l's and pro-ball teams\nAin't no business untouched when it comes to cream\nDocuments forged from my hitters from Jamaica\nIn and out of town before you hit the ground\nThis is the mob, baby, now you're on, no off-switch\nSuffocation ??? you snitch\n\n[ Hook ]", "image": "https://images.genius.com/8794c719c37c748d62c37145c9babe1a.700x700x1.jpg"}], "artist": "Ice-T"}