{"songs": [{"title": "Straight Through", "album": "Maximum Strength 2008", "year": null, "lyrics": "[Intro - sped up vocal sample]\nTonight's a special night\nSo remember with pride, these 20 happy years\n\n[KRS-One]\nI can't leave my b-boys alone\nI can't leave my b-girls alone\nLet's turn this house right into a home\nC'mon y'all let's get into the zone\nVibrate or mute or cellular phone\nIn here they might already be on roam\nMinds are blown, I'm showin\nYou ain't gotta go major you can do it alone\nAs I look back on all the years, all the tears\nAll my peers, in fear\nI hear, insecurity, the need for clout\nLow self-esteem and self doubt\nKRS lays out a whole different route\nAnd shows you what hip-hop is really all about\nThen we on the route, release self doubt\nAnd sing with the feds when the fear is out now\nClear 'em out now, from the bottom to the tip-top\nTake the vow, I am hip-hop\nAnd recreate yourself, love don't hate yourself\nDo not deny or lie or fake yourself\nYou can make yourself, reawake yourself\nYou can mold remodel and reshape yourself\nYou gotta take yourself more seriously\nCreate yourself to what you really can be~!\nYo the villain is free, look at me, I do what I do\nI am hip-hop and so are you\nYo we almost through, but before we go\nI wanna invite y'all all, to every show\nWhere the b-boys and girls are kept on their toes\nLike the Rocksteady Crew tribute with Fat Joe\nSo now you know, if you got what it takes\nNo doubt, show 'em what you really all about!\n\n[KRS-One]\nYo, now that that is out of the way\nLet me continue what I came to say\nBreakers, writers, emcees and DJ's\nBeatboxers too we've come a long way\nCome to the Temple of Hip-Hop today\nOur hip-hop week is every third week of May\nHip-Hop appreciation we remember\nHip-Hop history, that's in November\nPeace, love, unity, that's the agenda\nWhen I'm on the mic that's just what I send ya\nWe at the end sir, so what's the answer\nHip-Hop can be more than MC's and dancers\nIt's time to expand your\nAwareness, consciousness, enhance your\nLiving, tell me, what are you playing for\nWhat are you staying for, what are you giving?\nI will demand your respect, with two MC's\nTwo b-boys, two DJ's on set\nTwo hour shows you bet!\nWe get authentically hip-hop as hip-hop can get\nIndependent, free from debt\n2005 you ain't seen nuttin yet\nSome like it dry, some like it wet\nSome like to give, some like to get\nSome like a good soundset\nYou a b-boy and you ain't been out to the Bronx yet?\nNo, yes, maybe, someday\nWhatever, we bring it to you Sunday to Sunday\nWorkin for peace love unity and fun day\nJust a little somethin to balance off gunplay\nSo now for the break if you got what it takes\nNo doubt, show 'em what you all about!", "image": "https://images.genius.com/8e8d71ccffef56195f7ad1ad515b3f54.640x640x1.jpg"}], "artist": "KRS-One"}