{"songs": [{"title": "Are You Ready for This", "album": "Keep Right", "year": null, "lyrics": "[Hook: KRS-One]\nWell are you ready for this? (We ready for this)\nAre you ready for this? (We ready for this!)\nWell we just can't miss (just can't miss)\nWell we just can't miss (drop the beat like this)\nWell are you ready for this? (We ready for this)\nAre you ready for this? (We ready for this!)\nWell we just can't miss (just can't miss)\nWell we just can't miss\n\n[KRS-One]\nWell when I speak this\nI'ma be like this, I'mma be like Kris\nI'ma teacher, I'mma preacher, I'mma free my kids\nI'ma grow dem and show dem what a leader is\nI'ma teach dem the laws of receive and give\nKnowledge Reigns Supreme, believe and live\nYou done heard the hype, COME to where the talent is\n\"I'm Still #1,\" yup you heard right\nPeople say, \"KRS-One you shine bright!\"\nOthers say, \"Yo - you rhyme tight\"\nWhen you find me, you find light, and that's alright\nI don't know about pimpin, sellin women like retail\nOr turning coke into crack for resale\nBut I do know if we fail\nIn 2020 our children by the million gonna be jailed\nWe got the victory over the streets\nGod willin we chillin, we know we gon' eat\nI'm a whole different kind of MC, hoes don't like\nNot tempt me but the ladies treat me oh so gently\nUniversities sendin me stretch Bentleys\nMy seminars and lectures, are rarely never empty\nWe teach students plenty, honorary degrees\nGold and platinum plaques I got many, ask Kenny\nPeople get shocked when I walk into Denny's\nOr the corner Kwik-Stop, they say, \"That's Hip-Hop\nRight there,\" and yeah it's really quite clear\n2004 might be the right year\nFor mental and spiritual repair\nThe solution is in the resolution you just declared\n\n[Hook]\n\n[KRS-One]\nWhen I speak like this\nKnowledge Reigns Supreme, hip-hop philosopher\nAll in the street well I'm very popular\nAll through the hood I make all the stops and I\nAvoid the cops and them random shots well I\nLove hip-hop and I, live hip-hop so I\nSpit that shit to get you off your block cause I\nCan't understand and I, wish I could see dem\nCats that talk bout they love the hood and they\nNever bring the hood anything that's good, and they\nRap for the money tree, chasin a company\nBut I think you can now see, rap is fun to me\nI got a ministry, a class, a staff that's under me\nKRS in pop rap?  Nah, it ain't ought to be\nIt'll never happen like, you eatin pork with me\nAmateurs hawkin me, DON'T EVEN talk to me\nMy house is in Atlanta but I still got New York in me\nWalk with me, most rappers are short to me\nI'm like Chamberlain, dominatin the sport you see\nI toss MC's off of me\nWhen you hear KRS you say that's how it ought to be\n\n[Hook]\n\n[KRS-One]\nI drop heat like this!", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}