{"songs": [{"title": "Recognize Game", "album": "You Nasty", "year": null, "lyrics": "[$hort] Straight pimpin\n[Chyna] Check, fuck all that pimp shit\n[$hort] Whatchu say bitch?\n[Chyna] Haha, nigga know what you do?\nYou let my nuts go, ya heard me?\nYou let my nuts go, hahahaha\n[$hort] Oh you Chyna White huh?\n[Chyna] It's a new breed of bitches out here baby\nHaha, we do it live ya heard me? Haha\n[$hort] I got somethin for yo' ass\n[Chyna] Yeah baby, it's all game\n\n[Too $hort]\nI got that old game, but I don't need Viagra\nSpit a few lines in no time I'll have ya\nIf I don't, I find a new bitch\nAnd if you tryin to get back it's useless\nI can't do shit, unless you pay me\nI been breakin in hoes since the 80's\nAin't nuttin changed, it's still a pimp thang\nAnd if you ain't wit it, you must be insane\n\n[Chyna]\nYeah you might talk like a pimp, walk with a limp\nBut look - you bout old as the game\nShort Dawg shit is all in your name\nAnd fuck dick, cause it all be the same\nShit, I be the one to get in your brain\nTo make you know you ain't shit\nYou got a Benz, I got a Jag, so what?\nYou got hoes, I got niggas to cut\nAnd I treat 'em like prostitutes and sluts\nTake it from Chyna; niggas ain't shit but dick and nuts\n\n[Too $hort]\nYeah baby.. I always respect the game\nThat's why bitches, always let me hit that thang\nI hit it good, I hardly ever keep in touch\nTop notches, it's hard to believe I fuck\nBut I did it, every time I see her I get it\nI know you heard Short Dawg got digits\nDon't forget it, I'm all about the pimp shit\nI ain't no sucker with a limp dick\n\n[Chyna]\nFuck the dumb shit, niggas they come quick\n9th Ward bitches always get they cunt licked\nYou know the game, if you get a ho it's probably from the fame\nUgly niggas pretty bitches you know the aim\nI got niggas with my name tatted on they chest\nAnd I don't give a fuck about another bitch cuz I'm the best\nPicture Chyna long mink in a stretch\nBack to back with a Lex, lettin off tecs, ya heard me?\n\nChorus: Too $hort + Chyna White\n\n[$hort] It ain't the same, shit done changed\nNew Orleans bitches live against the grain\nOakland niggas we be off the chain\nChyna White and Too $hort play the game, whatchu say?\n[White] It ain't the same baby, shit done changed baby\nWhat what game recognize game baby\nWhat what all my thugs let 'em hang baby\nChyna White and Too Sheezy off the chain baby (ya heard?)\n\n[Too $hort]\nI been spittin this game since about 2:40\nIt's a quarter to 3, whatchu gon' do shorty?\nChoose on a player or roll with a square\nI'm tryin to holla at you, fuck them hoes over there\nI wish I could get you outside in my truck\nPut my hang between your legs maybe then I'll fuck\nYou know whassup, I'mma see you next time\nDroppin sex lines, so I can fuck one time\n\n[Chyna]\nNigga how many times you done seen \"The Mack?\"\nHow many times you gon' think with your sac\nThen talk with your genitals?\nI run with strictly criminals\nTop notch bitches, in drop top sixes\nI'm from New Orleans, where bitches put shit in your greens\nBury your drawers, shatter your dreams, make you stop eatin\nCabbage and beans, dolla dolla what them know bout the cream\nAnd fuck the worl cause it ain't what it seems (ya heard?)\n\nChorus Two: Chyna White\n\nIt ain't the same baby, shit done changed baby\nNew Orleans bitches live against the grain baby\nOakland niggas baby off the chain baby\nChyna White and Too $hort play the game baby\nIt ain't the same baby, shit done changed baby\nWhat what game recognize game baby\nWhat what all my thugs let 'em hang baby\nChyna White and Too Sheezy off the chain baby\n\n[Too $hort]\nYou know us Oakland niggas still pimp to this day\nStill wear perms with big old waves\nThree or four hoes in a mini-van\nRidin round tryin to get all I can\nWhen you see \"The Mack,\" you see my town\nIf hoes get money we'll be around\nTalkin that punk bitch out her chips\nPlease believe me, don't doubt the shit\nI'm still pimpin.. let it ride", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}