{"songs": [{"title": "Tears to Snow", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Verse 1]\nMan, Fuck!\nMe and my girl keep arguin'\nSomehow my life just got hard again\nShe's scared of groupies that steady bargin' in\nI can't explain the pain my heart is in\nYeah I got money, but reality isn't sunny, it's dark and grim\nSee when I'm tourin' I don't take her\nSo she get filled with anger, thinkin' another woman is gon' replace her\nShe standing in tears of emotion knee deep\nI keep tryna tell her \"Why? I ain't fuckin' no groupie!\"\nShe don't believe me\nMy career is so deceiving\nShe's dating a rapper, nobody said it was gon' be easy\nShe threatening to leave me cause of these text messages girls send\nNow I'm just caught in this whirlwind\nTryna explain they just friends who can't control themselves\nThey see the fame, think I'm cute, and they get overwhelmed\nShe should fuckin' know the deal\nI'm done dealing with this bull shit\nBitch, I'm outta here, you can go to hell\n\n[Chorus]\nThere's no room to drive at the end of the road\nWhen you're living in the cold not wearing a coat\nThe breeze turns tears to snow\nWill they ever learn to love me? (ever learn to love me)\nDon’t fucking call me\nStop trying to reach me\nI ain’t tryna hear all of your bullshit, just leave me\n\n[Verse 2]\nThe underground ain’t been the same since I emerged from it\nNiggas hear my name and they just hate, and throw some dirt on it\nTalking 'bout I blew up and just left them in the dust\nBut we ain’t friends mothafucka we ain’t neva kicked it once\nYou better zip it shut, I’m respectful\nBut if I spot you that’s the only time that I won’t ever give a fuck\nYour words can make a difference, do not forget\nIf you run your mouth and talk shit, you payin' for what comes out of it\nBitch niggas acting all macho, jealous 'cause they ain’t got dough\nWhile they still won’t put enough for me at my show\nSmiling coming over to me, like I’m the coldest MC\nAnd then you bad mouth the moment I leave\nAight, I got it since I’m in the limelight\nYou niggas try to look cool by not being hyped about my hype\nSimple and plain, better watch where your missiles are aimed\nInsult my name you’ll rekindle a flame, nigga\n\n[Chorus]\nThere's no room to drive at the end of the road\nWhen you're living in the cold not wearing a coat\nThe breeze turns tears to snow\nWill they ever learn to love me? (ever learn to love me)\nDon’t fucking call me\nStop trying to reach me\nI ain’t tryna hear all of your bullshit, just leave me\n\n[Verse 3]\nI’m about to lock myself in my basement and dig my grave inside\nAll jokes aside, man I see no reason to stay alive\nIf I do it, I won’t even say “good-bye”\n“Ya, ho, but you’re Hopsin, and you have so many fa-ans!“\nYeah, great advice\nI’m not lucky\nOutside of Hopsin, there's no one who loves me\nI come home to absolutely nothing\nNobody pays any mind to Marcus\nThey treat me like I’m retarded\nThey just want me to slave away as an artist\nIt don’t make any sense to me\nNo one wants to get to know the real me\nThey just want some pictures for they friends to see\nI deal with this kind of stress, endlessly\nFuck this damn industry\nLook at all the shit that it just did to me\nI don’t care about no big collab or tryna swim in cash\nI just want a family I can watch the TV with and laugh\nUntil then, I’m on the dark side\nI’m the fuckin’ Dark Knight, startin’ bar fights\nJust a hard life\n\n[Chorus]\nThere's no room to drive at the end of the road\nWhen you're living in the cold not wearing a coat\nThe breeze turns tears to snow\nWill they ever learn to love me? (ever learn to love me)\nDon’t fucking call me\nStop trying to reach me\nI ain’t tryna hear all of your bullshit, just leave me", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}