{"songs": [{"title": "Valuable Game", "album": "The Seventh Deadly Sin", "year": null, "lyrics": "(Intro: Ice-T)\nThis song is dedicated to my man 2Pac Shakur, rest in peace!!\nNotorious B.I.G., rest in peace!!\nAnd all my other homies that have died\nIn the madness called street life\nRest in peace!!\n\n(Chorus)\nI'mma straight up G, let's not pretend\nDedicated to, all of my friends\nOn the East and the West Coast\nGotta let this drama go\n\n(Ice-T)\nNineteen eighty six, deep in the mix\nMe and my team out for cream and jewel-liks\nThe faster, the better, blood, leather, the baby sledge\nCase hitters - me, I'm the point man\nGive less than a damn about anything, just let my hammer swing\nCome up, give me my cut - what?\nGirls don't mean nothin' to me, don't push the button on me\nOut for the twist, ya nastically nasty G\nBasically makin' me anti-social individual, too hype\nRecognize the type?\nThen a music called hip-hop came along and saved my life\nI had a story to tell about my knowledge of hell\n$2.50 for a book, listen and look, now let's do some Math\nA gun and a hand, plus an angry man, minus love\nEquals and me, the sky's blue and they rags\nToe-tags and body bags - y'all feel me?\nIs it too real G? Brothers say drop some heat T\nAbsoultely, everything's goochie since we realized\nThis games' the only one we got left\nHip-hop's become the game of death\nSome of y'all busters out there tryin' to waste up\nIt would've took some of us hustlers all this time to lace up\n\n(Chorus)\nI'mma straight up G, let's not pretend\nDedicated to, all of my friends\nOn the East and the West Coast\nGotta let this drama go\n\n(Ice-T)\nOk, let me break it down, they got the one strike law\nYou go in, you reach the other two before you know\nWhat happen to you - game's over dude\nOn the next page, they got power in effect\nWhile you two rednecks waitin' to see which one of us\nKills the next brother next\nThink about it too long'll make you sick\nBelieve me the last thing they wanna see is us risin'\nEconomically, astronomically it could happen homie - follow me\nHip-hop's the black goal - mind and soul\nRefined as we roll, another ghetto story is told\nI stopped flippin' ki's in eighty three\nThey need a time machine to carcerate me\nI'm square as a pool table, twice as green, know what I mean?\nFlippin' from heat, the legal green, the hip-hop scene\nBeef, the only beef I got is the steak\nI'm tryin' to eat from the players elite\nEast, West, North, South, Moon, Star\nI'm gonna ball wherever the chips are\nI hope y'all players listen, ain't out there hatin' and dissin'\nY'all know the game is to be sold and not told\nI should be takin' a collection, this time I'll make an exception\nI've just been here for the start of this\nI gotta come from the heart for this\n\n(Chorus)\nI'mma straight up G, let's not pretend\nDedicated to, all of my friends\nOn the East and the West Coast\nGotta let this drama go\n\n(Ice-T)\nSome nights I lay awake tryin' to analyse\nAnd anticipate the moves of the fakes\nWonder if the cancers' in too deep - can't sleep\nTryin' to diagnose the poison that's increased\nInjected into a pure hustle born on city streak\nMigranes fill my brain as I reach toward the realm of the insane\nWishin' and prayin' that another brother gets\nTo live the life that I got to play in\nTryin' to represent to the fullest\nI gotta come hard y'all, no time to pull it\nY'all fools think illin' and tearin' up\nHip-hop is the thing to do G?\nI'm paid I don't need rap no more fool I make a movie\nY'all tryin' to lose me\nAnd to y'all suckers with your afrobatic, player hatin' tatics\nTryin' to jump over the bree and plannin' and hustlin'\nI've been corporatin' to this music over these years\nY'all will fall victim to your own lies and the P.I\nWill continue to rise, over your eyes kid\nThis games' immaculate, dramas' irrelevant - stay sucker reppellin'\nInvent, incoporate, parlay, play\nAnd I got no reason to lie to you\n\n(Chorus)\nI'mma straight up G, let's not pretend\nDedicated to, all of my friends\nOn the East and the West Coast\nGotta let this drama go\nI'mma straight up G, let's not pretend\nDedicated to, all of my friends\nOn the East and the West Coast\nGotta let this drama go\n\n------------------------------------------------------------", "image": "https://images.genius.com/64f26659fd999b48a36adf8773cb8eb0.1000x1000x1.jpg"}], "artist": "Ice-T"}