{"songs": [{"title": "New Wave", "album": "Electric Circus", "year": "2002-12-10", "lyrics": "[Intro: Common]\nYou! Yeah\nThe war is on, who you fighting for?\n\n[Verse 1: Common]\nIt's like funk to rhythm and punk to rock\nLoud like shot that come from a Glock\nPick up your mind, run from the spot\nRevolution jumping in the parking lot\nShit is so hot, that the sun watch\nChildren by the window with the gun cocked\nThey cooking the raw to start to lump knots\nMonkeys dance around for MTV spots\nI lock into a- (scratches)\nRock into a rhythm of street and ancient wisdom\nExperiment in stereo loud so crank the system\nFor the humble on the path, I paint a vision\nHow far will a nigga go just for attention\nAnd to be remembered? You forgot the mission\nListen!\n\n[Hook: Laetitia Sadier & Common]\nAll traces of life, in our guts we carry\nThat's used to dress humanity (it's a new wave, come on!)\nAll things I yearn for, you need per sanity\nThat reflex loves reality (it's the new wave, dig it!)\nClean up the choirs, tell me they shouldn't be\nThe times are reaching to the end (it's a new wave, come on!)\nThis life is precious, it's goddamn marvelous\nBefore it likely ever ends (come on, come on!)\n\n[Verse 2: Common]\nI lay terror in this era like Che Guevera\nFor the people to make or wait is better\nIn a room called real, I stay forever\nEveryday I lose something, I gain forever\nMeditate on how I can change the weather\nMy brainstorm for some is like planes, umbrella\nWhere bullets and lies both spray together\nMy mind scream like Al Green \"Let's Stay Together\"\nHow could a nigga be so scared of change?\nThat's what you hustle for, for the currency exchange\nY'all rich, we could beef curry in the game\nOut your mouth, ain't nobody hurrying my name\nYou seen what happened when the Com go bang\nWouldn't have a shot, even at a gun range\nSeen hype become fame against the grain become main\nStream, it all seems mundane in the scope of thangs\n\n[Hook: Laetitia Sadier & Common]\nAll traces of life, in our guts we carry\nThat's used to dress humanity (it's a new wave, come on!)\nAll things I yearn for, you need per sanity\nThat reflex loves reality (it's the new wave, dig it!)\nClean up the choirs, tell me they shouldn't be\nThe times are reaching to the end (it's a new wave, come on!)\nThis life is precious, it's goddamn marvelous\nBefore it likely ever ends (come on, come on!)\n\n[Verse 3: Common]\nFrom a land of shit talk, porn stars and pitchforks\nDidn't really see white until I went North\nGetting bent off in backyards\nWishing in the air for a black god\nWhere the people fix cars and clap hard\nAnd look to the stars for rap jobs\nI walk through the black fog with reflectors on my boots\nSmelling war near, I'm connected with the troops\nThat master anger, it ain't afraid to shoot\nThrough poured liquor, fallen angels they salute\n(Whew! Whew!) Feel the wind blow\nA new wave, people with they hair trimmed low\nIt's two ways living in this world of techno\nThis new age can't really save the ghetto\nI pause for the rebels, who rock heavy metals\nAnd tell them that they pharaoh so let go\nCome on!\n\n[Hook: Laetitia Sadier & Common]\nAll traces of life, in our guts we carry\nThat's used to dress humanity (it's a new wave, come on!)\nAll things I yearn for, you need per sanity\nThat reflex loves reality (it's the new wave, dig it!)\nClean up the choirs, tell me they shouldn't be\nThe times are reaching to the end (it's a new wave, come on!)\nThis life is precious, it's goddamn marvelous\nBefore it likely ever ends (it's the new wave, come on!)\n\n[Outro: Common]\nCome on!\nCome on!\nCome on!\nCome on!", "image": "https://images.genius.com/4f09b702f3b5aead8b4d73c0bfdb708e.936x936x1.jpg"}], "artist": "Common"}