{"songs": [{"title": "Lovely", "album": "508-507-2209", "year": "2017-06-16", "lyrics": "[Verse 1]\nFuck you doing in this motherfucker, huh?\nWho sent you here?\nWhy you keep fronting like your friends are here?\nActing like you ‘bout to be next this year\nI mean the food gone, ain't nothing left to share\nWe done ate that shit\nFunny how they told me to stack this year\nNow a nigga get colder than central air\nAnd your momma shoulda aborted you and left you there\nDamn, I need a massage\nWhere the gay bitches when I need a ménage?\nShe said she got a porn tape that I needed to watch\nAnd I remember days where I couldn’t even get by\nUh, I couldn’t even get mine\nCouldn’t pull a fine chick to save my life\nAnd ain’t nobody want to go with me to the prom\nAnd now I got so many hoes I can’t even decide\nReal shit, believe it or not\nThe light skins love me like I’m Chico DeBarge\nAnd I ain’t give a fuck if you’re sleeping or not\nTime to wake niggas up, whoo!\nFuck you talking ‘bout?\nI be fronting to these hoes like I’m rich\nAnd they don’t know I got a room at my momma’s house\nYou know it's always something 'bout the impressive ones\nWorking all week for my check to come\nAnd I ain’t make shit after taxes though\nBut it feel good not to stress so much\nKnow it’s something coming in for now\nAnd I can get my son a Nintendo now\nCouple shirts and a damn Netflix account\nThat’s it? (Goddamn) yep, but that’s okay\nI know that I’mma be alright, I ain’t rich for now\nBut I got dreams I could live for now\nAnd there’s a whole lot of niggas doing worse than me\nAnd that’s as good as it’s gonna get for now, cause\n\n[Chorus]\nI ain’t got much but I feel loved\nJust be real love, just be real love, just be\nI ain’t got much but I feel loved\nJust be real love, just be real love, just be (yeah yeah yeah)\n\n[Verse 2]\nI got work\nI could split heads in a drive-by first\nBlow your damn brains in your tie-dye shirt\nAnd I ain’t been the same since I got cursed\nI gave my CD to Bad Boy and I got curbed (damn)\nSo when you see Diddy, tell him I got words\nMy shrink keep telling me to calm my nerves\nBut it’s been a long time since I got heard\nAnd don’t nobody give a fuck when you starving though\nThey don’t answer me when I’m hollering though\nTry to cancel me like \"The Cosby Show\"\nUntil I put them hands on them like Rousey though\nI got a hundred fans waiting in the lobby line\nTaking shots like it’s party time\nHands up, ain’t nobody got to die\nI just got four rings like the Audi sign\nI just bought cocaine for a nigga to flip\nReal shit, the bigger the brick\nNow these hoes looking at the flick of the wrist\nAnd I can take your girl out to chicken and shrimp\nShe said my head so big I could live in a blimp\nWord? Heh, well listen to this\nI remember watching \"MTV Cribs\"\nThinking how the fuck all these wack niggas get rich\nWhile I’m eating TV dinners\nYou know, the ones with the meat in them?\nPause, I kinda wonder what they see in them\nGot laid off from a job, it was seasonal, geez\nI think I’ma need a hit for now\nWe all got dreams we could live for now\nBut there’s a whole lot of niggas doing worse than us\nAnd that’s as good as it’s gonna get for now, cause\n\n[Chorus]\nI ain’t got much but I feel loved\nJust be real love, just be real love, just be\nI ain’t got much but I feel loved\nJust be real love, just be real love, just be (yeah yeah yeah)\n\n[Post-Chorus]\nAnd I’m feeling way, way up\nAnd I’m looking way, way up\nAnd my bitches way, way up\nThey miss that yeah, yeah, yeah\nAnd she want that yeah, yeah, yeah\nAnd I got that yeah, yeah, yeah\nAnd we on that yeah, yeah, yeah\nSaid I’m feeling way, way up\n\n[Verse 3]\nHold up, pause\nWe was trying to eat till they told us \"Nah\"\nI wonder how much a pair of Pradas cost\nWith the ice cream, bottles and the Häagen-Dazs\nSomebody getting robbed while this song is on\nWe just want cheese and the parmesan\nI got a bitch at Mickey-D’s, she be working at night\nAnd she gon’ let me hit it with pajamas on\nYo why these niggas think I’m playing with them? Let the paper hit them\nYou be copying, that's plagiarism\nI be laying, sitting, standing on a fucking hater, kick him in the face\nThem niggas got me twisted, I ain’t saving bitches, I got Sega Genesis\nAnd I can play and finish if you want to pay attention\nI’m hoping you wait a second, I’m broke and I pay the rent\nI don’t know how I freakin' do it, I guess I don’t really believe in losin'\nI’ve been a winner since I was a little nigga, nigga!\nHold up, stop\nWe was trying to win 'til they told us \"Stop\"\nThe cops ran in trying to hold up spots\n‘Cause we were moving more O’s than a donut shop, whoo!\nI’m pissed for now\nI thought I had dreams I could live for now\nThey told me there was niggas doing worse than me\nMotherfucker this as good as it’s gonna get for now, ‘cause\n\n[Chorus]\nI ain’t got much but I feel loved\nJust be real love, just be real love, just be\nI ain’t got much but I feel loved\nJust be real love, just be real love, just be (yeah yeah yeah)\n\n[Post-Chorus]\nAnd I’m feeling way, way up\nAnd I’m looking way, way up\nAnd my bitches way, way up\nThey miss that yeah, yeah, yeah\nAnd she want that yeah, yeah, yeah\nAnd I got that yeah, yeah, yeah\nAnd we on that yeah, yeah, yeah\nSaid I’m feeling way, way up\nAnd I’m feeling way, way up\nAnd I’m looking way, way up\nAnd my bitches way, way up\nThey miss that yeah, yeah, yeah\nAnd she want that yeah, yeah, yeah\nAnd I got that yeah, yeah, yeah\nAnd we on that yeah, yeah, yeah\nSaid I’m feeling way, way up\n\n[Outro]\nWay, way up\nYeah, yeah, yeah\nYeah, yeah, yeah\nWay, way up\nWay, way up\nWay, way up\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nAnd I got that, and we on that\n\n[Voicemail]\nYo wassup, this is Joyner\nI'm unable to take your call right now\nLeave me a brief message and I'll get back to you, peace\n\n[Brief Message]\nMan made electric light, to take us out of the dark\nMan made the boat for the water, without a woman, or a girl\nOhh-ohh, this a man's, world", "image": "https://images.genius.com/15c4c3c9fa26958e4841c4e8276492ed.1000x1000x1.jpg"}], "artist": "Joyner Lucas"}