{"songs": [{"title": "Real Estate (Video Version)", "album": null, "year": null, "lyrics": "[B-Real]\nYou'll waste time to hurt her, sorta like murder\nA duck with the public's favorite rhyme order\nI ain't no waiter or hater of a spectator (kill em B-Real)\nSeekin to find the toys, with no flavor\nSee I'm talkin about those whose vocals ain't comin off\nA skill to kill at will, but awfully dumb of course\nSome go nut, the power of the last one\nSlower, flower, blower\nThose who ain't pros I wet my stupid radio\nCause he needs a G when you listen to the vocal\nI'm not a loco but I'm lookin just til punk go OHH\nNow you can't see I'm real great?\nCheck out the story to the glory of the real estate\n[Sen Dog]\nAll these motherfuckers that wanna run up on the Hill\nStep off! You know why?\nThis shit is all about BOO-YAA cause I said step off!\n[B-Real]\nThis is the crime you find you're not an exponent\nDoggone it, another gonna mierda on it\nNow you're wishin, fishin you could do this\nBut on the strength, yo, I think you knew this\nWas just like a dream, when you supreme, the king\nOf a minor ?\nAll for 47, swung ? eleven\nGot hit with a pitch like a bitch and went to heaven\nWeak ducks, duckin and buckin\nSayin FUKKIT, ain't worth damn pay the ducats\nFrom my public, my favorite subject, I loves it\nSo go 'head, talk your punk shit\nSuckers, you're nuttin, ? like a jock ?\nCrack smoker, can we adjust we choker\nOhh, now you can't see I'm real great?\nCheck out the story to the glory of the real estate\n[Sen Dog]\nHeh heh heh, another soft pussy motherfucker\nAnother fly verse\nStraight from the deficit\nAnother scripture of B-Real\nYeah.. get funky, Real\nThis is the Lower Eastside of things\nYouknowhatI'msayin? Cypress Hill\n[B-Real]\nYou ain't flamboyant, a toy boy on it\nAin't paid a plot, for un-em-b-boyment\nI won't cause yo I got a lot of what I gotcha\nPlus I taught ya, the beat on the top of\nEverything you know, still you can't do no\nDamage or duel though aiyyo, cause our crew now\nThe Real is the ?, sport and you can see this\nG-ness dialogue, of the real skiers\nI ain't nuttin like a joke, get stoned, get smoked\nAnd choke off, the hypes I cook off\nThe dialectic, funk-elistic\nChew slower or become another statistic\nOhh, now you can't see I'm real great?\nCheck out the story to the glory of the real estate\n[Sen Dog]\nYo I told you to keep down brother\nThe motherfuckers just don't learn nothin G\nWake up Hill\nThey gotta keep goin back to the old school\nSo they keep goin out\nCause they're just not Real\nHa yeah that's right fool\n[B-Real]\nYes the master pass, kick your ass\nAnd feel combustion, for the dope blast\nCause you're steppin on my property, get off it G\nGet caught up, then you get shot up\nSee, violators will be prosecuted\nBy the reputed, undisputed, Cypress zooted\nNot so, no there's no sellout\nYou ain't got enough ducats to shell out\nWell I'm in front, and yo I feel great\nCheck out the story to the glory of the real estate\n[Sen Dog]\nYeah, roaches come in but they don't come out G\nDon't come on the Hill\nThat's right\nGet off the Real Estate\nGet off the Real Estate\nGet off the Real Estate\nGet off the Real Estate", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}