{"songs": [{"title": "Touch The Sky (Live From VH1 Storytellers)", "album": "VH1 Storytellers", "year": null, "lyrics": "Let's have some fun now\nGet up and touch it\nGet up and touch the sky, come on [7x]\n\n[Bridge]\nI gotta testify\nCome up in the spot lookin' extra fly\nBefore the day I die, I'mma touch the sky\nTestify\nI'm up in the spot lookin' extra fly\n'Fore the day I die, I'mma touch the sky\n\n[Verse 1 - Kanye West]\nBack when they thought pink Polos would hurt the Roc\nBefore Cam got them hits to pop\nThe doors was closed, I felt like Bad Boy's street team\nI couldn't work the locks\nNow let's go, take 'em back to the plan\nMe and my momma hopped in that U-Haul van\nAny pessimists I ain't talk to them\nPlus I ain't have no phone in my apart-a-ment\nTake 'em back to the club\nLeast about an hour I stand on line\nI just wanted to dance, I went to Jacob an hour\nAfter I got my advance, I just wanted to shine\nJay favorite line: \"Dawg, in due time!\"\nNow he look at me, like, \"Damn, dawg! You where I am!\"\nA hip-hop legend, I think I died\nIn a accident, cause this must be heaven\n\n[Bridge]\n\n[Hook]\nNow let's take them hi-ah-igh-igh-igh-ighhhh(Top of the world baby)\n(Top top of the world)\nA-la-la-la-lah-la-lahhhhh(Top of the world baby)\n(On top of the world)\n\n[Verse 2 - Kanye West]\nBack when Gucci was the hits to rock\nBack when Slick Rick had the shit to pop\nI'd do anything to say I got it\nDamn, them new loafers hurt my pocket\nBefore anybody wanted K. West beats\nMe and my girl split the buffet at KFC\nDog, I was having nervous breakdowns\nLike \"Man - these niggas that much better than me?\"\nBaby, I'm going on an airplane\nAnd I don't know if I'll be back again\nSure enough, I sent the plane tickets\nBut when she came to kick it, things became different\nAny girl I cheated on, sheets I skeeted on\nCouldn't keep it at home, thought I needed a Nia Long\nI'm trying to right my wrongs\nBut it's funny them same wrongs helped me write this song\n\n[Bridge]\n\nNow say: I'm, I'm sky high\n\nFeels good to be home, feels good to be home\n\nAre y'all happy you came to VH1 Storytellers?\n\nGet up and touch the sky, come on\n\nI am so disappointed, that I cannot see me perform\nExcept for on playback\nMy greatest pain in live, is that I'll never see me perform\nSo you are welcome to know a pleasure, that I will never have\n\nCome on [20x]\n\nThis song is what inspired 808's and Heartbreak more than anything\nBecause we used do this at the end of the tour every night\nAnd I would do it for – how many of you saw the Glow In The Dark tour in the room tonight?\nThank you so much, for coming to the tour\n\nSo y’all remember at the end of the show I would do this song\nAnd I would say some inspirational words and I would sing\nAnd I had the opportunity to just kind of do it and play it off\nBut I discovered that I love to sing\nSo much and to my thing and harmonize and just go up and down and just fuck around\n\nI really feel like a vessel\nAnd I open my mouth and God will let beautiful words flow through\nThat’s why I realized that he chose me and he has a path for me\nBecause half the things that come out, I can’t be responsible for\nAnd I guess he just wants me to say more and more and more and never be insecure and always be sure, be sure\nAnd he will give me the strength I need to endure, for sure\nAs I tour and bring the pure\nSo much more, more, for sure\nFor your entertainment, education and relation\nTo take away your hesitation and segregation\n\nIn a country full of immigrants, where no one really was born here, but separated here\nIt’s a beautiful thing that in a country that was so divided by the concept of black and white\nWe now have a black and white president\n\nAnd this is what the future is to me\nThe juxtaposition: two things that you think don’t go together\n\nWhen a black, super-Hip-Hop-dressed dude gets on an elevator and there’s an old lady with Chanel and she grabs her purse\nI’ll give you a cliché example\nWhat would happen if they actually talk to each other?\nWhat would she learn? What would he learn?\n\nWhen the rich man hopping out the Lincoln Town Car, passes by the homeless person\nAnd they actually talk to each other\nWhat would he learn? What would he learn?\n\nIf a black man, that came from Chicago and was taught to stand so far away from gay people, ‘cause you do not want to be accused of being gay\nWas to talk to a gay person\nWhat would he learn? What did I learn?\n\nI learned that people in Chicago was wrong\nAnd I’ve been an asshole all along\nA lot of things that you learn are wrong\nSo don’t be an asshole too long, too long, too long\nYou can’t be an asshole too long\nYou can’t be an asshole too long\n\n‘Cause the more you know, the more you grow, the more responsibility you have show what you know\nAnd give everything that you got to give, baby that’s the reason God let me live through the accident without practicing\nOkay, got to bring this up and bring it back again\nOkay, okay, okay, okay\nAlright [7x]\nNo publishing Outkast, please\nAlright [5x]\nShout out to three G’s\nOne of the few dressed quite as fresh as me", "image": "https://images.genius.com/3c0aee76b72a24d6c01e44a72adb029c.1000x871x1.jpg"}], "artist": "Kanye West"}