{"songs": [{"title": "Heavy in the Game", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Intro: Lady Levi]\nOh, you Thug Life is yours?\nLife ain't no something you can rap with\nOoh come no ordinary game\nThe game no something you can rap with\nMe's a player you know?\nI do not, play in no game\nMe just, make money, dollars..\nEvery time, seen?\n\n[Verse 1: 2Pac]\nNow how can I explain how this game laced me, plus with this fame\nI got enemies do anything to break me, my attitude changed\nGot to the point where I was driven, twenty-four seven\nMoney's my mission, just a nigga tryna make a livin'\nThese busta tricks don't want no mail\nThey spendin' they riches on scandalous bitches, who'll stay petrified in jail\nIt's hell, plus all the dealers want a meal ticket\nJealous-ass bitches, player-hatin' but we still kick it\nAlways keep my eyes on the prize, watch the police\nSeen so much murder, neighborhoods gettin' no sleep\nBut still, I get my money on major, continuously\nCommunicatin' through my pager, niggas know me\nDon't have no homies since they jealous, I hustle solo\nCause when I'm broke I got no time for the fellas listen\nAin't nothin' poppin' 'bout no broke nigga, I ain't no joke\nFuck what they say and get your dough nigga\nHeavy in the game\n\n[Ad-libs: Lady Levi & (Eboni Foster)]\n(Game's been good to me)\nWho the bumba clat him a come try take mine?\nOh, me see you rushin' up (Game's been good to me)\nI throw I'm blood claat P.M. to A.M\nAll, all the bumba come ya take dis ting\nFor ya take dis ting for joke?\nOh, that's right (I don't care what it did to them\nThe game's been good to me)\n\n[Verse 2: Richie Rich]\n(Well let me shoot some of this how heavy type of shit)\nCertain niggas wanna stick to the game, you's a trick to the game\nWaitin' upon your turn, son when will you learn?\nAin't no turns given, niggas be twistin' and takin' shit\nPuttin' they sack down, then puttin' they mack down\nMe myself I hustle with finesse yes I'm an Oakland baller\nRule number one: check game, and fo' sho' you gon' respect game\nBe your own nigga meanin' buy your own dope\nCause that front shit is punk shit, something I never funked with\nBe true to this game and this game will be true to you\nThat's real shit; disrespect, see what this here do to you\nThat jackin' and robbin', despisin' your homie\nAin't healthy, niggas be endin' up dead 'fore they get wealthy\nBut not me though, I'm sewin' somethin' major\nSo what I reap is boss -- that's why my public status is floss\nWent from a, young nigga livin' residential\nTo a, young nigga workin' presidential\n\n[Ad-libs: Lady Levi & (Eboni Foster)]\n(Game's been good to me)\nMe nigga Tu-pac always look good\nYou know that's true I'm look good every time\nOoh, pussy war?, step up (Game's been good to me)\nCan yi know I'm serving up blood claat\nPlaying yi fucking games\nOoh, we take game, we won!\n(I don't care what it did to them)\nAny by now\n(The game's been good to me)\nAll, yi haffa forget fi we won!\nEvery time\n\n[Verse 3: 2Pac]\nI'm just a young black male, cursed since my birth\nHad to turn to crack sales, if worse come to worse\nHeaded for them packed jails, or maybe it's a hearse\nMy only way to stack mail is out here doin' dirt\nMy decisions do or die, been hustlin' since junior high\nNo time for askin' why, gettin' high, gettin' mine\nPut away my nine, 'cause these times call for four-five shells\n'Cause life is hell, and everybody dies\nWhat about these niggas I despise\nThem loud talkin', cowards shootin' guns into crowds, jeopardizin' lives\nShoot 'em right between them niggas' eyes, it's time to realize\nFollow the rules or follow them fools that die\nEverybody's tryin' to make the news\nNiggas confused, quit tryin' to be an O.G. and pay your dues\nIf you choose to apply yourself\nGo with the grain then, come into riches and the bitches and the fame\nHeavy in the game\n\n[Outro/ad-libs: Lady Levi & (Eboni Foster)]\n(Game's been good to me)\nBoy, ya nah bitch!\nMajor that's true we look good every time\nWhen we at Beers Diamond\nAnd 2Pac drives vintage car (Game's been good to me)\nAnd fi them frame them look good, oh no?\nThis whole world ya call on\nGonna mass on a face\nFor any, section of bumba ras claat, oh!\n(I don't care what it did to them)\n(The game's been good to me)\nFlush it!.. Oh!\nNobody wan come test me ya know\nTrue them we a drive pretty car\nWanna no part of any ting\nAnd now you wan come drown a gun\nBut ya see we know, you haffa show I'm maximum respect\nFor when a blood clat run or when a pussy walk up\nWe look good every time\n'Nough dollars, dollars!\nYa know about dollars , them right?\nBut we nah talk no shit\nWe haffa walk de walk for we a talk, see it?\n'Cause action, action speak louder dan words\nYou n who the record partner\nDon't blood claat ting at, ALL", "image": "https://images.genius.com/aa900ef68a5861f06835ba38e4e6d764.640x640x1.jpg"}], "artist": "2Pac"}