{"songs": [{"title": "All the Shine (Little Dragon remix)", "album": null, "year": null, "lyrics": "[Verse 1]\nWhat the fuck do y'all niggas really want?\nI went with realness instead\nBut all the real niggas I know either crazy or dead\nYeah, I dropped the free EP for these other kids to feel a lot\nAnd niggas keep asking on whether this dude's for real or not\nI'm not trying to come hard, I'm trying to come me\nThat's why these older songs that I used to make I'd release free\nWhat's the point of rap if you can't be yourself, huh?\nThat's why I come first like my cell phone\nI'm a role model, I am not these other guys\nI rap about my dick and talk about what girls is fly\nI know it's dumb, that's the fucking reason I'm doing it\nSo why does everyone have a problem with talking stupid shit?\nOr is it real shit?\n'Cause sometimes that stupid shit is real shit\nLike when you make out with your best friend's baby sis\nYou know the one with short hair you used to babysit?\n(See, that's not even right)\nYou with a different girl like each and every fucking night\nAnd kiss her while she's sleeping and sneak out the front to catch a flight\nThat's not life, dude\nIt's just making up for fucks I missed in high school\nI keep it wrapped until I meet the right one\n'Cause I ain't Mumford, I ain't tryin' to have sons\nAll I wanted was some more like Ashton\nI ain't the coolest but I know I got passion\nI got passion!\n\n[Hook]\nI really wanna do right and it doesn't matter\nWe've got all the shine we need to find\nI really wanna do right and it doesn't matter\nWe've got all the shine we need to find\n\"Baby, I'm okay.\" She said, \"Why you gotta act so strange?\"\nI said, \"Baby, I'm okay.\" She said, \"Why you gotta act so strange?\"\nI said, \"Baby, I'm okay.\" She said, \"Why you gotta act so strange?\"\nI said, \"Baby, I'm okay.\" She said, \"Why you gotta act so strange?\"\n\n[Verse: 2]\nAm I serious? I don't even know\nAre you hearing this? This shit is laughable\nI ain't trying, I'm doing, these other rappers are foolish\nI got fame, my A&R's a computer\nIs there room in the game for a lame who rhymes?\nWho wears short-shorts and makes jokes sometimes?\nMy nigga like, \"I'd get you MTV if I could, man\nBut Pitchfork only likes rappers who crazy or hood, man\"\nSo, I guess we gon' see\nI ain't Curren$y, but if there ain't money in my name please murder me\nSometimes I feel like I ain't supposed to be here\nSometimes I wake up, I don't want to be here\nMy mom loves to text me Psalm verses\nShe don't look at me like I'm the same person\nI used to be the sweet one, but things change\nAnd I don't want them missing a son like Bone's last name\nAnd all my uncles alcoholics, shame on me\nI drink whiskey till I'm grounded, no TV\nI wanna go inside the club with no gold piece\nAnd walk in with No I.D. and no I.D\nNo matter how far the hood seems\nWe all still got hood dreams\nI always wanted to get picked on the cool team\nBut alone is exactly how I should be\n\n[Hook]\nI really wanna do right and it doesn't matter\nWe've got all the shine we need to find\nI really wanna do right and it doesn't matter\nWe've got all the shine we need to find\nI really wanna do right and it doesn't matter\nWe've got all the shine we need to find\nI really wanna do right and it doesn't matter\nWe've got all the shine we need to find\nWe need to find\nWe need to find\n\"Baby, I'm okay.\" She said, \"Why you gotta act so strange?\"\nI said, \"Baby, I'm okay.\" She said, \"Why you gotta act so strange?\"", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}