{"songs": [{"title": "Kendrick Lamar’s Interlude", "album": "These Days…", "year": "2014-06-24", "lyrics": "[Produced by Terrace Martin]\n\n[Verse 1: Kendrick Lamar]\n24/7, 365, motherfucker I'm still right on time\nOh you thought you had me all figured out?\nTake it from the horses mouth, you'll never understand me\nI told you my Plan B is to win your hearts before we win a Grammy\nThese Days ain't shit changed, different toilet, same shit\nAnd I drank a whole gallon of laxatives by accident\nJust to shit on you has-beens\nHad it been for my past tense, I wouldn't be rapping\nSee these streets made me, broke me down\nBuilt me up, drove me crazy\nMade me hungry, made you hate me, but fuck love\nIt don't make dollars, it don't make sense nigga\nBy the way, that's DJ Quik nigga, respect or check it\nThese days, I'm a little more focused\nCause y'all cracked the door and I kicked it open\nYellin' get the fuck down or I will shoot\nI told you not to motherfuckin' move!\nBe another example\nI'll take the whole industry hostage if I have to\nI'll sabotage this game, a good kid?\nYeah that's only in my mama's eyes\nI seen a dead body at five and that shit made me traumatized\nSo These Days, a little blood on my hands ain't nothing compared\nTo hopping out a minivan, with a mini 22 3's and the homie TuTu\nAnd two more YGs, oh nobody got time for that!\nThese Days it's only time for rap!\nSo Herbert Anthony Stevens\nYou make or break bread before we break even\nBefore they broke our records we broke records\nAnd wrote pieces, of history\nSo These Days? These accolades that's meant for we?\nIt's only truth that this shit was meant to be, T.D.E\n\n[Hook: Ab-Soul & JaVonte]\nLife's still a Traffic Jam (Life is still a Traffic Jam)\nLife's still a Traffic Jam (Life is still a Traffic Jam)\nLife's still a Traffic Jam (Life is still a Traffic Jam)\nLife's still a Traffic Jam (Ready to go)\nLife's still a Traffic Jam (Still ready to go)\nLife's still a Traffic Jam (Still ready to go)\nLife's still a Traffic Jam\nLife's still a Traffic Jam...\n\n[Verse 2: Ab-Soul]\nShit... what more did you expect? HiiiPower\nFor the most part, we go hard for the respect\nI'm obviously ominous to my competition\nAnd if I ain't better than Kendrick than nobody is then!\nWe shared our life with you\nShared our light with you even in the darkest of hours\nIn hopes that one day, just maybe, one day the world'll be ours\nHa, and now they look up to us like towers\nFor rhyming like we had super powers\nThey should've never let us in these offices...\nKnowing good and God-damn well\nHow well we've been ducking officers\nLaughing at the scraps they offered us in the past\nAnd now we toast champagne to the thirst we never had!\nI had my ups and downs, but I always left right\nRest In Peace Alori Joh... TopDawg for life!\nAnd oh yeah... SOUL!\n\n[Interlude]\nI watch that fire that we're gathered around and see that it burns similar to the fire that is inside you...", "image": "https://images.genius.com/077bbd628ad3b7383f095afde8670b76.560x560x1.jpg"}], "artist": "Ab-Soul"}