{"songs": [{"title": "Sadity", "album": "Blow the Whistle", "year": "2006-08-29", "lyrics": "[Intro: Daz] + ($hort)\nUhh, yeah\nThis for all them girls that be actin like they so fine\nWhassup $hort?\n(Man grab Lil Jon and Kurupt) Kurupt\n(Let's fuck these hoes up) Daz\n(Yeah) Lil Jon\n(Whassup with that bitch?)\n\n[Daz]\nShe want it, Gucci'd up, jewelry'd down\nGive a fuck if you fine bitch, we got to clowwwn\nBreak it down for all you bad hoes\nE'rybody's somebody, yeah they gots to know\nLivin off a scholarship, parents and lawsuits\nWanted that pussy girl, soon as I saw you\nBaby girl you the freak of the week\nSo sadity, you ain't pretty girl, suck on theeeese\nSorry, don't want me to talk like dat\nI gotta see you girl when you walk like dat\nAsk your name and number and I start to wonder\nIs there any mo' stuck up hoes out yonder\nSexy brown chocolate vanilla white child\nI like yo' ass and I like yo' smile\nBut all that smirkin gon' get you cussed out\nFuck you bitch, put this dick in your mouth\n\n[Hook: Daz]\nSee I don't, know why, you act so sadity\nYou're superbad bitch but your ass ain't pretty\nShow me your ass girl, then show me yo' titties\nToo $hort, Lil Jon and Pound get wit it\n\n[Interlude]\n(Why you act sadity.. why you act sadity..)\n(Why you act sadity.. why you act sadity..)\n\n[Too $hort - over Interlude]\nFuck that bitch!\nWith her sadity ass\n\n[Kurupt]\nDamn, look at her, what's your name?\nHow come I ain't never met you in the game?\nYou somebody I could have on my side\nWe could partner in crime, it's just you and I\nThe problem is that you're just a bitch\nI couldn't trust you as far as you can sit and piss\nLook bitch, I know you got bank\nYou're actin rude, and your attitude is stank bitch\nBut that shit won't work with me\nUncle Too $hort, or D-A-Z\nSee I'm bangin to Lil Jon\nWhen this dumb pretty bitch turned my radio off\nHad a nigga, so pissed off\nSo I laid right back and let her eat my dick off\nYeah bitch, I'm talkin to you\nStop actin high sadity bitch, chill be cool\n\n[Hook]\n\n[Too $hort]\nYou got money in your purse girl\nShake that ass, make it work girl\nTryin to shake it 'til it hurt girl\nI'm fin' ta check yo' ass\nLil' bad-ass bitch came through with her clique\nThey all look good, I'm like who would I pick\nWhen they walk past me, I do 'em like this\nGrab that ass, let her feel on my dick\nActin fake sadity and stuck up\nSittin next to her, she holla get the fuck up\nYou ain't never too cute to get slapped\nShit gon' change when you get with a mack\nYou can't hold back when you fuck with me\nDon't let me find out that you're just a tease\nDon't let me find out you won't suck my balls\nBitches like that I don't fuck with y'all\nI fuck with bad bitches, my girls do it all\nI ain't gotta finance trips to the mall\nTell that fine-ass bitch I'm Todd Shaw\nAs I stick my dick in her jaw\n\n[Hook] + [Interlude]", "image": "https://images.genius.com/a946f356e20bac26df64ff8cca250ed8.500x500x1.jpg"}], "artist": "Too $hort"}