{"songs": [{"title": "Thoughts From A Balcony", "album": "Macadelic", "year": "2012-03-23", "lyrics": "[Verse 1]\nLet me get a one-way ticket, haven't picked a destination\nI'm just tryna catch the train before it has to leave the station\nPacking no bags, nothing but the clothes on my back\nWith a Cognac, let me sip it, tryna relax\nRed wine up in my glass plus Filet Mignon\nI got a army right up under me, I'm Genghis Khan\nYeah, it's me against the world, I guess I'll take them on\nI might stop and see my girl, but I ain't staying long\nWhat if I'm gone, what the fuck you gon' think then?\nI told my story, put my life inside this ink pen\nSaid I'll make it big when, everybody know me\nWell, I made it big and, everybody phony\nHa, so could you pour me, I need a cup\nNo, none of that liquor, mix some purple stuff\nI could talk my pain, but would it hurt too much\nGo head, judge me, hate cost money, but this love free\n\n[Chorus]\nThey just dreams, turn 'em to reality\nDouble-cup of lean, standing on my balcony\nLooking at the sky, thinking it could all be mine\nAll we got is memories, so what the fuck is time?\nThey just dreams, turn 'em to reality\nDouble-cup of lean, standing on my balcony\nLooking at the street, thinking it could all be mine\nAll we got is memories, so what the fuck is time?\nWhat the fuck is time? I ask 'em, what the fuck is time?\nI don't know, what the fuck is time? I ask 'em, what the fuck is time?\n\n[Verse 2]\nWhat do you do when you think you could be an icon?\nCause all these people get to screaming with the lights on\nLike they just seen a ghost, earn my stripes, zebra coat\nRacing to the gate but my flight gone\nAnd now these writers taking shots without a Nikon\nBut I don't fight though, figure it's a typo\nSeems we in some shit now, gonna be alright though\nPotion in my sprite, then my night slows... down, down\nSee, that's exactly what I need\nMy khaki's filled with cheese, my homie Sap is on the beat\nLike it was \"Donald Trump,\" a fucking hit but I just call it luck\nThey throw it on when I'm walking in the club\nHey, this the Burgh shit, I don't deserve this\nWell, I don't think you looking far beyond the surface\nLearn quick, now I'm big time\nFill your cup up, and I'mma sip mine\n\n[Chorus]\nFill it up with dreams, turn 'em to reality\nDouble-cup of lean, standing on my balcony\nLooking at the sky, thinking it could all be mine\nAll we got is memories, so what the fuck is time?\nThey just dreams, turn 'em to reality\nDouble-cup of lean, standing on my balcony\nLooking at the street, thinking it could all be mine\nAll we got is memories, so what the fuck is time?\nWhat the fuck is time? I ask 'em, what the fuck is time?\nI don't know, what the fuck is time? I ask 'em, what the fuck is time?", "image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg"}], "artist": "Mac Miller"}