{"songs": [{"title": "Who Am I?", "album": null, "year": null, "lyrics": "[Timbaland talking:]\nDa Da Da Da Da Da\nYes yes yes yes yes yes\nIt's me again baby, Timbaland\nAnd uh, we doin somethin like dis\nHear da beat?\nUh\n[Clapping]\nSay what?\nThat's right\nThank you, thank you, thank you\n[Laughing]\nUh right now, Ima bring a special guest in\nHe gon' rip it for me, like this, check it out\n[Twista]\nWho am I, N**** wid tha blunt, steady trippin, sippin on the concoction\nWith tha gun c***tin\nDrum knockin, gotta get off\nB****es and killas in the front watchin\nFlowin with like a finna studda some\nBetta come off a butta ton, brotha run, I hope he said he were\nI'm a flow until my belly hurt\nPimp n**** rockin on tha stage an rock on in the petty shirt\nLet it rough, ooh\nFeels like anotha one\nWho you be? Mr. Shystie\nThe one who make you frown up like the lemon in my ice tea\nThe muthaf***a most likely\nTo get a tuba with the opposition in my position\nI break em off when I give em tha heat\nSteady re' for rollin\nBullets body decomposion\nI dismember the weak on the Timbaland beat\nYou remember the beat\nConversation we had\nWhen my adrinallin was rushin\nCheck yo brakes and knee pads\nWhen the twis to get tha bus in\nBodys gon' get rushed in\nI can make em hit tha dance flo\nBrothas, b****es, and hustlers\nI get up in the guts homie, never phoney\nHitta wigga when he run up on me\nY'all muthaf***as still don't know me\nLet em' learn slowly\n\n[Chorus: x2]\nWho you be?\nI'm the one that stay high\nCenter make up the party, rockin' bodie\nWith tha thugga hands up in the sky\nNever shy he's fly\nWho am I, who you be?\nI'm the one's gon' get buck\nT-straight from the Chi\nRibal, homosydal, everybody duck\nWith tha party up and pimp struck\nT-N-T now I say who am I\nWho you be? Who am I?\nThe one who's surrounded by the wood\n500 with the ribs stickin' through the hood\nUp to no good that's why'd stay they misunderstood\nAnd I'm always in the mix of some s***s\nScoop a shawty an she thick\nAnd tha b**** gets grip in them hips\nPut a dick on the lips top it doggie style, she my homie gal\nSo I tricked on that b****\nNow who you be?\nThe one who's on the dance floor\nSex goin' be one of the ma** hoes\nFreak on a bad hoe\nYou's could really want to flash gold\nTurn a hater to a sa** hoe\nPlay an ballin' up at Cape Town, strippin went down\nStudy, tippin' off of CD's an Tapes\nThough see n****s see Gs to take\nRun up to the car, got no things\nThey got CD's to break, no easy pace\nWho you be?\nThe crime cause other obituary an uligy\nPhoto stank and y'all be who to see\nOnly smokin' it with you and me\nLets go hang out where the booty be\nI was on sumthin, no frontin'\nYello wide ol' belly in the po funkin'\nGrinnin while up in the curb\nWant to journey for herb\nAlways tellin' somebody to smoke somethin'\nTrue indeed\n\n[Chorus: x2]\nThe one that's flowin' fluently\nMake yo baby say goo to me\nWhat you did to her\nDidn't ask why I hit her for\n'Cause the game like literature\nGet it Get it girl\nI don't know what you was waitin' on\nBut if you ain't with a partner\nThis young monsters a fly guy\nShake a lil' bit of that body\nWe goin' party till we sky high\nTo my players an soldiers, shady n****s, young thugs and strap hoes\nPimps strikin' fees and red bones\nGhetto fees and Gs an MC's for the rifols\nThe one that be kickin' off air time\nFrom sunrise ta bedtime\nAll of y'all need ta know me, the one an only\nPimp slap tingin' twista from the Chi\nMakin' competition die slowly\nWho am I?\n\n[Chorus: x2]\n[Timbaland]\nHa ha ha ha\nY'all didn't think that I would do it again twice did ya\nHa ha\nI do it like that, I put it down\nFor the 98 or TNT\nThing ya know what I'm sayin'\nTimbaland and Twista\nY'all fools couldn't recognize could ya?\nI put it down for all parts of the area\nWe out", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}