{"songs": [{"title": "Right Back at You", "album": "The Infamous", "year": "1995-04-25", "lyrics": "[Produced by Havoc]\n\n[Intro: Havoc]\nNow, '94 to '95, and it's all about crime\nDrop that shit\n\n[Verse 1: Prodigy]\nYeah, yeah, check it out\nNow run for your life, or you wanna get your heat, whatever\nWe can die together\nAs long as I send your maggot ass to the essence\nI don't give a fuck about my presence\nI'm lost in the blocks of hate and can't wait\nFor the next crab nigga to step and meet fate\nI'm lethal when I see you, there is no sequel\n24/7, Mac-11 is my people\nSo why you wanna end your little life like this?\nCause now you bump heads with kids that's lifeless\nI live by the day only if I survive\nThe last night, damn right, I ain't tryin' to fight\nWe can settle this like some grown men on the concrete floor\nMy slugs will put a stop to your hardcore\nWays of action, I grab the gat, then\nAin't no turning back when I start blastin'\nPick up the handle and insert the potion\nCock the shit back in a calm like motion\nNo signs of anger or fear cause you the one in danger\nNever share your plans with a stranger, word is bond\n\n[Hook]\nI put the drop on you kid, now I got you\nYou got the heart to get busy without your crew?\nLet's get it on nigga, do what we gotta do\nYou buckin' me, I'm buckin' right back at you\nI put the drop on you kid, now I got you\nYou got the heart to get busy without your crew?\nLet's get it on nigga, do what we gotta do\nYou buckin' me, I'm buckin' right back at you\n\n[Verse 2: Havoc]\nFuck where you at kid, it's where you're from\nCause where I'm from, niggas pack nothin' but the big guns\nAround my way, niggas don't got remorse for out-of-towners\nCome through fronting and get stuffed with the 3-pounder\nThe loud sounder, ear ringer\nAnd I'm a point the finger, at all you wannabe gunslingers\nYou got a real ice grill but are you really real\nStep to the hill and I'ma test your gun skills\nCause real niggas don't try to profile\nYou just a chump who needs to get drunk to buckwild\nBut swing that bullshit this way\nAnd I'm a make your visit to the bridge a motherfucking short stay\nQueensbridge, that's where I'm from\nThe place where stars are born and phony rappers get done\n6 blocks and you might not make it through\nWhat you gonna do when my whole crew is blazing at you\nWith macs and tecs to lend to get your dome crush\nYou thought that you could come around my way and beef, stupid fuck\nWhat the hell you smoking? What the fuck possessed you\nTo come out your face, now I have to wet you\nThrow on my Timbs, black mask and black serpent\nTwist a nigga cap, then jump in the J-30\n\n[Hook]\nI put the drop on you kid, now I got you\nYou got the heart to get busy without your crew?\nLet's get it on nigga, do what we gotta do\nYou buckin' me, I'm buckin' right back at you\nI put the drop on you kid, now I got you\nYou got the heart to get busy without your crew?\nLet's get it on nigga, do what we gotta do\nYou buckin' me, I'm buckin' right back at you\n\n[Verse 3: Ghostface Killah, Raekwon, & Both]\nWho's the richest nigga in the project, who got it locked\nRocking Convertibles, drop tops and mad hot\nPeace to that whiz kid and playas on his team\nWho's organized, all eyeballs is on CREAM\nAnd your whole clique got nothin' but raw shit\nWhip after whip, stay flashing your dick on tricks\nYour whole crew's ravishing, team's untouchable\nIn the jungle, banging Nas, Mobb Deep and Wu\nThere's money out there, guns catch crumbs, those are your sons\nJums is in the mailboxes, bitches holding your guns\nYou know what's out there, thousands of gram, wrapped in Saran\nSealed tight, keep the freshness, that's how we expand\nMasked Avenger, drop your gun, son, now surrender\nGet ninjaed on the Island, plus the Bridge, boy remember\n\n[Verse 4 : Big Noyd]\nMy little thug's selling drugs and he's struggling\nThe game got him bugging, I tried to tell him slow down cousin\nBut he vexed and niggas getting wet up in the projects\nBut with no doubt, shorties out for his respect\nBut is his brain insane from the lye?\nFrom smoking that 118 tiny tye\nWhy, a nigga just died last week\nAs he swore he was grown and he's a thug in the street\nBut it's like that, my crew pump cracks and we pack mac\nHis eyes is wild with the rezzy monkey on his back\nBut I'm stressed and he need to be blessed\nWith a firepack, don't even go there cause it ain't like that\nSlow down baby, he said, what, you trying to play me?\nYou must be crazy, pulled out the heat and almost blazed me\nThen he was Swayze, the shot must of dazed me\nThug selling drugs, busting slugs, but he ain't crazy", "image": "https://images.genius.com/b07e53ad94c52f45245db1c1d49e6b00.1000x1000x1.png"}], "artist": "Mobb Deep"}