{"songs": [{"title": "Word of Mouf (Freestyle)", "album": "Word of Mouf", "year": null, "lyrics": "[Intro: Ludacris]\nYea-uh, here we go here we go here we go\nTalk about that Word of Mouf baby\nYeuh, yeuh yeuh yeuh yeuh! Here we go, here we go\nLudacris, 4-Ize, D.E. what you want now now now now\n\n[Verse 1: Ludacris]\nCheck it! You see I live a life filled with chicken and malt liquor\nAnd women that are real life scratch'n'sniff stickers\nI shoot videos and get knobs slobbed in trailers\nThen hit stage and break a leg like Lawrence Taylor\nYou pricks is all talk, and it's bad for your health\nSee I ain't gotta say shit, money speaks for itself\nWith all models I make I'm great like five lakes\nYou got rims on ya truck? Man I got rims in my skates\nYou rolling on dubs, I roll right into clubs\nDirty as home with more rings than ya tub\nYou think it's all practical jokes and big bloopers\nBut I smack bitches with no titties that work at Hooters\nJust get a couple of girls that shaking they thangs\nThen I put 'em on camera and cut two frames\nWith some gasoline drawers I'll be going to Hell\nLudacris, fuck like a nigga fresh out of jail\nI got Junkyard Dogs, I'm rowdier than Rod Piper\nAnd my baby's assed out, cause I rub my cars with her diapers\nSo you can pray for now if you sinned in the past\n\"Word of Mouf,\" time to wipe that silly grin off yo' ass\n\n[Verse 2: 4-Ize]\nThese rap cats is soft like R&B singers\nIt's 4-Ize, I've worked for wings and chicken fingers\nI reps mo' parts so Chi-Town could get seen\nI'm a Dirty Bird now but I keep shit clean\nI rip meanface niggas one by one\nOr two by two, I'll take 'em however they come\nInstead of a gun, I'll pull out a stick from woodworking\nThe black Hacksaw Jim Duggin stay lurking\nCreepin, I'm in the shadows, the nightshade\nYou want the tail in the back or, a light fade?\nCause Tony Scissorhands is the barber, the butcher\nI kill ya smoke a blunt and forget where I put ya\nI'm Soopafly like Snuka, I smack hoes\nThe black rolls with the dozen attack flows\nI rock Shaq's clothes when I Alter Beast\nPower up, get big, it's Disturbin' Tha Peace", "image": "https://images.genius.com/6be5b941352dc17a593995dffd367cec.1000x1000x1.jpg"}], "artist": "Ludacris"}