{"songs": [{"title": "Time Travelin’ (A Tribute to Fela)", "album": "Like Water for Chocolate", "year": "2000-03-28", "lyrics": "[Produced by D'Angelo, James Poyser, J Dilla & ?uestlove]\n\n[Intro: Vinia Mojica]\n*Singing in Spanish*\n\n[Intro]\nWhat what, we do this time\nRock rock....\nYes, let this music travel through you\nTalk about feelings, yeah yo\n\n[Chorus]\nYo wassup world?\nYo what's happening?\nIt's the C-double-O and I'm back again\nTake this back and then, tell a friend\nSpaces and places you been, time travelin *echoes*\nTime travelin *echoes*\n\n[Verse 1]\nYo, I was a piano player in my last lifetime\nNow I write rhymes, sip white wine and let my light shine\nOut the dark space, with the world on my mind like Scarface\nThough my sex drive like a car chase\nMore than a uhh, it's the piece of mind I chase\nStakes are high, like my uncle is\nWe both got problems, he never confronted his\nUnder the bridge I wrote, some shit to stay afloat\nAnd paint a picture, raw like the first coat\nSend my old man a note to keep his phone on\nMy little cuz'll know cheap tricks are homegrown\nTravel to a place sweeter than home, listenin to Nina Simone\nRepeat this psalm, to the sky I'm keepin my palms\nFacin the east, actions macin the beast\nEmbracin the streets, my guy caught a case cuz he beat\nHis lady down, it's two-thou\nThat ain't the way we lay it down\nSouls get, found and lost at the roads they cross\nMany paid dues, but few knew the costs\nI ran through the Moss like Randy\nTouching down with God, close friends, and family\nRecognize the voice in the wilderness\nCom Sense, '92 and I'm still in this\n\n[Verse 2]\nTime travelin, took my time in hand\nMy rhyme learn and plan\nJealousy, money and pride can burn a man\nSome walk but never learn to stand\nStill, afraid to expand what they feel\nI'm dealin wit, wakes, marriages\nATM's, Ericsson's\nLoud niggas that whisper carelessness\nIf we livin in Revelation\nWhy should the people of the sun have to run?\nCome to Esau in a year, he'll have freedom\nHe ask why I hadn't been to see him\nReally, I ain't have a good reason\nHe said, \"Rah, give back what you receivin\"\nIn a race against time, I was caught\nIn the same game as you, but long live the sport\nIt's time travelin\nIt's the C-double-O and I'm back again\nTake this back and then, tell a friend\nSpaces and places you been\nTime travelin *fades out* time travelin....\n\n[Chorus]\nYo wassup world?\nYo what's happening?\nIt's the C-double-O and I'm back again\nTake this back and then, tell a friend\nSpaces and places you been, time travelin *echoes*\nTime travelin *echoes*", "image": "https://images.genius.com/8dbc84c60c9d76fe49cdbcee56ef974c.1000x1000x1.jpg"}], "artist": "Common"}