{"songs": [{"title": "OMG", "album": "Young Thugga Mane La Flare", "year": "2014-04-20", "lyrics": "[Hook: Young Thug]\nI don't mean to bother\nBut can you please call my lawyer?\nI'm like oh my God, yeah\nI'm like oh my God, yeah\nAnd I seen her from afar\nShe ain't never got to wor'\nI'm like oh my God, yeah\nI'm like oh my God, yeah\n\n[Verse 1: Young Thug]\nOh my God, you got me hard, I'ma listen to you, iPod\nBe with me, turn you to God, STD, I run my ward\nIt smell good, I'ma put it on my lip\nTreat me like your baby, let me put it on your hip\nI won't tell nobody, had to tell you off the rip\nCut my mouth off, put it in a Ziploc bag and zip\nI wanna see your face, baby please take your shades off\nI don't wanna go back and forth like a seesaw\nI just wanna fuck and make your bell ring, ding dong\nForeign, foreign, foreign, Japanese, French, Hong Kong\n\n[Hook: Young Thug]\nI don't mean to bother\nBut can you please call my lawyer?\nI'm like oh my God, yeah\nI'm like oh my God, yeah\nAnd I seen her from afar\nShe ain't never got to wor'\nI'm like oh my God, yeah\nI'm like oh my God, yeah\n\n[Verse 2: Young Thug]\nCollect phone call, all these bitches wanna fuck\nBaby, I'll buy you a whole lot of fish like Truck\nGot a whole lot of foreign bitches, they look just like ducks\nI'm a real old school nigga, I just wanna roll\nPresidential bitches, knock 'em down like I'm bowling\nMy lil woadie got the best out, he deserve a trophy\nI'ma show her, ain't no concert, you know I'ma show up\nCheck the pulse, check the motion, Rolie Polie, Olie Olie\nC4 on the beat, C4 got a freak\nThugger got a Jeep, no doors on that bitch\nStuff those hoes inside of it, put them hoes on me\nYou ain't got a beat, MTV jam of the week\n\n[Hook: Young Thug]\nI don't mean to bother\nBut can you please call my lawyer?\nI'm like oh my God, yeah\nI'm like oh my God, yeah\nAnd I seen her from afar\nShe ain't never got to wor'\nI'm like oh my God, yeah\nI'm like oh my God, yeah\n\n[Verse 3: IamSu!]\nAye, $uzy in the place\nLow profile, she ain't knowin' where I stay\nLong afro, hair fallin' in the face\nIt's only one me but baby you could get replaced, great\nAnd it's Rich City by the way\nEverybody make it, homie, that's how we was raised\nHoes in the Bay, hoes in LA\nEvery bad bitch reppin' HBK\nAye, aye, P-Lo on the beat, C4 on the beat\nShe don't let me cut, I bet her number get delete-ed\nWavy like I'm sea sick, hella hoes like Freaknik\nGo ahead and tell Young Thugger run it when the beat end\n\n[Hook: Young Thug]\nI don't mean to bother\nBut can you please call my lawyer?\nI'm like oh my God, yeah\nI'm like oh my God, yeah\nAnd I seen her from afar\nShe ain't never got to wor'\nI'm like oh my God, yeah\nI'm like oh my God, yeah", "image": "https://images.genius.com/742637f99fa18db91cec96a6d2a683f4.500x500x1.jpg"}], "artist": "Young Thug"}