{"songs": [{"title": "Housewife", "album": "2001", "year": "1999-11-16", "lyrics": "[Hook: Kurupt]\nNow this, this is one of them occasions\nWhere the homies not doin' it right\nI mean he found him a ho that he like\nBut you can't make a ho a housewife\nAnd when it all boils down you gonna find in the end\nA bitch is a bitch, but a Dogg is a man's best friend\nSo what you found you a ho that you like\nBut you can't make a ho a housewife (Wife)\n\n[Verse 1: Dr. Dre]\nI mostly sold dick while I packed a gold clip\nWorked my money-maker, she got paper, she bout to trip\n(Where the fuck is my money?) I cannot G guilty\nYou pimpin' strong, but comin' home, to sheets that be filthy\nShe on the dillzy, I take advantage\nAll up in them panties, I got this bitch speakin' Spanish\nI'm mannish, get yo' nails out my back\nSlut I'm 'bout to nut and get up, go scrub yo' cat (Get the fuck out of here)\nLearn the player rules, this is how a player do\nMight not be a freak, but she got on the choosin' shoes\nDollar signs are folded, I can't control it\nTryin' to leave her, beeper just exploded\nShe sweatin' me, won't let me, broad turned fraud\nNow she on this dick huh, got her turnin' tricks huh\nMan it's a trip I don't trip I'm in yo' Lexus flexin\nI left her up in Dallas, Texas, ass down\n\n[Chorus]\nNow this, this is one of them occasions\nWhere the homies not doin' it right\nI mean he found him a ho that he like\nBut you can't make a ho a housewife\nAnd when it all boils down you gonna find in the end\nA bitch is a bitch, but a Dogg is a man's best friend\nSo what you found you a ho that you like\nBut you can't make a ho a housewife (Wife)\n\n[Verse 2: Hittman]\nNaw \"ho\" ain't short for honey, almost had to wail her like Bunny\nTellin' tales of bein' pregnant, catchin' Nordstrom sales with abortion money\nI spotted her, seen her with my nigga when I shot at her\nNow we got beef, he caught up in the ho's erotica\nExotic, she's psychotic, rockin' his Nautica\nSoon he'll need antibiotics (Sucka bitch)\nName a sexual disease, she got it like Sam Goody\nYou be like, \"Damn how could she hit me off with chlamydia?\"\nFool I pity ya\nWe live in the city of ballers\nWith more bounce and in a Zapp, she will doo wa ditty ya\nThe prettier the grittier, the wittier can get her\nTo the Hotel, Niko, on some Sauve shit like Rico\nThat's when I caught a Vision like Coleco\nA high-post ho, a perfect way for me to keep dough\nHuh, have her sellin' ass on Bronson Ave. and Pico\n\n[Verse 3: Kurupt]\nAt the ho-tel, mo-tel, or the Holiday Inn (Say what nigga?)\nI said if that bitch keep fuckin up (Beotch) then we'll fuck her friends\nI said I dip, dive, what can I say?\nNiggas need to stop fuckin' with O.J\nSome niggas bang Blood, some niggas bang Crip\nAnd bitches ain't shit but hoes and tricks\nI had a dream of hoes, I had to screen my hoes\nI seen my hoes in all kinds of clothes\nLil' Almond Joy, I truly enjoy\nIf you blew my balls, right through my drawers\nCome back to the mansion, chill at the spot\nFrom the way she was blowin', I know she does it a lot\nI have a eight-and-a-half, nine-and-three-quarters\nThe ho started callin when I started boss ballin\nGimme some head, gimme some ass (Uh-huh)\nGimme some cash, pass it to Daz\nPass it to Snoop, or pass it to Nate\nSee hoes eat dick like eggs and steak\nIt ain't shit new, I thought you knew (What?)\nI knew you would, you wish you could\nBreak a G down, break me down\nBut I'ma see you on the rebound (What what?) D.P. style\n\n[Chorus]\nNow this, this is one of them occasions\nWhere the homies not doin' it right\nI mean he found him a ho that he like\nBut you can't make a ho a housewife\nAnd when it all boils down you gonna find in the end\nA bitch is a bitch, but a Dogg is a man's best friend\nSo what you found you a ho that you like\nBut you can't make a ho a housewife (Wife)\n\n[Outro]\nHalf-dead\nLil Half-dead the one who jumped out to see ol' Snoop Dogg on lookout boys\nHe's going to be more than half dead if he don't fill my drink up\nI'll fill your motherfucking mouth up\nHahahahaha\nI don't think so!", "image": "https://images.genius.com/f9713af0f8164e90022b622002fda842.600x596x1.jpg"}], "artist": "Dr. Dre"}