{"songs": [{"title": "Lu Myself", "album": "Lupe the Jedi", "year": null, "lyrics": "[Lupe Fiasco]\nLu myself, first of all accuse myself for being a fool\nAll attempts to school myself have failed\nTo improve means to remove myself\nFrom this pool of sharks, dark as the mood I felt\nI’m losing fuel, that’s all the food I refuse myself\nThat’s how you do when you do yourself\nAnd if I lose, I could never excuse myself\nTill I grow old, sit back and accrue my wealth\nYou don’t stand a chance, matter of fact, you don’t have half the stance\nTo stand if you stood half a chance\nLike c-h-a to dance with this man from the C.H.A’s\nGive it up, just abandon plan\nSince you don’t have half the stance like an amputee\nYou don’t have half the pants that it takes\nTo command a family\nThe fan or command a fee\nSo you will never get the ransom you demand from me\nThe good news, my foot’s loose, my hands is free\nSo I dance all footloose and fancy free\nBig Ups to footloose and all the fans of me\nMy fan base expands from Vans to Timberlands\nFrom mansions to Section 8 campuses B\nI’m they champion and I ain’t even SoundScanned it, see, I been lamping\nWhipping up an answer to these rappers who got it backwards\nLike zipping up their pants to pee\nLike I’m just a rapper and I ain’t dapper\nI'm frequently fly, I can go to France for free\nBut I ain’t no fan in base, cooking up grams of C\nWe in a wet stretching O’s like rubber bands to feed\nBut that was white boy 100 grand to key\nWhen I’m posted up with this little punk ass chump cash advance\nThat they handing me, I came back with birds like Brandon Lee\nI came back with words in a stanzas G\nTold ya, right back like Stan, I'mma stand till it answers me\nI’m concentrating man, I'm an oscillating fan\nWhen they wanna shake hands with me, it sucks right now\nHear it through ya spirit just dampens B\nLike damn that was my man, what the hell happened to he?\nHis fan base is disbanded B\n‘Cause his lyrics don’t mirror when he first landed see\nDon’t give into this land to please\nSo help me God, I'mma kill it, that’s my word\nRemove this blindfold, just give us a chance to see\nAnd I'mma quit it the minute it abandons me\nMy plan’s to be here for a minute\nThen I’m finished, then I’m vamping G\nMost these cats is pussies, pearl tongues, oysters and clams to me\nFlintstone money can’t even stand being in their glances geez\nThey say it’s looking good, from my vantage B?\nShit is sinking like Atlantis B and I’m more set than Alanis\nWhat, you ain’t understanding me? Am I speaking Spanish B?\nWell adios holmes, am I getting sloppy Joe? Well what am I, a Manwich B?\nI got a Big Mac if you want a sandwich G\nWho else you know keep the Mickey D tucked\nWith the windy on his shoulder? I told ya, give it up dog, it’s over", "image": "https://images.genius.com/cd4d83021b7debccabee0705b6c17c4e.499x499x1.jpg"}], "artist": "Lupe Fiasco"}