{"songs": [{"title": "Henny *", "album": "The Infamous Mobb Deep", "year": null, "lyrics": "Feat. Busta Rhymes, French Montana, Mack Wilds\n\n* Mobb Deep album version features new Busta Rhymes verse\n\n[Intro: Mack Wilds]\n(Willllld Thinnnnngs!!!!)\nHennessy (Hennessy) Hennessy (Hennessy)\n\n[French Montana]\nWeed, Hennessy, a lil' sour (HAAAAAAAAA!!!!!)\nBaby let's ride (HAAAAAAAAA!!!!!) HAAAAAAAAA!!!!!\nHey!\n\n[Verse One: French Montana]\nShe feelin me, cup full of Hennessy\nBaby show me love but, fuck me like the enemy (HAAAAAAAAA!!!!!)\nHa! By far baby less clothes\nYachts! Nah we don't do the fishin boats\nSteak and lobster, I'm tryin to serve 'em\nTurks and Caicos on the first, missed the flight\n24 karats neck fully golden\nGreat ass black shades rollin\nSpeedin in the European car like it's stolen\nCoke Boyz made it to the top like we totin\nMy nigga Chinx Drugz told me (HA!) Motherfuck they feelings\nLet's get these motherfuckin millions\n\n[Verse Two: Havoc] (Mack Wilds)\n(Hennessy) Double shots of the Hennessy, we 'gon kill this whole body\nAfter this you 'gon remember me, it's not a case not too big\nI will have your bitch callin over and over time a lineup\nYou soft wit' it she just want it wild rough\nBoss wit' it took nothin got her riled up\nAnd it's on and on everything around us\n\n[Verse Three: Prodigy] (Mack Wilds)\nOooh baby you sexy fuck you that bitch!\n(Hennessy) Bottles and shots and we twist\nI'm that thug you wanna be with\nAnd live a infamous life po' up and get lit\nStay away from that basic zone that's not us\nWe came here to party they came to watch us\nAnd damn, I feel no remorse for your ex\nBetter take it easy, 'fore I crack him in the head with the (Hennessy)\n\n[Verse Four: Mack Wilds]\nHow the hell did you get here? Was you sent from me?\nManhattan fly, Brooklyn bad, maybe Stapleton\nI wish I had some more treats girl, just to trick on ya\nBut this money ain't impressive huh? Well\nI'm a fly mu'fucker from around the way\nS.I. 'til I die and I say it brave\nMake money for my fam, fans out of enemies\nAnd I'm smoother than a shot of\n\n[Chorus: Mack Wilds]\nAnd I'm smoother than a shot of Hennessy (Hennessy) Hennessy (Hennessy) Hennessy (Hennessy)\nIf I hit it then you 'gon remember me (Remember me) remember me (Remember me) remember me (Remember me)\nAnd you ain't too cool to, pass by, what you sayin baby let's ride\nYou fuckin with the right guy, and I know your feelin me (Feelin me)\nYes your feelin me, Hey! {The Conglomerate}\n\n[Verse Five: Busta Rhymes]\nYo, live thorough niggas (UHH!), five borough niggas (UHH!!!)\nHat low, whippin 'cross the Tri-Boro niggas (UHH!!)\nYour team look soft, you look like five solo niggas (HA!)\nRespect my city 'fore I get my BIPOLAR NIGGAZ!! (EEEEH!!)\nSee how that nigga sound?? (YES!!) The ONLY thing they understand\nIs beatin niggas to death, don't put your hand on me!\n(UH!) You see we back to the strip, we drop a bundle, nigga!\nNow get the black and we back inside the TUNNEL, NIGGA!!\n(HEH-HEH!) See we run it like we was joggin on 'em\nCome get your shit like you really just caught a BARGAIN ON 'EM!\nHey-hey! See the melee we be causin, nigga\n(MORE HOOD) than the club security robbin niggas\nProvide the fire and smoke, call me the arson nigga\nLike we in jail sellin cigarettes, bring a carton, nigga! (HA!)\nWe cause 'em really to ack' a way when I'm clobbin niggas\nAnd I advise you to back away when I'm talkin, niggas!\nHot shit, sizzle the street, see what we cookin, nigga\nUH! -- Pardon me, UH UHH!! We got 'em PUSHIN, NIGGAAA! (Hahaha!)\nYou ain't with it, then you can leave\nNow that I'm back up in this bitch, sorry niggas, you can't breathe\n(YAAH!!) Leave me alone and I'm beggin a nigga please (YAAH!)\nDoin that shit that make niggas crash into trees (YAAAAAAHHHH~!!!!)\nMack Wildz, Montana, Mobb Deep\nYou see them chicks, just let 'em know that our city don't never sleep\nWe got that..\n\n[Chorus: Mack Wilds]\nHennessy (Hennessy) Hennessy (Hennessy) Hennessy (Hennessy)\nIf I hit it then you 'gon remember me (Remember me) remember me (Remember me) remember me (Remember me)\nAnd you ain't too cool to, pass by, what you sayin baby let's ride\nYou fuckin with the right guy, and I know your feelin me (Feelin me)\nYes your feelin me, Hey!", "image": "https://images.genius.com/d36f3c5fdf16cb402e39bef763e25bf4.1000x1000x1.jpg"}], "artist": "Mobb Deep"}