{"songs": [{"title": "West Coast Wu-Tang", "album": "C4", "year": "2009-01-30", "lyrics": "[Verse 1: Kendrick Lamar]\nWhoo Ha!\nBackpack raps with gats in it\nDon't get your cap peeled by the black menace\nK-Dot thoroughbred\nMove like a militant soldier, on point like a pyramid\nA forced to be reckoned with, fuck with the best shit\nLike the strongest manure, I'm ready when you are\nThis is it, I'm in the lab cooking up all day\nFuck 'em up all day like a nympho\nI been dope since S curl waves\nTrying to convince hoes I got good hair\nKnowing damn well there's chemicals there\nI'm in the hood with the 17 year-olds that's on hood patrol\nAnd they want stripes, so they shoot off bikes\nAnd you know any moment you can lose your life\nSo kiss your kids and hug your wife, and what not yo\nI spar with a dragon, he tried to throw a flame\nBut I ducked, then I stabbed him and came out the battle laughin'\nThat's a metaphor for any rapper who wants it\nI smack 'em til their nose is running\nYou know the hoes is coming if I'm there\nAnd the hoes is cumming once we hit the hotel\nThere's no assumptions\nCool out before I move out, hop on the 105\nDo about 105 before your ass gets threw out the back seat\n(There's a dead guy on the freeway)\nOh, It's not Dot? Tell the medics it's okay\nA beast when the beat break\nYou probably think I'm dope like this the realest shit I wrote\nBut to me, it's a throw-away\nI stare at the four walls and rap like I'm mad at God\nNice enough to throw a spear at Nas\nLaunch at Jay, matter fact, let me take that back\nSee I don't fuck with real legends in rap like you do\nI'm crucial, concealed by real crips and suwoo\nAnd they shoot like photography students when beef gets to brewing\n\n[Chorus: Kendrick Lamar]\nIs it real son? Is it really real son?\nIs it really real son? Is it really real?\nTell me how you feel son. Tell me how you feel son\nTell me how you feel son. Tell me how you feel\nYou rappers got nothing for me when Sound-Sounwave record me\nEvery MC, I'm sure to rip them, I guarantee you will forgive them\n\n[Verse 2: Ab-Soul]\nCome again, no introduction, you know my name\nSoul brother, Dueces suck the juice from my ding-a-ling\nOrangutan arms banging niggas like a set\nWhen I speak, they fucking silent like sex for the deaf\nViolence, I play it like violins in the orchestra\nTreat you like vitamins then spit you back out\nLike a verse I had way back before I had it mapped out\nRip a page out the Almanac then cross reference when I wreck shit\nI wish jaw bone fractures on all of you rappers bumping your gums\nLike the measles when the record meets the needle\nHeads spinning like a twelve-inch, Smoking the best Celtic\nLike I shot Larry Bird, follow my word\nBig Herb, Ill with it, I need a hospital gown\nYou need 54 cards, deal with it\nYou may think I'm killing it, but I'm healing it\nLike a bitch in the club, Shoe game\n\n[Verse 3: Punch]\nAy yo yo, the flow potent\nWho's more focused? Kick doors open\nDeliver the golden opus leave with two guns smoking\nIt's me, the podium closing, a poet well-spoken\nThe gropes is most consistent with imminent penmanship\nMind-bending, co-existing with the written\nVerbal assassin, Internally smashing, Spazzing on tracks\nTranslation, I'm disgusting in action\nA lyrical glutton busting over Sounwave productions\nY'all don't want nothing, The sum of all fears\nMercury rising, I'm summer all year\nI sixteen 'em to death and wish them the best\nI guess that's the gift and a curse, You see my pattering\nY'all still rapping like that's what's happening\nI write rhymes with fire on stone tablets\nPeep the malice, I'm a monster\nYa Boy running like William Joseph Crawford\n\n[Chorus: Kendrick Lamar]\nIs it real son? Is it really real son?\nIs it really real son? Is it really real?\nTell me how you feel son. Tell me how you feel son\nTell me how you feel son. Tell me how you feel\nYou rappers got nothing for me when Sound-Sounwave record me\nEvery MC, I'm sure to rip them, I guarantee you will forgive them\n\n\n[Verse 4: Kendrick Lamar]\nStraight up, Don't get ate up\nPut rappers in quicksand, Dot leaned on 'em like kickstands\nI'm so hot, kids put me in their iPod\nEven atheists play my shit and say, \"My God, Jesus, Joseph, and Mary, he's nice\"\nDon't compare me to them, just compare me to Mike Jordan\nWhen I record and the verse and the chorus is ill\nYou can land in lab of fortune when biting my skills, playa'\nWatch I lay-up bar after bar like I'm trying to build a gate up\nSee me on the way up like an elevator, I'mma let you take the stares\nThat metaphor meaning I'm already there (Greatness)\nI'm in the booth with an apron\nCooking up shit like Martha Stewart was my bitch, Amen\nStay on the curb like a ? day tan?\nBlowing herb with my nigga Herb, Fuck what you niggas heard\nWe the new West Coast Wu Tang bitch and I'm the best\nStay blessed, You can suck my dick\nWho from the West can kill it like us? Give me their name\nNow I take 'em to the house of pain, Top Dawg headquarters\n\n[Chorus: Kendrick Lamar]\nIs it real son? Is it really real son?\nIs it really real son? Is it really real?\nTell me how you feel son. Tell me how you feel son\nTell me how you feel son. Tell me how you feel\nYou rappers got nothing for me when Sound-Sounwave record me\nEvery MC, I'm sure to rip them, I guarantee you will forgive them", "image": "https://images.genius.com/8b626036c563b0aefa7a5b83f1fb9302.750x750x1.jpg"}], "artist": "Kendrick Lamar"}