{"songs": [{"title": "Rest Assured", "album": "Don’t Sweat the Technique", "year": "1992-06-23", "lyrics": "[Chorus]\n\"Double oh seven is back\"\n\"Double oh seven is back\"\n\"Double oh seven is back\"\n\n[Verse 1: Rakim]\nI don't stress my day cause it's best to parlay\nI guess you could say I've been away\nI wake up slow when I'm hot but I destruct the plant\nAnd fourteen hands comb New York for fans\nThey make waves as they wiggle in my waterbed\nPull back the leather covers and silk bedspread\nA mornin' massage turnin into a real rough rubdown\nSo I figured I'll lay around\nThey keep me wet with a juice called Tahiti\nIt make the room steamy, so soon they couldn't see me\nThey know more than calisthenics as they worked up a sweat\nIt wasn't even ten o'clock yet\nScrub down, then I get moist, they never treat me mean\nThey sweetly keep me squeaky clean\nI chill as they filled the jacuzzi\nI said, \"I'm tight from a real long flight, could you soothe me\nSupport my thoughts, 'cause I got a lot of writing to do\"\nThey said, \"Cool\" and just enjoyed the view\nIt ain't hard 'cause it's miles from the sidewalk\nI'm overlookin' every borough in New York\nThe entire Empire State to concentrate\nFor every rhyme I make\nSo at exactly noon they played my favorite tune\nAnd just before they all cleared the room\nThey said, \"We're glad you're home from tour, now we feel secure\nWe wish you didn't have to leave no more\"\nBut they wanna go to war, they even tried to shoot up the door\n\"Double oh seven is back\"\nRest assured\n\n[Chorus]\n\"Double oh seven is back\"\nFeel secure\n\"Double oh seven is back\"\n\n[Verse 2: Rakim]\nI'm fillin' up the page when I'm steppin' on stage\nGot the people in a rage with they hands in the air\nFellas sayin' \"Ho\", everybody yellin' \"Go\"\nFly ladies in the house all screamin' \"Oh yeah\"\nThat's how they react when I attack the mic\nIn fact it's like a stack of dynamite, powerful and bright\nGirls love to squeeze me real tight\nDouble oh seven is back\nRa has returned to romance 'em, better than Johnny Handsome\nWhen I was young women said, \"Damn son\"\nAin't nuthin' changed but the year and I'm still here\nC'mere dear, let me whisper in your ear\nHug my words so I can taste your lips\nI set up hips like domino chips\nBut I don't let 'em hit the floor\nAnd if you got sore, then feel secure\nWhere's the pain? Is it the spot you set us in?\nAlmost magic, better than medicine\nTake one of these and put your mind at ease\nI get more work than a lot of M.D.'s\nIf I'm hawkin' New York or out on tour\nI express the raw dialect and explore\nBut don't get fooled by metaphor\nDouble oh seven is back\nRest assured\n\n[Outro]\nFeel secure\nRest assured\nRest assured\nYo, feel secure", "image": "https://images.genius.com/c242f8367734db09ac26eb1c1bbcee98.900x900x1.jpg"}], "artist": "Eric B. & Rakim"}