{"songs": [{"title": "Sweetest joy", "album": null, "year": null, "lyrics": "It’s K Mc, bitches!\nOhhh, yeah\nI’m balling like somebody threw a…\nSo much paper, I think I need a secretary\nI’m filthy fucking rich, this can’t be sanitary\nMoney tossing, you know I had a hell of a…\nYou can hear it in my vocabulary!\nAnd I live for the money\nI need it more than a blunt from my vocabulary\nI got a whole lot of ice and a whole lot of cash\nWho everything around me call it…\nI die for the money!\nReal ass niggas, never lie for the money\n…in my face, but it won’t be funny\nWhen the goon went for your balls half for the money\nReal recognize real, you don’t know me, nigga\nTime is money, spent the century on a rolly nigga\nCause you gotta watch this bitch, and now these conniving niggas!\n\nHook:\nSome of these niggas think I’m playing for the pussy\nGetting the finger, but I ain’t palying with your pussy\nI ain’t a killer, but don’t push it\nGetting money is the sweetest joy of getting pussy!\nI ain’t a killer, but don’t push it\nGetting money is the sweetest joy of getting pussy!\nI ain’t a killer, but don’t push it\nGetting money is the sweetest joy of getting pussy!\nI’m balling like somebody through an alley, oh\nGoing broke is probably something that I’ll never do!\nFall in love with the pussy, that’s real too\nI drop the top and I.. out and I salute, at-cha!\nI’m solo, take money won’t fall on\nCar so pretty, I’mma have to put a roll on it\nFuck them niggas that total on me\nGo rolling, new pussy, fall on it!\nTurn it out, turn it on, remote control, homie!\nThey go suicide, tell them, “let’s ride!”\nEat the pussy, get them wet, I’mma scuba dive!\nYou got some nerve, nigga, rookie night\nIf the bitch wanna fuck, I tell her get in line!\n\nHook:\nSome of these niggas think I’m playing for the pussy\nGetting the finger, but I ain’t palying with your pussy\nI ain’t a killer, but don’t push it\nGetting money is the sweetest joy of getting pussy!\nI ain’t a killer, but don’t push it\nGetting money is the sweetest joy of getting pussy!\nI ain’t a killer, but don’t push it\nGetting money is the sweetest joy of getting pussy!", "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg"}], "artist": "2 Chainz"}