{"songs": [{"title": "Symphony X Major", "album": null, "year": null, "lyrics": "[Xzibit]\nTime to snap out of it, welcome to the real world\nMy life like a Hitchcock flick, stick to the script\nIf she can't stick to the script, stick to this dick\nHow she actin off of the fifth? Ridiculous sh*t\nWe don't need conversation, just crowd participation\nIf you here on vacation we got, rules and regulations\nSeperate myself from y'all, segregation\nTryin to stop Xzibit and Dre? Humiliation\nPure elevation, got me some inspiration\nTwo b**ches in bubble baths, a beautiful invitation\nGot a live occupation, live for the moment\nI'm faced with an altercation manhandlin my opponents\nI got eyes in the back of my head\nI never sleep so they bloodshot red\nYo we so far ahead of our time\nIf we can stop life and press rewind\nYou still wouldn't catch up 'til 2K and a dime, so turn it up\n\n[Chorus - female and male singers]\n[F] Turn it up! [M] Turn it up\n[F] This is it! [M] This is it\n[F] We the sh*t [M] We the shiiiiiiiiiit [F] Get with it!\n[F] Give a f**k [M] Give a f**k\n[F] Who you wit [M] Who you wit\n[F] Turn it up! [M] Turn it uppppppppppp [F] Get with it!\n[Dr. Dre]\nTruthfully speakin, it's lonely up here all by myself\nSo I had to come down and pass around some help\nFrom N.W.A to whatever's next\nMake sure it says ANDRE YOUNG in bold letters on big checks\nYour sh*t ain't sellin? f**k it, get Dr. Dre on it\nYou got a budget? I'll get down, give me half of it\nOne session, one song, I'm gone\nThe first week, you hit the streets, a star is born\nTo add to my universe - let me show you\nWho can invade who nigga, and who can do who the worst\nWarning from the Surgeon General\nWatch out for fake hits and bullsh*t that sounds identical\nPick it up, read the credits, who you thought it was?\nTwenty years in the game, with a constant buzz\nPick a year, any year, see how hot I was\nSame sh*t today, and still don't give a f**k!\n\n[Chorus]\n\n[Chorus 2]\n[M] Stay.. in your place [X] Stay in your place nigga\n[M] You can't face, what we bringin\n[X] What we bring to the game, playa\n[M] Bounce like this [X] Bounce [F] Bounce like this\n[M] Blaze your sh*t [F] Blaze your sh*t\n[M] And get high for meeeeeeee\n[Xzibit]\nLet me give y'all niggas somethin to hold\nThis product not to be sold\nKnow you can't cook it over a stove\nYou can flip it and come back with a mitt\nDon't make me reach through your limo tint\nI just want my twenty percent\nThis is dedicated to the people that spoke too soon\nI think I'll stop shootin you niggas and shoot for the moon\nMotherf**kers turn respect on and off like a light switch\nI'll never be seen, like Farrakhan f**kin a white b**ch\nJump I won't flinch, dump I don't miss\nX holdin this, I'm never losin faith or focus\nSo say what you gotta say, every day a holiday\nWe don't blow the roof, we blow the whole f**kin spot away {*BOOM*}\nOrganize permission like, organized crime\nOrganized minds, organize they nickels and dimes\nOrganized vocab be organizing my rhymes\nOrganizing my business and organizing my time, so turn it up\n\n[Chorus]", "image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg"}], "artist": "Xzibit"}