{"songs": [{"title": "Marvin & Chardonnay", "album": "Finally Famous (Super Deluxe Edition)", "year": "2011-06-28", "lyrics": "[Intro: Kanye West & Big Sean]\nYeah\nYou know a nigga don't really wanna take his cool off, uh\n(Boi, do it!) I'll express this, though\n\n[Hook: Roscoe Dash, Kanye West, & Both]\nShe call me early in the morning (Early!)\nWhen she’s all alone\nI’ma take my time (Yeah!)\nDo it how we want (Uh-huh!)\nJust to set the mood, girl\nI brought some Marvin Gaye and Chardonnay\n\n[Interlude: Kanye West]\nHold up, hold up, hold up, hold up, hold up\nHold up, hold up, hold up, hold up, hold up, yeah\n\n[Verse 1: Big Sean & Kanye West]\nShe love the way I’m doing it (She do it! Hanh?)\nSo G.O.O.D. she won't put my tattoo on it (Ugh)\nBottom line is (Ugh), you the finest\nGave you a new name\n(What's that? What's that? What's) My bitch\nHold up, hold up, whoa there\nLet's capture this moment (Boi, boi, boi, boi)\nIf I hit it then I own it, marijuan'-in' every mornin (We... on)\nAnd Patrón-ing, girl, we groaning (Do it)\nBut that pussy got me feeling like a kid with the street lights on\nStreet lights on, on? 'Cause you know I gotta go in 'til it's\n\n[Hook: Roscoe Dash, Big Sean, & Both]\nEarly in the morning\nWhen she’s all alone (Do it, I do)\nI’ma take my time (Time! Boi)\nDo it how we want it\nJust to set the mood, girl\nI bought some Marvin Gaye and Chardonnay\nSo just let the song play\n(And I'ma give it to ya) The long way\n(And give it to ya) the strong way\n(We at it all day) It’s our day\n(It's like this always) It’s our way (After a long day)\nThis was all inspired\nBy a little Marvin Gaye and Chardonnay\n\n[Interlude: Kanye West]\nHold up, hold up, hold up, hold up\nHold up, hold up, hold up\n\n[Verse 2: Kanye West]\nTalk to the, talk to the... hand!\nBitch, you talking to a grown ass man\nIt’s, like, way-way-way too much up in your pants\nFor us not to make the bed squeak\nRri-ih, rri-ih, rri-ih, rri-ih (There goes the bed sheets)\nEverybody rip the swag off 'fore I rip the tag off\nWhy my pants sag off? 'Cause I’m rapping my ass off\nFlow so ugly, money so handsome\nThis the fucking anthem, get it? The fucking anthem?\nAHHHH!\n\n[Hook: Roscoe Dash & Kanye West]\nEarly in the morning when she’s all alone\nI’mma take my time, do it how we want it\nThey say, \"Yeezy, Ye, he done it again!\"\nJust to set the mood, girl\nI bought some Marvin Gaye and Chardonnay\nSo just let the song play (And I'mma give it to ya)\nThe long way (And give it to ya)\nThe strong way (We at it all day)\nIt’s our day (It's like this always)\nIt’s our way (After a long day)\nThis was all inspired\nBy a little Marvin Gaye and Chardonnay\n\n[Interlude: Kanye West]\nI be saying, I, uh, I think\nWhen I know, uh, just because...\n\n[Verse 3: Kanye West, Big Sean, & Both]\nI don’t really wanna, uh, talk too much shit\nBut you love it when I talk like I lost it\nAnd I love how you look when you blazin’\nAnd I swear you turn at least half-Asian\nAnd we about to have a liaison\nShe so cool, give head with her shades on (Whoa)\nYou should just go and throw a cape on (Whoa)\nAnd it’s just so amazing\nSo amazing, so amazing\nTake it to the car, bloop, bloop\nThat shit look like I’m speed racing\nLeavin' with me, it’ll boost your reputation\nWestside is where I’m stationed\nSpend all night, just champagne-tasting\nAin't no rush, girl, let's just pace it 'til it's\n\n[Hook: Roscoe Dash & Big Sean]\nEarly in the morning (Yeah)\nWhen she’s all alone (When she's all...)\nI’ma take my time, do it how we want it\nJust to set the mood, girl (Mood!)\nI bought some Marvin Gaye and Chardonnay\nSo just let the song play\n(And I'ma give it to ya) The long way\n(And give it to ya) The strong way\n(We at it all day) It’s our day\n(It's like this always) It’s our way (After a long day)\nThis was all inspired\nBy a little Marvin Gaye and Chardonnay\n\n[Outro: Roscoe Dash]\nAnd this was all inspired\nBy a little Marvin Gaye and Chardonnay\nAnd this was all inspired\nBy a little Marvin Gaye and Chardonnay", "image": "https://images.genius.com/35688d8c3757035ff101ad0b50c3255e.500x500x1.jpg"}], "artist": "Big Sean"}