{"songs": [{"title": "Blue Sky", "album": "The Dreamer/The Believer", "year": "2011-10-04", "lyrics": "[Intro: (Common) and Sample]\nMr. Blue Sky, please tell us\nMr. Blue Sky, please tell us\nMr. Blue Sky, please tell us\nMr. Blue Sky, please tell us\n(Listen) Why you had to hide away for\n(Listen) Why you had to hide away for\n(Listen) Why you had to hide away for\n(Listen) Why you had to hide away for\n\n[Verse 1: Common]\nAston Martin king, Luther with dreams\nThe young Denzel the way I move through scenes\nI’m like a preacher that once was a fiend\nA story of change that came with wings\nPretty as the skyline, the sky is my eyeline\nSon of the most so from up high I shine\nSuited in Prada, stay mellow like lala\nYoung, fresh, with dollars, ladies go gaga\nI’m the cum-lada, top of the class\nBlack Wall Street so my stock will never crash\nGiven what I ask, pure religion and cash\nFrom the windows that open, I’m raising my glass\nDaylight beams, night life schemes\nThis is my inception, I’m writing my dreams\nImmortal view of a star doing what I’m born to do\nI see the blue sky, see the Lord's coming through\n\n[Hook: Makeba]\nOhh, in the sky we'll find the light\nOhh, ain't too high, we'll shine at night\nNow we in the skies, blue skies\nAnd we going higher, that's right\n\n[Verse 2: Common]\nIt all started with a dream, I wanted to be Run–D.M.C\nThe Lord put the blessing upon the MC\nO to the M, dreams were spoken to him\nThat's when I knew my flows would overflow to the rim\nOpen my eyes, yes sir this is what I'm made for\nTo go hard in the paint like D. Wade or\nD. Rose, from the same streets that we rose\nInternational heroes at world primos\nRed carpet magic, taking pictures with the president\nTold him for health care, my music is the medicine\nMy name holds weight, I am never hesitant\nDifferent state resident, this is hood elegance\nSLS classic, pursuing my passion\nNOVA Fashion, now I'm Oscar party crashing\nImmortal view of a star doing what I'm born to do\nI see the blue sky, see the Lord's coming through\n\n[Hook: Makeba]\nOhh, in the sky we'll find the light\nOhh, ain't too high, we'll shine at night\nNow we in the skies, blue skies\nAnd we going higher, that's right\n\n[Verse 3: Common]\nSilhouettes of dreams that we had high, huh\nEven now it don't seem so bad, ma\nClose my eyes to see things in front of me\nI'm gone now, imagine what I'm gonna be\nDirty to worthy, now I'm all wordy\nMy broad up in Paris, looking all purty\nImmortal view of a star doing what I'm born to do\nI see the blue sky, see the Lord's coming through\n\n[Hook: Makeba]\nOhh, in the sky we'll find the light\nOhh, ain't too high, we'll shine at night\nNow we in the skies, blue skies\nAnd we going higher, that's right\n\n[Outro: Makeba]\nI had these dreams in my head of an endless sphere\nI could see it from my window\nWouldn't take that long to get me there\nKeep running til' I can go\nRemember the beautiful things that life could give me\nCrazy how I'm the one\nCould've been anywhere, but I'm sitting in the air\nWith the wheels up staring at the sun\nOhh, in the sky we'll find the light\nOhh, until high we'll shine at night\nNow we in the skies, blue skies\nAnd we going higher, that's right", "image": "https://images.rapgenius.com/e712ea3cff4e2f2ebd2b69ef9973b923.500x500x1.jpg"}], "artist": "Common"}