{"songs": [{"title": "HOT97 Freestyle", "album": null, "year": "2013-07-10", "lyrics": "[Verse]\nI was just a backpack rapper, backpack of Krylon\nFat caps, slab of concrete that I would write on\nEighth grade when \"Triumph\" came out, and I'm like, \"Hey mom\nCan I skip school? I can't even wait!\" \"Nah!\"\nThirteen years later, praise God\nI just got DM by Raekwon\nAnd he wants me up on the same song\nAnd Method Man's pissed off for doing the crowd walk\nBut it wasn't nothing, man, we squashed it, nah\nI'm from the city Nirvana where that mosh pit started\n[?] from where Kool Herc started\nThat doesn't mean that I won't kill the beat and be a martyr\nAspestos with pencils my pens choke as coffins\nWest Coast, success toast, Seattle down to Compton\nWhat does it say about America that I became a millionaire\nBetween kicks and snares and couldn't get in to college\nAight, switch topics\nI don't walk I get piggybacks on Action Bronson\nShow up at Em's crib with the split of vodka\nHit up Mac Miller, relapse and celebrate kwanzaa\nOn behalf of us white rappers\nI think it's a fact that yes we have appropriated culture\nIt's just race, let's talk not make it awkward\nI wrote a song about thrift shop's\nI never thought it would ever get a spin, radio did its thing\nAnd all of sudden the song popped up and got popular\nWould that have happen if I wouldn't be a cracker?\nSold 6 millie, does skin tone really matter?\nWe live in America, land of gimmicks and ladders\nAnd did I go climb it, bastard, of course race was a factor\nBut bitch I'm a B-boy and I put that beat in the casket\nListen to The Heist, man, we almost made a classic\nYou gon' agree, that's vantastic\nTake away Thrift Shop and can't hold us going platinum\n9 times, alright fine\nBut I made it uncool for kids to say \"faggot\"\nI got rich and I didn't go buy a mansion\nGave away 200K to the homies that didn't have it\nAnd when I fall off and the second album flops\nAnd turn into Vanilla Ice, wait, that's never gonna happen", "image": "https://images.genius.com/8983d0c6fd7a87e846a12ba0c3a05815.1000x1000x1.jpg"}], "artist": "Macklemore"}