{"songs": [{"title": "Do the Bus a Bus", "album": "E.L.E. (Extinction Level Event): The Final World Front", "year": "1998-12-15", "lyrics": "[Intro]\nUh\n\n[Chorus]\nThe Bus-a-Bus (Yeah)\nThe Bus-a-Bus (C'mon, ka-c'mon)\nThe Bus-a-Bus (Uh)\nRockin' to the beat\n(Flipmode, motherfucker, Flipmode, y'all)\nThe Bus-a-Bus (Uh! Yeah, yea-yeah, yeah)\nThe Bus-a-Bus (Ka-c'mon, ka-c'mon)\nThe Bus-a-Bus, (Uh!)\nRockin' to the beat\n(Yeah, yea-yeah, yeah, yea-yeah, yeah)\n\n[Verse 1]\nFloss time (Time!), Busta Rhymes shine on every primetime\nMastermind gettin' this paper now cross the fine line\nMoney plenty sippin' gently, whip the Bentley\nMy Bentley runneth over empty with gifts you sent me\nThen you broke the last rule, frontin' like we was mad cool\nYou damn fool, come around frontin' wearin' your man's jewels\nPlay the part, they want me to start shit\nGet on your mark quick and target, corner the market\nPeep how we're movin' this, keep improvin' this\nSee, you in this because you love the way me and my crew be doin' this\nHave a ball, I'm not mad at chy'all, where the alcohol?\nI ain't messin' witchyou at all, girl your ass too small\nCop the hot shit, write it off while you bite it off\nAnd try to fight it off; the fact that you wack and your light is off\nBite the dust, you like to fuss, look right at us\nI know you like to cuss, who could you trust to bring the rush?\nNow do—\n\n[Chorus]\nThe Bus-a-Bus (Aw, c'mon, keep it movin')\nThe Bus-a-Bus (Aye, yeah, I like just what you doin')\nThe Bus-a-Bus (Uh!)\nRockin' to the beat\n(Ayo, yo, y-yo, yo, all in together now)\nThe Bus-a-Bus (Aw, c'mon, keep it movin')\nThe Bus-a-Bus (Oh, yeah, I like just what you doin')\nThe Bus-a-Bus, (Uh!)\nRockin' to the beat\n(Ayo, yo, yo, yo, all in together now)\n\n[Verse 2]\nTurn it off!\nTurn me back on, go get your mack on\nAnd keep the track goin' and latch on, hope you can catch on\nFollow the beat you sweet bitches and get your dance on\nTipsy off a little Cristi', a little Chandon\nBarbecue back at the mansion, feel like a champion\nCollapse on, my thing orthopedic to rest your back on\nNowadays, Flipmode money be runnin' mad North\nFuck around, dig in my treasure, feel my forty-five long\nRide through, about to slide through, I'm right beside you\nMind you, my system be bangin', adjust my EQ\nPeek-a-boo, we not seekin' you, focus on beatin' you\nThere's only one of me, 'cause you copy there might be three of you\nClassic and so essential, we monumental\nPowerful, we presidential, we bomb your mental\nBite the dust, you like to fuss, look right at us\nI know you like to cuss, who could you trust to bring the rush?\nNow do the—\n\n[Chorus]\nThe Bus-a-Bus (Aye, c'mon, let's keep it movin')\nThe Bus-a-Bus (Oh, yeah, I like just what you doin')\nThe Bus-a-Bus (Uh!)\nRockin' to the beat\n(Ayo, yo, yo, yo, yo, all in together now)\nThe Bus-a-Bus (Aye, c'mon, let's keep it movin')\nThe Bus-a-Bus (Oh, yeah, I like just what you doin')\nThe Bus-a-Bus, (Uh!)\nRockin' to the beat\n(Ayo, yo, yo, yo, yo, all in together now)\n\n[Verse 3]\nHit me off!\nYou Speak & Spell and freak it well, son\nNo need to dwell, checkin' the mail, my pockets swell\nShit sound so intermediate, my ingredient\nIs to immediately rep for everyone you see me with\nYou little idiot, I exile you and your X-File\nYou and your next trial, and demolish your little wack style\nBlack child, I'm takin offensive, we too impressive\nTo the naked eye, the way we floss sure be expensive (Ooh!)\nTurn up the fader, ain't nothin' greater\nStill a little hater be gettin' paper, go meet your maker\nUndertaker, now go shake whatchya momma gave ya\nShaker, shaker now we trippin' the circuit breaker\nModel up and swallow up and turn the throttle up\nBreak the bottle up in the hip with the greatest follow up\nBite the dust, you like to fuss, look right at us\nI know you like to cuss, who could you trust to bring the rush?\nNow do the—\n\n[Chorus]\nThe Bus-a-Bus (Aw, c'mon, let's keep it movin')\nThe Bus-a-Bus (Oh, yeah, I like what you doin')\nThe Bus-a-Bus (Uh!)\nRockin' to the beat\n(Ayo, yo, yo, yo, yo, all in together now)\nThe Bus-a-Bus (Oh, c'mon, keep it movin')\nThe Bus-a-Bus (Oh, yeah, I like this, what you doin')\nThe Bus-a-Bus, (Uh!)\nRockin' to the beat\n(Ayo, yo, yo, yo, yo, all in together now)\nThe Bus-a-Bus (Yeah, aye, yeah, keep movin')\nThe Bus-a-Bus (Oh, yeah, I like what you doin')\nThe Bus-a-Bus (Uh!)\nRockin' to the beat\n(Ayo, ayo, yo, y-yo, yo, yo)\nThe Bus-a-Bus (Yo, c'mon, keep it movin')\nThe Bus-a-Bus (Yeah, I like what you doin')\nThe Bus-a-Bus (Uh!)\nRockin' to the beat\n(Ayo, yo, y-yo, yo, all in together now)\nThe", "image": "https://images.genius.com/74d986e571f31c27df8d6f3000e2079f.500x500x1.jpg"}], "artist": "Busta Rhymes"}