{"songs": [{"title": "Dreams And Nightmares", "album": "Sorry 4 The Wait 2", "year": "2015-01-20", "lyrics": "[Intro]\nTurn the music down in my headphones, yeah\nThat noise in the background, that's my skateboard\nThat nigga Mack crazy\nYeah, uh\n\n[Verse 1]\nI put my shooters on they feet\nI just give 'em your address, then go to sleep\nThe money turned my niggas into monsters\nThe white done turned my niggas into Nazis, Lord\nThe money turned my face into a stocking\nDon't make me turn your baby to a hostage, boy\nDon't make me turn the kid to a foster\nMy woman turn my dick into a Mazda, Lord\nBody parts in the duffel\nThe bullets turn your body to a puzzle\nThe money turn my bitch into a monster\nShe know how to get a check and turn a zero to a comma, Lord\nThe money turn my niggas into killas\nThe sugar turnt the cocaine to vanilla\nThe money turnt the bitches into hoes\nThe money turned my niggas into foes, Lord\nI put my shooters on they feet\nGive 'em your address, then I go out to eat\nHad that snowman in the hood like Jody Breeze\nShe from the hood but look like she from overseas\nI said, \"Girl you know I love you and I care for ya\nI got some new shoes and a bag of hair for ya\"\nShe say, \"Fuck these other niggas, they ain't half of ya\nJust keep laughing to the bank, it's hilarious\"\nI got a stay-at-home gun and a travel gun\nBoy, we could sell white, in Africa\nIt's like, I can't explain, y'all asked me to spit\nAnd now I'm drooling on my chain\n\"What happened to Wayne?\"\n\n[Verse 2]\nI'm like, hold up, wait a second, y'all thought I was second?\nHating on a champ, throwing salt and not confetti\nWe pull up and we shoot, then we park the car and edit\nWatch me pull up with no roof\nTthat's cause I walk the dog and pet it\nI'm like, hold up, wait a minute, y'all thought I was finished?\nShoot you in your head, then just walk off like I didn't\nLet my money talk so much, put my jawbone outta business\nDoing numbers in this bitch, I'm like a smart phone with the digits\nBitch!\nRiding 'round with the volume down\nWith the windows up and the choppers down\nSoon as we get to your block\nIt's the motherfuckin' other way around\nMy bitch say I'm too wild\nShe don't even know why she stay around\nI get home and I dick her down\nNow she talking 'bout exchanging vows\nIf these bullets was paintballs\nI could fuck around and I could paint a house\nYou could tell I'm pimpin'\nTthe way I hit the blunt with my pinkie out\nI bring wine to Amy house\nWe smoke it out and we drank it out\nAnd talk about these pussy niggas\nTthat ain't about what Wayne about\nI'm hangin out a Mulsanne without a brain, it's out of its mind\nI pull over, I push a button, it change like Optimus Prime\nSpeaking of change, it's a shame how these lames droppin' them dimes\nWe aim at your grape, knock it off, now you just vines\nBlood Gang, red rain on these niggas, hot if you dry\nMy gang top of the line, hollerin' out \"Squad, take it outside\"\nI'm a taxpayer, I'm a axe player, gettin' in through the back well\nRed devil to the blue collared, un-enveloped blackmail\nFed up with the fed shit and Fed-Ex lost my package\nMy white girls say \"Yeah, nigga!\" My white homies act blackish\nAin't tall enough for the NBA, I ain't big enough for the NFL\nShould've  been in N.W.A., fuck the police, Five-0 and 12\nOne time for your mind, bitch, never say \"Nevermind,\" bitch\nYou a penny short of a dime, bitch, no nonsense\nHad a nine since I was nine, bitch\nYeah, born to murder\nBank account on fat, bustin' out the girdle\nTell 'em boys ain't nothin' sweet, it's sauerkraut, ya heard me?\nThey find ya body in New Orleans on Mardi Gras on Bourbon\nLike, oh, Lord, Humphrey Bogart\nIt's a bird, it's a plane, it's a crowbar\nFor the most part, I'm the southern coast guard\nAK-47 spittin' flame like a blow torch\n\n[Outro]\nSorry 4 The Wait, woo", "image": "https://images.genius.com/c84ee812d9e99028d560054b386d4d9d.500x500x1.jpg"}], "artist": "Lil Wayne"}