{"songs": [{"title": "IDK", "album": "Sorry 4 The Wait", "year": "2013-07-13", "lyrics": "What's happenin\nYeaah, Yeah, Yeah!\nWhat's poppin yall (x2)\nIt's Tunechi Lee in this motherfucka (Tunechi)\nThis mixtape is called Sorry 4 the Wait\n(sorry for the wait)\nCarter 4 comin soon August 29th (Ceebo?)\n\nBut in the meantime in between time I'm sorry for the wait\nI know I promised a whole lotta dates so I'm sorry for the wait\nI know you all have been patiently waiting (uhuh)\nWell I hope you all have been patiently waiting (uhuh)\n(Yeah) cuz I am sorry for the wait\nI hope my apology is accepted (ay ay ay) just as well as ma music is\n\nI'm the best! But onto anotha subject\nWhat yall been doin?\nI been chillen like a mothafucka uhuh yeah\nMy children gettin older uhuh yeah\nMy bitches gettin colder (shoutout Detail)\n(Yo Menace what's poppin)\nMa money gettin olda (Jay rock) uh yeah\nGot dat new money too though shawty\n\nBut nuttin betta then that old money (everybody on the tour wit me)\nYou see (211) shoutout to ma homies (as always)\nFe Fe what it is\nT-street what it is\nLil T what it is\nDu Fute what it is\nRaw Dia I see you Lil Thugga I see ya Lil Flow I see ya\nI like to say thank you to the people who helped me with this mixtape\nMy nigga Mike Banger (Oh)\nRaw Dia (oh)\nLil Thugga (oh)\nLil Flow (oh)\nI thank you (x2)\n\nI thank you believe that\nI thank you believe that\nI thank you\nShout out to my nigga Mack Maine (I thank you)\nShout out to my nigga Lil Twist (I thank you)\nShout out to my nigga T street\nShout out to my nigga Fido (yeah)\nShout out to my nigga Lil Twist\nShout out to my nigga Lil Chuckee\nI know I said Lil Twist alredy but fuck it\nShout out to my girl Shanell\nShout out to Nicki Minaj (yeah)\nShout out to my nigga Lil Drizzy (uhuh)\nShout out all yall\nShout out Lil Tyga Tyga (Birdman)\nShout out dog uh\nFuzee Baby!\nFuzee\n\nHit a bitch with a car bomb (ay) x3\nUuuhh\nAre you kidding nigga ?\nVp James what's poppin\nAri (you know brooklyn )\nYeah are here are yu kidding nigga\nShoutout EO\nShoutout my nigga Jason\nSteady j rounds as a kill these niggas yeh\nShoutout ....\nMarisa\nMs nicki minaj\nShoutout to all the people who hold me down during them 8 months\nEverybody all the fans I can't do nuttin wit out yu I sware to god\nWhen I look in the mirror I don't see ma self I see yall\nThat's what I live for I live for yall I did this for yall\nAnd if yall don't want me to do it no more then I won't\nThat I mean\nYoung money\nShoutout to ma...\n(Too much talking at the same time )\nBe looking for the carter 4 august 29th coming soon\nI'm sorry for the wait\nJust wanna make up for the time ya digg\nShoutout my nigga Drizzy gotta new album coming\nTyga Tyga Lil Twist and Shanelle Coming\nCheckout Lil twist new single as well", "image": "https://images.genius.com/a22efe31e108ac84ea44f489ff2716f3.320x320x1.jpg"}], "artist": "Lil Wayne"}