{"songs": [{"title": "Down in tha Dirty", "album": null, "year": null, "lyrics": "[Hook]\nDown in the dirty south to be exact\nGettin money gettin money is a well known fact\n\n[Background \"Flight Attendant\"]\nWelcome to Atlanta, GA\n\n[Verse 1: Ludacris]\nI hit heavy in the trunk so I say I'm heavy hittin'\nMy car just got a Jheri curl the paint's still drippin'\nMy whip so clean I turn lovers into haters\nThen I make 'em come around like curl activator\nThere are none greater; I'm the freshest on the scene\nRap gaming Jones I'm the freshest on the team\nBut really I'm a coach spitting game to the players\nAnd I'm yellow with that purp like I came with the Lakers\nI'm out to get that paper, the mule and the acres\nI'm repping for the rich, red, monkey bathing apers\nSo catch a contact like you inhaled Luda vapors\nCause rappers get smoked like I rolled in some paper\nPut 'em in a ash tray throw away the roaches\nMove them out my pathway show them who's the dopest\nI bring home the bacon and protect it with the toasters\nLike the lens on your camera, fuck, boy I'm so focused!\n\n[Hook]\n\n[Background]\nWelcome to Miami, FL\n\n[Verse 2: Rick Ross]\n20 grand in the left\nAnother 20 in the right\nGot my wallet in the back\nAnd that thing packed tight\nCredit cards don't need 'em\nAll the birds won't feed 'em\nWhile I'm sitting at the table just me and family eatin'\nE-class on the cell; discussing another mill'\nGucci Gucci bottle empty, daddy needs a refill\nUp in frevay I'm standing on the bar\nIf it ain't a black truck it's a quarter million Maz'\nI'm in love with kush and Kate Fox\nIf ya need anything hit the safe deposit box\nOutta town for a month\nCame home with a duffel that was one point something\nGetting brain and I love it\nPimp, ask Khaled. Lobster salad\nMobster acknowledge I'm popping in Dallas\nPop collars I touch hoes like crep flow\nThe game in a choke hold\nNo I won't let go\n\n[Hook]\n\n[Background]\nWelcome to Houston, TX\n\n[Verse 3: Bun B]\nWell I done said said it before\nBut I guess it's best to repeat it\nDirty south in the building\nWith no losses we undefeated\nAnybody think they can beat it must be on sherm\nGot the streets on fire like raw scalps with a perm\nI'm big worm and that big body slayer\nRip it open and you keep playing with my money\nSmoke it like I'm a joke\nI go for broke on the boulevard\nIn the paint and have a bitch nigga sliced from his eyes to his tank\nYou think I came at 225 pounds of trouble\nCan't find a triller nigga than me if you had the Hubble\nI been repping the dirty and I ain't finna to slow down\nSo if you ain't with it get out the way it's about to go down\nYou can get your issue like your ass subscribed\nAnd when we ride there's nowhere that your ass can hide\nNigga try to come at me crooked like burners play craves\nHave you running up north like a runaway slave\nPlayed pussy your bluff even if it's your period\nThe dirty south niggas take their money too serious nigga\n\n[Hook]\n\n[Background]\nThank you for coming. We hope you enjoyed your stay. And please, come again", "image": "https://images.genius.com/29585ae075c68602b6c0377106249197.640x640x1.jpg"}], "artist": "Ludacris"}