{"songs": [{"title": "Party and Bullshit", "album": "Sickology 101", "year": "2009-04-28", "lyrics": "Black Walt told me if you wanna bonafide banger\nYou gotta start with a hard ass kick and snare\nAdd some dope ass music around and a hard MC and you got it\n\n[Verse 1: Tech N9ne]\nEvery night, it seem like we celebrating birthdays (Hoooooo!)\n'Cause rappin on planet Earth pays\nSmelling like versè, or is it Versace?\nYou got me sloppy from popping this oxys and shots of sake, copy?\nAll you ladies in here, I am sharing wood\nI just, wanna lay between ya and ram square into it\n'Cause, when it come to women, your man Aaron's good\nI done been inside-a more woman than Planned Parenthood\nI got more bottles, than newborn babies, for your boring ladies\nI want you drink up till you horn crazy and rape me\n'Till I'm lazy and achey, wanna get shady and tape me?\nOkay baby lets say we tape me inflating your trachia\nIm just partying I ain't letting the tool spit\nI ain't tryna have you haters layin below the pulpit\n40 acres and mule sit, in my garage with a cool kit\nEat, drink and be merry man and miss me with all that bullshit\nAin't no telling how drunk and high you'll get\n\n[Chorus: Krizz Kaliko]\n(Hey hey)\nWe party and bullshit\nBooze it with floosies (Hey hey)\nAnd that's how we dos it\nNot the Biancas we choosing\nEverybody lose it, listenin' to our music\n(Hey hey)\nWe party and bullshit\nBooze it with floosies (Hey hey)\nAnd that's how we dos it\nNot the Biancas we choosing\nEverybody lose it, listenin' to our music\n\n[Verse 2: Big Ben]\nAnd they like, and they like, yup do that thing you do (I am)\nWhat you mean? baby girl I need some liquor too\nAy, she need a picture too, Big Ben she want a picture too\nIm F-L-Y, so why not? We can flick a few (Fuck yea)\nKnock the lenses out my frames and start the ruckus (Yes)\nSo when I scream through the scene you know you niggas finna crush it\nMax out on swagga, not your ordinary rapper\nBut I do my thing extra, like no ordinary madness (Got ya)\nKeep that smooth movement so proper\nThey keep choosin' on ya dude 'cause I be's all about my dollas\nOn the baddest bitch swaggin through, its not a big deal\nShit I receive more tongue then a double stacked thizz pill\nIt's real, what you say you lose the crew and 'scape with me\nNo need to slow it down you let them other suckas pace the speed, dig it? (Yep)\nFuck it, I'mma party like a trap star\nAnd probably get my ass thrown out for going that hard\nAy, Ay, ay, ay\n\n[Chorus: Krizz Kaliko]\n(Hey hey)\nWe party and bullshit\nBooze it with floosies (Hey hey)\nAnd that's how we dos it\nNot the Biancas we choosing\nEverybody lose it, listenin' to our music\n(Hey hey)\nWe party and bullshit\nBooze it with floosies (Hey hey)\nAnd that's how we dos it\nNot the Biancas we choosing\nEverybody lose it, listenin' to our music\n\n[Verse 3: Shadow]\nYo, your flow missed me, buy vodka, get pissy\nRoll with Tech N9ne, bear arms and get grizzly\nEverready, a Killer, that flow's Anghellic\nStorytelling and battle-rapping, who can't sell it?\nShould I speed it up? Nah, I'ma keep it strange\nMy inner voices told my outer voice to be deranged\nThe devil on my shoulder got a devil on his back\nWho told him every time I see Biancas give her ass a smack\nI need a bunk rock, fresh pair of sucker duckers\nIt's a party, I'm bullshittin' with muh'fuckas\nShadow fly, look at bitches with a crooked eye\nBattle me? I think your favorite rapper'd rather die\nWho you know can spit a flow this clean?\nMy notebooks to tenth grade, I got so many sixteens\nPlease, I got a lot of hard tones\nThat'll fuck up your view of The View like Star Jones\nY'all clones, my style is the original\nHalf you wack rappers just epitomize pitiful\nBut me? spittin' classic is a ritual\nI stopped liking rap when the lying got habitual\nI'm sick of you, the streets turned me to a sentinel\nI'm so not Common, but I still see the bitch in you\n(So guess what) Shit, can't nobody out-rhyme me\nSo Tech, call Trav right now and tell him sign me\n\n[Chorus: Krizz Kaliko]\n(Hey hey)\nWe party and bullshit\nBooze it with floosies (Hey hey)\nAnd that's how we dos it\nNot the Biancas we choosing\nEverybody lose it, listenin' to our music\n(Hey hey)\nWe party and bullshit\nBooze it with floosies (Hey hey)\nAnd that's how we dos it\nNot the Biancas we choosing\nEverybody lose it, listenin' to our music\n\n[Outro: Tech N9ne]\nYeah, Throw your cups in the air if you're drunk like me\nYeah, Tech N9ne, Big Ben, Shadow, X-rated vodka and Sprite, boy", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}