{"songs": [{"title": "Superstar", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Intro]\nHe's a superstar, yeahhh {*2X*}\n(Told y'all!)\nHe's a superstar, yeahhh\n\n[Verse 1: Ghostface Killah]\nSuperstar, blowin smoke at the hookah bar\nThe bullet wound on my neck is a Ruger scar\nPop bottles yo, but not just 'pagne\nYou drink Cristal? Well that's a damn shame\nI down Ketel One, bottles of that Grey Goose\nThat white Hennessy, then I smash the booth\nA real superstar, check out the booty y'all\nRed and white green hair, that's Gucci pah\nLook how the jacket matches loafers it's lookin crazy\nDutches pumped up, plus I live in Macy's\nThis is Theodore, they call me Starkalicious\nCause my tongue game, is a likkle vicious\nI got stupid money, so I'mma keep payin\nI keep the paparazzi, and the fans sayin\n\n[Hook]\nHe's a superstar, yeahhh\nHe's a super, super, super superstar {he is a superstar}\nHe's a super, super, super superstar {ohhhh, he is yeah}\nHe's a super, super, super superstar {oh yes he is a}\nHe's a superstarrrrr yeahhhh\n\n[Verse 2: Ghostface Killah]\nMink coats, rock diamond wristlets\nBankroll so thick I don't need a wishlist\nChain swing down to my torn meniscus\nRed carpet affair, superstar status\nWish Mike was here to tell you I'm the Baddest\nStalked by TMZ, wanted by Oprah\nFollowed everywhere from the Garden to the Copa\nTake some more vanilla bean to the mocha\nToca, Tone be quick fast to poke ya\nThe Ace of Spade of the deck, use your choker\nGlossy, always the center of attraction\nAnd I bring Redman if it's \"Time 4 Sum Aksion\"\nGrimy, consumed on the forest top ten of tree\nBeast of the food chain that's how it's meant to be\n\n[Hook]\n\n[Verse 3: Busta Rhymes]\nAward show skyscraper presence in your memories\nSpotlight forever reflect on my accessories\nExotic with it 'til your vomit be the recipe\nMovin forward ain't nothin at all ahead of me\nLegendary remedy 'til it's medical, get it?\nMagnetic and be the most incredible with it\nMore than legend but riddich, mosh pit lyrically\nGodsent to the point see the cynical image\nBe on the star source, travellin to Venus\nNow you look at me as weird while I morph into a genius\nSometimes it's startlin the way that people see us\nBut the dickride be heavy and be weighin on my penis~!\nFunny how the love be fake but I ain't stressin\nThankful for the love that's genuine appreciate the blessing\nRockstar livin while I'm handlin my biz\nShinin brighter than the sun y'all niggas KNOW JUST WHAT IT IS!\n\n[Hook]", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}