{"songs": [{"title": "Cover Up", "album": "Haywire", "year": "2009-06-18", "lyrics": "[Intro]\nI can tell you’re a real cool girl\nI mean it doesn’t take much to see it\nAnd I know we’ve been talking for a while now\nAnd I can kinda see that you’re starting to catch feelings\nBut I just wanna let you know\nThat I have very, very high expectations\n\n[Verse 1]\nI’m like Romeo, I’m looking for my Juliet\nI’m known for trashing bitches I catch you slippin’ then you’ll be next\nLet me find out you’ fascinated by y’all to jewelry sets\nCars and all that fancy type of shit you’ll be surely wrecked\nI’ll never trust you, don’t run up asking why not\n‘Cause look bitch you got more fucking guy friends than I’ve got\nYa it's true, we share a bond, you’re pretty and the hair is long\nBut I can get over you very quickly when your hair is gone\nIf I fall in love and find some dirt, I conceal it well\nThen pop out the blue to make your life a living hell\nLeaving my heart bruised really isn’t a smart move\n‘Cause that’s how you get your ass pushed out a moving car pool\nI roll a half a mile when agony till your ribs sore\nI won’t give a fuck ‘cause you’re all that I had to live for\nDon’t try to date me if you plannin’ on creeping\nI have a habit of cheatin’ getting some vaginal beatings, shit\n\n[Hook]\nAnd there are souls who cover up and choose to move further (further)\nIf I find that you fucking around I swear to God bitch you gon’ be murdered (murdered)\nDo you wanna die tonight? Sometimes I don’t really know what’s up with you\nBut you already knowing that my love is true, been saving it up just for you\n\n[Verse 2]\nSee I respect you, I expect respect likewise\nI played the dumb guy once, I played the dumb guy twice\nNobody knows my strife, I never chose my life\nThere’s never no highlights in this twisted cold twilight\nIll be damned if you contribute stress to my worries\nMy hearts on its last limb, so it’s destined to hurt me\nMy last girlfriend screwed me and left in a hurry\nAnd ignores all my phone calls just to disturb me\nSo be completely honest, is love what your focus is\nOr should I pull my dick out right now and get it over with?\nIs that what you want? Is that what you need?\nWant me to pound your fucking ass till you bleed\nThe blast a few seeds, up in your coochie\nCome on, you can’t bullshit a bullshitter\nAnd bitches wonder why I rap like a cruel nigga\nI need a woman who’s amazing that can do right\nUntil then I guess that ill be gazing at the moonlight\n\n[Hook]\nAnd there are souls who cover up and choose to move further (further)\nIf I find that you fucking around I swear to God bitch you gon’ be murdered (murdered)\nDo you wanna die tonight? Sometimes I don’t really know what’s up with you\nBut you already knowing that my love is true, been saving it up just for you\n\n[Verse 3]\nYou probably think I’m buzzing, raw, angry and rugged\nAww maybe he’s thuggin’ but that’s how crazy my love is\nI’m a dedicated romance brother whose been played\nWay to many times now I’m resorting to switch blades\nSo if I say I love you, more than likely I mean it\nNext time I write an agreement for stupid trifling reasons\nTo dare to fight and the screaming a better life's what I’m seeking\nHow come bitches now-a-days never try to be decent?\nI never even used to use the word bitch\nAnd every chick I ever called it fucking deserved it, they earned it\nI’m the type of guy your parents want you to marry\nI ain’t no mother fucking mind freak that haunts you who’s scary\nBut when I’m getting fucked over, that all changes\nI get dangerous, my mind turns oh so shameless\nAnd my veins just, pop out my head I’m real anxious\nTo show you the true definition of what pain is, bitch\n\n[Hook]\nAnd there are souls who cover up and choose to move further (further)\nIf I find that you fucking around I swear to God bitch you gon’ be murdered (murdered)\nDo you wanna die tonight? Sometimes I don’t really know what’s up with you\nBut you already knowing that my love is true, been saving it up just for you\nAnd there are souls who cover up and choose to move further (further)\nIf I find that you fucking around I swear to God bitch you gon’ be murdered (murdered)\nDo you wanna die tonight? Sometimes I don’t really know what’s up with you\nBut you already knowing that my love is true, been saving it up just for you", "image": "https://images.genius.com/44b49d0de2559bbc3b7d62a3cabcc0da.1000x1000x1.jpg"}], "artist": "Hopsin"}