{"songs": [{"title": "Let It Lie", "album": "Smallfoot (Original Motion Picture Soundtrack) [Deluxe Edition]", "year": null, "lyrics": "[MIGO (Channing Tatum)]\nUm, where are you takin' me?\n\n[THE STONEKEEPER (Common)]\nAha, so many questions. I think it's about time I give you some answers\n\n[MIGO]\nWow. What is this?\n\n[THE STONEKEEPER]\nYou see, Migo\nThere was a time when Yetis lived beneath the clouds\nWe were alive and we were thriving till we came across a crowd\nOf Smallfoot, that's right, we used to live down there\nBut there were actions we could not forgive down there\nAnd though they used a different nomenclature\nMan, or human, they showed us human nature\nA dangerous species that we approached with wonder\nThey attacked with their spears and their smokin' sticks of thunder\nThey called us Sasquatch, they called us abominable\nThey chased us, pursued us, their persistence indomitable\nWe had no choice but to run and hide\nOtherwise, we surmised we were facin' genocide\nSo we climbed this mountain just to stay alive\nYou see, we knew that up here, Smallfoot cannot survive\nSo it was here the first law was written in stone\nIt was named and proclaimed as a truth to be known\nOur world is an island, it floats on a sea of endless clouds\nThat's how it would be\nAnd then we wrote more laws, more rules to obey\nFor the sake of us all, it was the only way\nTo protect us from all of the human ravages\nHeaped upon us by those human savages\n\n(Now you know, now you know, now you know)\n(Now you know, now you know) And new rules apply\n(Now you know, now you know, now you know)\nSo it's best just to let it lie (Let it lie)\n(Now you know, now you know, now you know)\n(Now you know, now you know) And you can't deny\n(Now you know, now you know, now you know)\nThat it's best just to let it lie (Let it lie)\n\n[MIGO]\nBut my Smallfoot, he's not like that\n\n[THE STONEKEEPER]\nThey're all like that. Tell me, when you found him. Did he greet you with open arms?\nThey don't care about us. They don't care about anything but themselves. Which is why we must do the same if we care about our future\n\n[MIGO]\nWait, we're below the clouds\n\n[THE STONEKEEPER]\nOr so it would seem, but look closer\n\n[MIGO]\nThose aren't clouds, it's steam\n\n[THE STONEKEEPER]\nThe stones are working\n\n[MIGO]\nThe stones?\n\n[THE STONEKEEPER]\nEvery job and every task is pointless as it seems\nAll of it ensures that this important machine\nKeeps turning and turning and spinnin' around\nSo those below don't look up and those above don't look down\nAnd they'll look 'cause even if they hear of these atrocities\nThe only thing stronger than fear is curiosity\n(Now you know, now you know, now you know)\n\n[MIGO]\nWait so, so none of those stones are true, they're all lies?\n(Now you know, now you know, let it lie)\n\n[THE STONEKEEPER]\nGood lies to protect our world\n(Now you know, now you know, now you know)\n\n[MIGO]\nBut they need to know the truth\n\n[THE STONEKEEPER]\nOh, do they?\nYou feel emboldened by your noble quest to find the truth\nI chalk it up to the naive innocence of youth\nSo let me share a secret that you'll learn as you grow older\nWhat's true or not true is in the eye of the beholder\nSo do you wanna prevent our own annihilation? (Yes!)\nThen our only goal should be to control the flow of information\nUnless you wanna see the Smallfoot conquer and pillage (No!)\nThen protect the lie and you protect the village\nLives are at stake, Migo. Your friends, your father, Meechee\nShe's curious and you know what they say: curiosity killed the yak\n\n[MIGO]\nSo what do you want me to do?\n\n[THE STONEKEEPER]\nTell everyone you were lying about the Smallfoot\n\n[MIGO]\nBut they've already seen it, they--they're not gonna believe me\n\n[THE STONEKEEPER]\nYou'll be surprised at what they'll believe\nYou think knowledge is power, Migo?\n(Now you know, now you know, now you know)\n(Now you know, now you know)\nQuestion is\n(Now you know, now you know, now you know)\nWhat are you gonna do with that power?\n(Hmm)", "image": "https://images.genius.com/1e8293bf1ea31f57a9f3a797d1f78f0b.500x500x1.jpg"}], "artist": "Common"}