{"songs": [{"title": "Hustler’s Dream", "album": null, "year": null, "lyrics": "(Intro: Game)\nDre and Vidal\nNiggas play everything live, nigga\nLike Kool & the Gang back in the day\nNigga play it live, nigga\nFuck you niggas know about making beats?\nYou don't know shit\nPussies (Ha ha)\nFuck you ever seen a nigga in his 20's with a guitar, bitch?\n\n(Verse 1: Game)\nMother's only son, so I\nHad to knock a nigga the fuck out on the block if he\nMade my sisters cry\nI was O-Dog in Larenz Tate's dreams\nRed everything niggas know what I mean\nRed rag top and I made the dash pop\nBefore niggas came with stash spots, man\nI was a dope man, dope man\nI tried to tell em' I could never be a felon\nI was too good at sellin' crack, X, speed and heroin\nFiends call me Monroe, cause I used to kill em' down in Marilyn\nPuttin' niggas underground give me a shovel\nHe still alive fuck him, I was on that level\nBack then I ain't believe in God\nIf they heal like they say on TV, why bullets leave a scar?\nRevenge is a feelin, but on my son's life\nWhen I catch the two niggas that shot me I'mma, kill em'\n\n(Hook: Anthony Hamilton)\nDesperate moments I've been waiting all my life (All my life)\nNo mistakes I promise this will be my time (My time)\nI know hustlin' leads us to an early grave\nBut it's the only way, how come niggas dying every day?\n\n(Verse 2: Game)\nI watched the coke price double up\nI was too young to be a cook, so I had to sit back and watch it bubble up\nSittin' in the window seein' gang bangers knuckle up\nWatchin' the wind blow girls' skirts while they double dutch\nI had straight D's I wasn't in much trouble much\nEither you do my homework for me or I'mma fuck you up\nMoms lied for me told her friends I was a nice student\nWould a' had all A's if algebra was Ice Cube\nThere it is, I studied a veteran\nHoping that one day I could be a fucking hip hop legend\nI listened to Nas, Big, Dre, Snoop\nAnd even though Pac hated him, I bumped Jay too\nBought Reasonable Doubt and let it play straight through\nUsed to throw my head back, like Kanye do\nNiggas never thought that I would break through\nIrv Gotti, and P Diddy passed but Jimmy and Dre knew\n\n(Hook: Anthony Hamilton)\nDesperate moments I've been waiting all my life\nNo mistakes I promise this will be my time\nI know hustlin' leads us to an early grave\nBut it's the only way, how come niggas dying every day?\n\n(Bridge: Game and Anthony Hamilton)\nA.H take em' to church\nOur father who art in Heaven\nHallowed be thy\nName\nThy kingdom come thy founding father\nProtect the Game (Yes sir)\nPlease show the way (Yes)\nOpen up the gate\n(Yes)\nFree us from pain (Yes sir)\nBut it's the only way, how come niggas dying every day?\n\n(Verse 3: Game)\nI'm talking to my niggas, All Stars and Timberlands\n(North face is a pin and it's a million thugs marching)\nFor the dearly departed I elevated my knowledge\nThey say that I was name droppin', I was just paying homage\nFor Lil' E and Tiana, I'm sayin' that dear mama help me read between the lines pass periods and\nCommas\nThe million dollar baby young homie tryna' prosper\nAct like you don't see me, you might win a Oscar\nAct like you don't see me, I might just pop ya\nNiggas singing like Sinatra I box like Bernard Hopkins\nLeft jab like Oscar, I'm the golden boy\nYou niggas seen what happened to Roy\nYeah, you niggas seen what happened to\nRoy\nOn my block niggas box we the knockout boys\nSitting in the throne with the doja sparkin', it's my seat and I ain't moving like Rosa Parks\nIma be here\n\n(Hook: Anthony Hamilton)\nDesperate moments I've been waiting all my life\nNo mistakes I promise this will be my time\nI know hustlin' leads us to an early grave\nBut it's the only way, how come niggas dying every day?", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}