{"songs": [{"title": "So Misinformed", "album": "I Wanna Thank Me", "year": "2019-08-16", "lyrics": "[Intro]\nI would like to say to this gentleman and all other people who are not blessed with melanin at this point in time to understand that what has happened in our history is that you have been misinformed as much as we have been misinformed.\nMuch of the information that is brought forth, not only from Doctor Mohammed, but other areas, other scholars, are not available to you as a sister said in your curriculum that you've had for 400 years when you did not allow us to read and write, it was being hidden.\nWhether you, sir, personally did that or not, it was a legacy that was passed onto you.\nAnd I end by saying the Holocaust is simply the greatest atrocity on film.\nOurs was not filmed.\n\n[Chorus: Slick Rick]\n(Get up, stand up) No apology, equality\n(Stand up for your rights) Youth is future, let's move forward\n(Get up, stand up) Healthy mentality helps sanity\n(Stand up for your rights) Melting Pot, help us up, vote or not\n(Get up, stand up) Facts half backwards and inaccurate\n(Stand up for your rights) Tell folks no backin' up, track it up\n(Get up, stand up) Good over evil, deceitful\n(Don't give up the fight) Morals, principles, it's simple, son\n\n[Verse 1: Snoop Dogg & Slick Rick]\nWhat will it take for my peoples to connect together?\nYou know it's black excellence if we compete together\nPicture a photograph of black folks lit together\nIn high definition, in high, I would never\nTurn my back on the block, I got the block on my back\nLike James Brown, boy, I'm proud to be black\nTo all my sisters, Mother Earth has birthed us\nLurchers, it hurts us first, less heard this\nTo all my sisters, ain't no knockin' you back\nPoliticans politickin' with a gown and a cap\nThe house got flavor and I like it like that\nBlack girl power, yeah, I'm rockin' with that\nDoors is gettin' kicked down, statues is gettin' ripped down\nPresidents meetin' overseas just to have a sitdown\n\n[Pre-Chorus: Snoop Dogg]\nThey tryna keep us from runnin' up\nI never tell you to get down, it's all about comin' up\n\n[Chorus: Slick Rick]\n(Get up, stand up) No apology, equality\n(Stand up for your rights) Youth is future, lets move forward\n(Get up, stand up) Healthy mentality helps sanity\n(Stand up for your rights) Melting Pot, help us up, vote or not\n(Get up, stand up) Facts half backwards and inaccurate\n(Stand up for your rights) Tell folks no backin' up, track it up\n(Get up, stand up) Good over evil, deceitful\n(Don't give up the fight) Morals, principles, it's simple, son (Son)\nSo what are you saying?\n\n[Verse 2: Snoop Dogg]\nThe foundation was laid, y'all nation was made\nOff our ancestors' back, back, back in the day\nFour hundred years ago, y'all made us slaves\nAnd you can hear it in the spirit comin' deep from the graves\nLife is a maze\nSmoke so much dope you in a daze\nBut you ain't trippin', you gettin' paid\nWho do you praise? But anyways\nI read a history book, but I ain't learned nothin', dawg\nSo I read the Bible, then the holy Quran\nWent to Jamaica to acquire my knowledge\nSat with some Rastas 'til my game got polished\nThe gangbang extreme with malice\nTrees and degrees like I'm trained for college\n\n[Pre-Chorus: Snoop Dogg]\nThey tryna keep us from runnin' up\nI never tell you to get down, it's all about comin' up\n\n[Chorus: Slick Rick]\n(Get up, stand up) No apology, equality\n(Stand up for your rights) Youth is future, lets move forward\n(Get up, stand up) Healthy mentality helps sanity\n(Stand up for your rights) Melting Pot, help us up, vote or not\n(Get up, stand up) Facts half backwards and inaccurate\n(Stand up for your rights) Tell folks no backin' up, track it up\n(Get up, stand up) Good over evil, deceitful\n(Don't give up the fight) Morals, principles, it's simple, son\n(Get up, stand up) No apology, equality\n(Stand up for your rights) Youth is future, lets move forward\n(Get up, stand up) Healthy mentality helps sanity\n(Stand up for your rights) Melting Pot, help us up, vote or not\n(Get up, stand up) Facts half backwards and inaccurate\n(Stand up for your rights) Tell folks no backin' up, track it up\n(Get up, stand up) Good over evil, deceitful\n(Don't give up the fight) Morals, principles, it's simple, son", "image": "https://images.genius.com/e706b466d23f08adcaee1a620528b010.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}