{"songs": [{"title": "We Out Here", "album": "My Homies Part 2", "year": "2006-03-07", "lyrics": "[Intro]\nGhetto slave, U.T.P\nYa heard me?  Aiyyo Nick, show 'em\n\nEverything was gravy 'til the hurricane popped up\nThen the levees broke and had the whole city stopped up\nThen it got hectic, everybody split up\nBut a lot of us sittin in Texas nigga we out'chea\nDowntown, we out'chea, uptown, we out'chea\nNiggas that stayed home, you think they dead? Out'chea\nHeron City, all bustin heads, out'chea\nNiggas with real charges duckin feds? Yo we out'chea\n\n[Verse One]\nMost likely you saw Eazy in Texas\nTrashback his brass real fast for a Lexus\nThe Southwest side, best to be seen\nTuesday night break his ass shake and sip the lean\nAnd if not, catch us on the Northside, take 610\n59 it's a short ride, holla somethin out'chea\nWhylin in the front with the blunts cause we out'chea\nHopin they don't have to figure out what we bout'chea\n\n[Hook]\n3rd Ward, 4th Ward, 5th Ward - we out'chea\n6th Ward, 7th Ward, 8th Ward - we out'chea\n9th Ward, 10th Ward, 11th Ward - we out'chea\n12th Ward, 13th, 17th - we out'chea\n\n[Verse Two]\nI ran up into Barstow, took the nursing home bus\nThe feds pulled us over but they didn't really fuck with us\nCauseway to I-10, bad roads, Lafeyette\n{??} took a two month rest\nWent from the shorts to the projects, the ones in the hilltop\nI like it in the hood but that wasn't my bus stop\nI made it out to Dallas, mob pimpin, sippin lean\nSaw some niggas from the home team, that I ain't seen\nIn a month or two, fucked up a blunt or two\nBut I left, cause I gotta do, what I gotta do\nE hit me hard as I'm jettin, it was powerful\nNow I'm out of Houston, and Crophead's been doin our producin (yeah)\n\n[Hook]\n\n[Verse Three]\nYeah I'm in Houston but you know that\nNigga like me, old school, new always like a throwback\nAnd when they build it I'mma go back\nFor now I'm out'chea, you ain't seen the FUCK YOU on my do'mat?\nYou read my license plate, mad motherfucker\nSo you know the driver is a bad motherfucker\nSwerved on the A-Town, exit off the {?}\nPlus my homey from the hood done relocated uphill\nAnd he tellin me, how good that the weed is\nThe numbers on the hustle, and how we both can bleed it\nI'm addin it up and it's just like what I needed\nThe sweetest hustle ever, of a hustle if I seen it\n\n[Hook]", "image": "https://images.genius.com/a265e934604ca0815fed6130b5947316.500x500x1.jpg"}], "artist": "Scarface"}