{"songs": [{"title": "The Way You Want It", "album": "Live From Forest City Correctional Facility.", "year": null, "lyrics": "(And that's the way that you want it)\nThis how you want it\nIt's like that\nIt's all good I'll be right back\nThat's how you see it\nThat's what it is\nThis how you feel\nGuess it is what it is\nAfter careful consideration I've concluded tribulations\nMake you great if you're willing to go through it\nThey can hate all they want\nBut in the end whatever god intends to be will be so\nPut your trust in He and not the hearts of men\nWe often question adversity's purpose stressin'\nNot recognizin' the blessin' often missin' the message\nWho'da thought I'd emerge from the ruins and the wreckage\nEven better than I was before the automatic weapons\nThe lesson I took away made my testimony compellin'\nEnough to leave an impression on strugglin' adolescents\nWho nobody invested put forth the effort or took a second\nTo push it to do their best and promote forward progression\nStatistically destined to be arrested\nShot in a second\nThat hopelessness leads to depression\nThey disguise as aggression\nTell the federal felon pressin' to earn his way into heaven\nShow up or show 'em confessions and opportunities present\nPotential is mental your destiny is in your possession\nAmbition and education is first and talent is second\nYou get what you can envision if puttin' me in prison\nMore important than keepin' them out I respect your decision\nAfter the back and forth and you constantly asking for more\nChild support I ask what for and you take me back to court, now\nI'm in a public tug-o-war for dough I struggle for\nI owe money for my sons, Tiny, and nothin' more\nDo much more than average for my sons that's just ignoring facts\nYou can get off ya ass and work you don't wanna be\nF-ckin' poor, that's not quite the issue is it?\nIt's that we don't fuck no more\nThat's 'sposed to be you who buyin' houses pickin' out the decor\nThat's 'sposed to be you in benz's, bentley's, fendi and dior that's\nYour problem just accept it you and I are never more\nAnd forever we never will just try your best to deal\nI rolled around with you for years and I regret it still\nAnd well since you ain't let yourself know\nYou look a mess just let yourself go I guess\nThey say misery love guests, but frankly I'm too blessed\nTo walk around frowning looking all depressed\nWhere your self respect to get yourself in check\nYou disgrace women who work need to put yourself in check\nI kept it to myself just cause I felt it wasn't fair\nBut now I'm pissed to the point I don't care, so there!\n\nChorus", "image": "https://images.genius.com/f8406ae3a67b72d7d81a0472e1d5a513.480x480x1.jpg"}], "artist": "T.I."}