{"songs": [{"title": "Sleeping Beauty", "album": "Everready [The Religion]", "year": "2006-11-07", "lyrics": "[Intro: Krizz Kaliko (backwards) & Tech N9ne]\nSuch a cutie\nSleeping beauty\n\n[Tech N9ne]\nIt was a Saturday night me and my homeboys decided to dip to the movies\nAnd you know us\nAlways on CP time\nSo we enter the theater and we find our seats\nKaliko wanted me to get something from concessions, so I did\nSo I'm waiting in line and I get to the register\nAnd I see the baddest bitch homie (Damn)\nI mean I was like fuck the food what's your name, nationality and age baby\nBut I forgot the first two when she said she was, 17!\nOn the inside I was like, fuck, shit, goddamn it, motherfucker, ya bitch, whore, slut, cunt\nWhen you gonna be 18?\nAnd in the midst of my crisis I heard her say, \"Well I'll be eighteen in a week\"\nAnd I was like, \"Oh yeah?\"\nAnd she said, \"Yeah\"\nMan she was a stallion\nAss like pow\nChest like bang\nLips like ooh\nI had to have her cat\nDeja vu\n\n[Verse 1: Tech N9ne]\nI'm in the movie and I don't give a fuck about it\nI keep thinkin' about the bitch I met at concessions\nReally a cutie I wanna get up in her body\nBut the identity saying she is 1-7\nFuck the movie I'ma go back and spit at her\nThrow rap and shit at her like my name is Tech N9ne bitch\nWhen I said it she went ballistic meaning she was with it\nAnd loving my complex rhyme shit (Yes, yes)\nI had a brilliant idea to get her back at the crib\nAnd I'll give her some of the bad mimosa\nThe crib I really went IKEA got everythizzle\nIf it's comfortable to her then I can hold her\nFor about week then on her b-day\nWe can wheezay\nShe doesn't know that I'm S-I-C-K (Sick)\nAll she know is T-E-C-C-A\nWhen you're through working baby you're gonna go with me kay?\n(Okay, Okay, Okay, O-O-Okay)\n\n[Hook: Krizz Kaliko]\nI want you, sleeping beauty\nI need you, sleeping beauty\nSo young but such a cutie\nI love you, sleeping beauty\n\n[Bridge 1: Tech N9ne & Girl]\nCome right in baby, have a seat (Alright)\nWould you like a drink? (Sure, I'll have one)\nAnd another, and another, and another\n(I don't feel so well)\nAnd then another, and then another, and then another\n(I'm getting dizzy...)\n\n[Verse 2: Tech N9ne]\nVery woozy\nWe up in the Jacuzzi\nBeauty is juicy\nThe liquor must have been a doozy (Yes)\nCause she talking hella loosely\nTrying to seduce me\nBut I ain't fucking no under aged groupie\nBut I wish I was fuckin' and suckin', buckin', crushin' and touchin'\nAnd tuckin' my stuff in the pretty muffin\nBut she started huffin' and puffin' and talkin' 'bout nuthin'\nThe fact that I won't get no lovin' is fuckin' pushin' my buttons\nBitch with your fast mouth\nI want you to pass out\nThen I'ma get your ass out (Yup)\nShit she crashed out\nGotta get her out or she'll be dead soon\nDrug her to the motherfucking bedroom\nHandcuffed her then I turned the music down (Knock, knock, knock)\nThen I heard a pound (Who is it?) (Knock, knock, knock)\nKnock a little more (What the fuck)\nSomebody's knock, knock, knock, knocking at my door yo\n\n[Bridge 2: Tech N9ne & Cop]\nIs there a problem officer?\n(Yeah we got a noise complaint from one of your neighbors, uh you having a party?)\nUh no it's just me here man I'm a musician\n(We know who you are)\nAnd uh I'm scoring a movie that's my projector you hear and the music's already down so\n(Well let's try and keep it down)\nUh, I'll keep her - uh, keep it, keep it down, I'll keep it down\n\n[Hook: Krizz Kaliko]\nI want you, sleeping beauty\nI need you, sleeping beauty\nSo young but such a cutie\nI love you, sleeping beauty\n\n[Verse 3: Tech N9ne]\nHey I can hardly wait\nIt's getting closer to our date\nIt's been a couple of days I had to gag her\nBack and forth to the bathroom I had to drag her (Come on)\nCause the drugs I'm giving her make her stagger\nTrying to feed her food but it's making me want to stab her (Bitch)\nWith the steak knife I tried to feed her steak with (Come on)\nOkay when you starve to death don't say shit (Bitch)\nI'ma set it to the side 'til you're hungry\nI see that your energy's telling me that you want me (She wants me)\nShe said, \"I never knew that you would be the one to be psycho\nWhy you reading to me from the bible (No)\nGet away from me motherfucker I hate you\" (Hate me)\nOn the morning of your b-day I'ma take you (Yes)\nDays go by\nAnd I'm looking in her hazel eyes\nI wanna be her sex slave, know why?\nCause you're beautiful lovely (Yes)\nWant you to trust me (Yes)\nAnd never judge me (Yes)\nNow do you love me?\n\n[Bridge 3: Tech N9ne & Girl]\n(I love you, I really love you)\nOh, fuck\n(I wanna feel you, I wanna touch you)\nOh yes, oh yes\n(Take me out of these cuffs, I wanna hold you)\n\n[Verse 4: Tech N9ne]\nLook at her sexy ass\nBeautiful panties see through like plexiglass\nRip 'em off of her like an animal mesh we clash\nAt the bottom she put her hand up on my Nestea bags\nHeavy kissin' and heavy pushin'\nAnd if this is heaven then I wanna stay\nLord please never take it away\nHappy birthday baby this is how I'm gonna be lovin' ya (Yeah)\nThen she put the steak knife through my jugular (Shit!)\nNow as the blood trickles, my body wiggles\nI'm looking up at my beautiful baby while she giggles (Ha, ha, ha)\nI never thought that it would end this way (Way)\nThis is not how I wanted to spend this day (Day)\nThe webs we weave are so damn tangled (Yes)\nI really guess my baby didn't like my angle (No)\nI lie in a puddle of blood neck mangled (Dead)\nI was done by the hands of an angel\n\n[Outro: Reporter, Man, & Woman]\nIn breaking news\nRapper Tech N9ne was found murdered today at the hands of an eighteen year old girl\nHe is survived by his wife, and three children\nMore details at ten\nMy dear woman! We can't bury this man without prayer!\nThere is nothing to pray for, sir\nHe has entered a much better world than this...\nAt least so you ministers always say, sir", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}