{"songs": [{"title": "Death Of Autotune (Redemption)", "album": null, "year": null, "lyrics": "[Intro]\nREDEMPTION!\nNickle!\nOrtiz what's up, my nigga?\n\n[Verse 1]\nI did Green last night with my comraderies\nI spit a verse that you heard, this my apology\nAt the exact same time this is a fuck you\nSuck my nuts you ungrateful fuck you\nHaha\nAlchemist in the building\nThrowback, feel like I'm rappin' it for the pilgrims\nUh, I'm an animal with the talkin'\nA grammar gargantuan with Satanic arson\nWords that'll exhume Dilla\nBring his body back to life, toss Charles Hamilton in his coffin\nYour man is a liar, he dead wrong\nWrite \"pyromania\" on his headstone, he playin' with fire\nThe shark flow sink ships and eat the survivors\nThe Takeover mentality, Ether saliva\nYou dead, you only trying to do this to a degree\nI am the AIDS, nobody wants to do it with me\nThis is my job as king of my city\nThe Hex Murda, Tricky/?? committee\nI don't know a girl that say \"stop\"\nI drink till I got the kind of buzz that Drake got\nHoldin' the torch, show no remorse\nMy group murder beats and I creep back and I flow over the corpse\nThis a big ass gang\nThe only thing me and T-Pain got in common is a Big Ass Chain\n\n[Verse 2]\nNigga, your brains will be on your lap\nThrow a stone I'mma throw a meteor back\nDon't let media soup you\nNiggas will shoot you\nMy gun makin' my waist look as big as a tutu\nNiggas want it, the less thug\nThe beta drum sound like I'm runnin' with ?uestlove\nAsk niggas do they got any requests?\nBefore I let 'em know they ain't got any respect\nUh, why call Joey a trouble maker?\nIf you ain't callin' me his trouble ender\nDo you know how big my dick is?\nMy bitch say I should start me another gender\nI got muscle, I'm rollin' around muscular\nI'm so cut throat I could grow me another jugular\nNiggas shit face\nCause in my time\nI touch more classics than my nigga Joell did on his mixtape\nUh\nNiggas is weak anyway\nTell Amber Rose she can cheat on me any day\nUh\n3-2-3-6-4-0-2-0-2-1 baby call me\nYou be fuckin' with wack niggas\nA whole crew full of earthy ass rap niggas\nUh, I got a squad full of rap killers\nI'm the living proof that God is a crack dealer\n\n[Verse 3]\nI've been morbid, I'm important\nI talk fly than enforce it while in orbit\nI'm pretty but I've been gorgeous\nBeen on my Ben Gordon\n(Y'all catch that?...never mind)\nThe whole Slaughterhouse will step to you\nWe ain't no motherfuckin' group we a wrecking crew\nDon't worry about it hip hop, we here to rescue you\nWe feel like we the best, fuck all the rest of you\nAnd we'll come and get you, go 'head, spit a bar\nYou got heart until your heart is in a pickle jar\nThe untouchable squad that dares nothing but ??\nYou are fuckin' with gods, don't look fuckin' surprised\nI fuck bitches with jobs, addicted to dick\nAnd cleaning and eating more pussy than Missy Misdemeanor\nI see why your whole hood embarrassed\nYou keep playing the same god damn character, Wood Harris\nMy daughter is an heiress, my son is an heir\nI pray lookin' down, shootin' guns in the air\nUh, put some fuckin' money on it then\nCause he gon' kick it till he got your blood on his shins\nTrigger flows, AR's and K's\nI got it locked down, I got bars for days\nIf you listen and thinkin' a nigga can't go\nYou got an ear like Vince as in Van Gogh\n\nBar Exam 3. Fuck the auto-tune. Except when I'm doin' it...cause when I'm doin' it's cool. When you do it...it's corny", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}