{"songs": [{"title": "Vampire Bats", "album": null, "year": null, "lyrics": "[Intro: Raekwon]\nWhattup gangstas, come on, come on\nThis is teflon right here, poisonous fly shit\nPoltergeist back, add on nigga, live\nWhat's the vertigo? Yo, aiyo, aiyo, aiyo\n\n[Raekwon]\nChilling in the sneaker store, guess who walked in\nAretha, lord, Reebok queen, sneaker broad\nYo what up chick? Pussy dynamic, deeper than Titanic\nFly Hispanic, banded\nHad me mapped out, iceberg down, saw the six\nThen she broke wild, scopin' how the bitch get down\nWhat up, I like that, give 'em regards\nSendin' messages to Gerard, who look like W.D. Faraud\nPeace, how you be love, checkin' my feet like she seen Lugz\nRing gleamin' all on her mug\nWhat up, wise guys, start laughin', pullin' outta pocket Platinum\nHand platinum, I stop laughin'\nRich niggas fuckin' had, figured it out\nI won't fuck with her, warm blood, suck these nuts\nYeah, I'm out, spendin' off in a Benz truck\nValor look, richer than a fuck, what, wavy haircut\nMet me at the light, wildin', made a right\nShorty violent in the boat, half smilin', with a gallon, aight?\nPlus the queen of the tree head, pullin' over like a bean head\nFiendin' like a demon with green dreads\nJumped out, parked it, booth sparked it\nWhere your wifey at? Niggas like you, I spit lightly at\nQuote my little cliche, instant replay\nCould've sworn I saw a nine, had it tucked in her thong\nOff convo, pointed at the condo, Lex let's go\nI could've sworn I kept it real, but I'm a asshole\nHide in the empire, yellow liar took a glass full\nDick now, hotter than a lighter\n\n[Chorus 2X: Raekwon]\nYo, whatever you do kid, just keep it real with yourself\nDon't never ever pass off blue kid\nJust better watch her, fuck around and be a nightmare\n\n[Raekwon]\nYo, rainbow, glossy flossy necklace\nLook perpetuos, ass is fat, butu look treacherous\nYo, where Gloria at? Monster ass restin' in Astoria\nBlack lawyer, she own a blow laundrymat\nYellin', I remember her, in December\nBitches maced me, stoled a half a million outta Macy's\nShort light skin, haircut, hazel eyes\nNasal laced up, raised in caprini greens with Asia\nMetallic blue G.S., dressed just bought a mama E.S\nFuckin'n with some nigga, Louis Lex\nHe a rich nigga, call him a king, H12\nRock a Super Bowl rings, had a mean bilingual\nHer uncle fuck Marsha, fake mobster\nTried to knock, that drinkin' cum bitch, blown an Oscar\nDe La Hoya hands, burn him like boiling water\nIf she dare take food in her mouth, spoon advance\nYellin', hit the mini-bar, Shallah looked laced\nSpillin' Henny on, shorty just drive and throw Jimmy on\nWe rappin', ain't jack shit happen\nStop all this max, homey, back to my WAP, pretend mackin'\nChill, hit the jack for a sec, shorty holdin', wanna give me sex\nShould I just, polly or flex\nYo, tell me more, yo, you heard of I-King\nDrive a white thing, wife in the bing, doing life, a knight king\nYeah, I know the nigga, what's the verdict? So what he perverted?\nLast word I heard, A.C.T. want him murdered\nHesitated, played it, grabbed my dick, shorty playa hated!", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}