{"songs": [{"title": "Untouchable", "album": null, "year": null, "lyrics": "[Verse 1]\nChildish Gambino, yeah, my voice is annoying\nSo I don't talk, I let the streets talk for me\nYeah, these girls crazy, half got children\nI hate their ex-boyfriends, call 'em Scott Pilgrim\nI'm fucking girls I really shouldn't be fucking with\nBut if we get caught, we just hand it off to our publicists\nPlus, I hang with some of their ex boyfriends\nWhat can I say? I make bad choices\nCuldesac dropped, day one, five figures\nFish fry, nigga, fry mine bigger\nStill unsigned, fans saying \"What's the hold out\nWhen every show you've ever done's been sold out?\"\nI always wondered what this Hollywood would do to me\n\"Who's that rapping—Yo, it's Troy from Community!\"\n\"Fuck that man, dude, you lying like a muh'fuck!\nBesides, the beat's real good, but the lyrics suck.\"\nWell I made the beat too, yeah, soak it in\nI'm a phenom, nigga, where the fuck you been?\nPeople say that I should be more humble\nAnd I hope they understand that they don't listen when you mumble\nAnd it only takes a lie to make a dynasty crumble\nThat why I catch feelings and these other dudes fumble\nI'm not playing, this music's something that I care about\nI take your shit to the streets, watch me air it out\nGet the check, deposit the shit at Maxfield\nFeeling myself, I don't even need an ex-pill\n\"I wish he'd do a funny rap, like SNL did.\"\nIf I don't take myself serious, who the fuck else will?\nAnd to the critics with reviews that were more than sour\nIs it strange having jobs I can do tomorrow?\nYou bitches don't like shit, and it's kinda sad\nI like food, sex, clothes, watching Breaking Bad\nI’m something that these cool kids never really had\nThat's why these nerdy kids come find me on the internet\nI wanna be different, I wanna do it good\nNot another actor-turn-rapper in movies 'bout the hood\nNiggas say they want the real, but get mad when they hear the truth\nPlease forgive them, father, for they're not knowing what they do\nI make this music so these younger dudes don't have to choose\nTrying to hate me means you really hate you\n\n[Hook]\nLife goes fast and I'm holding on tight\nI let things go when I'm holding this mic\nAnd it's six in the morn', I've been writing all night\nIf I keep on going, I'm hoping I might be\nUntouchable, untouchable, untouchable\n\n[Verse 2]\nMy dad called saying, \"Son, are you okay?\nI just listened to ‘The Last’ on your mixtape.\"\nDad, I'm fine, you just need to understand\nWhen I'm rapping on a track, that's exactly who I am\nAnd all my smart friends saying, \"I really liked your album, dude\nBut you could be the next Mos Def if you wanted to.\"\nDear friends, I respect your responses\nBut my life is a dream, so I rap unconscious\nI'm sorry guys, I hope I didn't let you down\nI rap what I know, I hope the fans will work it out\nNot conceited, but sick of trying to lay low\nNo drugs, I'm just tryna tell 'Ye \"yo.”\nOnline dudes shouting out that they better than me\nI'm doing three other jobs, bitch, you better be\nCause if you're trying really hard, that's embarrassing\nI won't stop until I'm fucking running everything\nThe more I rap, the more I'm harder to follow\nI get a text from Questlove, I gotta call ‘em tomorrow\nComing harder than other dudes, it's harder to swallow\nThat I'm blowing up; 13 Mission: Apollo\nFuck niggas who doubted me, eat your words, it's a feast\nI used to hear \"Nah's\" all the time like Kelis\nFuck the old Donald Glover, yeah, I'm glad he's deceased\nCause that sad weak being's been replaced with a beast\n\n[Hook]\nLife goes fast and I'm holding on tight\nI let things go when I'm holding this mic\nAnd it's six in the morn', I've been writing all night\nIf I keep on going, I'm hoping I might be\nUntouchable, untouchable, untouchable", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}