{"songs": [{"title": "Letter 2 My Unborn (OG)", "album": null, "year": "1996-03-27", "lyrics": "[Intro: 2Pac]\nTo my unborn child\nThis goes out to my unborn child\nIn case I don't make it\nJust remember daddy love y'all\nDid everything I could do to make a way for me and you\nSo don't worry about what people say about me (To my unborn)\nYou know daddy loves you\n\n[Verse 1: 2Pac]\nNow ever since my birth, I've been cursed since I'm born too wild\nIn case I never get to holler at my unborn child\nMany things learned in prison, blessed and still livin'\nTryna earn every penny that I'm gettin', and reminiscin'\nTo the beginnin' of my mission\nWhen I was conceived and came to be in this position\nMy momma was a Panther loud, single parent but she proud\nWhen she witnessed baby boy rip a crowd\nWent to school, but I dropped out\nAnd left the house 'cause my mama say I'm good for nothing, so I'm out\nSince I only got one life to live\nGod forgive me for my sins, let me make it\nAnd I'll never steal again, or deal again\nMy only friend is my misery\nWantin' revenge for the agony they did to me\nSee my life ain't promised but it's sure gettin' better\nHope you understand my love letter to my unborn child\n\n[Chorus: Natasha Walker & 2Pac]\nA letter to my unborn child\nOh yeah (To my unborn)\nTo my unborn child\nA letter to my unborn child\nOh yeah (To my unborn)\nTo my unborn child\n\n[Verse 2: 2Pac]\nSo complicated to escape fate\nAnd you can never understand 'til we trade places\nTell the world I plead guilty of being anxious\nAin't no way in hell that I could ever be a rapist\nIt's hard to face this, cold world on a good day\nWhen will they let the little kids in the hood play?\nI got shot 5 times but I'm still breathin'\nLivin' proof there's a God, if you need a reason\nCan I believe in my own fate?\nWill I raise my kids in the right or the wrong way?\nDear mama, I'm a man now\nI wanna make it on my own, not a handout\nMake way for a whirlwind prophesized\nI wanna go in peace when I gotta die\nOn these cold streets, ain't no love, no mercy and no friends\nIn case you never see my face again\nTo my unborn child\n\n[Chorus: Natasha Walker & 2Pac]\nA letter to my unborn child\nOh yeah (To my unborn child)\nTo my unborn child\nA letter to my unborn child\nOh yeah (To my unborn child)\n\n[Verse 3: 2Pac]\nDear Lord, can you hear me? Tell me what to say\nTo my unborn seed in case I pass away\nWill my child get to feel love?\nOr we all just cursed to be street thugs?\n'Cause being black hurts\nAnd even worse if you speak first\nLivin' my life as an Outlaw, what could be worse?\n'Cause maybe if I tried to change\nWho I'm I kiddin'? I'm a thug 'til I die I'm a rider, mane\nTouch bases, eat lunch in plush places\nRegular criminal oasis awaits us\nIf there's a ghetto for true thugs, I'll see you there\nAnd I'm sorry for not being there\nJust know your daddy was a soldier, me against the world\nBless the boys and all my little girls\nTo the Lord I'm eternal, restin' in peace\nPlease take care of all my seeds, to my unborn child\n\n[Chorus: Natasha Walker & 2Pac]\nA letter to my unborn child\nOh yeah (To my unborn child)\n(Please take care of all my kids\nTo the unborn child)\nA letter to my unborn child\nOh yeah (To my unborn child)\n\n[Outro: 2Pac]\nThis letter goes out to\nAny seeds that I might not get to see\n'Cause of this lifestyle a nigga live\nJust know what; your daddy loves you\nGot nothin' but love for you\nAnd all I wanted was for you to have a better life than I had\nSo I was out here on a 24 hour, 365 grind\nWhen you get to be my age, you'll understand\nJust know I got love for you\nAnd I'll see you if there's a ghetto from heaven\nThere's a ghetto heaven, I'll be there waiting\nTake care, run wild, but be smart\nFollow the rules of the game\nI know sometimes it's confusin'\nThe rules of the game is gon' get you through it\nAll day, every day\nWatch out for these snakes and fakes\nFriends come a dime a dozen\nBe an individual\nWork hard\nStudy\nGet your mind sharp\nTrust nobody\nMoney Over Bitches\nDon't let these niggas run you out\nDon't let no man put his hands on you\nDon't let no woman use you\nDon't be a trick\nDon't be a player hater\nAnd don't be a wife beater\nGo get your money\nWith all my heart\nYour Pops\n2Pac", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}