{"songs": [{"title": "Pull Them Panties Down", "album": "Get Off the Stage", "year": null, "lyrics": "[Chorus: Kool Ace]\nWanna see the pink now\nGo and pull them panties down\nGotta see the pink now\nGo and pull them panties down\n\n[Too $hort]\nYou made a lot of money since you hit the stage\nSwingin' on the pole so many different ways\nGot hit with a butt cheek and smacked ya back\nYou're a dancer but you shoulda been a acrobat\nI don't even know if it's bald or bushy\nI see them titties out girl but I ain't saw no pussy\nWhat we gotta do to see you get butt naked\nAnd shake it, how much you tryin' to make bitch?\nYou could do it easily, is this how you gon' do me?\nYou're teasin' me, pulled 'em halfway down your booty\nYou need to let them panties meet them ankles\nShow 'em you a bad bitch, fuck these stank hoes\nYou know I go hard all night\nI'm famous, I've been a star all my life\nYou need to take them draws off\nDo it girl, take it all off\n\n[Chorus: Kool Ace]\nWanna see the pink now\nGo and pull them panties down\nGotta see the pink now\nGo and pull them panties down\n\n[Too $hort]\nTake that g-string off, take everything off\nWhy you still wearin' clothes, girl you must be lost\nLet that monkey out, go 'head do your thang\nTake them panties off, and let that pussy hang\nIf we was at my house, I don't play that\nI'd get you undressed, I'd make you stay wet\nI'd burn a lot of rubber, all in your walls\nWhen you fuck with me bitch you gotta drop yo' draws\n\n[Chorus: Kool Ace]\nWanna see the pink now\nGo and pull them panties down\nGotta see the pink now\nGo and pull them panties down\n\n[Too $hort]\nBroke nigga what you doin' here?\nYou ain't even bought nothin' new this year\nIt's some people in here that don't like you\nThey lookin' at you mean, right now they wanna fight you\nYou know you can't win, hangin' with your scary ass friends\nFlossin' at the club but you never had a Benz\nNow these bitches wanna hurt you\nThey say you act gay, you probably wear skirts too\nThat's what they say, they callin' you a faggot\nIt might be a problem, you better call some back-up\nFuck a credit card, can't go to Western Union\nUse the ATM, or just keep it movin'\nAin't nobody chasin' you, not if you ain't runnin'\nBut if you in this club man you gotta spend some money\nHe don't wanna buy a dance but he can't stop lookin'\nNigga ducked and he ran out the club and he shook him, beotch!\n\n[Chorus: Kool Ace]\nWanna see the pink now\nGo and pull them panties down\nGotta see the pink now\nGo and pull them panties down", "image": "https://images.genius.com/bf235bef3026a6f3ce0ab508ff5f91d3.500x500x1.jpg"}], "artist": "Too $hort"}