{"songs": [{"title": "Where Ya At", "album": "No Ceilings 2", "year": "2015-11-26", "lyrics": "[Intro]\nNo Ceilings\n\n[Verse 1]\nHey now, you're an all-star\nBut the bitches you be with, they are sub-par\nBut the bitches you be with, they be cock-blockin'\nHope you put the kids to sleep, baby cock-blockin'\nYou could really get this meat, get this hot sausage\nAnd I'm way too rich to beef, I just buy a body\nAnd I really kick my feet up, and that's not karate\nYeah, I really kick my feet up, let a thot massage 'em, yeah\n\n[Hook]\nWhere ya ass was at when I was with the Hot Boys?\nProbably watchin' Baller Blockin', eatin' popcorn, yeah\nWhere ya ass was at? You was in the drought, boy\nI was probably at the fight bringin' out Floyd\n\n[Verse 2]\nSaid she love me 'cause I'm laid back, she outgoin'\nOpposites attract, pockets fat, like Samoan\nI just told my goons I got it, I just waved 'em off\nI just told Tunechi, \"I got it\" and he said, \"Of course\"\nLose my mind, the only time I'd ever take a loss\nI work too hard for taking off, rrt, I'm taking off\nReally 'bout to see a billion, I'm in arm's reach\nSleep on a hammock in the middle of two palm trees\nMy neighbors can't sleep, all they hearin' is them cars screech\nMy bitch can't sleep, all she hearin' is them car keys\nI'm just sipped out and I'm way too tired to talk, please\nI'm just sipped out and I'm way too tired, I'm yawning\nYeah\n\n[Hook]\nWhere ya ass was at when I was fifteen in a Porsche?\nWhere ya ass be at when we be poppin' all these corks?\nWhere ya ass be at? Know you're prolly with them dorks\nI'm prolly with some bitches that be poppin' pills and snort\n\n[Verse 3]\nDiamonds in my mouth, no Swarovski\nI'm hittin' notes with the pistol, ooh, I'm off-key\nAnd the money coming godspeed\nI'm movin' slow, Lisa Turtle, Lark Voorhies\nFound the treasure chest, inside was a heartbeat\nAnd Katrina had us hustlin' out a RV\nWe had to stash and still balled, Steve Harvey\nWe had to stash and still balled, Steve Harvey\nAnd we set a nigga up like eHarmony\nAnd your bitch plain, nigga, and your car cheap\nAnd we leave your brain right there on your broad cheek\nAnd we leave some stains right there on your offspring\nAnd the purple rain right here in the soft drink\nYeah, the purple rain right here in the soft drink\nAnd to fight the pain, nigga, like a horse tranq\nAnd we don't complain, nigga, and we don't blink\n\n[Bridge]\nAnd he dumb as hell, and I swear his ass don't think\nI think he run with 12 and I think his whole squad linked\nI be so underwhelmed, 'cause I swear his whole style weak\nI'm moving slow as hell but the money coming godspeed\nI'm moving slow as hell but the money coming godspeed\n\n[Verse 4]\nI just told a pussy nigga, \"Call your henchmen, nigga\"\nI just stole on a nigga mid-sentence, nigga\nFiend searching in a haystack for syringes, nigga\nDopeman, got 'em flipping like some ninjas, nigga\nGot 'em tweaking, got 'em lurking, got 'em cringing, nigga\nOoh, that's them symptoms, nigga, I can't prevent 'em, nigga\nSplit a nigga head in two, that's split decision, nigga\nBeen to Hell and back, came back in mint condition, nigga\nFeel like Heaven when them racks return to spender, nigga\nFeel like Heaven's only lacking your attendance, nigga\nFeel like stunting, drop the tops and not them windows, nigga\nToss out your demo, I ain't even like your intro, nigga\nI just went Kimbo with this tempo, un momento, nigga\nYou know my MO, nigga, pit that A-M-M-O, nigga\nBlat\n\n[Outro]\nI ask my ceilings, \"Where ya ass was at?\"\nTo all my Ceilings fans, I'm back\nThey pushed the album back, fuck", "image": "https://images.genius.com/ed7fb7fe9af1d913b520bf5336619560.800x800x1.jpg"}], "artist": "Lil Wayne"}