{"songs": [{"title": "Bodak Yellow Freestyle", "album": null, "year": "2017-09-27", "lyrics": "[Verse]\nThe beast lurkin', ain't no peace, so keep searchin'\nI rain on beats and leave verdicts\nFuck a shark, bitch, I'm a sea urchin\nAnd this is water you wouldn't wanna go feet first in\nYou gotta bite like a croc', I'm Steve Irwin\nI had to fight for my spot, I deserve it\nLook at me rise to the top, I'm emergin'\nI ain't gotta tell you to make a CD purchase\nIt's obvious I body shit, like I got Rocky's fist\nI'm not cocky, just confident\nI'm on everybody's naughty list\nThey said my head's too big, and it probably is\nI'm sorry kids, but I can't be your role model\nToo many pissed MC's we gon' squabble\nHow can Hop be so nice but so hostile?\nHe be on the mic just preaching his own gospel\nYeah, the king of rap I rose to that\nI'm coming at you with shoulder pads\nSo you don't end up with a broken back\nStupid hoe, relax, you smoking crack\nWe swimmin' in loads of cash\nSo why the fuck you complaining?\nI'm moving in on luxury train and\nI don't care about what the fuck you be saying\nMe and Jamie got the shit on lock, yeah, motherfuckers, we made it\nDon't assume I'm Mad and needy\nWhen I cop a new house with a massive TV\nGrowing up never had it easy\nI was sad and needy, can't wait for mom and dad to see me\nYeah, alright, you should be glad I'm eating\nLife's hard and I pass the beating\nYou probably think I own the magic Genie\nWhen I pull up on you niggas in the Lamborghini\nLike boy, I been killin' it since high school\nI slide through, leave the mic bruised\nBack when I couldn't afford nice shoes\nNow they all got they eyes glued\nI'm quite smooth, you shoulda got a fuckin' collab' before the price do\nYou better get up your cash before you try to\nYou stupid niggas ain't mashing with the right crew\nThe following that you had is finna die soon\nI'm 'bout to get me a mansion with a nice view\nWatch out, bought a plane ticket to Thailand\nFor five grand, there's white sand when I land\nThey'll be looking at me like \"Hopsin, my friend! How you make a whole a lot of money like white man?\"\nJust know I does it, this shit, it's nothing\nAsk 'round I buzz to smash down, the sluts and I am erupting\nFar from a reluctant bringing the funds in\nI love this, you dumb bitch\nWho am I? Hope you guessed amazing\nJust embrace it, been underestimated\nLeft for bait, and now I'm 'bout to head to greatness\nI gets down like a nigga weapon raisin'\nNo hesitation with the bad upbringing\nYou can tell from hotels, I'm sexing babes\nAnd I'm the man that's the best of statements\nNow I rest my case, man\nFuck this shit", "image": "https://images.genius.com/65c66f19de5e34a90808b5b2f60e41e6.1000x563x1.jpg"}], "artist": "Hopsin"}