{"songs": [{"title": "Stay Out of Bars", "album": "Words From the Genius", "year": "1991-02-19", "lyrics": "[Intro]\nYo, check this shit out\n\n[Verse 1]\nHangin out in bars can become no joke\nWhen you start to drinkin gin rum bacardi and coke\nOr Martini and Rossi, Asti Spumante\nEven forties being shared throughout the posse\nJukebox is slamming throughout the bright moon\nWith the melody, of a soft Barry White tune\nI sit back, like I got it made in the shade\nHolding my dick as I talk to the barmaid\nExcuse me miss, \"Alright here I come\nMay I help you?\" Yeah, double shot of rum\n\"On the rocks sir?\" Mm-mmm, not at all\nWho the fucks need ice inside of burning alcohol\nI reach in my pockets to tip the whore\nBut I'm clumsy, my change start falling on the floor\nI play macho, and say leave it for the sweeper\nBEEP BEEP BEEP BEEP BEEP my fucking beeper\nI start stumbling to the phone booth\nRevealing all symptoms of drinking ninety proof\nThe phone booth door is closed, the light is on\nThe girlie just dialed nine-seven-zero porn\nShe sit back, with her legs cocked in the air\nWhile her fingers do the walking through her knotty pubic hair\nHer eyes are shut tight, she moans and groan\nI hit the glass, \"Get the fuck off the phone!\"\nShe jumped up and said, \"You just had to be the one\nTo interrupt me when I was having so much fun\"\nI said, \"Hold up, yo, bitch you think it's cute\nTo be perverted let alone a sleazy prostitute\"\nShe said, \"How can you try to disrespect any female\nOr me and my homegirls just because we sell\"\nI said, \"Pussy? That's what you call it?\"\nShe screamed out, \"You're god damn right you alcoholic!\"\nShe said, \"This is a public phone and you do not run it\"\nI said, \"So is your pussy but can I use it when I want it?\"\n\nStay out of bars (2X)\n\n[Verse 2]\nI was in Times Square, loungin hard\nMe and the Prince Rakeem, you know, the God\nWatchin females posin for a flick\nThinking of who would be the first to turn a trick\n\"Yo Genius you see that?\" \"Yeah\" \"So what you think?\"\n\"Let's swing em to the nearest spot to have a drink\"\nI winked at one she said, \"Hi\" in a low pitch\nRakeem started flowing and bagged the other ho bitch\nNow we searchin for a zebra lounge\nTo settle down, right in the heart of midtown\nWent to this place, called the Sting Pit\nGot inside and seen all types of shit\nMen who looked soft but acting wild\nDancing to the beat, Ten City style\nFemales who wore jeans that were tight\nWith faces resembling transvestites\nEveryone in the bar gave my girlies mean looks\nAs if they were fugitive crooks\nThey smiled at me and the God, showin all thirty-two\nThat's when I caught the clue\nAs this red-bone, who thought she looked fly\nRolled up on me, and she said \"Hi\"\nThat one little word fucked up the whole night\nHer voice was deeper, than Barry White\nI jumped up, and boy did I flip\nI pull out a nine and I empty the clip\nThe place was flowin with crazy blood\nA little midtown massacre type flood\nAnd as we stepped off from the scene\nHere's the message I got from Rakeem\nStay out of bars (4X)", "image": "https://images.genius.com/a2hbqfa2xwvnb8hpdpe5u35cz.300x300x1.jpg"}], "artist": "GZA"}