{"songs": [{"title": "I Ain’t Mad At Cha", "album": "All Eyez on Me", "year": "1996-09-15", "lyrics": "[Intro: 2Pac]\nChange, shit\nI guess change is good for any of us\nWhatever it take for any of y'all niggas to get up out the hood\nShit, I'm wit'cha, I ain't mad at cha\nGot nothin' but love for ya, do your thing, boy\nYeah, all the homies that I ain't talk to in a while\nI'ma send this one out for y'all\nKnow what I mean? 'Cause I ain't mad at cha\nHeard y'all tearin' up shit out there\nKickin' up dust, givin' a motherfuck\nYeah, niggas, 'cause I ain't mad at cha\n\n[Verse 1: 2Pac]\nNow we was once two niggas of the same kind\nQuick to holla at a hoochie with the same line\nYou was just a little smaller, but you still rolled\nGot stretched to Y.A. and hit the hood swoll\n'Member when you had a Jheri Curl, didn't quite learn\nOn the block, wit'cha Glock, trippin' off sherm\nCollect calls to the crib, sayin' how you've changed\nOh, you a Muslim now? No more dope game\nHeard you might be comin' home, just got bail\nWanna go to the mosque, don't wanna chase tail\nIt seems I lost my little homie, he's a changed man\nHit the pen and now no sinnin' is the game plan\nWhen I talk about money, all you see is the struggle\nWhen I tell you I'm livin' large, you tell me it's trouble\nCongratulations on the weddin', I hope your wife know\nShe got a playa for life, and that's no bullshittin'\nI know we grew apart, you probably don't remember\nI used to fiend for your sister, but never went up in her\nAnd I can see us after school, we'd bomb\nOn the first motherfucker with the wrong shit on\nNow the whole shit's changed and we don't even kick it\nGot a big money scheme and you ain't even with it\nKnew in my heart you was the same motherfucker that\nGo toe to toe when it's time to roll, you got a brother's back\nAnd I can't even trip, 'cause I'm just laughin' at cha\nYou tryin' hard to maintain, then go ahead\n'Cause I ain't mad at cha\n\n[Chorus: Danny Boy & 2Pac]\nI ain't mad at cha\nI ain't mad at cha\nI ain't mad at cha\n\n[Verse 2: 2Pac]\nWe used to be like distant cousins, fightin', playin' dozens\nWhole neighborhood buzzin', knowin' that we wasn't\nUsed to catch us on the roof or behind the stairs\nI'm gettin' blitzed and I reminisce on all the times we shared\nBesides bumpin' and grindin', wasn't nothin' on our mind\nIn time, we'd learned to live a life of crime\nRewind us back to a time was much too young to know\nI caught a felony, lovin' the way the guns blow\nAnd even though we separated, you said that you'd wait\nDon't give nobody no coochie while I'll be locked up state\nI kiss my mama goodbye and wipe the tears from her lonely eyes\nSaid I'll return but I gotta fight, the fate's arrived\nDon't shed a tear, 'cause Mama, I ain't happy here\nI blew trial, no more smiles for a couple years\nThey got me goin' mad, I'm knockin' busters on they backs\nIn my cell, thinkin', \"Hell, I know one day I'll be back\"\nAs soon as I touch down\nI told my girl I'd be there, so prepare to get fucked down\nThe homies wanna kick it, but I'm just laughin' at cha\n'Cause you's a down-ass bitch and I ain't mad at cha\n\n[Chorus: Danny Boy & 2Pac]\nI ain't mad at cha\nI ain't mad at cha\nI ain't mad at cha\nA true down-ass bitch and I ain't mad at cha\n\n[Verse 3: 2Pac]\nWell, guess who's movin' up? This nigga's ballin' now\nBitches be callin' to get it, hookers keep fallin' down\nHe went from nothin' to lots, ten carats to rock\nWent from a nobody nigga to the big man on the block\nHe's Mr. Local-Celebrity, addicted to movin' ki's\nMost hated by enemies, escape in the luxury\nSee, first you was our nigga, but you made it so the choice is made\nNow we gotta slay you while you faded, in the younger days\nSo full of pain while the weapons blaze\nGettin' so high off that bomb, hopin' we make it to the better days\n'Cause crime pays, and in time, you'll find a rhyme'll blaze\nYou'll feel the fire from the niggas in my younger days\nSo many changed on me, so many tried to plot\nThat I keep a Glock beside my head, when will it stop?\n'Til God return me to my essence\n'Cause even as an adolescent, I refused to be a convalescent\nSo many questions and they ask me if I'm still down\nI moved up out of the ghetto, so I ain't real now?\nThey got so much to say, but I'm just laughin' at cha\nYou niggas just don't know, but I ain't mad at cha\n\n[Chorus: Danny Boy & 2Pac]\nI ain't mad at cha\nI ain't mad at cha\nI ain't mad at cha\nHell nah, I ain't mad at cha\nI ain't mad at cha\nAnd I ain't mad at cha\nI ain't mad at cha\nI ain't mad at cha\nI ain't mad at cha\nI ain't mad at cha", "image": "https://images.rapgenius.com/b2303382dccaf8b1449a4eea84cb9c0b.529x471x1.jpg"}], "artist": "2Pac"}