{"songs": [{"title": "Dirt (Remix)", "album": null, "year": "2014-06-27", "lyrics": "[Prodigy]\nCall it how it is - according to the facts\nIf rap was prison our shit would be the Supermax\nNo sunshine, just dark skies\nNothing but dark thoughts going through my mind\nI got bad blood, mad love only for the team though\nEveryone one of us is the shooter, now where the beef go\nI ain't seen none of these niggas and we out here\nWanna be celebrity thugs a lot of mouth, yeah\nOh my god we could not be fucked with\nReal shit look at our life all in the public\nWe under the microscope they all watching us\nWe have no choice but to keep it trill they sizing us\nAnd if they wasn't god, always pay attention don't he\nI couldn't live with myself being phony\nLook, if life was a game then I guess we winning\nCuz this life we made for ourselves is bitching\n\n[Havoc]\nDidn't want to do it but the voices tug and pullin'\nOn my eardrums something that I knew I shouldn't\nGot me wildin with the ratchet out like shit is legal\nLooking for a victim put 'em in the fetal\nFuck is going on? when it's on I know it's on\nBut shit not really popping and I'm looking for a war\nLooking out my window pointing shit at police\nTo make matters worse I'm sipping on some OE\nShit got me buzzing, I'm already bugging though\nWith mad [???] bottles that I drank about a month ago\nFuck is on my mind? I'm feeling bipolar\nPlus paranoid looking over both shoulders\nI woke up with blood on my hands\nFuck I do this time? now a nigga scared\nFuck, I'll probably get the fucking chair\nGrab my fucking gun, a few clothes son I'm outta here\n\n[Ghostface Killah]\nHey Yo Hav, what's good with ya boy?\nHey yo P, why they fuckin with the baby?\nGot me ready to spaz, son tell him be easy\nFor easy fews, I get'em chunked in the shishkebabs\nI got scars, nigga, I lay bars, lay ..., lay laws\nRoast a nigga like...\nSon, you god damn right I fuck fans, I live on tour\nI raise again to shake, my gun got bling on it\nMove like the Mexican cartel, behead and kingfold\nBrass knuckle your jaw, belt buckle your whore\nTake it back to my stapleton days, I'm quick on the draw\nCocky, my Amex(?) swallows, grip the streets\nI make a bitch shower that ass, before she slides in the sheets\nAllow meat, fresh veggie bowl of sour diesel leaves\nAnd burn shit, 'till I'm back like Christopher Reeve\nFuck the Febreze, I'm stinkin' like that Ol' Dirty Bastard\nThat's that Wu and Mobb shit, don't turn it up, blast it", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}