{"songs": [{"title": "Move On", "album": "Cabin Fever 3", "year": "2015-12-15", "lyrics": "[Produced by Sonny Digital]\n\n[Intro: Kevin Gates]\nMan I ain't encourage my brother to do nothin' fucked up. Man say bitch, yo money retarded, if the bitch don't fuck with her she ain't blessed, bitch\n\n[Pre-Hook: Kevin Gates]\nSaw her on the dance floor poppin'\nHold up, stop talkin' to me, tryna see that ass bop\nShe a big booty star on the dance floor boppin'\nHold up, stop talkin' to me tryna see that ass wobble\n\n[Hook: Wiz Khalifa]\nI'm rich, we're both grown\nGot a male leave your boyfriend at home\nToo high, I'm too gone\nIf she don't ride with the kid, I move on\nI'm just tryna find someone I can leave with\nI'm just tryna find someone I can leave with\n\n[Verse 1: Wiz Khalifa]\nI ain't really playing with you, don't know your name\nI'm just tryna do some things to ya\nTake ya home, let you rep Taylor Gang\nLet you roll up a plane\nLet you bring your homegirls\nLet my boys run a train\nI'mma real ass nigga outta Pittsburgh\nShe don't fuck, I don't deal with her, know ya heard\nGood dick what I slang, I don't even run game\nI've been learned my lane, hoes fuckin' up for fame\nHop in my ride then I go front backside\nTo the side got my money, she love that\nRollin' weed up first class\nTaylor Gang nigga all about his cash\nSmackin' lil mama on the ass\n\n[Hook: Wiz Khalifa]\nI'm rich, we're both grown\nGotta mail me your boyfriend at home\nI'm too high, I'm too gone\nIf she don't ride with the kid, I move on\nI'm just tryna find some I can lean with\nI'm just tryna find someone I can leave with\n\n[Verse 2: Kevin Gates]\nI done threw a ring around my dick and my finger, ya digg?\nI done threw some bling around my grill and my pinky, ya digg?\nYour girl end up leavin' with me, you ain't a freak, where your friend?\nGates slang, I'm gonna throw that meat in her stomach for real\nAudi, Mustang, Dually Truck, I just wrecked the Chevelle\nFlipped it with my wife the other night, give a fuck can you tell?\nKevin it's your pipe, well out in public won't notice she yell\nKept that on the tuck, no recognition, I'm touchin' them bells\nGive them to myself off the truck or they come in the mail\nBig booty somethin' on the dance floor poppin'\nHold up stop talkin' to me tryna see that ass wobble\nBig money pocket, got the lumps\nKevin got dollars\n\n[Hook: Wiz Khalifa]\nI'm rich, we're both grown\nGotta mail me your boyfriend at home\nToo high, I'm too gone\nIf she don't ride with the kid, I move on\nI'm just tryna find some I can lean with\nI'm just tryna find someone I can leave with", "image": "https://images.genius.com/036a1fd3f9480df4542a8206719c891b.600x600x1.jpg"}], "artist": "Wiz Khalifa"}