{"songs": [{"title": "War Pain", "album": "4/4 2", "year": "2016-01-30", "lyrics": "[Produced by Ben Billions]\n\n[Intro: Meek Mill]\nLocation: Toronto; Status: five star hotel, Four Seasons. Them chumps right upstairs, they know not to come down here playin' no real niggas. Mood: I'm still up countin' five hundred thousand cash. Nicki in the bedroom sleep, life is good\n\n[Verse 1: Meek Mill]\nI've been in my cell for a week straight\nLocked down 24, no more Philip's Steak\nDamn, shit's so real it seems fake\nDamn, let me take 'em to the green gate\nWhen we was sellin' white girl\nAudemar shinin' like it need a light bill\nThese niggas dick ride like they don't even like girls\nA hundred thousand for the jet, yeah that's the flight bill\nDamn, cost four bricks to go to the LIV nigga\nWhole squad on some shit, that's how we live nigga\nTwenty-five bad bitches what we did nigga\nThat's fifty different Louboutins bleedin' red nigga\nWhew, I ain't blood and I ain't crippin' neither\nOn the phone with the plug talkin' Justin Bieber\nI made a milly last week and I ain't touch it neither\nStraight cash tryna give 'em straight gas\nCatch you out in Brooklyn, get your chain tookin'\nMy Philly boys'll creep up on you when you ain't lookin'\nWith your lil memes, I be with the real queen\nScreamin' free the real Preme, we be doin' real things\nPull up with a bad bitch, whippin' somethin' real mean\nMarchin' all these fuckin' drums on me like a drill team\nI be with my young niggas, all they know is kill things\nDon't make me make a real scene, uh\nSee an OVO chain, probably take that shit\nSaid dreamin' wasn't enough, we had to chase that shit\nYou ain't write it' nigga, we caught ya, can't erase that shit\nAnd you claimin' you HOV now? Why you state that shit?\nMan I hate that shit, niggas be talkin' out they face\nBut soon as you body somethin' they be singin' like they Drake\nWait, niggas dancin' like they fruitcakes\nHotline Bling don't get no bing up in this new Wraith\nPull up on the plug, swap that bag with the suitcase\nDC4 on the way, that's nigga's due date\nRobbed you in your city and you told\nTory from the 6, you hatin' on him, Lord knows\nCulture vulture, now it's time to pay the tolls\nSoft as the lacrosse team, boy that's word to HOV\nNo reply, word to God I'm on the floor still\nMe and Nicki watchin' the Sixers, I'm closin' more deals\nDreamchasers' double MG, we got the door sealed\nRoc Nation, Atlantic Records, I'm on my fourth deal\nWhen I met you, you was on my dick\nAsked me to hold the DC chain, now you on some shit\nOmelly told me get it back cause he's like \"boy's a bitch\"\nAnd I'm like, let him get it took cause we gon' charge 'em trips\n\n[Interlude: Meek Mill & Omelly]\nFuckboy, huh charge you triple the way this real nigga stamp. Chasers, ahh. Location: Philly; Mood: Glock with 30; Status: triple OG, never been disrespected without retaliation, chump\n\n[Verse 2: Omelly & Meek Mill]\nI've been in the hood for like a year straight\nSippin' dirty, it be hard for me to stand straight\nDamn, it's time to cut the dead weight\nI'm tryna turn my CLS into a red Wraith\nWhen I was sellin' hard crack you was scared straight\nI dropped 9 and bought the Rollie with the red face\nMeek the one that got the mil, the one that got the deal\nI'm still lampin' with the shooters and they poppin' pills\nThese niggas like to rap diss they get popped for real\nIt's time to son these pussy rappers, I'm their pop for real\nI'm the type to fuck your mom cause she's a thot for real\nAnd I ain't got one, my pump playin' shotgun\nQuarterback that Glock, Cam Newton, and you catch a hot one\nAnd for the fam I'll keep shootin' until the cops come\nReload, double back, hold up cuz, I got one\nOfficial only respect official and you are not one\nNo, we are not them, we be on some other shit\nDeep in them trenches, duckin' narcotics and the government\nTracin' the dollar, flippin' that product, tryna double shit\nChewing like it's double mint\nMan, who you niggas fuckin' with?\n\n[Outro: Omelly]\nHah, hey Meek Mill man, I'ma start running down on these niggas too. Real rap, these niggas soft and they frauds, check DC record nigga, we flawless. Any nigga stepped up to the fuckin' plate got rolled over. I ain't just talkin' to be talkin', nigga, check the resume. How many times we got to fuck the city up for you niggas to pay homage. Fuck you niggas talking bout nigga? Slide through 20 deep, I'm talkin' bout 7 Rolls Royces, 3 Maybachs, 20 Rollies, 30 Cubans, 25 bad bitches, 25 Chanel bags, 6 Caddie trucks, jumbo jets. Stop playin' nigga, we came from nothin'", "image": "https://images.genius.com/7e3922db6d86c7ac9e703937f0053ae9.1000x1000x1.jpg"}], "artist": "Meek Mill"}