{"songs": [{"title": "Money On My Mind", "album": "Tha Carter II", "year": "2005-12-06", "lyrics": "[Intro]\nYeah\n(Money on my mind) That's right\n(So money is all I think of) That's right\n(Money on my mind) Bitch, you know\n(So money is all I think of) Bitch, bitch, ayy\n\n[Verse 1]\nStepping out the motherfucking car, they in awe\nI'm looking like a star, bitch, when you see me make a wish\nHolla at your motherfucking boy, J-R\nBirdman my pa, bitch, ball bred, born rich (yeah)\nDear Mr. Toilet, I'm the shit\nGot these other haters pissed, 'cause my toilet paper thick\nI know, but trip and that .40 make a chip\nOut a potato-head wimp, then, like ranch, I dip (gone)\nAnd the hustle is all muscle, just strength\nWhen it comes to that weight I don't struggle, I just lift (one-two)\nI got my hand on the game, yeah I make a grip\nHundred grand in my fist, same on my wrist\nGet ki money from a quarter, blame it on my wrist\nI whip coke like hoes, nigga, I'm a pimp\nLil nigga 'bout to rape the market\nIf we talking 'bout money, baby, now we talking\n\n[Chorus]\nYeah, fuck bitches, fuck bitches, fuck bitches\nGet money, get money, get money\nGet money, fuck bitches\nFuck bitches, get money\nFuck bitches, get money\n\n[Verse 2]\nNigga, get it in a slump, if you know how\nIn the heart of the summer, we need a snow plow\nWhat you know about that? Baby, it's your time\nCoke transactions on the phone, we call it \"blow jobs\"\nToo fast for the feds, too cocky for the cops\nHad to ditch my old bitch, getting sloppy with the pots (bitch!)\nHopping off the boat, meeting Papi at the docks\nHe tell me I'm gaining weight, I tell him I'm getting paid\nMoney Over Bitches, I'm yelling it to the grave\nDeveloped at a young age, go after what pays\nThese Gabbana sunshades block the sun rays\nI drop a car note in the mall on the first date\nI gotta get it even if it's in the worst way\nThat cake, like it's-it's my birthday\nNew Orleans my birthplace, ya heard me?\nWhere money's more important than a person\n\n[Chorus]\nYeah, fuck bitches, fuck bitches, fuck bitches\nGet money, get money, get money\nGet money, fuck bitches\nFuck bitches, get money\nFuck bitches, get money\n\n[Verse 3]\nTwisting up a blunt, thinking 'bout my next dollar\nI'm digging in the game tryna get some money out her\nI'm so vain it's a problem\nThere ain't a stain on these Pradas, I'm just being modest\nGot me a goddess, show her how to divide it\nShe still down and she don't get none of the profit\nWheel around the city, let the tints hide me\n\"That's a cold motherfucker, whoever inside it\"\nForever symbolizing the grind, it don't walk to you\nI make it run like horses do\nGiddy-up, baby, if he got it, then hit him up, baby\nI know it's crazy, but I can't get enough, baby\nI love it, I fucking love it\nI'm a self-made millionaire, fuck the public\nRiding to myself, 'cause I don't fuck with nothing\nPistol on my lap, on the way to the money!\n\n[Chorus]\nYeah, fuck bitches, fuck bitches, fuck bitches\nGet money, get money, get money\nGet money, fuck bitches\nFuck bitches, get money\nFuck bitches, get money", "image": "https://images.genius.com/98c56aa11e01a9c25b7485cc3a25c78f.300x300x1.jpg"}], "artist": "Lil Wayne"}