{"songs": [{"title": "Taking Heads Off", "album": null, "year": null, "lyrics": "[Verse 1]\nRight or wrong, weak or strong, I ask who all can come\nTake place and face number one\nIf you thinking that I'm lip syncing\nYou're mistaken, become awaken\nAs I make and break, but take my time\nTo rhyme, and infiltrate your mind\nWhen it's allowed, I push through the crowd\nBag a girl, then walk out proud\nSome surround me, others crown me\nAnd girls with water, they try to drown me\nBut they not, plus, I'm a good swimmer\nAnd a born winner\nThe most known, who don't postpone\nAnd strip M.C.'s of crown and throne\nHave 'em blown away by a cyclone\nOn the microphone\nYea, the mic, it makes me that type\nI max, relax, plus get hype\nWon't twitch, or switch, but yet I will\nWalk the block, like a cop whose out to kill\nEnemies, in my own territory\nSo watch out for me\nBut could you ever get far from Rakeem Allah?\nHeck, nah, baby pa\nUh-uh... no way Jose\nDon't play, because I'm out to slay\nAny M.C. who gets in my way\nBut today, M.C.'s is D-Day\nThat means doomed, so build a tomb\nAnd wait for the boom\n\n[Interlude]\nI'm taking heads off\nI'm taking heads off\nI'm taking heads off\nSo protect ya neck, kid...\nI'm taking heads off...\n\n[Verse 2]\nNow have you ever, ever, ever, ever, heard a style this clever\nNo, you never, never, never, never, never, never\nI got my act together\nI'm the iller, dealer, blood spiller, the graveyard filler\nWho bless the microphone like no other\nBetter known as a live brother\nI chop those, who try to smoke me\nTook they heads off and used them as trophies\nIt might seem that I'm down right mean, or a killing machine\nBut lyrical broad, and thoughts I be installing\nHave you thinking the sky is falling\nBeat smart and start departing\nKnow now snakes can enter my garden\nI-I-I-I-I don't play that jack, so-so, step back mack\n'Cause I react like a rhyming bomber\nFlow like a knight, in shining armor\nDucks, who wanna beat Rakeem\nPinch yourself and wake from the dream\nI'm too strong, I can't be penetrated\nYou'll be eliminated, on the battlefield, I pity no man\nChop so many heads, you might think I'm Conan\nBut I consider myself to be iller\nI'm more like Jack, the giant killer\nSo quit it, instead of thinking\nThat you can win, 'cause you dead and stinking\nYou're too soft, so break north\nYou just loss... I'm taking heads off\n\n[Outro]\nI'm taking heads off... yo, I'm taking heads off...\nRakeem Allah... is taking heads off...\nKnow what I'm saying? So yo.. just protect ya neck\nKnow what I'm saying? I'm in full effect coming with a sharp sword\nThat's my vocals chords, 'cause Rakeem is the lord\nSo applaud, if you can afford, and keep ya tapes on record\nYeah... and if I may say... I wanna give a shout out to all the Gods\nFunky president Melquan and Shabazz, Unique Ason\nKnow what I'm saying? The Genius of Rap, Shallah Raekwon\nMy man Shaquan, my brother Divine, King Shabazz\nKing Sun and Shaboo, Queen Nefertiti in the place to be\nMy man Jerry G. and grime is in full effect\nCan't forget the Posse of the REC, known as the D.M.D\nWith the God U-G, and my name muthafuckin'\nSuper Doopa Party Looper, Hoopa Hoopa, O.G\nKnow what I'm saying? And whoever else I forgot, forget 'em\nEt cetera, et cetera, no one could be better\nKnow what I'm saying?\nWe got the names in the game and the fame\nWhere like Each B., and Doug Love and Butter and all those others\nBrothers, and so forth, and wiz and the wisdoms is on my shit..", "image": "https://images.genius.com/0050e4b1c52ecca6d63818331b489e2a.683x683x1.jpg"}], "artist": "RZA"}