{"songs": [{"title": "Hey Mama (Remix)", "album": null, "year": null, "lyrics": "[Intro: Kanye West]\nI want everybody to put they hands together for me\nI want to talk about somebody real special tonight (whooooaaaa)\nOk, come on\n\n[Hook: Kanye West]\nHey Mama, ahhhhhhhhhh, I wanna scream so loud for you\nCause I'm so proud of you, let me tell you what I'm about to do (hey Mama)\nI know I act a fool, but I promise you I'm going back to school\nI appreciate what you allowed for me, and I, I just want you to be proud of me (hey Mama)\n\n[Verse 1: Kanye West]\nI wanna tell the whole world about a friend of mine\nThis little light of mine, I'm feelin' let it shine\nI'm feelin' take y'all back to them better times\nI'm feelin' talk about my mama if y'all don't mind (hey Mama)\nI was three years old when you and I move to the Chi\nLate December, harsh winter gave me a cold\nYou fix me up something that was good for my soul\nFamous home chicken soup, can I have another bowl (hey Mama)\nYou work late nights just to keep on the lights\nMommy got me training wheels so I can keep on my bike\nAnd you would give me anything in this world\nMichael Jackson leather and the glove, but didn't give me a curl (hey Mama)\nAnd you never put no man over me, and I LOVE you for that Mommy can't you see?\nSeven years old, caught you with tears in your eyes\nCause a nigga cheatin', tellin' you lies, then I started to cry (hey Mama)\nAs we knelt on the kitchen floor\nI said, \"Mommy, I'ma love you 'til you don't HURT no more!\"\nAnd when I'm older, you ain't gotta WORK no more\nAnd I'ma get you that mansion that we couldn't afford (hey Mama)\nSee your unbreakable, unmistakable, highly capable, lady that's making loot\nA living legend too, just look at what Heaven do, sent us an angel, and I thank you\n\n[Hook: Tre Williams, (Kanye West)]\n(Hey Mama), Oh your son done turned into a man living life\nFrom the lesson straight from the palm of yo' hand (hey Mama)\nAnd I know well that my words - they just ain't strong enough\nIf I had to pay for yo' love, my money ain't long enough!\n\n[Verse 2: Papoose]\nIt's only 60 seconds in a minute, 24 hours in a day\nThe sun rises, the sun sets & goes away\n\"How this day went so fast?\" is what I thought\nOnly 12 months in a year - life is short\nBefore my time is up, you know what I'ma do?\nTake this time out to say, \"I love you\"\nCause right after you finished raisin' all ya kids\nYou turned right around & raised foster kids\nWe was the first ones in the 'hood with bunk beds\nPopped me in my mouth for somethin' I shouldn't said\n& when I caught that case, ya face turned red\nYou picked me up from the precinct - I was a knucklehead\nYou told me when I frowned up my face & pout\n\"I brought you in this world, boy, I'll take you out\"\nDaddy's stressin' you out? You tired of the drama?\nDivorce that fool - I'll marry you, Mama\n\n[Hook x2: Tre Williams, (Kanye West)]\n(Hey Mama), Oh your son done turned into a man living life\nFrom the lesson straight from the palm of yo' hand (hey Mama)\nAnd I know well that my words - they just ain't strong enough\nIf I had to pay for yo' love, my money ain't long enough!", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}