{"songs": [{"title": "One For The Money", "album": "Everythang’s Corrupt", "year": "2018-12-07", "lyrics": "[Intro]\nThey ask me why I'm still in the game\nIs it for the love or for the money?\nAnd if everybody gettin' paid in love, I'm in it for the love\nBut if everybody gettin' paid in money\n\n[Chorus]\nOne for the money\nTwo for the money, uh\nThree for the money\nWhat the fuck is so funny?\nJust 'cause you got the honey, can't get nothin' from me\nWho I look like, the fuckin' Easter Bunny?\n\n[Verse 1]\nRelease the Kraken, yup, and I get it crackin'\nMother fuckers better run when I Enter the Dragon\nWhen I'm stackin', all y'all fuckin' tails'll be waggin'\nStill khakis and Chucks, bitch, you know the fashion\nNever change even though you look so strange\nI'ma keep it one hunnid, you can keep the change\nSome of y'all in the game for sex and drugs\nBut I'm in the game for checks and love, nigga\n\n[Chorus]\nOne for the money (Yeah)\nTwo for the money\nThree for the money\nWhat the fuck is so funny? (Bitch)\nJust 'cause you got the honey, can't get nothin' from me (No)\nWho I look like, the fuckin' Easter Bunny?\n\n[Verse 2]\nYou bitches back up, you niggas act up\nAnd knock down everything that I stack up\nYou better clean up before I re-up\nI'm outta site bitch, Scotty beam me up\nSome niggas hypnotized by the ass and the thighs\nBut pretty eyes won't get you on the Enterprise\nIt's shitty (What?), that God don't like ugly\nIt's a pity that I could give a fuck about pretty, bitch\n\n[Chorus]\nOne for the money\nTwo for the money\nThree for the money\nWhat the fuck is so funny?\nJust 'cause you got the honey, can't get nothin' from me (No)\nWho I look like, the fuckin' Easter Bunny?\n\n[Verse 3]\nBaby, baby, I know what you all about\nTryna get me to pull them dollars out\nFake hair, fake eyes, shit, I say no more\nFake titties, fake ass, what I'm payin' for?\nDid it occur, you look like her?\nAnd after these drinks you all look like a blur (God damn)\nEven Superman lookin' for a bitch tonight\nUnderstand that pussy like Kryptonite\n\n[Chorus]\nOne for the money\nTwo for the money\nThree for the money\nWhat the fuck is so funny?\nJust 'cause you got the honey, can't get nothin' from me\nWho I look like, the fuckin' Easter Bunny?\n\n[Bridge]\nIf ain't about a dollar, I'ma have to holla, get at 'cha\nGo jump in my Impala\nIf ain't about a dollar, I'ma have to holla, get at 'cha\nGo jump in my Impala\n\n[Chorus]\nOne for the money\nTwo for the money\nThree for the money\nWhat the fuck is so funny?\nJust 'cause you got the honey, can't get nothin' from me\nWho I look like, the fuckin' Easter Bunny?", "image": "https://images.genius.com/90eb800a406018bdc1a360ae9db5d64d.1000x1000x1.jpg"}], "artist": "Ice Cube"}