{"songs": [{"title": "Forgive Me", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Verse 1: Proof]\nBarely raised by my dysfunctional fam\nHere I stand as a dysfunctional man\nQuick-tempered, short-fused and pissed at God\nDemons pullin' at my soul 'til it's ripped apart\nSecret's out, Momma: that fire, I started it\nFuck the fireman logic of the closet by the wire shit\nWhat's positive about a father that bust nuts then wussed up\nAnd a momma that don't show her son enough love?\nShit, that's why I run from my first son\nAnd force these chickenhead bitches to get abortions\nI married the Game, my mistress is Fame\nMy girl packed her clothes, she know I ain't gon' change\nGo insane in a world evil as ours\nI done shot at houses, people and cars\nThe deeper the scars, the worse is the history\nGod, you ain't gotta forgive me, just don't forget me, you hear me?\n\n[Chorus: 50 Cent]\nLord, forgive me, for I've sinned\nOver and over again just to stay on top\nI recall memories filled with sin\nOver and over again… and again\n\n[Verse 2: Proof]\nAnd most importantly I'm tryin' to support my seeds\nCan't seem to get away from them courtin' fees\nEmbroidery, on my hood across my heart disorderly\nBreakin' in houses of people who ain't got more than me\nAccordingly, I move in error\nGotta face the fact though, I can't fool this mirror\nNeglected my daughter\nAnd tryin' to blame on how I was brought up\nLike I'm a product of this environment, why ain't I shot up?\nGot up today like, \"Why you let me breathe again?\"\nAnd with each breath I feel death is creepin' in\nThinkin' sinners are winners and I'ma finish last\nMy pen and pad record my life as each minute pass\nPassin' minutes, I shook sin and shook drugs\nI did right by you, but still you took Bugz\nThen caught me in adultery, fought me\nFor not knowin' through the dark streets\nYou walked me, talked to me\n\n[Chorus: 50 Cent]\nLord, forgive me, for I've sinned\nOver and over again just to stay on top\nI recall memories filled with sin\nOver and over again… and again\n\n[Verse 3: Proof]\nIt's the risk that's a rush, so rush my wrists into cuffs\nIt's like a fight for your attention and love\nSpeakin' of Bugz, give me a hint from above\nIf he not, you know I wanna be sent when I'm done\nKid out of wedlock so my lady's frontin'\nI love Em 'cause he gave me somethin'\nA positive anything is better than a negative nothin'\nI was on the edge of death, ready to jump in\nIt's hard when you can't find love anywhere\nAnd just because the reverend listen don't mean he care\nPops on crack with a sufferin' past\nI dream in black and white, the world color me bad\nOther than sad, painful and stressed\nLife is good with the webs that tangle with death\nControl the border, control the score\nI have sinned amongst men and my soul is yours\n\n[Chorus: 50 Cent]\nLord, forgive me, for I've sinned\nOver and over again just to stay on top\nI recall memories filled with sin\nOver and over again… and again\nLord, forgive me, for I've sinned\nOver and over again just to stay on top\nI recall memories filled with sin\nOver and over again… and again", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}