{"songs": [{"title": "Welcome", "album": "The Warm Up", "year": "2009-06-15", "lyrics": "[Intro]\nYeah\nHey\nYeah, hey\nFayettenam, yeah\nBitch\n\n[Verse 1]\nYeah, I'm sipping liquor for the pain, pouring liquor for the slain\nNothing else can do the trick like hard liquor to the brain\nFall victim to the game, all this money we spent\nIn my mind, tryna figure where this 20 G's went\nMaybe I should slow it down, maybe take the pace slow\nSecond thought, I think I need to speed it up and make mo'\nTime to build, Lego, in the Ville, laid low\nCounting days, still waiting on that shit I prayed for\nAm I ungrateful? Want it all so quick\nFeel a vibrate, hold up, I got a call, old bitch\nHow she get my new shit? Swear the city too small\nType of chick won't take her shirt off cause her titties too small\nI could give a damn, girl, lift up that pretty blue bra\nNow I'm in the deep, seeing just how pretty you are\nAnd that kitty go hard\nLord, I'm up in that\nGot the type of kitty cat that make a nigga double back\nType of shit that make a nigga wanna fall in love with that\nAt the door wit a towel on and nothin' under that\nSaying welcome\nHey, yeah\nYeah, welcome\nYeah, yeah\n\n[Verse 2]\nI let these words flow out like water from a spout\nLike rain from the clouds, rush the pain from the crowd\nCause these words go deep from my soul when I speak\nThen the flows hit the souls of all those that I've reached\nIf I die 'fore I wake, hope my songs live on\nWill they miss me when I'm gone and if so, for how long?\nSo much shit is on my brain, try hard to maintain\nSit and analyze my thoughts, at times I wonder if I'm sane\nMan, it's hard to trust friends when the paranoia blends\nWith the marijuana, wonder will this high ever end?\nSwear I'll never smoke again, y'all niggas blow the weed\nLet me take another shot, man, this liquor's all I need\nJust to put me in the zone, so far away from home\nNobody truly know me, got me feelin' so alone\nThey wonder what's on my mind, what's lingerin' in my dome\nI tell 'em ain't nothin' wrong, I deal with it on my own\nI deal with it on my own\n\n[Outro]\nYeah, I deal with it on my own, nigga\nYeah, oh, welcome", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg"}], "artist": "J. Cole"}