{"songs": [{"title": "Flatline Pt. =", "album": "E.A.R.T.H (Educational Avatar Reality Training Habitat)", "year": "2016-04-22", "lyrics": "[Verse 1]\nTesla shit on Edison, food should be your medicine\nStarted dropping elements, shit been crazy ever since\nFood should be your medicine, Tesla shit on Edison\nStarted dropping elements, shit been crazy ever since\nDon't ask me who I'm voting for, Donkey or a Elephant\nI do not have a preference, now miss me with that extra shit\nI am not a pessimist; I'm just too intelligent\nI learned to see the world the way it is and make the best of it\nA leader to a state is like a God to a Reverend\nOne hell of an entrance, even better when I'm exiting\nBrand new [?], Ain't got time for questioning\nShooting through the rhetoric, I think I need an extra clip\nI ain't got a ghostwriter; this is not a reference\nI switch the style up, Eddy Gordo on some Tekken shit\nWhoo!\nEvidence, plus I got the evidence\nMother Earth, eh, what's up bitch? What's your measurements?\nWhat if Donald Trump was really Mexican?\nWhat if a Black Man never was President?\n\n[Hook]\nFlatline\nNavigating the field of landmines\nBlack crime, Black Minds\nThere's no superior bloodline, Yeaup!\n\n[Verse 2]\nFuck award shows, we need justice in the courtroom\nWhen I get to talking real shit, they say \"You bugging dude.\"\nIt's gonna take more than getting some trending on Twitter\nIt's gonna take more than fucking COEXIST bumper stickers!\nThe question, I always hear this question, \"How did you get into the music business, were you let in? Or blessed in?\"\nI'm guessing, I never signed my name in blood or sacrificed my best friend\nI got as far as I could go before I hit a dead end\nSit back and let it set in\nHollywood loves making niggas wear dresses\nThis is where I step in\nAnd I know you don't wanna hear it\nNigga's writing conscious lyrics, just to sell out concert tickets\nNigga's buy or bought a Polo, Polo never sponsor niggas\nTommy never one of the niggas rocking Hilfiger\nNiggas doing charity to be a real nigga, but when the camera's off they don't wanna deal with you\n\n[Interlude: Dr. Sebi & Interviewer ]\nWhen I had cured these people's sickle cell, and lupus, and herpes, and blindness, I was happy! I said \"Now, I can go to all the leaders, I could go to Minister Farrakhan, I could go to Jesse Jackson, I could go to Al Sharpton, I could go to Oprah Winfrey, but what I found out, I was mistaken. I was wrong. They are NOT interested in the healing of any black people\nThat's an explosive claim\nThat is not an explosive statement! That is a reality! There isn't a black leader in America, that is interested in the health of the black race\nYou say that because they refused to interact with you?\nThey are not in the position to respond. If they were, my first case of Aids was cured in 1984. And since then, we've been curing people of lupus and herpes, and cancer and blindness, not ONE black leader ever said: \"Well let us help the brother.\"\n\n[Hook]\nBANDZ!\nFlatline\nFooled us for the last time\nFlatline, Flatline\nThere's no superior bloodline, dead\n\n[Outro]\n(Panting)\n(Beeping)\n(Ding!) Lower Ground Floor\n(Ding!) Ground Floor\n(Footsteps)\n(City Noises)\nPeople asking me, like \"Why Bobby Ray saying all this crazy ass shit? You think he really means it?\" Like this shit ain't crazy, this shit is real, dawg. He's always been rapping real shit\n(Inaudible Voice)\n(Forest Sounds)", "image": "https://images.genius.com/288c59f28a4e9c1559eae1f7558abb79.600x600x1.jpg"}], "artist": "B.o.B"}