{"songs": [{"title": "Watch Your Mouth", "album": "The Wallabee Champ", "year": "2008-03-25", "lyrics": "* samples were not cleared for the official album release\n\n[Raekwon]\nY'know? General, general! Word out...\nYeah...\nAiyyo man.. you poppin fuckers\n(You better watch your motherfuckin mouth)\n\n[Intro: Wu-Tang Clan]\nIt's just rules with beats - you clown niggas can't rule the streets\nWe set shop! Wu-Tang, we rule the East\nTaking over the block!\n\"From the gate now!\"\n(You better watch your motherfuckin mouth)\nAiyyo, it's just rules with beats - you clown niggas can't rule the streets\nWe set shop! Wu-Tang, we rule the East\nTaking over the block, you can't fuck with the block!\n(You better watch your motherfuckin mouth)\n\n[Raekwon]\nAiyyo, I stay funky and piley, blue Excelero\nThey lookin for me, what the fuck you behind me for?\nStressing everything I breathe on\nI'm from the boulevard where niggas get jacked and peed on\nWhatever homey, we more lavish\nI might sneak you in the crib, see my lasers and glasses\nTry to get my come up on\nYo, and when you see me, you know I got my \"come up\" arm on\nCartier called me up, robbery here\nWe got your seed in the back of the Beemer starving\nWe like lion killers, catch me on stage with the gauge\nIn my right hand, grenade and this leather bomber\nI scout money, you know we hungry and talk funny\nCoughing out corner rappers, don't never walk up on me\nI write with only insane Malkovich\nMy troops gave me money to clown with them, fuck it\n(You better watch your motherfuckin mouth)\n\n[Masta Killa]\nMy first gun was a .32, back before uh!\nGraduated to the .38, maybe a nine\nI prefer the fo' five, stay alive\nTechs held the crack gank in '88\n8 oz. straight from Florida, the best temp\nCamouflage vest, repping the set\nWu on the east wing, twenty-ten, sexy bad\nWe up at Spain with that thing thing, my crew strong\nWe take no search for your party dunn, you know how I run\nSpray places, cover faces, beat cases\nA big mouth will get your teeth knocked the fuck out\nKeep a nunchuk, take money, stay ninja\nI injure, any motherfuckin contender\n(You better watch your motherfuckin mouth)\n\n[Method Man]\nHey bitch, your time's up! Go finish them rhymes up\nAll my soldiers is lined up, my corners is crimed up\nNiggas know where to find us, settin the grind up\nPolice checkin them pies up, my rims are shined up\nWu! We on the rise up, crops supplied up\nPlottin niggas demise up, boxed in conduct\nScratch we got 'em sized up, and when the East is in the house\nYou, you, you, you, you...\n(You better watch your motherfuckin mouth)\n\n[Ghostface Killah]\nOn the side of the projects, grey skully, bubble 'Lo goose\nMac 11 tucked in front of the belly\nPrestigious moves, we killin 'em, hoes we drillin 'em\nWe like George Foreman out in the streets, we grillin 'em\nIn the van, .45's and dilly's, ready to slam it\nHouse arrest box is goin off, Tony got grams\nGotta bath tub full of white, lay in it like Sam Montana\nTune 'em out, to blow out, chop 'em like fans\n(You better watch your motherfuckin mouth)\n\n[Inspectah Deck]\nThis is boulevard hard, lounging in your black car\nCamouflage rat guard on \"Stomp the Yard\"\nI-N-S spit monster bars, flip long regards\nMy click dons bitch, y'all are frauds\nI get it in like Tim off the glass\nSlamming my name, I'm like the prez, sending men off to blast\nWhat I spit, make 'em spend all their cash\nI'm so Wu, so new that I ain't ripped off the tags\n(You better watch your motherfuckin mouth)\n\n[U-God]\nRZA done birthed us, some curse on purpose\nI'm the grouch, my mouth is a circus\nBurner plus a good learner, don't need a hood\nAll I need's a good burner, Nat Turner\nSnake rat murderer, all I hear is turf talk\nRack rooms full of goons with bullet wound birthmarks\nFrom the first spark, you heard my response\n(Wu-Tang!) More results talkin 'bout whole crew's mission just lost\n(You better watch your motherfuckin mouth)\n\n[RZA]\nOut the beehive, you dip and you dive\nBut you still can't survive, you can't see past five\nCheck the outlook, this is not in the book\nYou bein dragged across the floor while your 'dro in my hook\nLyrical joust, found all the deal off the books\nSteve Rif gave the nod to Universal, good look\nStill spit poison venom, Red Monkey and Wu dem\nHave any dudes seen the condos? It's all 'em\n(You better watch your motherfuckin mouth)\n\n[GZA]\nPut my +clan in da front+, +reunite+ 'em\nMake 'em all R.S.V.P., if they want it, we don't invite 'em\nNo beef, less talk and more action\nWe parole as a whole, we'll send you back in fractions\nBreak through fanatic, low crates deep in attics\nThe Abbott pulled out a .45, looped with static\nI scrolled through the menu then rolled to the venue\nThe dress code is armor all, put a hole up in him\n(You better watch your motherfuckin mouth)", "image": "https://images.genius.com/68eed7dfdce280f7b3f1cb7f27884d32.824x824x1.png"}], "artist": "Ghostface Killah"}