{"songs": [{"title": "Amazing", "album": "Mystery Team", "year": "2009-01-01", "lyrics": "[Intro]\nMc DJ\nMc DJ\nFuck Yourself!\n\n[Verse 1]\nCool like a summertime pool in the winter\nA nigga on fire, what he have for dinner\nI bring home the bacon, call me breadwinner\nI beat up the tracks so they call me track killer\nIm thee raporilla, I heat like gorillas\nSo if you don't believe me you feel-a\nI gotta get the million dollars\nIf you don't see me holla\nIf you tryin' to get then you swallow\nI'm high as a kite, I feel fantastic\nA girl on my dick so she call me nasty\nI gotta make sure that my dick's in plastic\nOr else I'm gonna end up inside a casket\nWho the fuck's you? They call me Sick Boi\nGot the Andre fever, get like Big Boi\nIf you try to get the kryptonite on me\nYou're gonna have to D-I-E\n\n[Chorus]\nThe nigga is amazing\n(It's Sick Boi, it's back)\nThe nigga is amazing\n(Y'all know who it is)\nThe nigga is amazing\n(Get wildin' like me)\nThe nigga is amazing\nThe nigga is amazing\nThe nigga is amazing\nThe nigga is amazing\nThe nigga is amazing\n\n[Verse 2]\nI put down the pen, no more writin'\nSo when I die they can remember me like the Titans\nCall Michael Chrichton cause I'm like Congo\nIf you don't believe me you can suck on my bongo\nI used to drive a hondo now I'm on the subway\nNow my pocket's thick like that dude from Subway\nYou can have a hyundai, better yet a milli\nI'm not Lil Weezy but my pocket size silly\nMy wrist not chilly, I only sport Clockers\nGot the purple hoody and the purple Gobstoppers\nMy mama used to tell me I was lost like Chaka\nNow I got the yellow truck like my name Tonka\nMy girlfriend ass stay fit like J-Lo\nGirl and my money stay thick like Play Doh\nGot to philosophize my mind like Plato\nWhat'd y'all say though?\n\n[Chorus]\nThe nigga is amazing\n(See I don't play around)\nThe nigga is amazing\n(See when I say I'mma do something)\nThe nigga is amazing\n(I say I do something)\nThe nigga is amazing\nThe nigga is amazing\nThe nigga is amazing\n(Yo do this for real though)\nThe nigga is amazing\n(I'mma try to kick it for real)\nThe nigga is amazing\n\n[Verse 3]\nNigga I'm blazing\nNigga I'm amazing\nHaters on the side line tellin me they hate me\nGirls wanna date me, boys think I'm crazy\nGirls always chase me like they Chasing Amy\nI wanna be the play date, but if you have one\nYou can call me, on my cell phone\nI don't believe it, I don't gotta see it\nAnd if you don't see nothing you can sync up my penis\nWomen are from Venus, men are from Mars\nAnd I'm walking down the street, while you drivin in cars\nCause I want everybody to see my new kicks\nMy hat broke off and my hoodie so sick\nI used to know this chick, she used to be lame\nNow she listen to me, now she usin' her brain\nYo I go to Bellevue cause my flow is insane, man\n\n[Chorus Outro]\nThe nigga is amazing\n(I said stay wildin' like me boi)\nThe nigga is amazing\n(I came back with a vengeance)\nThe nigga is amazing\n(I put down the pen so I could focus again)\nThe nigga is amazing\nFuck Yourself!\n(S'why I don't write shit)\nThe nigga is amazing", "image": "https://images.genius.com/db635fd721539042d4ff0248e0911184.500x500x1.jpg"}], "artist": "Childish Gambino"}