{"songs": [{"title": "Taste Freestyle", "album": null, "year": "2019-09-04", "lyrics": "[Verse]\nFuck them corny niggas, best believe we get it poppin'\nI just gotta talk, I'm clumsy so I'll probably drop it\nGo figure, gettin' money so they try to stop it\nI pull out a knot that's thicker than your father's wallet\nAlways had to work, all my nigga from the projects\nBallin', no alert, nope, we don't do no gossip\nToo much for my shit, bro, I don't do no moshpits\nShe with me, she gettin' flipped like a fuckin' socket\nDoobie in my shirt, 'nother OZ in my pants\nIce on my hands, melt it, help you water plants\nYours never dance, eyes like I'm from Japan\nIn my Benz, gettin' fried like I come from France\nMoney too wide for a rubber band\nRunnin' in, tryna cure the hate that they sufferin'\nFrom underneath the sun, tryn' catch a tan\nTour all summer, now I'm home hittin' [?] again\nGettin' fresh, hundred mil, nuttin' less\nGive me brain, pass the test\nSmell the strain, they impressed\nMa, rest, told me \"Change my address\"\nAlways aim for the neck, if you miss, hit the chest\nI'm well known for showin' them shit they didn't know\nBut if you Snapchatting or Instagramming, you gotta go\nThere ain't no one else like me that's in the game\nLightening in my chain, I'm icy as hockey games\nNeed a real one that don't like me 'cause of the fame\nHold my team down like a fight before the bell ring\nAin't no refund when you cop, so what you payin'?\nAin't no details for the cops so what you sayin'?\nYou went from food to starvation 'cause y'all hatin'\nSee what I got? That's all patience and God's amazing\nSee what I came out of dawg? That should be motivation\nNow all I think about's broad chasing and car racing\nMoney so long, my arm shaking, the foreign banking\nI'm off the shore, flow so hot, I could spar with Satan\nI open doors with my voice so [?] my face is\nRollie mixed race, got a big face\nGotta get cake, brought a big plate\nPrada windbreak, thought I went late\nNow that Benz skate, down the interstate\nHow'd I get great? Not a mistake", "image": "https://images.genius.com/b15a7a3f6cd968108322d49a5fd4ba25.750x750x1.jpg"}], "artist": "Wiz Khalifa"}