{"songs": [{"title": "Make Waves", "album": "Strangeulation", "year": "2014-05-06", "lyrics": "[Intro: Tech N9ne]\nRrrrrrr... Hey... You...\nWhat we gonna do?\nSuit up, boot up, let's go!\n\n[Hook: Tyler Lyon]\nMake way\nI'm coming through you (I'm coming through you)\nThere's nothing you can do (you can do!)\nIt's my day, make waves\nWe crash into you (crash into you)\nYour end is coming soon (coming soon!)\nI'm in your veins, so make waves\n\n[Verse 1: Tech N9ne]\nYeah, ain't nobody ever seen a beast\nI'm a catch a career but it's been the least\nFollow was a very little, I mean petite\nI'ma pull the carpet from under you\nHow it even started ya wonder who\nI'ma show ya what rain and thunder do\nHope ya really ready when they come for you\nNot a human or alien on the planet that can do it like I do it\nYou put a mountain in front of me I go through it\nI pursue it, danger\nNever stoppin' the mangler\nN9na tough with them wranglers\nGive me lip I'ma bang ya\nNever benevolent, you wasn't ever the relevant\nYou thinkin' you 'bout to be but you are outta ya element\nBringin' the hella win then came back in hella mint\nCondition, noticing my new wicked development\nNever let up, ya never get up\nIt'll never be another competitor better than us\nI been on it, ya runnin' late the way Letterman does\nYou thinkin' you reaching' a level that's clever than what?\nI'ma gain it, you don't get the picture then I'ma paint it\nWith pain I came insane, the N9na language\nThinkin' you gonna be up when I have to bring this anguish\nAin't no question - I am truly the strangest!\nI gotta shake it up for a minute\nTecca N9na get the greater percentage\nAnd when I enter whatever I gotta win it\nTry to get me in the corner - ya finished\nA lotta people defeated when I diminish\nWhen I hit you'll need a hell of a dentist\nI got the punch and the power that's intricate\nGot you thinkin' \"How did you get off into this?\"\n\n[Hook: Tyler Lyon]\nMake way\nI'm coming through you (I'm coming through you)\nThere's nothing you can do (you can do!)\nIt's my day, make waves\nWe crash into you (crash into you)\nYour end is coming soon (coming soon!)\nI'm in your veins, so make waves\n\n[Verse 2: Krizz Kaliko]\nIf life's a beach can we go surfing?\nIt never been easy for me besides the birthing\nAnd people they eat, the words I'm serving\nThen we can all feast, on what we think is deserving\nI'm a heart-breaker, wave-maker\nAnd I'ma take a leap nothin' round the Kali baby\nBeen a ball-breaker, gate-maker\nAnd I can stop and out ya mouth if ya gettin' lazy\nI'm a typhoon tsunami, any whatever what just to get the salami\nTry to be quick or we're quick to get ya behind me\nI could belligerent nuttin', nothin' could calm me\nI'ma take the wheel, bust ya grill\nIf it's an emergency bust a seal\nYou can see me make the mill, yes I will\n'Cause I got the skill to kill plus the will\nPut ya lights out, the fight's out\nThe mic is my knife and device and ya iced out\nPull my windpipe out, that or the thing of a singer\nI'ma rip it though they might shout\n'Cause I'm a sore loser\nIf I'm defeated and heated, better be headed right for the door\nAnd I'm a born bruiser\nWhen ya get beated and seated, then I'll be ready to give you more\nI can keep goin' and never stop\nEasy as breathin' to me and if you don't believe me\nPay me attention until I pop\nEager to eat 'em and never need a reason whether\nYou better pick em up when they drop\nSingin' I'm leavin' the speed is unbelievable\nThat you better never give them a shot\nI don't know how to behave, just know how to (make waves)\n\n[Hook: Tyler Lyon]\nMake way\nI'm coming through you (I'm coming through you)\nThere's nothing you can do (you can do!)\nIt's my day, make waves\nWe crash into you (crash into you)\nYour end is coming soon (coming soon!)\nI'm in your veins, so make waves\n\n[Verse 3: Rittz]\nYeah, you seen me make waves when I became Strange\nAnd dominated but you ain't never gave praise\nYou be talkin' shit on Instagram inside a safe place\nWhen I see you and confront you then you try to save face\nAnd vacate, okay kid, I'm about to go grade A\nThere's no name sake but won't gain fans\nThey got my name and nuts hangin' so low they scrape\nI'm still hungry, it's like I'm stuck in the '08 state of mind\nMy mind is so space aged, and don’t get it\nTold critics, go stick it, don’t get yo dome split\nYo whole shit’ll look like Riddick Bowe hit it\nOh shit his bone's stickin' out, I think it's broken\nNow go freakin' dial 911, homie I run run\nMy city we don't play that kiddie shit where I come from\nYou high dum dum? You really think you fight on one?\nYou wanna take my Strange chain and my nine gun drum?\nA future icon son, you just a ho ass bitch\nYou go ass kiss anybody to blow as if\nYou try to be somethin' you're not my shit is dope as is\nYou got some dope ad-libs and that's it\nYour shit is so average, we ain't similar, homie check ya temperature\nYou fuck with me and you will need a medical examiner\nPut hands on rappers ramblin', put handles on ya manager\nThey said I'm from Atlanta, damn it I am not from Canada\nI came in the game and I represented\nJonny Valiant in this bitch, there's no mystery\nThey'll be killin' it, keepin' it independent\nTecca N9na is the leader\nYou need me to jack a hater then say no more, I'ma get 'em (bitch)\nWith Kali Baby they be crazy\nTo try me, they just admire the style that I invented\nMy sophomore album 'bout to come out any minute\nI'm about to make waves\nYuh-uh-yeah, motherfucker", "image": "https://images.genius.com/cf5e2a1829c4ae65735d67583ea29645.500x500x1.jpg"}], "artist": "Tech N9ne"}