{"songs": [{"title": "Done Talkin’", "album": null, "year": null, "lyrics": "[Intro]:\nYeah, I got one problem, that's alcohol, a nigga or a bitch ain't one\n\n[Verse]:\nYeah I'm done talkin, I converse with guns sparkin'\nChop ya whole crew up and put y'all in one coffin\nPull up in somethin awesome\nValet should pay to park it\nA motherless God made me when he created arson\nKeep bustin' until they all gone\nI'm triple w dot murder, log on\nA lot of mouth on these rap niggas a lot of doubt me\nA bunch of lame ass niggas, soundin like Roger Troutman\nYou need to look at my track record I'm spazz happy\nI heard a well known fag just took a jab at me\nYeah you already know what I do to fools\nSo when I see you I ain't gon' be in the Muzik Mood\nGet you stomped good\nTake ya ho and turn her to a overnight celebrity like that nigga that punched Suge\nDon't gotta thank the player\nYou welcome to Detroit\nThe city that you can't compare with the gangsta mayor\nYou wet you ain't the sprayer\nFuck what ya TV say\nThem ain't no real D niggas snitchin on DEA\nThe topic of your discussion is my release date\nBottle after bottle I drink till I can't see straight\nNiggas quit askin me questions about Ca$his\nAs long as he's still signed with my nigga Shady, he's straight\nI ain't got no problem wit him, but I will promise this\nNext nigga throwing my name around I'mma kill him\nI got a lot to spend, spent so much time putting cheese on my enemies\nI forgot to watch my friends\nThought I was already covered until I found out\nMy nigga Tre Little was loyal as R. Kelly's brother\nThey say you talk about rappers whatever you do\nI like to talk about pussy like Devin The Dude\nGetting this shit is fun\nMe you don't expect to run\nAin't gotta respect me, just don't disrespect my gun\nI came in and dude fled from the boxing match\nHe ran like a huge head in a stocking cap\nYou little niggas keep cool\nCause I eat dudes\nWhen I see you shrimp niggas all I do is seafood/see food\nLord, fuck a boss I'mma God\nParked outside a muthafucka's house ain't a homicide\nThem niggas you got in your car say they down to ride\nHis tongue cool, but evidently his Llama tired\nBOP\nY'all can doubt me\nThis long legged clip walking out be the only thing POP about me\nWho could stop me?\nI hit him like I'm Luca Brasi\nSo many bitches on my dick nigga Luke would jock me\nWho the sickest shit to spit?\nIs it me or is it triggers?\nCause you ain't comparing me to any nigga\nAny Wayne, any Jigga we can bang\nAny figure we can bet\nI will slang any nigga you can check\nWho the best?\nNow until any volunteer DJ wanna give me play\nMeantime you can sweat\nI come to your set\nNigga I don't give a fuck\nYou Raisin Bran ass niggas sound shriveled up\nThe price you gotta pay, doin what them dollars say\nHappy Bar Exam 2 bitch, it's a holiday\nThe price you gotta pay, doin what them dollars say\nHappy Bar Exam 2 bitch, it's a holiday", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}