{"songs": [{"title": "Vanity Slaves Part II", "album": null, "year": "2011-02-01", "lyrics": "[Produced by Sounwave]\n\n[Verse 1: Kendrick Lamar]\nI swear you people don't know Kendrick, you don't know him\nBut you say you want some more Kendrick, I'm 'bout to show 'em\nEverything inside this human being, I'm still growing\nI'm a premature baby in this crazy life that we adore\nDoors on the Lamborghini, I want 'em\nCan't afford 'em so I tell the swap meet to clone 'em\nI guess I really am a vanity slave\nI guess my ancestors turning in they graves\nBurning money when I get it, fuck a life savings\nOverdraft bank statements, just to make a statement\nWhen I put this fashion on, I'm a fashion junkie\nPicking cotton in the country, I bought this out the country\nWhips and chains, whips and chains, Jacob know my name\nHe call me Kunta, you my brother, we come from the same modern world\nThat's ya girl? I see she rocking Fendi\nTry this on\nIf it ain't upscale then you may offend me\nCopping everything in sight, ignoring they sacrifice\nAmnesia if I see the black visa in my hand tonight\nI show my dick and then I swipe, that's a punchline\nThey was hot and I wore ice, that's ironic huh?\n\n[Hook: Kendrick Lamar & Gucci Mane]\nWord around town that I'm all about the bitches\nWord around town that I love my 26's\nWord around town that I gotta stay paid\nLord please forgive me I'm a vanity slave\nIt's the Gucci cock and shoot\nFound my swag but lost my roof, (Burr! Burr!)\nLord please forgive me I'm a vanity slave\nSee my Audemar tick, as my Audemar tock\nLord please forgive me I'm a vanity slave\n\n[Verse 2: Kendrick Lamar]\nAw man videos got me wanting hoes\nAppetite for flashing lights, all I can do is pose\nA black male... on Melrose. I should get blackmailed\nBy my people hell rose, Niggas that ain't had shit\nFor 400 years overcompensate by over accessorizing with gear\nMan y'all don't see my vision\nI do it for the love of hip hop and the love of bitches\nAm I a hypocrite cause everyday I'm contradicting\nI think of how I'm living, then I watch \"How I'm Living\" I know this can't be right\nMy conscience tell me to stay righteous\nIt's unlikely to see what I like and say I don't like it\nBiggest dilemma my priorities ignoring me, I wanna move accordingly\nBut baby steps are premature remember?\nI'm flying to the south and I'll be gone 'til November\nTo see my family tree but this a shame I'm yelling, out, timber\n\n[Hook: Kendrick Lamar & Gucci Mane]\nWord around town that I'm all about the bitches\nWord around town that I love my 26's\nWord around town that I gotta stay paid\nLord please forgive me I'm a vanity slave\nIt's the Gucci cock and shoot\nFound my swag but lost my roof, (Burr! Burr!)\nLord please forgive me I'm a vanity slave\nSee my Audemar tick, as my Audemar tock\nLord please forgive me I'm a vanity slave\n\n[Verse 3: Kendrick Lamar]\nCold, oh so cold\nHow ironic he bought it then sold his soul\nIs it masonic for your vice to take it's toll?\nThe remote control is taking control\nLift up the doors\nThat Lamborghini I wanted come with a dumb ass model that in vogue\nI like 'em both, I'll wife 'em both\nTake these motherfucking Jordan's off, put on my loafs\nCause nothing goes bad, everytime I wear (Gucci)\nI'm getting more ass, everytime I wear (Gucci)\nThey told me it's a fad, everytime I wear (Gucci)\nBut should I give a fuck when it bring me more coochie?\nThis a young nigga's pedigree, I pray the lord can better me\nIf not he 'bout to strike me down like this my third felony\nThe voices keep on telling me, Kendrick don't forget about us\nI burned my wardrobe, hoping that I could live without it\n\n[Hook: Kendrick Lamar & Gucci Mane]\nWord around town that I'm all about the bitches\nWord around town that I love my 26's\nWord around town that I gotta stay paid\nLord please forgive me I'm a vanity slave\nIt's the Gucci cock and shoot\nFound my swag but lost my roof, (Burr! Burr!)\nLord please forgive me I'm a vanity slave\nSee my Audemar tick, as my Audemar tock\nLord please forgive me I'm a vanity slave", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}