{"songs": [{"title": "If I Should Die Before I Wake", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Intro: Notorious B.I.G.]\nUhh.. UHH\nYeah..\nUhh.. uhh..\nUh! Yeah.. yeah..\nUhh..\nI'm on..\nFuck em.. yeah, uhh..\nWith my hands gripped, praise the Lord shit\nFuck her, never knew her\nScrew her.. (dump her body, dump her body) sewer\nOur father.. uh-huh..\n\n[Verse 1: The Notorious B.I.G.]\nWhat you expected from his next of kin\nI'm loco bro, but ain't no Mexican\nI got nines in the bedroom, Glocks in the kitchen\nA shotty by the shower if you wanna shoot me while I'm shittin\nUhh, the lesson from the Smith and Wessun is depressin\nNiggas keep stressin, the same motherfuckin question\nHow many shots does it take to make my heart stop\nAnd my body start to shake? If I should die before I wake\n\n[Chorus: The Notorious B.I.G.]\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake\n\n[Verse 2: Black Rob]\nFluck that, snap a nigga shit, smash him with the 5th, watch his body lift\nShut his hottie's lips, bitch screamin, hit her body quick\nGot me like the trifest not knowin how my life is\nMy life is, rap sheet long as the Turnpike\nThe sheistest, hey fella, who bidded with the lifers\nDid it with the Glocks, spit it with your pops, you was in diapers\nLoved me when you came to Rikers\nHated me all in the free cypher, mad you can't be like us\nSome murderers who turn bikers, see Biggie Smalls\nRecruited these snipers, alumni do it just like us\nSome pied pipers, squeezin life out y'all\nIt's all out war, be all wild as all outdoor\nIf a coward got beef, y'all be checkin his palm\nParalyzin, my niggas thorough kid, how bout yours?\nReal quick to screw a nigga then, pop out four\nClean the wipers, hit the party up and, hop out yours\nBitch nigga, whoah\n\n[Chorus: The Notorious B.I.G.]\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake\n\n[Verse 3: Beanie Sigel]\nYo, when you fuckin with Mac, you fuckin with the best\nI'm still going to war with them dusty Tecs\nMan you know how I handle my shit, S.K. can on my shit\nJump out of vans like Hannibal Smith\nMan I spit a thousand rounds, your squad don't need it\nShredders in a riot pump leave you quadriplegic\nWhen I squeeze don't breathe keep it lined and even\nSo when niggas get hit, they be cryin screamin\nLyin bleedin from that iron steamin\nAnd I ain't tryin to hear that bullshit, I ain't mean it\nNiggas start bitchin, when that pistol in they face\nOr I sick two pits to come and get you in your place\nIf I catch you in my shit, I'm wakin my bitch\nHear take this shit, crackin the brick, facin that shit\nTakin two sniffs, grabbing my shit\nBest believe if I get hit, y'all niggas takin some shit\nPicture niggas takin my shit\n\n[Chorus: The Notorious B.I.G.]\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake\n\n[Verse 4: Ice Cube]\nNiggas never thought they'd see Cube and Biggie\nIn the year 2000 all drunk and pissy\nOff whiskey, you can miss me acting gay\nHe's the King of New York, I'm the King of L.A\nDoin it the O.G. way, it's sorta like\nThe Brooklyn Way, it's just the crook in me\nSo this is dedicated to the memory of\nThe Notorious One, the glorious one\nAnd if you go for your gun, I got to go for mine\nCock my nine and seperate your head from your spine\nSo, \"Grab yo' dicks if you love Hip-Hop\" and\nFuck you niggas that shot Big Pop'\nThe conspiracy of this nation for assassination\nOf the young black male in this black Hell\nAnd I can tell, no matter the weather\nThat you and 2Pac got your shit together\nCalifornia Love\n\n[Chorus: The Notorious B.I.G.]\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake\nWith my hands gripped, praise the Lord shit\nOur Father, if I should die before I wake", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}