{"songs": [{"title": "Hip Hop Knowledge", "album": "The Sneak Attack", "year": null, "lyrics": "You know.. life is funny..\nIf you don't repeat the actions of your own success\nYou won't be successful\nYou gotta know your own formula, your own ingredients\nWhat made you, YOU..\n\n1987 I was at the Latin Quarters\nListenin to Afrika Bambaata give the order\nThe call of the order was to avoid the slaughterA\nHe said, \"Record companies ain't got nuttin for ya!\"\nWithout a lawyer, he taught The Infinity Lessons\nIn how hip-hop could be a, many a blessing\nAnd that was great, so in 1988\nThere was no debate, we had to end the hate\nThe name of the game was \"Stop the Violence\"\nAnd unity, knowledge, and self-reliance\nWe - started talkin bout Martin and Malcolm\nHad these ghetto kids goin, \"Huh, what about him?\"\n1989, Professor Griff speaks his mind\nBut his freedom of speech is declined\n1990 came with the West coast\nEast coast, West coast, who is the best coast?\nLookin back now, of COURSE it was bogus\nThe whole argument was where we lost focus\nWe got hopeless; not with the lyrics and music\nBut with hip-hop, and how we used it\nOr abused it, you know how the crew get\n\"You like it cause you choose it\"\n1991, we opened our eyes\nWith Human Education Against Lies, we tried\nTo talk about the state of humanity\nBut all these others rappers got mad at me\nThey called me \"Captain Human\", another message was sent\n\"Self Destruction don't pay the {fuckin} rent\"\nRemember that? Nobody wanted conscious rap\nIt was like - where these ballers at?\nWhere can they call us at? All was wack\nHip-Hop culture was fallin flat and that was that\nSo in 1992, I found my crew\nThey said, \"Yo Kris, what you wanna do?\"\nI said, \"Damn - why they wanna get with me?\nIf I bust they {shit} I'm contradictory\nIf I play the bitch role, they take my shoe\nTell me what the {fuck} am I supposed to do?\"\nSo I did it, don't stop get it get it get it\nAll of a sudden these critics they wanna spit it\n\"Kay Are Ess One is con-tra-dic-to-ry\"\nJust cause I wouldn't let these rappers get with me\n{Fuck} that, {fuck} you and {fuck} your pen\nIf a rapper wanna diss, yo I'd do it again\nBut I'm makin these ends, and I got my friends\nAnd I really don't wanna have to sit in the pen\nSo I go back to the philosopher\n1993 hip-hop is uhh.. wack\nGo back, check the facts\n1994, \"Return of the Boom Bap\"\nIt wasn't all about the loot\nIt was all about Harry Allen Rhythm Cultural Institute\nBlowin up, 1995\nConscious rap is still alive\nBut nobody wanna play it, nobody wanna say it\nNobody okayed it, they'd all rather hate it\n1996 it really don't stop\nWe put together somethin called the Temple of Hip-Hop\nNot just DJin, breakin, graf and lyrics\nBut how hip-hop affects the spirit\n\"Step Into a World,\" that's what I did\n'97 I was raisin my kid\nOr kids, but I, had to go\nCause New York DJ's changed the flows\nTo clothes and hoes, but that wasn't me\nI'll be damned if I dance for the MTV\nSo in 1998 I began to debate\nShould I go now, or should I really wait?\n'99, I moved to L.A. you see\nAnd took a gig with the WB\nStarted studyin philosophy full-time\nTo have a full heart, full body, full mind\nBut you know what the problem is or was?\nDJ's don't raise our kids, cuz\nThey so caught up in the cash and jewels\nHow they gonna really see a hip-hop school?\nHow they gonna really see a hip-hop temple?\nThey don't even wanna play my instrumentals, but\nBig up Dr. Dre, Snoop, Xzibit\nEspecially Xzibit, he was there in a minute\nMic Conception, all of them, said\n\"Yo you need help? I should call them\"\nWhen I was in L.A., I held the crown\nBloods, Crips, they held me down\nI could never forget Mad Lion, killer pride\nWith the gat in the lap in the low-ride\nOh I can't forget, Icy Ice, Lucky Lou\nJulio G, that was the crew\nDavey D, Ingrid, David Connor\nThe list goes on and on, let me tell ya\nFredWreck, and my man Protest\nMuch respect, no less\nTo my spiritual and mental defenders\nBig up to L.A., temple members\nBut in 2000, I seen how I wanted to live\nI wasn't no executive\nSo I picked up the mic and I quit my job\nSaid to Simone I gotta get with God\nShe said, \"Don't worry bout these dollars and quarters\nRecord companies ain't got nuttin for ya.\"\nDamn, she took me back to Bam!\nTook me back to who I am!\nBrought me back to the New York land!\nNow I overstand!..\n\n{interviewer}\nNow KRS-One, now you've been quoted as saying that\nRap is something we do, hip-hop is something you live\n{KRS} Yes!\n{interviewer}\nExplain that to us please\n{KRS-One}\nWell, well, today hip-hop, we are advocating that hip-hop is not\nJust a music, it is an attitude, it is an awareness, it is a way\nTo view the world. So rap music, is something we do, but HIP-HOP\nIs something we live. And we look at hip-hop, in its 9 elements;\nWhich is breaking, emceeing, graffiti art, deejaying, beatboxing\nStreet fashion, street language, street knowledge, and street\nEntrepenurialism - trade and business. And uhh, that's where y'know\nThat's the hip-hop that that that we're about. We come from the uhh\nThe root of, of Kool DJ Herc, who originated hip-hop in the early 70's\nAnd then Afrika Bambaata and Zulu Nation (mmhmm)\nWho instigated something called The Infinity Lessons\nAnd added conciousness to hip-hop, and then Grandmaster Flash\nWith the invention of the mixer, on to Run-D.M.C. and then myself\nAnd uhh, we created the \"Stop the Violence\" movement, you may recall\nA song, \"Self Destruction\" and and and so on. All of this, goes to\nUhh uhh, the idea of LIVING this culture out and taking responsibility\nFor how it looks and and acts in society", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}