{"songs": [{"title": "Generation Lost", "album": "Who The F#*k Is B.o.B?", "year": "2009-09-01", "lyrics": "[Intro]\n(Turbulence. Can you feel? Turbulence) Okay. (Can you feel?)\nI need to spit something real for a second y'all. (Turbulence)\nJust bare with me. Listen. (Can you feel? Turbulence.)\n\n[Verse]\nSkull and crossbones and death bandannas\nA liquor store on every corner in Atlanta\nCops ridin' around tossin' niggas in the slammer\nTell me what's wrong, I could really use some answers\nNow-a-days everybody wants to be a rapper\nAbout two years ago everybody was a trapper\nObviously, money is what everybody's after\n'Cause slavery ain't change; it's a modern day disaster\nNow these are my words from me to you\nEverything you do from your shades to your shoes\nFrom your chains to your coupe came from the tube\nTrust me, I would know, I was raised on it too\nOkay, now just let me get your attention\nI'ma turn the tables so you don't get defensive\nI'ma put my bullshit aside for a second\n'Cause I can't be fake 'cause God won't let me\nI used to wear a grill, because it was the trend\nNot because I liked it, I just wanted to fit in\nThen I got \"Eastside\" tatted on my skin\nAnd I tried to get dreads but my hair was too big\nBut I was lost, I ain't know who I was\nWhat else was there to do besides look like a thug?\nSo in my senior year at Columbia High\nI dropped out of high school when I got signed\nB-dot-O-dot-B was the name\nI ain't like Bobby Ray 'cause I was ashamed\nBut you can call me Bobby Ray from this day forth\nAnd I could give a damn about the fame and fortune\nHonestly, I don't even listen to rap\n'Cause when I turn the radio on, out comes crap\nAnd if you make good music that's okay\nBut on the radio, that they don't play\nIt's easy to see we created a beast\n'Cause everybody wants to hear what they don't need\nAnd now all the rappers got to struggle to give you\nThat bullshit music so they can continue to live\nThe position that I'm in\nIs quite an interesting predicament, I will admit\nBut you can count on me 'cause I'm refusing to give in\n'Cause I'ma give you music 'cause we need it to exist, bitch!\nSo I'ma play my guitar\nRap about aliens and sing about stars\n'Til you understand that's what we are\nSo we ain't got to struggle no more so we don't starve\nI swear to God I love you with every bar\nWe all got problems that need to be solved\nSo while I got the mic I'ma speak my thoughts\nAnd I'ma keep it real till the day I fall\n\n[Coda]\nTurn my music up!", "image": "https://images.genius.com/d8cefe97bbbe251a84c87f853a533f10.500x500x1.jpg"}], "artist": "B.o.B"}