{"songs": [{"title": "Splash Waterfalls (Remix)", "album": null, "year": null, "lyrics": "[Intro: Ludacris] + (Sandy Coffee)\nOhh! Ohh! Ohh! Say it (make love to me)\nOhh! Ohh! Ohh! What?! (fuck, mee!)\nOhh! Ohh! Ohh! Say it (make love to me)\nOhh! Ohh! Ohh! What?! (fuck, mee!)\n\n[Chorus: Ludacris] + (Sandy Coffee) - (*Repeat 2X*)\nI'm about to throw some game they both one & same\nCupid's the one to blame - say it (make love to me)\nI'm about to shed some light, cause each and every night\nYou got to do it right - what?! (fuck, mee!)\n\n[Verse 1: Ludacris] + (Sandy Coffee)\nThey want it nice and slow, kiss them from head to toe\nRelax and let it go - say it (make love to me)\nThey want it now and fast, grabbing and smacking ass\nYou got to make it last - what?! (fuck, mee!)\nTogether holding hands, you out there spending grands\nAnd making family plans - say it (make love to me)\nDon't have to straighten facts, don't want no strings attached\nJust scratches on your BACK - what?! (fuck, mee!)\nEx's ain't acting right, and you so glad to fight\nDinner's by candlelight - say it (make love to me)\nShe got a nigga whipped, down to your fingertips\nTrying that freaky shit - what?! (fuck, mee!)\nTurn on some Babyface, just for your lady's sake\nYou call her babycakes - say it (make love to me)\nKnow how to mack a broad, she's on your sack and balls\nYou call her Jabberjaws - what?! (fuck, mee!)\n\n[Chorus: Ludacris] + (Sandy Coffee)\n\n[Verse 2: Trina]\nOkay, okay, who's Da Baddest Bitch\nBeen rich, been rich, been had this shit\nBig Benz, big house & shit\nThat's right, okay, I've been down with Trick\nOkay, it makes sense to me\nCause if your money ain't right, speak your french to me\nMistreated, don't play with me\nOh, you can say Mrs. - that's okay with me\nYou need a grant just to speak with me\nOkay, are you sure you want to sleep with me?\nOkay, you better peep a show\nCause I done left niggas like you stuck before\nOkay, you can ball with me\nSince you got a hot knock, spend it all with me\nOkay, y'all know what's up\nOkay, uh huh, I ride... shut up!\n\n[Chorus: Ludacris] + (Sandy Coffee)\n\n[Verse 3: Ludacris] + (Sandy Coffee)\nYou want to tell the world, cause she's your favorite girl\nYour diamond and your pearl - say it (make love to me)\nNobody has to know, just keep it on the low\nAnd meet them right at four - what?! (fuck, mee!)\nNothing but fights and fussing, plus there's a lot of cussing\nJust grab a hold of SOMETHING - say it (make love to me)\nY'all do that bad stuff, she like it rammed up\nRopes and HANDCUFFS - what?! (fuck, mee!)\n\n[Chorus: Ludacris] + (Sandy Coffee)", "image": "https://images.genius.com/d211edacb8de02968540124c6801063d.1000x1000x1.jpg"}], "artist": "Ludacris"}