{"songs": [{"title": "PTSD (Ali Tomineek Remix)", "album": null, "year": "2016-08-17", "lyrics": "[Intro: Tech N9ne]\nUh-huh , Yup, O-K. Whatever\nDon't try to talk to me like you know what this is\nYeah, I know I might have symptoms that are familiar to you, but.. I got this\nThanks anyway..\n\n[Hook: Krizz Kaliko]\nDon't let this eat me alive\nI only can see this world from the inside\nAnd I'm holding it inside\nFeel like I can cock it back and let it go\nAnd nothing's making sense\nAnd I have no patience for anything\nSo I'm going on everything\nSomebody get me out of here\n\n[Verse 1: Tech N9ne]\nYou don't see what I see\nSo how the hell you gonna stop these voices\nIn my head, that got me awfully rocky, do you copy?\nTraumatized much, from homicide, what?\nDon't wanna flip, but mama I must be the one that I trust\nI ain't got no friend, I ain't got no grin\nBut I'm macho when I lock, load, and I block foes in\nWhen I stop souls in Iraq, hold, I'ma drop those sins in a box so slim\nInside of my nog' grows grim\nMy hurt, it goes deep\nI serve and go weep\nA verticle leap when you're alert in your sleep\nWas a word of a treatment, somebody murdered more peace\nInside of my third it's so bleak\nDone so much dirt I go leap to chief\n\n[Hook: Krizz Kaliko]\nDon't let this eat me alive\nI only can see this world from the inside\nAnd I'm holding it inside\nFeel like I can cock it back and let it go\nAnd nothing's making sense\nAnd I have no patience for anything\nSo I'm going on everything\nSomebody get me out of here\n\n[Verse 2: Ali Tomineek]\nOkay, I hate to say it, but my brain is aching\nYour thoughts are decisions\nMy noggin's a prison, I can't escape it\nI'm staying anxious anywhere that a stranger's face is\nIt's way too dangerous, I think I'm safer in vacant spaces\nLiving every single day on the edge can really go straight to your head\nTossing and turning, I feel like somebody is lurking, I'm laying awake in the bed\nI'm hot as the furnace\nI'm feeling my body get nervous every time I'm taking a step\nAhh, they want me taking some meds\nAhh, just to take away from the stress\nI just dismiss it\nDon't need to get my fix in just to fix it\nDon't want to risk it cause who knows what this medicine is mixed with\nWe've got different visions\nYou ain't never been in this position\nSo my dispositions dismissive when you sentence opinions\nSomebody please\nStop me from living in my memories\nIt's all I can see\nIt's making me freeze like negative 180 degrees\nIt's not a disease or a disorder\nMy mind's just trying to reorganize\nI'm never too sore to fight\nI'm the warrior type\nLeave them mortified\n\n[Hook: Krizz Kaliko]\nDon't let this eat me alive\nI only can see this world from the inside\nAnd I'm holding it inside\nFeel like I can cock it back and let it go\nAnd nothing's making sense\nAnd I have no patience for anything\nSo I'm going on everything\nSomebody get me out of here", "image": "https://images.genius.com/ea417a62cc4e48aba86c9d2a626c952d.406x373x1.png"}], "artist": "Tech N9ne"}