{"songs": [{"title": "Things We Do", "album": "Forever King", "year": "2009-07-03", "lyrics": "[Intro: 50 Cent]\nI don't wanna hear no complaining\n'Cause you niggas already know how I get man\nYou niggas cannot punk 'round here\nWhat the fuck, you think it's different 'cause it's music?\nNah, man, fuck that, man\n\n[Verse 1: 50 Cent]\nClose your eyes - see the shooters, see the money in the bag\nSee the D's in the unmarked on a nigga ass\nSee 62 on the plate when niggas bag up\nScrape the plate my nigga, everything add up\nI'm hungry, like I been missing a meal\nBack writing like I need me a deal, I'll show you the steel\nIt's a jux, nigga, feel the chill\nUp your spine, I'm a menace for real, I blast to kill\nLeave your brains on the dash and wheel\nMix the kush with the hash and chill, let's talk bread\nThem niggas in the way of the money, let's shoot ahead\nThe rest of them suckers'll scattered, they don't matter\nI'm trying to get my head right, I'm buggy like my head lights\nBig Benz, big friends, bitch get in\nI blow twenty on the chain, ten at the dice game\nWe used to be the same, now we not alike mane, c'mon\n\n[Chorus: Gina Thompson sample (50 Cent)]\nThe thiiiings you dooooooooo...\nMakes meeeeeee keep running to yoooouuuu!\n(Run to me now, baby, come on, run to me now, baby, come on)\nThe thiiiings you dooooooooo...\n(Run to me now, baby, come on, run to me now, baby, come on)\nMakes meeeeeee keep running to yoooouuuu!\n(Run to me now, baby, come on, run to me now, baby, come on)\n\n[Verse 2: 50 Cent]\nI like my bitches fast just like the Porsches\nSwitch gears, riding like 500 horses\nYou're now rocking with the boss of the bosses\nMy wrist glist so sick, I leave a nigga nauseous\nThat's the Hublot, what's that you got?\nI rock that on Monday, you'll have that one day\nFollow my footsteps, you know I move proper\nSo what you got a chopper? Nigga, I got a chopper\nMines ain't got no wheels, what's the deal?\nPropellers propel, I'm on the top of New York\nTop of the food chain, nigga, talking my talk\nSuccess is my addiction, you should take a hit of this {HAHA!}\nI'm down for the friction, you start it I'll finish it\nVictim? Pick 'em - knife work, stick 'em\nChrome Colt, pop 'em - hollow tip, drop 'em\nIt won't be long 'fore you're going dying now, watch 'em\n(Come on! Come on!)\n\n[Chorus: Gina Thompson sample (50 Cent)]\nThe thiiiings you dooooooooo...\nMakes meeeeeee keep running to yoooouuuu!\n(Run to me now, baby, come on, run to me now, baby, come on)\nThe thiiiings you dooooooooo...\n(Run to me now, baby, come on, run to me now, baby, come on)\nMakes meeeeeee keep running to yoooouuuu!\n(Run to me now, baby, come on, run to me now, baby, come on)\n\n[Outro: 50 Cent]\nYeah, after the drought it's the flood\nIt's strategic, man, I planned it\nNow follow my footsteps, you know I move proper\nLet me inspire you, let me make you wanna win\nLet's take it to the top, baby\nI wanna say something to make you hungry\nDon't let nobody fuck up your vibe, man\nComing in with that negative bullshit, we don't wanna hear it\nHow they gon' stop a hustler from hustling?\nMan, 'til next time, 50", "image": "https://images.genius.com/c43e4058469760b042583905a14fbf35.300x300x1.jpg"}], "artist": "50 Cent"}