{"songs": [{"title": "Gangsta Like Me", "album": "Ego Trippin’", "year": "2008-03-07", "lyrics": "[Snoop Dogg]\nDogg back up in this motherfucker\nHoes know how to act up in this motherfucker\nThey I know I make it crack up in this motherfucker\nAll blue Chuck's and my khakis in this motherfucker\nI'm lookin' for a thick one\nPecan brown, she lookin' for the slim one\nLoves to go down, she say she likes the big one\nI need her right now, do you know where I can get one?\nTo give me brain like a genius\nShe love my hair pressed like the cleaners\nAnd got a friend named Trina\nYou see 'em from behind you'll think they Venus and Serena\nHmm, now that's my kinda bitch\nTake your clothes off, damn baby kinda thick\nLove Snoopy blue, yeah I'm that type of Crip\nAnd we was about to dip 'til she hit me with this, trip\n\n[Hook]\nI ain't ever met another gangsta like you\nI ain't really sure but I think I'd like to\nGive you my number to my cellular phone\nPlay my cards right, will you take me home?\n(Girl you will never meet a gangsta like me\nWe can our thing but you can't be wifey\nGo and let your Doggy boy give you a bone\nAt the end of the night I'll take you home)\n\n[Snoop Dogg]\n(Blaow!) I limp with my two step\nGot two friends, we can have group sex\n(Blaow!) Nigga from the 2-1\nTall and skinny and always got blue on\nSay I make cool songs\nMy nasty video made her do porn\nAnd she go real far\nStill can't believe that she's talkin' to a real star\nPop told me real hard\nAnd threw that backshot on me real hard\nRoyal penis is clean, I'm king like the boulevard\nDogg do his thing, got her feelin' like a superstar\nWanna share her feelin's with her friends\nTell her husband that there's another man\nAnd she say that I made her fall in love\nI had to shake her fast like I wasn't when I was\nA pimp from the Beach, gator shoes on my feet\nGot my game from the streets, never been for a freak\nHad the nerve to ask for money when I beat it up\nI looked at the bitch like cut, dat-dat-dat\n\n[Hook]\nI ain't ever met another gangsta like you\nI ain't really sure but I think I'd like to\nGive you my number to my cellular phone\nPlay my cards right, will you take me home?\n(Girl you will never meet a gangsta like me\nWe can our thing but you can't be wifey\nGo and let your Doggy boy give you a bone\nAt the end of the night I'll take you home)\n\n[Snoop Dogg]\nThe homies say cuz don't do it to her\nYou gon' have to always do it to her\nShe be creepin' to your hotel, sayin' that she won't tell\nKnowin' one night won't do for ya\n(Nope) You know I got that gangsta\nMake you wanna tell my mama \"thank ya\"\nThen give me all your paper, everytime I lay ya\nSnoop Dogg, playa-playa\nI'm always with a bad bitch\nYou could say I got a bad bitch habit\nSee a bad bitch, is like a fat blunt\nI got one but you know I got to grab it\nSo lil' mama what's happenin'?\nLet me know if you're tryin' to get it crackin'\nWanna chill, when you down for the smashin'?\nMs. American Gangsta, Mr. Blue Magic\n\n[Hook] x2\nI ain't ever met another gangsta like you\nI ain't really sure but I think I'd like to\nGive you my number to my cellular phone\nPlay my cards right, will you take me home?\n(Girl you will never meet a gangsta like me\nWe can our thing but you can't be wifey\nGo and let your Doggy boy give you a bone\nAt the end of the night I'll take you home)", "image": "https://images.genius.com/fd5ace5214e5da1f374653720da7d1c1.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}