{"songs": [{"title": "BET Rapcity Freestyle", "album": null, "year": null, "lyrics": "[Verse 1: Big Tigger]\nAight\nRap City Tha Bassment, Big Tig', EQ, Method Man hey\nMethod Man hey\nIt's going down, check it out one time\nOff the top I guarantee there's no equal\nHis new album in stores - Tical 0, man, The Prequel\nYou know how we do when me and my crew bang\nBeen rapping this kid, since he was down with Wu-Tang\nBack in the days, into the chamber 36\nBig Tig' putting it down in dirty mix, provided by EQ\nTest me and my crew, guarantee you lose\nMan your whole crew snoozed\nMeth, Tical, standing behind me right now\nYou know how we do, we keep it moving with freestyle\nI'ma step to the right, you blow the spotlight\nDynamite, hey man come on and make it right\n\n[Verse 2: Method Man]\nYeah, Mr. Meth AKA John John phenomenon\nAKA Alicia Keys boyfriend in the video, here we go\nYo, yo, yo, oh shit lo and behold\nRza and Meth got another ninja scroll\nMan I injure foes, send chills down their spines\nLike I'm December cold, never bend or fold\nLike a wallet. Can't call it, can't pretend to know\nWhack shit, turn my back on it like a friend that stole\nBeen in the game ten years, I got ten to go\nIt's the prince and the dark knight let's begin day-O\nCall me mister low maintenance\nTell them ho's I'm like a doctor that lost his license\nI got no patients, I got time for wasting\nIf you ain't fam you ain't relating\nThese hating hot dog rappers is baking\nWithout love, like a stoner without bud\nYour ass is as flat as a soda without suds\nWho got the nerve to think that Meth can't rhyme\nPut a nine to your skull and get that out your mind, mind\nYes! Uh oh! Like Lumi Dee\nIf Meth ain't that shit by now I'm soon to be\nWhen I choke hold mics I don't give'em room to breathe\nI'm just doing me, but girl if you're fine I'll do you free\nBy now if you don't know who it be, don't make me tell\nJust know I killer Mike like that kid from ATL\nIf you fail to plan, baby plan to fail\nSee my game ugly ... like Sam Cassel\nI'm so funky I can't even stand the smell\nCome on, life's a drag, roll it up and inhale\nDon't get comfy, I cramp your style like a monthly\nEven Demi Moore need more than Ashton Kutcher to punk me\nMy 4-5 bars, just one shot'll clear the block\nLike it's time for 106 & Park\nStaten Island dropping your ass, we mean business\nMy gun'll put a shot in your ass\nLike free clinics", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}