{"songs": [{"title": "Brooklyn Zoo II (Tiger Crane)", "album": null, "year": null, "lyrics": "Intro:\n\nOne two, one two -- you taping this?\nAll types of shit yo let that shit ride\nWord to mother, turn up the microphone!\nGet all that good shit, get all that good shit (one two, one two)\nOne two, one two, one two... one two\nNow niggas know\nSsssshhhit, yo yo check this out, check this joint\nThis is strictly for the radio, yo\nI just want all y'all to know\nThe reason why I curse is because my momma and my daddy\nThey grew up cursin\nSo please respect my style, please!\n\nVerse One: Ol Dirty Bastard\nI'll grab the mic and now I damage you, cut your whole stamin-u\nOhh, sssshit, nahh\nI'll grab the mic and now I damage ya, cut your whole stamina\nHere comes the medical examinuh\nOne verse then you out for the count\nBring the ammonia make sure he sniffs... the right amount\nYa yo, I'm sorry, un-gah-e-gas-e-ya\n\nI'll grab and the mic and now I damage you, cut your whole stamiNUH\nHere comes the medical examiNUH\nOne verse then you're out for the count\nBring the ammonia, make sure he sniffs the right amount\nWake you up and then I ask you\nHow do you intend this --\nCompetition to get an asssss kickin sooooo tremendous, RARRH!\nYou shouldn't bother this\nLeave me alone like a son he'll be fatherless!\nI got the asiatic flow mixed with disco\nRoll up on the scene like the Count of Monte Crisco\nAnd MC's start to vanish\nI rolled up on a jet black kid the nigga started speakin spanish\nYo! You wasn't from Panama\nI asked you how you get so fuckin dark, you said \"suntanima\"!\nHe responded so fast, you made me laugh\nHa-ha-ha, HARARRRH scared-his ass!\nKick the hundred strongest rhymes\nThen I brought out the punk in him\nRoll up with the strong five deadly venoms\nTold HIM! Enter the Wu-Tang!\nWitness the Shaolin slang, that crush any shit you bring\nI watch your ass take a big fall, why?!\nMy Main Source, is like a friendly game of stickball\nAnd as you step up to bat man, I play the Riddler\nYou try to do me for my nigga I'll change to Hitler\nI'll go out like Nazi, wish your fuckin ass stayed\nHome and play Yahtzee!\nOr watchin Happy Days sweatin Potsie\nWith Ralph, and Richie Cunningham, Joni and Chachi\n\n(Yo Unique, yo kid\nCheck this shit out! Yo, yo)\n\nVerse Two: Ghostface Killer\nNinety-five niggas is wasted\nKeystone capered, and Wu kept the rap fiends basted\nFoamin out the mouthpiece, heads blown like geese\nMurderous police, I do shows and perform in Grease\nIt's not magic, gaming is the gadget\nWorld classic big national high attracts dear graphics\nLampin in my own zone, my physical show\nInhale bones Tony Stark, for the diamond in Rome\nHe's convincin, labelled one man rap convention\nThe nigga that'll gun down, eighty frenchmen\nLead vocalist, music specialist, rap arsonist\nI deal with sharpness plus spark the hardest individual\nI plant crimes inside vocals\nMy rap's like my passport, my life's my proof\nHit the sun roof, be out like a wanderin dream\nShuttle, and get startled off the verbal hygiene, my nigga\n\n(sample of Stamina)\n(sample of Baby C'mon)\n(sample of Brooklyn Zoo)\n(sample of Drunk Game (Sweet Sugar Pie)\n(sample of The Stomp)\n\nShame on you when you step through to\nOl Dirty Bastard, Brooklyn Zoo!\nShame on you when you step through to\nOl Dirty Bastard, Brooklyn Zoo!\nWhat?!! My nuh\nShame on you when you step through to\nThe Ol Dirty Bastard, Brooklyn Zoo\nShame on you when you step through to\nTHe Ol Dirty Bastard, Brooklyn Zoo\nTo the West coast!\nTo the East coast\nTo the North coast\nTo the South\nWhen you take North, East, West, South\nPut it all together and it spell NEWS!\nThen you got the ol rhythm, bastard blues\nAnd ya don't stop\nSo keep your shit, motherfucker, fucker, fucker!\n\n(live concert)", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}