{"songs": [{"title": "State of Emergency", "album": "Bobby Tarantino II", "year": "2018-03-09", "lyrics": "[Intro: 2 Chainz]\nYeah, yeah, yeah\n2 Chainz\n\n[Verse 1: 2 Chainz]\nOkay, I think these niggas is tryin' me\nThe irony, I used to iron jeans that had the heavy crease\nYou know my destiny is somewhere over the catastrophe\nYou know your majesty\nYou don't smoke strong, that's muscle atrophy\nThat's such a tragedy\nI see murder like it's Master P\nDrug dealin' academy, summa cum laude\nI made A's, rarely made a B\nWatch 1080p, cost 80 apiece\nI need 80G, verses ADD (tell 'em)\nIt was me versus the APD (APD)\n'Cause they know I'm ballin' hard like the ACC (sweet)\nI ride this beat like an ATV\nTo see me you need HDTV\nBein' broke is like an allergy\n\n[Verse 2: Logic]\nBallin' with my homies now, everybody know me now\nBut they don't really know me now\nYeah, this shit is real life\nHaters talk shit, but deep down still wonder what it feel like\nYeah, you know I am right, I just signed a 30 million dollar deal\nHow that feel? Goddamn right, no, that ain't a rapper flex\nI just gotta let 'em know\nThat money don't mean shit without self-respect\nBuilt myself an empire\nYou can have rap, I'ma set the whole wide world on fire\nRattPack, that's a fact\nHow you go from Bobby Tarantino to the boom bap? It's a trap\nBring it right back, I do it all 'cause I'm like that\nYou can't put me in a box, my talent put me in the mansion\nRap without Logic, like the game with no expansion\nAnswer, damn I'm feelin' handsome\nI ain't in the club throwin' dollars, I'm at GameStop\n'Member used to sell trees on the same block\nI went platinum and double platinum then triple platinum\nFrom rappin', I'm snappin', I'm snappin'\nThey wonder what happened\nThey was hatin', now they clappin' like, \"Yeah, yeah\nBobby got the Grammy this year\"\nCall me Nostradamus, not cocky, I'm honest, well to be honest\nI spit the finest of flows, I count cash, you count hoes\nYou'll never get, that's why your shit is counterfeit\nThis that Reasonable Doubt shit, Jay in his prime\nThis a state of emergency, now sound the alarm\nI'm comin' for your neck, but first I'ma slice off the arm\nOf anybody who ever try to bite the hand that fed 'em\nI'm too powerful, try to double-cross me and I dead 'em\nKill 'em with kindness, you too weak like \"7 x 2\"\nSo show some respect when this muscle comes through, woo!", "image": "https://images.genius.com/2d421963ae73ffc51d48c6f69cb23ef1.1000x1000x1.jpg"}], "artist": "Logic"}