{"songs": [{"title": "What Up", "album": "It Ain’t Safe No More...", "year": "2002-11-26", "lyrics": "{*scratched: \"It's the new!!\"*}\n\nYeah! Yeah, Busta Bust down, Flipmode now\nI know what y'all feel like doin\nGo 'head and crash your whip in the fuckin wall\nIt's cool, niggas.. we gets busy\n\n[Verse One]\nFo' sho', spit rogue, get mo' bout to kick in the door\nDick sore, split whores 'til they shit on the floor\nClique more sick from when you use to see us before\nShit, kill a nigga quick, niggas know my rapport\nKeep workers on the strip that be ready for war\nBrick I flip a little quicker if they shit in the store\nRip, maybe 'til they drop, and they shit in they drawers\nShit crazy when I pop, and I'm grippin the four\nThick bitches in the spot, watch 'em strip for the sport\nSpit vicious for the block, yeah we swingin a torch\nStick niggas for they shit, thank 'em for they support\nQuick nigga, better quit snitchin down at the court\nCheck track a little slick and try to go on my Forbes\nCause we stackin like we rich, and we holdin the fort\nThis time, we had to bring it, guess what we brought\nThe hottest shit to bang from L.A. to the streets of New York\n\n[Hook]\nAll my people, get drunk, get high - WHATTUP?\nGet money, get rich, get fly - WHATTUP?\nGet stupid, get busy, get live - WHATTUP?\nJump all in your whip, turn the key and drive - WHATTUP?\nMake a mill' yeah we gon' make about five - WHATTUP?\nWe speak the truth and we ain't talkin no jive - WHATTUP?\nI'm speakin to the streets and everybody's widdit - WHATTUP?\nOnce again you know we only come to get it - WHATTUP?\n\n[Verse Two]\nAOWWWWWWW!! Ha, I stay wicked now I'm back on the strip\nLike I went on a vacation and I'm back from my trip\nNuff radio rotation like I'm sailin a ship\nOr when the team circle the block, busy trailin my clique\nTruck packed fulla niggas with the strap and the whip\nGet the gat out of the stash, put it back on my hip\nGat butt you in the face, split and fatten your lip\nBlood hit the floor louder than the clap when it drip\nI credit your name with bullets, read the back of the script\nMy victim's initials engraved on the back of the clip\nChicks love the way we roll, how the movement is thick\nSo official like my name's on the back of your bitch\nPay triple for the name on the back of the stitch\nName like the whole city now I'm changin the pitch\nKick back kinda crazy when I'm holdin the fifth\nThink you nicer than the God, shit is only a myth\nGrab ahold of the masses, I was born with a gift\nNiggas be runnin they trap, throw 'em over the cliff\nThinkin and drinkin the Guinness, busy holdin the spliff\nFlippin and shittin on niggas 'til we old and we stiff\nI don't even drive whips, throw the shit on the lift\n12 hours, one worker do the whole of the shift\nI do the thing to make you open your mouth\nAnd give you shit to bang the Midwest and the rest of the South\n\n[Hook]", "image": "https://images.genius.com/cc9251ac994bbe401044c52cb51d1e49.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}