{"songs": [{"title": "The Product", "album": "Kill at Will EP", "year": "1990-12-18", "lyrics": "[Intro]\n(Are you ready?)\n(Fuck that, Ice Cube coming back at you with another motherfucking bomb)\n\n[Verse 1]\nI was told, cause I didn't witness the whole act\nIn and out was the movement of the bozack\nIt was hot and sweaty and lots of pushin'\nThen the nut came gushin'\nAnd it was hell trying to bail to the ovary\nWith nothing but the Lord lookin over me\nI was white with a tail\nBut when I reached the finish line, young black male!\nOne cell made two, and two cells made fo'\nAnd so on, so now I'm a embryo\nThen I got a hunch\nThat I'mma be on lockdown, for nine months\nChillin', with my mother to guide me\nAnd nuttin' but a stomach to hide me\nFrom all that worry and bullshit\nNine months later, I elbow pull and kick\nCause my time is up and I don't care\nWith one big push, I'm outta there\nJune 15th, it's just my luck\nIn 1969, a nigga is the product\n\n(Ghetto-ass nigga, you ain't shit\nAnd you ain't gon' never be shit!)\n\n[Verse 2]\nI learned how to walk and talk and all that\nThey put me in school, but it don't matter\nCause I'm sitting in history\nLearning bout a sucker, who didn't give a fuck about me\nThey try to shape us\nBut I know Uncle Sam is a motherfucking rapist\nSo I stopped paying attention\nIce Cube, headed, straight to detention\nFuck that shit, I roam the hallways\nI'm sent home and I don't got all A's\nA high school dropout\nMy father had beef so I tried to knock pops out\nBut I got tossed, he's the boss\nI'm out of there and mad cause I lost\nNow being on my own is a factor\nSo I become, the neighborhood jacker\nGimme your car, run your jewels\nMaking a living robbing fools\nAnd if I let my nine rang out\nYou know, it'll make your brains hang out\nSo what's your fate?\nAm I the nigga you love, or the one you love to hate?\nThe wrong answer is said, the nigga fled\nI pump lead, now he's in a puddle of red\nAnd if you got a buck, you're shit out of luck\nStuck up by the motherfucking product\n\n(Uh-uh motherfucker you gots to get a job\nIf you wanna stay in my motherfucking house)\n\n(Many young men reject the traditional values\nThat are important to their parents\nChurch, school and family\nHave been replaced by street, turf, and gang)\n\n[Verse 3]\nTwenty-one now, and paid in full\nFeeling bad, from all the shit I pulled\nOn people back in the day\nPlus, I got a little baby on the way\nSo I'm trying to go straight\nI'm with my baby's momma, out on a date\nTil the punk ass cops ran my plate\nNow I'm on a bus upstate\n\"Oh, the young nigga done caught a case!\"\n(Eating in the mess hall, saying my grace)\nSent to a concrete ho-house\nWhere all the products go, no doubt\nYo momma, I gotta do eleven\nLiving in a five-by-seven\nDear baby, your man's getting worn out\nOf seeing young boys getting they assholes torn out\nAnd then he got shanked with a spoon\nAnd he was supposed to get out soon\nIs it my fault, he was caught in production\nWhere a young black life means nothin'\nJust because, I didn't want to learn your grammar\nYou say I'm better off in the slammer\nAnd it's driving me batty\nCause my little boy, is missing daddy\nI'm ashamed, but the fact is\nI wish pops let me off on the mattress\nOr should I just hang from the top bunk\nBut that's going out like a punk\nMy life is fucked\nBut it ain't my fault, cause I'm the motherfucking product\n(He ain't shit)", "image": "https://images.genius.com/6c223fafae72a06b4952ce4b3f7e6b7a.992x991x1.jpg"}], "artist": "Ice Cube"}