{"songs": [{"title": "The City Is Mine", "album": "In My Lifetime, Vol. 1", "year": "1998-02-03", "lyrics": "[Intro: Jay-Z]\nUh-uhh-uh, ge-ge-geyeah\n\n[Chorus: Blackstreet and (Jay-Z)]\nYou belong to the city (uh-uhh-uh, what what)\nYou belong to the night (uh-uhh-uh, ge-ge-geyeah)\nIn the river of darkness\nHe's a man of the night\n\n[Verse 1: Jay-Z]\nWhat the deal playboy, just rest your soul\nI be holding it down yo, still love the dough\nGot these ladies on the cock now you know how we go\nGot the whole world on lock down you know how we flow\nDon't worry about Brooklyn, I continue to flame\nTherefore a world with amnesia won't forget your name\nYou held it down long enough, let me take those reigns\nAnd just like your spirit the Commission remains\nNiggas can cross the T's and, dots the I's\nNow that I got too popular to cop them pies\nI'm taking this rap shit serious, to my demise\nJay shit's like cake mix, watch me rise\nBasics in the basement, wasted\nAsking my dog for advice so when he can't say shit\nMy hatred is, fueled just give me a sign\nAnd I let the world know that the city is mine, what?\n\n[Chorus: Blackstreet and (Jay-Z)]\nYou belong to the city (the city is mine, what-what-what)\nYou belong to the night (ge-ge-geyeah, uh-uhh-uh, pa-pau)\nIn the river of darkness\nHe's a man of the night (the city is mine, that's right...)\n\n[Verse 2: Jay-Z]\nY'all wanna know how I flow just seek and you find\nI'm like a brain in the voice box, I speak my mind\nAbout to redefine rap mami, either I'm\nThe illest nigga doing it or these niggas is losing it\nI read a article that said I was ruining shit\nBut every time I look, I'm moving units in quick\nSo I'ma hit y'all, with these last two and split\nAnd leave niggas with nothing but my influences-es\nStudents of Jigga, I ain't mad yeah, bite my shit\nSell half of what I sell because it's not quite my shit\nI'm the type to buy a Rollie and just ice my shit\nOn the spot, fuck coming back twice to shit\nHow real is that? My floss game, still intact\nBoss game, you lame dudes can't feel that\nLike the first dude to cop the 850 in '89\nAnd drove it up to 55th, the city is mine, what?\n\n[Chorus: Blackstreet and (Jay-Z)]\nYou belong to the city (the city is mine)\nYou belong to the night (yeah, uhh, the city is mine)\nIn the river of darkness (pa-pause, feel me)\nHe's a man of the night (yeah, yeah, bounce, bounce)\n\n[Verse 3: Jay-Z]\nI snatch your girl 'cause your arm ain't strong enough\nPlus y'all don't stay in the studio long enough\nI make hits while y'all stay hating and take bricks\nHad it locked 'til I came in the club, Take 6\nGot your chick 'cause you swore she was innocent\nGot her a Chinese manicure, hair done by Dominicans, all for what\nSo I could be in a dark corner, all in her butt\nAt the bar alchoholing her up\nI represent the lifestyle of those who thirst cream\nA buck fifty a shot, Louis the Thirteenth\nJay-Z, Roc-A-Fella yo, know the name\nI ain't a player, get it right, I'm controlling the game\nFrom now until they blow holes in my frame\nI'ma stand firm, holding my aim, feel me?\nI'm the focal, point like Biggie in his prime\nOn the low though - shhhhh, the city is mine!\n\n[Chorus: Blackstreet and (Jay-Z)]\nYou belong to the city (uh-huh, yeah, the city is mine)\nYou belong to the night (ah ah, the city is mine)\nIn the river of darkness (feel me, the city is mine)\nHe's the man of the night (the city is mine, is mine, is mine, is mine)\nYou belong to the city\nYou belong to the night\nIn the river of darkness\nHe's the man of the night\n\n[Outro: Blackstreet]\nYou belong\nYou belong\nIn the river of darkness\nHe's the man of the night", "image": "https://images.genius.com/20d72e4789b78dce6f0658c7ce853c83.300x300x1.jpg"}], "artist": "JAY-Z"}