{"songs": [{"title": "Raw", "album": "Immobilarity", "year": "1999-11-16", "lyrics": "[Hook: Raekwon]\nYes, the shit is raw, comin at ya door\nYes, the shit is raw, comin at ya door\nYes, the shit is raw, comin at ya door\nStart to scream out loud, Cream Team's back for more\n\n[Raekwon]\n900 dollars on the glass table\nWally Clark Gable unable\nBlow it on a grey goose\nPicture that, elephant skin\nCardier glasses dim\nWhat's that? Gold around the rim\nHollywoodizin, without goin Hollywood\nPolly for all, Cream Team playas in the hood\nStop that scrutenizin, naturize\nSee my paper rise, promotin it at Lakeshore Drive\nTrickin at the shark bar, God\nMake sure the collar greens got turkey bars par, we got you Allah\nRare start grappin the hair, playin Cuban Linx\nSpinnin like the swivel chair, yea\nNo question\n\n[Baby Thad]\nThe peeps flippin, actin like she wanted me to pipe her\nAnd they got you jealous, claimin that you never liked her\nThen I found out y'all was too many dykers\nNow I'm hyper, beggin you to hook me with a cypher\nSee me in the tunnel and you trouble me\nGet my dick hard dancin, sippin my bubbly\nYo, beat me in the head, talkin 'bout how you got a man\nThat can't get freaky as I wanna be\nNo talk, Giant Size in the game\nColt 45, appliance in the game\nTyra's in the game, huh?\nRelyin on money, to make sure that my environment change\n\n[Hook 2X]\n\n[Raekwon]\n2:15 and I'm blasted, smack that ass kid\nLight skin, what up? Stop splashin\nSlang got niggas in the choke hold\nFreakin their coats, got $64,000 on clothes, yo\nWu-Wear jackets and hats, relaxin, bets play that\nPing-pong champion cats, what?\nChantin out Walk Myers\nYo, the weather is nice, flex the Benz\nWith $10,000 in flyers\n\n[Baby Thad]\nThe squellin I'm for in the six range things\nMake the loyaliest cats, Flipmode do strange things\nSwitch like change lanes, chains, rings and glaciers\nStay phat in it\n\n[Chip Banks]\nMan, I can't stand them chicks, I dig for Vanson\nPlay a brother close to Puff is Branson\nIce work, gleamin I'm catchin them, glancin\nI play 'em no mon', 'bout to bar dance 'em\nWhite bitches with Banky like, \"You handsome\"\nFlyin to the hills, to fuck in the mansion\nOnly one way you spendin the night in here tonight\n*singing* If your head is right\n\n[Raekwon]\nDance turn into a romance\nDance turn into a romance\n\nGet up, get down, move around, cover ground\nThrow it on the brother now, you swore\nI had your mother on the ground\nHigh rollers that know us\nCrisp pop, giftshop, hollas that rock Polo's\nHere they hold they shoulders, yo\nLay it like a chain be on, we on Cream Team\nPlay on, with all grey on, flavor like crayon\n\n[Hook 3X]", "image": "https://images.genius.com/d8508796401925d32124cc47a45641d8.500x500x1.jpg"}], "artist": "Raekwon"}