{"songs": [{"title": "Fireman", "album": "Tha Carter II", "year": "2005-10-25", "lyrics": "[Intro]\nWeezy Baby\nShh, the Fireman comin'!\nYeah, yeah, yeah\nYeah, yeah (Uh-oh)\nYeah (I'm back), yeah\nThat's right (Yeah)\nBirdman! (Yeah)\nThey gon' have to call the law\nUh-uh! I'm back! (I tried told 'em)\nWhat ya gon' do now? (Yeah)\n\n[Chorus]\nI'm the Fireman, Fire, F-Fireman (Oh!)\nI got that fire, I'm hollering (Oh!)\nI got that fire, come and try me, and (Oh!)\nYou can spark it up and I'mma put you out (I-I got 'em)\n(Get 'em) You can spark it up and I'mma put you out\n(I, I-I-I, uh-I got 'em)\n\n[Verse 1]\nAin't nobody fuckin' with me man (Uh-uh!)\nHe-Man, ski mask\nSpending next week's cash, he fast (OHH!)\nAnd I don't even need a G pass (Nope), I'm past that\nI'm passing 'em out now (Yeah), and you can't have that (Yeah)\nAnd my chain, Toucan Sam that (Ha!)\nTropical colors, you can't match that (Oh, no!)\nGotta be abstract (Oh, no!)\nYou catch my girl legs open, better smash that (What? What?)\nDon't be surprised if she ask where the cash at (Boy!)\nI see she wearing them jeans that show her butt crack (Ayy!)\nMy girls can't wear that\nWhy? That's where my stash at (Nuh-uh-uh!)\nI put my mack down (Yeah), that's where you lack at (Yeah)\nShe need her candle lit (Yeah), and I'mma wax that (Got em!)\nI rekindled the flame (Got em!), she remember the name (Got em!)\nIt's Weezy Baby, January, December, the same (Who?)\nMama, gimme that brain (Yeah), mama, gimme that good (Yeah!)\n'Cause I'm the fireman (Oh!), you hear the fire truck\n\n[Chorus]\nI'm the Fireman, Fire, F-Fireman (I-I, uh-I)\nI got that fire, I'm hollering (I-I, uh-I)\nI got that fire, come and try me, and (I-I, uh-I got 'em)\nYou can spark it up and I'mma put you out (I, I-I, uh-I got 'em)\n(Get 'em) You can spark it up and I'mma put you out\n(I, I-I, uh-I got 'em)\n\n[Verse 2]\nFresh on campus, it's the Birdman Junior\nMoney too long, teachers put away your rulers\nRaw Tune, not a cartoon\nNo shirt, tattoos, and some war wounds\n(Sexy!) I'm hot, but the car cool\nShe wet, that's a carpool\nBeen in that water since a young'n, you just shark food\nQuick Draw McGraw, I went to art school\nYeah the lights is bright, but I got a short fuse, don't snooze\nBeen handling the game so long my thumbs bruised\nYour new girlfriend is old news\nYou ain't got enough green and she so blue\nCash Money Records, where dreams come true\nEverything is easy, baby, leave it up to Weezy Baby\nPut it in the pot, let it steam, let it brew\nNow watch me melt; don't burn yourself, 'cause –\n\n[Chorus]\nI'm the Fireman, Fire, F-Fireman\nI got that fire, I'm hollering, I got that fire, come and try me, and\nYou can spark it up and I'mma put you out\n(Get 'em) You can spark it up and I'mma put you out\n\n[Verse 3]\nYeah, riding by myself; well, really, not really (well...)\nSo heavy in the trunk make the car pop a wheelie\nWho? Weezy Baby, or call me Young Baby\nMy money 360, you only 180 (that's right!)\nHalf, of the game too lazy\nStill sleeping on me but I'm 'bout to wake 'em, yep\nI'm 'bout to take 'em to New Orleans and bake 'em, yeah\nIt's hot down here, take a walk with Satan, yeah\nCome on mama, let the Carter make ya\nToss you like a fruit salad, strawberry-grape ya\nThey ball when they can, and I'm ballin' by nature\nAddicted to the game, like Jordan and Payton\nY'all in the race, and me, I'm at the finish line\nBeen running for too long, it's time to give me mine\nStraight down your chimney, in your living room, it's I\nWeezy, allergic to wintertime — Hot!\n\n[Chorus]\nI'm the Fireman, Fire, F-Fireman\nI got that fire, I'm hollering, I got that fire, come and try me, and\nYou can spark it up and I'mma put you out\n(Get 'em) You can spark it up and I'mma put you out\n\n[Outro]\nYeah, I-I-I got 'em\nI-I-I got 'em\nAy, B – I got 'em\nAy, T – I got 'em\nAy, Slim – I got 'em\nYeah, don't worry\nDon't worry\nI'mma put you out", "image": "https://images.rapgenius.com/82b537c1008d3b1a3abb77c51a21a141.600x600x1.jpg"}], "artist": "Lil Wayne"}