{"songs": [{"title": "What They Don’t Know", "album": "Undisputed", "year": "2012-09-11", "lyrics": "[Hook: DMX]\nWhat they don't know, they gon' find out [3X]\nWhat they don't know, they gon' find out REAL SOON BABY!\n\n[DMX - over Hook]\nMan, listen!\nThese cats must be out they fuckin mind baby!\nThinkin the Dog don't got it!\nARF, ARF!\nBut you 'bout to find out, what it is, C'MON!\n\n[DMX]\nThey call me, go against the grain, the swagger's reckless\nSince 12 smack a nigga, grab his necklace\nAnd the nigga gon' respect this, Dog come through like Deebo\nAin't gotta touch his life but gettin paid off C-lo\nThat's yo' man faggot, he know, go hard and get down\nWhenever Dog hit town, I shut shit down\nBut I want it NOW, if I see it, I'mma take it\nAnd you better hope I don't want it all cause, I'll leave you naked\nI ain't never had to fake it, Dog come through with no gun\nI'll show somethin, I'm scared of no one, and I don't run\nI tell niggas, X is back\nAnd it ain't where I'm at, it's what I'm givin niggas, X is back\nC'MON!\n\n[Hook]\n\n[DMX]\nThey on that peep Dark whisperin, walk soft shit\nI'm a dog, course I recognize a bitch\nAnd I ain't speak cause I was actin funny nah, it's not what I'm about\nYou just look mad different without a fuckin dick in your mouth\nSoon as I seen you I knew you was see-through, cause I seen through\nI ain't mean to, he made me hit him, that's what the thing do\nIf we were big as our hearts you'd be, half my size\nI only fuck with the real Scarface and Nas\nNiggas love to think the worst - but put\nWhat you think in this hand a pile of shit in the other, which one'll get filled up first?\nI stay remindin niggas what the gun do\nWherever I'm at niggas don't come through, if they do they run through (c'mon!)\n\n[Hook]\n\n[DMX - repeat 2X]\n(It ain't my fault) that on the mic, y'all niggas suck\n(It ain't my fault) when shots go off, y'all niggas duck\n(It ain't my fault) real niggas run in circles around you\n(It ain't my fault) did the dirt but now the dirt found you\n\n[Hook]\n\n[Outro: DMX]\nNiggas is fuckin blind!\nLookin without seein\nWalkin without bein\nLivin without breathin\nC'mon, y'all niggas is, assed out son!\nReal talk, FUCK OUTTA HERE WITH THAT BULLSHIT MAN!\nEh-deh-eh-eh [8X]", "image": "https://images.genius.com/5e36caac869327ad8b5a01792f569aac.500x500x1.jpg"}], "artist": "DMX"}