{"songs": [{"title": "Remember Me", "album": "Authentic", "year": "2013-04-30", "lyrics": "[Intro: Male Voice LL Cool J Alicia Myers]\nEh yo L! L! Check this out\nI know you doing out all thinin' thing, right?\nBut I was talkin' to Suga Daddy\nHe said \"Why don't you do somethin' for the culture?\"\n\"Why don't you ring it back to the Bentleys\"\n\"That old school club, not the car.\"\nBy the way, can I hold your show?\nGot applause for the liquors that ain't here\nWe said some when the people caught up to the struggle\nYeah. Bottom to the top\nBut we ain't forget you\nLet's ride\nI've been tryna find my way\nNot with all this hurt and pain\nI try to bread in that and all the high...\nMachines\n\n[Verse 1: LL Cool J]\nThis one for those who feel ignored\nMy man, Rockstarr getting hit at the board\nPeople boostin' the stores that they can't afford\nFor my grandmother tellin' me to \"Remember the lord\"\nFor all my gangsta that died by the sword\nWe use to smoke blunt to the back of Encore\nDrive up town, I like ten cars or more\nTryin' to see some that we never seen before\nFor them kids in new town, and new gun laws\nThat would easily pass if that kid was yours\nThese are the side effects, what's the cause?\nAt a minimum, we got to put the shit on pause\n\n[Hook: Alicia Myers LL Cool J]\nWhoa! Every grounds\nRemember me!\nDo you remember me, Do you remember me\nDo you remember me, Do you remember me\nDo you remember me, Do you remember me\nDo you remember me, Do you...\n\n[Verse 2: LL Cool J]\nHe went to town before his baby was born\nNow his baby has a baby and he still ain't home\nHe cryin' in his cell when he all alone\nWishin he can call up god on the phone\nEnough turn a good man his heart is stone\nMake his baby mama drank patron\nHipnotic Hustlers ride in chrome\nMotherfuckers read like Donna Boy's Poem\nFor 9/11 for the building's fall\nFor the misguided minds thats burning in hell\nFor the cats at the corner got hopes to sell\nBut never hit the number it never could post bail\n\n[Hook: Alicia Myers LL Cool J]\nWhoa! Every grounds\nRemember me!\nDo you remember me, Do you remember me\nDo you remember me, Do you remember me\nDo you remember me, Do you remember me\nDo you remember me, Do you...\n\n[Bridge: LL Cool J Alicia Myers]\nSwerve it out, Hey, Swerve it out\nHey, Swerve it out, Hey, Swerve it out\nHey, Swerve it out, Hey, Swerve it out\nHey, Swerve it out, Hey, Swerve it out\nKeep your hands on the grass\nDon't forget about me\nKeep your hands on the grass\nDon't forget about me\nKeep your hands on the grass\nDon't forget about me\nKeep your hands on the grass\n\n[Verse 3: LL Cool J]\nHe forgot where he came from, Lord forgive him\nProtect him from all the mistake that got with em\nWhen bullets unleash, don't let nothin' hit him\nWrap his shoulders for valtures that's out to get him\nFlashback, USA what escape with him\nPull the fat boy, ha-ha-ha stick em\nSo-called best friend tried to trick him\nDear God, we forgive him but we don't forget him\n\n[Hook: Alicia Myers LL Cool J]\nWhoa! Every grounds\nRemember me!\nDo you remember me, Do you remember me\nDo you remember me, Do you remember me\nDo you remember me, Do you remember me\nDo you remember me, Do you...\n\n[Outro: LL Cool J]\nTo my man, Rashaun. Up North\nDon't let them kill your spirt homie\n(Do you remember me, Do you remember me)\nWe ain't forget you (Do you remember me, Do you remember me)\nMy Man, Marley Marl, we ain't forget you homie\n(Do you remember me, Do you remember me)\nHighest jacks on the planet (Do you remember me)\nYeah. Heavy D. we love you (Do you...)\nAll my homies, Black Just RIP\nLove you, homie", "image": "https://images.genius.com/c0c7dbb9fd10ac4887ec94389a4d0712.1000x1000x1.jpg"}], "artist": "LL Cool J"}