{"songs": [{"title": "Funkorama(Double Green Remix)", "album": null, "year": "1996-01-01", "lyrics": "Yeah, one room, Representing, Def Squad coast, yeah, ah, y'all know bout that? Check it\n\n[Erick Sermon]\nIt goes, knick knack, patty-wack, give a dog a bone\nYou a customer, so kneel before me, the E\nMatter of fact, like the group home, give me dap\nTo being the first one to bring the Zapp clap to rap\nLook at that, i got the whole house jumpin'\nOff the hook, like my little black book(Uhhuh)\nThe original flavor, Run-DMC era\nMicrophone terror, so who can do it betta?\nI'm in the mixture, I recite funk scripture\nFreeze you, like Kodak picture, cheesy\nExpertise, doper than thesegrown trees\nI'm on the money strap, so you can call me Donny\nFly hyper, Professional lyrical sniper\nWho comes tighter, than the virgin, servin';\nLast chance, so if you wanna go to rounds wit the Def Squad\nMotherfucker, Let's Dance\n\n[Hook]X2\n[Redman] Funkorama!\n[Erick] Yeah the place to be, for the underground\nTo groove to the funk sound so\nRelax your mind, let your conscience be free\nWith E and R-E-D\n[Redman] We get down like that\n\n[Verse 2: Redman]\nCAUTION! Your hearing aid is needed, stay weeded\nI'm consecutively bleeding eardrums repeating\nThe bombzee taking the heat since I was a fetus\nRocking Adidas when I first sipped on Easy Jesus\nCopastetic, how you like it, whole or shredded\nMics get breaded, saute, cause I'm a pro at wetting\nI'm getting, smarter than Agent 86\nYou beating me?, one-on-one? Then that fight is crazy fixed\nOpen up that chest like Vicks, when I write them\nThen leaves you marks brains, more questions than Asylum\nYou got a crew? You better tell them, or hide them\nI stay more focused than wide lens when I'm inside them\nYo, E, Scream on these stinking MC's\nThree times three, reality, virtuality, can't see\nI plant seeds and MC's that can't\nFertilize their rhymes, I drop lines till they can't breathe\nShucky ducky quack quack, on that ass crack\nGot blast on, I blast back, Funkorama\nI got a trunk o' trauma, to smoke constant\nDramas caused by the bomb shit, love ya momma\n\n[Hook]X2\n\n(Redman saying beginning and end of hook until song fades)", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}