{"songs": [{"title": "City of Dope", "album": "Life Is... Too $hort", "year": null, "lyrics": "[Verse 1]\nCity of dope, I call it Oak\nCan't be broke selling coke\nFat ropes, shattered hopes\nFresh cars and all that dope\nBaseheads keep the trade alive\nNobody knows 'bout a 9 to 5\nEverybody's just tryna survive\nYou need a gun, can't use those knives\nYou got a bullet? Well just pull it\nAnd if you trip, get pistol-whipped\nBy a psychomaniac sick in his head\nWanna be a gangster and now he's dead\nHis brother took over, ain't no sweat\nBought a new drop-top white Corvette\nNow he's buying keys, making G's\nAnd all the girls say \"Won't you please take me\"\nIn the city of dope\n\n[Verse 2]\nSee I'm hard as hell, no ghetto tale\nYou play a gun, but the game is real\nYou wanna stop my money, how?\nYou keep smoking, I'm selling out\nIt's called the city of dope, might be your town\nGet a piece of the rock, turn your life around\nSo cool, don't even trip\nYou got the sack, get on the tip\nA resident in the city of dope\nAnd every day I'm selling coke\nI'm never broke, I don't smoke\nI sold a rock and made you have a stroke\nPay me cold cash you know, I won't need Bruno\nI'll hit you with my gat and then I won't come back\nLike my peanut butter top with the candy paint\nAll the high school tenders drop down and faint\nIn the city of dope\n\n[Verse 3]\nLife in a coke town, heard it before\nThink it's all been said, but there's so much more\nIt's like midnight, slanging rocks\nTask force just hit the block\nTime to make a move, the spot got hot\nYou chase a cop, homeboy why not?\nShe lit the match and light the crack\nAin't giving no bitches no kind of slack\nOr if you're playing the game, then you're thinking the same\nGoddamn that rock cocaine\nI see a lot of my friends gone off that pipe\nAnd every night smoke coke that's white\nSo when you get up, man, there you go\nYou and that pipe just dogging the hoes\nIn the city of dope, and the story goes\nWant to be like free, breaking millions of loaves\nIn the city of dope where the color is gold\nOn your neck, and your fingers, and your brand new Rolls\nEnough said, but my rap won't end\nIt's on a one way trip to San Quentin\nLike you my friend, ain't nothing new\nYou want to grind that boat 'til it's way past two\nYou say it's not easy, but you're so hard\nSporting gold tone Z's, not credit cards\nGot clout turn 'em out, you got bitches\nYou say you're not fake, but I'm telling you this is\nThe city of dope, might be your world\nGet a beeper homeboy and just sell that girl\nI'm from the town called the city of dope\nIt couldn't be saved by John the Pope\nSo go on, live your life of crime\nThe beat'll keep beating while I say my rhyme\nIn the city of dope\n\n[Verse 4]\nSmoking weed, rolling 'em fat\nYou wonder where the boy learned to act like that\nHe was raised in the ghetto and felt the need\nTo roll a fat joint and smoke that weed\nBut the tale goes on and years went by\nAnother drug came and the boy got high\nEver since that day, he just wasn't the same\nWhere I come from we call it \"rock cocaine\"\nWhere you come from, you might call it \"crack\"\nBut wherever he went, you see he never came back\nI tried to tell the motherfucker, but he don't know\nI say to coke, \"Pimp that ho\"\nI don't live in a mansion but I drive a Benz\nCut to the turf and collect my ends\nSay \"Look here freak, kick me down\nI don't have time to talk right now\"\nGot to go to my next ho\nAnd get kicked down a little more\nLeft right left, down the street\nGetting paid freak by freak\nThere you see me, there you don't\nYou wonder will I or won't\nIs it yes? Is it no?\nBut does it really matter you freaky ho?\nIn the city of dope", "image": "https://images.genius.com/9ed3ca4bcc64d64446ff7e9bea94be4e.600x600x1.jpg"}], "artist": "Too $hort"}