{"songs": [{"title": "Give Up the Goods (Just Step)", "album": "The Infamous", "year": "1996-01-22", "lyrics": "[Verse 1: Prodigy]\nAyo, Queens get the Money, long time no cash\nI'm caught up in the hustle when the guns go blast\nThe fool retaliated so I had to think fast\nPull out my heat first, he pull out his heat last\nNow who the fuck you think is living to this day?\nI'm tryna tell these young niggas crime don't pay\nThey looked at me and said, \"Queens niggas don't play\nDo your thing, I'll do mine kid stay outta my way\"\nIt's type hard tryna survive in New York state\nBut can't stop till I'm eating off a platinum plate\nPo-po comes around and tries to relocate me\nLock me up forever but they can't deflate me\n'Cause having cash is highly addictive\nEspecially when you're used to having money to live with\nI thought, step back, look at my life as a whole\nAin't no love, it seems the devil done stole my soul\nI'm out for delfia, selfia, P's not helping ya\nI'm tryna get this Lexus up, plus a cellular\nYo, Big Noyd! (What up, cousin?) I can't cope\nWith all these crab niggas tryna shorten my rope\n\n[Verse 2: Big Noyd]\nYo, it's the R-A-double-P-E-R-N-O-Y-D\nNiggas can't fuck with me\nComing straight outta QB, pushing an Infiniti\nYou ask can I rip it constantly? Mentally?\nDefinitely, to the death of me, come and test me\nTrust me, nigga couldn't touch me if he snuff me\nSo bust me, you're gonna have to, 'cause I'ma blast you\nMy lyrical like a miracle, ill spiritual\nI'm born with it, I'm getting on with it\nAnd I'ma have it til I'm fucking dead and gone with it\n'Cause I'm a what? Composer of hardcore, a lyrical destructor\nDon't make me buck ya, 'cause I'm a wild muthafucker\nYou know my flow, you know my steelo\nEven pack my gat when I go to see my PO\nJump out my hooptie, pass my gat and my lucci\nTo my shorty in case my PO try to troop me\nTo the island, and if I start wilding\nFlipping on niggas walking around with the nice gold medallions\nBut she didn't violate me, so I escaped, see\nBack to Queens, pumping the fiends, making more cream\nKnow what I mean? I'm a natural born hustler\nWon't try to cut ya, pull out my 4-4 and bust ya\n\n[Verse 3: Havoc]\nYo, ain't no time for faking jacks\n'Cause brothers that fake jacks get laid on their backs\nThe streets is real, can't roll without steel\nI feel how I feel 'cause I was born to kill\nDo what I gotta to eat a decent meal, brothers is starving\nDon't try to find a job, son, it's all about robbing\nSo don't be alarmed when we come through\nWe supposed to, if you opposed to, get your face blown, dude\nOff the map, 'cause I react, attack\nA brother wasn't blessed with wealth, so I act like that\nDrug dealing, only mess with shorties that's appealing\nI'm frontin' on the world once I start 4-wheeling\n'Cause back on the 41st Side, we do it right\nSipping E&J, getting bent all night\nYo, who that? I never seen him in my whole life\nStep to his business 'cause it's only right\nPo-po ain't around so I grab my pound\nMoney retaliated so I hit the ground\nMy life is on the line, gotta hold my projects down\nCan't see myself getting bodied by a clown\nAss nigga that ain't even from my town\nHit him up in the chest, now he's laying man down\nJetted up from under the benches, I started hearing sirens\nI stop firing, to cut ass like a diamond\nJetted to the crib piece, what a relief\nStashed the heat then proceeded to peep\nOut the window, call my son\n\"Yo son, we got beef, but no question\nMoney had a problem so I solved him\"\n\n[Bridge: Prodigy]\nI got my mind on a stick-up, now it's time to get paid\nThinking of ways to take loot already made\nThere's crime in the air, ain't no time to be afraid\nGive me yours or get laid\nGive up the goods or get sprayed\n\n[Verse 4: Prodigy]\nI got lots of love for my crew that is\nNo love for them other crews and rival kids\nAll them out-of-town niggas know what time it is\nAnd if they don't, they need to buy a watch, word up\nCaught up in the crossfire get theyself hurt up\nWhile I be sipping gin straight in a plastic cup\nOn a park bench on 12th Street, my whole crew's famous\nYou tried to bust your gat and keep it real but you nameless\nFirst of all, slow down, you on the wrong route\nLet me put you on your feet and show you what's it all about\nThe street life ain't nothing to play with\nNo jokes, no games, kid\nFor years I been doing the same shit\nJust, drinking liquor, doing bids\nExtorting crack heads, and sticking up the stick-up kids", "image": "https://images.genius.com/22a5691c8d70db0c38af187fb0910074.690x690x1.jpg"}], "artist": "Mobb Deep"}