{"songs": [{"title": "Go n get it", "album": null, "year": null, "lyrics": "Another day, another dollar\nEvery 24, I'm thinking money and the power\nBills due, money running low\nPlus my cousin lost her mind and had an overdose\nWay too many problems, got me stressed out\nWhat you doing? You got 7 days to move out\nGo on! Get it!\nI'm out here chasing cream\nGo on! Get it!\nNeed it, by any means...\n\nMama went and got it, daddy never home\nStarted learning from the streets, but I know my heat a\nChrome\nNever sold no kind of dope, just a real nigga\nTake the canned foods, I'm tryna get a real dinner\nGet your money stacked, your paper keep away the feds\nKeep it real and fuck a hater\nWhat my brother said\nKeep my head high, nevermind them local jokers\nEvery day that I wake, I grind\nGotta make that monthly quota\nWay too legit to quit though\nCan't stop, no way, no slow-mo\nGotta feed the team and my kin folk\nThink of all the stress that I've been through\nWay too much fuckin problems\nWay too much fuckin bills\nBy any means necessary, gotta see my momma in...\n\nAnother day, another dollar\nEvery 24, I'm thinking money and the power\nGo on! Get it!\nGo on! Get it!\nGo on! Get it!\nI'm out here chasing cream\nGo on! Get it!\nGo on! Get it!\nGo on! Get it!\nNeed it by any means\n\nBlack incorporated, Bo bangs mind frame\nYou for self nigga, organized crime wave\nI pricked my finger, took my oath and wrote my name in blood\nKill everything, got baby bodies floating in the tub\nNatural Born Killa nigga, nothing I'll as this\nThese knuckle-breathers stick the toothpick through the\nGoldfish\nYou's a sucka nigga, greener than a blade of grass\nI take the half a phone book blew him for 30 bangs\nGotta get it, while the getting's good\nThat Desert Eagle stainless steel, the handle cherry wood\nI got that G-lock, 33 ladder works\nI bag a bullet to your belly, make your bladder burst\nNow you piss some blood, I'm fishing for grub\nI'm in the water with the Great White, I'm whippin up\nDon't make me hop out with that thing and start spraying\nShit\nChopper bullets longer than the Section 8 waiting list\n\nShine up all of the gun dere, keep dem shine and crisp\nCause if a nigga try to come in and try to get in the way\nOf how I feed my family and\nTry to dig up in my pockets it'll be a catastrophic little\nSituation\nAnd I'll be leaving him laying dead and gone all in his own\nPiss\nFather bless me: Jesus Christ\nCause I'm about to go and commit my worst sin\nJust know that whenever we gonna defend it and survival\nOf the people that I love and all the people that I feed\nAnd I'm ready to kill and massacre anything\nMoving past me the rachett, I'm shootin' muthafucka\nBest believe I'm going in\nSee I go and I get it and then I STOP\nDon't speed rap this, let me walk it to em\nThis topic we addressing so serious: let me talk to em\nLook at my baby die, while they smile at me playful\nFuck you think I'm gonna do when the hunger gets painful?\nEvery day I hit the street and I taste it like grapefruit\nI ain't eat your food yet - you better be grateful!\nBe grateful that you had time to think that I overlooked it\nAnd you had an extra day with it before I came and took it\n\nGotta get mine by any means\nMalcolm X versus any king\nMarched in this bitch for kilo green\nTony locked up, let freedom ring\nFree the mind, it's beautiful\nAin't freeze the watches, it's 2 below\nEars are different, 2 below?\nGot the rock on, super ho\nSuper fly, super paid\nNiggas stunt hard as Super Dave\nYeah, where's my cape? You ain't gotta ask me where's the\nFlake\nIn the pot, cooking base\nMIAyo 808s: niggas wanna know why I link with Ace?\nBlack muthafucka with expensive taste\nHustle hard, just like me\nIce cream man, nigga, just like P\nMurder you muthafuckas, they like see\nMove that [?] just like D\nCertified, walk the streets\nConsequence, nigga, talk is cheap\nYou don't want a problem? Off the beef\nBefore I off his ass with his awful teeth\n\nRobbery turns into Murder 1\nMurder 1: made it look like it's robbery\n.44 show you boys vagina like pornography\nPut your friends, get a Benz, inside's mahogany\nPretty bitch, let her stunt, classy suit\nNice shoes, smoke blowing, guns all around\nYeah the mob will meet. Now let's keep it G\nOn some ref shit\nWe don't trust each other, we don't know each other's\nAddress\nI fuck your girl, crack your safe, slash the mattress\nNigga, you a actor, you a bitch, you's an actress\nI go and get it, yeah G and G\nI don't give a fuck, I hit your crib up with TNT", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}