{"songs": [{"title": "Love You More", "album": "Straight from the Lab", "year": "2003-11-07", "lyrics": "[Intro]\nStill love me? Take this\nYou ready? One, two, three!\n\n[Chorus]\nThe more you put me through\nThe more it makes me wanna come back to you\nYou say you hate me, I just love you more\nYou don't want me, I just want you more\nI buy you flowers, you throw 'em at me\nI know it's sad but it's makin' me happy\nThe more that you slap me, the more that it turns me on\n'Cause you love me, and I love you more\n\n[Verse 1]\nIt's sick but who could ever predict, we'd be doin' the same shit\nWe say we do it for our baby but we don't\nWe do it for us, it's lust 'cause neither one\nOf us trust each other, so we fuck 'til we bust\nAnd we cuss each other out\nWe know what it's about, shout\n'Til I throw you out the house, you throw me out the house\nI throw you on the couch, punch you in the mouth\nFist fight 'til we turn this mother out\nThen apologize after, laughter, pain\nIt's insane we're back in the same chapter again\nAnd it's sad but it's true, when I'm layin' here with you\nThere ain't nothin' anyone could ever say or ever do 'cause\n\n[Chorus]\nThe more you put me through\nThe more it makes me wanna come back to you\nYou say you hate me, I just love you more\nYou don't want me, I just want you more\nI buy you flowers, you throw 'em at me\nI know it's sad but it's makin' me happy\nThe more that you slap me, the more that it turns me on\n'Cause you love me, and I love you more\n\n[Verse 2]\n'Cause I hate you, do you hate me?\nGood, 'cause you're so fuckin' beautiful when you're angry\nIt makes me wanna just take you and just throw you\nOn the bed and fuck you like I don't even know you\nYou fuck other people and I fuck other people\nYou're a slut, but I'm equal, I'm a mutt, we're both evil\nIn our ways but neither one of us would ever admit it\n'Cause one us would have one up on the other so forget it\nWe can make accusations, people spread rumors\nBut they ain't got proof, 'til they do it's just the two of us\nIt's you and me, 'cause any chick can say that she screwin' me\nBut you gotta believe me to a degree 'cause true indeed\nIf you didn't I wouldn't be hittin' — yeah, I would\n'Cause the sex is too damn good, if I ran who would I run to\nThat would be this soft and warm?\nSo it's off and on, usually more off than on\nBut at least we know, that we share this common bond\nYou're the only one I can fuck without a condom on\nI hope, the only reason that I cope is 'cause of that fact\nAnd plus I can bust in that and that's why\n\n[Chorus]\nThe more you put me through\nThe more it makes me wanna come back to you\nYou say you hate me, I just love you more\nYou don't want me, I just want you more\nI buy you flowers, you throw 'em at me\nI know it's sad but it's makin' me happy\nThe more that you slap me, the more that it turns me on\n'Cause you love me, and I love you more\n\n[Verse 3]\nI can never understand it, that's why I don't try\nFrom junior high until we both die, it's silly\nOh, why must we try? Is it really so rough\nThat we must always call each other's Billy Goat's Gruff?\nTry to pull each other's legs, until the other begs\nWe're lyin' to ourselves, that's the beauty of it, yeah!\n'Cause we truly love each other, that's why we always fightin'\nAll we do is shove each other every other fuckin' night\nAnd it's clear it ain't gonna change, it's pent-up rage\nWe both had, we both feel like we've been upstaged\nBy someone else, we've both been someone else's \"someone else\"\nProblem is neither one wants help\nIt's an addiction and it can't be fixed\nOur family's mixed up, there's a baby sister in the mix\nAnd it hurts 'cause the pieces to the puzzle don't fit\nAnd anybody who thinks they know us doesn't know shit\nAnd they're probably just tired of hearin' it all the time\nOn every song, every lyric and every rhyme\nAll the hoopla, all of the whoopty-woo\nWhat you put me through, fuckin' whoopty-do\nBut I won't be made a fool of if this is true love\nYou wouldn't do what you did last time, you wouldn't screw up\nThis time, 'cause this time, girl, I'm tellin' you what\nYou do it again, I'm fuckin' you up\n\n[Bridge]\nNo matter what you say, or what you do\nI'ma hunt you down 'til I find you\nNo matter where you run, I'll be right there\nRight behind you, in your nightmares\nSo I brought you the flowers and the candy\nAll the times that you threw it back at me\nTold me you hate me, you gon' hate me more\nWhen you find out, you can't escape me, whore\n\n[Chorus]\nThe more you put me through\nThe more it makes me wanna come back to you\nYou say you hate me, I just love you more\nYou don't want me, I just want you more\nI buy you flowers, you throw 'em at me\nI know it's sad but it's makin' me happy\nThe more that you slap me, the more that it turns me on\n'Cause you love me, and I love you more", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}