{"songs": [{"title": "Lost Souls", "album": "Gang Related - The Soundtrack ", "year": "1997-10-07", "lyrics": "[Intro: 2Pac]\n'Cause I hate to spend my life, my life, my life, my life\nDuckin' one-time (lost soul)\nHow it start, how it start?\n\n[Verse 1: 2Pac]\nStarted off with runnin' from coppers\nDuck and hide from helicopters\nWe open fire, who can stop us?\nLivin' the life of trife juveniles, hopin' for Rikers\nGettin' 25 to life if the judge don't like us\nIn my clearest pictures, I see authorities itchin' to get us\nATF state Feds, scandalous bitches\nHow was it promised to us, wasn't bitter or sweet\nSee, if a nigga don't hustle, then the nigga don't eat\nOn these streets, livin' do or die, circle complete\nRepetitive motions of felons in a rush for G's\nPlease understand my history, a man of many hats\nLivin' Thug Life, comin' equipped with plenty gats\nMaybe I was just a lost soul, trapped in time\nLivin' in between life, in the cracks, but blind\nEven though we have hope for dreams that never came\nYet and still we all feel pain\n\n[Hook: 2Pac]\nJust wait until rain turn to sunshine\n‘Cause I hate to spend my life\nMy life, my life, my life duckin' one-time\nStranded in the County in the worst way\nHell of a way to spend my 21 birthday\nBorn in the ghetto as a street thug\nIt's for the neighborhood and weed spots that we love\nLost souls… lost souls, nigga\nFor my homeboys that passed on\nWords from the mind of a lost soul\nJust wait until rain turn to sunshine\n‘Cause I hate to spend my life\nMy life, my life, my life duckin' one-time\n\n[Verse 2: Young Noble]\nMy brother Sean, first on my list, he stuck with a three-five\nWhen he get out, would I be dead or alive?\nHe taught me the rules so much, but still In Thugs I Trust\nWhen in danger never hesitate to keep my fuckin' trap shut\nMy mom dukes got a little bit of thug in her\nThe devil loves sinners: crackheads and drug dealers\nSometimes I feel like the streets are takin' over\nNever stayin' sober, the brain over and over\nBacktrack, my stack's fat, I used to take new\nOne love to my crew, ayo, this one's for you\n\n[Interlude: 2Pac]\nR.I.P. … rest in peace to Mu grandmother\nKnow what we gotta do, baby, one-time\n\n[Hook: 2Pac]\nJust wait until rain turn to sunshine\n‘Cause I hate to spend my life\nMy life, my life, my life duckin' one-time\nJust wait until rain turn to sunshine\n‘Cause I hate to spend my life\nMy life, my life, my life duckin' one-time!\nOne-time! One-time! One-time!\n\n[Verse 3: EDI Mean]\nI was born 22 years ago yesterday\nBut see, I saw no reason for me to celebrate\nLet me demonstrate\nEntered the world from out a poisonous womb\nHeroin bein' consumed, already predictin' my doom\nSoon to be one of the many misguided\nAlways the first one on the block to be done, tried it and liked it\nLost before I had a chance to find my way\nNow I travel through life, not knowin' the time of day\nCrime for pay, I'm on my way\nBut don't know where I'ma end up\nI swear to God, it's just a set-up\nAnd these are the words from the mind of a lost soul\n\n[Hook: 2Pac]\nJust wait until rain turn to sunshine\n‘Cause I hate to spend my life\nMy life, my life, my life duckin' one-time\nJust wait until rain turn to sunshine\n‘Cause I hate to spend my life\nMy life, my life, my life duckin' one-time\n\n[Outro: 2Pac]\nAll of y'all, keepin' y'all in hell\nTo all of y'all, keepin' y'all in hell\nJust to see you smile and enjoy yourself\nTo all of y'all, keepin' y'all in hell\nJust to see you smile and enjoy yourself\n\nFor all my dogs, keepin' y'all in hell\nJust to see you smile and enjoy yourself\nFor all my dogs, keepin' y'all in hell\nJust to see you smile and enjoy yourself\nFor all my dogs, keepin' y'all in hell\nJust to see you smile and enjoy yourself\n\nThrow your hands up!\nThrow your hands up!\nThrow your hands up!\nThrow your hands up!", "image": "https://images.genius.com/7893982cf65937e95b38b8d431dcf885.500x499x1.jpg"}], "artist": "2Pac"}