{"songs": [{"title": "Tupac: Resurrection; THUG LIFE", "album": null, "year": null, "lyrics": "When I'm saying Thug, I mean not criminals; someone who beats you up and that\nI mean the underdog, the person that nothing succeeds; he's a thug, because\nHe overcome all obstacles, it doesn't have anything to do with the dictionaries\nVersion of thug, for me thug is my pride, not being someone who goes against the law\nNot being someone to take, but being someone who has nothing, and that he don't have nothing\nAnd there's no home for him to go to, my head is up high, my chest is out, I walk tall, I talk loud\n\nI'm being strong!\n\nI don’t understand why America doesn’t understand Thug Life. America is Thug life. What makes me saying ‘I don’t give a fuck’ different than Patrick Henry saying ‘Give me liberty or give me death’? What makes my freedom less worth fighting for than Bosnians or whoever they want to fight for this year?\n\nThey should give money to the ghetto\n\nI mean I think even gangs can be positive. It just has to be organized\nIt has to steer away from being self-destructive to being self-productive\nI organized the OGs on the East and West Coasts in penitentiaries\nTo come up with codes of ethics for criminals\nIt's called the Code of Thug Life\nIt's a code, putting order to the violence on the streets\nIn Watts, Compton, Chicago, wherever\nPeople all over the country say, \"We go by this code\n\"We're against attacks on people not involved with the street gang, the drug trade or the illegal business at all.\"\n\n\"All that kidnapping and shooting drive-bys, we against that.\"\nThug Life ain't just a bunch of niggas going crazy\nWe wanna patrol our streets. So all we saying is\nIf every motherfucker out here right now gave up one dollar\nTo this Thug Life fund, the money don't go to me\nIt go to somebody from y'all neighborhood\nAnd we do this shit every month. I'll bring new rappers\nI'll bring Snoop, whoever y'all want\nI'll go snatch them niggas. For that shit to happen, we can't have violence\nAnd everybody gotta be down for that shit", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}