{"songs": [{"title": "Fair Xchange", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Intro: Jazze Pha & 2Pac]\nLadies and gentlemen! (And gentlemen)\nThis, is a Jazze Phizzile produc-shizzle (Jazze Pha, Jazze Pha)\nMy nizzle! (My nizzle) Ha!\nOutlawz! (Outlawz) 2Pac, Makaveli!\nStill breathin', yeah, woo - wooo-WHEEE!\n\n[Verse 1]\nA picture of perfection, the object of a nigga affection\nPartners in passionate sex, a place to put my erection\nFantasies of you in submission, freaky positions\nPushin', pullin' and twistin' I'm on a mission got me on the mash\nTried to dig, you was screamin' when I did\nSteady yellin' out spots for me to hit, and \"aw shit\"\nSoon as I seen her saw us playin' hide the weiner\nWanna \"Freak Like Me\", fuck Adina\nUp and down is the object, side to side\nMake you holla out my name when a thug nigga ride, \"Can I cum inside?\"\nSay you don't feel it that's a lie\nYou just scared to get this Penitentiary dick\nThe trot caught your eye When I walked by\nI said, \"Hi\"\nBut you was so shy, I can't lie, damn near stuttered when you walked by\nYou want me to lick it and even worse\nGot your heart set on me goin' first, and that ain't no fair exchange\n\n[Hook: Jazze Pha]\nYou do me\nAnd if it's worth it baby, I'll return the favor\nAnd give it back to you (give it to you, give it to you)\nA fair exchange, on everythang\nAnd Let me tell you that's the way it's gotta be\nOpen your eyes baby, recognize a player\nGive it up to me (give it to me give it to me)\nA fair exchange, you know the game\nWe can do the damn thang, thang, thang\n\n[Verse 2]\nOpen your legs\nGot me marchin' like it’s a million, you tremble from the feelin'\nLook up, cause I got mirrors on the ceilin'\nAnd if you willin', then we can ride until the sun shine\nAnd just for fun, I betchu I can make you cum 61 times\nClose your eyes, let me heat it up\nCause when we fuck I refuse to bust a nut until I beat it up\nDrop the top, time to fuck while the wind blow\nBaby throw yo' legs out the window\nRemember on the balcony, bend over baby bounce on me\nAnd let me hit it where it counts and flee\nRemember me? \"I Get Around,\" and I'm haunted by my \"Temptations\"\nSexual participation, my motivation\nEven though I like the way you work it\nYou don't deserve it cause you walk around actin' like you perfect\nTook a while but I finally got it, and like a boss player\nBitch you ain't doin' me no favors, fair exchange\n\n[Hook: Jazze Pha]\nYou do me\nAnd if it's worth it baby, I'll return the favor\nAnd give it back to you (give it to you, give it to you)\nA fair exchange, on everythang\nAnd Let me tell you that's the way it's gotta be\nOpen your eyes baby, recognize a player\nGive it up to me (give it to me, give it to me)\nA fair exchange, you know the game\nWe can do the damn thang, thang, thang\n\n[Verse 3]\nNow yo' attitude ain't realistic\nYeah it's true I'm gettin' pussy, but baby you gettin' dick!\nAnd since you bein' laced with the penetration\nIt's only right to show a form of appreciation\nInstead of fakin' like you can't hear the bed shakin'\nIn bed naked you so twisted think yo' legs breakin'\nYou said \"take it\" so I'm blind in my passion, how long will I last?\nDoggy style steady pumpin' on that ass, until I blast\nAnd then I laugh as we lay back\nSee I wait 'til you asleep and that's the payback\nCause you actin' like you did somethin', givin' me a piece\nI had you mufflin' your screams in the sheets, fuckin' with me\nA true digger that love triggers, a thug nigga\nHustlin' bitches like drug dealers\nBefore I say goodbye, put an end to all the games\nHere's my number for another fair exchange\n\n[Hook: Jazze Pha]\nYou do me\nAnd if it's worth it baby, I'll return the favor\nAnd give it back to you (give it to you, give it to you)\nA fair exchange, on everythang\nAnd Let me tell you that's the way it's gotta be\nOpen your eyes baby, recognize a player\nGive it up to me (give it to me, give it to me)\nA fair exchange, you know the game\nWe can do the damn\nYou do me\nAnd if it's worth it baby, I'll return the favor\nAnd give it back to you (give it to you, give it to you)\nA fair exchange, on everythang\nAnd Let me tell you that's the way it's gotta be\nOpen your eyes baby, recognize a player\nGive it up to me (give it to me, give it to me)\nA fair exchange, you know the game\nWe can do the damn thang, thang, thang", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}