{"songs": [{"title": "Damien III", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[Verse 1: DMX and Damien]\nHey yo, D! It's your nigga D!\nWhat the fuck, you forgot about me?\nYou've been eatin' real good lately\nDidn't get a shout out on your last album, what, you hate me?\nSaid I was your dog\nSaid I was your nigga that let you see it all through the fog\nSaid I was your mans and them\nAnd any problem that you had I would handle them\nAyo, dog, it's like this, I fuck with you lightly\n‘Cause I knew if I fucked with you too deep you'd bite me\nGet mad at me, send niggas wantin' to fight me\nWhole time you fucked with me you didn't like me\nDog, where you hear that? Pssh, niggas talk\nPlus you know how shit flow in New York:\nWalls have ears, buildings heard\nSupposed to be shhhhhh, but spill the word\n\n[Hook: DMX and Damien]\nEverywhere that I go, everything that I see\nEvery place that I touch, I feel him fuckin' with me\nI'm gonna fly…\nWhy you lie?\nTold me it was Ryde or Die\nI'm gonna fly…\nEye for an eye\nWhat happened to my piece of the pie?\n\n[Verse 2: DMX and Damien]\nNow, dog, you know me better than that\nI could put you ahead of the pack instead of the back\nI could have niggas sellin' tapes instead of the crack\nCould have niggas fallin' down with lead in they back\nAin't much that I can't do when I want to\nI don't really need you; nigga, fuck you!\nWHAT?!\nNah, I'm just playin'; got a wife and kids?\nGood thing they ain't come across them triflin' kids...\nYo, what you mean by that? Mean by what?\nYou'se a grimy nigga f'real, I see what's up!\nI don't even know why I fucked with you from the door!\n‘Cause you know I can give you what you wanted and more\nI could've got it from Him! But you would've had to wait!\nBut I wouldn't have the weight! C'mon, don't hate!\nWhat happened to the right hand, Light Man?\nNah, that's Dark Man! Well, let's get it right then!\n\n[Hook]\n\n[Verse 3: DMX and Damien]\nNow I see you for who you are, it's like I know you\nSo I can't trust you as far as I can throw you!\nOh you don't know, you are the reason\nThat I go through what I go through? Let me show you!\nDidn't I promise you a Benz, lots of friends,\nCountless pairs of Timbs, these endless ends?\nYeah, but what did it cost me?\nMy life to be taken softly; man, back the fuck up off me!\nDon't fuck with me like that when I fuck with you like this\nDon't come at me like that when you know that you might miss!\nGo on about your business!\nIf any cat you send my way, ain't gon' be no witness!\nLORD JESUS C'mon, dog, look who you're fuckin'\nPLEASE HELP ME Whassup, dog? Man, you buggin'\nKEEP THE DEVIL Thug life, thought we was tight\nOUT OF MY LIFE! I'll be back, aight? Psych!\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}