{"songs": [{"title": "Dedication Intro", "album": "The Dedication", "year": "2006-08-01", "lyrics": "[Intro: Lil Wayne]\nYeah, you guessed accurately; it's me ladies and gents\nWeezy F. Baby, please say the Baby\nGangsta Grillz, all up in ya grill\nDrama holla at ya nigga\nI won't lose me ya'll\n(This is the Dedication!)\nRest In Peace!\n\n[Verse: Lil Wayne]\nSo now I'm burying the burner in the bomber\nI carry the concerns of my mama\nI'm married to the money and the power\nAnd still I got guns on my side for my private affairs\nYeah, I know that water get cold but I dive in it bare\nAnd swim through it alive and aware, I been through it\nYou probably never been to it, so now I dip through it\nAnd they respect me like a pistol, I'm hip to it\nI gets to it like just do it, I miss doing it\nA hundred shot drum, play 'em some clip music\nI am the drum major, the drum section waiting\nAll it takes is one signal you can get a cadence\nYou can get it catered, I'm at your service like a waiter\nWhen it's beef, I become a nigga neighbor\nI put potatoes on the heater no label later\nNow have me make mashed potatoes\nFrench fry niggas, I bench then fire niggas, bye niggas\nI wet em up like rivers, now flow by niggas\nI'm drip and dry fly, now squint your eyes bitches\nI dimpsy time bitches, hop out of new Bentley's\nI'm old school like a loose Winston\nLike since when they make bullet proof skin?\nI put it to ya chin, and grin, and sin, and then\nI sin again, and then I'm gone in the wind\nAnd I'm dumping my Scarlett O'Hara in the canal\nCause I'm not getting stopped wit cop paraphernal'\nNow I preparing a L, not preparing to fail\nCause my flow is for real like the Sahara in hell\nComparisons is irrelevant, I'm an arrogant male, yeah\nI can handle it, I can graduate Yale, yeah\nThey featherweight, I sporadically ill\nThe fuck out and you can automatically killed, yeah\nPeep the narrative of the New Orleans heritage\nYou can go get your evidence, I tell where and tell you when\nI was prescribing medicine, you was getting your lesson in\nI was getting my adolescence in\nLesser than God only, better than my last that's what strive for\nDwelling on my past I get high, so I light it up and smoke\nKeep that Mary Poppins poppin' like a toaster\nI'm Supercalifragilisticexpialidocious\nCan't forget that purple potion, oh shit\nYou ho niggas is ass that's ho shit\nSo shit, I blow bigger in MASH and laugh\nLike \"Oh shit!\"\nI'm the best, no shit\nWeezy", "image": "https://images.genius.com/d5aa064a83b316efd87b4aed4c2a27be.941x938x1.jpg"}], "artist": "Lil Wayne"}