{"songs": [{"title": "Freestyle", "album": "The 24th Letter", "year": "2002-01-01", "lyrics": "Uh, uh, uh\nNiggas getting trampled on, what's all the fuss about?\nSucking my dick so hard, I'm busting in they mouth\nAnd then I snuff em out, four to the mid', fuck what I did\nWith no regard for a bid, ripped you up, while you wit your kid\nSlid into the shadows, cause I'm dark like that\nI bark like that, jet black, but I spark like that\nWhere are they at, when I get thirsty, shit\nAin't a nigga strong enough to stand the worst it gets\nBits, and pieces are all that's that left\nNiggas so scared to death, they hold they motherfucking breath\nTil I pass, cause they asked/ass, and I smelled 'em\nThe s-p-e-l-l-e-d t-h-e-m, I spelled em\nTo make me have to swell one, eye up, lump up one head\nCatch a body with the shotty, pump up one dead\nRed alert, niggas is about to get hurt, do work\nTo skirts, like a jag on the merk, arf\nNight time is the right time for creeping\nVandalize your crib, rape your wife while she's sleeping\nI been off the deep end, since I was semen\nThat's why now, I'm such a motherfucking demon!\nScreaming, my bloody head off, shit on my mind I gotsta get off\nCan't even hold a joint, lest I let off\nA couple of rounds, from the big three pound, seven\nThat's about eleven hundred as of now\nHow-can-one-man-kill-so-many-and\nThe-sin-be-plenty-before-the-age-of-20 *sing-song like nice and smooth*\nLife ain't worth a penny in, my book faggot\nThat's why I took faggot shit, I'm a crook faggot\nFat loops leather jackets, I bag it, along with\nThe jewels smacking tools out the hands of fools\nOn the strength that they don't know what they holding\nNiggas caught me tail end cause the weight that I be sewing\nShit up cause I get up, off my ass and skate\nMaking more moves than u-haul, from state to state\nI speak the great, and if a nigga tells you different\nYou turn around you ask the nigga, \"the fuck is you be sniffing?\nCause when it come to riffing, I am the riff raffin\nGots to say nutting, niggas know they get had\n\nMotherfucker, Funk Flex, Vol. 3, The Final Chapter\nRuff Ryders, Irv Gotti, Def Jam..\nRight here, where my dogs at?\nGot them all for you baby I got them all\nI gots them all..", "image": "https://images.rapgenius.com/1434e8ee824f41e765821605650b321b.500x366x1.jpg"}], "artist": "DMX"}