{"songs": [{"title": "God Complex", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro]\nAnd God said let us make man in our image (Tech)\nAccording to our likeness (N9ne)\nLet them have dominion over the fish of the sea\nOver birds of the air, over the cattle, and over all the earth\n\n[Verse 1]\nProjected image across my soul saying can't (Die)\nMany death situations but that ain't (Why)\nI got the spirit of an angel mixed with demoniac ways of livin'\nSo this means I'll beat the evil out of a non-believer until praise is given\n(But I know)\nTorture is evil though it says in the (Bible)\nYou got to be righteous spirited for the (Arrival)\nI'm righteous and wicked but I wonder (Can I go)\nIf there's a heaven but on earth it's (Survival)\nConnected with angels but to demons (I'm vital)\nApproachin' with hate oh yes it's (Homicidal)\nLike denouncing Selena at (Cinco de Mayo)\nCertain death (Oh no) Oh no\nI'm on the road to heaven and hell\nDon't even bother me ever since eleven and twelve\nI've been that prodigy though life has never been swell\nSomewhere there's gotta be where a good Samaritan prevails\nBut they get straight sodomy\nSo I learned the ways of man\nGrands\nFillin my pants\nGun in my hand\nFor the demons on the land\nOn the other hand I really am\nAn-ghellic\nI ain't got to stress if you can't tell it\nLook into my eyes\nNo surprise\nI'm half cupid, half relic (Cha cha)\nHe who treads the path of the beast is also he who sins are repentable\nBut if you ever, ever ever ever heard of God then we gotta do away with the genitals\nDon't ever do somethin' you'll regret\nDo away with all these goody goody law abiding mothafuckas and let there be Tech nigga\n\n[Hook 1]\nIf anybody say \"Fuck me\"\nEverybody say \"Fuck you\"\n'Cause they know my shit's pure\nSoul serving and plus true\nIf anybody say \"Fuck me\"\nEverybody say \"Fuck you\"\nOdd one Tech got that God Complex\n\n[Hook 2 ] 2x\nGet on your knees and pray\nIf you step in our way\n'Cause we spray 'til they decay\nThe ones who hate everyday\nBut how long? (Must we flash and pop)\nHow long? (Must we show demons we can't be stopped)\n\n[Verse 2]\n(Can they fuck wit' chu?) No\n(Their brain frames are too) Slow\n(The villain will kill 'em with new) Flow\n(If ya hatin' me this is for you) Blow\nI've been too humble wit' y'all niggas\nTime to rumble wit' y'all niggas\nMe and Don Juan forever we gettin' figures\nMe and the Rogue Dogs are kickin' it gettin' richer\nAll these fools thinkin' they gonna stop me\nI'm about to make us a million just watch me\nEverybody thinkin' they heated but they sloppy\nNigga, that's why you never be sellin' copies\n(I will) Rise above all of you regardless of (My skrill)\nThat ain't got shit to do with Tecca the (N9ne skill)\nBust on you rapper cats and proceed to (Make mill 5-6 Vill)\nI be seein' 'em down at Mardi Gras gettin' flows off\nEverything gettin' showed off\nNot me, tryin' to mock me on record head gettin' blowed off\nFreestyle I admire\nBut every week you givin' away fire\nYour rappers license expired\nLeavin' nothin' to be desired\nOh God bless this particular rapper in K.C\nNo matter how hard you try, you can't fuck with me\nFirst, learn how to do choruses then try to get people to trust you\nIf anybody say \"Fuck me\" everybody say \"Fuck you\"\n\n[Hook 2] 2x\nGet on your knees and pray\nIf you step in our way\n'Cause we spray 'til they decay\nThe ones who hate everyday\nBut how long? (Must we flash and pop)\nHow long? (Must we show demons we can't be stopped)\n\n[Verse 3]\nIf I offended you in any way (Maybe the shoe fits)\nEither that or you just plenty gay (If you like me)\nYou don't give a damn you're just enjoyin' the flow\nTo all the people who were offended\nI'm about to offend you some mo'\nIs God\nWhite, brown, green, red, or even blue?\nIs he American, Arabic, Mexican, or even Jew?\nEverybody wanna be the special and wanna be the chosen few\nEverybody wanna be but they gonna be through\n'Til you do right by me, everything that you do is gon' be wack\nEverything you built is 'bout to crack\nEverything you did to me is comin' back\nNo where to scat\nAnd I say that\n'Cause I know Jesus Christ and God is black\nAnd they comin' back nigga!\nJeah! Nigga\nLike I said, me and Don Juan\nBest motherfuckin' rapper, best motherfuckin' producer\nGlobally, in Kansas City wherever nigga\nAnd all y'all haters, remember this!\n\n[Hook 1]\nIf anybody say \"Fuck me\"\nEverybody say \"Fuck you\"\n'Cause they know my shit's pure\nSoul serving and plus true\nIf anybody say \"Fuck me\"\nEverybody say \"Fuck you\"\nOdd one Tech got that God Complex\n\n[Hook 2] 2x\nGet on your knees and pray\nIf you step in our way\n'Cause we spray 'til they decay\nThe ones who hate everyday\nBut how long? (Must we flash and pop)\nHow long? (Must we show demons we can't be stopped)", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}