{"songs": [{"title": "Mula", "album": "Detroit", "year": "2012-09-12", "lyrics": "[Intro: Big Sean]\nG.O.O.D.!\nAfter God, after my family, I ain't gon' front\nAin't nothing more important than this success\nThan getting it, yeah\nWhere my real niggas that's gon' ride for me?\n(Free OCB, Paperchaser)\nWhere my fine freaks that's gon' ride me?\n(Doughboyz Cashout, whattup doe?)\nWhere my real niggas that's gon' ride for me? (Yup)\nWhere my fine freaks that's gon' ride me?\n(I'mma tell you like a rich nigga told me, Finally Famous nigga)\n\n[Chorus: Big Sean]\nAin't nothing more important than the mula\nAin't nothing more important than the mula\nHallelujah, hallelujah\nPraise God, hallelujah\n\n[Verse 1: Big Sean]\nTell the police I'mma stack this paper 'til I overdose\nWhodie holdie slowly back yo bitch ass up, you over close\nI overflow all over hoes, my niggas is over hype\nShooting up your Phantom\nNow they call your shit the Holy Ghost\nMercy, Lord would you please have mercy\nAnd protect me from the hoes\nThat when life ain’t sweet, they gon' desert me\nShut the fuck up and stand up when you see me\nLike I'm the verdict\nThat's respect, now I got your wifey\nAnd you back to using that Jergens\nHurting, sipping, spilling\nTipping, for my niggas who done passed way\nCharge your ass a \"fuck you\" fee\nAnd make you pay your tax today\nI'm on a secluded island, swear it feel like Cast Away\nPut that money in my shooter hands, and tell him blast away\nI feel like getting paper is my destiny\n'Til I rest in peace, get money recipe\nTold my mom \"Get what you want\nThen just leave the rest to me\"\nAin't no motherfucking rest for me\n\n[Chorus: Big Sean]\nAin't nothing more important than the mula\nAin't nothing more important than the mula\nHallelujah, hallelujah\nPraise God, hallelujah\nAin't nothing more important than the mula\nAin't nothing more important than the mula\nHallelujah, hallelujah\nPraise God, hallelujah\n\n[Verse 2: French Montana]\nAin't nothing more important than the mula\nDiamond rings, hundred chains, Slick Rick the ruler\nI got cars, cribs all in my neck\nGot them M's all in that bank\nGriff, Blake all in that paint\nStacking bread, come watch me plank\nPray to never dying broke\nGetting cases by the boat, we ain't shopping, buy the store\nShorty snorkel for that crab, eating lobster on my dinner plate\nStacking all this money homie, tryna see that ceiling break\nMula ain't everything homie, it's the only thing\nCame from a hall of piss, straight to the hall of fame\nTalk money, we got it, fuck boy, shoot your stylist\nEating good, I ain't brolic, I'm just chasing them commas\nMy niggas ride that five, and my bitch a ten\nGot that China white, call it Jeremy Lin\nAin't nothing more important than the mula\nMy chain, a fridge, deep freezer, and a cooler\n\n[Chorus: Big Sean]\nAin't nothing more important than the mula\nAin't nothing more important than the mula\nHallelujah, hallelujah\nPraise God, hallelujah\nAin't nothing more important than the mula\nAin't nothing more important than the mula\nHallelujah, hallelujah\nPraise God, hallelujah\n\n[Outro: Big Sean]\nWhere my real niggas that's gon' ride for me?\nWhere my fine freaks that's gon' ride me?\nWhere my real niggas that's gon' ride for me?\nWhere my fine freaks, fine freaks, fine freaks?", "image": "https://images.genius.com/6b6ac4eb55acf7dda757b1f6c6081c31.500x500x1.jpg"}], "artist": "Big Sean"}