{"songs": [{"title": "F.U.N.", "album": "Blood Moon: Year of the Wolf", "year": "2014-10-14", "lyrics": "[Intro]\nAll I do is get drunk and high\nI be fucking nigga's bitches and they be mad as fuck\nI be like\n\n[Hook]\nMan fuck you niggas\nI rob you niggas\nI kill you niggas\nCause I don't feel you niggas\nI said fuck you niggas\nI rob you niggas\nDon't make me kill you niggas\nNo I don't feel you niggas\nMan fuck you niggas\n\n[Verse 1]\nI told niggas in '05 I don't fuck with Maybachs\nYou wanna hate up, come outside, just fuckin' say that\nTwo things I learned, nigga gotta stayed strapped\nAnd niggas ain't goin' down without a Dr. Dre track\nBlack boy fly, niggas watch me grew\nNiggas studies my beefs and couldn't stomp my flow\n(Cause I'm dangerous)\nNiggas think they fucking with me\n(Stop smoking angel dust)\nNiggas think they smoking on this chronic\n(The same as us)\nCome within (range of us)\nBullets (your brains are bust)\nMinisters get shot, two of these niggas (came to us)\nYou broke your rent doing your bitch want me\nI'm off this OG kush and you the lil' homie\nNigga wanna borrow some weed, I got a lil' homie\nWatch how I'm driving, can't let the double cup spill on me\nSame block and stop snitchin', mother fuckers still on me\nG-Unit had a reunion\n\n[Hook]\n\n[Verse 2]\nThat's on Compton, you looked in the closet with a monster\nI eat you alive (man fuck you niggas)\nIt feel like Tommy Hilfiger, fuck niggas I say it again\n(Man fuck you niggas)\nI feel like Remy Ma when she got out of the jail\nLook back at the prison like (man fuck you niggas)\nAnd this time I'm going for the gusto\nR.I.P. Justo, will I fall off? Fuck no\nCalifornia mind nigga, pull it like a truck boat\nThese crips, these bloods, these esés, they playin' cut throat\nYou a fish out of water, every MC gets slaughtered\nIf you ain't Nas, Eminem or fuckin' S dot Carter\nI tie up your wife, pull out my dick jack it off, kiss the knife\nBefore I cut her, take my jacket off, fuck her then hit the lights\nRub it in there like Detroit streets, with pictures of me\nFuck her till cops come, then I'm bustin' like\n\n[Hook]", "image": "https://images.genius.com/3c242f72b054b6d20e2e8fd97f060d73.1000x1000x1.jpg"}], "artist": "The Game"}