{"songs": [{"title": "500 Days of Summer", "album": "Young Sinatra: Undeniable", "year": "2012-04-30", "lyrics": "[Intro]\nI did it today, I made myself say\nAnd I take back my tears, my sight, my love\nNo more does your magic work, on my heart\nNo more will your words ever tear me apart\nI know now for certain, nothing's burning anymore\nAnd I came strolling alone\nLike your perfect girl in your perfect song\nYou'll forget who fixed you, in a little while\nI know for certain, there's nothing burning anymore\nI know now forever, nothing's burning anymore\n\n[Skit: Tom Hansen in [500] Days of Summer]\n\"I love her smile, I love her hair, I love her teeth. I love this heart-shaped birthmark she has on her neck. I love the way she sometimes, licks her lips before she talks. I love the sound of her laugh.\"\n\n[Verse 1]\nI can feel it now, it's coming soon\nIt is my world, my sun and moon\nOnce upon a time, this world was love\nBut now I know this is everything that I've dreamed of\nSo take it slow, speed it up\nEvery time I see you I just want to beat it up\nMaybe not, but that's a lie\nC'mon baby girl, there ain't no need to cry\nJust let me go or let me know\nWhy the hell you wanna stick around fo'\nArms length, that's all you do\nDon't get too close, that is the rule\nI remember when I met her back in high school\nScience class, sitting on the stool\nNow I'm feeling—feeling like a fool\n'Cause I cut that tie months ago, this girl is cruel\nOr maybe not, just very lovely\nNo matter what she says I know she still loves me\nSo can I love?—I've already asked\nWho would've known matters of the heart\nWould be such a task?\n\n[Skit: Tom Hansen in [500] Days of Summer]\n\"I hate summer, I hate her crooked teeth. I hate her 1960s haircut. I hate her knobby knees. I hate her cockroach-shaped splotch on her neck. I hate the way she smacks her lips before she talks. And I hate the way she sounds when she laughs.\"\n\n[Verse 2]\nShe used to be my girl\nBut now she just a girl I'm fucking\nShe used to mean the world to me\nBut now that world is nothing\nI would've put a ring on that finger but I couldn't afford it\nSo I laced it with ribbon, she adored it\nSometimes I wonder if she thinks of me\nBut my mind tells me to focus on work so instinctively\nHow could the pussy be that good?\n'Cause my feelings involved\n'Til my shorty evolved and her feelings dissolved\nBut that's what happens when you find them young\nTreat them like royalty, and they will run\nSearching the world for perfect love and realize you're the one\nBut they fucked up cause now that shit is done\nThis is a letter to the woman of my dreams\nLove what she brings\nSo listen baby girl cause everything ain't what it seems\nYou either know me now or I'mma meet you after fame\nBut one thing's for sure, your life will never be the same\n'Cause you're gonna be my wife and my mistress\nSo understand now I can't be there for every Christmas\nI love you more than anything, but I could never risk this\nOn stage living life, while you're forced to miss this", "image": "https://images.genius.com/4cb73fd1e86a44f861bc4ba694c17126.1000x1000x1.jpg"}], "artist": "Logic"}