{"songs": [{"title": "Chase the Cat", "album": "Chase the Cat", "year": null, "lyrics": "[Too $hort]\nWhy..\nWhy..\n\nI'm a junkie, looking through my book\nI can't be cured, I know I'm hooked\nI gotta get out the house, I'm so hard\nChasing that cat all over the yard\nBut why, do I chase the cat?\nBeen at it so long since way back\nWhy would I want to be a player for life?\nSpitting this game every day and night\nI'm talking, body language, facial expressions\nFuck a flight attendant on a layover session\nShe's serving my dick\nFalling in love, but she ain't my bitch\nWhy do I need to be in between her\nSince the first time I seen her?\nHit it from behind, now she want to be mine\nI'm all up in her feline\n\n[Hook: Dolla Will]\nWhy must I, chase the cat?\nShe got ghetto ways, plus she pays, give me my money\nWhy must I, chase the cat?\nYou see ain't nothing changed, but the game, pimping ain't easy\n\n[Dolla Will]\nUh, being settled down, just ain't for me\nHold hands, walking down the aisle, about to get married\nI thought that once, will never think it again\n'Cause I'm a player in the game and I'm playing to win\nThere's too many fine hoes to be stuck with one\nToo many wet pussies just to be fucking one, shit\nIt's like a disease, like JT in \"Five Heartbeats\"\nIt's impossible for me to be with one freak\nYou can't live with them, you can't live without them\nI never would trust a bitch and I don't doubt them\nCause I'm a dog that love to chase the cat\nIf you a fine bitch, I might put my face in that\nIf you do me first, then I'll do you\nAnd the game jumps off when the bitch is through\nHoes nowadays be as bad as us\nThey love to suck, fuck and bust fat ass nuts\n\n[Hook]\n\n[Too $hort]\nEver since I was a youngster, new to the game\nI was going to the mall, \"Baby what's your name\nAnd your number?\" - I never been under\nAlways been a outright player no wonder\nI been through so many hoes in the last 20 years\nBitch getting fucked, bring her ass up in here\nI keep two or three hoes on deck\nToo $hort baby don't take no shit\nI'm a pussy junkie, and bitches always want me\nBut my first love is money\nAnd I'll forever be faithful to her\nI won't give her to a bitch just to do her\nAnd play with her kitty\nGot some nigga's name tattooed on her titty\nI see a cat and jump the fence\nMy name is $hort Dog and I'm a pimp, bitch\n\n[Hook: Dolla Will]\nWhy must I, chase the cat?\nCause you know.. she's a ho..\nWhy must I, chase the cat?\nWhaddya know.. she gives me dough..\nWhy must I, chase the cat?\nShe got ghetto ways, plus she pays, give me my money", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}