{"songs": [{"title": "Champion", "album": "NBA 2K10 Soundtrack", "year": "2012-11-30", "lyrics": "[Intro]\nAy yo Cool\nTell Dre I been doing some thinking\nDon't know how to say this\nHate it or Love it was whack!\n\n[Verse 1]\nGuess who's back, dressed in all black\nBrooklyn dodger and that dinky hat\nI'm a big dog, can't tame the cat\nI'm a gangsta this ain't entertainment rap\nYou know the black Louis belt with a stainless hat\nCrenshaw Boulevard where I'm famous at\nNo more sunshine cause the rain is back\nFlow shady, bitches like I can't get black\nI'm the dope game of rap, my dope game is back\nMy lyrics dress like Mos Def, I bring the 80's back\nWith one bar, I can change the way niggas think about me compared to say\nA Jay, a Nas, a Cube, nah I'm too hard\nI'm 2 Pac's and I still got drug money in that shoe box\n\n[Chorus]\nChampion, number one\nTake your hats off and throw em' in the sky\nYou be fucking with a\nChampion, number one\nTake your hats off and throw em' in the sky\n\n[Verse 2]\nI'm like Tim Duncan dunking\nBig pappy wanna see something\nHome run, game is on one\nYeah I'm back in the black Air Force Ones\nJordan tagged on the back\nDamn how the fuck Jordan do that?\nAsk Barn Russell how the fuck Jordan do that\nI'm a gangsta, nigga true that\nJust moved outta Compton don't make a nigga move back\nYo Dre, where Cool at?\nTell him he can hate it or love but guess who's back\nBo know this, Bo know that but Bo didn't know Eli could beat the Pack's\nLike Dre didn't know I could beat the rat\nKnock em all out the car then break their backs\n\n[Chorus]\nChampion, number one\nTake your hats off and throw em in the sky\nYou be fucking with a..\n\n[Verse 3]\nBoss hard no Dukes of Hazzard just a little Pac'n knife cutting through the mattress\nTake the bricks out, put the chips in\nDance the track Pharrell, put the clips in\nThat's my life and The Vibe's a crip\nBut like my uncle Ray say when he drunk off a fifth\nTalking shit, clean his Vietnam AK\nYou shoulda seen Joe Louis in his same thing\nAll rob B, Uncle Ray never seen Floyd Mayweather box on payday\nNiggas don't want a box they stand\nNiggas don't wanna floss, I stop, they stare\nCome through with a drop so rare\nA drop that hood niggas can't cop nowhere\nYou might as well throw your rocks in the air\nI defy gravity and I stop it there!\n\n[Chorus]\nChampion, number one\nTake your hats off and throw em' in the sky\nYou be fucking with a\nChampion, number one\nTake your hats off and throw em in the sky", "image": "https://images.genius.com/990632dcd8b390c77635ce272cba9b1b.400x400x1.jpg"}], "artist": "The Game"}