{"songs": [{"title": "Life Is... Too Short", "album": "Life Is... Too $hort", "year": null, "lyrics": "[Verse 1]\nI remember how it all began\nI used to sing dirty raps to my Eastside fans\nBack then, I knew you couldn't stop this rap\nNo M.C. could rock like that\nThen the new style came, the bass got deeper\nYou gave up the mic and bought you a beeper\nDo you wanna rap or sell coke?\nBrothers like you ain't never broke\nPeople wanna say it's just my time\nBrothers like me had to work for mine\nEight years on the mic and I'm not jokin'\nSir Too Short comin' straight from Oakland\nCalifornia, home of the rock\nEight woofers in the trunk, beatin' down the block\nShort Dog, I'm that rappin' man\nI said it before and I 'll say it again\n\n[Hook]\nLife is too short\nToo short\nLife is too short\nToo short\n\n[Verse 2]\nLife is to some people unbearable\nCommitting suicide and that's terrible\nWas it much too much or nothing big?\nIf you live my life, you'd be fightin' to live\nLife is to me my main asset\nI be doin' all right and keep it just like that\nChill out at the house and pump that bass\nI'm tryin' to get rich as I rock the place\nEverybody's got that same old dream\nTo have big money and fancy things\nDrive a brand new Benz, keep your bank right here\nNever hear me stutter once 'cause I talk real clear\nIt's on you, homeboy, whatcha gonna do?\nYou can take my advice and start workin', fool\nOr you can close your ears and run your mouth\nAnd one day, homeboy, ya soon find out\n\n[Hook]\nLife is too short\nToo short\nLife is too short\nToo short\n\n[Verse 3]\nLife is too short, would you agree?\nWhile I'm living my life, don't mess with me\nIt's been a long time, baby, since I first got down\nBut I still keep makin' these funky sounds\n'Cause I don't stop rappin', that's my theme\nI make a lot of money, do you know what I mean?\nLife is, complicated, you must stay up\nYou're asked a simple question boy, don't say \"What?\"\nYa only live once and ya callin' it hell\nPoliceman tryin' to take ya to jail\nYou could give a man time but you don't know\nIn a matter of time, I'll be runnin' the show\nNow another young buck wants to be on top\nMakin' big money, slangin' hop\nThe task force tryin' to peel your cap\nTurn around, homeboy, you better watch your back\n\n[Hook]\nLife is too short\nLife is...\n\n[Verse 4]\nYou can take back all the things you give\nBut you can't take back the days you live\nLife is to some people heaven on earth\nLivin' every single day for what it's worth\nI live my life just how I please\nSatisfying one person I know, that's me\nWork hard for the things I achieve in life\nAnd never rap fake when I'm on the mic\n'Cause if a dream is all you got, homeboy\nYou gotta turn that dream into the real McCoy\nNo time to waste, just get on that case\nCan't be down 'cause you need to taste\nA good life, livin' like a king on a throne\nGetting everything you want and trying to handle your own\nIt's your life, don't be stupid though\n'Cause when you waste it, you'll know life is...\n\nLife is...\nAlright, that's it", "image": "https://images.genius.com/9ed3ca4bcc64d64446ff7e9bea94be4e.600x600x1.jpg"}], "artist": "Too $hort"}