{"songs": [{"title": "We Made It Freestyle", "album": "King Soulja II", "year": "2013-12-28", "lyrics": "[Intro 1: Eastbound & Down (Kenny Powers)]\nThe only thing I'm seein' I'd like to put an amend on, perhaps a little more room here for the fixins, you know what I'm talkin' about? Oh, we gon' have a lot of fixins. We gonna have so many fuckin' fixins up in this motherfucker, this shit gon' go through the roof. Got damn I'm shittin' gold these days\n\n[Intro 2: Soulja Boy]\nSoulja Boy, Drake\nOh, we made it\nTurn me up just a little bit in the headphones\nWorldwide, international\n\n[Chorus: Soulja Boy]\nNigga we made it, ayy\nWe made it\nNigga we made it, ayy\nDamn, we made it\nNigga we made it, ayy\nWe made it, ayy\nNigga we made it, ayy\nWe made it\n\n[Verse 1: Drake]\nYeah, she said she workin' for Walgreens but not in the store, at the head office\nThe head was so good it makes sense why you work at the head office\nIn 2007, I sat in the lobby of Motown and waited\nNow I walk into the buildin' and go off like \"Nigga we made it!\" (Go off)\nWhen I walk through these halls, man this beat should be playin' (Go off)\nI just came to make sure you not missin' no payments\nNow turn this shit down while I issue my statement\nIt needed a moment of silence, nigga we made it!\nYou fly out your lady, I fly out my latest\nBitches can't front on the kid anymore, man they know what my name is\nAnd if by chance she don't know who I am, she just know that I'm famous\nI'ma just hand her a business card and say \"Nigga we made it!\"\nAnd she gotta come through the hotel and pop it off for me\nThen she gon' text her best friend like \"Girl he got some good dick and money\"\nHer friend hit her back like \"I know that already, that nigga's amazin'\"\nThen I send a message to both of they asses like \"Nigga we made it!\"\n\n[Interlude: Kenny Powers]\nKinda makes me wonder why the hell so many people are tryna tell me to slow down. Seems like motherfuckers should be shuttin' the hell up and enjoyin' the show\n\n[Chorus: Soulja Boy]\nAyy, we made it\nNigga we made it, ayy\nDamn, we made it\nNigga we made it, ayy\nWe made it, ayy\nNigga we made it, ayy\nWe made it\n\n[Verse 2: Drake]\nYeah, if they with me, just know that they wit' it and 'bout it\nIf I said it, I meant it, there's no way around it\nOVO, Reps Up, and P. Reign is next up, watch Gway go crazy\nWhen Baka came home for the holidays, I was like \"Nigga we made it!\"\nAnd all of those lawyer fees, nigga I paid it (Go off)\nMy family get all of my loyalty, all of my patience (Go off)\nMy life for your life, man I wouldn't trade it\nI would just look at you dead in yo' face and say \"Nigga we made it!\"\nI swear that we made it, sell out that ting, I'm the king in Jamaica\nBut I've been on that wave, that's why this year I tell ya, I don't need no favors (Go off)\n(Damn, Soulja Boy stunt on them haters)\nAnd my resolution for New Years is nigga we made it!\nYou don't know how long I waited, I coulda been waitin' on tables, my karma's amazin'\nI'm out in the Caymans, rented a 12-bedroom house just to sleep all the women we came with\nThat's ignorant, ain't it? Sometimes I question myself when I think 'bout the pictures I painted\nThen I pick up my brush and I sign at the bottom like \"Nigga we made it!\"\n\n[Chorus: Soulja Boy]\nAyy, we made it\nNigga we made it, ayy\nDamn, we made it\n\n[Verse 3: Soulja Boy]\nI remember standing in the hood\nTellin' my partner, and my momma, everything gonna be all good\nNigga we made it! Damn, I'm up in Las Vegas\nDamn, I never was supposed to have shit, now my life is lavish\nEvery night, fuckin' a bad bitch, nigga we made it!\nCoppin' a Lambo, cash, the Bentley, two times I crashed\nHa, nigga we made it!\nLook at them niggas' faces, them niggas, they hate it\nI look a nigga in his face and say \"Nigga we made it!\"\nSoulja Boy stunt on them haters\nAnd these days I don't need no favors, ayy\nNigga we made it!\n\n[Outro: Soulja Boy]\nYou already know man\nPhone call back to the old hood, see what's goin' on\nBrrt brrt, nigga we made it", "image": "https://images.rapgenius.com/1c1cbe41f897b2b27cec98af80dee9e0.500x500x1.jpg"}], "artist": "Drake"}