{"songs": [{"title": "High", "album": "Detroit Underground 2000 Volume II", "year": null, "lyrics": "{*\"Yo yo, yo yo yo yo yo-yo\" repeated in background throughout\nThe whole song*}\n\n[Verse 1: Swifty McVay]\nYo.. uhh, where your mom at? Uhh, uhh\nWatch these motherfuckers macks like Guilian, a hooligan\nNiggas see my face and be like \"OH MY GOD, IT'S YOU AGAIN?!\"\nIt don't matter what crew you in\nI let loose and sent slugs, all in your face like hallucigens\n(ahh!) You had no clue to what the fuck we do to men (uhh)\nSmash 'em heads with aluminum (yeah), bats if I ain't shootin 'em\n(take that!) I collect the loot you spend, to whom it may (bitch)\nConcern, you learn not to fuck wit Swifty McVay\nYou'll burn nigga, I get into ya\nLike Drew Barrymore wit clamedia, I'm gettin rid of ya\nNow all the witnesses be (uhh, yeah, uhh) pointin fingers I'm serial\nWhen I bomb first, it's gon' be worse than bicentennial\n(haha) All ya appear when expected like cold soars\nWhen in World Wars, puttin slugs through whore's doors\nThe chance is all yours, so motherfucker take it (uh-huh)\nTreat ya life like it's sacred or get robbed butt-naked (uhh)\n\n[Verse 2: Bizarre]\nGuess who's back, it's Mister Fuck-All-Y'all (what!?)\nYa niggas get my balls, quick to break all ya laws\n(yeah) I'm smokin hashin green wit the mayors\nSmack the mic out ya hand, quicker than Lawerence Taylor\n(haha) I shoot up ya whole block for no apparent reason\nNiggas ain't comin back like Barry Shunder's next season\n(ya down!) Bizarre from the Outsidaz, smoke like easy riders\n(haha) Hindu niggas off like a plate of appetizers\nYour girl talk trash (shut up!) nigga I'mma buck her\n(That bitch got AIDS) What that gotta do wit me fuckin her?\nDisrespect my squad, watch me start swarmin (uh-huh)\nYou hear so much stuff you just think Kurt Franklin was performin\nBizarre half dead, full of dough and bread (what?)\nMake opponents fit with your local crackhead (uhh)\nI'm doing a promo, live at the (?) (yeah)\nWith some homos drippin wit the electrifyin mojo\n\n[Hook: Kon Artis]\nCause the only motherfuckers that'll die tonight\nSmoke weed and cocaine just to get you high\nMotherfuckers come prepared cause they startin to fight\nStab you dead in your back wit a rusty kniiife!\nCause the only motherfuckers that'll die tonight\nSmoke weed and cocaine just to get you high\nMotherfuckers come prepared cause they startin to fight\nStab you dead in your back wit a rusty kniiife!\n\n[Verse 3: Kuniva]\nAiyyo, talkin shit will only get you fags high (uh-huh)\nYou gon' get your dad shot, take his portable labtop (gimmie that)\n(hey!) You probably heard that you now we stealin halfs\nAnd food stamps, dining room sets and gold lamps (uh-huh)\nI'm drunk as hell cussin out old tramps (shut up!)\nLike the boy scouts did up camp and hit more licks than stamps\nI'm quick to crash, let the shottie blast\nGrab the dolly and drag the bodies of niggas that lolly gagged\nFinish; you might as well climb in this body bag\nSo the E.M.S. won't waste time puttin your ass in it\n(hey) I'm out cold like bums and frost bite in blizzards\nDirty Dozen be payin rappers, run freely, visit {*PUNCH*}\nA big portion passed a normal artist with a deal (uh-huh)\nI'm heartless, comin outta battles scarless wit the skill\nFor real, I feel I was born to lyrically kill at will\nWit the power to sell wheel I'm killed (I'm serious!)\nDamn my man is ill, so don't you get caught\nKuniva, obliterate rappers with just a meare cough\nI'm fierce, hungry on the prawl so you're aloud to run\nBefore I drop the mic and jump in the crowd with a gun\n{*PUNCH*} Shootin blind, hittin turntables and speakers\nDJs and bouncers be catchin bullets through they beepers\n\n[Verse 4: Kon Artis]\nYo, yo, uh-huh\nI embrace violence (uh-huh), loud mouth to hate silence\n(yeah) A grace tirent to encourage kids to go rob (?)\n(smoke weed) A bus driver that's near-sighted\nI could see ass but not people\nI'm supposed pick up from stops cause I ride passed it\n(hey stop!) Who the hell you know jump in a lake of piranas\nGo to church just to slain ganja and driven off drama\nFuck ya mama, I'd kill her for stackin shit that high\nYour nose got shot cause I missed your eye\nA wise guy who get high off his own supply\nZombie fire ya own family and make you verify\nThe corpses, had his horsemen and'll leave your stage torchin\nScreamin \"Beat\" as soon as I show, ya niggas fault then\n(let's leave!) Beats bang, got ears bleedin throughout this\nThat's why people ignore you, like you ain't even talkin\nYou chit-chatted and got splatted by disease\nBe attict and spits spontaneous like Greg Maddux\nI cut 'em off crooked in ganja green\nYa mans is high, get ignorant, or beats, by loosin his spleen\nYour troop'll be seen as soon my team get on\nWe ruinin citys like \"Godzilla\" through Hong Kong\nYou ding-dong dummys ain't dumb enough to try and dodge bullets\nAs soon as I pull it, I douse 'til you're full of it\nI love beef, I'm mackin lit wit the heat\nMy technique is well spoken even when I don't speak\nI sent a nigga twistin wit heat\nSo many times that when he knownful he facin the back of his feet\n\n[Verse 5: Hush]\nI'mma fall to those sworn, I split your capricorn\nAnd forewarn your first born and forms a snow storm\nI flip caps, like Kittins on gym mats and get under your skin fast\nBattle me, I'm Slim (?), I crack brains like egg shells\nAnd scramble your brain cells and shatter your veins well\nThe fatter the pains well (hahaha)\nWho wanna jump, plainly rob with this pistol? (what?)\nStep back, drew heat without heal like I was Sisqo\n(ahh!) Sicko, individual, from the get go (uh-huh)\nStab you wit the pencil just to watch the blood trickle\nTickle you to death then I rhyme like Don Ripples (hahahaha)\nCrack you in the back with an ax, I hide sickles (AHHH!)\nI got three dimes in my hands and three nickels (uh-huh)\nLeavin a bad taste ya mouth like sweet pickels (haha!)\nI'll ask to borrow ya car then drive through a police station\nJump out then start shootin like a bunch of crazed Haitians\nPlus I'm too skinny cause my attitude is shitty\nPlus my record label shifty, it's enough to make me pretty\n(what?) I'll make you mother hate me, you could place ya car bets\n(what?) Call me a vigilante like my man Benard (?)\n\n[Hook]\n\n[Verse 6: Paradime]\nThe only things missin is for me to shatter these bastards\nCause I breathe toxic fumes and spit battery acid\nAnd had to be a drastic\nSituation for you to step through the ghetto snort size gun powder\nAnd pounce fortys and jet fumes, NECESS FUEL!\nWe make the shit shake, to break the break\nTo tearin rappers out the brain, like ex-bitches picture\n(ha) So look when I'm tore up off liquor\nI'll steal ya mics and beat your DJ down with his own muh'fuckin mix uhh\n(bitch, stay down!) The name is Don I spit on rappers and they wifeys\nBang yo' bitch when you ain't home and walk out wit yo' Nikes\n(your lyin) Yeah I might be (what?)\nJust ask her where she got them bruises on her ass\nCause all 'em knucks stay on the night (shut up bitch)\nThe mighty whitey, I drive you rappers fuckin crazy\nYou wonderin \"How the hell my lady had this white baby!\"\n(what?!) In the richest city, the crew and 'em suit me name\nLeavin you (?) like J.F.K. and juniors playin\n\n[Verse 7: Uncle Ill]\nI'm nasty, I hack a loogy in your face {*HACH*}\nThen dig in my ass crack before I fix your dinner plate\n(eat this) For evil sakes, I kill man for penny weight\nWhat plenty hate, I took out my many dates (bitch)\nI'm the addition that make you fled pissin\nIf you stay there they'll find your body with your head missin\n(AHH!) You're dread dissin, so it wouldn't be wise too\nYou know you biggers fuck but they make coughers in your size too\nTrespass, and you will get your chest mad\nThe Lord's prayer, it would keep you outta (?) well\n(Our father, AMEN!) I love drama, I make fems like Madonna\n(Like a Virgin!) I'm fuckin ya moms, granny, and great grandmama\n\n[Hook]\n\nYo, hahaha, what? Hahaha, yo yo yo, Da Ruckus in the house\nI thought ya KNEEEW! Hahaha, haha, Bizarre - ill or not\nDetriot City Y'AALL! Yeah, Swifty McVay, don't stop boy\nThe game, hahahaha-ha, D-12, where your mama at?\nDa Ruckus, PEEIN, I'm PEEIN ON YOU, I'm PEEIN ON YOU!\nWhat the f.. I'm PEEIN ON YOU! Yo we out, hurry up\n\n[Hook 2X]\n\nCause the only motherfuckers gonna die tonight {*music fades*}", "image": "https://images.genius.com/13189ad7d4d01e3827b9df557176039c.926x926x1.jpg"}], "artist": "D12"}