{"songs": [{"title": "Die Alone", "album": "SHADYXV", "year": "2014-11-24", "lyrics": "[Intro: Kobe]\nJust so you don't die alone\n\n[Verse 1: Eminem]\nI roll over and go to reach for you, you're gone\nThis bed's empty without you\nYou said you're moving on\nBut I'm having some trouble getting there\nBut dwelling ain't getting me, uhh, anywhere\nFuckin' Valentine's Day\nFuck February, stuffed teddy bear, guts everywhere\nMachete on the floor, I smashed up every mirror\nYeah, how do I look?\nYou fuckin' just left me here to die didn't you?\nWhy didn't you respond yet?\nI've written you five or six different times and\nI'm gettin' sick and tired of always apologizing to you\nI didn't do shit to deserve what you're puttin' me through\nThis couldn't be true, we can't be over\nSo violets are blue, roses are red\nWhy is it everything I do I'm reminded of you?\n\n[Chorus: Kobe]\nSaw two white coffins in my dreams last night\nI saw my Lord Jesus with his hands pointed toward the light\nSaw my old sweetheart, she said, \"Honey, I'm back\"\nJust so you don't die alone, just so you don't die alone\n\n[Verse 2: Eminem]\nGuess I gotta deal with the fact that, you ain't never comin' back\nNow every woman that I look at I'm lookin' for you\nSo I'm findin' something the matter with them\nExcuse to not see anyone\nUseless, rather pick up the phone, not at all, followin' protocol\nI get bold like bowling balls\nGrow balls and go to call to talk, forget what I want to say\nDamnit I'm drawin' blanks like I'm playin' hangman\nI'm sick of playin' these games, I can't handle this heartbreak\nIt's makin' me wanna blow out my brains\nLike birthday cake candles\nHang up the phone and I shake, I think I may have made a mistake\nCan't escape the madness\nTurn the radio on, I hate this sad song\nBut I can't even change the station\nThe same one's playin' on eight channels\nI lay awake in shambles, I'm startin to hallucinate\nI'm havin' all these visions of us at each other's wakes\nIn caskets and suddenly I wake and that's when I know I\n\n[Chorus: Kobe]\nSaw two white coffins in my dreams last night\nI saw my Lord Jesus with his hands pointed toward the light\nSaw my old sweetheart, she said, \"Honey, I'm back\"\nJust so you don't die alone, just so you don't die alone\n\n[Bridge: Kobe]\nGive me one more, bottle for the pain\nGive me one more for the memories\nGive me one more, I'll make it taste like a steak\nIt'll help alleviate\nIt'll soothe this ache\nOf trying to fake\nThat she's really, she's really coming back\n\n[Verse 3: Eminem]\nAnd it's been a while now, but I finally realize how\nMuch reality sucks, but it's just something about our love\nI'm still in denial now, dealing with the finality of\nAnd it's making me crazy thinking of the days we, spent\nAnd how I'll never hold you again\nAnd there ain't shit I can do about it\nNow my head is overcrowded\nWith these clouded memories and I can't seem to get you out it\nAnd how the fuck do you sleep comfortably\nKnowing what you done did to me, huh?\nDid it even occur to you that I loved you?\nCompletely, deep, and madly head over heels for you?\nWas you and me, once used to be together forever\nIt was supposed to be us, but you crushed the dream\nWe was supposed to die together, and it's killing me so much\nWhen I sleep I wake up dead, must be why I\n\n[Chorus: Kobe]\nSaw two white coffins in my dreams last night\nI saw my Lord Jesus with his hands pointed toward the light\nSaw my old sweetheart, she said, \"Honey, I'm back\"\nJust so you don't die alone, just so you don't die alone", "image": "https://images.genius.com/acc348ccdf6bd18c7aee7ae7c6c3d865.1000x1000x1.png"}], "artist": "Eminem"}