{"songs": [{"title": "Twerk it Remix Nicki Minaj", "album": null, "year": null, "lyrics": "[Intro:]\nYO!!!! YUH DUN KNOW!!!!\nTHIS TIME WHEN WE COME IN WE COME FI FLATLINE\nEVERYTING INNA THIS BUMBOCLAAT 'TIL CLASH DUN!!!\nFI REAL!!!!!!!!!\n\n[Verse 1: Busta Rhymes]\nBig man! When mi talk, hear weh yuh fi do\nShut yuh mout, listen close, weh we come fi do\nShut it dung, lick a shot, blow torch a bun\nNuff excitement, see dem frightened watch dem bwoy yah run (FI-FI-FI REAL!!!!!!!!!)\nCome hear gyal, weh yuh a do, hmmm what a gwaan?\nDun wid dat, (Dutty Wine) Tony Matterhorn\nBass a lick yuh, mek it clap, gwaan go tek it off\nSet di trap, don't fight yuh know yuh skin soft (YUH DUN KNOW!!!!)\nSiddung pon it, gwaan go fuck it 'til yuh bruk it out\nSo exotic, while yuh suck it watch we fuck it up\nSo weh have it, batty big watch how mi love it up\nBend ova and spread and mek mi stick it in and bun it up (FI REAL!!!!!!!!!)\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it\n\n[Verse 2: Busta Rhymes]\nMi seh mi finish wid yuh, pull up yuh pants, gwaan go get yuh friend (FI REAL!!!!!!!!!)\nDance dun, come outside, fuck inna di benz\nGyal come, enjoy di ride, watch di wey mi stick yuh\nWelcome! (YUH DUN KNOW!!!!) Tek di dick yuh friend a wait fi yuh\nHold on deh, yuh man vex? vegetate di bwoy\nShoot what? See my gun will evaporate dat bwoy\nLeggo dat, See how it sound QUANGGGGGGGGG!!!!!!!!\nLevel dat, dung to di ground, PANGGGGGGGGGG!!!!!!! (BO! BO! BO!)\nNuff a dat, yuh dun know, best a di best\nPretty gyal, whole heap a batty and whole heap a breast\nPhysical, how yuh a drop it no one could a test\nDigital, we Instagram it 'til dem gyal a rest\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it\n\n[Bridge:]\nWHEN WE COME IN WE COME FI FLATLINE EVERYTING INNA THIS BUMBOCLAAT 'TIL CLASH DUN!!!\nFI REAL!!!!!!!!!\n\n[Verse 3: Nicki Minaj]\nDutty gyal, when yuh see mi hear weh yuh fi do\nBow down! Big chain and it heavy too\nRespect, how dem gwaan like mi nuh pave way\nQueen yah, London wait fi di same wave\nCome here bwoy, bow cat uh, true yuh rich\nWhere yuh wallet? Yeah yuh have it hmmm show mi it\nKartel, Beenie Man, Bounty Killer too\nRoll di weed, plus a dutch or a rizzla too\nBruk it out, flip land pon yuh head gyal\nBrooklyn, when we shoot, neck gyal\n(Trinidad) a nuh (James) mi a chat bout\nPussyhole, a wey bitta a whaddat bout?!\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it\n\n[Verse 4: Busta Rhymes]\nAnd mi seh walk like a champion, swing like a stallion\nWid di two big medallion, good, yuh perfect\nShow dem di action, bad gyal concoction\nCool now, relax mon, eh em, yuh nervous\nSkin out and dun di place, spin 'round and show yuh face\nOpen, and close yuh case, or chuck, and work it\nMi seh hold on deh tek time, gyal wine yuh waistline\nFollow. di bassline, right now, stir it (YUH DUN KNOW!!!!)\n'Round like, a bowl of super, 'round like a hula hoop\n'Round like yuh batty cute and do it, on purpose\nWine like a yard woman, grind like yuh numba ome\nJump up, and wave yuh hand mi tink, she know\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it twerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}