{"songs": [{"title": "Soopaman Luva 5 (Part II)", "album": "Malpractice", "year": "2001-05-22", "lyrics": "[Redman]\nAiyyo yo fuck that!\nAiyyo I gotta find my motherfuckin mojo\nAiyyo Reggie Noble, aiyyo Reggie Noble c'mere nigga!\nAiyyo start it off while I tell you how it went down\n\nYo, yo\nPut the drop down, get your smoke on\nGet your feel on, are you feeling?\nGet your girl on, get your squeeze on\nGet your bus on, are you chilling?\nAre you wheeling, are you feeling?\nHow you feeling?  And we gon' hooo-oooh-ooh\n(Tell me what you doin)\n\nC'mon, yo yo-yo yo, yo yo\nI had to put the mash down, throw the cash around\nStay focused, on the case put the hash down\nJetted through the air about five miles per hour\nMy mojo gone I can't fly like I wanna\nBut this case is easy, find that motherfucker that\nCouldn't wait to be me, put his face on TV\nFrom the Tec blow, I asked my ex-hoes\nPass off some info for a pair of X.O.'s\n\"Write the check low, I don't do that\nI told you that shit before when I boned your back!\"\nNow I'm back to square one, and everybody hatin\nSo I popped the flare gun, now they all escapin\nRan into Gator, from Jungle Fever\nHe's my people and my neighbor, I said I need a favor\nHe said \"For ten dollars, and for ten Whoppers\nFrom Burger King, I'll tell you the nigga who gotcha.\"\nGave him what he wanted plus the extra large fry\nHe said \"Blue eyes, blonde hair, a white guy\"\nI said... \"What the fuck going on?!\nA white guy interrupting my fuck flowing on?\"\nSo I copped some new ammo, reloaded my flare gun\nStalking like Rambo, mixed with Commando\nGator pushed the ten-speed bike, I'm on the handle\nCrashed into somethin cause he high off my man blow\nI jumped up and backtracked myself\nWho's the last ho I fucked or throat I cut\nI said \"Wait a minute, yo, that bitch Jane on the prowl again\nI bet she up to no good, actin foul again\nYeah, yeah, it ain't nuttin, I get her if I want her\nMatter of fact I'm gonna cause she live around the corner.\"\nI walked up scared with my hands on my flares and my armor\nCause she bring drama like Jeffrey Dahmer\nBut I heard fuckin all the way from the bottom\nI'm like, \"Damn she yelling!\"  Kinda made me jealous\nKnocked on the door enraged\nLike a broke-ass rapper, at a label that ain't toured in days\n\"Do it clown, before I count to four now\nCause if I hit five them flares'll blow your door down!\"\nI heard the zipper zip up, and they was tryin to run\nSo I re-clipped the clip up, and blew it before one\n\"Freeze motherfuckers!\", I jumped on Jane back\n\"I want the cheese motherfuckers! And my name back.\"\nWe tussling, fighting, biting skin and rustling\nSlaps in the face, chokes with the belt buckle and\nHer knees buckling, I thought to myself\n\"Where's that motherfuckin white guy she was fuckin?\" then\nRight out the blue {*CLANG!*} Owww! {*birds chirpin*}\nWho dat?  Who dere?\n\n.. (this program will be continued)", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}