{"songs": [{"title": "Supa Dupa Lemonade", "album": "Finally Famous Vol. 3: BIG", "year": "2010-08-31", "lyrics": "[Intro]\nI do it\nDo it, do it\nB-I G, Finally Famous getting money\nG.O.O.D. music, look\nWhat up Earl Mac\nMy nigga Tone say he so Westside\nIt's a damn shame\nMe too, D-Town, D-Town\n\n[Verse 1: Big Sean]\nD-Town, Westside\nYeah I said it, Westside\nBut they yelling big so much\nThat you would thought it's Bed-Stuy\nYou are now fucking with the newest nigga best out\nGo on, roll that weed nigga, cause I'm stressed out\nL-V checked out\nBad bitch, chest out\nNo wonder why Mrs. Right just keeps on getting left out\nOh well that's everything I'm not concerning, fuck it\nI'm on the top floor getting brains, higher learning\nGetting higher earnings and my desires yearning\nRunning through that paper like my attorney\nHundred blunts rolled, you can smell the fire burning\nI'm in the fast lane, you can smell my tires burning\nExercise, flex on guys\nModel chick\nSex on thighs\nBump a lot\nA Lexus drive\nI might let Alexis drive\nJesus chain, testify\nI over accessorize\nTest her out, now she gon' need a stretcher when I stretch her out\nWhen it's time to speak, bet all of ya'll listen\nWhen you up in the party\nWhy is all the broads missing\nAnd I just drop lines like a nigga gone fishing\nMan and I be on them posters like that nigga gone missin'\nAnd I spit that er-retarded shit just call it autism\nI'm so Hollywood that I might make your bitch audition\nBefore we cut\nCut, cut\nMovie time, cut\nI'ma dick her down, you gon' pick her up\nAnd I'm unusual as shit\nI'm Superbad, your girl probably doodling my dick\nAnd it's a couple screws up in my head that could use a fucking wrench\nAnd I'm just looking at the game like\nDamn, they could use a fucking bench, bitch\nAnd my name all up in the rafters\nShe gon' make me cum, I bet that money come faster\nKanye first, then I'm coming after\nAnd Lou' Vuitton shoes ho\nDons and the Jaspers\nWho her, I ran through her walls\nMade her scream and disappear but hell no my name is not Casper\nBoy, what the fuck these rappers sound like\nJust a whole bunch of my sound bites\nFirst whip, garbo\nSecond whip, Largo\nDon’t worry bout my niggas Thurgood Marshall\nBank account got me feeling Well, Fargo\nBalling til I get a Milicic Darko\nI did that\nI just give them line after line, after line\nAfter line, after line barcode\nThey looking for my work, Narco\nCause I just black out in the booth, charcoal\nMe, Don C, Tone and fifty-four bitches\nSince we finna blow, I bet they finna blow nigga\nTwo pounds of weed, don't act like you don't know nigga\nI put that green up, like mistletoe nigga\n\n[Outro]\nYeah boy, boy boy\nFinally Famous in this, getting money\nF-F ho\nD-town\nG.O.O.D. Music nigga\nBangladesh\nSay these niggas get off my dick\nThese niggas sit down", "image": "https://images.genius.com/77c8c4775e5c1d31fe5ab3d65845291d.500x500x1.jpg"}], "artist": "Big Sean"}