{"songs": [{"title": "Hold You Down", "album": "Camp", "year": "2011-11-15", "lyrics": "[Chorus]\nOoh, I want it, yeah\nWhenever you need my hand\nI'll hold you down, oh\nOoh, you want it, yeah\nWhy in the fuck these niggas\nTryin' to hold me down, oh\nYeah, uh\nWhy in the fuck these niggas\nTry and hold me down, ohh\n\n[Verse 1]\n\"You such a fuckin' lame!\"\nIt's what they used to yell back in seventh grade\nMy mama said she'd get me that new jacket when the cost go down\nHit the office, stole some Tommy Hill from lost and found\nNot bad for a family of foster child\nLookin' fly man, I'm flossin' now\nBut them niggas saw through me\n\"Are you serious? What is this?\"\nTook the jacket off third period, ellipsis\nListening to \"Sky Is the Limit\" on my Walkman\nThinking if Biggie can make it through it, man then I can\nDope-boy swag, I always wanted that\nBut my persona was always more of that Arthur Ashe\nBut no love for the son of a commuter who was a radio head\nAnd okay at them computers at the post office\nIt's funny how you smoke niggas then you start coffins\nAll my people need throat lozenge\nMy fear is dead, ambition drove the hearse\nBut niggas got me feelin' I ain't black enough to go to church\nCulture shock at barber shops cause I ain't hood enough\nWe all look the same to the cops, ain't that good enough?\nThe black experience is black and serious\nCause being black, my experience, is no one hearin' us\nWhite kids get to wear whatever hat they want\nWhen it comes to black kids one size fits all\n\n[Chorus]\nOoh, I want it, yeah\nWhenever you need my hand\nI'll hold you down, oh\nOoh, you want it, yeah\nWhy in the fuck these niggas\nTryin' to hold me down, oh\nYeah, uh\nWhy in the fuck these niggas\nTry and hold me down, ohh\n\n[Break]\nWe the baddest nigga\nWe the baddest nigga, you hear me?\nWe the baddest nigga, we the baddest nigga\nWe the baddest nigga, we the baddest\nWe the baddest nigga, we the baddest\n\n[Verse 2]\nThe reason that they say I'm nothin' what they seen or heard's\nThe same reason Will Smith always opposite Latino girls\nThey only see you how they wanna see you\n'Til you make them see you in some other way\nI'm trippin' off the other day\n'Cause God knows what these white kids say and do\nYou're not not racist 'cause The Wire's in your Netflix queue\nSubtle racism, it's hard to pin it\n'Cause you'd only understand if you were me for just a minute\nThis one kid said somethin' that was really bad\nHe said I wasn't really black because I had a dad\nI think that's kinda sad\nMostly 'cause a lot of black kids think they should agree with that\nIf you're a father, you should stick around if you could\n'Cause even if you're bad at it, you could Tiger Woods or MJ\nWe warriors, we all need senseis\nChange everything that we've done so far\nI don't mean makin' B.E.T. T.E.R\nI mean just the way that we see each other\nI won't stop until they say:\n\"James Franco is the white Donald Glover\"\nYeah, these niggas wanted Cookie, but instead I gave 'em Loch Ness\nSick Boi for life, my swag is in a hospice\nAimin' for the throne, Jay and Ye said to watch that\nThey ask me what I'm doin', and I said I'm stealin' rock back\nNigga\n\n[Hook]\nOoh, I want it, yeah\nWhenever you need my hand\nI'll hold you down, oh\nOoh, you want it, yeah\nWhy in the fuck these niggas\nTryin' to hold me down, oh\nYeah, uh\nWhy in the fuck these niggas\nTry and hold me down, oh\nOoh, I want it, yeah\nWhenever you need my hand\nI'll hold you down, oh\nOoh, you want it, yeah\nWhy in the fuck these niggas\nTryin' to hold me down, oh\nYeah, uh\nWhy in the fuck these niggas\nTry and hold me down, oh", "image": "https://images.genius.com/00196af444633a4108e6dc544358985e.630x630x1.jpg"}], "artist": "Childish Gambino"}