{"songs": [{"title": "I ont Really", "album": "No Genre: The Label", "year": null, "lyrics": "[Intro]\n(KE on the Track)\n(Scotty ATL: Bob what up man?)\n(B.o.B: What's up fool?)\n(Scotty ATL: thse niggas out here hustlin' for a [?])\n(Scotty ATL: You know I don't really fuck with these niggas right?\n(B.o.B: Fuck 'em)\n(B.o.B: Talk' to em) (x3)\n(Scotty ATL: Real nigga ain't never for the hustle for the [?])\n(Scotty ATL: Real nigga ATL)\n\n[Verse 1: Scotty ATL]\nTwo three times had to fall on my face\nAnd you supposed to be a nigga I can trust\nYou ain't never pulled at a real nigga fall I recall\nYou just schemin' on the niggas in your own in the circle you were\nLying on the internet, putting nigga lame\nTalking real shit niggas ain't real\nYou just trying to [?] nigga I can feel\nTold 'em I ain't fucking with these niggas I'mma focus on my own shit\nCool Club for life, had the [?] on\nKanye, getting fucked by all that\nFinna turn like car keys (turn up), with a\nBad bitch, and a cup full of Cognac\n[?] this a carjack, I be\nRidin' like a motherfucking [?] valet\nWith the Swiss full of [?], yeah I\nNeed that, these niggas on my last nerve\nWho you trying to impress, you be trickin' [?]\nYeah niggas ain't ball like\nWe can can see it on your IG, you be\nTryin' too hard you don't even live your own life\nGetting line like a [?], take over time\nGive me head like MJ\nPost a clip on OJ\nR.i.p my nigga OJ, they ain't know\n\n[Hook]\nMan I don't really fuck with these niggas\nMan I don't really fuck with these niggas\nI don't really fuck with these niggas I don't\nFuck with these niggas, man I don't really\nFuck with these niggas\nMan I don't really fuck with these niggas\nI don't really fuck with these niggas i don't\nFuck with these nigass, man I don't really\nFuck with these niggas\n\n[Verse 2: Scotty ATL]\nShow a nigga love he get shitted on (Shitted on)\nMan Hollywood, now I ball like fuck 'em\nMe and cut the tees out the top of the colored [?]\nSee me they can see me hold a mothefucking [?]\nXXL even complex, no radio\nOn tour getting good dough\nMeeting tightwads, I don't know about the pudding but\nThey don't know about hood though\nGive a foot long, I'm just tryin' to get the long bread\nGet some ass out my [?]\nIn the [?], chasing paper like a maniac\nMan we struggle way too long\nWant a lambo, just to ride wanna feel like\nAce [?] on a good park\nAnd the good lord, help me blow up help me getting rich\nHelp me make it real real far\nKnow just one thing, niggas act like they wanna see\nThey just wanna see take outs\nNever for them, so I grind i ain't letting off\nI ain't taking no days off\nWe were cool with them, but they were hating I can feel it\nThey were hating I can feel it\nI'mma make 'em look bad, jealous heart at that boy\nWatch a real nigga kill it\n\n[Hook]\n\n[Verse 3: B.o.B]\nMan I feel like fuck these niggas\nI ain't really feeling near one of these niggas\nI'm worldwide boy you just a one street nigga\nMLB ballin' Barry Bond league hitters\nI ain't got I ain't got no handout for these niggas\nBut lyrically I'mma make examples out of niggas\nThey gon' fuck around and put Atlanta out a nigga\nYou ain't got to tell I whip the lambo out on niggas\nYeah catch heat make a camel out of niggas\nThey gon' swear they got the Rambo out the ghetto\nWhat the fuck you fantasize a nigga\nIt ain't real beef unless they pullin' ammo out of niggas\nHow can niggas even think they on my level (On my level)\nWhen they're too many niggas thinking on my level (All over)\nTake a minute nigga think of something clever\nIf it's numbers to this shit I\"m going meta\nI won't say I'm a vet, just somewhere between the best\nAnd ahead of the rest, next level finesse\nHeavy metal possessed\nBullshit to my right, pool pit to my left\nThat ain't neither here nor there, nevertheless\nJust tell your friend bring a lighter and song\nBoth my eyes low like Cheech and Chong\nBobby Ray Bands in your camera phone\nIf I ain't on your TV boy you got the channel wrong\n\n[Hook]\n\n[Outro: Scotty ATL]\nYeah what it do man it's your boy Scotty ATL man checkin' in one time, you know what I'm sayin'? Man shout out to niggas out there geting the motherfuckin' money man you know? Y'all niggas say No Jan-re, we say No Genre, you feel me? Where we from that A-Town and you know what I'm talkin' 'bout so we just talk like that. No Genre nigga not No Jan-re. Get that shit right, fool. Scotty ATL Cool Club, what's happening? Turn up in this bitch man, leggo", "image": "https://images.genius.com/75e7f10bcbceaf55df2abb72f70543f1.500x500x1.jpg"}], "artist": "B.o.B"}