{"songs": [{"title": "Mafia Music III", "album": "Mastermind", "year": "2014-03-04", "lyrics": "[Produced by Bink!]\n\n[Verse 1: Rick Ross]\nMy corner so polluted, young niggas lootin'\nI studied Kenneth Williams, I'm one hell of a student\nRemarkable hustle, my niggas comin' home\nI kept the candle lit, my nigga never rowed\nNiggas caught him slippin', gave him a shit bag\nFive shots to the stomach, 2Pac gift pack\nIt's death row, conspiracy theories\nConcealed indictments handed to the grand jury\nGet some money now, you hated by your own kind\nThe home invasion done by niggas in your bloodline\nGABOS, game ain’t based on sympathy\nSo he put a hit on his cousin and auntie\nHer sweet potato pies, oh me, oh my\nShowin' no remorse, watchin the others cry\nHeroin sales, detectives'll sell\nA lot of yellow tape, where that Obama care?\nThis the mob, bitch, silk underwear\nYeezy concerts, Kim Instagrams\nNiggas hatin', though they studied my moves\nI'm like Farrakhan, in view of hundreds of Jews\nTwo attempts on my life, they threatened venues\nCan't you see what I am? The hustle continue\nI bought more jewels, I ordered the Wraith\nI got a new style of shoes, match the watch in the face\nBill Belichick, coachin' and callin' the shots\nThrow a yellow flag, pussy nigga body drops\nThen we celebrate, black bottles pop\nTime to elevate, we re-open shop\nWale a genius, Meek Mill a superstar\nMy new crib in Phoenix, ten car garage\nPatek Philippe, platinum Audemars\nAin't no tags needed, nigga, I own them cars\nI know them bitches, we met them broads\nNever loved one, fucked them all\nI'm a fuckin' dog, Ricky fuckin' Ross\nNigga, Birkin bags just for my runner-ups\nBut my main bitch she get the main dish\nNot the old range, that was a lame bitch\nBrazilian weave, she say I came quick\nI let her see a hundred ki's, a gift from St. Nick\nMovin' bricks like it's Black Friday\nShe gotta fuck me or call me a fat crybaby\nLookin' over my shoulder, I can't trust a soul\nBought a spot in Anguilla just for me and my ho\nGlock .40, even when I shower\nChrome .22 in my swimmin' towel\nMob ties and I pray the music set me free\nMay the powers that be better let me be\n\n[Hook: Mavado]\nYa better not be around when the sun goes down\nAnd the real, real killers them out for ya\nIt's gonna be be a bloodshed\nOne buss, one dead, it's gonna be a bloodshed\nGun- gunshot inna head\n\n[Verse 2: Mavado]\nPayback is a motherfucker\nYes I feel it when I squeeze the trigger\nI feel the air when my enemies die\nI feel the strength of ten killer\nWhat is to be will be\nOnly God alone can kill me\n‘Cause these fuckin' streets filthy\nAnd I ain't fuckin' guilty\n\n[Verse 3: Sizzla]\nGangsta no take no chat from no guy, know why?\nViolate a gangsta and bullets fly, bwoy die\nGuns go off, or so we say\nMurderation, anywhere\nGangsta no take no chat from no guy, know why?\nViolate a gangsta and bullets fly, bwoy die\nGuns go off, or so we say\nMurderation, anywhere\n\n[Hook: Mavado]\nYa better not be around when the sun goes down\nAnd the real, real killers them out for ya\nIt's gonna be be a bloodshed\nOne buss, one dead, it's gonna be a bloodshed\nGun- gunshot inna head\n\n[Outro: Sizzla]\nSizzla Kolanji and Rick Ross have the girls them screaming\nEntire country, every street lab, you already know the meaning\nBorn ah stream and me go in clean, you can't diss me you must be dreaming\nJamaicans, let them know we carry the team in\nBu'n 'Paya!", "image": "https://images.genius.com/19f55ffc401c826cd6d01bd3253f1158.1000x1000x1.jpg"}], "artist": "Rick Ross"}