{"songs": [{"title": "What We Do", "album": "Build and Destroy", "year": null, "lyrics": "{​​​*Commercial plays*}​​​\n\n[Royce Da 5'9\"]\nYeah, still you lame, high as it be\nIf I'm ya highness in ya streets, I can honestly compete\nWit any nigga, feel the pain, my odyssey just creeps\nPeep a nigga silver chain, no diamonds in the peice\nI been chillin on dog for years... now you hard?\nI got scars bigger in ya individual career\nWho the fuck is Denaun, he don't even write rhymes\nActin like he rap harder then who - the Kon Artis is you\nNow you get spoken up on how the heats on you\nNigga you must be smokin and jokin\nSlim got 50, and now it's time for change\nShady records lookin like a broke down dollar, you gotta be ashamed\nAnd you can't even stop it\nEm got 50 Cent, the rest of you niggas change in his pocket\nDon't you niggas see he let you come and get twisted\nAnd you dissin me, but you niggas is unfinished business\nSMUCK you niggas tryna be\nOn every other niggas nuts, in the industry you findin me\nFrom Busta Rhymes to Jay-Z to Nas to ME!\nDidn't see me, yet them niggas won't you to rhyme wit peeks\nNiggas is HIDIN in the streets, lyin on me\nIt's funny, cause they paint a picture like I be in TONS of beef\nBe out every night fightin, provin shit\nJealous ass niggas, I ain't gotta prove shit!\nThat means you could die from the felt response\nFear my next move like, Eminem huggin on Elton John\nExcept Y'ALL playin career Russian Roulette\nThere will never be another D-12 album nigga, what you bet\nWho ain't eatin, I'mma star, nigga, on my 4th deal\nI'm so full, I'm feelin fatter then Bizarre\nMINUS the shower cap, and them dirty-ass Nike's\nMinus the stutter, minus the ugly-ass wife\nY'all don't know what it takes to win, nigga\nI'll spar up wit ya boss, we made each other show up late to the gym\nSo I said it - you niggas is whack\nThat nigga ask me my opinion, is it true, don't fall for that\nNigga step unto the turf, everybody think y'all WHACK\nWhat you gon' write a diss record to the earth?\nYou niggas is Shady statistics, the whole world know\nWho the broke-ass crew, wit the radio hits is\nWarren's niggas is takin ya pictures, you just dummy's\nYou less money then Slim spends on Hailie for Christmas\nI know Slim see the mistakes that he made\nTreatin y'all like Dre treated Hittman, and Lady of Rage\nEven them niggas is smarter then y'all niggas, the cloth\nThat I whip my fuckin gun down, is harder then y'all\nYa hustle is over, the rhyme bout is through\nI got ya coach on the sideline, touchin his shoulder\nTIMEOUT - it's over, it's over", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}