{"songs": [{"title": "I Get My Thang in Action", "album": "Tical", "year": "1994-11-15", "lyrics": "[Intro:]\n\"Good.. Wu-Tang martial expert\nThere's not many, who can match up with him\"\n\n(He'll give you a heart condition\nIf you fuck around like that there\nTell you it ain't no good for the bloodstream\nYou know god damn whatever and uhh\nIt's dumb and big -- it's DUMB AND BIG)\nMira, Meth-Tical comin through with the suu\n(Lie in cut for y'all)\nCheck it out\n\n[Verse 1]\nNiggas wanna test my steez, nigga please\nI black that eye like peas, you better freeze\nIn your tracks, a Wu-Tang (bzzz) killer bee's on ya back\nI comes for the honey plus the phat money sack\nYou want it all? Yeah I want it all like THAT\nI stab my own moms in the back for a stack\nNiggas like, \"Damn, why you want it like that?\" (Why is that?)\nCause I'm a dog, and I got no love for the cat (uhh)\nAttitude's cold like the North polar cap\nWhere I do my dirt's a little further down the map (Is that so?)\nA little buck wilding, Island called Stat'\nWhere niggas carry gats in they Black Moon hat\nNow I'm mad known for the bones and the rap\nAnd you's an unknown with a faulty contract\nWake up and smell the Met-chod motherfucker contact\nVillain in the cypher from the foe when head crack\nAn Indian giver and I'm out to take it back\nShaolin Island, baby where you at?\nA runaway train that be runnin on ya track\nThat's how it's goin down, yeah, it's goin down\n\nI gets my thang in action\nTo live, to love, to see, to learn\nYo! Tell em what's happenin!\n\n(What's happenin?\nI'll tell yo' ass what's happenin\nTell em what's happenin\nIt's goin on out here - brothers ain't got no peers\nAnd they smokin funny - shuddup yo' damn mouth!)\n\n[Method Man]\nI swing funky rap routines and tap the jaws\nSpot ya twenty points and you still can't score\nNUTTIN - cause you ain't got no points in this game\nKid you FRONTIN - I'm home run hittin, you be buntin\nFresh out the toilet, I got my shit together\nWhen I'm good, I'm good, when bad, I'm better\nYou want it? Whatever - I'll be the stormy weather\nRain comin down, so weatherproof you're leather\nJACKET, a nigga with a AXE couldn't HACK IT\nI spark em like a match (ssskt)\nComing back it's the Met-chod, say it loud\nI'm the Met-chod, Man - clap yo' hands, now check it\nSee me in the mix, rollin fat, bustin flicks\nWhile my physical brother came through and got me lift\nNiggas, that I walk by, give me the eye\nThe moment is fuckin me up, killin my high\nNigga get back, ya pussy cat, I'm fearsome\nBasically THAT, I'm all of THAT, and then some\nWhile I, was out on tour, goin beserk\nI heard you was at the sandbox and kickin DIRT\nAll on my name but you can't pull my file\nYOU DON'T KNOW ME, AND YOU DON'T KNOW MY STYLE\nComin out dere like dat dere, YEAHHHH\nEven Grizzly Adams couldn't bear\n\n(Ahhheheh, I taught the boy everything he KNOW\nGo on you bad motherfuckers\nSee I told you that kid go back to that Dolemite\nEverybody needs to love Dolemite\nI love Dolemite, you love Dolemite\nHey, how you doin nigga, I know you\nKnowin I didn't when I did\nMeth-Tical\nShiiit, I told the boy\nIf you can't get yourself a ten\nThe least you can do is fuck five twos\nAnd we out, Method)", "image": "https://images.genius.com/e8eea98eab886487258b11bd4e1cca4b.1000x1000x1.jpg"}], "artist": "Method Man"}