{"songs": [{"title": "U Wanna Be Me", "album": "8 Mile: Music from and Inspired by the Motion Picture", "year": "2002-10-29", "lyrics": "Uhh, oooooh baby, baby\nKeep it thug, and keep yo' heat, na nah nah nah nah\n\n[Verse 1]\nNow slowly, thinking of all the things that oppose me\nI think of kings who died and rappers out to dethrone me\nFor they crown they head is cut off, bodies is laid\nDead in the street, it's so fucking pitiful\nFirst they love you, could be the bitch that even live with you (ho)\nMad at your riches, now she switched, turned miserable\nCause she wanna dress like Bonnie, Robin and Crystal do\nBut Crystal's single, Bonnie's broke and her niggas too (ha)\nI can do bad by myself; went from rags to wealth\nFrom Jags to Bentleys to, plenty ass bitches\nCan't keep they hands to theyself no more\nI'm like, Hugh Hefner, you lesser, you just a\n\n[Hook]\nWanna be me, you can't you faggot, you bitch\nYou coward, you clown, you just wanna be down\nSo you - wanna be me, you bitch, you phony\nYou clone me, you wanna be me son, I'm the one and only\nBut you - wanna be me, you suckers, you weak\nYou flunkies, you fake, you couldn't come close on my worst day\nBut you - wanna be me, I burn you and learn you a lesson\nConcerning this mic profession, turn your direction\n\n[Verse 2]\nYou can't be me, not in your wildest fantasy\nIt's childish; should I have to resort to violence?\nPay me a half a million, I'll consult your album\nAnd show you how to stay off my dick\nThat's the thing I hate the most, can't even call you a man\nWhen you gotta call out my name to get you some fans\nNo talent, you need direction; you a pussy with a yeast infection\nYou unlucky, I'm your fucking C-section\nPlus I'm the last real nigga alive\nToast glass, Ill Will, the label get high\nRealize, how many classics I gave you\nPerhaps if you think back you'll realize that I made you\n\n[Hook]\n\n[Verse 3]\nYou can't be me, I'm trying to walk a straight line\nWhy they trying to take mine? I'm past 8 Miles of every state line\nEating, alligators and, hummingbird hearts\nAt the Player's Ball, Brioni suits, y'all birds watch\nAs real millionaire, shit'll take place\nEvil as Hitler's hate-race people\nThis is God son, and I've come from the God under pure peace\nTo represent the streets, you'll see that my plan\nIs not to destroy your man\nBut to bring more to mankind and teach\nEvery MC reach for your pens and papers\nLesson one be creative; what you made of junior?\nCause soon you'll be a grown man with the mic in your hand\nAnd understand, to battle Nas not in your plan\nI'm the last real nigga alive, understand that\nAnd you my offspring, the boss sting\nA bulletproof Porsche things, hard for you to understand that\nNas the king, where my bricks, where my band at?\nPlay me a gangster's theme, while you entertain me\nIf I ain't crying laughing, to the lions, throw your ass in\nWhat the fuck was you niggas thinking?\nGuns'll clutch if I get a inkling that you coming for the kingpin\nBut I laugh at you cowards, ha ha ha\nTake me out, try try try, but you\n\n[Hook]\n\nYou can't be me", "image": "https://images.genius.com/e4a1bd93e045b909843de21d49a9bb97.1000x1000x1.jpg"}], "artist": "Nas"}