{"songs": [{"title": "Rollin", "album": "Bloodshells Revenge", "year": "2018-04-17", "lyrics": "[Intro]\nYou know, I smoke, whole lotta, drugs, violence, murder murder, kill kill, brrrt\nBut shit Wop thuggin' with me, we thuggin' with your shit\nSo I'ma fuck with it too, it's Lil GlokkNine, ayy\nNigga run up, nah we ain't gon' say that\nWhole different song, whole different vibe, brrr, check me out\n\n[Chorus]\nHold me down, I hold you down, that's how we 'posed to do\n'Cause if you rockin' then I'm rollin' like a tire loop\nThat's my lil baby, she the one, she keep that shit a blue\nCollect call, I need it all, and it's all comin' through\nAnd when I was on my dick she kept it comin' through\nCommissary calls, all of that a hundred boo\nBut I can't fault her for what I did, it ain't no me in you\nBut ain't no Lilo without Stitch so what I'm 'posed to do?\n\n[Verse 1]\nI'm spending, ball all my life boy, ask a loud 'nem\nI'm talkin' bodybag a nigga up and let his dad miss him\nAin't no sympathy, I don't give a fuck, I don't kiss ass nigga\nI remember my Mercedes truck like fuck a Jag nigga, ayy\nLil Twerka had that Acura, two on the dash nigga\nWhen the crackers took lil [?] from Lil Mo, I flashed nigga\nYou can't tell me 'bout that road, I was schemin' to crash nigga\nThat's my nigga right or wrong, if he wreckin' I crash with him\n\n[Chorus]\nHold me down, I hold you down, that's how we 'posed to do\n'Cause if you rockin' then I'm rollin' like a tire loop\nThat's my lil baby, she the one, she keep that shit a blue\nCollect call, I need it all, and it's all comin' through\nAnd when I was on my dick she kept it comin' through\nCommissary calls, all of that a hundred boo\nBut I can't fault her for what I did, it ain't no me in you\nBut ain't no Lilo without Stitch so what I'm 'posed to do?\n\n[Verse 2]\nAnd I was rollin', and I was rollin' some more\nThey like who this? ayy lil bruh hold it on\nI was poking, and we scheming for dough\nI kick your door in, and I'm all in your home\nThis for my niggas 'nem, who locked up, ain't come home\nAin't get to visit them, I went [?] on my own\nI had to sing a lil, but shit you could sing along\nAin't like them other niggas, I swear them niggas some clones\n\n[Chorus]\nHold me down, I hold you down, that's how we 'posed to do\n'Cause if you rockin' then I'm rollin' like a tire loop\nThat's my lil baby, she the one, she keep that shit a blue\nCollect call, I need it all, and it's all comin' through\nAnd when I was on my dick she kept it comin' through\nComissary calls, all of that a hundred boo\nBut I can't fault her for what I did, it ain't no me in you\nBut ain't no Lilo without Stitch so what I'm 'posed to do?\n\n[Interlude]\nHello?\nYeah what it is lil Nine?\nTalk to 'em brother\nYeah, nigga in this bitch man, they sleepin' on a nigga, they'll wake up soon though. You dig what it is, a lil cat nap and they gonna wake. YJB, gang gang. Same thing, ain't a damn thing changed. Do the same thing, we just don't do it the same, for real\nG\n\n[Chorus]\nHold me down, I hold you down, that's how we 'posed to do\n'Cause if you rockin' then I'm rollin' like a tire loop\nThat's my lil baby, she the one, she keep that shit a blue\nCollect call, I need it all, and it's all comin' through\nAnd when I was on my dick she kept it comin' through\nCommissary calls, all of that a hundred boo\nBut I can't fault her for what I did, it ain't no me in you\nBut ain't no Lilo without Stitch so what I'm 'posed to do?\n\n[Outro]\nYo YG bro, I keep tellin' you bro, we the last of a dying breed for real bro. You know they call us, bitch up north they call me. I'm from down south, that's all they see. I'm from O-Town, show town, they know how I get down. Orlando, it's a crime city, you already know murder child with me\nAyy\nThey know how I'm comin'\nAyy look\nTellin' every gang in the ville, bruh, church...man I done beat a crip's ass for the bloods, I done beat a blood's ass for the crips. I done beat a folks for the GD's, man, listen man. I done, man this shit thumpin'\nAyy look, brrr\nI'm tellin' you man, I'm tellin' you man, yeah yeah", "image": "https://images.genius.com/67fa547b424c6f4b938eb35d7c2333e9.499x499x1.jpg"}], "artist": "9LOKKNINE"}