{"songs": [{"title": "Pop’s Rap", "album": "Resurrection", "year": "1994-10-25", "lyrics": "I just dropped by the studio, see what my son does\nMy main man, my son Common Sense\nThey used to call me no sense\nNow they say I got plenty sense - about 6,000 years of it\nYou know, I’m just checking him out\nSee what’s going on, cause I’m always sitting around telling him about\nWhat we used to do back in our hood, you know\nWe used to be down and run this town\nAnd it was all at PC Pub\nYou know, and I’m shaking\nAnd they working on it, and they bringing it back\nI see harmony, understanding\nAnd they working on that love thing too\nCause they be down with it, you know?\nNow I hear them saying things like, whoa whoa, I get a good feeling\nI be saying “keep it up\nKeep on moving with your groove, you’re going the right way\"\nCause it’s got to be in your heart\nAnd I can tell by your beat you got it\nSee there, I can do a little piece, put them together there\n\nYea, we used to be running this whole town, here\nWe used to be basketball playing brothers, you know\nNow everybody’s playing basketball\nI wonder where they come from? What they claiming?\nGonna make an old man get his shoes out\nAnd throw one down to slam dunk on them\nEvery time the leaves start turning brown getting through the fall of the year\nI can say yea it’s time to play some\nWhat these youngsters talking about, they running out of breath?\nWhat you say?\nWell I tell what, we’re gonna try something brand new here\nCause everybody like new things\nWe’re gonna work on something new, and I’m gonna call it ‘peace’\nWe’re gonna pretend like its 6 years old\nAnd we gonna build it and mould it\nAnd nurture it and culture it\nAnd grow right into our society for all of us to have\nDo you believe in the peace?\nNot that piece, but do you believe in the peace?\nAlright, I see you raising your hand - you believe in the peace\nOK, bring it\nSee if I can’t talk common sense into them\nLet’s cruise on down to 47 St. where dad used to hang out at, you know?\nEh remember in a few years when we moved from 47 to 87\n47 was my hood, 87 was his\nTouchdown\nWhat’s the name of the bangers in this town now?\nHas everybody calmed down?\nBack in my day, they was showing up, now they finally woke up\nI hear they leaving it alone\nUsing words like 'truce', I love to hear that", "image": "https://images.genius.com/8cc4e9a4a27cf48a434a2d5800999430.500x500x1.jpg"}], "artist": "Common"}