{"songs": [{"title": "Boing, Boing", "album": "The World According to RZA", "year": "2003-04-28", "lyrics": "[Intro: Tim Westwood (Mr. Tibbs) {Skinnyman} [Blade]]\nYo this is Westwood\nI'm at Radio 1 just doin' my thing tonight\nAnd just walked into this studio some of the hottest UK cats out there\nMy man Skinnyman {Woah, woah}, Blade [what's up?]\nAnd Mr. Tibbs what's the deal? What you got for me?\n{Yeah we got ya the new banger Tim straight from RZA\nStraight from the Wu-Tang}\n[Yeah this is Blade and the track, the hot new joints called the Boing, Boing]\n\n(Yeah representin' live all my UK hip hop heads in the North Side, el tarno)\nDown it's gonna bang in ya face, lets go\n\n[Skinnyman (RZA)]\nRegardless, I'll be here bringin' it heartless\nRuthless, to the death I'll stand for the truth yes\nMy God given talent is all that I can do best\nKeep spittin' over these tracks and leavin' you blessed\nSo who requested my time on the set\nSkinnyman's what you get, so you ain't really hearin' nuttin' yet\nYa best upthreat cuz it gets better yet\nI'm that deft intellect, them boy they don't pent\nSo who requested Wu-Tang on the set (it's the RZA)\nWhat you get so you ain't really hearin' nuttin' yet\nWe'll never let anybody else step\nOr ever come with anything less for what you'd expect\nIf you pass me the mic then I'll gladly accept\nI'll take it to the street, show you how rough it can get\nCuz everybody knows this rappin' thing isn't happenin'\nNow they jack it in and go back to shottin' crack again\nLocked down the block and get strapped with the gat again\nThen we break it down then just deal with the matter then\nSo how you'd think a British ghetto youth feels\nHe can't get a record deal but he can get drugs to deal\nHe can't get a job but he can go for rob and steel\nLookin' for a mill' while you screamin' \"keep it real!\"\nSo I'll just stand here with this mic that I hold\nRequest the higher force to sweep over my soul\nSo I can fulfill my dream, go for my goals\nI'm sick of spendin' every late night out of role\n\n[Hook: RZA]\nSkinnyman make the party Boing, bza Boing, Boing\nBlade make the party bza Boing, Boing\nMr. Tibbs he makes the party Boing, Boing\nBob Digi makes the party Boing, Boing\nSkinnyman make the party Boing, bza Boing, Boing\nBlade makes the party bza Boing, Boing\n\n[Blade]\nCalm but still merciless, rugged on impact\nExplosive, leavin' nuttin' but rubber with a spinback\nSnap a photo with your camera, capture the stamina\nHand it to a amature, show him how to damage a\nLive set, make him feel the full effect\nAnd yet still make it hard to detect and what's left?\nFour men remain standin' like Gladiators\nWhen the dusk clears nuttin' for the average ears\nFor years its been the same with minds of the artillery\nGod forgave us all for the merciless delivery\nHoldin' the tools of the trade with a death grip\nRememberin' the times when nothin' was right, we was desperate\nDreams blown to smithereens, turned into nightmares with screams\nThere's a world of CREAM\nIf all goes correct we can stash supreme\nFeed the fiend cuz that's the way it was meant to have been\nYou should of seen the comin', the language is universal\nOne time perfect attack with no rehearsal\nShook the Earth for what it's worth\nYou're in danger of a takeover, and it's analysed as global\nWe can find them whatever your predictions\nEnterin' the realm unknown with no restricitons\nIt might be hard to believe\nWe invade, we conquer and lead\n\n[Hook: RZA]\nSkinnyman make the party Boing, bza Boing, Boing\nBlade make the party bza Boing, Boing\nMr. Tibbs he makes the party Boing, Boing\nBob Digi makes the party Boing, Boing\n\n[Mr. Tibbs]\nI'm a country man at heart but a city man by nature\nCuz even though it's fuck free, it's all about the paper\nI love to live expensive, smoke like I'm in Jamiaca\nEven when I'm broke I think I'm like but a creater\nAvoids the green, even from my early teens\n???????? in need of CREAM seen (seen)\nBut then I had a dream 'bout bein' the best rapper\nBut that ain't what it seems, next chapter\nThat's spreadin' the word\nInspiration from the hurb is what you hear when I got heard\nI sat back and observed most of the men that shined before me\nAll that respect, keeper know 'nough of them will bore me\nSingin' the same story, I'm better than you\nAnd to tell you the truth most of them men are shut fools\nWe asked them in the struggle to make ends meet\nThat's why I told these MCs that talk is cheap\nYou might think you know Tibbs, you don't know me\nUnless you walk my streets and talk to my peeps\n\n[Hook: RZA]\nBob Digi makes the party Boing, Boing\nSkinnyman make the party Boing, bza Boing, Boing\n\n[RZA]\nWith your high pitched face like eye liner\nIf the black gat bust you get struck by the side winder\nYou can't block and stop it when I spotted\nI shoot like Luke Skywalker inside the cockpit\nAimin' at the top fighter\nWho I mighta have thirty thousand kids spark the lighter\nAnd set flames to the sky, we aim high\nThe baseline kick like the kid from Shang-Hi\nMake your bubble bust, cuddle up from the rubble thrust\nYou'se will have the double juice duck, then I doubled up\nTo the double four, puddles pour from ya bum bot\nOpen swords can't be cured by the blood clot\nYa bum bastards, son I come classic\nFrame won't last the length of my matchstick\nDrunk off the Hennessey V.S. stop the B.S\nI'm still off to catch the CREAM like P.S\nJake was makin' that green\nPeople always say what the hell does that mean\n\n[Hook: RZA]\nWith Skinny man he makes the party Boing, Boing\nBob Digi makes the party Boing, Boing\nMr. Tibbs he makes the party Boing, Boing\nBza Blade he makes the party Boing, Boing\nSkinnyman make the party Boing, a bza Boing, Boing\nBlade make the party bza Boing, Boing\nMr. Tibbs he makes the party Boing, Boing\nBob Digi makes the party Boing, Boing\nSkinnyman make the party Boing, a bza Boing, Boing\nBlade make the party bza Boing, Boing\nMr. Tibbs he makes the party Boing, Boing\nBob Digi makes the party Boing", "image": "https://images.genius.com/4acb8ae6f290f4af2a8dfc433609a164.700x700x1.jpg"}], "artist": "RZA"}