{"songs": [{"title": "What’s Yo Psycho?", "album": "The Gates Mixed Plate", "year": "2010-07-27", "lyrics": "[Intro: Icy Roc Kravyn]\nBorn in the basement of B'zle\nBrought to life by Icy Roc and Tech N9ne\nThe many faces of madness\nI bring to you, the NNUTTHOWZE!\n\n[Hook: Tech N9ne]\nNNUTTHOWZE in this bizznitch\nSick shit is our business\nFly high by the night so (Muthafucka)\nLet me know\nWhat's yo psycho?\nNNUTTHOWZE in this bizznitch\nSick shit is our business\nFly high by the night so (Muthafucka)\nLet me know\nWhat's yo psycho?\n\n[Verse 1: Tech N9ne]\nMy psychosis is I can't keep focus\nWithout doses of beautiful hostesses is oh shit\nSo thick, roasted I dosed it I’m so sick with it\nLadies supposed to get, get it below the clit lick it, I rose to get wicked, ya dig it?\nBy designer, I’m the kind to climb be-hind a fine dime to slime her\nWine and dine thine is minor when it’s time to grind her\nBlind with signs, I’m gonna find a vagina!\nMalebolgia came to ground hoes\nThe town ho chose the ground poles look-a-nigga sounds vulgar!\nKnow the loads blow, the closure's all over\nHer clothes but told ya, I'm sick for sex-posure!\nAin't no secret, I really love to eat it\nThat queef spit sends chill bumps down my back when they release it\nSometimes I just wish that I could cut it out and keep it\nThat 6688846993 shit\n\n(Hook)\n\n[Verse 2: Brotha Lynch Hung]\nSloberin at the mouth I love my teeth I chew that meat up\nI really dont give a fuck I do that heat 'um up while leak up\nSlices of me N I N E, S T R A N G E\nGet off tonight yo hit the night though\nHeat when I hear a ATB\nOff the hook like a fish with his lip cut\nShe never got away rip gut\nCreepin behind me you'll find a dead ???? I ain't lyin'\nCut off the head and I hide it\nDevide the body up I'm probably the sickest nigga in rhymin'\nPsyche might be\nWhen I give my 9 milli a tight squeeze\nAin't nobody like me\nMy mind be runnin' off light speed\nLike me, to get um off they Nike's\nInfered, sight beem\nWent out the back with a slight mean\nGettin' off like the S.W.A.T. team\nFuckin' um up like im cuttin' um up with a knife seem\nI'm breakin' off rappers im sight seeing\nI just love to eat human beeings\nYou could see um\nFuckin' a bitch with razor blade, hand grenades\nI'mma be makin' that red lemonade....GRRRRR!\n\n(Hook)\n\n[Verse 3: Sundae]\nYou right though\nAin't no sickness without a psycho\nAsk me what's my psycho\nYou could eat it on my cycle\nYou could beat it like you Michael\nI want my cut like lypo\nFeel cheated on like Elin by Tiger and them white hoes\nBy Tiger and them white hoes\nI'm sickning, lick me\nDoggy style might pick me\nI'm pissy\nIf you can not dick me till I'm shiting\nI'm ticking\nLike a time clock on a trick beam\nI get seen on a 50 inch flat HD\nMy pussy yeah you hick-ups\nYou thirsty won't you lick up\nI'm a nutty little bitch huh?\nYou love me cause I'm NNUTTHOWZE\nGo nutty on a bitch, why\nFAA ????\nI cash chips like a casino\nMy whips are europeano\nGot his lips like El Nino\nLike I'm carrie you'll get peed on (Kisss kisss)\nNUTTHOWZE in this bizznitch\nIm a go, go, go getter might go\nWhere sickness is my business\n\n(Hook)", "image": "https://images.genius.com/7efd1fa33fbd953a08bc1d44fae9f6a7.600x600x1.jpg"}], "artist": "Tech N9ne"}