{"songs": [{"title": "GOOD Morning", "album": null, "year": "2012-12-04", "lyrics": "[Hook: D'Banj]\nIm getting this nigga in the morning\nHe gon' think he been chiefing, just too long when\nHe see me in the evening, wanna catch all these feelings\nWell let me be the first to get mine, Ohh!\n\n[Verse 1: 2 Chainz]\nOkay I’m chillin’ in my camo, flippin’ through the channel\nOn my GOOD Music shit, my logo’s a Lambo\nFour doors of ammo, this ammunition I’m pitching\nTo make your body switch another position\nAnd listen, my weed loud, fuck her and speed off\nTell 'em I bare arms, I'm cuttin my sleeves off\nLettin' my tats show and I sag my pants\nIm letting my ass show, I'm hot as tabasco\nI study, Castro, yeah, my plug from Cuba\nInside of the car is like a damn computer\nInside of the crib is like a damn museum\nYou ain't seen these before, you better get 'em on film\nTryin to take these fat pockets, man your chances are slim\nDisrespect, you stomp em out, man give em a Tim\nYou ain't did what I did, see I know I'mma win\nAnd they dont have slow-motion so I did it again\nWoah!\n\n[Hook: D'Banj]\nIm getting this nigga in the morning\nHe gon' think he been chiefing, just too long when\nHe see me in the evening, wanna catch all these feelings\nWell let me be the first to get mine, Ohh!\n\n[Verse 2: 2 Chainz]\nOkay I'm sittin' on the plane, flying over graves\nI am so high, nigga I can talk to rain\nMy outfit's insane, ain't that evident?\nMy chain had another chain like it was pregnant\nMy favorite dish is turkey lasagna\nEven my pajamas designer\nShe got a fat ass I make her rewind\nBack seat so big I press recline\nGot a dirty sprite in my cup holder\nRappers like road kill, they get run over\nThey get done over, it's just one solider\nThis flow will make you fall like its October\nMe and your girl, nigga opposite of sober\nCeline Paris chain charm look like a cobra\nYoung Casanova, Baby Romeo\nI got my girl geeked, she look like she from Tokyo\n\n[Hook: D'Banj]\nIm getting this nigga in the morning\nHe gon' think he been chiefing, just too long when\nHe see me in the evening, wanna catch all these feelings\nWell let me be the first to get mine, Ohh!", "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg"}], "artist": "2 Chainz"}