{"songs": [{"title": "Contradiction", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Verse 1]\nThe other day, me 'n XP opened for Souls of Mischief\nI'm like \"Yo, let's get on some angry MC showmanship and hit 'em\"\nRocked all the cocky songs and not too many soulful lyrics\nEven a couple dissin' women callin' 'em \"groupies,\" \"hoes,\" and \"bitches.\"\nGot off stage, and I'm like \"Yo, I know that we killed it,\"\nRan into a familiar face, a female who comes in and supports us\nI said \"Peace!\" She said \"Wait! Let me talk to you for a minute\nI know it's none of my business, but I wasn't impressed by your performance.\"\nI said \"Word? Shit, I love feedback and criticism.\"\nShe said \"I miss the passionate spirit, your political vision\nQuite honestly I wasn't offended by those references to women\nBut you're only continuing society's conditioning.\"\nIt hit the heart of me\nI told her that this was part of me\nI stand up for human rights, and treat others how I would wanna be treated\nBut every song can't be seepin' with freedom\n'Cuz the other side of me is sexist then people will feel that I'm preachin'\n\"Everything's peace and love?\" uhh, that's somewhat misleading\nBecause this world is fucked-up and I'm a pro-duct to what I'm seeing\nNot to justify, but just to touch on my being\nI learn from these verses and my purpose gets surfaced with demons\nNow I am sexist, I'm prejudice, I put that in my music\nShe said she heard that perspective, but before she turned around\nShe said \"We have a flame, your fire's ignited with sound\nAre you building the empire up, or using your fire to burn it down?\"\n\n[Hook x2]\nConsumption, contradiction. I'm conflicted with being a hypocrite\nAnd through these songs you can witness it\nThe differences, I admit this shit, because I'm just like you;\nWalking a fine line between saying and living it\n\n[Overvoice]\nLight it up to burn it down, light it up to burn it down\nLight it up to burn it down, down, down\nLight it up to burn it down, light it up to burn it down\nLight it up to burn it down, down, down, down, down, down, down\n\n[Verse 2]\nNow one thing that I've always struggled on\nIs how to incorporate drugs and alcohol into my music outside of sober songs\n'Cuz on that perspective, that's all over my records\nBut the other side isn't represented unless it sessions with XP\nHow can I admit that I love to smoke weed\nKnowing the kids are listening and many of them look up to me?\nNot to say that I'm a role model, but I know that words are power\nAnd if I condone bottles and chronic, I am sending out the\nMessage \"It's okay,\" hey I believe that it is\nChronic can be medicine, but it's all about your relationship with it\nSee I'm either off in the wagon riding and everyday with the spliff\nConstantly looking for a balance but habit turns to addiction\nAnd hip-hop music and weed: they're inseparable\nSo MCs that don't smoke or drink, talking about it, to me, seems questionable\nIt proves how much people just want to be accepted\nAnd not seem straight-edge to their audience, so keeping it real is neglected\n'Cuz when I'm smoking, I wouldn't wanna bump a song like this\nPut on some Dev and break out the Swishers, and a bong and some licks\nSee that's a part of me too\nAnd I know that I would make more money if I wasn't as true\nTo all the struggles of the blunted consumption I'm going through\nMake music for the party, and the people support you\nI burn Brother Ali and buy 50, what does that say to you?\nBring it back around\nAm I building the empire up or using my fire to burn it down?\n\n[Hook x2]\nConsumption, contradiction. I'm conflicted with being a hypocrite\nAnd through these songs you can witness it\nThe differences, I admit this shit, because I'm just like you;\nWalking a fine line between saying and living it\n\nConsumption, contradiction. I'm conflicted with being a hypocrite\nAnd through these songs you can witness it\nThe differences, I admit this shit, because I'm just like you;\nWalking a fine line between saying and living it\n\n[Overvoice]\nLight it up to burn it down, light it up to burn it down\nLight it up to burn it down, down, down\nLight it up to burn it down, light it up to burn it down\nLight it up to burn it down, down, down, down, down, down, down", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}