{"songs": [{"title": "R.I.P. Story", "album": "Purp & Patron", "year": "2011-01-24", "lyrics": "[Hook:]\nI gotta sing you rap niggas a song before I put you to bed\nSo close your eyes just one last time as I put you sleep\nNigga rest in peace, you don't want no beef\nDon't make me pull the piece on em, throw up the peace on you\nRest in peace, you don't want no beef\nDon't make me pull the piece on em, throw up the peace on you\n\n[Verse 1:]\nAs I hit corners in that Lamborghini swervin'\nThem doors fly up, look like I'm riding in a bird\nSo sick, put the 22's a inch from the curb\nWatch the niggas fade away like the smoke from the herb\nSo I hop out, in my true religion denim\nCause guns my true religion\nAnd my Desert Eagle's in 'em\nThen I pull out;\nLike I should have did when I was twelve, she had a miscarriage anyway\nOh well, back to my story\nI start shootin' up the block\nThey shootin' up block, \"Oh shit! It's the cops!\"\nNo is not, (woohoohoohoo)\nIt's just the ambulance, put another clip in and let the hammer dance\n\n[Hook]\n\n[Verse 2:]\nI swear to God, these niggas runnin' so fuckin' fast that\nOne nigga tripped so I shot him in the ass\n\"Why you make me do that?\"\nI'm usually a cool cat, like Kool Herc, Kool G, or any other cool nigga that rap\nBut I ain't come to talk, I came for revenge; to avenge the death for my hip-hop friends\nI know, I know you never meant to get 'em killed, never meant to drive the car\nThey never handed you the steel\nApologize now. I know when you see him you will\nBut I got one question:\n\"Nigga how does it feel that they're going now, and you're going now?\"\nPut it to his dome, (BLAAAOW!) He is going home now, bye\n\n[Hook]\n\n[Verse 3:]\nMy Air Force Ones are comfortable, but they not built to last\nEspecially when you chasin' motherfuckers up and down the ave\nNiggas hit a couple fences, ran through some backyards\nAnd I am not Reggie Bush, I'm heading back to my car\nAs I walked around the corner, I was like\n\"Damn! Los Angeles PD's behind my Lam - Bo.\"\nRunnin' my plates, before I can hit the gate\nI can hear the cops yelling out, \"Wait!\"\nSo I turn around, approach my shit\nHe said: \"Aren't you the guy that used to sing with 50 Cent?\"\n\"Why, yes I am.\"\nThat was my reply\n\"My daughter loves your songs, good day.\"\n\"Good bye!\"\n\n[Hook]", "image": "https://images.genius.com/2ac5b9e1da222cb025aa059f64716e53.500x500x1.jpg"}], "artist": "The Game"}