{"songs": [{"title": "Nice Things", "album": "Fuck the Money", "year": "2015-08-01", "lyrics": "[Reporter]\nViolence has come, but many argue it’s also tolerated as long as Blacks and Hispanics fight each other, and as long as they do it in their own neighborhoods\n\n[Talib Kweli]\n[Hook]\nDamn right, we got it\nDamn right, I’m 'bout it\nPolice state trying to kill us\nWill they succeed? I doubt it\nY'all don’t want no problems\nSo lame nigas be quiet\nWe 'bout to start the survival\nWe 'bout to start the survival\n\n(Chorus)\nThat’s why we can’t have nice things\nThat’s why we can’t have nice things\n\n(Verse 1)\nUsed to race home after school\nJust to turn on the tube\nTo catch the new videos, thought I was cool\nI’m talking Snoop, Dr. Dre, to Fugees, to Biggie, to Diddy, to Wu\nMy O.G. will come from the spot with the loot\nLike, \"Kweli you nice, niga. Hop in the booth.\"\nTogether Forever, the name of the crew\nNow, I wonder is there any real rap left; is it just me yelling no justice no peace? (hands up!)\nThis new video full of black death, fuck rap 'cuz we dying at the hands of the police (hands up!)\nHorror movies don’t get no scarier than the way cops treating nigas in America\nSee more videos of cops trying to bury us than ISIS, you tell me who's the terrorist\nTerrorists making bomb threats ain’t got shit on the Prison Industrial Complex\nSlavery to Jim Crow, now force my kinfolk into poverty, living in the projects! (trapped!)\nComing such a long way from living like kings\nNow we like bling, wanna pull up in a white thing. (you trapped, niga)\nThis is why we can’t have nice things\nGot to be prepared for the drama that it might bring\nJealousy gonna tear us apart\nThey say it’s all love, but what’s in their hearts?\nThe product in nigas, kidnapping your wife\nYou’re out in the desert like what’s in the box?\nIn your Brad Pitt voice\nSo what you have is a choice\nYou can have all of us thinking you’re moist\nOr get like Chuck D and start bringing the noise\nRap life I attack like a pit bull\nLet it off like a clip full\nKnown to stand up to all that bullshit that you sit through\nTell the world what we’ve been through, it’s pitiful\nPortrait of the artist as a young man\nRaised in a borough in Brooklyn in the late 80's\nRap crazy are the crack babies who act shady when snitches start singing like the fat lady\n\nAmadeus, you know what it is\n\n[Hook]\nDamn right, we got it\nDamn right, I’m bout it\nPolice state trying to kill us\nWill they succeed? I doubt it\nY'all don’t want no problems\nLame niggas be quiet\nWe 'bout to start the survival\nWe 'bout to start the survival\n\n[Chorus]\nThat’s why we can’t have nice things\nThat’s why we can’t have nice things\n\n[Verse 2]\nNaw, it ain’t trap rap\nIt ain’t backpack (what’s that?)\nThis is what you sound like when you have facts\nAnd you’re facing down the cops in a gas mask\nY'all be listening to lames? Well, we past that\nHalf-assed rap, you can have that back\nAll you fake deep niggas where your hashtag at?\nCut you open on the mic when I’m showing you the light\nNiggas scatter like roaches, where the black flag at?\nRadio solace is coming I promise you nigas I give you a preview (it’s coming)\nTransparency, that’s the key\nI got nothing to hide you niggas is see through\nTrans parent, no Caitlyn genital\nTatted up but you faker than henna ho\nBlack Star with the bars that expose you\nJust like you posed nude, no centerfold\n\n[hook]\nThat’s why we can’t have nice things\nThat’s why we can’t have nice things", "image": "https://images.genius.com/23223285f9cac119c15336b3e08cd741.498x498x1.jpg"}], "artist": "Talib Kweli"}