{"songs": [{"title": "Brother’s Keeper", "album": " Defending The Crown Part 2 - Kiss The Ring ", "year": "2004-10-26", "lyrics": "[Chorus: Royce Da 5'9\"]\nI am my brother's keeper, the reason you in touch with the Reaper\nIf I ain't the reason you bleedin is because you ain't give me a reason\nTo slug you because you ain't fuck with my brother\nYou motherfuckers mothers'll suffer cause of you 'bleedin\n\n[Verse 1: Royce Da 5'9\"]\n'Til we on top of that roof like Nino and G\nGlocks pointed at you out for the truth, you rollin with me\nOur paint, the same - you can taint it\nBut you can't explain, your blood is my blood as your vein is my veins\nSo you are, honestly bonded to me, not through rhymin\nBut through the, amount of breathin between our mom and our father\nCount up your G's, with him I round up the squad for\nHe I mount up to squeeze if he ever got a problem\nAny ONE of you henchmen, I want your attention\nI'm comin, I'm gunnin when one in his defense (SOUND OFF!)\nLike you got a pair, everybody dead\nIf any one of you punks dare harm a hair on his head (oh no!)\nThat'll start up the part of the war\nWhere your heart hit the floor when soldiers just won't, bargain no more\nThis ain't got nothin to do with my crew members\nMy views on losin when ain't nothin to do with losin my temper, cause\n\n[Chorus: Royce Da 5'9\"]\nI am my brother's keeper, the reason you in touch with the Reaper\nIf I ain't the reason you bleedin is because you ain't give me a reason\nTo slug you because you ain't fuck with my brother\nYou motherfuckers mothers'll suffer cause of you 'bleedin\n\n[Verse 2: Kid Vishis]\nBlood in blood out for my brother, give me a pistol\nI'll release missiles through tissue when one of 'em hit you\nSurprise! Yo' eyes is closed, you chose to go past the flow\nSo I will close yo' casket slow (whoa!)\nNickel's my nigga; Jimmy gave me my quiet demeanor\nTouch him I will leave all of Gregory {?}\nOur father so don't bother, the fam is so mobster\nRun yo' lobster, run what you got! (buck a shot)\nKid you NOT, won't remember the faces\nMake you disappear from this paper, I'mma erase you\nYou talk shit and bitch up when I face you (yeah)\nWhat with that look on your face when I put this clip to your braces?\n(Oh no!) Switch up your taste buds\nI'll make you hiccup, make you taste blood\nWe come together and break thugs DOWN!\nIf you ain't fearin me nigga then you ain't hearin me nigga\n{*click clack*} (\"Can you hear me now?\") Haha..\n{*gunshots*} (\"Good!\")\n\n[Chorus: Royce Da 5'9\"]\nI am my brother's keeper, the reason you in touch with the Reaper\nIf I ain't the reason you bleedin is because you ain't give me a reason\nTo slug you because you ain't fuck with my brother\nYou motherfuckers mothers'll suffer cause of you 'bleedin", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}