{"songs": [{"title": "That’s My Work (Intro)", "album": "That’s My Work, Vol. 1", "year": "2012-12-02", "lyrics": "[Verse 1: Soopafly]\nSee that fly skirt? That's my work\nLil' bad bitch, met her at the concert\nWith a crew of bitches, doin' their dance twerkin'\nThey bodies around, drop, make that ass work then\nI moved in, like a cobra\nNigga shut it down, party over\nYou can ride this dick, I'm a chauffeur\nI swing big bat, Sammy Sosa\nYou a hood rat, but I'm digging you\nFuck what you nigga do, only take a minute to\nSuck on this motherfucker like you on a interview\nSwag up, fresh from the top to the tennis shoes\nYea, look at my hoes\nPork chops and a bunch of Del Tacos\nSee my dick? That's the real drug\nBeat the brakes off a bitch, Billy Club\n\nI got a bad bitch (That's My Work)\nHoldin' up traffic (That's My Work)\nCatch her in the alley way (That's My Work)\nDo whatever daddy say (That's My Work)\nBitch (That's My Work)\nWork, work (That's My Work)\nWork, work (That's My Work)\nWork, work (That's My Work)\n\n[Verse 2: Kurupt]\nPick your ass up and drop it back down\nTurn around, hear me now\nYou pick her up, hit her off\nShe bring it back, to a real boss\nMy bitch, my ho, my bossette\nYoung white bitch, Farah Fawcett\nSwag trippin' on her like a faucet\nJust got off the pole, 'bout to give me what a boss get\nEverything you give her on the flow, flow\nWith the same important gang, cold like the North Pole\nGot a girl out of Jamaica, the paper moneymaker\nBreak you for everything that you got up in the bedroom\nI got a bitch that you like, jeans fit right\nI turnt her over night, she's an overnight dyke\nShe's an overnight sensation, asian persuasion\nPut my dick up in her mouth, language changed into Haitian\n\nThat girl that you like (That's My Work)\nI turnt her over night (That's My Work)\nThe one you think of (That's My Work)\nHer friend fuck with G Dub (That's My Work)\nThat's my bitch (That's my work)\nThat's my bitch (That's my work)\nThat's my bitch (That's my work)\n\n[Verse 3: Snoop Dogg]\nOn the real cuz flip this, trip this\nNigga try to introduce me to my bitch\nOn the turf, I ain't drip saw the full dirt\nCasanova, LaVert, revert\nBack with another hit, better get another bitch\nShe's so playful, that bitch ain't faithful\nCus' I can name five different times\nWhen the bitch went for hers, so I'm gonna get mine\nI got four 'lacs, 5 Chevrolets, what it do\nEven got a bulletproof, I'm tied in with the upper echelon\nWhen you with me bitch, you get what you want\nAnd you can bring a friend too, comment allez-vous\nLittle French dip for a bitch like you\nSucker punch, I don't think so\nWell what do you know? When I pulled up, a little yellow bitch stood up\nI threw the hood up\nYou know why?\n\nThat little bitch you like (That's My Work)\nYou know, that little shit you like (That's My Work)\nOh yea, you know I get you right (That's My Work)\nLate night, I come and hit you right (That's My Work)\nBitch (That's My Work)\nWork, work (That's My Work)\nWork, work (That's My Work)\nWork, work (That's My Work)\n\n[Verse 4: Daz Dillinger]\nThat's my work!\nOh yea she naughty naughty, she a fuck good\nShe wanna party party hands in the air\nAnd yea she don't stop, that’s my work\n24/7 she don't stop\nHold your head back, well come on and take a shot\nCus' I'm here down until the last drop\nBecause you know that I know that I got work\nShe a bad bitch from her smirk to her skirt\nIn a bra T-shirt, she a born workaholic\nIt's so many bitches that a nigga can call it\nFrom my iPhone to a Android\nHey yo that's my bitch\nOh yea, she employed?\nShe got ass, ????\nDance, dance, dance\nYeah do it, really work though\nShe a ho tho' really tho'\nY'all be doing like this fo show tho'\n\nThe bitch that you bought a drink (That's My Work)\nThe bitch you took to the bank (That's My Work)\nThe bitch that you said you love (That's My Work)\nBe the only one she thinkin of (That's My Work)\nMotherfucker (That's My Work)\nStupid ass bitch (That's My Work)\nStupid ass chick (That's My Work)\nThat's what it is (That's My Work)", "image": "https://images.genius.com/c130e782c1dcee0d745ccec5e8e07f40.500x500x1.jpg"}], "artist": "Snoop Dogg"}