{"songs": [{"title": "#PROUDCATOWNER #IHATERAPPERS #IEATPUSSY", "album": null, "year": "2017-12-26", "lyrics": "[Intro]\nOh my God, Ronny\n\n[Chorus]\nOh she ratchet, I might smash her\nBend that backwards, I might pass her\nHomie on Casper, geekin' like Dexter\nI do magic, no distraction\nYeah, my flow's on Destructo Disc, too afraid to cuff a bitch\nThese boys on that sucker shit, feature price went up as shit like\n\n[Verse]\n\"Oh, big deal, are you Satan?\"\nI reply like, \"Are you playin'?\"\nSlurp on pussy like Lo Mein\nI'm Progressive like Flo, man\nTherapist knocking at my fucking door, man\nMy body just look like G.I. Joe, man\nFeds askin' questions, I don’t fucking know man\nKim Jong Un to the fucking flow, man\nLike whip, lash like whip, lash like whip, lash like whip, mm\nDiamond baller, broke my shoulder\nShe wan' fuck but can't come over (Ayy, ayy)\nWhen I met your shorty, hit the running man, mm\nHopped out of jail, made a hunnid bands, mm\nKKK, I'm just hanging, man, mm\nChris Rock, niggas acting funny, man, hm\nMy money stretching like Luffy, uh\nLike Disney, these niggas is Goofy, uh\nI don't fuck with snakes but like Gucci, uh\nThese niggas act fool for some coochie, uh\nI will not go back to jail, uh\nThese niggas is blind, need braille, huh\nWatch how I switch, watch how I switch\nNut on her, switch, watch how I- mm\nNigga, where the fuck is your energy? Cannot mimic your enemy\nPlay pawn defending me, I can palm you niggas\n'Cause I warned you niggas, I never swung you niggas\nI don't need no motherfuckers shoulders to lean on\nWay I ditch her pussy, I treat it like ding dong\nHarder than the Kim Possible theme song\n\n[Interlude]\nYeah re- real quick\nI just-I just really wanted to say all you rappers suck\n\n[Chorus]\nOh she ratchet, I might smash her\nBend that backwards, she sing like pastor\nHomie on Casper, geekin' like Dexter\nI do magic, no distraction\nYeah, my flow's on Destructo Disc, too afraid to cuff a bitch\nThese boys on that sucker shit, feature price went up as shit like\n\n[Outro]\nI been trying to tell these niggas\nI got- I got the Krabby Patty formula man\nCome fuck with me!", "image": "https://images.genius.com/2a86b3e74e0d02c0db67d1aca1ee392e.500x500x1.jpg"}], "artist": "XXXTENTACION"}