{"songs": [{"title": "What You Want", "album": "Young Sinatra: Undeniable", "year": "2012-04-30", "lyrics": "[Intro]\nNunca creí que esto iba pasar\nEres lo mejor que me ha pasado\nTe quiero tanto\n\n[Hook]\nTake some time, do it slow (Tell me what you want)\nIt's about that time ('Bout that time), girl you know it (Tell me what you want)\nI know you are my girl (tell me what you want)\nWhy act like you don't want it girl? (Tell me what you want)\n\n[Verse 1]\nBaby girl when it comes to women, I've been around the block a couple of times\nBut you're the only shorty that's running circles in my mind\nAnd in this day and age that we live in, and it's all defined\nWhy you so intellectual? Why you so damn fine, now\nHey girl, hey girl yeah I'm trying to get it\nStop with all these games and tell me what up with it\nJust take my hand, I'll be your man\nWe surrounded by infidelity in this world that we live in\nBut I promise I'll never give in, that's a given\nI'm living for you and none other\nJust a brother trying to find a lover to cherish until he perish\nWith honeymoons on the stars and vacations in Paris\nDon't be embarrassed if you get addicted to these kind of things\nIt's the finer things, fuck the haters and what the drama brings\nIt ain't nada, I supply the Prada and diamond rings\nJust as long as your heart sings, so\n\n[Hook]\nTake some time (Take some time), do it slow (Do it slow) (Tell me what you want)\nIt's about that time ('Bout that time), girl you know it (Girl you know it) (Tell me what you want)\nI know you are my girl (Tell me what you want)\nWhy act like you don't want it girl? (Tell me what you want)\n\n[Verse 2]\nUh, yeah\nAnd now we back at it, shorty pussy like a drug\nAnd she got me cornered like a crack addict\nGot my mind racing, era-dict\nBetter yet it's erotic\nYou want it? I got it\nLook at what you started, way she work it when she on top\nI might as well applaud it\nLord have mercy I'm trying to get it\nRip it and split it, hell yeah you know I did it\nConverse then lay you down like a verse, I'm trying to hit it\nBaby I want it, always down to keep it a hunnid\nWith you my feet are never on the ground, no way I'ma plummet\nHeaded to the summit, so tell me are you really 'bout it?\nI never doubt it, you're the one that I need\nApart from you my emotions begin to recede\nYou're everything that I have wanted and all that I need\nSo shorty tell me how you feelin', worth feelin', looks killin'\nI need it, I'm not tryna beat it and delete it\nI'm trying to build, and let you know that everything we share is real\n\n[Hook]\nTake some time (Take some time), do it slow (Do it slow) (Tell me what you want)\nIt's about that time ('Bout that time), girl you know it (Girl you know it) (Tell me what you want)\nI know you are my girl (Tell me what you want)\nWhy act like you don't want it girl? (Tell me what you want)", "image": "https://images.genius.com/4cb73fd1e86a44f861bc4ba694c17126.1000x1000x1.jpg"}], "artist": "Logic"}