{"songs": [{"title": "The Cure", "album": null, "year": null, "lyrics": "[Intro]\nCole World, the new Nat King\nIf I ain't the illest nigga, I'm his new vaccine\nReally more like poison when his New Jack Swing\nAnd my bed is like a deck of cards - two black queens\nA nigga don't like me, he just a fucking hater\nWhat you made last week, I just tipped the fucking waiter\nWhat that feel like? Tell me what that feel like?\nNigga fuck your Twitter, bitches follow me in real life\n\n[Interlude]\nWelcome back, ladies and gentleman, to a brand new season. Dreamville, Cole World. So much has happened in our time apart\nI can’t wait to share it with you all in due time. Did you miss me?\nI know I missed you. Can’t believe these niggas ain’t rap on this shit man...\n\n[Verse 1]\nHeard niggas got beef\nThen they see me on the street, and don't speak\nHeard niggas dropping songs every week, but they weak\nYeah, I heard about your deal, hope they keep the receipt\nHeard niggas out there saying I would be Memphis Bleek\nWell, how you feel when that nigga got mills?\nAnd you sitting, commenting, discussing on how you feel\nBout another nigga shit, or another nigga chips\nMeanwhile I’m on the strip, putt puttin’ wit ya bitch\nCut something in the 6 then dip to 160\nBitch don’t fuck with me, trust nigga I’m sick\nCan’t tag me, fuck nigga I’m it—watch this\nWith my heart on my sleeve I bleed pardon my greed\nI plead insanity, with a side of vanity\nHow can it be I blew up singlehandedly\nNobody handed me shit\nGranted though, I planned to be rich\nUnderstandably, funny how I talk so candidly\nOn cameras but won’t holla at family only randomly\nAfter a few drinks come our realest convos\nMy handle on my thoughts used to be as ill as Rondo’s\nScreaming fuck whitey, forgetting I’m still mulatto\nAy reverend, will I get to heaven, he said “hell if I know,” shit\nStay scheming, day dreaming, chain gleaming\nName should be Abe Lincoln ‘cause I cannot tell a lie though\nAll facts in fact, been all that\nBefore Kenan and Kel swallow the key to my cell\nWhich means, I got an impossible lock to pick\nAnd if you want my spot, you gotta go through lots of shit\nNigga, Cole the truth, you the opposite\nI be tryna figure out why I cannot commit\nWith who I’ve known for years, is it hoes or fear\nMeanwhile she wonder if the one she chose is pure\nNo cure for the cold, rather Cole the cure\nThem last lines was more honest than your whole career\nNigga, you a phony, only got few homies\nI prefer lonely, you rap niggas don’t know me\nStaying to myself, not concerned ‘bout my health\nI’m a mothafucka and yo baby mother is a milf\nCouple years ago they had a nigga sitting on the shelf\nNow they tell me “man you like the realest shit I ever smelt”\nThey say, “Boy you got the belt\"\n\"Plus you better than so-and-so!”\nI keep it modest but inside I already know it though\nYea thanks my nigga, yea thanks my nigga\nI deserve but nah this ain’t Tank my nigga\nLeave the party like I just robbed a bank my nigga\nBag full of money, fuck yo debate my nigga\n‘Cause two years ago and I ain’t make it, I was pissed\nBut you care a little less about a list when you rich, nigga\nWhen you rich nigga...\n\n[Interlude]\nBut that’s not what we came here for. We didn’t come here to brag; we didn’t come here to boast, to stunt. We just came here to flex. Ladies and gentlemen, I appreciate your patience. I assure you, it’ll be well worth the wait. In the meantime, if I can get right back into it though. Check it...\n\n[Verse 2]\nHow many Kanye beats do a nigga gotta murder\nTo prove my mind’s further, hater nigga converter\nTook kids to Carowinds which I’m sure you never heard of\n‘Cause I didn’t tell the news or the Fayetteville Observer\nI don’t do it for the press, I’m blessed, I made it out\nSitting on this plane, my biggest thing to complain about\nSomewhere between yesterday and now\nI done lost my jewelry, Rollies, chains, almost lost my cool\nBut see, I just left kids who ain’t got a fucking thing\n‘Cept a lot of fucking problems and a lot of fucking pain\nAnd here I go bitching ‘cause my Jesus piece missing\nGot a feeling housekeeping finally caught a nigga slipping\nEyes wide open, they just found a pot of gold\nNow lil’ Julio is somewhere shining on you hoes\nBut that’s how it goes, fuck it I’m still breathing\nLike my lil’ nigga Jaheim, we here for a reason\n\n[Outro]\nThat’s my lil’ man Jaheim. He said, “Cole, can you shout me out on a song?” I was like, “I don’t know man,” but in my mind I knew I would shout him out though, you know—Fayettenam, 2-6. Dreamville. We from a different world. Cole World...", "image": "https://images.genius.com/5d26e3f98e53c12d1610f4bd94b4ac58.500x500x1.jpg"}], "artist": "J. Cole"}