{"songs": [{"title": "Just Can’t Get It Right", "album": null, "year": null, "lyrics": "[Intro: RZA]\nOne, two, it’s the Brooklyn Zu\nThree, four, better shut your door\nFive, six, nigga, get yo' shit\nSeven, eight, gonna lay 'em to sleep\nOne, two, it’s the Brooklyn Zu\nThree, four, nigga, shut your door!\n\n[Verse 1: Shorty Shitstain]\nI make money, money don’t make me\nI squeeze them honies, homie don’t hate me\nI keep my money in a Hefty bag\nFuck a safe, I pack a fo-fo automatic\nI ain’t your average rapper, I ain’t your average camper\nI’m on some new shit and you can get adapter\nI had it up to here, I had it up to here\nWit' niggas, with them counterfeitin' flows this year!\nI know a lot of ya’ll niggas can’t get it right\nJust can’t get it right, just can’t get it right\n\n[Hook: RZA]\nY'all niggas, just can’t get it right\nJust can’t get it, just, just can’t get it right!\n\n[Verse 2: 12 O'Clock]\nHold guns like the bar that hold the shower curtains\nI’m in the club, watch my watch, let my diamonds flirtin'\nTime to leave, and these two girls sayin' somethin'\nCross the Brooklyn Bridge, now a nigga finger fucking\nPapa Wu crib full, C.R.E.A.M, watch the purses\nYou better believe I’m holding like the service\nK-Tab rock bulletproof suburbans\nTwo more suburbans, bodyguards rockin' turbans\nPutman Avenue, Uncle Freddy watch the dirt in\nTake Saudi and murder it, soundtrack 4-thirdin'\n\n[Hook 2: RZA & (Shorty Shitstain)]\n(I know a lot of ya’ll niggas can’t get it right)\n(Just can’t get it right, just can’t get it right)\nY'all niggas, just can’t get it right\nJust can’t get it, just, just can’t get it right!\n\n[Verse 3: Young Dirty Bastard]\nBorn in a race that lies no definition\nWrite rhymes in brown sand, fuck the composition!\nEliminatin' those who are fake is my decision\nI send the hail mary to your God, now convert ya whole religion\nIf the sky had eyes, he could see the pussyness\nIn all you tender loving business guys\nI can see the future maggots in all you flies\nHammer start seeing the weakness, niggas terrified\nListen, I fed a pig to a savage then he jumped like rabbit\nDumped a ball in a hoop then he caught AIDS\n\n[Hook 2]", "image": "https://images.genius.com/0050e4b1c52ecca6d63818331b489e2a.683x683x1.jpg"}], "artist": "RZA"}