{"songs": [{"title": "Mr. Prescription", "album": null, "year": null, "lyrics": "[Intro: Sly (and Nikki Grier)]\nTake a little bit of Hennessy, and mix it with some syrup\nPut ya hands up if you crazy enough to get fucked up in church\n(Doctor you got my prescription and it's keepin me alive)\n(Doctor you got my prescription and it's keepin me alive)\n\n[Verse 1: Dr. Dre]\nThank you for bein patient, I got ya application\nI know you been waitin to see the Doctor!\nHere it is, here I am, here it is, here I am\nYes, yo push is right back up in the scene\nYes, my dope is so methamphetamine\nYes, it's coke I've laced inside every beat\nShit, I'm tryna get ya high\nYou been sittin in the waitin room far too long\nToo late for AA, you're far too gone\nI know you can't take these awful songs\nLike a punk full of bullshit, nigga hell nah\nThey want some real shit (Right now!)\nThey want the real (Right now!) relax, I got you\nGood thing I had a couple hundred tums layin' around\nNigga dispenseries, servin' by the pound\nBack in business, bigger than we ever was\nIt's Aftermath nigga, you know you heard of us\nWe're leavin narcotics on every note\nWe just struttin the streets, like when the Levee broke\nI got the antidote\nI got ya hands goin up and down, you done fucked up now\nBut it's hard to go back to that bullshit\nAnd whatever's on the bar, D.R. is gonna push it\n\n[Hook: Sly]\nYou can be my patient (I'm operatin') all night\nYou can be my patient (Man I'm tryna fuck) all night\n\n[Verse 2: Slim da Mobster]\nI beat that boom boom, down like your knees are\nLegs spread out, like I'm mixed in a rebirth\nSex contest? There ain't no competitor\nLooks like it's too late to get ya girl\nNow, cause now what? Now she's my girl\nNow you ain't gotta go round no more\nFo sho! The doctor's operatin on the flow\n\n[Outro: Nikki Grier]\nDoctor you got my prescription and it's keepin me alive\nDoctor you got my prescription and it's keepin me alive", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}