{"songs": [{"title": "I’m Gonna Crawl", "album": "Nutty Professor II: The Klumps (Soundtrack)", "year": "2000-07-11", "lyrics": "[Intro]\nLive and learn\nLife's a lesson (life is a lesson)\nAnd I'm the teacher\n\n[Hook]\nFirst I'm gonna crawl, uh (crawl)\nThen I'm gonna walk, uh huh (walk)\nThen I'm gonna stand, uh huh (stand)\nThen I'm gonna talk, uh (talk)\nWhat I gotta learn, what (learn)\nIn order to teach, (teach)\nThen I gotta burn (burn)\nIn order to reach (reach), my nigga\n\n[Verse 1]\nYo, I see what I see, day by day\nHopin that the Lord can, pave my way\nHave I been forgotten, have I forsaken\nOr maybe I'm just wrong with the moves that I've been makin\nHatin others cuz they hate me, over envy\nWanna send me, when we used to be friendly\nThink I started off on top? With two platinum albums?\nNaw dog, I started off on the block\nI just did shit to get shit\nNiggas always knew I was down to hit shit\nThat's why I stay wit shit\nPlayed with shit, but it wasn't a game\nFirst time locked down, wasn't the same\nA whole new world, nothin but close to steel\nNiggas gettin split for real, miss a good deal\nThey ain't call nobody, cuz don't nobody care\nThey got my back against the wall, fuck it I'm just here\n\n[Hook]\nFirst I'm gonna crawl\nThen I'm gonna walk\nThen I'm gonna stand\nThen I'm gonna talk\nWhat I gotta learn?\nIn order to teach\nThen I gotta burn\nIn order to reach, (my nigga)\n\n[Verse 2]\nDog it's like this, when the fog is type thick\nA nigga might flip, and a nigga bite quick\nBut I stay focused on what's important\nSupportin my family, fuckin with my dogs and recording\nAccording to the man upstairs, we all got our own problems\nSo you, stop worryin about theirs\nI'm long time ago, look awake, cuz he'll leave you\nI hear none, speak none, see none, evil\nAll I can do is teach you, what I know\nHow I flow, how I get down, where I go\nMaybe what I been through, will send you\nSomewhere, other then where, dreams all out the window\nI love my people, all of my people\nAnd God gon keep me callin my people\nYou gots to live life to the fullest\nIt ain't always about the size of the gun, sometimes it's the bullet\n\n[Hook]\nFirst I'm gonna crawl\nThen I'm gonna walk\nThen I'm gonna stand\nThen I'm gonna talk\nWhat I gotta learn?\nIn order to teach\nThen I gotta burn\nIn order to reach, (my nigga)\n\n[Verse 3]\nEvery day we live and learn, take it step by step\nAnd we create our own path, until there's no life left\nI hold my death, off for as long as I can\nKnowin my man, is plottin with the chrome in his hand\nSupposed to be fam, but niggas get shady over money\nMy nigga, pull out the 380 over money\nCrazy over money, can't do without it\nI got other shit to deal with, I'm like forget about it\nIt's the one I don't know but must teach that comes first\nBecause he comes with the thirst of a nigga that tatted the worst\nIt's like a curse that's to be lifted, he was there but he gripped it\nGot a call and he shifted, once he found out he was gifted\nGotta kick it from the heart, and I hope you got it\nIt was there from the start, I just hope you spot it\nCuz it's my blood on paper, my soul on paper\nWords to live by will leave a hole in the paper\n\n[Hook]\nFirst I'm gonna crawl\nThen I'm gonna walk\nThen I'm gonna stand\nThen I'm gonna talk\nWhat I gotta learn?\nIn order to teach\nThen I gotta burn\nIn order to reach, (my nigga)", "image": "https://images.genius.com/10daadc874696b7db49a57d993ac1f64.500x496x1.jpg"}], "artist": "DMX"}