{"songs": [{"title": "In My Own World (Check the Method)", "album": "Resurrection", "year": "1994-10-25", "lyrics": "[Hook] (x4)\nYeah yeah, now check the method\n\n[Verse 1: No I.D]\nNo time to get all excited, just write it\nFrom the inside let the pen slide, and spread\nThe ink on the papyrus, come understand this (what?)\nPaint the canvas, givin' you my vision\nTo mold you, compose you\nGet a picture of the scene, then get an exposure\nWords out my cipher, the life of my circle\nPain trapped inside of me, Cabrini to Ida B., don't lie to me\nYou want me in your needle\nSquirt me in your vein, maintain on the couch\nI excite your brain til I'm out of your system\nBeat digger, not a nigga or a niggaro\nI figure you're the winner of the bread\nPrecede your thoughts 'fore they come into your head\n(Yo, kid kinda nice)\nFrom the word, I speak, unique, clear and concise\nHeads I'm boring, soaring to a new height of flight\nAnd then fight the night\nWith a light to gain sight make your competition say aight\nNo I.D. from the city with a beach on thirty-first\nMaking all butt crews disperse\nI'm in my own world\n\n[Hook] (x4)\nYeah yeah, now check the method\n\n[Verse 2: Common]\nI say pay attention boy, I say uk look at here\nI want you to see me; when you do, you look in fear\nI dilate pupils that's cornea than a retina\nMy Book of Life you felt it, because of the texture\nWhen I'm bubbly I call the ex ta, see if she still love me\nI'm advanced like a copy studs be on my sac to dub me\nCheap ass niggas, go and purchase it\nI ain't do all this work for shit\nMy style's my child I gave birth to it\nLike an immaculate conception, clean I came\nWent through label pains, didn't give shorty a name\nI put, bros before hoes that's the way love and life goes\nIt's a Jungle out there but I'm never Fever-in for them white hoes\nI love black thighs, you sisters better realize\nThe real hair and real eyes get real guys\nSo before you makeup your face, you better make up your mind\nI hope you wake up in time for the revolution, or you gon' be like\n\"I can't believe it! I got shot!\"\nBowe, so I lick one, not for Riddick\nBut I got the Rid, for my dick\nAnd the crab MC's that be all over it\nHuh, what good is the Rid without the comb?\nI'm the street pick peace to Nick, Tim, Mark and Kendall\nI remember me and Dion tried to get into Mendel\nI didn't have No I.D., they wouldn't let me in\nNow them same gumps be askin' me to get them in\nI be like, \"You don't know me... fool\"\nAnd color him purple (why?), 'cause he ain't in my circle\nNow I'm talkin' square biz to you and I'm out\nI'm in my own world", "image": "https://images.genius.com/8cc4e9a4a27cf48a434a2d5800999430.500x500x1.jpg"}], "artist": "Common"}