{"songs": [{"title": "Curry Chicken", "album": "B4.DA.$$", "year": "2014-12-23", "lyrics": "[Produced by Statik Selektah]\n\n[Skit: Joey Bada$$ + Joey's mother]\nBreak it\nLike, \"Oh, he's broke! I told you he was broke!\"\nWord. \n\"I told you he ain't got no money!\" or, you know, this and that, or whatever, whatever, then you'll see some other people, you'll put that you're here in this house: \"Oh, Joey done made it! He bought a crib! He this, he that.\"\nWord, haha. \nSo it's all a story, it's a perception that people make for you, along the way. So it's not really what it necessarily is at any point in given—in time, and that's the thing that concerns me. \nBreak it down\nWe break it down like (break it down)\nJoey Bad', he break it down like\nMy nigga Fly, he break it down like\nMy nigga Statik, break it down like\nYeah, yeah, yeah, yeah\n1-2, 1-2, 1-2, 1-2\nAlright, alright, alright, alright, uhh\n\n[Verse 1]\nFirst things first is I been rehearsing these verses\nIn hopes that I hit the surface and keep myself afloat\nBut I know one day I'm earning me some platinum and some gold\nAnd all them labels could just reimburse this dick in they throat\nAnd tell my mama \"Oh no,\" your purses will never run low\nNo more cause back when I was four, and we was poor\nYou would purchase the store\nSo here I go, your little man has got to grow\nI'm walking out the door\nMy mama just be smiling cause she know\nI got my back, ain't gotta worry\nOnly thing she ask is that I hurry\nHome in time for Christmas for some dinner (some dinner)\n\"Seen you on TV again, boy, you lookin' thinner\nBut you lookin' like a winner\", aye\n\n[Hook]\nYou got to give to get and then you give back\nYou got to give to get and then you give back\nYou got to give to get and then you give back\nThen you give back, then you, then you give back\n\n[Verse 2]\nWorst thing worse, I could've been stealing your purse\nOr just been, putting in work and leaving niggas in the dirt\nBut ever since birth I knew I would be something on this Earth\nSo now I spit that dope, that shit be hittin' ya nerve\nAnd to my papa, my word is my bond\nWhen you held me in your arms\nDid you know along that a star was born?\nThen you named me Jo-Vaughn, now that name ring alarms\nNearly 20 years later, we on a plane to The Palms\nI gotcha back, ain't gotta worry (worry worry worry)\nOnly thing I ask is for some curry (curry c-c-curry)\nChicken when we land we eatin' dinner\nMama seen me on TV again, lookin' thinner\nBut I'm lookin' like a winner, aye\n\n[Hook]\nYou got to give to get and then you give back\nYou got to give to get and then you give back\nYou got to give to get and then you give back\nThen you give back, then you, then you give back\n\n[Bridge]\nNow I lay me down to sleep\nI pray the Lord, my soul to keep\nIf I should die before I wake\nI pray the Lord my soul to take\nNow I lay me down to sleep\nI pray the Lord, my soul to keep\nIf I should die before I wake\nI pray the Lord my soul to take\nBreak it down (my soul to take)\nBreak it down (I pray the Lord my soul to take)\n(My soul to take)\nBreak it down (I pray the Lord my soul to take)\nBreak it down", "image": "https://i.embed.ly/1/display?key=fc778e44915911e088ae4040f9f86dcd&url=http://redmp3.su/cover/2429863-460x460/curry-chicken.jpg"}], "artist": "Joey Bada$$"}