{"songs": [{"title": "Where the Pimps At?", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "[Too $hort]\nPut your hands in the air if you're pimpin\nIf youse a real player with the women\nAnd all the ladies, stuck with a lame\n$hort Dawg'll never let 'em fuck up the game\nYou better break that nigga, shake that nigga\nDon't wait too long girl, make it happen quicker\nChoose on a real pimp, fuck that imitation\nWhat's he gon' do when I'm up in his face and\nI tell him his hoe ain't his no mo'\nFrom here on, mind your business yo\nCause all year long, I'ma pimp this hoe\nIf you don't want the money what'chu in it fo'?\nStop pretendin, and be yo'self\nIf you had some pimp game you wouldn't need no help\nYou can be like us, you ain't got to front\nReal players, we do what the fuck we want, now\n\n[Chorus: Too $hort]\nWhere the pimps at? Where the pimps at?\nWhere the pimps at? Where all the pimps at? Beeitch!\nWhere the pimps at? Where the pimps at?\nWhere the pimps at? Where all the pimps at?\n\n[Too $hort]\nAll pimps ain't men, all hoes ain't women\nWhy you always braggin when you know you ain't in it\nWhy you so fake, man you're just a lil' wimp\nWhy you wanna shake hands and touch a real pimp\nI heard you went to jail and got broke for your smokes\nYou know you ain't nothin but a joke to my folks\nIf you had game, the world could be yours\nBut you don't even know that your girlfriend's a whore\nShe's good at suckin dick, make you cum quick\nShe's got her own website, pay her rent to click\nIt ain't free, and no she's not a lonely bitch\nShe likes to shop, I hope you're not her only trick\nCause if you fuck with her\nYou're not her man, you're just a customer\nCain't even hang with the boys\nAll the real pimps make some noise\n\n[Chorus] * last line changed\n* Where all the pimps at? All the pimps in the house make some noooise\n\n[Kool Ace]\nYe-yeahhhhhh, hey hey\nYeah baby, all that we have seen\nOn the TV screen about, all that we have dreamed of\nIs not before you, real pimps own game\nReal macks on this\n\nIt's Mr. Real Feel Pimpin at you once again\nGame done changed but I'm still at them Benjamins\nSo break bread hoe, huh, get too it honey\nMake it rain in this bitch like Hurricane Money\nBig macks on 'gnacs now get your {?} on deck\nWe breakin bitches in Hollywood with them big fat checks\nIt ain't hard for you to fit in, go do the figures\nYou fuckin with gator legends some, some bigger niggas\nMack A-C-E, in 3-D\nRepresentin this motherfuckin P-I-M-P\nI-N-C bitch now don't hate it\nGame decorated, Pimpin' Incorporated\nWoo!\n\n[Too $hort]\nYou listenin to Pimpin' Incorporated\nToo $hort mix tape\nCheck out the website\nUpAllNiteMusic.com", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}