{"songs": [{"title": "$h!t (duplicate)", "album": null, "year": "2013-09-24", "lyrics": "[Intro - Future]\nTalkin’ ’bout ya bussin’ heads, nigga you ain’t shot shit\nTalkin’ ’bout ya bussin’ clips, nigga you ain’t\nOh you done and got all them guns and you ain't killed nobody yet?\nHow many times you shot that motherfucker nigga?\nAin’t nobody popped up dead\nI thought yall niggas murderers\nShit\n\n[Hook - Future]\nTalkin’ ’bout you poppin’ tags, nigga you ain’t bought shit\nTalkin’ ’bout a hundred bottles, nigga you ain’t popped shit\nAll you talk is banana clips, nigga you ain’t shot shit\nSpending money on these hoes, nigga you ain’t fuck shit\nTalkin’ ’bout you poppin’ tags, nigga you ain’t bought shit\nTalkin’ ’bout a hundred bottles, nigga you ain’t popped shit\nAll you talk is banana clips, nigga you ain’t shot shit\nSpending money on these hoes, nigga you ain’t fuck shit\nShit\nShit\n\n[Verse 1 - Future]\nBought the ho a hundred pair of red bottoms\nThat’s a quarter milli on a hand job my nigga\nBrrrllll! Stick ‘em\nFuck you and every nigga came with ya\nGo and put a nigga on a picture\nGo and put a nigga on a t-shirt\nBack in the day when a nigga sell dope\nI’mma slap ya daddy out of ‘em and then put ‘em in a hole\nGlock 40 wooo\nTurn up, turn up\nMy ambitions as a rider\nSippin’ on lean getting higher\nNigga I’m a codeine buyer\nNo you not a foreign whip driver\nShout out to the shooters and the shooters on me\nYou never walk around with a lot of money\nAll ones fallin’ all out your pocket\nWhen you hit ‘em in the head, can you keep it solid?\nBulletproof whip, we’ll blow it up\nLike some raw uncut, don’t blow it up\nRepresent your gang, nigga throw it up\nI don’t give a fuck where you at, nigga throw it up\n\n[Hook - Future]\n\n\n[Verse 2 - Future]\nCatch a nigga slippin’ at the red light\nWith ya AK, let me see you shoot it\nYou a goon? You a goon? You a goon? You a goon?\nNigga, let me see you prove it\nPresidential Rolly and its floodin’\nLove a nigga wrist when its shinin’\nHate a nigga wrist when its blingin’\nSo I went and added more diamonds\nHot Boy nigga, B.G\nThat’s the way these young niggas eat\nDrinkin’ on syrup, can’t sleep\nKeep it copacetic with ya partner\nBuster niggas runnin’ around with real choppers\nNigga what’s the color of them bottles? They ain’t gold\nHow you moving ’round with ya ho?\nYou ain’t even sticking to the code\nPimps up, pimps up, hoes down, hoes down\nA pool full of money and I’m ’bout to drown\nI’mma fool on the corner with that Bobby Brown\nButton up suits at the Grammys\nHad to turn it up for the family\nYes sucker-Freebandz bandit\n\n[Hook - Future]", "image": "https://images.genius.com/383bdf7e658c81236926af98a9211465.780x780x1.png"}], "artist": "Future"}