{"songs": [{"title": "Too Lit", "album": "Too Lit", "year": "2017-07-05", "lyrics": "[Intro]\nStatik Selektah\nOh you lit\n\n[Hook]\nNever could be too lit\nNever could be too rich\nMy bitch never could be too thick (yeah)\nNever could be too (riding through this bitch like)\nNever could be too lit (aye)\nNever could be too rich\nMy bitch never could be too thick\nI told Satan, \"Won’t be too big\"\n\n[Verse 1]\nI know my angels got my back, but it's demons all in front of me\nA halo for a hat, I wear the crown always underneath\nThe king to a God, tryna guard all this energy\nThat's why I stay strapped - in my dungarees\nLooking at the past, thinking everything is done to me\nMoving so fast, I can't let the future run from me\nOne foot upon the gas, other foot up in my enemy's ass\nI'm just tryna make my legacy last\nIt's everlasting, you never passing a nigga's passion\nThey on their last stretch like they're elastic\nI'm Mr. Fantastic, everything I drop another classic\nThey only mad cause I got it mastered\nAnything that I imagined, I made it happen\nTurned the pen into a wand and I made magic\nI'm good with the words but I'm better at the actions\nI'm putting in the work, man I'm never relaxing, my nigga\nOn God!\n\n[Hook]\nNever could be too lit\nNever could be too rich\nMy bitch never could be too thick\nNever could be too, ooh\nNever could be too lit (aye)\nNever could be too rich\nMy bitch never could be too thick\nI told Satan, \"Won’t be too big\"\n\n[Verse 2]\nAnd you don't understand my angle\nGetting tangled in, all kind of stars that's spangled\nFeeling like I'm dangling over a edge\nPlaying tango with the Devil trying not to break a leg\nI'm just tryna break bread with my brother man\nRather see us niggas dead, you don't understand\nMiddle fingers to the Feds and the government\nI'm taking shots to the head like Osama Bin, I’m wilin' man\nThey rather see me talking 'bout my wallet and\nHow I got the girls going crazy at the colleges\nShe give me good brain then I might just pay her scholarship\nPussy intuition, baby get up on this knowledge and just swallow it\nI penetrate deep like a hollow tip\nYou can ride the mic baby girl, we can politic\nThe money, man I'm piling it, I'm profound at this\nNever high profile with it, my whole style legit\n\n[Hook]\nNever could be too lit\nNever could be too rich\nMy bitch never could be too thick (yeah)\nNever could be too, ooh\nNever could be too lit (yeah)\nNever could be too rich (aye)\nMy bitch never could be too thick (yeah)\nI told Satan, \"Won’t be too big\", ooh\n\n[Interlude]\nOoh, that's right (yeah)\nOoh, that's right, that's right, yeah\nNever could be too lit\nTell America to suck my dick\nNever could be too big\nNever could be too\n\n[Verse 3]\nUh, who want spar with the demi-god, demi-god?\nFeeling like I'm Thor for the denims on, special cloth\nTalk and got attached to the emerald\nA vessel of a force, to be with you in the epilogue\nIt's another episode, written from the upper echelon\nJust hidden in another rapper lungs, shalom\nShould I carry on tradition, as a Barry Bond division?\nThrough the windows of my soul, ain't no medical prescription\nI'm on a mission, keep an eye out for opposition\nNiggas tryna sneak him, that's for his rap position\nBut they better off just quitting\nGot bars like they guards hitting in San Quentin\nAnd I'm sicker than the judges with the sentencing, I sense tension\nViewers discretion, will be advised anytime that he arrive\nThey caught the vibe, way before I step inside\nI walk with the light, see the spark in my eyes\nOn God!\n\n[Bridge: Elis Regina]\nSentindo o frio em minha alma\nTe convidei...\n\n[Hook]\nNever could be too lit\nNever could be too rich\nMy bitch never could be too thick\nNever could be too, ooh\nNever could be too lit (aye)\nNever could be too rich\nMy bitch never gonna be too thick\nI told Satan, \"Won’t be too big\", ooh", "image": "https://images.genius.com/7e08879647cc3378a601ad4199b92be8.1000x1000x1.jpg"}], "artist": "Joey Bada$$"}