{"songs": [{"title": "Nobody Cares (The Remix)", "album": "Strangeulation", "year": "2014-05-06", "lyrics": "[Verse 1: Tech N9ne]\nThey said I really don't rhyme anymore\nAnd dreaded the moment the N9na find any dough\nClimb in the hoes, he never will shine when he flow\nWhat are you listening to? The music I'm giving to you\nIs killing the muthafuckas you kick it and jigglin' to\nSome of you get it, but a lot of you never let it\n'Cause you know when it get up into your woman, I'ma wet it\nI'ma wake up, everybody break up the haters\nWe do it for real and never do fakers, amaze us\nTecca N9na spending cake up in Vegas\nGot the mule and 40 acres decades ago\nNigga, I'm a vet, made to grow\nLook at it when we city to city, Tech pays the dough\nWatching my lyrical bullet lay ya low\nNext way to go and she with it so let's lay the flow\nThese bustas be so funny, they all shakin' when I rip\nBut in my face, they be so chummy, nigga, y'all, fakin' when I flip\nWhen they know that my flow is money, y'all is bogus so go get from me\nMan, I'm over this, how they grungy when they all take it in the hip?\nWar, I declare, 'til Donny air\nAnd I want ¡MAYDAY!, Kaliko, Stevie Stone, Ubi and Godi there\nI'm gonna push this hip-hop music to the fullest 'til I'll be mayor\nThey don't give a fuck if I swear, this the God damn remix to \"Nobody Cares\"\n\n[Hook: Krizz Kaliko, (Crystal Watson) & (Tech N9ne)]\nEverything in my head, all these words that I said\n(Nobody cares) Nobody cares\n(And nobody gives a damn what I say, who I am)\n(Nobody cares) Nobody cares\nThese bright lights show my life (nobody cares)\n(No one, no one, no one, no one cares, nobody, nobody)\n\n[Verse 2: Wrekonize]\nStare in the face of the careless pair\nThis facts, ain't nobody gotta say no more\nI been breaking my back while you been crazy relaxed\nA workaholic with a bit of crooked halo-lo\nPaint so pro that I can't go prone\nYou better get a step and let the maintenance know\nThat I kick in doors and get to stickin' whores\nAll 'cause I'm loving every minute that I grace this show\nGame beater, came sweeter\nEvery word they said to me is \"damn\", diva\nVein heater, flame speaker\n¡MAYDAY! mace, they spray liters\nWavin' all out 'cause I'm tearing the crowd\nThey know I came to drop 'em down a whole lot of stairs\nRockin' so rare, I'm a topper, don't stare\n'Cause ya know we said before that nobody cares\n\n[Verse 3: Godemis]\nCatch this bullet, who's the receiver?\nI never learn how to follow a leader\nIn need of a medical reticle bleeder\nYou don't give a flying fuck, well, me neither\nMaybe I'm overthinking it, look at the way I'm linkin' it\nWith words, I'm a seamstress\nGot plenty of fuel, I pity the fool\nAnd tell 'em ridicule is the burden of genius\nAnd I mean this, like I seen this\nComing but it don't mean shit to y'all\nAnd my pedal's to the metal and whenever they ready\nThey said it, I'm coming to get it 'til I hit the wall\nStealing all, of the cake, trip\nPlacement of tables turn a bit, so who the fuck's turn is it?\nCouldn't give two shits, see, I'm not concerned with it, my\n\n[Hook]\n\n[Verse 4: Bernz]\nIs it that my shit's too catchy?\nIs it that these hits come naturally?\nIs it that we the chosen ones\nAnd y'all never get picked so you act like a bitch?\nTell me why 'cause you're making me feel bad\nCan we all get along? Don't be mad\nCarry on, fuck it, bring the feedback\nI feel so at home where the odds'll be stacked\nCrash course into music business\nBetter trust yo' muthafuckin' instincts\n'Cause these suits are scared of what's different\nUntil it's banging on top of hit lists\nAnd that's why the industry's fiction\nAnd Strange Music's here to reign, bitches\nWe killed the whole opposition\nAll 'cause our fans are fuckin' hellicious\n\n[Verse 5: Ubiquitous]\nSometimes, if you say the word, the word falls\nOn deaf ears or peers and they half-forget it\nIt feels like nobody'll care until you stare\nBack apathetic, and that's pathetic\nMatter fact, it's not in my rap genetics\nWhatever the fuck you was after, get it\nThe law of magnetic attraction'll come and cause\nReaction, dog, you only have to let it, ah\nAct upon my instinct when I set the bar\nLet the cards fall where they may play\n52, now pick it up, I, make the mess\nMaybe yes, that's where they stay\nNo, fear to show, I'm clear to go\nAnybody else who ever been here should know\nThat a voice with a passion and purpose\nIs far from a theory, yo, but y'all don't hear me though, uh\n\n[Hook]\n\n[Bridge: Stevie Stone] (x2)\nEeeee! Hit 'em with the muthafuckin' rhythm\nWhen they come with the N9ne, I'ma get 'em\nKaliko, ¡MAYDAY! Ces Cru, Strangeland\nWe mix all wit' 'em like\n\n[Verse 6: Stevie Stone]\nMuthafucka, in the meanwhile, hear the remix\nWe bound, what I mean now? Rush time!\nStage killer fuckin' with a main nigga\nBut the other Strange nigga, Brotha Lynch, gon' cut 'em up!\nCome in a noose, ya (cover contusions), vertical movement\n(The kid is a problem, better yet, he a nuisance)\nAll on my dick, nigga!\n\n[Verse 7: Krizz Kaliko]\nI'll get off my own dick, nigga, if you get off it\nI'm sick, nigga, puke it off, and in my lane, refuse to walk it\nIndependent nigga who's the boss refuse to loss\nAnd, if ya get offended, bust a move's an option\nOn the low (low), too many people is peepin'\nWe frequently eat up a piece of fajita, think he equal to me\nI let him know (know) that he could be in the seat\nAnd takin' off his feet about it and I'ma tweet about it\nReppin', me and the Tech, nigga, we effin'\nWhen we done, they wish we never left it\nAnd I'm guessin' you never had to pull out your weapon\nI'm the next best, give 'em a lesson (okay)\nThe way we eat a nigga's lunch, Psilocybin combusts\nMan, fuck it", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}