{"songs": [{"title": "Family Don’t Matter", "album": "BEAUTIFUL THUGGER GIRLS", "year": "2017-06-16", "lyrics": "[Intro: Young Thug & Millie Go Lightly]\nYeah, whaddup? (Ooo...)\nI'm tryna put my dick inside of your panties, yeah (Ooo...)\nAnd then I take this shit for granted\n\n[Verse 1: Young Thug (with Millie Go Lightly)]\nI'm at Rolling Loud, right there, rolling out\nSmokin' Backwoods and holdin' bae (Wheezy Beatz)\nI was gettin' protected by my savages\nYellow school buses, that's a Xanny\nCausin' me to sleep and I ain't plan it (Yeehaw!)\nI got some jobs all day (Jobs all day, yeah)\nRoll out the jar all day (All day)\nI be on Mars all day (All day, yeah)\nI'm with the stars all day, uh (All day)\nBoss all day (Boss all day, yeah)\nRoll up the raw all day (All day)\nBabysit your dog all day (All day, yeah)\n'Bout to watch you jog all day\n\n[Chorus: Young Thug (with Millie Go Lightly)]\nLike family don't matter\n(Oh, oh) What's poppin', what's the deal? (Oh, oh)\n(Oh, woah) What's poppin', what's the deal? (Woah, woah)\n(Woah, woah) What's poppin', what's the deal? (Woah, oh)\n(Oh, oh, hmmm...) What's poppin', what's the deal? (Oh, oh)\n\n[Verse 2: Young Thug]\nBagged a bad bitch, I got a foreign son\nTommy gun, found a real Tommy gun\nI dropped a milli' on my chain like I know Barry Bonds\nAnd I got a head full of hair like I'm from Amazon, uh\nGlaze that ass like a candle honey, uh\nFerragamo shower shoes for me, uh\nLightbulb, neck got jewels on it, uh\nLike an old school, I got some pull, don't I?\nHuh?\nSayin', abracadabra\nAbracadabra, kill all you bastards\nI don't want no wrassle\nThe bread ambassador\nNo nothin' else matter to him\nI'm ballin' like Patrick Ewing\nTurn up on you bastards\nI'm in a Ghost like Casper\nEverything go smooth for me like I got my Masters\nFubu Platinum up, birds in the Acura\nAlbums platinum and up, I'm killin' these bastards\n\n[Chorus: Young Thug]\nLike family don't matter\n(Oh, oh) What's poppin', what's the deal? (Oh, oh)\n(Oh, woah) What's poppin', what's the deal? (Woah, woah)\n(Woah, woah) What's poppin', what's the deal? (Woah, oh)\n(Oh, oh, hmmm...) What's poppin', what's the deal? (Oh, oh)\n\n[Verse 3: Young Thug]\nCountry Billy made a couple milli'\nTryna park the Rolls Royce inside the Piccadilly\nOh, he had a couple stripes actually (Of course)\nGot another half a milli' in white tees, of course (Don't you panic)\nDon't you take this shit for granted, don't you panic\nWhen I put my D in your pants, don't you panic\nWhen I catch up with your bitch, you know I'm smashin'\nI can put her on her feet, oh, oh head gasket\nYou gotta tell me what's wrong\nI can't wait to deep stroke to the mornin'\n'Bout to put my dick in your mouth right when you yawn\nYou gotta put that puss' on my lips whenever I'm on one\nI thank the red doll, so I whip my bum bum\nI'm 'bout to fuck somebody girl off this rum, rum (Go 'head)\nI'm chasin' all of these rats like I was Tom, yeah\nBut it ain't even matter, I was tryna kill these bastards\n\n[Chorus: Young Thug]\nLike family don't matter\n(Oh, oh) What's poppin', what's the deal? (Oh, oh)\n(Oh, woah) What's poppin', what's the deal? (Woah, woah)\n(Woah, woah) What's poppin', what's the deal? (Woah, oh)\n(Oh, oh, hmmm...) What's poppin', what's the deal? (Oh, oh)\n(Oh, oh) What's poppin', what's the deal? (Oh, oh)\n(Oh, woah) What's poppin', what's the deal? (Woah, woah)\n(Woah, woah) What's poppin', what's the deal? (Woah, oh)\n(Oh, oh, hmmm...) What's poppin', what's the deal? (Oh, oh)\n\n[Bridge: Millie Go Lightly, Young Thug & Both]\n(Ooo, baby)\nRollin' through the W6 (Ooh, nana nana)\nYou feelin' me, I'm feelin' you (I'm feelin' you)\nFallin' deep, too deep, purple dreams to catch myself (To catch myself, yeah)\nI be havin' nightmares shaped like you (Havin' nightmares)\nYou be blowin' smoke clouds shaped like me (You be blowin' smoke clouds)\nI be havin' nightmares shaped like you (I be havin' nightmares)\nYou be blowin' smoke clouds shaped like me (I just thought that you should know)\nTwo cups, can I drown in my mind, too? (Can I drown in my mind?)\nHear the track, spin it back, catch a vibe, too (Ooh, baby)\nThis the shit that be bad, so bad it's good for you, ayy (I just thought that you should know)\nTake a hit, we can sip like it's medicine\nChemistry, remedy, there's no better than\nThis the shit that be bad, so bad it's good for you (So bad), hey\n\n[Chorus: Young Thug]\nLike family don't matter\n(Oh, oh) What's poppin', what's the deal? (Oh, oh)\n(Oh, woah) What's poppin', what's the deal? (Woah, woah)\n(Woah, woah) What's poppin', what's the deal? (Woah, oh)\n(Oh, oh, hmmm...) What's poppin', what's the deal? (Oh, oh)\n(Oh, oh) What's poppin', what's the deal? (Oh, oh)\n(Ooo, what's the deal?)\n(Oh, woah) What's poppin', what's the deal? (Woah, woah)\n(What's poppin', what's the deal?)\n(Woah, woah) What's poppin', what's the deal? (Woah, oh)\n(What's poppin'?)\n(Oh, oh, hmmm...) What's poppin', what's the deal? (Oh, oh)\n\n[Interlude: Young Thug]\nMy heart so cold, I need a Icebox\nMy heart so cold, I need a Icebox\nIcebox Jewelry\nI need help, come and rescue me", "image": "https://images.genius.com/9bc1176534f1203d5df1330fc7210bf2.1000x1000x1.jpg"}], "artist": "Young Thug"}