{"songs": [{"title": "House of Pain", "album": "LAX", "year": "2008-08-26", "lyrics": "(Dodge this)\n\n[Verse 1]\nCatch me if you can I'm in those old school Barkleys\nBack to the fence, puffin on that Bob Marley\nFlow like oregano, nigga you already know\nMy competition's stiffer than Ronald Reagan, let it go\nBefo' you be a motherfuckin vegetable\nYou scrap niggas too animated like The Incredibles\nLet this beef go around like the 26's\nIt's young Game of flame, welcome to the House of Pain\nNigga what about The Game?\nKeep on playin boy, I'll hop out this fuckin Range\nLook I ain't even ask for his fuckin chain\nBut he took it off like Vanessa-Del-Rio\nNow I'm on my way to Rio\nAfter I see my P.O\nShe cool, she a Leo\nShe ain't trippin' off the weed smoke\nSo I'mma blow it like the Patriots\nAnd throw my dub up, cus Dr. Dre made me rich\n\n[Hook: The Game]\nWhere you from? (California)\nWhat city? (Compton)\nWhat you drive? (Impala)\nWhat you smokin' on? (Chronic)\nWhat you drinkin' on? (Patron)\nWhat you sittin' on? (The throne)\nRelax, make yourself at home\n\n[Traci Nelson]\nWelcome to Compton\nWelcome to Compton\nWelcome to Compton\nWelcome to Compton\n\n[Verse 2]\nI wrote the block off, I talk that shit\nSize 12 Bo Jacksons cause I walk that shit\nThere on Compton Blvd that's where I walk my pits\nBiggie and 2Pac and they bark like this...\nAs I spark my splif\nI see the coroner puttin' chalk around the snitch\nWe be shootin like free throws, flying them desert Eagles\nSell dope to the Po' while we eat chili Fritos\nFrom a gang banger to a CEO\nEverything I do is big like the nigga Ceaser-Leo\nWon't stop till I'm dead\nAin't gotta watch for the Feds\nThey ain't watchin me so here's a dome shot to the head\nAs I take a Patron shot to the head\nAnd reminise about the shit the D.O.C. said\n\"Get money, get cars, get mine, get yours\nAnd keep your head up, like the Lambo doors\"\n\n[Hook: The Game]\nWhere you from? (California)\nWhat city? (Compton)\nWhat you drive? (Impala)\nWhat you smokin' on? (Chronic)\nWhat you drinkin' on? (Patron)\nWhat you sittin' on? (The throne)\nRelax, make yourself at home\n\n[Traci Nelson]\nWelcome to Compton\nWelcome to Compton\nWelcome to Compton\nWelcome to Compton\n\n[Verse 3]\nGuess it's time to break the number 9 Jordan's in\nMake a nigga mad when they bend trying ta' floor the Benz\nI'm doin 160 in the fast lane\nScott Storch in his Bugatti couldn't pass Game\nI got it made like my last name\nI'm gone just like my Aftermath Chain\nDon't make me take you back to '96\nLeanin' on that Datsun on the corner eating catfish\nThe Game, da-da-da Game spit 'dat shit\nI'm controversial like the Afro pic with the black fist\nJust ask the rapper that had to catch my last diss\nI'm reckless and I ain't never crash whips\nMy pops wasn't around so this bastard\nBleed California from the cradle to the casket\nAnd I won't stop ridin' for my coast\nNiggas keep talkin 'bout my bread, we gonna make toast\n\n[Hook: The Game]\nWhere you from? (California)\nWhat city? (Compton)\nWhat you drive? (Impala)\nWhat you smokin' on? (Chronic)\nWhat you drinkin' on? (Patron)\nWhat you sittin' on? (The throne)\nRelax, make yourself at home\n\n[Traci Nelson]\nWelcome to Compton\nWelcome to Compton\nWelcome to Compton\nWelcome to Compton", "image": "https://images.genius.com/bba1920bee43a618432ce43748293ec6.1000x1000x1.jpg"}], "artist": "The Game"}