{"songs": [{"title": "The Melancholy Maze & My World Intro", "album": "Everready [The Religion]", "year": "2006-11-07", "lyrics": "[Intro]\nYou have entered The Melancholy Maze\nWe hope you find your way\n\n[Random Guy]\nI’m at the bank right now\n\nWhistling Jellysickle\n\n[Bank Teller and Krizz Kaliko]\nBT: Sixty, eighty, and one more makes a hundred\nKK: All righty, thanks\nBT: You have a great day\nKK: You too\n\n[Skit: Tech N9ne and Bank Teller]\nBT: Next in line, please\nT9: Yes\nBT: Sir\nT9: Yeah I would like to make a withdrawal\nBT: Okay. Hey, you’re Aaron Yates, I remember you\nT9: Yeah, yeah, that’s me baby, that’s me\nBT: So what are you doing now a days?\nT9: Uh, I’m a, I’m a rapper, yo- uh Strange Music, you heard of Strange Music\nBT: Yeah, Strange Music, where bull shit ain't nothing, I know\nT9: Yeah, yeah that’s it. Baby I w-\nBT: I remember you being in the lunchroom rapping, and you used to beat on your chest at the same time. I used to love that\nT9: Thank you baby, I l-\nBT: Would you do it for me?\nT9: Nah baby, I’m really trying to get a, I’m trying to, I’m really trying to-\nBT: Please\nT9: Okay check it, I got something for you, check it out\n\n[Verse: Tech N9ne]\nYo\nWhat up, sit up, get up wit us killas\nEnough niggas to crush ya luck and bust ya guts and liver\nHit with the Ruger and now ya livin' off in the river\nWatchin' this arsonist while a spark a bit\nOf my heart and bark I'ma start the shit (Sir, please)\nWelcome to the bottomless pit, animalistic\nI know it's hella dark in it\nMy world (Sir), is not like a regular life\nWe tote big guns instead of a knife (Hey, you can’t say that in here)\nHella grim night, the devil is in flight\nHe said a Beretta will get us whatever is in sight\nYou got a job, I ain't got one\nYou've got wad, I gotta shotgun\nYou gotta guard, I got squad\nYou here to work and I'm here to rob!", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}