{"songs": [{"title": "This Life I Lead", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Intro: 2Pac]\nIn this motherfucking life I lead, shit\nA hell of motherfucking road blocks\nAnd crooked cops\nWe still ride though\nWhat side? Westside\n\n[Verse 1: 2Pac]\nI want money in large amounts\nMy garage full of cars that bounce\nMovin' my tapes in major ways, ‘cause every dollar counts\nBusters is jealous and half these niggas is punks\nThey runnin' off at the mouth 'til I fill it up with my pump\nThey jump, my automatic keep 'em wary\nWhy you frontin' like you Billy Badass? Nigga, you scary\nI've been knowin' you for years\nWe was high school peers, in junior high\nI was itchin' to kill, and you was ready to die\nWhile you bullshittin', niggas was dyin' and catchin' cases\nBustin' my automatics at motherfuckers in foreign places\nLeavin' no trace, they see my face and they buried\nThem bitches die in a hurry, still I ride, I'm never worried\nMr. Makaveli tell me to ride, and I'ma ride\nPick my enemies out the crowd, and motherfuckers die\nIt's not the way I wanna live, my nigga, it's how it is\nHomie got into a fight last night that killed his kids\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers\n'Til we die, in this life I lead\n\n[Verse 2: Young Noble]\nI ain't a killer but don't push me, dawg\nFor the family I'll send that ass straight to God\nIn this life I lead, I seen the most of my 23 years\nWhen vision is blurry, the money is clear\nSome of my peers eternally will sleep in a coffin\nAnd when Nob' on the road, I'm extremely cautious\nIt happen that fast, split second you gone\nAt the top of my tombstone put \"Nob' was raw\"\nOutlaw 'til I'm under the floor, for Kadafi the Prince\nI stack dough like I clocked all the bricks\nWith a watch on my wrist, dawg, I know the time these days\nWe Outlawz, we gon' die this way nigga (nigga)\nWe already in the history books, 'Pac made sure of that\nWhatever you took, we takin' it back\nYou know it's all for the foundation\nOutlawz, we still buildin' the Thug Nation; holla at ya homie!\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers\n'Til we die, in this life I lead\n\n[Verse 3: Napoleon]\nIt ain't nothin' but in-between nuts, oxygen is gettin' hot\nGot a problem, old fag-ass nigga, kick rocks\n*Bin Laden* on the phone and that nigga talkin' crazy\nI don't know who to blame, him or *Bush* for killin' babies\nI'm a New Jerz' Devil, the street, creative rebel\nOnly got one shot to produce on every level\nThis is bags I must, go the max I must\nNigga, I came from not much, so money I clutch\nUh-uh, Napoleon the strength of the strong-arm\nWhen they think they was in the right\nI prove they movin' wrong\nI'm a hardcore product of the ghetto\nBeen blessed fo' sho' to eat from out the ghetto\nI maneuver, in the right lane, quick to push back brains\nSwitchin' to the left lane, I'm playin' my hands\nAnd I'm plottin' on the fortune, it's gettin' hot and scorchin'\nI'm diggin' like a scorpion that torture they enemies\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers\n'Til we die, in this life I lead\n\n[Verse 4: Kastro]\nNow with this Outlaw lifestyle that I been introduced to\nMoney and hoes keep us closer to Lucifer\nSteady seducin' us and now I'm all for it\nThis the life for me and the law can't spoil it\nSo you can call it what the fuck you want\nBut I'm a ballin' alcholic with a sawed-off pump\nMy momma ain't raised no punk; and neither did 'Pac\nSo when it jump off, I breathe for Yak'\nBeen puttin' in work, so I walk with a bop\nAnd it ain't safe at home, so I sleep with a Glock (no mistakes)\nThug livin', uhh, what the fuck'd be better?\nI do my dirt with the family so we dyin' together\n\n[Verse 5: E.D.I.]\nWe on a mission for mo', gangsta shit on you hoes\nWe ain't fuckin' with you most\nJust crooks and niggas about they flow\nTryin' to live Godzilla\nE.D.I. went from a Bad Boy to an anybody killer\nLook out, wanted man, guns in hand, stand firm\nNuts and my pride, now let's burn\nBound to the fam going down swingin'\nHolding my ground, now we the last ones breathin'\nWon't stop until we even deep in the trenches\nSo many killings it's senseless\nSo in this life I lead, I stay protected\nBy God, my squad, and this thing in my palm\nNow all my hustlin' motherfuckers, get your money, sing along\n\n[Hook: 2Pac]\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers 'til we die\nIn this life I lead, fiend for currency, get high off weed\nCollect G's, make my enemies bleed\nWhen you see me, nigga, holla my set!\nAnd watch 'em ride, Outlaw motherfuckers\n'Til we die, in this life I lead\n\n[Outro: 2Pac]\nThis motherfuckin' life I lead, nigga\nYou know what time it is\nWestside, Death Row\n(Dogg Pound) e'rybody killer\nBad Boy killer, So So Def killer\nThug Life, Death Row\nE'rybody killer; fuck all y'all niggas!\nIf it ain't Westside, nigga, it ain't poppin'\nThat's on my mama", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}