{"songs": [{"title": "Dedicate", "album": "Tha Carter V", "year": "2018-09-28", "lyrics": "[Intro: Lil Wayne & 2 Chainz]\nIf it wasn't for Wayne, it wouldn't be\nYou tatted your face\nBugatti, new boo\nYou screamed, \"Suu whoop\"\nYeah, yeah, yeah, yeah\nYou bought a Bugatti, so you can flex\nMost of the bad bitches your ex\n\n[Verse 1: Lil Wayne]\nTattoos, suu whoop, Bugatti, new boo\nNew subject, new paper, new class, new school\nNew buddies, new haters, new ass, new boobs\nMuch later, too soon, too bad, too cool\nToo hot, too lit, too high to move\nTwo eyes to view but too blind to bloom\nWho lied to you?\nTwo middle fingers that's up high to whom\nIt may consume, kaboom, goddamn\nWho knew that I am the guru with voodoo\nThat sued you to high hell\nWith shooters that shoot through the iron, man\nAnd see through the con man and now he a dyin' man\nI turned a goddamn into a God's Plan\nGo over the diagram and get to the job, man\nWatch for the spy cam\nSit back and watch and do not watch your watch hand\nGive me some time, man\nI am the bomb, man\nI am gon' swim 'til I come out on dry land or on the fryin' pan\nNo, we did not land on Plymouth Rock\nBut it landed on our land, now I'm just buyin' land\nBack to the block where they got more rock fans\nThan a fuckin' rock band under a rock, man\nWe need Barack, man, I do what I can\nTo keep it solid as a you know what I'm sayin'\nWith some rock playin'\n\n[Chorus: 2 Chainz & Lil Wayne]\nYou tatted your face and changed the culture (You changed)\nYou screamed, \"Suu whoop,\" and them gangsters loved you (Yeah, yeah)\nYou bought a Bugatti so you could flex (So you can flex)\nAnd most of the bad bitches your ex\n\n[Verse 2: Lil Wayne]\nI started this shit, you just part of this shit\nI'm the heart of this shit, and the heart doesn't skip\nTake the heart of yo' bitch, 'cause like Bart, you a simp\nAnd your water don't drip so your garden ain't shit\nYou just countin' the money, I'm drownin' in money\nLike, \"Where the fuck is the lifeguard in this bitch?\"\nI go Mars in this bitch, watch me orbit and shit\nFor the art of this shit, Andy Warhol and shit\nGo retarded as shit, you go sweet tangy\nI go tart on this shit, I'ma barf on this shit\nI'm a martian and shit, you an orphan, lil' bitch\nIf I taught you some shit, that's like Harvard, lil' bitch\nYou ain't talkin' 'bout shit but you softer than shit\nWalk it like you talk it, now you walkin' in shit\nI go Marvel movie on some marvelous shit\nIn the spotlight too long, should be darker than this\nThis is Tha Carter, lil' bitch\n\n[Chorus: 2 Chainz & Lil Wayne]\nYou tatted your face and changed the culture (You changed)\nYou screamed, \"Suu whoop,\" and them gangsters loved you (Yeah, yeah, yeah, yeah)\nYou bought a Bugatti so you could flex (So you can flex)\nAnd most of the bad bitches your ex\n\n[Verse 3: Lil Wayne]\nI started this shit, they borrowed this shit\nI thought of this shit, they thought it was it\nI'm doggin' this shit, they bark and they sit\nPut a fork in that shit, which drawer to look in?\nI brought in this shit, the starters get benched\nThe orders get sent, then targets get hit\nBillion dollar smile\nI sell myself short if I grin, I'm bargainin' then\nApartments and shit, I could park in this shit\nIn the foreign car that I could talk to and shit\nWith a cultural bitch I can talk to and shit\n'Bout the culture and shit, how I altered this shit\n\n[Refrain: Lil Wayne]\nTattoos, suu whoop, Bugatti, new boo\nTattoos, suu whoop, Bugatti, new boo\nTattoos, suu whoop, Bugatti, new boo\nAll of that shit, just tha Carter lil' bitch\n\n[Outro: Lil Wayne, 2 Chainz & Barack Obama]\nYou changed, suu whoop (You tatted your face)\nBugatti, new boo (You screamed, \"Suu whoop\")\nTattoos, suu whoop, Bugatti, new boo\nTattoos, suu whoop, Bugatti, new boo\nTunechi\n(If it wasn't for Wayne, it wouldn't be)\nThey might think they've got a pretty good jump shot, or a pretty good flow. But our kids can't all aspire to be LeBron or Lil Wayne!", "image": "https://images.genius.com/9e2d71d269b2971975d5d9ca36deb943.1000x1000x1.jpg"}], "artist": "Lil Wayne"}