{"songs": [{"title": "Papa’z Song", "album": "Strictly 4 My N.I.G.G.A.Z...", "year": "1993-02-16", "lyrics": "[Intro: 2Pac]\nDaddy's home...\n\nHeh, so??\nYou say that like that means somethin to me\nYou've been gone a mighty long motherfuckin time\nFor you to be comin home talkin that \"daddy's home\" shit (nigga)\nWe been gettin along fine just without you\nMe, my brother, and my mother\nSo if you don't mind, you can step the FUCK off, POPS.. FUCK YOU!\n\n[Verse 1: 2Pac]\nHad to play catch by myself, what a sorry sight\nA pitiful plight, so I pray for a starry night\nPlease send me a pops before puberty\nThe things I wouldn't do to see a piece of family unity\nMoms always work, I barely see her\nI'm startin to get worried without a pops I'll grow to be her\nIt's a wonder they don't understand kids today\nSo when I pray, I pray I'll never grow to be that way\nAnd I hope that he answers me\nI heard God don't like ugly well take a look at my family\nA different father every weekend\nBefore we get to meet him they break up before the week ends\nI'm gettin sick of all the friendships\nAs soon as we kick it he done split and the whole shit ends quick\nHow can I be a man if there's no role model?\nStrivin to save my soul I stay cold drinkin a forty bottle\nI'm so sorry...\n\n[Hook]\nI'm so sorry\nFor all this time (I'm so sorry)\nFor all this time\nFor all this time (don't lie)\nI'm so sorry\nFor all this time (so, sorry)\nFor all this time\nFor all this time, so sorry baby!\n\n[Verse 2: Wycked & 2Pac]\nMoms had to entertain many men;\nDidn't wanna do it but it's time to pay the rent again\nI'm gettin a bit older and I'm startin to be a bother;\nMoms can't stand me cause I'm lookin like my father\nShould I stay or run away? Tell me the answer\nMoms ignores me and avoids me like cancer\nGrow up rough and it's hard to understand stuff\nMoms was tough cause his papa wasn't man enough;\nCouldn't stand up to his own responsibilities\nInstead of takin care of me, he'd rather live lavishly\nThat's why I'll never be a father;\nUnless you got the time it's a crime; don't even bother\nThat's when I started hatin' the phony smiles\nSaid I was an only child\nLook at mama's lonely smile!\nIt's hard for a son to see his mother cry\nShe only loves you, but has to fuck with these other guys\nI'm so sorry...\n\n[Hook]\nI'm so sorry\nFor all this time (I'm so sorry)\nFor all this time\nFor all this time (don't lie)\nI'm so sorry\nFor all this time (so, sorry)\nFor all this time\nFor all this time, so sorry baby!\n\n[Verse 3: 2Pac]\nMan child in the promised land couldn't afford many heroes\nMoms was the only one there my pops was a no-show\nAnd ohh -I guess ya didn't know\nThat I would grow to be so strong\nLookin kinda pale, was it the ale or pops was wrong?\nWhere was the money that you said, you would send me\nTalked on the phone and you sounded so friendly\nAsk about school and my welfare\nBut it's clear, you ain't sincere hey who the hell cares\nYou think I'm blind but this time I see you comin, Jack!\nYou grabbed your coat, left us broke, now ain't no runnin back\nAsk about my moms like you loved her from the start\nLeft her in the dark, she fell apart from a broken heart\nSo don't even start with that \"Born to be a father\" shit\nDon't even bother with your dollars I don't need it\nI'll bury moms like you left me: all alone, G\nNow that I finally found you, stay the fuck away from me\nYou're so sorry\n\n[Hook]\nI'm so sorry\nFor all this time (I'm so sorry)\nFor all this time\nFor all this time (don't lie)\nI'm so sorry\nFor all this time (so, sorry)\nFor all this time\nFor all this time, so sorry baby!\n\n[Verse 4: 2Pac - impersonating his father]\nI never meant to leave but I was wanted\nCrossed too many people every house I'd touch was haunted\nHad to watch the strangers every brother was a danger;\nIf I wanted to to keep you breathin, had to be out of range-a\nHad to move on, done lost my name and picked a number\nMade me watch my back I had no happy home to run to\nMaybe it's my fault for being a father livin fast\nBut livin slow, mean half the dough, and you won't get no ass\nHindsight shows me it was wrong all along\nI wanted to make some dough so you would grow to be so strong\nIt took a little longer than I thought\nI slipped, got caught, and sent to jail by the courts\nNow I'm doin time and I wish you'd understand\nAll I ever wanted was for you to be a man\nAnd grow to be the titan you was meant to be\nKeep the war fightin by the writings that you sent to me\nI'm so sorry...\n\n[Hook]\nI'm so sorry\nFor all this time (I'm so sorry)\nFor all this time\nFor all this time (don't lie)\nI'm so sorry\nFor all this time (so, sorry)\nFor all this time\nFor all this time, so sorry baby!", "image": "https://images.genius.com/6283d2f15ac23d741d92f0f0e70d5941.600x602x1.jpg"}], "artist": "2Pac"}