{"songs": [{"title": "Why U Turn On Me", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: 2Pac]\n(Ol' switcheroo-ass, bitch made motherfuckers, just be friends)\nOutlaw nigga, Westside, throw it up\nHahaha.. had love for 'em, but why you turnin' on me?\nWhy me? Westside, how you do it boy?\n\n[Verse 1: 2Pac]\nI went from, nothin' to somethin' now they all wanna see me fallin'\nAnd the player haters hate to see a thug nigga ballin'\nThey say we hate the East coast, but that's funny\nGot a lot of love for, any nigga gettin' money\nI made a song about my enemies and niggas tripped\nIt was hip-hop until 2Pac fucked Biggie bitch\nY'all niggas hypocrites and bitch made\nNow either love me or hate me but real thug niggas get paid\nHave me catchin' cases all across the nation\nI went from jail to bail to barely on probation\nThey got a player facin' three strikes\nAnd we might, just blast God bless the child, that can get cash\nBut all these niggas turnin' and never learn\nGot a long line of niggas player hatin' me but gettin' burned\nTalk a lot of shit but you's a trick in drag\nLike the MAC make you fall back and stick yo' ass for back stab\n\n[Hook: Singers & 2Pac]\nWhy you wanna turn on me?\nNever thought you would backstab me (Why y'all turnin' on me?)\nWhen you niggas see me you flee (Why me?)\nCause I'm a T-H with the U-G.. (Why me?)\nWhy you wanna turn on me?\nNever thought you would backstab me\nWhen you niggas see me you flee (yeah nigga)\nCause I'm a T-H with the U-G\n\n[Verse 2: 2Pac]\nIt, started so innocent, but ended in the fifth precinct\nAlthough two juvenile delinquents, we still decent\nPlayin' catch and kiss, used to diss the herbs\nFuck school we was skippin' drink a fifth on the curb\nMe and you, no closer two, while drinkin' brew\nWhat you need nigga? Anything at all come to me nigga\nYou can wear my clothes and my gold for the hoes\nGave you the keys to the jeep, offered my home as an open door\nBut then you picked a new direction, in the blink of an eye\nMy time away just made perfection, did you think I'd die?\nI never got a single visit yet I carry on\nAll my old friends too busy now my money gone\nSaid I got raped in jail, picture that? {​*laughter*}​\nRevenge is a payback bitch, get your gat\nFuck {​Wendy Williams}​ and I pray you choke\nOn the next dick down your throat\nFor turnin' on me\n\n[Hook: Singers & 2Pac]\nWhy you wanna turn on me?\nNever thought you would backstab me (Why y'all turnin' on me?)\nWhen you niggas see me you flee (Why me?)\nCause I'm a T-H with the U-G.. (Why me?)\nWhy you wanna turn on me?\nNever thought you would backstab me\nWhen you niggas see me you flee\nCause I'm a T-H with the U-G\n\n[Ad-libs: 2Pac]\nI put Jenny Craig on your fat ass, you fat troll\nAnybody ever seen {​Wendy Williams}​ fat ass?\nWhy you always wearin' Spandex you fat bitch?\nI know your pussy stinks, you fat ho\nI'm puttin' Jenny Craig on you bitch\nI'm about to put a twenty-thousand dollar, hit\nThrough Jenny Craig to come find yo' ass\nAnd put you in a fat farm, you fat bitch!\nThug Life, Outlaw, Westside bitch\nIt's 2Pac so you know who said it\nAnd for everybody who didn't like what I said about that other trick\nAnd Mobb Deep, fuck you too nigga!\nIf a nigga didn't want to get talked about\nHe shouldn'ta stepped in the fuckin' ring\nIf Tyson don't want to get knocked out\nHe don't step in the fuckin' ring, that's how the shit go\nWhen Tyson get in the ring, he knock motherfuckers out!\nWell that's what 2Pac gon' do\nWhen niggas come against me, I'ma knock they punk ass out!\nOne way or the motherfuckin' other\nThis old motherfuckin' nigga in the South told me nigga\nIt's more than one way to skin a cat\nIt's more than one way to shoot a gat\nIt's more than one way to die nigga\nWhen I'm through, everybody cry nigga\nThis is how we do it\n\n[Hook: Singers & 2Pac]\nWhy you wanna turn on me?\nNever thought you would backstab me (Why y'all turnin' on me?)\nWhen you niggas see me you flee (Why me?)\nCause I'm a T-H with the U-G..\nWhy you wanna turn on me?\nNever thought you would backstab me\nWhen you niggas see me you flee\nCause I'm a T-H with the U-G\n(Fuck you too nigga!)", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}