{"songs": [{"title": "We Came To Party", "album": "Authentic", "year": "2013-03-18", "lyrics": "[Intro]\nI just wanna make sweet love to you, baby, you know what I’m saying?\nI just wanna touch you all over… aw, please!\n\n[Hook: Fatman Scoop & LL Cool J]\nWe came to party, we came to party\nWe came to party, we came to party\nWe came to party, we came to party\nHey look, I've got my hands all on your body\n\n[Verse 1: LL Cool J]\nAin’t no problem, I’m on it – oldest man in the club\nAlso one of the richest, a hundred bottles of bub\nIt’s just me and the Russians, we get all of the love\nThey was aware of the image, they wanna see what he does\nTMZ in my face, Oprah all on my couch\nNow I’m hosting the Grammys, what is this all about?\nInternational baller, I must admit I had doubts\nIf they wasn’t callin’ me back, they was callin’ me out\nGame moved to the South, I just closed my mouth\nIntellect like Belichick when he be switching the routes\nI’m too old for the games, no time for the lames\nNext challenge? Get this generation screaming my name\nWho could do what I did? Boy, I must be the shit\nWaved 106 & Park to play date with the kids\nPeople texting my wife, tryna ruin my night\nSo I help ‘em mind they business with some bottles on ice\n\n[Hook x2]\n\n[Bridge x8]\nDestruction in the club\n\n[Verse 2: Snoop Dogg]\nOh, no… Big Snoop Dogg\nIce so cold you can see it through the fog\nTo walk in my shoes it’ll be a little jog\nAnd if you step by the pockets, you gon’ be up in the morgue\nThe peoples is peepin’, peepin’\nThe bitches is dippin’, dippin’\nSo this is the mission, listen, I turn this shit up\nIt’s the party-rocking, nonstopping, four-hopping, rip and rock\nDrippin’ in this motherfucker, burn up, now turn up!\n\n[Verse 3: LL Cool J]\nWe ain’t flirtin’, we talkin’ – we ain’t dancin’, we walkin’\nTeenagers is pointin’, couple cougars are hawkin’\nI don’t come here that often, but it’s totally awesome\nWhen you livin’ for real, I don’t consider it flossin’\nPanty lines are crossin’, I’m proceedin’ with caution\nI don’t shit where I eat, gotta manage your portions\nLL Cool J, I’m like the old-school orphan\nRepresenting alone, sittin’ on factory chrome\nShades on, in the zone – Kool Aid smile on my face\nMy security’s strapped, ain’t no beef, just in case\nMe and my man Rich Whites, we in Vegas tonight\nClaudine on the celly, make sure that money is right\nRed carpet and tuxes, always where the bucks is\nPaparazzi are snapping, I can’t believe this is happening\nFrustrating the haters, they’re so sick of me rapping\nI’m enjoying your blog, I’ve got the same type of passion\n\n[Hook x2]\n\n[Bridge x4: Fatman Scoop & LL Cool J]\nFatman Scoop, Maserati Cool J\nThey ain’t think I can do it, that’s why I had to debut it\nAnd let the critics review it, that way I spit and it’s Buicks\nSince the beginning, I knew it – rollin’ an L in the Buick\nHad the guts to pursue it, that’s how a legend should do it\n\n[Hook x2]", "image": "https://images.genius.com/c0c7dbb9fd10ac4887ec94389a4d0712.1000x1000x1.jpg"}], "artist": "LL Cool J"}