{"songs": [{"title": "Wrong or Right (I’m Tired)", "album": "Year of the Dog... Again", "year": "2006-08-01", "lyrics": "[Bzr] AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!\n[DMX] Uhh, yeah\n[Bzr] DMX\n[DMX] Uh-huh (uh-huh) uhh\n[Bzr] Bzr Royale - yeah, yeah, YEAH!\n[Bzr] OOOOOOOOOH! .. YEAH!!!\n\n[Hook: DMX]\nI'm tired of answering for shit in MY LIFE\nIt doesn't matter if it's wrong or right\nTired of answering for shit that I DO\nEnough about me, MAN WHAT THE FUCK ABOUT YOU?!\n\n[Bzr Royale]\nDreamin, starvin, drinkin, smokin\nWishin, hopin, infra scopin\nHater prayin for the day man\nWhat I'm sayin's hard not playin\nFeel the world is Aquaman\nSay them things for days it's rainin\nAnd it's always rainin, and it's always some'n\nI'ma keep on comin, I'mma keep on comin\nSo butterflies can't reach my stomach\nTo get my heartbeat jumpin and my blood flow pumpin\nSo my life means some'n and it ain't no frontin\nFor the respect you get for the work in the climbin\nFor the ways that's beside me and the niggas that don't like me\nGot a pistol and my iron if you wanna get to firin\nWe can all keep the violence, we can all get the iron\nIt's all about the timin if you wanna get the hype in - early!\n\n[Hook]\n\n[DMX]\nTop, dog, cat's don't, know (WHAT!)\nCan't fuck with the flow from Y.O. (WHAT!)\nRidin too much dick, say it ain't so (YEA!)\nI'm about to let the dog blow, YO!\nGet the fuck out the way or get bit (C'MON!)\nI ain't with the industry bullshit (UHH)\nCause this is what you'll get (UHH)\nStomped the fuck out or, shut the fuck up and (WHAT!)\nPut cats down never, got the fuck up and (WHAT!)\nWhat the fuck's up bitch, I'm tired of talkin\nI'm about to let my finger do the walkin (O-KAY!)\nBefore we outlined in, chalk in the middle of the street\nJust start to feelin a little bit of heat (C'MON!)\nDon't let the steel in the street that you know go to your head\nFuck around you gon' wake up, DEAD (aight?)\nI ain't playin wit'chu bitches, I got 20 years in it\nBut I realize, it only takes a minute, to end it\n\n[Hook]\n\n[Bzr Royale]\nIt's Bzr Royale, come do it live\nMama say, mama sah, mama macusa!\nWe in {?} probably they know why\nNot tryin to be funny; my time is money\nSee - OFTEN runnin we out the gate\nMy - HORSE is gunnin, we winnin this race\nIt's Bloodline (niggas) it's no time (nigga)\nFor bitch ass (niggas) to fool my (niggas)\nDrinkin daily, old ceiling leakin\nMen seem tense still smokin, drinkin\nHammers ready for them billings\nTryna creep up in my building\nDrunk ass bitches, what's the matter with your mind?\nLearn how to live or you learn how to die\nKill a killa, be a killa, that's what's REALLY HOOD\nThat's what's REALLY GOOD, wish a NIGGA WOULD\n\n[Hook]\n\n[Bzr Royale - over Hook]\nYEAH! YEAH! YEAH! YEAH! YEAH!\nAHHHHHHHHHHHHHHHHHHHHHHHHHHHH-HOOOO!!\nYEAH! YEAH! YEAH! YEAH! YEAH!", "image": "https://images.genius.com/3843bd8bdb5f681116b197d8a9226af4.300x300x1.jpg"}], "artist": "DMX"}