{"songs": [{"title": "A Nigga Witta Gun", "album": "The Chronic", "year": "1992-12-15", "lyrics": "[Skit: Dr. Dre + Man]\n(\"Fuck wit Dre Day\" Plays in Background)\nYeah, nigga! What's up with all that motherfucking shit you was talking, nigga?\nHey Dre, why you tripping, why you tripping?\nFuck that! What was up with all that shit you was talking, nigga?\nI ain't say nothing, why you trip me?\nThat's a motherfucking lie, nigga! That was you!\nNah, that wasn't me!\nThat was you, nigga!\nThat wasn't me!\nHey, check this out, motherfucker!\nWhat's wrong, nigga?\nThat wasn't me!\nYou can't talk with a gun in your mouth?\nNah, man, that wasn't me, dog!\nYou can't talk with a gun in your mouth?\nThat wasn't me!\nListen up, nigga! You know Lucifer?\nNah!\nWell, you're about to meet him, motherfucker!\n\n[Hook: Snoop Dogg + The Kay-Gees]\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\n\n[Verse 1: Dr. Dre]\n44 reasons come to mind\nWhy a motherfucking brother is hard to find\nHe be walking on the streets and fucking with mine\nStupid punk can't fuck with a mastermind\nSee I never take a step on a Compton block\nOr L.A. without the AK ready to pop\nCause them punk motherfuckers in black and white\nAin't the only motherfuckers I gots to fight\nI think it's better to be telling the facts than cuffed up\nAnd jacked and fucked up\nWhat you niggas looking at? You going\n\"Goddamn!\" Cause it's the city\nAnd for you to survive a nigga gotta be a gangsta\nAnd I'm a nigga you can't remove\nTook out a lot of motherfuckers for tryin' to prove\nTo their homies that they can hang by dealin' with me\nBut once again in the end they D-E-A-D\nI never did time on a murder yet\nCause I relax, sit back, do a job and jet\nYo, I know you understand my flow\nSo here we go with Death Row\nCome let a mothafucka know\n\n[Hook: Snoop Dogg + The Kay-Gees]\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\n\n[Verse 2: Dr. Dre]\nD-R-E\nA motherfucker who's known for carrying gats\nAnd kick raps that make snaps\nAdapts to any environment that I'm located at\nIf you see me on the solo move believe that I'm strapped\n4-4, .tre-8 or AK-47\nCause slowly but surely send you on a stairway to heaven\nJust put my finger on the trigger and pull back\nAnd lay a punk mothafucka flat\nAs he wonder what popped before he got popped\nI told you I was Dre and you know it don't stop\nNow I know you understand my flow\nSo here we go with Death Row\nCome let a motherfucker know\n\n[Hook: Snoop Dogg + The Kay-Gees]\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\n\n[Bridge: Dr. Dre]\nI breaks 'em off, I breaks 'em off, yeah\nI breaks 'em off, I breaks 'em off, yeah\n\n[Verse 3: Dr. Dre]\nI breaks 'em off, but I ain't speaking about between the thighs\nI'm talking about cocking a gauge in between your eyes\nIt'll make you drop to your knees cause you realize\nThat a gat'll make any nigga civilized\nOld buster ass nigga talking bullshit\nDon't know that I'm the wrong nigga to fuck with\nGet lit or hit up by the doctor:\nA nigga that breaks 'em off properly!\nReal G so don't doubt it\nI'm the one who's doin' it while these other niggas talk about it\nAnd if motherfuckers come at me wrong\nI straight put my .44 Desert Eagle to his mothafuckin' dome\nAnd show him why they call me the notorious one\nThe name's Dre Eastwood when I'm packing a gun\nYou don't believe me, well step up and give it a try\nAnd if you die, you's a buster cause real niggas don't die\nBut some still don't hear me though\nYou're too near me not to hear me, nigga yo\nSo now you know\n\n[Hook]\nWho's the man with the masterplan?\nA nigga with a motherfucking gun\nWho's the man with the masterplan?\nA nigga with a motherfucking gun", "image": "https://images.genius.com/f069b7a57cd614d79e5dba8ee92f08f8.944x937x1.jpg"}], "artist": "Dr. Dre"}