{"songs": [{"title": "Dear Fall", "album": "Fahrenheit 1/15 Part II: Revenge of the Nerds", "year": null, "lyrics": "[Intro]\nYessir!\nWhat up Shinobi? Suzie, what up?\nAs-salaam aleikum, uh, yeah\nWhat up Chi-Town? What up, Westside?\nWhat up, everywhere else in the world?\nHaha! President Carter, what up?\n\n[Verse]\nDear Fall! You might not know what my album is called\nIt's \"Lupe Fiasco's Food & Liquor\"\nGod willing, September is when I plan to fall\nI mean drop like the temperature\nThen rock on right through the winter\nPut something on they mind, give em lines to remember\nAw! a lifetime remembered, which is mine\nThen recorded, put it in Georges then rewind then look into\nMy mis-adventures, adventures into the Underworld\nHanging with them Cover Girls, this ain't my enter, nawww\nOn Arista, I coulda been a contender\nBut BMG had a different agenda\nWhat up, LA Reid? I still see ya\nYou still my homeboy, won't even charge ya for a feature\nI went from MC to being MS\nThat's \"microphone controller\" to \"motivational Speaker\"\nNiggas, astaghfirullah, I'm not a prophet\nBut Fahrenheit 1/15 is being quoted by preachers\nFar from being a leader\nBut I'm still being invited by teachers\nWith no Hennessy, and no reefer\nGive him a hand, I came from hand-me-down sneakers\nAnd I don't wanna boast or brag\nBut for what most niggas hope, a nigga done had\nChop game with my folk and split it in half\nYou ain't gotta bring it back tomorrow, a nigga can have\nRich or broke, a nigga ain't mad\nSelf-esteem will make a Regal ride like a Silver Seraph\nJust wipe the french fries off the seat\nLean back, and I tilt my hat, uh!\nAnd nod my head to the baseline\nFreebase to the 8 times at Baseline watching Jay put it together\nI wonder if he knew\nWhile he was mumbling that this would push Lupe forever\nTogether, with the FNF crew\nAtlantic on post, proudly present to you, uh!\nSome new,something fresh, something different\nA lil to the left, a lil upliftin'\nA lil good game, a lil hustlin' in it\nSome SB Nikes, some nice crushed linen\nDon't forget the skateboard, of course, the nice women\nCan I get a mic check? And a lil light dimming?\nAnd a fresh bottle of Voss, maybe with some light lemon?\nAnd you gotta blame my momma for the lil light-skinning\nAnd this ain't written, I swear, Autumn\nI was just recording 'em as I thought em\nA YG, FNF U-P\n23-year-old VP\nWith a flow like Laudanum, that'll getcha sleepy\nBut soon as they nod off, that's when I smelling-salt 'em\nWhat up, Madison Street?\nHow they gonna keep us off them? PEACE", "image": "https://images.rapgenius.com/41f24d5c2c4bf23a7b809c579d5658fa.800x800x1.jpg"}], "artist": "Lupe Fiasco"}