{"songs": [{"title": "Party & Bullshit", "album": "Rush Hour 2 - Soundtrack ", "year": null, "lyrics": "(Funky! Stand off..)\n\n[Method Man]\nOh shit, 3-2-1, blown to bits\nStep inside the nightclub like I own the bitch\nSouthpaw two left feet set to trip\nOn that bullshit, back it up with extra clip\nMan listen, pissin in the same pot I'm pissin\nYou're goin down, get in that plane crash position\nTurbulence ahead, boy you must be sick in the head\nGo get Excederin, or get intelligent\nRecognize a veteran, player stay wetter than\nThe thug type, up mo' late nights than Letterman\nAsk Teddy, Wreckx-n-Effect I'm ready\nThe same way I was in that bar scene in \"Belly\"\n(Say what?) I freak the flow that let you know I'm a flower\nYo' ass is grass and I'm a lawn mower\nSo uhh, go ahead pass the doja\nIt's the return of Tical, party over\n\n[Hook: Meth & T.R.]\nY'all niggas wanna get down? (fuck with me)\nY'all still wanna be round? (fuck with me)\nY'all really want the street now? (fuck with me)\nY'all niggas gon' see now (party and bullshit)\nY'all niggas wanna get down? (fuck with me)\nY'all still wanna be round? (fuck with me)\nY'all really want the streets now? (fuck with me)\nY'all niggas gon' see now (fuck with..)\n\n[T.R.]\nYou chicks, bounce to the music\nShake that ass like you bout to use it\nWanna fuck with a baller? You choose\nWanna fuck with a scrub? You lose\nFuck that, let's keep it movin\nTalk about how this beat got you groovin\nNod your head, make you shake your dreads\nBass travel down the spine, get stuck in your legs\nDance 'til you rip the soles off your Timbs\nShit - knock the chrome straight off your rims\nHit - after hit, well get who you wanna get\nAin't nobody really fuckin with us\nHaters try to tell me I'mma suffer for this\nHatin on me cause I mastered this\nYou asked for this, come here and get a glass of this\n.. party and bullshit\n\n[Hook: T.R.]\nY'all niggas wanna get down? (fuck with me)\nY'all still wanna be round? (fuck with me)\nY'all really want the street now? (fuck with me)\nY'all niggas gon' see now (party and bullshit)\nY'all niggas wanna get down? (fuck with me)\nY'all still wanna be round? (fuck with me)\nYou really want the street now? (fuck with me)\nY'all niggas gonna see now (party and bullshit)\n\n[Method Man]\nYo, the whole base of this is party and bullshit\nY'all lil' cats, we ain't on no cool shit\nY'all lil' dogs better learn some new tricks\nAnd you video directors better find some new chicks\nWatch this, man I got this, Hot Nikks\nMean gob spit when I talk wear galoshes\nWu-Tang Clan in the house and ain't leavin\nHow my Killer Bee clique feel this evening?\nMeth; guerilla serial killer for scrilla\nSee the God run through your block like Godzilla\nMenage-a-tois for these french vanillas, I'm iller\nHard as armadillo and coat made of chinchilla\nNew stuff, bang this, bust this, bruise this\nAnd ballers ain't fuckin with Staten Isle, New York\nWhat? Still in the game, platinum plus\nY'all might fuck with them, but y'all can't fuck with us\n\n[Hook: Meth & T.R.]\nY'all niggas wanna get down? (fuck with me)\nY'all still wanna be round? (fuck with me)\nY'all really want the street now? (fuck with me)\nY'all niggas gon' see now (party and bullshit)\nY'all niggas wanna get down? (fuck with me)\nY'all still wanna be round? (fuck with me)\nY'all really want the streets now? (fuck with me)\nY'all niggas gon' see now..\n\n[Meth] Yo T.R., what's that shit you on?\n(party and bullshit)\n[T.R.] I'm not even serious, I'm doin this for fun, cause I\n(party and bullshit)\n[Meth] Yo T.R., what's that shit you on?\n(party and bullshit)\n[T.R.] I'm not even serious, I'm doin this for fun, cause I\n(party and bullshit)\n[Meth] Yo T.R., what's that shit you on?\n(party and bullshit)\n[T.R.] I'm not even serious, I'm doin this for fun, cause I\n(party and bullshit)\n[Meth] Yo T.R., what's that shit you on?\n(party and bullshit)\n[T.R.] I'm not even serious, I'm doin this for fun, cause I\n(party and bullshit) - what?", "image": "https://images.genius.com/89aac007f78355bd982485c91bb0fdd8.1000x1000x1.jpg"}], "artist": "Method Man"}