{"songs": [{"title": "Shooter", "album": "Trap God", "year": "2012-10-17", "lyrics": "[Chorus: Gucci Mane]\nIts some shooters in this house, its some shooters in this house\nThis a whole bunch, a whole bunch of shooters in this house\nIts some shooters in this house, its some shooters in this house\nIf you wanna go to war, fuck it, nigga let's shoot it out\n\n[Verse 1: Young Scooter]\nWalk up from my spot, sit down, have a seat\nI just been in 5 shoot outs last week\nHe bought the run division, plus he moving in the kitchen\nNobody make a move, nigga, when Scooter handling business\nReaching in his pocket, Gucci slap him with the pistol-\n\n[Bridge: Gucci Mane]\nGet your bitch ass down nigga, motherfucking move nigga\nHood rich!\n\n[Verse 2: Gucci Mane]\nBrick strapped to your sister I'm a send her in a rental\nI don't give a damn about her, but I'll make millions with the tender\nI got money in the fender, tryna buy my kids Christmas\nMe and Scooter ain't twins, but we got twin choppers\nGot Waka Flocka Flame, a nigga hit em with the yapa\nI'm a street nigga, never be a partner to a copper (No)\n\n[Verse 3: Young Scooter & Gucci Mane]\nWhat the fuck going on nigga?\nWho the fuck let these police ass nigga in here?\nI don't know\nFuck out the spot nigga\nSnitching ass niggas got caught with a brick\nSame day call my phone for a thirty-six\nI can see with one eye open like Slick Rick\nFuck the police that's why I rap about them bricks (Me too)\n\n[Verse 4: Gucci Mane]\nI ain't Diddy nigga, but these bricks get remixed\nWhen the chopper start spitting, nigga head 'gon get split\nNigga robbed me at the carwash, that was 1996\nEver since the day, them niggas ain't tried me since\n\n[Bridge 2: Young Scooter & Gucci Mane]\nGod damn, bruh\nTalkin' 'bout a nigga robbed you in '96\nNo, you geeked up, boy\nHe did\nYou still gotta pay though\nI know\n\n[Verse 5: Young Scooter]\nNigga owed me a brick, that was three years ago\nSeen him in the club, nigga, shot him in the throat\nBlack amigo Scooter still rob 'migos\nAnd I still got a lot of shooters on the payroll\n\n[Bridge 3: Gucci Mane & Bankroll Fresh]\nHold up Scooter\nI got shooters\nYou got a shooters\nAye man what?\nGet the door man that's Fresh man, you don't see him on the camera?\nI need 'em bruh\nYea, let 'em in\nAye, open the door nigga\n\n[Verse 6: Bankroll Fresh]\nI need 50 of them pretty mids, this nigga at the store\nHe waiting right now, Gucci is it a go?\nI hope it is, 'cause if it is, my shooters, they on go\nShooter on the Scooter, bring them bows\nHe want them right now, he just came from way up the road\nTen millimeter with thirty shots, make your fuckin' head explode\n\n[Verse 7: Gucci Mane]\nI got a trap house mansion with some hard wood floors\nCan't come in, I got burglar bar doors\nTrap going crazy, but I got it under control\nI just bust 'em open, fix 'em up, and move 'em out the door\nWho this nigga in this Buick, man get Scooter on the phone\nI'm like a NBA coach 'cause I keep shooters at my home\n\n[Verse 8: Young Scooter]\nAll I know I never seen his face in my life\nStreet smart so I know this nigga ain't right\nPull up at my spot, cut your car off hit your lights\nBefore you hit the door, you get robbed on sight\n\n[Chorus: Gucci Mane]\nIts some shooters in this house, its some shooters in this house\nThis a whole bunch, a whole bunch of shooters in this house\nIts some shooters in this house, its some shooters in this house\nIf you wanna go to war, fuck it, nigga let's shoot it out\nIts some shooters in this house, its some shooters in this house\nThis a whole bunch, a whole bunch of shooters in this house\nIts some shooters in this house, its some shooters in this house\nIf you wanna go to war, fuck it, nigga let's shoot it out", "image": "https://images.genius.com/7b2696a5097a1919c042aeac63dd9d8b.500x500x1.jpg"}], "artist": "Gucci Mane"}