{"songs": [{"title": "Oodles O’ Noodles Babies", "album": "Championships", "year": "2018-11-22", "lyrics": "[Intro]\nThis shit right here for my Oodles o' Noodles babies\nHis ma’ smoked the crack while she was pregnant so he can't even help that he crazy\nHe goin' to jail, it’s inevitable, forreal\n\n[Verse 1]\nI ain't have nobody to give me no hope\nI hope my momma ain't doin' no coke\nI used to wish that my daddy was livin'\nI had a dream that I seen him as ghost\nI used to act up when I went to school\nThought it was cool, but I really was hurt\nWanted my family to come to my games\nMy mama couldn't make it 'cause she was at work\nLived with my grandma, she took me to church\nReally no I ain't wanna go\nRemember I kissed my aunt in the casket\nAnd her forehead was cold\nI was like 4 years old\nWe couldn’t afford no clothes\nIt was hand me down\nWho would think a nigga get a Grammy now?\nGot a black judge tryna tear me down\nAll this jail time probably wear me down\nTurn the lights off in the bathroom\nScreaming, \"Bloody, Bloody, Bloody Mary\" now\nHavin’ nightmares about Candyman\nWith the tool on me like a handyman\nKilled my lil' cousin, I’m like, \"Damn it, man\"\nHad to see the footage on a camera, man\nOn the pavement, with his brains out\nWith the white sheet, he was laid out\nWanna ask 'Ye, \"Is this a choice?\"\nIt was like this when I came out\nWhat the fuck is you really complaining 'bout?\nI know niggas that's never gon’ make it out\nThis that shit you won't see in the media\nPoor get poorer and the rich gettin' greedier\nLot of daddies goin' back and forth out of jail\nLot of sons growin' up and repeating them\nThis the belly of the beast, you won't make it out\nMan, this shit was designed just to eat us up\nAnd my momma told, \"Nigga, keep it up\nYou gon' end up in prison, just sweepin' up\"\nRemember, nobody never believed in us\nWhen they see us now, they can't believe it's us, no\n\n[Interlude]\nI think it's funny how\nWe used to go to school, play SEGA's\nAnd then, next thing you know, you runnin' 'round with Glock .40s\nWe ain't never believed in the police, they was shootin' us\n\n[Verse 2]\nYeah, they called it the projects, they put us in projects\nWhat they gon' do with us? Can't call the cops yet\nYou might just get popped at\n'Cause they the ones shootin' us\nI'm on my mom's steps, it's like a bomb threat\nThe violence pursuing us, I ain't meet God yet\n'Cause I'm on the block where\nIt's just me and Lucifer, look what they do to us\nThey know we in poverty\nWhen I went to court, the judge said, \"Meek, you a menace to society\"\nHuh, you said, you would give me a chance, your honor, why would you lie to me?\n16 more years of probation, you know you gon' get some more time on me, huh\nWhole hood goin' crazy, babies havin' babies\nShe was fourteen, actin' like she eighty\nGot pregnant by a nigga that was locked up in them cages\nAnd the story goes on, if you make it, you amazing (Word up)\n\n[Outro]\nSee, I got homie that's a billionaire\nAnd I be tryin' to explain it to him like\nIf your mom ain't on crack or if she got a job and she doing eight hours a day\nAnd your daddy in the graveyard or in the jail cell, who the fuck gon' babysit?", "image": "https://images.genius.com/74622f434a6e852420ea522d6aae36f1.1000x1000x1.jpg"}], "artist": "Meek Mill"}