{"songs": [{"title": "Say Say", "album": "Adrenaline Rush 2007", "year": null, "lyrics": "[Intro: Jazze Pha]\nWhooooo!\nLadies and gentlemen you are now tuned in to the very best\nOne of the most delightful of all times (sho' nuff!)\nJazze Phizzle (Phizzle) Cee-Lo Green (Sugar Lo)\nTwista, it gets no better baby!\n\n[Hook 2X: Big Zak]\nHeyyyyy, you a trapper's delight\nYou're an actor's delight, you a rapper's delight\nHeyyyyy, say, I got to have you mama\nSay say what's happenin mama, say say say what's happenin mama\n\n[Twista]\nYour boy Twista, rapper's delight\nShe made me wanna take it back, I'mma do it like this\n\nHey hey, you a rapper's delight with the thick luxurious thighs\nI been after your ass since I been bumpin Grandmaster Flash and Furious 5\nWhen I was bumpin Melly Mel before I was makin hella mail\nSportin Pelle Pelle you was thick as hell\nAll my homies in the industry'll love you\nWhen it come to suckin dick you lookin like you lick it well\nWith a old school fatty, make a nigga wanna take it back\nWhen you let me hit it from the back\nWhen you come in the room and take it off\nI'mma have to break it off to an old school track\nWhen I'm lookin at the way you be shakin your rump\nBe makin me wanna come fuck you, no fakin the funk\nAnd when your lil' gangsta bitch mode take place\nMake a nigga wanna bump the first face take\nIt's like a jungle sometimes that make me wonder\nHow I keep from goin under and I wanna be your lover\nBut I gotta wear a rubber\nThough the booty's so soft when she tell me take it off I say huh huh huh\nTwista rollin with trappers tonight, you got the type of body actors'll like\nWith a ass so fat and titties so big, shit girl you a rapper's delight\n\n[Hook]\n\n[Jazze Pha]\nWhat's up? (What's up?) What's happenin? (What's happenin?)\nGirl I got two ticket let's do some travellin (travellin)\nWe'll leave from the A-Town\nAnd when we touch down - ooh girl\nAir is startin to feel a little breezier\nOn second thought maybe you should just bring your fur - word\nYo' looks, you fly, my swag, me too\nMy style, stay fresh, yo' bag, too cute\nAre those new boots? Well these are, just swipe them on my Visa\nLet's stop through Vegas, spin the wheel at the Palace of young Caesar\nIf the plane make your head hurt, here's an aspirin\nWe on the ski lifts off in Aspen, so what's up, what's happenin?\n\n[Hook]\n\n[Cee-Lo]\nSo what do you do besides stand around and look pretty, hmm?\nOr do you get paid to do that? Ah-ha, see, I knew that\nI bet Diddy'll think you're pretty, and Mekhi Phifer gon' like you\nLeave her alone LeBron, and oh be careful Tyson'll bite ya\nWow, just like my new place, ooh I'm going to decorate you\nAnd I'mma be honest, most of the women there are going to hate you\nBut what can you say boo, you all in they way boo\nBrazilian wax and a facial, that's a busy day boo\nI mean may take exact fate, everybody okay you\nAnd it's your reality, I'll get MTV to pay you\nOh what a fabulous life, all in one fabulous night\nHouse up on +Sugar Hill+, you're a \"Rapper's Delight\"\n\n[Hook]", "image": "https://images.genius.com/37a0e3023180b834b869e6ad5b51b224.500x500x1.jpg"}], "artist": "Twista"}