{"songs": [{"title": "Not Going Back", "album": "EP", "year": "2011-03-08", "lyrics": "[Chorus: Childish Gambino]\nIt seems like they all want me to fail\nBut I’m not going back\nNot going back, baby\nPlease tell me you don’t want me to fail\n‘Cause I’m not going back\nNot going back\n\n[Verse 1: Childish Gambino]\nI could've been a tragedy\nThat’s why these fake niggas who call me pussy are mad at me\n‘Cause they ain’t have the smarts or the heart\nAin’t you read the fucking book Things Fall Apart?\nI was never gonna stay the same\nAll I ever really wanted was to change the game\nSpent the year kicking ass and taking names\nTry to tell it to your heart, Taylor Dayne\nMama told me I was special when them test scores came in\nCalling me the new Will Smith, that’s Jaden\nCalling me a faggot when I’m rapping, that’s hating\nI need to slow down, what the fuck is y’all saying?\nStep inside the party, y’all niggas is mood killers\nMy lifestyle simple: Live easy and Bruce Willis\nI’m the boss, Michael Scott, y’all bitches is just Phyllis\nSet the world on fire, y’all motherfuckers is chillin', what is this?\nThat’s why these fucking emcees want their asses back\nDon’t you know that I’m a rapist? Ask a track\nWhiskey sipping, wanna drink the whole bottle\nBut these smart middle-class black kids need a role model\nFucking hate me, that’s what I’m used to\nSuck a dick, we the shit, Metamucil\nGod damn, man, there’s gotta be a better way\nThan pill-popping all these drugs so I can stay awake\nLike I’m Jessie in this bitch, I’m so excited\nThere’s a party at the top, you ain’t invited\nBut it’s lame, and all the bitches is fake\nYou think about your old girl and how breaking up’s a mistake\nBlack dudes assume I’m closeted or kinda gay\nWhite people confused like girl on Glee and Gabourey\nIAmDonald is a full-time job\nThese niggas want me to fail so they can write me off\n\n[Chorus: Childish Gambino]\nIt seems like they all want me to fail\nBut I’m not going back\nNot going back, baby\nPlease tell me you don’t want me to fail\n‘Cause I’m not going back\nNot going back\n\n[Verse 2: Childish Gambino]\nDirty girls love my dick; they’re cockroaches\nJewish girls eat my meat, it’s not kosher\nRelax, black chick, I think that I have offended thee\nGot nothing against the sisters, I just don’t think they’re into me\nI am not a thug, AKA: what they pretend to be\nI am just myself, AKA: my worst enemy\nYeah, bitch, cut the swag with a fucking knife\nI come hard like my life keep her pussy tight\nIt’s cool though, it’s all good\nYou want a dude who keep it real and stay hood\nI’m sorry, babe, but I act me\nI don’t \"act black\", whatever that be\nI’m just happy these girls seem into me now\nYeah, they're looking for some In-N-Out, animal style\nWith this lettuce, cheese, bread—making sandwiches\nThat’s why you niggas fail like all of your parents’ marriages\nRan into Rashida Jones, told me that she heard my song\nWhen I called her mixed like the crowd at my last show\nShe said to write her something nice on the next track\nBut she cute, so I wrote her ass a whole rap\nMan, I threw that shit away, it felt dumb\nBelieve me, it was bad, we’re better off, you’re welcome\nI worked hard on that song like day and night\nThat whole song made this one verse, crazy, right?\nI guess it all goes somewhere, you know that?\nLike that bullshit, you talked before Culdesac\n\"I didn’t know he had it in him\"\nCouldn’t see me as Spider-Man, but now I’m spittin’ venom\nNow you payin’ attention, pick your fucking face up\nWhen I wanna be a superhero, I just wake up\nRenaissance man with a Hollywood buzz\nI refuse to go back to not liking who I was because\n\n[Outro: Beldina Malaika, Childish Gambino]\nFake love, these fake dreams\nThese fake sounds\nAll the things that we felt\nYour voice was screaming too loud\nI know what you’re ready to be (be)\nBut it isn’t with me (me)\nSo I’m ready to leave you alone\nI don’t really wanna fight like this\nI don’t ever wanna lose your kiss\nAll I ever wanted was someone to hold onto\nI just wanna be your girl\nEverything you haven’t heard\nPlus, I just wanna be with you\n(With you) With you\n(With you) With you\n(With you) I just wanna be with you\n(With you) With you\n(With you) With you, oh\nOh, oh", "image": "https://images.genius.com/b7e3682692e56e63b21ead59d520c889.573x573x1.jpg"}], "artist": "Childish Gambino"}