{"songs": [{"title": "White America", "album": "The Eminem Show", "year": "2002-05-26", "lyrics": "[Intro]\nAmerica! Ha ha ha! We love you\nHow many people are proud to be citizens\nOf this beautiful country of ours, the stripes and the stars\nFor the rights that men have died for to protect?\nThe women and men who have broke their necks\nFor the freedom of speech the United States government has sworn to uphold… or so we're told\n(Yo, I want everybody to listen to the words of this song)\n\n[Verse 1]\nI never would've dreamed in a million years I'd see\nSo many motherfuckin' people who feel like me\nWho share the same views and the same exact beliefs\nIt's like a fuckin' army marchin' in back of me\nSo many lives I touched, so much anger aimed\nIn no particular direction, just sprays and sprays\nAnd straight through your radio waves, it plays and plays\n'Til it stays stuck in your head for days and days\nWho would've thought standin' in this mirror, bleachin' my hair\nWith some peroxide, reachin' for a t-shirt to wear\nThat I would catapult to the forefront of rap like this?\nHow could I predict my words would have an impact like this?\nI must've struck a chord with somebody up in the office\n'Cause Congress keep tellin' me I ain't causin' nothin' but problems\nAnd now they're sayin' I'm in trouble with the government\nI'm lovin' it, I shoveled shit all my life, and now I'm dumpin' it on\n\n[Chorus]\nWhite America! I could be one of your kids\nWhite America! Little Eric looks just like this\nWhite America! Erica loves my shit\nI go to TRL, look how many hugs I get! (Yah!)\nWhite America! I could be one of your kids\nWhite America! Little Eric looks just like this\nWhite America! Erica loves my shit\nI go to TRL, look how many hugs I get!\n\n[Verse 2]\nLook at these eyes, baby blue, baby just like yourself\nIf they were brown, Shady'd lose, Shady sits on the shelf\nBut Shady's cute, Shady knew Shady's dimples would help\nMake ladies swoon, baby (Ooh, baby!) — Look at my sales!\nLet's do the math: if I was black, I would've sold half\nI ain't have to graduate from Lincoln High School to know that\nBut I could rap, so fuck school, I'm too cool to go back\nGive me the mic! Show me where the fuckin' studio's at\nWhen I was underground, no one gave a fuck I was white\nNo labels wanted to sign me, almost gave up, I was like\n\"Fuck it,\" until I met Dre, the only one to look past\nGave me a chance and I lit a fire up under his ass\nHelped him get back to the top, every fan black that I got\nWas prob'ly his in exchange for every white fan that he's got\nLike damn, we just swapped: sittin' back lookin' at shit, wow\nI'm like my skin is it startin' to work to my benefit now? It's—\n\n[Chorus]\nWhite America! I could be one of your kids\nWhite America! Little Eric looks just like this\nWhite America! Erica loves my shit\nI go to TRL, look how many hugs I get! (Yah!)\nWhite America! I could be one of your kids\nWhite America! Little Eric looks just like this\nWhite America! Erica loves my shit\nI go to TRL, look how many hugs I get!\n\n[Verse 3]\nSee, the problem is I speak to suburban kids\nWho otherwise would've never knew these words exist\nWhose moms prob'ly would've never gave two squirts of piss\n'Til I created so much motherfuckin' turbulence\nStraight out the tube, right into your livin' rooms I came\nAnd kids flipped when they knew I was produced by Dre\nThat's all it took, and they were instantly hooked right in\nAnd they connected with me too, because I looked like them\nThat's why they put my lyrics up under this microscope\nSearchin' with a fine tooth comb, it's like this rope\nWaitin' to choke, tightenin' around my throat\nWatchin' me while I write this, like, \"I don't like this note!\"\nAll I hear is: lyrics, lyrics, constant controversy\nSponsors workin' 'round the clock to try to stop my concerts early\nSurely hip-hop was never a problem in Harlem, only in Boston\nAfter it bothered the fathers of daughters startin' to blossom\nSo now I'm catchin' the flak from these activists when they raggin'\nActin' like I'm the first rapper to smack a bitch or say \"faggot\", shit\nJust look at me like I'm your closest pal\nThe poster child, the motherfuckin' spokesman now, for—\n\n[Chorus]\nWhite America! I could be one of your kids\nWhite America! Little Eric looks just like this\nWhite America! Erica loves my shit\nI go to TRL, look how many hugs I get! (Yah!)\nWhite America! I could be one of your kids\nWhite America! Little Eric looks just like this\nWhite America! Erica loves my shit\nI go to TRL, look how many hugs I get!\n\n[Outro]\nSo to the parents of America, I am the Derringer\nAimed at little Erica to attack her character\nThe ringleader of this circus of worthless pawns\nSent to lead the march right up to the steps of Congress\nAnd piss on the lawns of the White House\nTo burn the *galf*​​ and replace it with a Parental Advisory sticker\nTo spit liquor in the faces of this democracy of hypocrisy\nFuck you, Ms. Cheney! Fuck you, Tipper Gore!\nFuck you with the freest of speech this Divided States of Embarrassment will allow me to have! Fuck you!\nHa ha ha, I'm just playin', America\nYou know I love you", "image": "https://images.genius.com/c43578375ef2ac32c140cc35dfe2fef1.1000x1000x1.png"}], "artist": "Eminem"}