{"songs": [{"title": "Raised in da Hood", "album": "Doggumentary", "year": "2011-03-29", "lyrics": "(I was raised in the hood)\nEastside Long Beach to be exact\n(I was raised in the hood)\nWhere the grass is greener and the Crips are much meaner\n(We got your back, I was raised in the hood)\nI’ll never turn my back on the hood\nYeah you can take me out the hood\nBut you can’t take the hood up outta me\n\n[Snoop Dogg - Verse 1]\nRaised by the gangstas, the generals, the thieves, the 20s\nYeah I’m stealing niggas, please what you know bout that\nI do it everytime, told em 1800 had em mixing it with lime (oh weee)\nMy life is like a movie, I was thuggin in the beach when I lit my first doobie\nIn the same city where I got my first piece of coochie\nWhere I sold my first dime, and I held my first uzi\nBitch, choose me, cause I’m going to the top\nRap or the rock, them hoes say I’m on bitch\nWhenever will it stop\nI was poppin’like it’s on, slamming Chevy’s up the block\nEast up, what it do though\nNow I ride 2-door, the Porsche looking mean\nHella far from broke, the 40 won’t choke plus a niggas still elope\nOnly cause I was raised in the hood\n\n[Hook]\nI was raised in the hood (the hood, the hood, the hood)\nI was raised in the hood (the hood, the hood, the hood)\nWe got your back\nI was raised in the hood (the hood, the hood, the hood)\nI was raised in the hood (the hood, the hood, the hood)\nWe got your back\n\n[Snoop Dogg - Verse 2]\nRaised by the monsters the criminals\nThe G’s, it was the niggas on the East\nWhat you know bout that?\nSnoopy in his prime, I’m a boss\nI catch a nigga slippin’ like moss\nRide with the realest , I’ve been on it since a young’n\nIt’s 200 bitches in the function\nLooking cool, you know it bitchy I’m rollin’\nAnd I ain't worried bout them niggas we patrolling the hood and the city\nRollin on that dilly\n2 milli, 2 Bugatti’s, call em Rozay and Diddy\nHeart of the set, homie I’m a vet\nLil nigga, keep ya clothes, ask around\nI’m a rep, East up, what it do though\nHoes spillin’ Nuvo, Doggy on his tip\nI threw up the two O\nHella far from broke, the 40 won’t choke plus a niggas still elope\nOnly cause I was raised in the hood\n\n[Hook]\nI was raised in the hood (the hood, the hood, the hood)\nI was raised in the hood (the hood, the hood, the hood)\nWe got your back\nI was raised in the hood (the hood, the hood, the hood)\nI was raised in the hood (the hood, the hood, the hood)\nWe got your back\n\n[Snoop Dogg - Verse 3]\nRaised by them hustlas them dealers on the block\nIt was plenty of them niggas on the spot\nWhat you know bout that?\nTurned up fully\nThe hood raised me, gang-banging made me a bully, ya dig?\nBurnt out and any party we at, you know it’s turned out\nThe people talking the rumours\nNow what you heard about?\nHow I spend 100 thou gettin’ purped out\nI’m strapped up, I keep a pistol for these suckers tryna act up\nThey know I’m famous, like I won’t get in the streets Cuz?\nLike I don’t come from the W, I’m a beast bru\nWhat it do though, dickies for the dulo\nHomie, you know skinny niggas sumo\nHella far from broke, the 40 won’t choke plus a niggas still elope\nOnly cause I was raised in the hood", "image": "https://images.genius.com/bf66457764b32165c7cdb2908ea44580.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}