{"songs": [{"title": "Selsun Blue", "album": "Sorry 4 The Wait 2", "year": "2015-01-15", "lyrics": "[Hook]\nGet rid of the residue\nGet rid of all the white, like Selsun Blue\nThis that Sorry 4 The Wait 2\nI'm so sorry, I feel terrible\nYeah, I know I keep on telling you\nLeggo\n\n[Verse 1]\nIt's all about the Young fuckin' Money\nIt's a war in these streets, I need a Humvee\nThat AK-47, that's my trusty\nGot some tricks up my sleeves, I need some cufflinks\nOh Lord, these niggas soft, these niggas fluffy\nAnother one bites the dust 'til his gums bleed\nOh Lord, Public Enemy, Chuck D\nMe with no money's like a bunny with no front teeth\nFuck me? It's fuck you if it's fuck me\nI hit the kush, blow it out like a bum knee\nWhere the haters? Point 'em out and ask 'em what's beef\nStack of hundred dollar bills in a scrunchie\nOh Lord, kamikaze, kidnappin' killers\nScreaming \"Fuck the other side!\"\nShe ride the dick, the dick gon' kill her, vehicular homicide\nOh Lord, I'm Sorry 4 The Wait, nigga\nI'm sorry for them other guys\nLay a nigga down, Nina sang his ass a lullaby\nWave your white flag all you want, bitch, I'm colorblind\nBad bitch with me got thunder thighs and her mother's eyes\nLi-li-li-lick my lollipop like it got gum inside\nMiami in the winter, Cali in the summertime\nMy bitch is independent, she don't ask me for a dime\nLove it when we makin' love, hate it when it's fuckin' time\nDisrespect the caterpillar, rave about the butterfly\nBullet ain't got no name, nigga, but you could get it customized\nRun up in your house, undisguised, why you look surprised?\nMotherfuckers better fuckin' hide, I feel like Mr. Hyde\nAthletes still gettin' jacked like they missin' tires\nOh Lord, one of the wildest B's in my hive\nI'll sting a bitch and die anytime\nHate it when the fuckin' police shut the session down\nWe just talkin', we just skatin', we just messin' round\nTell them niggas that be hatin' we ain't messin' round\nThey just barkin', they just fakin', they gon' settle down\nWe got bitches, we got beer, we got Bobby Brown\nSkatin' underneath the bridge, dead body found\nDo a trick over the body, hope he smilin' down\nDo a trick off of some stairs, land on solid ground\nGrizzly Gang in this bitch, check the grip tape\nNigga came on your bitch, ooh milkshake\nChop a cocaine brick like a sensei\nBreak the great white down to a fish plate\nWoo! Pockets on inflate\nGot the Yay locked down like Kim K\nI been sippin' codeine since 10K\nI be cussin' while I'm bustin', \"Die motherfuckers\"\nOh Lord\n\n[Hook]\nGet rid of the residue\nGet rid of all the white, like Selsun Blue\nIt's that Sorry 4 The Wait 2\nI'm so sorry, I feel terrible\nYeah, I know I keep on telling you", "image": "https://images.genius.com/c84ee812d9e99028d560054b386d4d9d.500x500x1.jpg"}], "artist": "Lil Wayne"}