{"songs": [{"title": "Plain Jane", "album": "Trap Back", "year": "2012-02-05", "lyrics": "[Verse 1: Gucci Mane]\nI know my body took a lot of ink\nLungs smoke a lot of stink\nBladder piss a lot of pink\nBecause that lean I like to drink\nMy face got a lot of tats\nMy grill got a lot of gold\nMy mouth talk a lot of shit\nMy dick fuck a lot of hoes\nMy stomach be filled with shrimp, legs limping like a pimp\nGazelles on my fucking frame, waves all in my temp\nMy mind it be on the prize, hands on with the nine\nMy traphouse it keep a line, because I'm selling Duncan Hines\nGucci Mane a millionaire, my house I be seldom there\nI always be on the road, bank account got several 0's\nMy britches be True Religion, in the kitchen cooking chickens\nSmoking Swishers, busting Phillies, bought two Raris, spent a milli\n\n[Hook]\nThis watch right here cost ninety thousand plain jane\nBut I'mma put some rocks off in it anyway\nThese haters they gon' hate on you like anyway (anyway)\nSo I'm gon' put some rims on my shit anyway\nAnyway (anyway) Anyway (anyway)\nI dumped her, I can find another any day (any day)\nAnyway (anyway) Anyway (anyway)\nIt's not that hot outside but I'mma drop it anyway\n\n[Verse 2: Rocko]\nMaybach sitting way back\nSaid Maybach? Yeah it's out back\nI mean Outback, with my Australian bitch\nShe got a fat ass and some big tits\nI fuck with her cause her accent\nWear the Hublot? Cause it accent\nMy Louis V shades\nPlus it match the Ace of Spades\n(?) Talkin Audemars got two of 'em\nOne plain jane, one iced-out\nNigga tried me, knocked his lights out\nGot goonies but I'm hands-on\nRun the check up for my man's 'nem\nThat's A-1 FBG\nFree Boosie, Free B.G. (You know that's anyway)\nI'm a Don ho; your house the size of my Condo\nI just rap shit for the fun ho\nLast of a dying breed\n[Rocko, young dinosaur\nOld school, still wear Tretorns\nWhere that money at? I want me some\nWith your main bitch and your little sis\nKnow what time it is nigga, threesome\n\n[Hook]\n\n[Verse 3: Gucci Mane]\nI drop the top like, \"Fuck it\"\nI'm not in no lil' Cutlass\nI pull up in a \"What the...fuck I don't know was it\"\nI know it cost my budget\nI know the bitches love it\nI got haters disgusted\nI'm smoking on that musty\nI'm east Atlanta and I say it loud\nGot a black Ferrari because I'm black and proud\nI got a yellow one, it's like salt and pepper\nWhen I put 'em together they stand out\nI'm a biker, hitchhiker- That's what you are with your thumb out\nGot a Spyker with some rims on it, and the back tires they poke out\nGot a lighter? Let me borrow that so I can smoke me on this ganja!\nVersace shades- Stevie Wonder. Can't see these niggas they under\nYour label's a sandcastle: it's about to crumble\nLike Barry Sanders don't fumble\nIt's Gucci Mane knockin numbers (Gucci!)\n\n[Hook]", "image": "https://images.genius.com/acd9babb757092a69a2f3c9e7eb4a9ad.320x320x1.jpg"}], "artist": "Gucci Mane"}