{"songs": [{"title": "Devil’s Night Intro", "album": "The Devil’s Night Mixtape", "year": "2015-10-31", "lyrics": "[Verse: Eminem]\nYou know it's devil's night\nThe way that I smash the face of a punk in\nMask of Jason is a fashion statement since Drunken\nMaster tapes been a basket case\nAnd if that's the case, then I'm dunkin'\nFascination with masturbation and humpin'\nLacerations and masking tape\nAnd I'm bumpin' some Masta Ace\nRoll up posin' as pastor Mase at a luncheon\nSee Andrea Yates, grab her face, then I'm punchin'\nCrack her fuckin' skull with an antique vase, kill her husband\nTo the back of the station wagon\nShe's dragged and placed in the trunk and\nNow I'm wanted for kidnappin', rape, and abduction\nSpread her legs like Land O'Lakes that I'm cuttin'\n'Til every fuckin' limb's either amputated or punctured\nDecapitated Christina Applegate and I rap like I'm agitated\nNo chill, but I'm half sedated\nA functioning addict — wait, I'm in London?\nBrains underwear? A pantywaist, classic case of disfunction\nAggravated assault, it was rap related, you activated a gunman\nThis game's over-saturated with junk and\nYou punks couldn't get a hit from a database with a thumbprint\nRazors and matches, path is laid for destruction\nPut Jason Mraz's face in his ass\nThen I'm snatchin' Anne Hathaway\nShe scratchin' like Jam Master Jay on the one's and\nTwo's, I slash away, then I'm dumpin'\nHer ass in a Lake Placid for alligators\nAfter I use the fuckin' tire thumper to bash her brains in for nothin'\nThe murder weapons, I stash 'em away on Runyon\nMan, the kind of balls that it has to take and the gumption\nLack of class displayed, but such a vast array in abundance\nOf sad disgraceful and bad distasteful redundance\nAnd, bitch, I'm hung like candy canes if you're wonderin'\nBalls come at you like batting cages\nI'm raw like Big Daddy Kane is, I'm comin'\nLike I'm ejaculatin' and nuttin'\nCome catch the clap like you're patty-cakin', lil' dumplin'\nOr brace yourself like a cast and be the last to make an assumption\nI'm back like I'm in the bathroom takin' a dump and\nIt's back in the day or somethin'\nI'll shit on you, Devil's Night — how's that for a introduction?", "image": "https://images.genius.com/66678b06c44c6843cfd77955e8887e02.500x500x1.jpg"}], "artist": "Eminem"}