{"songs": [{"title": "Memory Lane (Sittin’ in da Park)", "album": "Illmatic", "year": "1994-04-19", "lyrics": "[Produced by DJ Premier]\n\n[Intro]\nAight, fuck that shit! Word, word\nFuck that other shit, y'know what I'm sayin'?\nWe gonna do a lil somethin' like this\nY'know what I'm sayin'?\n(Y'all doin' that other shit)\nKeep it on and on and on and on and\nKnow'm sayin'? Big Nas, Grand Wizard, God, what is it?\n(It's like…) Haha, you know what I'm sayin'?\nYo, go ahead and rip that shit, dun!\n\n[Verse 1]\nI rap for listeners, bluntheads, fly ladies, and prisoners\nHennessy-holders and old-school niggas, then I be dissin' a\nUnofficial that smoke Woolie Thai\nI dropped out of Cooley High, gassed up by a cokehead cutie pie\nJungle survivor, fuck who's the live-er\nMy man put the battery in my back, a difference from Energizer\nSentence begins indented with formality\nMy duration's infinite, moneywise or physiology\nPoetry, that's a part of me, retardedly bop\nI drop the ancient manifested hip-hop straight off the block\nI reminisce on park jams, my man was shot for his sheep coat\nChoco blunts'll make me see him drop in my weed smoke\nIt's real, grew up in trife life, the times of white lines, the high pipes\nMurderous night times and knife fights invite crimes\nChill on the block with Cognac, cold strap\nWith my peeps that's into drug money market interact\nNo sign of the beast in the blue Chrysler\nI guess that means peace\nFor niggas, no sheisty vice to just snipe ya\nStart off the dice-rollin' mats for craps to cee-lo\nWith side-bets, I roll a deuce, nothin' below\n(Peace God!) Peace God – now the shit is explained\nI'm takin' niggas on a trip straight through memory lane\nIt's like that, y'all…\n\n[Chorus]\n\"Now let me take a trip down memory lane\"\n\"Comin' outta Queensbridge\"\n\"Now let me take a trip down memory lane\"\n\"Comin' outta Queensbridge\"\n\"Now let me take a trip down memory lane\"\n\"Comin' outta Queensbridge\"\n\"Now let me take a trip down memory lane\"\n\"Comin' outta Queensbridge\"\n\n[Verse 2]\nOne for the money, two for pussy and foreign cars\nThree for Alizé, niggas deceased or behind bars\nI rap divine, God, check the prognosis: Is it real or showbiz?\nMy window faces shootouts, drug overdoses\nLive amongst no roses, only the drama\nFor real, a nickel-plate is my fate, my medicine is the ganja\nHere's my basis, my razor embraces many faces\nYou're telephone blown, black, stitches or fat shoelaces\nPeoples are petro, dramatic automatic .44 I let blow\nAnd back down po-po when I'm vexed, so\nMy pen taps the paper, then my brain's blank\nI see dark streets, hustlin' brothers who keep the same rank\nPumpin' for somethin', some'll prosper, some fail\nJudges hangin' niggas, uncorrect bails for direct sales\nMy intellect prevails from a hangin' cross with nails\nI reinforce the frail with lyrics that's real\nWord to Christ, a disciple of streets, trifle on beats\nI decipher prophecies through a mic and say \"Peace\"\nI hung around the older crews while they sling smack to dingbats\nThey spoke of Fat Cat; that nigga's name made bell rings, black\nSome fiends scream about Supreme Team, a Jamaica Queens thing\nUptown was Alpo, son, heard he was kingpin\nYo, fuck, rap is real! Watch the herbs stand still\nNever talkin' to snakes, 'cause the words of man kill\nTrue in the game, as long as blood is blue in my vein\nI pour my Heineken brew to my deceased crew on memory lane\n\n[Chorus]\n\"Now let me take a trip down memory lane\"\n\"Comin' outta Queensbridge\"\n\"Now let me take a trip down memory lane\"\n\"Comin' outta Queensbridge\"\n\n[Outro: DJ Premier scratching]\n\"Comin' out of Queensbridge\"\n\"Comin' out of Queensbridge\"\n\"Comin' out of Queensbridge\"\n\"Comin' out of Queensbridge\"\n\"The most dangerous MC is…\"\n\"Comin' out of Queensbridge\"\n\"The most dangerous MC is…\"\n\"Comin' out of Queensbridge\"\n\"The most dangerous MC is…\"\n\"Comin' out of Queensbridge\"\n\"The most dangerous MC is…\"\n\"Me number one, and you know where me from\"", "image": "https://images.genius.com/8753de258796b1f91adfedde591e85be.750x750x1.jpg"}], "artist": "Nas"}