{"songs": [{"title": "Full Of That Shit", "album": "Thats My Work Vol. 3", "year": "2014-02-27", "lyrics": "[Intro]\n\n[Verse 1]\nThe boss in the building, feeling so cold\nIf this was Houston I'd be feeling so throwed\nI'mma stand up, you better man up\nWho going home with Dogg?\nPut your hands up\nPuff pass and slide, you know the deal ho\nI'm 10 shots in, that's on the real though\nI got money love, and I ain't never scared\nWatch your bitch mayne, it's pimping everywhere\nI got a lot of bad ones, yeah you see the troops\nThey get to popping off, until they see it's Snoop\nI'm loc'd out, the vodka all in me\nBaby got the henney, and we from rolling twenties[?]\nTurn it up boy, high as a bitch too[?]\nThat Obama kush, that'll fix you\nYou better get em' mayne, I'm fucking all chicks\nI'm off the wall bitch, I'm full of that shit\n\n[Hook]\nIf you see me in the club and you know I'm turnt up\nBut your bitch keep looking at me\nYeah you better tell her keep her eyes on the motherfucking prize\nBefore you come fucking with me\nCause I'm full of that shit\nI'm full of that shit\nI'm full of that shit\nI'm full of that shit\n\n[Verse 2]\nEyes so glassy\nBitch in the club, tryna harass me\nI'm a taxi\nI take her home, like a dog do\nAnd cover everything, like a fog do\nBottle after bottle, nigga I'm turnt up\nMy eyes getting low, swisher burnt up\nThese hoes on one, tryna press a player\nBalling overseas, nigga I'm heavy there\nLeaning to the side, mixing all drinks\nDubs up in here, like a gold mink\nThis long beach bitch, d-o-double-g\nSince 93', on top of V.I.P\nWatch your look mayne, the stare make it worse\nI understand I'm famous, but I'm a gangster first\nYou better get him mayne, I'll beat his ass quick\nI'm off the wall bitch, I'm full of that shit\n\n\n[Hook]\n\n[Verse 3]\nGot my rag hanging, like Snoopy do\nSound like a hater, like Snoopy who?\nThe homies all in, niggas deep as fuck\nSuper s[?] with vodka, niggas creeping up\nFire it up, go on pass it round\nI smell the kush fool, I'm like a basset hound\nYeah I'm rich, nigga and what?\nStill [?]'d up, nigga that's what's up\nPour some more in, cause I can handle that\nI'm in a Pontiac, she said where the phantom at\nBitch you got me fucked up\nI do this for me, I don't do it for any slut\nLike a b I don't do this for any butt\nI do this for the c, and my niggas up in the cut\nIt's Snoopy D-o-g and I turn it up in the club\nI'm high as a bitch, and full of that shit\n\n[Hook]\n\n\n[Outro]", "image": "https://images.genius.com/84ac60e2e266a0d4d5eaa555a3450fe0.500x500x1.jpg"}], "artist": "Snoop Dogg"}