{"songs": [{"title": "Lithium", "album": "Meth Lab Season 2: The Lithium", "year": "2018-12-14", "lyrics": "[Intro: Sheek Louch]\nYeah, I'ma sit back and smoke this mother fuckin’ bush\nYou thought it was over?\nIt's your boy Sheek Louch\nIt's the Lithium, mother fucker\nMeth Lab 2\n\n[Verse 1: Method Man]\nLook who comin’ back up from the slums\nTook a scene from Whiplash, hit you actors with the drum\nAin't no actin' where I'm from, nah\nI'm in Staten, get it done\nI used to be a student, wasn't really into schoolin', I was truant from the jump\nKept it movin' with the Knicks, Patrick Ewing with the dunk\nBeat bump, soundin’ like a body movin’ in the trunk\nPump shotty, got everybody movin' when it dump\nSide note, if you a boss, then you movin’ where you want\nI got high hopes, if you ever saw when I was broke\nIn the game since a kid, they never saw me as a G.O.A.T\nYet, I'm scorin' and feelin' like I’m Jordan in the post\nDoctor J cool but now I like the coroner the most\nHanz and Sheek Louch, damn, they bar'ing the flow\nWho am I to knock they hustle like a warrant at the door?\nLife funny, I'm feelin' like I'm Martin off the show\nI'm just tryna get this money, buy the Foreign off the show\n\n[Verse 2: Hanz On]\nIt go to puma layin' hammers, cabinets finish the job\nBig Barker, he involved, Doctor paint a collage\nStill a student tryna shoot for the stars\nStill improvin', tryna rape all the odds\nRap architecure, nice with the bars\nMeth Lab 2, call it the deuce\nAnd when you talk about it later, better call it the truth\nThe analytics, paramedics, pullin' up at the booth\nI heard them engineers, pioneers, put series on loop\nI guess them niggas didn't get it 'til proof\nHow them killas'll move\nThat's how them gangstas get they money, recoup\nThe psychedelic relics dyin' to shoot\nAnd, yo, I'm built for the Borough\nIt doesn't matter who came wit'chu at all\nAnd, yo, them corny niggas destined to fall\nHey, yo, they down to dilute\nI'm from the Staten, Hanzarelli the Brute\nAnd, yo, the boogie barker, same wave just a different saga\nIt's lookin' easy 'cause these cats is trakka\nAnd, yo, when is all these rappers gon' learn hard work, far as music concerned, trumps talent\nYo, a point of return\nYo, bet your money, yo, I double the bank\nAnd, yo, whoever lose could pay for the stank\nMother fucka!\n\n[Break: Sheek Louch]\nD-Block!\nHey yo, Meth, what up?\nMeth Lab 2, huh?\nIt's ya boy Sheek Louch\nHey, yo, I got 'em\nHey, yo, yo\n\n[Verse 3 : Sheek Louch]\nWe used to shop our demo so you could listen to our story\nNow I'm gettin' millions, I'm another category\nHard nigga, bitch, I'm like Denzel in Glory\nYoung, Red Navigator, bumpin' that nigga N.O.R.E\nHad that Clan shit on\nHopin' you left space on the track \"Protect Ya Neck\" so LOX could spit on\nMeth Lab and too high so I'm Uber, cabbin'\nI don't Dougie, I don't Kwon, I ain't fuckin' Dabbin'\nBig weapons, dashiki, I'm Arabin'\nThe drama I bring\nLittle shooters under my wing\nI started young, I was a mixtape king\nNow my legacy is Ronald Reagan, Aston Martin\nGun on my hip, the passenger bitch kinda resemble Megan (Which one?)\nMegan Good, Megan Fox\nAny state, any jail, or group home mother fuckers gon' rep The Lox\nExtended clip, don't get put in that box\nBitch\n\n[Outro: Sheek Louch]\n2, 2, 2\nYou see-you see-you see why this forever will be locked up in the end", "image": "https://images.genius.com/ed8b9d6333cc29967da88416db3514c8.1000x1000x1.jpg"}], "artist": "Method Man"}