{"songs": [{"title": "N My Zone : Mask Off", "album": "The Bar Exam 4", "year": "2017-06-20", "lyrics": "[Intro: Will Smith]\nThe separation of talent and skill is one of the greatest misunderstood concepts for people who are trying to excel, who have dreams, that want to do things. Talent you have naturally. Skill is only developed by hours and hours and hours of beating on your craft\n\n[Part 1: \"Backseat Freestyle\" Remix]\n\n[Chorus]\nI've been killing microphones, killing microphones\nI've been killing microphones, killing microphones\nNigga, I've been killing microphones, killing microphones\nKilling microphones, killing microphones\n\n[Verse 1]\nI been like the zone\nWhen you talk to me minimize your tone\nTake some of that bass out your voice\nDon't go and put your Energizer on\nWith this beat I'm going all the way\nI don't mean to the end of night, come on\nI mean I'mma take it to the grave, untilI end your life it's on\nI'm talking about cracker-jacking these niggas\n'Til their whole enterprise is gone\nI'm talking about clapping at these niggas\nWith some shit that's gonna feminize you strong\nI'm talking about tenderize the bone\nI ain't talking about weird science though\nWhen I say that my ceiling is probably gone\nI'm talking about villainizing your home\nNigga, I been in like the zone\nI'm looking like Rambo in this bitch\nBut nigga, I ain't feeling like Stallone\nFeel more like I'm in a heist alone\nLook, I don't like to aim my shit at any artist\nWhen I'm writing I'm just generalizing\nHow am I gon' take a shot at something\nI can't even fucking identify with?\nI'm feeling like the long days away from feeling my Patrón\nUsed to have the coldest bitches waiting for me\nChilling by the phone\nUsed to do donuts on the grass\nNow I'm just feeling like a drone\n'Cause even though I'm sitting high somewhere\nI'm still spinning by your home, bitch\n\n[Part 2: \"Mask Off\" Remix]\n\n[Chorus]\nI've been killing microphones, bitch, killing microphones, bitch\nI've been killing microphones, killing microphones\nNigga, I've been killing microphones, killing microphones\nKilling microphones, killing microphones\n\n[Verse 2]\nThis a new life, who this? This a new phone, who this?\nI'm in a new zone, who this? This ain't no Redbone and who this\nI'm sorry, my top is unavailable right now\nMy roof gone, who this?\nNigga, my taste amazin, my chick look like the waitress from Hooters\nAnd she about to fix me dinner\nShe independent, but she into niggas that's big spenders\nAnd I'm into fitting this dick in her\nAnd she into fitness like Brittany Renner\nI used to chase the liquor with the Guinness\nMove-making, nigga, with the business\nWith the winners in the bed with two majors\nI still wake up feeling independent\nI'm a savage, on top of that I'm a reckless product of D&D\nStop critiquing me, my detractors\nJust couldn't sell a record to the DMV\nI'm somebody, ain't nobody better than\nMy precise knowledge and intelligence\nWell advanced, I swipe a knife across your white collar like a cheddar scam\nI put your lights out like Edison\nAin't nobody out there ready for him\nMy blood type B positive, your type O like the credits wrong\nI'm immune to all medic-on, blue Ferrari head is gone\nWent from palladiums to colosseum stadiums\nYou perform in the Reddit forum\nI spot a bitch nigga like Cyclops on Santa Monica\nGot a model blowing my mind\nMy new Monica is blowing my harmonica\nThe car odometer is on the bottom\nOf all the numbers like you dial star pound\nOr put the car around white walls\nCall 'em fire marshalls to come and shut the party down\nI'm the leader of CMB, doing 52 over speed bumps\nIn front of your table with TMZ doin interviews while you eat lunch\nI deal with mics real Kendrick-like, I'll kill a mic\nCash rules everything around me until I die\nLooking right into the vanilla sky\nI'm funny acting \"who this?\"\nYou owe me money, run me that or do this\nGet a running start, jump into a hole, take a hole in that beluga\nI act like them older cats with moola\nDragging motorcycles past the light\nWith Kodiak on that Patrón, I'm hot and on cognac, I'm cooler\nAnd I'mma show no reaction to your rollie flashing like my zodiac a jeweler\nAin't nothing but a dead something, I be headhunting, yeah, I'm going for that medulla\nBoo-yah, don't be acting foolish\nBaby, this a new phone, you yapping \"who this?\"\nMaybe everything I'm gon' say from here on then is gon' be on the behalf of \"who this?\"\n(Hello) This a new life, who this?\nI'm on a roll like two dice moving\nI'm on a boat in Dubai fooling\nOn the moped flute-by shooting\nI'm an unapologetic work in progress\nProduct of a hard-working dedicated father with shortcomings\nPraying all his sons make it farther\nPeople say that it make you softer to raise a daughter, but it made me harder\nSmarter with the way I make dollars just to make sure she stay a baby baller\nThe way I zone is like the AC on\nI play like KC and KG, you can't even cage me\nI be using Windows like I'm on a HP\nJust look around, I don't own a thing that ain't in HD\nI ain't interested in the crown that don't belong to Wayne, Shady or Jay Z\nThat's a opposite\nYou don't like your life, how about death?\nYou don't like to fight, how about sex?\nYou don't like the kind of car you drive, okay, how about Bow Wow's jet?\nI got the kind of flow that destroy the place though\nHow about you take your shot at Rihanna like I did when I said \"hi\"?\nOr how about with Soulja Draco?\nHow about I come through and paint the floor with your whole crew?\nHow about the coroner come through and tell you go get Maaco\nHow about I don't give a fuck about burning bridges?\nHow about I walk through the fire 'cause I'm hot and I got the golden gate flow?\nHow about I box?\nHow about like Argyle\nI sock niggas and give 'em disease like a irock\nHow about I hop out the Maybach and challenge every living emcee?", "image": "https://images.genius.com/2627cc5445030d64606928667383564b.800x800x1.jpg"}], "artist": "Royce da 5'9'’"}