{"songs": [{"title": "Flatline", "album": "Elements", "year": "2016-01-25", "lyrics": "[Verse 1]\nYeah, you ain't seen my best\nCheckmate, ain't a game of chess\nGlobalists see me as a threat\nFree thinking, got a world at my neck\nHah, am I paranoid? Picture Malcolm X\nIn a room full of pigs, trying not to bust a sweat\nAye, Neil Tyson need to loosen up his vest\nThey probably write that man one hell of a check\nAye, I'm over here on this side of town\nCome on over, over, over, over here, try to clown\nAye, I never pipe down\nIf they weren't coming for me then\nThey definitely coming for me now\nI can't even keep my phone charged up\nAll this shit I'm talking, I should get my home barred up\nRappers get off of my dick and get your own bars up\nNow the mirror lizard's breath got the clones scared cuz\nWoo, use your, use your common sense\nWhy is NASA part of the department of defense?\nThey divided up the seas into thirty-three degrees\nFeeding kids masonry, bruh, be careful what you read\n\n[Hook 1]\nFlat line, flat line\nThere's no superior blood line\nFlat line, flat line\nYou got me once but that died, aye\n\n[Verse 2]\nVoice, voice, do I have a voice?\nDo I give a fuck? Do I have a choice?\nJoint, joint, I roll up a joint\nKeep my shooters in the game like I hate to disappoint\nI see only good things on the horizon\nThat's probably why the horizon is always rising\nIndoctrinated in a cult called science\nAnd graduated to a club full of liars\nHeliocentrism, you were the sixth victim\nFuck you and your team, you can sit on the bench with 'em\nThey nervous, but before you try to curve it\nDo your research on David Irving\nStalin was way worse than Hitler\nThat's why the POTUS gotta wear a kippah\nI'm a man first 'fore an artist\nGet a lawyer, look up Doctor Richard Sauder\n\n[Hook 2]\nFlat line\nYou fooled us for the last time\nFlat line, flat line\nThere's no superior blood line\n\n[Interlude: Neil Tyson]\nSo you want to find the farthest point from that center. And it turns out sea level at the equator is farther away from the center of the Earth than sea level near the poles. It has nothing to do with global warming and melting of the ice caps\n\n(Why is that?)\n\nBecause... Earth, we know it spins, once a.... day. Yes, thank you. Three people know that, how long a day lasts here\n\n(Good for row number two, they're off to a great start)\n\nSo you, so you spin, you know when you spin pizza dough, it kind of flattens out. It gets wider in the middle and...so Earth, throughout its life, even when it formed, it was spinning, and it got a little wider at the equator than it does at the poles. So it's not actually a sphere, it's an...it's oblate, it's officially an oblate spheroid. That's what we call it. But not only that, it's slightly wider below the equator than above the equator\n\n(A little chubbier?)\n\nLittle chubbier, chubby's a good word, it's like pear-shaped. So it turns out the pear-shapedness is bigger than the height of Mount Everest above sea level\n\n[Hook 2]\nFlat line\nYou fooled us for the last time\nFlat line, flat line\nThere's no superior blood line\nDead", "image": "https://images.rapgenius.com/3d35ab799cce38766acf14b0c12425e0.500x500x1.jpg"}], "artist": "B.o.B"}