{"songs": [{"title": "I’m a Bad", "album": "Whut? Thee Album", "year": "1992-09-22", "lyrics": "[Verse 1]\nI get mad wicked (fuck around) and catch a bad one by the funker\nI puff the mad spliffs and roll blunts with Archie Bunker\n'Cause my brain is twisted, so I cock the biscuit\n'Cause shit's thick, some say I'mma bastard of a swift bitch\nNegro, funkin' it with the style in your ear, bro\nTo make you fear me like Cape without Robert DeNiro\nYou big pussy, so funky that you have to douche me\nYou can't hear me then my record label didn't push me\nI know I'm sayin' 'funk' too many times in my rhymes\nBut if I wasn't that, I wouldn't freak it in the line\nBut it don't seems to matter 'cause my shit get fatter and fatter\nI'll do the funk in your face and it slaps ya\nHow does it feel with the face full of funk\nWith the bass in your trunk, weed laced with the blunt\nI puff, I never got snuffed, bust while I dust your monkey\nAss off then I just crush on the hush hush\nSo if you want a taste of the funk from the gutter\nAsk the brothers (Why?) 'Cause I'm bad (Word to mother)\n\n[Hook]\nI'm a bad... Yo, word to the mother (x3)\nI'm a bad... Bad bad, and a wicked in bed\nI'm a bad... Yo, word to the mother (x3)\nI'm a bad... Bad bad, and a wicked in bed\n\n[Interlude]\nYo yo, check this out\nThis is for y'all hokey-pokey punk pussy motherfuckers\nJust to show y'all I do what the fuck I wanna do\nI want y'all to check this on the real\nAnd yo, check this out\nShake it! C'mon shake it! C'mon shake it! C'mon shake it!\nWhassup now? Whassup now? Whassup now? Whassup now?\nWhattup now? Hahahahah\n(Yo Red, c'mon, get back to the track man, I wanna get out of here!)\nYo kid chill, a'ight, a'ight, check it out\n\n[Verse 2]\nFlexy I'm sexy when I'm standin' in my drawers\nIf you can't check me when I'm rappin', put the tape on pause\nAnd listen to the incredible shit that I kick my man\nGive me five on the backhand then stick\nYour finger in a hole and chop the stick quick\n'Cause my lip get to the point, to STILL rock the fly shit\nSince you're holding your breath, I hold my jewels\nI swing hardcore, so I walk, holdin' my tools\nThe original P-Funk, takes no junk, from a chump, or punk, G\nI been this way every since nine months\nSo get down while I rip the raps from my lip 'cause\nMy shit's more deep, than any tape from Enigma\nThe gettin' nice, thinkin' killer brother who pop trash\nBasic instinct — I'm a shooter so they got blasted\nMuch ass I kick, groove to the master mix\nMy song still pumps when it's not even mastered, bitch!\nMy shit's very chronic so rewind it\n'Cause it's like.. eh-eh-eh-eh beyond, bionic!\n'Cause I'm a wild and crazy guy! No lie!\nLast brother to battle me I started pissin' in his eye\nI'm bad, word to mother, to the motherfuckin' Hubbard\nEatin' her curds and whey, puffin spliffs 'cause she doesn't\nAnd if you still don't under-fuckin-stand where I'm comin' from\nListen to my nine, understand where it's hummin' from!\n\n[Hook]\nI'm a bad... Yo, word to the mother (x3)\nI'm a bad... Bad bad, and a wicked in bed\nI'm a bad... Yo, word to the mother (x3)\nI'm a bad... Bad bad, and a wicked in bed", "image": "https://images.genius.com/851b0a63d63f6c8548a17f295b615296.1000x991x1.jpg"}], "artist": "Redman"}