{"songs": [{"title": "Hands Up, Lay Down", "album": "The Perfect Storm", "year": null, "lyrics": "[Chorus: Twista]\nHands uuuuup, lay dowwwwwn\nCount to ten before you get up off the ground\nWhen you do I disappear, like the matrix\nBut if you don't, then my thumper gon' leave you wasted\nHands uuuuup, lay dowwwwwn\nCount to ten before you get up off the ground\nWhen you do I disappear, like the matrix\nBut if you don't, then my thumper gon' leave you wasted\n\n[Verse 1: Twista]\nDude tried to steal on me, so I'm already pumped (WHAT!)\nWhy you steady standin' there talkin' that shit? B-Hype gon' go to the trunk\nUnload the fivers, SKs and millimeter choppers\nI got niggas that be killers with some shit that when you shoot it on the block it sound like a helicopter\nIt's hard out ch'ere, motherfuckers ain't got no work\nIt's a few niggas got cocaine, few niggas got dope, most niggas got purp'\nLil' nigga tried to play you shady, instead of yellin' out three folks and almighty\nThey be talkin' 'bout '80s babies, shorties that was born in the '90s is grimy\nNo respect and no morals, actin' like you owe that shit\nFuck up out my face big homie, matter fact gon' load that shit\nIt done got so crazy up in the streets sometimes I can't believe that this my land\nLil' girls used to wanna fuck a dope boy, now they wanna fuck a stick-up man\n\n[Chorus: Twista]\nHands uuuuup, lay dowwwwwn\nCount to ten before you get up off the ground\nWhen you do I disappear, like the matrix\nBut if you don't, then my thumper gon' leave you wasted\nHands uuuuup, lay dowwwwwn\nCount to ten before you get up off the ground\nWhen you do I disappear, like the matrix\nBut if you don't, then my thumper gon' leave you wasted\n\n[Verse 2: Waka Flocka Flame]\nMidwest shawty I'm in the club with the Folks, Midwest shawty I'm in the club with the Lords\nMidwest shawty I'm in the club with the Stones, them Latin King boys man they minds straight gone\nWhat's bangin' joe? Pants hang low, why you start playin', that's the [?] gang\nCame a long way from sellin' weed, pills and cocaine, niggas catch a body just to get a little street fame\nC'mon got crunk, that's cream now Flocka, keep ya on ya toes, I ain't playin' wit'chu nigga\nThe way a nigga rob ya I think I need a Oscar, trick booty nigga I ain't playin' wit'cha partner\nThey say Flock (WHAT!) yo' friends don't know how to act\nWe shootin' and fightin' over here, and that's a real muh'fuckin' fact\nBlap, bottle full of Fuki, damu version of Tookie\nAll these tats make a nigga wanna shoot me, all these diamonds make a groupie wanna do me\nWho are you to judge it bruh? Ho please trip, hell yeah we grippin'\nCut me one time yo the nigga catch you slippin' all that bullshit everyday set trippin'\n(WAKA FLOCKA! FLOCKA! WAKA! FLOCKA! FLOCKA!)", "image": "https://images.genius.com/b1b74202bc3fa82e3dcce1439a67e984.500x500x1.jpg"}], "artist": "Twista"}