{"songs": [{"title": "Office Music", "album": null, "year": null, "lyrics": "Hit me,right in the sturnum this time t baby s**t you already know, you already know, you already know just the hustler music young weezy got that mother f***in\nHustler music,to ride to it yo,fly to it yo,Goddamn\nMissed and hit a nigga in his head with dis one\nIma paint da city red wit dis one\nIma head wit dis one\nSee u fuckin wit da boys who tote toyz way b4 Christmas\nNo assisstance (jis) That persistence me. That commitment if- I don't get it somebody gone die tonite-\nI kno my vibe is tight- And I deserve da throne - if da kid ain't right- den let me die in his souls\nI'll be ridin (jis)\nRidin alone\nWit my daddy on my mind like u gotta be kiddin\nHow da hell u ain't here 2 see ya prince do his thing\nSometimes I wanna drop a tear but no emotions from a king\nShall be\nSo I be who I be\nDats me, dats Weezy F. Baby and\nPlease say da motherfucking\nSo I be who I be\nDats me, dats Weezy F. Baby and\nPlease say da motyherfuckin\n\n[Hook]\nBaby u gotta kno dat im just out here doin what I gotta do 4 me and u and we eatin\nSo bitch\nY da fuck iz u trippin\nI'm takin dese chances\nMy head 2 da sky\nMy feet on da ground\nMy fingas 2 da judge if da money don't move\nAnd I won't budge\nWon't budge\nNo I won't budge no\nNall\n\n[Verse 2:]\nMoney iz da motivation\nFacin da avenue\nBack touchin' da wall\nGot da weed\nGot da gun\nGotta run wen I hear dat bird call (birrr) Dang\nHop in dat thang and merk off\nSwerve off\nU kno me, dey call me Birdman Jr\nNe body murderer\nBirdman sponsor it\nPhantom of da operah\nAll black- clock tent- locked in\nI can let dem shots out\nU can't get no shots in\nBullet proof\nLeave a nigga wit a bullet proof\nShoot ya in ya mouth and call it bullet tooth\nI'm like what dey do\nWhat 2 do\nTheres a full court\nPressure I'm just going 4 da 2\nIf I'm open for da three\nIma take it in a second\nEven if theres one second and\nIma make it. It's nothin\nI don't take it for granted\nI don't take it for nothin\nI take it for what it is worth to da durf motherfucker\n(yea)\n\n[Hook: Repeat 1x]\nBaby u gotta kno dat im just out here doin what I gotta do 4 me and u and we eatin\nSo bitch\nY da fuck iz u trippin\nI'm takin dese chances\nMy head 2 da sky\nMy feet on da ground\nMy fingas 2 da judge if da money don't move\nAnd I won't budge\nWon't budge\nNo I won't budge no\nNall\n\n[Verse 3:]\nI ain't neva killed nobody I promise\nI promise if u try me\nU gone have to rewind dis track and make me go back, dat nigga go dat\nDat boy will lay flat so flat\nDat act is wat I perform amongst u hatas\nGot Nina in my palm and I'm masturbating (black)\nPeter pan flies till I die what u sayin\nBaden ape, Yves Saint, Evisu iz wat I stand\nGot me feelin' like scarface, like da Koheba\nStreets reply I look right in da 4 seater\nYou know I be out here ridin da 4 seater\nTop floor of the 4 Seasons four of them whores\nAnd they all know how to cook it up\nAnd look I got some\nAnd only one know how to bag, bitch bundle up\nSee its a cold world so homey bundle up\nWe ain't on dis grind for nothin\nNow get ya hustle up", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}