{"songs": [{"title": "P.D. Roll ’Em", "album": "Mr. Scarface is Back", "year": "1991-10-03", "lyrics": "(Verse One)\nHere it comes fool, I play the game where it's no rules\nHomies on the cut call me Joe, cause I'm so cool\nQuick to get 'em up with a nigga, I ain't dodgin' em\nWin, lose, or draw in the hood, I'm squabbin' em\nRepresentin' the Park since I'm living here\nWalkin' through the hood from another set, give it here\nAnd after the jackin', you still want more, heh\nFuck your posse, it's time for the coroner\nDon't fuck with the Park niggas swarm\nMore niggas found dead in my hood than in Vietnam\nRollin' seven deep to a car\nQuick to take that ass to war, yo\nIt ain't no sleep being lost\nCause territorial rights are being enforced\nSo when you're rollin' up Holloway, floor it\nAnd if a nigga flags you down keep going\nDon't stop and sell your soul\nYou'll fuck around and get your ass P.D. rolled\n\n(Verse Two)\nThe last album passed gold\nAnd you wanna know the meaning of P.D. roll\nWell I'mma break it down for you real clean\n*gunshots* know what I mean\nIn other words getting blasted\nShootin' at a bastard, to see if he can last it\n9 times out of 10 he can't\nThat's just one more nigga in the paint\nYou see, when I go to work\nI hit a muthafucka where it hurts\nStarting off at his home site\nAnd fuck up a nigga's whole night\nYou out of there, just like that there\nFor jumping in the ring with a bear\nIt's easily executed\nPut the pistol to the head, cock the hammer back and shoot it\nYou can't get it no cleaner\nMake a hit, break quick to the Beamer\nHead south, take us to the hole\nAnd don't be no fool and get your ass P.D. rolled\n\n(Verse Three)\nMy own hood is confusing me\nShit just ain't what it used to be\nI'm stepping back on my old block\nThe finest bitch in the hood smoking crack rock\nEven the niggas I was raised with\nAre walking around in a daze and shit\nMan: \"Say now, can I get a dollar for a cold one?\"\nAnd got his hands out like I owe him\nBut I don't owe dat nigga\nI was ??? in the hood until I got bigger\nI hollered at my boys in the game\nAnd only a couple of em changed\nPeace to Q-Dog, Cool Coin, and Old Mack\nAnd all the rest of my boys down with Ak\nThe rest ain't about jack\nBut I still love the hood, so it ain't about that\nIt's all about being down with it\nShit, to be got, you gotta go out and get it\nLike my nigga doing time in the trunks\nNow that was a down muthafucka\nA couple of keys, my nigga stole 'em\nStraight up fucking P.D. roll 'em\nSo lay it down in the dirt\nNobody moves, nobody gets hurt\nThat's how it is, and always will be\nI had to have it, even if it killed me\nThe sight of losing didn't thrill me\nSo I had to go and steal G\nJust to make a quick one\nAnd I adidn't give a fuck who fell short to be a victim\nYou or your family Bro'\nYour ass out of line, your ass got P.D. rolled", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}