{"songs": [{"title": "Black Mozart", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "[Kung Fu sample]\nStupid fool, you're forcing me to kill you!\n\n[Intro: Raekwon]\nYeah, you know how it go\nFresh from the stationary hall of justice\nReal rhyming, real movement, real life\nWord up, we just chilling, ten bottles of Krug on the wall\nKnahmsaying? Straight up, for real\nYo, RZA, talk to these niggas, man, let's go, man, for real\nYo, Rah, what up? Let's go\n\n[Hook: RZA & Tash Mahogany]\nYou better get that money, no matter, what you do\nYou gotta get that money, and represent your crew\nAnd keep it true\n\n[Interlude: Raekwon] (under hook)\nYeah, gangsta shit, groovy shit\nRaw shit, secret indictment shit, yeah\nSecret indictments, be careful, niggas\nFor real, let's go\n\n[Verse 1: Raekwon]\nAs reaper stay sprayed, still niggas is smoked\nFour in his pocket, a diamoned up chain and some coke\nChampion hood, the goodies in a brown bag, by the radiator\nNear the cookies and the bundles of dope\nFishscalers, I live in elevators and gross\nAll this paper, profit make her lay there and post\nWith them Adidas that Bruce wore, stay in the juice bar\nAll I know if you saw me, you thought I was broke\nBlack, yo, I been hustling since niggas was busting guns\nAnd scuffling, and jumping niggas over some coats\nWe play the S&S rooftop, Latin Quarter, Polo popes\nWho hung out with all the Eighthers and GOAT's\n\n[Hook: RZA & Tash Mahogany]\nYou better get that money, no matter, what you do\nYou gotta get that money, and represent your crew\nAnd keep it true\n\n[Interlude: Inspectah Deck] (under hook)\nYo RZA, you crazy man\nThis that Black Mozart shit, right here\n\n[Verse 2: Inspectah Deck]\nYo, I used to scramble hard, radio strapped to the handlebars\nFifty deep, in the lobby large, rocking camouflage\nDark Caesar holding my nuts, played the building front\nFifth of Henny, throw a little snow in the blunt\nJust growing up, schooled by O.G.'s, holding O's and up\nDaily, new drama unfold, they popped 'em over what?\nIt's so rough, nobody know him, so what?\nAiyo, the money's close by, homey, show me the stuff\nBorough hopping, copping bricks, bags, burners and kicks\nCity slickers, circling the strip, working them tricks\nLike friday night cruise in the Coupe, new valor suit\nFruit flavored kicks, taking flicks out in 40 Deuce\nFarmer jeans, hammer swing, tucked in the loot\nHow they hit Miss Fisher, they was busting at suit\nUp in 54, underground, parrot and Q\nMade man with the grey shams, wrapping the boo\nStay flam, every day, fam, stacking my loot\nEighty grams in the cake, bam, packages flew\nSipping passion fruit, Alizé, in back of the Ooh\n\n[Bridge: RZA]\nWe soldiers, boy, we soldiers\nBake cakes, hundred dollar bill holders\nWe soldiers, boy, we soldiers\nBighead, I thought I told ya\nWe soldiers, boy, we soldiers\nBake cakes, hundred dollar bill holders\nBighead, I thought I told ya\nWe soldiers, boy, we soldiers\n\n[Hook: RZA & Tash Mahogany]\nYou better get that money, no matter, what you do\nYou gotta get that money, and represent your crew\nAnd keep it true", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}