{"songs": [{"title": "Let Me Know", "album": null, "year": "2016-07-21", "lyrics": "[Intro]\nAlright let's do it\n\n[Hook: Aaliyah]\nBaby let me know if you'll let me\nYou'll let me know, you'll let me know\nYou'll let me know, you'll let me know\nYou'll let me know, you'll let me know\nBaby let me know if you'll let me\nYou'll let me know, you'll let me know\nYou'll let me know, you'll let me know\nYou'll let me know, you'll let me know\n\n[Verse 1: Game]\nWhere the body cams at when they killed Sandra Bland though?\nWhere the justice system at when the cops go Rambo?\nBlack lives matter when we talkin' about Philando\nBut all lives matter when we talkin' bout Orlando\n49 dead bodies, 83 in France though\nThey say Alton had a gun, we ain't see it in his hands though\nWe screamin' fuck the police but what about Dallas?\nAll these murders on the news\nEvery week it's another one, DJ Khaled\nHow we gon' respect the badge if you don't protect and serve?\nThey say life ain't a movie but it's feelin' like The Purge\nAnd this rag in my pocket match the blood in the curb\nHear the shots in the hood but can they feel it in the 'burbs?\nTurn on the news, get seduced by the words\nAnd the noose on the black man's neck sounds absurd\nSummer 16 look like more than a Drake song\nAnd that's just this year, you forgot about Trayvon?\n\n[Hook]\nBaby you'll let me know, you'll let me know\nYou'll let me know, you'll let me know\nYou'll let me know, you'll let me know\n\n[Verse 2: Game]\nWhy it take 3 days for Obama to respond?\nCause Minnesota 3 days from the White House lawn\nTrump and Hillary both cons\nBackstab us like the bullets on in back of LaQuan\nThis ain't The Game, I come to you as Jayceon\nWith both of my hands up, don't shoot on my palms\nTamir Rice was just a kid and unarmed\nThem cops was Cleveland fans, you just killed the next Lebron\nWe just need a resolution\nWhen did being detained become a fuckin' execution?\nTurn on the news, my stomach turnin' to knots\nAs the world keep turnin', I'm about to turn into Pac\nI'm so determined, I promise to sing a sermon\nEvery night a mother dreads like Busta in Higher Learnin'\nCandles burnin' so we marchin' up the blocks\nMoment of silence every time a body drops\nWhen the killin' gon' stop?\nIf they stop killin' us will we stop killin' cops?\n\n[Hook]\nBaby, you'll let me know, you'll let me know\nYou'll let me know, you'll let me know\nYou'll let me know, you'll let me know\n\n[Verse 3: Jeremih]\nYeah, yeah\nNow tell me, can you stand up?\nKnowin' everybody can't stand us?\nDon't they know that hate is a cancer?\nAsk around, nobody got the answers\nNow tell me, can you stand up?\nKnowin' everybody can't stand us?\nDidn't know we was livin' in Orlando\nPeople dyin' with their hands up\nNow I hope the whole world\nWake up, wake up, wake up\nUhhh, wake up, wake up, wake up\n\n[Outro: Jeremih]\nLet me know\nLet me know\nSomebody let me know\nIf we gone wake up, wake up, wake up", "image": "https://images.genius.com/0c57d4c7da45430b44b6883ea9fd715f.500x500x1.jpg"}], "artist": "The Game"}