{"songs": [{"title": "Don’t Look at Me", "album": "World War 3, Vol. 2: Molly", "year": "2014-04-20", "lyrics": "[Intro: Gucci Mane]\nOn the cell with Meechy and he told me I’m the realest nigga\n*808 Mafia*\nYa... s'Gucci!\n*This beat is so-so Metro*\n\n[Verse 1: Gucci Mane]\nI’m a walking work of art, body marked, yeah it’s marked on\nGave me brain, bless her heart, I taped it on my smartphone\nKush cologne smelling like a bale plus a bale of strong\nPink foamposites same color the shit I’m drinking on\nDouble cup, styrofoam cup, man I’m going on\nGeeked up for a while so I rolled a blunt a mile long\nSpikes on my feet like they cleats, not an athlete\nChristian Louboutins to the wallet, bitch, don’t ask me\nI’m a King P, how you mistake me for a car thief\nMe, Peewee, Thugga, Young Duke and Chief Keef\nT.H.3 through the summer, bitch we off the leash\nTwo pair of Jordans in my trunk, got that .223\nBreast cancer supporter, I pour it up like Hennessy\nFuck nigga better say squad or he a enemy\nGot a show in Tennessee and I’ma charge them fifty G\nNigga say he’s headhunting, revolver the remedy\n\n[Hook: Young Thug]\nMy bitch got a body, she don’t speak no English\nThe Bentley on Bleveland, don’t look when you see me\nThat rarri on Mooreland, keep straight, don’t you look at me\nThem gators got syphilis, her diamonds from Tiffany’s\nLil bitch I’m a demon, they know I’m a flight risk\nI hold up my Rollie, I ice out my Breitling\nNow what do you call it, we balling so icy\nOur song is so icy, Bricksquad not nice bitch\n\n[Verse 2: Gucci Mane]\nCall me Guwop Macaroni\nMake you stick yourself like Tony, nigga\nStick yourself for me, nigga\nDon’t step on these ponies, nigga\nMonkey nuts on all my guns\nSo yeah them is my homies nigga\nI only fuck with killas, nigga\nDon’t fuck with phonies, nigga\nMob meeting with the clique like Lucky Luciano nigga\nMedusa head, Gianni, nigga, my shoes and belt is Pucci nigga\nWhy they call you Gucci Man and you head to toe Louie, nigga?\nLike James Harden, re’d up on mils but I don’t play for Houston, nigga\nOn the cell with Meechy and he told me I’m the realest nigga\nR.I.P. to Fat, shoutout to Webbie and free Boosie nigga\nThree mil I got crazy diamonds, mental institution, nigga\nZone 6 14 year old killers, this the revolution, nigga\nRacketeering and extortion and prostitution, nigga\nBentley just pulled over me and I’m on constitution, nigga\nYou hating, what you proving nigga?\nYo girl is a juicy nigga, you size me up, I fuck your bitch\nYou better not fuck with Gucci nigga\n\n[Hook]\nMy bitch got a body, she don’t speak no English\nThe Bentley on Bleveland, don’t look when you see me\nThat rarri on Mooreland, keep straight, don’t you look at me\nThem gators got syphilis, her diamonds from Tiffany’s\nLil bitch I’m a demon, they know I’m a flight risk\nI hold up my Rollie, I ice out my Breitling\nNow what do you call it, we balling so icy\nOur song is so icy, Bricksquad not nice bitch", "image": "https://images.genius.com/011337d1524813f4d2388f59889d0977.1000x1000x1.jpg"}], "artist": "Gucci Mane"}