{"songs": [{"title": "Family", "album": null, "year": null, "lyrics": "[Havoc]\nYo\n\nDunn you fam to me, and only family\nThat can get that close to me\nKeep it type strong\nBlowin green that's keepin us goin\nAllah Havoc gettin right, on them 747\n\nDunn you fam to me, and only family\nThat can get that close to me\nKeep it type strong\nBlowin green that's keepin us goin\nUnconditional love showin\n\nYo, yo, yo, yo\nForty decide, on the First side right\n\n[Prodigy]\nMe and my Dunns come from the slums\nYou can't take the slums out my Dunns\nAnd that's how it is, that's how we live\nSometimes I find myself wearin the same shit for days\nNot carin, bout what they gon' think or say\nI got that, \"I don't give a fuck\" in me, it's stuck in me\nThat's how I 'vantage over y'all niggas, y'all too pretty\nWe too gritty, like Sanford and Son (what)\nToo grimy like Pigpen with jewels on\nSee we the top rap niggas, the Q-Dogs\nYou got a lot of nerve, puttin out them songs\nKnowin that my niggas come strong, so let's get it on\nWe just gettin warm, Operation \"Quiet Storm\"\nSilent wars or we silence the fours\nHalf P and I's got it in the smash for sure\nNow it's movies and soundtracks\nThis is where your career stop at\n\n[Nas]\nAiyyo I drink to that\nI'm like a dictionary, y'all rappers exam me\nYou ballet? They read your obituary, in front your family\nYou should idolize Nas in the flesh\nDon't wait til I'm dead, to say I was the best, no doubt\nWe shot hoops with coathangers, got loot with dopeslangers\nSold soap to strangers, joked with danger\nRob prostitutes, dodge cops in hot pursuit\nBought weight from rosters, travel hot routes\nO.T. commute back and forth\nTell shorty get that package off\nFuck bein trapped up North, being told where to eat and shit\nCaught a case then I beat the shit\nTheives on the block flash badges, nylon jackets\nBig white boys with guns yellin, \"Freeze black kids!\"\nGot my niggas in the pen, eatin octopus\nWishin they was on the blocks with us\nTo watch me and P do it (uh) put the heat to it (uh)\nPut it out, first day, the whole street knew it\nBitches, hold they pussies and bop to the music\nAnd think deep to it, now who the truest?\n\n[Mobb Deep]\nYo\n\nDunn you fam to me, and only family\nThat can get that close to me\nKeep it type strong\nBlowin green that's keepin us goin\nAllah Havoc gettin right, on them 747\n\nDunn you fam to me, and only family\nThat can get that close to me\nKeep it type strong\nBlowin green that's keepin us goin\nUnconditional love showin\n\nYo you fam to me, and only family\nThat can get that close to me\nKeep it type strong\nBlowin green that's keepin us goin\nUnconditional love showin\n\nAre you fam to me, and only fam to me\nThat can get that close to me\nKeep it type strong\n\n[Prodigy]\nDirty fingernails, reachin in my pocket pullin knots out\nI daydream of better days, in different ways\nOut this lifestyle we live, iced out with the big fifth\nThat's why the burnt leather lean to the left\nEven though we gained cash on fish\nI'm trapped on reason bein we ain't all rich\nAnd I'ma be that same nigga for the door\nAnd I'ma still walk the same path, we soon clash\nWe get stacks, you do the math\nWe pound niggas out, walk away and laugh\nFresh from out the lab, P and Nastradamus kid\nRap niggas shit they drawers\n\n[Nas]\nYo they probably did\nI aircondition y'all niggas, my prediction is you rewind this\nYour highness, Q-Boro's finest\nClick your Timbs three times, the wizard is Nas\nGrant you a wish, you get rich while listenin hard\nTo my thugs in the prisonyard, bench-pressin 200 pounds and up\nFeelin like you down on your luck\nRaise up, I feel your pain, hit the law library\nAppeal the game, all eyes on me\nRestrained from, bein looked at, as uncivilized\nWe epitomize thug song, y'all niggas get mad\nJealous rappers is puss, ain't got no style\nNo heart and no look, shook\nGet stole on, my niggas move right in the moonlight\nY'all niggas get done, I pee on them son, they a small issue\nWe too official, blue steel pistols\nTeflon vests, it's no contest we hit you\n\n[Mobb Deep]\nDunn you fam to me, and only family\nThat can get that close to me\nKeep it type strong\nBlowin green that's keepin us goin\nUnconditional love showin\n\nYo, yo, yo, yo\nForty decide, Forty-First side right\n\nYeah youknahmsayin? Not for nuttin baby\nKnahmsayin wanna give a shout out to my peoples\nYouknowhatImean? Gamble, Ill Will\nKilla Black, my brother\nIt's never gonna be another\nWord up\n\nYeah, you know how we do things", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}