{"songs": [{"title": "You Can’t Kill Me", "album": "Hip Hop Is Dead", "year": "2006-12-19", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah y'all... New York City...\nTryna to see where I'ma go tonight...\nThe most famous town in the whole fuckin' world...\nThe other night, nigga was at Lotus...\nI hit P and them\nI was Dom P'ed up in there, you know...\nBut I found this new spot we went to the other night, yo\nCheck it out, check it out how it went\n\n[Verse 1]\nIt was just cool like, smooth night with my jewels bright\nGoons left, goons right, coupe with blue lights\nBad girls in black pearls, gave us cat calls\nTook 'em back to the crib to break they ass off\nIn the loft, mixing hash and dro\nHoney spreaded that asshole like a wide mouth bass\nSippin' wine out the glass, Teddy Pendergrass blast\nWhen the phone ring, the house lights flash\nTurned down the sound, let's get down to business\nShit about to go down with some foul niggas\nWhat the voice said, \"What up, pop? Who want it?\"\nI put the guap up, get the boy popped\nHe say \"Son, stop, it's dudes you feedin'\nWho feedin' other dudes, but they really not eatin'\"\nDog, why you callin' me? This our food\nYou handle the mouths that it trickles down to\nNiggas want beef, I want some of that cow too\nBut I'm in my princely robe, simply rich\nDon't bother me with silly shit, call Rico\nHe said \"It IS Rico, of all people\nGave his moms furs, called up the mayor\nTo get his crime pardoned, his son's godfather\"\nSaid the nigga shot up my cars\nLast night he laid for me to come out my doors?\n\n[Hook]\nNiggas always on that bullshit\nTo make a nigga wanna open up a full clip\nNiggas always on that bullshit\nNow your funeral, the preacher's at the pulpit\nNiggas always on that bullshit\nTo make a nigga wanna open up a full clip\nNiggas always on that bullshit\nNow your funeral, the preacher's at the pulpit\nYou can't kill me\n\n[Verse 2]\nHigh, fly, send a fella loaf or glass\nFold up cash, you ain't heard the soldier's half\nYou speakin' hogwash, silly shit, Balderdash\nI got the live sparked, Phillies lit, smoker's jacket on\nThe son of a Cap-ricorn, my dad's a don\nWhat you think that he spawned? A slacker? Nah\nPacked the 9's, yo this nigga's asinine\nSmack your mom, relaxed and calm, then mack your mom\nIn a casket, you'll get your fashion on\nYou'll be in a suit and tie, you'll die\nYou'll make maggots turn to flies, fuckin' with Nas\nRemember anyone can get it at anytime\nLames'll swear by your name, when they lie\nGet hit with the lone star, ripped where your bones are\nSo tell me how yo' ass gon' run, from a C-Z-P-O-1?\nIn the midst of real steel movers, you a loser\nMerk you wit your own shooters\nAll you want is a name, pissed and insane\nMy security system, my playspot a fireplace, listen\nThen it goin' off, start spittin'\nNiggas try to bring it where I live in\nTrustin' you, knew where all of the cribs at\nSo we waited with the Sigs, blat, blat, blat!\n\n[Hook]\nNiggas always on that bullshit\nTo make a nigga wanna open up a full clip\nNiggas always on that bullshit\nNow your funeral, the preacher's at the pulpit\nNiggas always on that bullshit\nTo make a nigga wanna open up a full clip\nNiggas always on that bullshit\nNow your funeral, the preacher's at the pulpit\nYou can't kill me\n\n{*\"You can't kill me\" to fade*}", "image": "https://images.genius.com/ff6738f83747060eafd4a7af4964cd8f.1000x1000x1.jpg"}], "artist": "Nas"}