{"songs": [{"title": "Once Bitten, Twice Shy", "album": "Detroit", "year": "2012-09-05", "lyrics": "[Chorus]\nI know, I know, I know, I know, I know, I know, I know\nI made mistakes but I'm just man enough to say\nThere's no turning back now\nThere's no turning back now\nI know, I know, I know, I know, I know, I know, I know\nI made mistakes but I'm just man enough to say\nThere's no turning back now\nThere's no turning back now\n\n[Verse 1]\nTequila glasses, shots to the head cuz some memories they need assassins\nGot a quarter pound of purp an eighth of gin and half my friends\nGone, Gone\nMan fuck it though, not too good with fractions\nTried to do it all on my own, not too good with asking\nCuz when people give you a hand they want an audience back\nBut they not clapping and standing, they clapping at me let's panic\nPop pop that AK take candids\nI aim for the sky, never landed\nAnd yup\nI look up up up in the mirror, I see a nigga gettin' rich off me\nHmm, and look at all these mother fuckers trynna get rich off me\nBut they wasn't there not when times got heavy man when things got deadly\nBefore my cash flow broke that levy man we ain't have no heat in that broke ass Chevy\nComing from a city where dreams get shredded, I'm goin' off credit, these niggas need debit\nMade mistakes but they made me what I am and I am what I am and I don't regret it\nAnd I found the girl that I'd marry, the only curse\nIs that I keep running into the girls that I'd fuck first\n\n[Bridge]\nBut that's the, lifestyle of the big big dogs\nFor everything you love and want, would you trade it all?\nWould you trade it all? For everything you love and more, would you trade it all?\nI mean a, big house, life you never saw, for everything you want and love, would you trade it all?\nWould you trade it all?\nFor everything you know, are you down to let it go?\nFuck nah\nTrynna make it out a city where niggas don't make it out\nAnd if you do they want the blueprint so they can try and trace it out\nThey got that work, and thank God for yay\nSigned to G.O.O.D, thank God for Ye\nBefore it's all said and done the one thing that I gotta say is\n\n[Chorus]\nI know, I know, I know, I know, I know, I know, I know\nI made mistakes but I'm just man enough to say\nThere's no turning back now\nThere's no turning back now\nI know, I know, I know, I know, I know, I know, I know\nI made mistakes but I'm just man enough to say\nThere's no turning back now\nThere's no turning back now\n\n[Verse 2]\nMan I miss my grandma, she ain't passed away or nothin', I'm just busy on camera\nI love her, I love her, I should call her up and tell her\nGive her some flowers, while she can still smell em\nWhile she can still smell em, If you love somebody please tell em\nI swear if you had 24 hours tell me who or what you'd do\nWould you spend it all with your fam or would you get high with your crew?\nWould you go back to your old girl and let her know that it's true?\nWould you go back to your old boss and piss all over his shoes?\nWould you, try and make the news? Would you get paid? Would you try to pay your dues?\nWould you step it up or would you try and change shoes? Do you believe in karma or living for tomorrow?\nWould you, hit the bar and go binging? Would you, steal a car, Mercedez Benz? and\nWould you die alone, would you die independent? Or would have your friends right there in attendance\nWhen it's all finished\nGuess that depends on how you live\nJust pray that all of your wrongs don't overshadow all that you did\n\n[Bridge]\nBut that's the, lifestyle of the big big dogs\nFor everything you love and want, would you trade it all?\nWould you trade it all? For everything you love and more, would you trade it all?\nI mean a, big house, life you never saw, for everything you want and love, would you trade it all?\nWould you trade it all?\nFor everything you know, are you down to let it go?\n\n[Chorus]\nI know, I know, I know, I know, I know, I know, I know\nI made mistakes but I'm just man enough to say\nThere's no turning back now\nThere's no turning back now\nI know, I know, I know, I know, I know, I know, I know\nI made mistakes but I'm just man enough to say\nThere's no turning back now\nThere's no turning back now", "image": "https://images.genius.com/6b6ac4eb55acf7dda757b1f6c6081c31.500x500x1.jpg"}], "artist": "Big Sean"}