{"songs": [{"title": "The Ruler’s Back", "album": "The Great Adventures of Slick Rick", "year": null, "lyrics": "\"Halt, who goes yonder?\"\n\"It is I, sire, Richard of Nottingham\"\n\"Well, speak up man, what is it?\"\n\"News from the east, sire, Rick the Ruler has returned!\"\n\nScratches: Stop Lyin'!\n\nGather 'round party goers as if your still livin'\nAnd get on down to the old Slick rhythm\nNow this one here is called the Ruler my dear\nIt's a mere party booster that will set things clear\nIt's a hundred percent proof from champions of truth\nAnd if you feel you need spirit I'll bring back your youth\nRelax your mind, and folks unwind\nAnd be kind to a rhythm that you hardly find\nAnd off we go, let the trumpets blow\nWell hold on, because the driver of the mission is a pro\nThe Ruler's back\n\nNow in these times, well, at least to me\nThere's a lot of people out here tryin' to sound like Ricky D\nNot tryin' to cause trouble cause it's really a small thing\nBut they're bitin' what I'm writin'\nGod it's great being the king\nSome sound alright, but then they act illy\nTry conquering my crown and that's really very silly\nNow I'm not the type that gets upset\nTry to disrespect folks just to earn respect\nBut learn this fact, whether white or black\nI can't get conquered in my style of rap\nFor jealousy and envy are dumb ones' tools\nSo Ricky says nothing, he keeps his cool\nRevenge is not a mission that the Ruler's on\nJust forgiveness required for the wrong that's done\nSo off we go, let the trumpets blow\nAnd hold on, because the driver of the mission is a pro\nThe Ruler's back\n\nScratches: Hit it!\n\nNow one day when I was chillin' at this outside jam\nI seen folks havin' a ball and plus clappin' their hands\nTo beats of records that conquer the streets\nLike Pee Wee Herman and Clubhouse Treats\nGirls was chillin', boys rule as usual\nThe slacks, the golds, the rings, I hope I'm not confusin' y'all\nBut everyone in the house looks smashin'\nFresh clothes on their butts and nothing out of fashion\nAnd just when you thought nothing couldn't get better\nA news flash concealed in a bright yellow letter\nA kid ran up to the mike and said \"Alert, hear this,\"\nCleared his crummy throat and then began to persist\nHe said \"Hallelujah, kids hear this\nThe Ruler's back and he's here to assist\"\nSo off we go, let the trumpets blow\nAnd hold on because the driver of the mission is a pro\nThe Ruler's back\n\nScratches: Stop Lyin'!", "image": "https://images.genius.com/09b48445ade4e1b5e75781bcfa6eb3c6.924x924x1.jpg"}], "artist": "Slick Rick"}