{"songs": [{"title": "Street Dreams II", "album": "YSIV", "year": "2018-09-28", "lyrics": "[Verse 1]\nUh, suddenly I'm in the whip, with the gat, full clip\nOut the blue, like a crip, doin' 90 on the backroad\nOutta nowhere my girl hit me on the bat phone\nI could hear it in her voice, know she just wasn't alone\nThen a voice I didn't recognize\nSaid \"If you wanna' see your wife alive, bring a million in cash and she's gonna survive\"\nLook at the clock, pitch black, it's 11:05\nHung up the phone, you know I put that shit in hyper-drive\nThen I call my homie 6ix to tell him I'ma need his help\nI'ma be outside in five, get the gat under ya belt\nThen I felt the sweat from my palm on the steering wheel\nI tried to shake it, man, I can't believe this shit is real\nHeart pumping on the 101, this shit right here ain't no fun\nLive and die by the gun, get you some\nYeah, I pull up to the crib, pick up 6ix, now we out this bitch\nOnly thing that's on my mind is \"Put this fucker in a ditch\"\nSoon as I get there, boy, I'm lightin' up that ass\nI'ma fill him with lead and they never finna count the cash\n'Til I look up at the dash and realize I'm out of gas\nSo I stopped at the station, piss like probation\nTell my boy to fill up as I head inside to pay\nOpen the door and see a white guy at the counter named Clay\nPull out a 50 and told him to hurry\nHe movin' slow like he ain't got a worry in the world\nAnd a attitude; maybe I was actin' rude\nHold up, if the person you love was kidnapped, what would you do?\nHe saw my gat in my jacket and froze\nI told him I ain't want no problem but he chose\nTo reach for the shotty anyway, so I blew him away\nJust tryna get some gas, now his brain's blast (uh)\nFrozen, thinkin' 'bout what just happened, now it's in the past\nJump in the whip 0 to 60, yeah, we out fast\nSee that red and blue flash, damn, the cops is on my ass (*Sirens*)\nHear them sirens, flashing lights in my rear view\nThis shit like a movie in a theater near you\n120 now, I feel like OJ\n(The cops are gonna get us)\nNo they won't, everything will be okay\nSwerve left, swerve right, now they almost out of sight\nFinna pull under the bridge, they won't spot me here at night\nSlow it down, play it cool, mama, she ain't raised no fool\nSit back, breathe slow, (Holy shit!), there they go\nMan they found us, I don't know how but they came around us\nFuck the police, no, they never do astound us\nIn the back of my mind, I know I gotta get the cash\nIt's in my secret stash, wish I had another path\nOut the window I can hear the bullets blast, wish I had a mask (*Gunshots*)\nMake it to the crib, that's my only task\nAdrenaline in my body, could take on anybody\nComing down to the wire, they blew my tire then we flip\n\n[Interlude]\n*Car crash*\nFreeze you motherfucker! (*Gunshots*)\n6ix, come on get up!\nI'm shot, I'm shot! What? I'm shot! (*Gunshots*)\nGet the fuck on the ground!\nAww, fuck, fuck!\nThey got me!\n\n[Verse 2]\nHe bleedin' slow, blood dripping from his torso\nWill he ever get to see his son grow?\nWhat's the picture they gon' paint after he go?\nLast song he ever sung when the bullet hit his lung\nMan, I shoulda never called, he'd be alive if he ain't come\nAll he tried to do was help save my wife\nWish I could've saved his life, I wish I could take it back\nNow my best friend's life curtain call, fade to black\nIt just ain't no turning back, pulled out the gat\nAnd put a bullet through the man in blue and it came out his back\nJump in the whip, no looking back\nFirst time in the front seat of that white and black\nSide streets through the city, ain't nobody fucking with me\nYeah, you know I had to duck 'em all, screamin' \"Motherfuck the law\"\nNext thing I saw was a block from my crib\nThinkin' 'bout my shorty, she my rib\nPull up in the driveway\nNo cops in sight but just might somehow pull up my way\nOpen the stash, get the cash, now I'm back out\nSo I put the Audi in reverse and then I back out\nLook at the addy in the text with my girl whereabouts\nFive minutes later, now I'm creeping in a warehouse\nLot of goons, lot of guns, now I'm shooting just for fun\nI don't give a fuck where they come from, I'm killing everyone\nFinally make it to the back, all alone, pitch black\nHear a sound, what was that? Think it came from over there\nLights on, now I see my wife, she's tied up to a chair\nWith a gun to her head and a man gripping her hair\nAll I did was stop and stare, he took the gag out of her mouth\nAnd she started calling my name (Bobby!) but didn't seem to be in pain\nReally shaken up (Bobby!), I felt like I was waking up\nSo I shot him quick in the neck and he hit the floor (Bobby)\nBefore I untied her, I shot him four more times\nPut a bullet in his spine, was he dead? (Bobby!) Let's see (Bobby!)\nStaring at the man, gun in his hand, it couldn't be (Bobby!)\nThe man who kidnapped my wife (Bobby!) was me (Bobby!)\n\n[Outro: Logic & Kevin Randolph]\nBobby!\nWhat? What—what?\nMan, get your ass up nigga, we at the studio!\nSay what?\nDamn, man. C'mon, hurry up, man! What's wrong with you?\nWake up, here. Come on\nWait, we're at the studio right now? We're here already?\nDamn, man, since you started smoking weed you always fucking late!\nMan, shut the fuck up Kev\nStoney Bob neck ass", "image": "https://images.genius.com/04d1c970904a534f622b012d9599fc9b.440x440x1.jpg"}], "artist": "Logic"}