{"songs": [{"title": "So Gone", "album": null, "year": null, "lyrics": "Shut Up!\n\n[Hook: Johnny Julianno]\nWho am I, I'm doing mine\nGave me the chance; I won't letcha go\nI wanna be more than just sexual\nBut every time I'm so gone\nGone -on -on , soo gone\nCause you gone, it's forever now\n\n[Verse 1: Lil Wayne]\nYoung Mula Baby\nI'm a blood, I'm a pro, I'm a G\nIn a different world, outerspace with a freak\nBut that don't mean Neptune on the beat\nCause its Nu Jerzey Devil from Black Wall Street\nWeezy F baby from Young Money baby\nLike the Easter bunny, baby wanted my candy\nSo I gave her my lollipop then she made her body pop\nThen that made me kinda hot\nI'm lying that made me sauna hot\nBut please stop sweatin on me, women scream \"get in me\"\nAnd what do I do I get in 'em , I put on my boots and I step in 'em\nRight left in em Mr. Excedrin\nHead all the time, it may sound crazy but I got head on my mind\nLay it on the line or just lay on young Carter!\nAnd yeah I hear you screaming but my name ain't harder!\nGirl I'm nasty I do my thing and have you calling for me like Lassie\n\n[Hook]\n\n[Verse 2: Nu Jersey Devil]\nI'mma flirt man I really don't care\nI tell the women whatever they wann hear\nMommy I'm balling I'm so sincere\nIs that your home girl sitting right there\nShe can be my monday\nYou can be my tuesday\nAfter shorty done I can squeeze ya'll in today\nThree is not a crowd I don't care what you say\nMy women come in twos like shoes with a cute face!\nMy girl gotta girlfriend, her girl gotta girlfriend\nBring her to the crib I'm a show you how I work it\nLittle man in the boat here come the serpeants\nSlide your body down the pole and let me see you twerk it\nI'm with my thursday junk she a real freak\nA hundred grand fitting right up in her butt cheek\nMrs friday go easy cause she just learnin\nBut saturday be having mr devil's toes curlin\n\n[Hook]", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}