{"songs": [{"title": "Dope!", "album": "Layers", "year": "2016-04-15", "lyrics": "[Intro: Lincoln &  Porsche]\nHello\nHey Lincoln\nHey Porsche what's up\nHey baby what's up\nNah nothing much, what's up with you?\nNah nothing, got this broke ass nigga outside\nOh y'all about to go out? Hang?\nI ain't going out for long\nProbably cause he don't be blowing no good\nNaw baby he ain't like you, he don't be blowing no good\nHaha well shit I got hotpockets in the oven, what you need?\nI wanna see you later\nWell my son do got a basketball game later on, but that lil nigga ain't even starting so\nYou so crazy\nYeah I'm...I can save that gas, I'll be through there\n\n[Verse 1]\nI been waiting in this bitch driveway for an hour my nigga, hell no\nThere's only one way I can fix this problem my nigga, that's sell dope\nI ain't come in this bitch to politic or rub elbows\nEven my own bitch know I'm mentally unavailable, I'm busy, I sell dope\nI'm focused, I'm focused, I'm focused on three things\nThat's go and buy three chains, that's fuck your bitch at my earliest convenience and sell dope\nWhen I'm with her she creeping on you, when I hit it I hit it with my phone on speaker phone\nWhile she's moaning I'm still tryna, tryna sell dope\nMy teacher asked me what I wanna do when I grow up, I told her \"Bitch, sell dope\"\nShe told me go to the principal's office, I went to go sell dope\nI don't care about y'all, what y'all wear, where y'all been\nAll I know is I'm fresh as fuck from head to toe\nIf you don't like it you can get the fuck out my car\nGo over there somewhere and ride Pierre Cardin (You rude)\nAnd when you see that bum make sure you tell him I said that I sell dope\nFor all the times I was dead broke\nSpeaking of dead, when I die, I swear I'mma try, I'mma still try to sell dope, sell dope\n\n[Hook 1]\nThere's no other life out here I know\nSo I guess I should...\nSell dope\nThis is the only life for me\nSo I...\nSell dope\nThe nights are long and cold\nLong and cold\nBut out here on these streets you'd swear I had pure gold\nPure gold\nIn my hands I hold your hope\nNigga cause I...\nSell dope\n\n[Verse 2]\nThis bitch told me I can't get them digits my nigga, my nigga, aw hell no\nIt's only one way I'mma fix this my nigga, that's sell dope\nA fan asked me for a picture, I squatted down for a jail pose\nThen I dashed before the flash could finish, I forgot I had to go sell dope\nWhat news you got, if it ain't about selling dope, I can't take it\nThe doctor gave me five months to live, I told her \"Nigga, I can't make it\"\nTell whoever set my expiring date I had a prior engagement to sell dope\nThat's why I'm in every discussion, I could sell a whale a bucket\nOf well water, I could sell Harriot Tubman a mothafuckin' railroad\nI'm the flower with the thorn rising out the concrete, y'all just born on Melrose\nI stay strapped, I stay strapped like velcro\nWhen I meet new people I introduce myself as \"I sell dope\"\nI just had a job interview, they asked if I ever been to jail before\nI said \"Yes\" then I got up and left, like fuck this shit I'mma sell dope\nCause right now I'm dead broke\nSpeaking of dead, when I die, I swear I'mma try, I'mma still try to sell dope, I'mma try to sell dope\n\n[Hook 2]\nThere's no other life out here I know\nSo I should...\nSell dope\nThis is the only life I know\nThe nights are long and cold\nLong and cold\nBut out here on these streets you'd swear I had pure gold\nPure gold\nIn my hands I hold your hope\nNigga cause I...\nSell dope\n\n[Outro]\nAmerica, America, God shed His grace on thee\nAmerica, America, when will we all be free?\n(I say it every day of my life God bless America)", "image": "https://images.genius.com/533ac062d389201c4e7eb9a973709ea4.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}