{"songs": [{"title": "Mobb Deep", "album": "The Safe Is Cracked", "year": "2009-04-07", "lyrics": "[Interview: DJ Envy & Prodigy]\nYup, you know what it is, the people's choice DJ Envy\nGot Prodigy on the line\nProdigy, what it is?\nYeah, what's poppin' yo?\nWhat's poppin', kid?\nHow's everything?\nEverything's good, man\nYou know I'm holdin' it down\nYou holdin' up everything good?\nYeah, yeah, you know, hangin' in there, doin' what I gotta do\nAight, now we gotta talk about you bloggin' in-in jail\nNow, how are you online bloggin', P?\nLike, how was that possible?\nI mean, basically, I just send the letters home, know what I'm sayin'?\nThen my wife does it\nOh, oh-oh, so wifey's helpin' along\nYeah, you know what I mean?\nI write it out\nSo-so wifey's the fingers and you just the mind?\nYeah, basically, I write it out and mail it to her\nAnd she get it up online\nNow, the blog before you went in, you were talkin' about a lot of different artists and how you really felt about them\nAnd, uh, recently Max B had some things to say to-say about you and things like that\nNow, r-rumor has it that you're kind of like Tony Soprano in prison\nI mean, man, I'm just doin' me, man\nNo, he-he ain't nothin' like that, you know hat I'm sayin'?\nMax B he-he runnin' his mouth, man\nYou know, I ain't put no word out or nothin' like that\nOkay, 'cause-'cause Max B did hit over the head with a bottle at a club\nYeah, that happened on his own, know what I'm sayin'?\nOkay\nMy people just took that into they own hands, know what I mean?\nThat-that's your story, I'm stickin' with it\nI'm rockin' wit'chu, P, I'm rockin' wit-chu, totally\nWord\nHehehe\nNow, some of the other rappers out that, you know, had words for you and things like that, what do you say to those individuals?\nI mean, I would basically say, man, you know\nJust do what you do, man\nDon't worry about what P's doin', man\nKnow what I mean?\nBefore you be holdin' your head like Max B\nOkay, okay, okay, 'cause you'll be holdin' your head like Max B\nProdigy is crazy", "image": "https://images.genius.com/44af96f2b9ad8fc8d0ca282d31af21fd.1000x1000x1.jpg"}], "artist": "Mobb Deep"}