{"songs": [{"title": "Taking My Ball", "album": "Relapse: Refill", "year": "2009-12-21", "lyrics": "[Intro]\nYo, Dre Man\nMake my vocals sound sexy... woo!\nCome on, man, come on, man, okay\n\n[Chorus]\nIt feels so wrong 'cause it feels so right\nBut it's all right, it's okay with me\nI'll do my steps all by myself\nI don't need nobody to play with me\nBut if you just give me a chance\nI can put you in a trance the way I dance\nBut don't nobody wanna play with me\nSo I'm taking my ball and going home, home\n\n[Verse 1: Eminem]\nI'm that guy man, shove a diamond up my hind end\nAnd crush it with my butt muscles while I cut vocals\nSlut poke holes in ya shirt, jump in mud puddles\nWhile I stomp mudholes in ya ass girl, now let's cuddle\nBlood curdlin', you're gurglin' on your blood, what'll\nI do for my next trick? I'm feelin' wonderful\nI think I might just do somethin' a little less subtle\nShove a fuckin' Tonka truck up a little kid's butthole\nFeel the wrath of a psychopath slash ambassador\nOf the Valentine's Day Massacre slash assassin\nI slash her in the ass with a icicle\nAnd leave her layin' a blood bath while I\nPut a catheter in and jump in the bath with her\nIn my Spider-Man mask, man\nJust imagine the fun I can have with a strap-on\nStick it up Kim Kardashian's ass and make the bitch run a triathlon\nAre those pistachios? Damn, I'd like to have some\nLaying on the patio, man, rolling a fat one\nShady, drop the magic marker, put the cap on\nGoddamn, man, are you that much of an asshole?\n\n[Chorus]\nIt feels so wrong 'cause it feels so right\nBut it's all right, it's okay with me\nI'll do my steps all by myself\nI don't need nobody to play with me\nBut if you just give me a chance\nI can put you in a trance the way I dance\nBut don't nobody wanna play with me\nSo I'm taking my ball and going home, home\n\n[Verse 2: Eminem]\nI'm like Houdini, tuck my teenie eenie weenie between each\nOne of my thighs and make it disappear like a genie\nMake the shit disappear like Tara Reid in a bikini\nBelieve me, homie, you don't know the meaning of a meanie\nThey call me the fruit loop from Jupiter\nI'm tryna maneuver the Hoover up in your poop shoot\nDon't move or ya might get it stuck so fuckin' far up in your uvula\nYou ain't gonna know what he was tryna do to ya gluteus\nTotally tubular, sniffin' glue through a tube in the studio\nNow who do ya think is more fruitier?\nWiener smothered in peanut butter, puttin' on a tube of ya\nEye shadow and man, it looked nice, you should've seen it, mother\nI think I'll put a piece of art on my Visa card\nThen I'll go beat Mischa Barton with a Cuisinart\nThen mosey on over to Rosie O'Donnell's with McDonald's\nJump on her lap and watch The Sopranos\n\n[Chorus]\nIt feels so wrong 'cause it feels so right\nBut it's all right, it's okay with me\nI'll do my steps all by myself\nI don't need nobody to play with me\nBut if you just give me a chance\nI can put you in a trance the way I dance\nBut don't nobody wanna play with me\nSo I'm taking my ball and going home, home\n\n[Verse 3: Eminem]\nShady, what are you doin' chewin' on a human?\nGrab an aluminum bat, hit Heidi Klum in the back, boom!\nAnd assumin' the fact that that dude's in the back room\nUsin' the bathroom, vacuumin' a raccoon\nSkewin' a rat, a cat screwin' a baboon\nYou shouldn't ask what is he doin' with that broom\nYou should be glad he ain't leave you full of stab wounds\nYou in a trance, I'm back doing my dance, ooh\nBut they're afraid I might get Sarah Palin by the hair\nAnd make her wear a bathin' suit and take her parasailin'\nShady, why do you gotta pick on the lady for?\nWhy you make her read 84 bedtime stories to you in baby talk?\n'Cause I'm scared there's monsters under my bed\nKellie Pickler hid my juice box under my bassinet\nNo wonder my ass is wet, my diaper needs to be changed\nYou like graffiti, dyke? Well, I can pee-pee and write your name\n\n[Chorus]\nIt feels so wrong 'cause it feels so right\nBut it's all right, it's okay with me\nI'll do my steps all by myself\nI don't need nobody to play with me\nBut if you just give me a chance\nI can put you in a trance the way I dance\nBut don't nobody wanna play with me\nSo I'm taking my ball and going home, home\n\n[Outro]\nFine, nobody wants to play with me?\nFuck you then, bitch!\nYou guys are always mean to me anyways\nAll you ever do is rub gum in my hair and stuff\nYou guys are gonna make me... make me sad, I'm sad\nI'm gonna cry... I'm crying\nI'm going to tell my mom... Mom!", "image": "https://images.genius.com/359763f457fb02b0c04642b2422c031f.1000x1000x1.jpg"}], "artist": "Eminem"}