{"songs": [{"title": "Get It Wet", "album": "Adrenaline Rush", "year": "1997-06-24", "lyrics": "[Verse 1: Twista]\nDear love I was thinking how I should be starting this\nMagnificent ways to light your life up like an arsonist\nPut my heart in this\nTicklin' you funny but when we start to kiss, marvelous\nHow I see you in the cut chillin' with your homies gettin' fucked up\nI got fantasies of you carrying me home\nHope that you stayin' alone\nI'm into givin' pleasure echoin' rhythms of my manly moans\nDon't be playin' me wrong, I'm too grown for games\nMental manipulation ain't the occupation for the playa you facin' I'm strong 'cause you see I don't be really quite comin' on the same\nBoldly and bodily fluids with every word that 'curs\nGirl you deserve some herb and company to be with\nFuck whoever you was gon' leave with\nI'm who you should see shit\nI found us some love like Adam and Eve shit\nWho you should be with, your body I squeeze quick\nStick through the sheets and your arms\nAnd see, so don't be alarmed\nIf I make you feel good all over\n'Cause I was strapping the bomb\nThat's 'cause I'm gonna be on\nEven though niggas in the hood is all soldiers\nYou still'll suffer the consequences defenseless\nThinkin' about becomin' my wife\nIf I rock you tonight you be the love of my life\n'Cause I be huggin' you like I'm huggin' the mic\nPlus I'm the one that's rubbin' you right\nAnd able to stick my tongue off in your navel and lick 'til you drop\nEven though I like to stick to twat\nI'm realizin' there's a variation of ways I can get you hot\nI'm into learnin' you so pick the spot\nI'll get pleasure too but let me hush and make the lust get a check\nI know you don't want me to hit it yet\nBut don't actin' like its a crime 'cause it hasn't been committed yet\nBut baby won't you let me get it what? Get it wet\n\n[Chorus: Twista and (Victoria Johnson)]\n(Get it wet)\nGimme some Tang and Alizé\nLet me tickle your body, after the party we can pleasure\nWill you come on, let me\n(Get it wet)\nLet me saturate you body with honey and lick it up, stick it up\nAfter release and let it 'rupt, is it enough to\n(Get it wet)\nTry to marinate your mind\nWhat's up? Am I deserving your love?\nJust 'cause we up in the club\nDon't think you bogus if you let me\n(Get it wet)\nBut you be the only one that I be thinkin' of\nGimme a hug, you got me sprung in love\n\n[Verse 2: Ms. Kane]\nLast time I heard you was playing with emotions and po' pimpin'\nAll up in the clubs smokin' doves fuckin' hella women\nNow negro, what's your steelo you want to get with me though\nThen add up them zeros and lo-dos\nYou ain't no 'bout them weed needs, (huh?)\nPussy feeds (what?) lex keys (damn!) for Mrs. Kane\nSee a half is for my mommy, fuck Tommy\nHe ain't tryin to ask naughty\nSmooth head got you right in the bed\nYou need another lover like you need a hole in the head\nInstead of all this talkin' let your tongue do the walkin' on down this clitoris\nFuckin' with a wild hundreds bitch\nAin't that some shit?\nGuaranteed to get you wet, simple kiss from petite lips\nIt won't take a gang of gifts just to hit this\nCome and take a little glimpse of the sweet hips\nWhen that ass in the air cause an eclipse, on the freak shit\nWhat you know about this slick clit\nSend you in a thang when you feel this\nBitch, far from a virgin and sip a Burbon get the derb\nAnd leave you hurtin' for certain\nSteady splurgin' when I'm servin', get you wetter than a Persian\nThe X-rated version\nI'm urgin' but I ain't thinkin' you can get it yet\nBut if you good in a minute you can get it what? Get it wet\n\n[Chorus: Twista and (Victoria Johnson)]\n(Get it wet)\nGimme some Tang and Alizé\nLet me tickle your body, after the party we can pleasure\nWill you come on, let me\n(Get it wet)\nLet me saturate you body with honey and lick it up, stick it up\nAfter release and let it 'rupt, is it enough to\n(Get it wet)\nTry to marinate your mind\nWhat's up? Am I deserving your love?\nJust 'cause we up in the club\nDon't think you bogus if you let me\n(Get it wet)\nBut you be the only one that I be thinkin' of\nGimme a hug, you got me sprung in love\n\n[Verse 3: Twista]\nMmm, mmm, mmm, mmm\nGot to be more careful don't hurt 'em girl, you sexy when you mad\nThen nigga come hurt me baby wet me with a splash\nAggressive loving I've never had\nAs I enter the scene with bedroom eyes, Obsession cologne on, Nautica robe on\nFlamin' up, trippin' while stanky roll on\nHerringbone on gettin' my pose on to the dome strong\nTake a sip of liquor, I'm on bone\nHuggin you like I ain't seen you in so long,  what's up girl?\nI execute my unique approach who I be the most\nWillin' to learn and try to be like I got some experience\nIf you need a coach or we can ride tonight\nAnd kick it like the homies, who? Me and only you\nSmoke Bs up like a cigarette 'till I can only see a silhouette\nAnd even though you won't admit it yet\nI can tell what time you eventually'll wanna let me get it what?\nGet it wet\n\n[Chorus: Twista and (Victoria Johnson)]\n(Get it wet)\nGimme some Tang and Alizé\nLet me tickle your body, after the party we can pleasure\nWill you come on, let me\n(Get it wet)\nLet me saturate you body with honey and lick it up, stick it up\nAfter release and let it 'rupt, is it enough to\n(Get it wet)\nTry to marinate your mind\nWhat's up? Am I deserving your love?\nJust 'cause we up in the club\nDon't think you bogus if you let me\n(Get it wet)\nBut you be the only one that I be thinkin' of\nGimme a hug, you got me sprung in love", "image": "https://images.genius.com/d3d24875934a3f4e43760767e5f7584d.1000x1000x1.jpg"}], "artist": "Twista"}