{"songs": [{"title": "Still I Rise", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Verse 1]\nShe said \"fuck Fendi\" but I think she was playin'\nI heard she move them thangs, I think she fuckin' Wayne\nShe call herself Lewinsky, that means she give him brain\nShe tryna be like Lil' Kim; her picture looks the same\nWhy she ain't signed with G-Unit, she from Queens, right?\nAnd what's her nationality? She Chinese, right?\nI mean she okay, but she ain't all that\nShe ain't the next bitch, tell that bitch fall back\nSee I'm a hater, I go hard, listen, let's begin\nYou know her last name Minaj? She a lesbian\nAnd she ain't never comin' out, look at Currensy\nBut every time she do an interview, you know I run and see\nShe get me so sick, it make me vomit\nThat's why I spend my time online, leaving comments\nAnd you know, that I got some more haters with me, might hit up This Is 50\nMTV, hit up BET, tell 'em pretty, pretty please don't play Nicki\n\n[Chorus]\nStill I rise, still I fight\nStill I might crack a smile\nKeep my eyes on the prize\nSee my haters, tell 'em hi\nOne day you'll remember this\nOne day when we reminisce\nNothing I do ever is good enough for the music biz\nStill I rise, still I fight\nStill I might crack a smile\nKeep my eyes on the prize\nSee my haters, tell 'em hi\nOne day you'll remember this\nOne day when we reminisce\nNothing I do ever is good enough for the music biz\n(Nothing I do is good enough for you)\n\n[Verse 2]\nBitches is like crabs in a bucket\nYou see a bad bitch gettin' shine, you should love it\nCause every time a door opens, for me that means you\nJust got a better opportunity, to do you\nThey don't understand, these labels look at numbers, it's statistics\nI lose, you lose, ma, it's just logistics\nAnyway, real bitches listen when I'm speakin'\nCause if Nicki win, then all of y'all gettin' meetings\nAsk L.A. Reid, ask Jay\nThen hit up Universal, see what Sylvia Rhone say\nAsk Craig Kallman, you can ask Chris\n– Lighty, when you're done, just salute a bad bitch\nOnly underground bitch around that's ducking the paparazzi\nIn and outta town, be swervin' the Maserati\nStay around the white like a Nazi\nPussy p-p-popping on my poppers so the cops see, bitches\n\n[Chorus]\nStill I rise, still I fight\nStill I might crack a smile (Still I might)\nKeep my eyes on the prize\nSee my haters, tell 'em hi (I'mma keep my eyes on the price, oh, oh)\nOne day you'll remember this\nOne day when we reminisce\nNothing I do ever is good enough for the music biz\nStill I rise, still I fight\nStill I might crack a smile\nKeep my eyes on the prize\nSee my haters, tell 'em hi (tell 'em hi from me)\nOne day you'll remember this\nOne day when we reminisce (when we reminisce, reminisce, baby)\nNothing I do ever is good enough for the music biz", "image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg"}], "artist": "Nicki Minaj"}