{"songs": [{"title": "LL Cool J", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Intro: LL Cool J]\nAyo Bimmy\nSo rock the bells, Def Jam collabo' man\nYou know'say, Bim...my...yeah\nFeel It's baby, (uh) ha (uh) ha (uh) ha (uh) ha ha\n\n[Chorus: LL Cool J & Kandice Love]\n(L) I'm the G.O.A.T. I just ball a lot (L)\nAnd (Cool J) I'm double platinum on the hot blocks and\n(L) the hottest nigga in the whole spot (L)\nAnd (Cool J) you see my hand not what I got and\n(L) Strictly evil in the big box (L)\nAnd (Cool J) It's no stoppin' when my shit knocks and\n(L) Get it all baby don't stop (L)\nAnd (Cool J) don't move the bottle let the corks pop\n\n[Verse 1: LL Cool J]\nI'm incredible, well nigga, outrageous\nTurn money like encyclopedia pages\nGet freaky throw dyke bitches in cages\nPaid in full European shit fuck Avis\nRocks in ears, blingin' the atmosphere\nFuck Canibus I bodied him last year\nBut the L still here watch face crystal clear\nThe other chick will give me heat while I shampoo her hair\nHead tilted back baby no more tears\nYou mumblin' and shit duke my flow more clear\nBaby listen here, I been gettin' paper for years\nAnd program directors who fronted they disappear\nAnd grimy ass niggas get laced with car bombs\nFor bein' over-critical when Uncle get it on\nI'll burn your magazine, GOD'll intervene\nCan't front on this hip-hop phenomenon from Queens (I'm)\n\n[Chorus: LL Cool J & Kandice Love]\n(L) I'm the G.O.A.T. I just ball a lot (L)\nAnd (Cool J) I'm double platinum on the hot blocks and\n(L) the hottest nigga in the whole spot (L)\nAnd (Cool J) you see my hand not what I got and\n(L) Strictly evil in the big box (L)\nAnd (Cool J) It's no stoppin' when my shit knocks and\n(L) Get it all baby don't stop (L)\nAnd (Cool J) don't move the bottle let the corks pop\n\n[Verse 2: LL Cool J]\nBandwagon niggas ride my dick everyday\nAnd broke ass critics always got somethin' to say\n'Bout how a nigga should flip his shit a different way\nThe fuck you know \"bout hip-hop, I'm LL Cool J, nigga\nThey send Bentleys for me, security escort me\nNow you wanna run to the authorities and report me\nFor being cocky toward those that cock block me\nI'm makin' millions, no nigga, it don't shock me\nI'm supposed to have it, you never been close to karats\nThat's why you poppin' that shit jealous bastards\nI ain't impressed by you playa that's that\nMatter-o-fact gimme your autograph...on my nut-sack\nY'all niggas Benigni-ing...not cool\nYou just got some white kids in the suburbs fooled\nBut your albums trash from the skit to the covers\nI tear the plastic off and use it for a rubber (I'm)\n\n[Chorus: LL Cool J & Kandice Love]\n(L) I'm the G.O.A.T. I just ball a lot (L)\nAnd (Cool J) I'm double platinum on the hot blocks and\n(L) the hottest nigga in the whole spot (L)\nAnd (Cool J) you see my hand not what I got and\n(L) Strictly evil in the big box (L)\nAnd (Cool J) It's no stoppin' when my shit knocks and\n(L) Get it all baby don't stop (L)\nAnd (Cool J) don't move the bottle let the corks pop\n\n[Verse 3: LL Cool J]\nSeems like ev'ry rappers a former Nicky Barnes\nYa ugly ass corny niggas is wannabe dons\nI'm the best, platinum nine times in a row (wow)\nPaparazzi flash while I snatch niggas hoes (wow)\nLive the lifestyles so the average dime piece\nWanna have my lovechild and roll L style\nA man hostile, but my Queens niggas run wild\nSo when I skate through niggas strain to smile\nPeep my profile and my iced-out dial\nI tap my horn, say \"What up?\" but never smile\nAnd deuce ass niggas is noodles\nAnd your broke ass stripper weave is lookin' like a poodle\n'Scuse my French, \"Je m'appelle LL\"\nI'm platinum again so tell 'em to go to hell\nThen pour some Cristal for my foes that fell\nHard as hell, big fell, I excel, rock bells (I'm)\n\n[Chorus: LL Cool J & Kandice Love]\n(L) I'm the G.O.A.T. I just ball a lot (L)\nAnd (Cool J) I'm double platinum on the hot blocks and\n(L) the hottest nigga in the whole spot (L)\nAnd (Cool J) you see my hand not what I got and\n(L) Strictly evil in the big box (L)\nAnd (Cool J) It's no stoppin' when my shit knocks and\n(L) Get it all baby don't stop (L)\nAnd (Cool J) don't move the bottle let the corks pop", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}