{"songs": [{"title": "BIGGEST ALLEY OOP", "album": "QUAVO HUNCHO", "year": "2018-10-11", "lyrics": "[Intro: Lil Yachty]\n30, you a motherfucking fool, nigga\n\n[Verse 1]\nI was 22 when I first dropped (duece, duece)\nMost influential dude when I first dropped\n(Uh, true story) the bando named a new spot (bando)\nWhere them boys from? They ain't from the Hot (nawf)\nHotlanta (hot, hah), dirty mango Fanta (mud, hah)\nSwept the game like I'm Huncho MC Hammer (uh, hammer time)\nWrite my name 'cross the hall of fame banner (write it, write it)\nHit the lights, diamonds flash like a camera (flip the switch)\nFirst met her in some open toed sandals (yeah, hey)\nNow her attitude like a candle (she lit, lit)\nThat bag make you wanna up your standards (get rich, rich)\nWay too fat but she ain't got no manners\nLil' bitch (uh), hop on the stick, uh (hop on the stick)\nGrant your wish, uh (woo), came for licks, uh (licks)\nWe came to hit, uh (hit), who that bitch? uh (who?)\nPoppin' shit, uh (who?), let it rip, uh (who? raow)\n\n[Chorus]\nI said, this the biggest alley oop (alley oop)\nI'm gon' air it out if i shoot (bow)\nIt's only one mic in the booth (one mic)\nGuess it's my night to tell the truth (woo, truth)\nWho got the biggest bag in the room? (bag, bag)\nWho got the biggest bag in the room? (bag, bag)\nWho got the biggest bag in the room? (racks, cash)\nWho got the biggest bag in the room? (yeah, hey, hey)\n\n[Verse 2]\nI lead the way (Yes, leader), follow the wave (Follow the wave)\nI'm not Beyoncé (No!), it's bigger than Jay (HOV)\nAll in the studio cookin' up beats (Woo), but I'm not 'Ye (Yeezy)\nBlessin' the whole industry but they not tryna pay (Pay)\nI wanted like ten mill (Aye), that was like last year (Aye)\nThey lookin' like, \"Oh, for real?\" (Aye), wait till this year (Aye)\nMake the bank clear (Racks), grandma ain't here (Grandma)\nFuck your fake tears (Fake) Huncho made his (M's)\nAnd I'm humble still (Yeah, yeah)\nNiggas been handlin' business and dough before the deal\n(Rah, handlin' business)\nYou livin' a lie, I only provide the real (Go, go)\nNiggas been drownin' they kidneys before they got rid of the seal (Drownin' my kidneys)\nThinkin' 'bout gettin' a big Bentley and callin' it Shaquille O'Neal (Shaquille)\nThinkin' about wrappin' a Benz yellow, Kill Bill (Kill Bill)\nThinkin' that you poppin' but it's Advil (Advil)\nThink your stage hoppin? It's a standstill (Standstill)\n\n[Outro]\nYeah, I go by the name of Huncho\nQuavo Huncho (30, you a motherfuckin' fool, nigga)\nThe hitman, woah\nHuncho, let's go, skrt, skrt-skrt", "image": "https://images.genius.com/39a1f9d0d1403b9749469ec36ad251e9.1000x1000x1.jpg"}], "artist": "Quavo"}