{"songs": [{"title": "The Ripper Strikes Back", "album": null, "year": "1998-04-28", "lyrics": "[Intro]\nWe just gon have some fun with hip hop\nHa-ha!\nA lil hip hop, that's all\nRelax, hold on to ya seats\nHaha! Uh-huh!\nOh, yeah, this is the Tunnel banger too!\nWord up, this the Tunnel banger, baby\nHip-hop style, baby, y'all remember\n\n[Verse 1]\nBy the middle of March, when the pregnancy starts\nIn your ladies' placenta; that means L just entered\nDuct-taped your little bitch-ass for fronting\nYour four-eleven crackhead ass ain't hurting nothing\nNigga, you want the fame?\nNow, you're famous overnight (Ugh!)\nFamous for getting fucked by a stick of dynamite\nYou're weak, nigga! You bout to die up in your sleep\nThe overlord of rap will never meet defeat\nPain to agony, I don't touch them zones\nFuck your epileptic lyrical methods! It's my throne\nBlast your fifty-pound ass and make you float\nYou read it, shook nigga! I wrote the book, nigga!\nHeld down my crown for a decade and a half (half)\nNow I'm bout to give your grimy ass a bloodbath\nTalking bout being broke? Nigga, I'm rich!\n'Cause I learned to separate the money from the bitch (bitch!)\nDon't hate me cause I'm paid\nHate me 'cause I'm everything you want to be\nHandsome; young; plus, legendary\nTalking 'bout Farrakhan\nNigga, you better call Jesse Jackson for some affirmative action\n\n[Chorus]\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nUgh!\n\n[Verse 2]\nDon't ever open your mouth and mention my seed\nTalking 'bout my book you bought to read!\nYou know you watch my sitcom, nigga, so stop that\nMad rapper, but now you turned mad actor (hahahaha)\nForty-nine pounds and tryin' to be a mobster\nRun around town with the Bob Marley impostors\nAsk Canibus, he ain't understanding this\nCause ninety-nine percent of his fans don't exist\nI'm going underground and blowing your rep down\nNext time, save that shit for the Lyricist Lounge\nOr a house party, where you can battle some clown\nOn top of all that, I beat your homeless ass down\nHeard that convicted rapist on the record, too (uh-huh)\nFresh out of jail, asscheeks still black and blue (uh-huh! ooooh!)\nTell me 'bout the things Ear-Biter taught you\nHow to bust a nut or two? (Yeah, that's butter, boo)\nYou be decomposing, but you frozen because my title's golden\nSteady rolling in a world that I'm controlling\nVanguard Awards are for kings who did cause!\nClimbed Platinum Mountain, so pray to the Lords!\nTalking 'bout my first- and second- and third-born\nNow I got a fourth, Canibus, but he cut off\nFrom the riches of my empire, I'm like a pimp\nWho thought he had to retire but found a new Can-I-Puss to hire\nYou're hardcore, in a sense, like Heather Hunter (huh!)\nBut definitely not with the lyrics that drop thunder\nFound you in a trash can\nHot, black, 'cause you scared to bust\nNigga, in Todd we trust!\n\n[Chorus]\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nNow break it down for me!\n\n[Interlude]\nSee I, eat, eat, eat, eat, eat, eat...\nEat amateur MCs!\nHahaha!\nThis real hip-hop!\nTaking it back, baby! On some hip-hop!\nWord up, no bullshit (uh-huh)\nOh, I ain't done yet! Haha!\nLL Cool J is hard as HELL!\n\n[Verse 3]\nYou soft as a newborn baby taking a nap\nMade my dick hard with that bitch-ass track\nWhere you at? Smoking in some one-room flat?\nSucking on Clef's dick, hoping to come back?\nNever that! Nigga, my size is unlimited!\nYours is prohibited; of course, that's attributed...\nTo not knowin ya limits and who you need to test\n(When you!) Step into the house of the Lord and get blessed!\nGet on your knees; bow down to my decrees\nYoung slacker, save that demo for Jack the Rapper (yeah)\nYou gargoyle, slash-olive oil, pussycat\nI've wrapped up in aluminum foil, ready to boil\nI'mma tear the skin off your ass with ten knuckles\nRhymes was weak\nThey made me chuckle like a name-buckle (haha!)\nYou call em lyrics, nigga you need to stop (stop!)\nYou going out! Ahh, fuck it! You going pop\nI feed you a poisonous verse, so don't try it\nNo more rhyming, you on a lyric-fast diet\nCall the paramedic and tell them that he's pathetic\nHis lyrics ain't energetic; you're sweet as a diabetic\nCareer be over next year; yeah, I said it\nLook over your shoulder, nigga! That's where you headed!\nMOTHERFUCKER! Where's a rhyme when you need it?\nFirst rule of lyrical war: Never repeat it\nYou said that same bullshit at House of Blues\nLit the pipe, dropped the match, and sparked the wrong fuse\nNot new! Yeah, nigga, I'm goin at you\nStop basing, and you can be a role model too (*coughs*)\nDiss my moms?! Who's the real rap don?\nWho ruled for fifteen years and dropped bombs?\nWho's copped solid gold Grammys that say \"Todd\"?\nLL! While you dropped verses at niggas' proms\nFAGGOT! You better battle Number Two\nCause Number One got his title locked down, son!\nThe king of all rappers to ever grace the stage\nOr the mic! Best that ever did it; I'm wicked\nWrite a verse and flip it; melt it down to liquid\nAnd drown shorty; fill his lungs until I rip it\nChest busts open, heart bursts; it's smoking\nYou see that nigga, son? (Damn L, we was only joking)\nManeuver, manipulate brainwaves, transform\nYour thought process, when my pen gets caressed\nWarning: all MCs better retreat\nLook at Corny-bus! He can't walk down his own street\nBetter run and get the Fugees (Oh-la-la-la-la)\nCause I EAT, EAT, EAT MCs\nDevour they titles, cause I'm an idol-slash-icon\nAnd tell Wyclef: don't even turn his fucking mic on\nSoldier, nigga! Thought I told ya, nigga!\nCrossover, slam dunk! Game over, nigga! (One more time, son!)\nSoldier, nigga! Thought I told ya, nigga!\nCrossover, slam dunk! Game over, nigga\n\n[Chorus]\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\nCan-I-Bus? (Yes you can!)\n\n[Outro]\nStay in your place! Nah'mean?\nNow wait for the studio audience to applaud!\nFaggot! Hahahaha", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}