{"songs": [{"title": "River Don’t Runn", "album": null, "year": null, "lyrics": "* send corrections to the typist\n\n[Stephen Marley]\nYeah! Yeahhhh, yeah!\nYeah, right down, right down\nLight on, heh, right down\n\n[Hook: Nelly] + (S. Marley)\nThey say - walk down the river\nCause the river don't run (Yeah!)\nSame thing make you laugh, make you cryyyyyyyyyyyy\n(That's why what goes around comes around, my son)\nThey say - walk down the river\nCause the river don't run (River don't run!)\nSame thing make you laugh, make you cryyyyyyyyyyyy - c'mon!\nPlus I got the rocks, them yellow diamonds and that oh-oh-ohh\nBling!\n\n[Nelly]\nC'mon! Yeah, yeah, yeah\nAnd I got two twin Cutlasses interior gatored\nI call 'em Now and Later's cause they candy flavored\nYou see, I drive one now and drive the other one later\nShit it's the new Fresh Prince and all I'm missin is Jada (hey)\nI got a hard drive, all I'm missin is data\nPlease give my number to your sister, I been missin a dater\nI hate to hate a hater, in fact I hate to hate\nHatin is hatin, you should never hate, congratulate\nLook hurr, my attitude is sensed that you may never know my mind\nI know just what I'm thinkin if I don't want you inside\nYeah, inside my men-tal, I know you meant well\nI'm out of time and out of training days like Denzel\nNever the gangsta type, more like a hustler - mayne\nI fuck them ones up out them Playboy books and Hustler, man\n+Honeys+ and +Black Tails+ (uhh) The King magazines (yeah)\nThe Maxim or the Eye Candy, Jet Beauty Queens\n\n[Hook]\n\n[Nelly]\nYeah, yeah, yeah, yeah, yeah\nI'mma spit it 'til I really can't spit it no mo' (yeah)\nNothin changed, cell phone still 3-1-4\nNah the derrty ain't moved to near East/West coast\nI'm a \"Midwest Swanger\" cause they love me the most (hey)\nSome like me humble, others like me to boast\nPlease, my whole life is alphabets and numbers\nI take a G4, land to that H2 Hummer\nLeave at 7:45 in L.A. for the summer\nI got the World Wide sale to check the E-mail\nPlus 401(k) plan in A.T.L\nGot eight females, I see 'em all from 8 to 12\nThe only playa who can ball without his A.C.L. (c'mon!)\nWho may not be original but still a don-dada (yeah!)\nI'm gon' take this beat and flip it, I'm gon' make it hotter (yeah!)\nYou go 'head and take your plane and I'm gon' take the chopper\nI'm tired of niggas frontin like they top gun shottas (hey)\n\n[Hook]\n\n[Stephen Marley]\nNot come runnin ovah! Jah-Jah shine his light (JAH!)\nBlessed is the day! Sacred is the night (yeah)\nWrong wishers beware (watch it) now that I am here\nHey, lordy lordy lordy lordy Lord\nLordy lordy lordy lordy Lord\n\n[Murphy Lee]\nShoot, they thought a derrty wouldn't make it this far (far)\nNow I'm supportin my family, they likin who I are (are)\nSchoolboy a hard worker, they consider him a star\nI guess that's why they look at us as if we from Mars\nSingin-a-ling! I deal with bars like a weight trainer (trainer)\nHustlin got me bigger like weight gainer (gainer)\nAlways remain a, St. Louis entertainer\nMy women love me later, how could a hater blame her?\nShoot, I'm just that dude that kick bars for a livin\nGet rich and trick, collect cars for a livin\nHouses on hills, with Great Lakes in the back\nBowlin' alleys in basements, bed's bigger than Shaq's\nDamn, look at the leather in that old school 'Llac\nThey be doo-doo green, I wonder who would do that\nThe original rude dude, considered too cool\nProbably know me from touchin yo' booty at school\nBling!\n\n[Hook]\n\n[S. Marley ad libs to fade]", "image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png"}], "artist": "Nelly"}