{"songs": [{"title": "No Church In The Wild Freestyle", "album": null, "year": null, "lyrics": "[Chorus]\nHuman beings in a mob\nWhat's a mob to a king? What's a king to a god?\nWhat's a god to a non-believer who don't believe in anything?\nWill he make it out alive? Alright, alright, no church in the wild\n\n[Rick Ross]\nPrime 112 behind the double doors\nAs I rewind the devils floors\nPaths cross, of course your life lost\n\"Patience a virtue. Heard that you're the boss\"\nYour informant's correct\nNow give me enormous respect\nCornered the game, record label on his chain\nRight hand on the bible watch the flow catch flame\nMargielas on her feet\nNow she riding with a lame all jealous in the Jeep\nAll the lil homies wanna eat\nBut we never settle beef\nSo settle your debts before there's any regrets\nGino do the graffitti and Black Evander with the Tech\nMy girls say that I'm a mess\nDJ Khaled say I'm the best\nAnd my city do too\n20 in the trunk, that's how city boys move\n8.9, now the crib got a view\nMandarin manicure, DEA in pursuit\nChampagne and a Rolex, Rose\nNo church for a d-boy: let's pray\n\n[Chorus]\nHuman beings in a mob\nWhat's a mob to a king? What's a king to a god?\nWhat's a god to a non-believer who don't believe in anything?\nWill he make it out alive? Alright, alright, no church in the wild\n\n[Meek Mill]\nAin't no church in the wild for a nigga like me\nIn the game so foul in a world full of sin\nWhere the love flow thin\nAnd the pain run deep\nCause it's blood in the streets\nSee the stains on the money, No love for the weak\nWhere it rain, never sunny, just mud on a beach\nWhere a hater sticks to you like mud on a cleat\nThanksgiving with the birds just drugs for a feast\nYoung'n only 13 with a snub in his fleece\nEven though his heart's cold, he in love with the heat\nSee the high in his eyes, hear the slugs in his speech\nFrom the bottom out of Philly, I emerge from the east\nPeace! At the dealer talking Bugatti talk\nYou never heard it like Illuminati talk\nTell em haters that it's my mama's fault\nBreaking bricks - you would think we talking karate talk\nYoung niggas with old money\nNever trust a nigga that said \"let me hold something\"\nNever trust a bitch that tell you she ain't blown nothing\nThe Weathermen never tell me about these cold summers\nTears dripped on my dad casket\nNiggas turned me into a bastard\nGlock 40 on me is plastic\nGet to reaching I'm squeezing on him and clapping\nAnd I ain't talking about assemblies\nI'm talking head-shots where niggas won't remember me\nI asked God please remove my enemies\nI was surprised when I lost niggas that was friends of me", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}