{"songs": [{"title": "Stapleton", "album": "EARL", "year": "2010-03-31", "lyrics": "[Produced by Branden BeatBoy]\n\n[Verse 1]\nIt's Earl, Mr. Early Bird, gets them girls with curvy curves\nSkate Mental, truck smack a faggot in his Shirley Temple\nYour rhymes rentals, give 'em back to they owners\nAt the end of the bar, I spit with the permanence\nLearn I'm a curb stomping person\nLike third strike verdict dropping jaw dropping verses\nThis bigger lips in person, nigga spits some burn so urn the shit\nFurnish the flow until my pockets green, Kermit's dick\nThe Miss Piggies with a string in they ass\nI control them like your eyes when I'm tinking a glass\nSo if you thinking about dissing stop thinking it fast\nCause my wolves ten deep and they knuckles is brass, ho\nThe Miss Piggies with a string in they ass\nI control them like your eyes when I'm tinking a glass\nSo if you thinking about dissing, stop thinking it fast\nCause my wolves ten deep and they knuckles is brass, bitch\n\n[Hook]\nTell your boyfriend that's a bat and this a migraine\nDon't ask why my jeans splattered with these white stains\nWait, where you going, what you doing tonight?\nJust want to know what you doing, come back\nTell your boyfriend that's a bat and this a migraine\nDon't ask why my jeans splattered with these white stains\nWhere you going, what you doing tonight?\nStop running, where you going, what you doing?\n\n[Verse 2]\nIt's Earl, Mr. Lateshift, rapist in training\nWho edge about as straight as some clay closet gay dick\nRay say hey Earl's a real charming racist\nYour birthday day, have some KK cake bitch\nHabit have it, grab it fast and attack it, faggot\nI'm above average like I'm rapping in the attic, yeah\nI'm crouched in the basement shouting \"Couch\" is the greatest hit\nDirty as a anus is, fans stand in rain for this\nThey even stand in sleet season until they fucking feet bleeding\nHail and fucking snow, in hell with fucking coats\nProbably wear more layers, there's only one Sweatshirt\nHe make them bow down until they mothafucking necks hurt\nFans proud to stand in sleet season until they fucking feet bleeding\nHail and fucking snow, in hell with fucking coats\nProbably wear more layers, there's only one Sweatshirt\nHe make them bow down 'til they mothafucking necks hurt\n\n[Hook]\nTell your boyfriend that's a bat and this a migraine\nDon't ask why my jeans splattered with these white stains\nWait, where you going, what you doing tonight?\nJust want to know what you doing, come back\nTell your boyfriend that's a bat and this a migraine\nDon't ask why my jeans splattered with these white stains\nWhere you going, what you doing tonight?\nStop running, where you going, what you doing?\n\n[Verse 3]\nMr. Deerskin Moccasins is on the fucking stalk again\nFollowing and stalking all them larchmont soccer chicks\nChopping limbs, gnawing legs, through they fuckin' stockings\nHim is grandfather sweatshirt, clockin' all them cardigans\nProduct of popped rubbers and pops that did not love us\nSo when I leave home keep my heart on the top cupboard\nSo I will not stutter when I'm shoutin' fuck you, son\nWolf Gang 'bout it, we ain't waitin' 'til the moon come\nWoo son, the moonshine got feelin' loose\nAs the puss of a whore who's used to abuse\nMy screws pretty loose mind fucked like the hair-doos\nOf doo-doo mamas, dude I will bear jew you\nYou unripe fruit dudes is crews to chew through\nMy niggas wash 'em down with a fat carton of yoo-hoo\nOdd Fu-ture Wolf Gang Kill Them All fuck 'em all\nNo lube, it's the crew to get use to, faggot", "image": "https://images.genius.com/686e994c9078e4edf012d684e6850747.500x500x1.jpg"}], "artist": "Earl Sweatshirt"}