{"songs": [{"title": "Rich Nigga Talk", "album": "Est. In 1989 2.5 ", "year": "2012-12-24", "lyrics": "[Intro: Future]\nWhat's good man? it's the motherfuckin freeze band game\nQuadruple salute to the whole world nigga, international\nAll the way around the globe, A-1 O B global forever\nFree band, la familia rich game, my nigga Mike Will 1989\nThat's that 2.5 shit, you know what I'm sayin\nWhat's that nigga? that's like a God damn half of 3 grams\nAdd 5 more, get your whole 3 nigga, around this motherfucker\nThat's how we live nigga, from the bottom\nAll the way to the top\n\n[Hook: Future]\nI'm talkin Lamborghini's, I'm talkin Aston Martin\nI'm talkin startin the car, while you not in the car\nI'm talkin foreign bitches, I'm talkin cash shit\nI'm talkin penthouse, I'm talkin mad rich\nClose your mouth when a rich nigga talk\nClose your mouth when a rich nigga talk\nClose your mouth when a rich nigga talk\nClose your mouth when a rich nigga talk\n\n[Verse 1: Future]\nI; m talkin I-10, I'm about to snatch a Benz\nI'm talkin sellin diamonds, copy for Giano\nI swear I'm being honest, I'm in like Italian\nI flash that nigga a 400 went a bought a medallion\nI got the snoop,.. they gon knock em off\nHe bought the Bentley coupe, ain't even wash it off\nI'm ridin Masarati, and can serve it soft\nI'm speakin real facts, you need to knock it off\nI park the coupe machine, remix machine\nI'm flexin big body now I feel like Hercules\nCashin out titles, and I got my D\nCrank the car, and don't even use the keys\n\n[Hook]\n\n[Verse 2: Future]\nI'm talkin escalators, I'm talkin elevators\nI'm talkin 3-story penthouse, no neighbors\nI'm talkin glassrooms, I'm talkin marble floors\nI'm talkin Lamborghini's, suicide doors\nI'm talkin dope-boy lingo, yeah real...\nI'm talkin rich nigga shit, you want it cash on out\nYou speakin Spanish to me, and I can't comprehand\nYou bring it to my door, I can't do nothing but win\nConversate with these bitches, they from another country\nShe speak more than 3 languages, she so Dominacano\nI bought her plane ticket the same day I bought a condo\nI'm playin with the white and green, yeah, future Rondo\n\n[Hook]", "image": "https://images.genius.com/ef7512bb3d9beef546aacb7810f41d34.1000x1000x1.jpg"}], "artist": "Future"}