{"songs": [{"title": "I’ll Bee Dat!", "album": "Doc’s da Name 2000", "year": "1998-10-08", "lyrics": "Yo, fuck you!\nYo, y-yo .. F-U-UCCCK YOUUUUU!\nYo yo yo, yo yo yo yo, fuck you!\nYo yo yo yo yo fuck you!\nYo, Sim Simma—who got the keys to my Beemer?\nJack move, that's how we act when we team up\nHey yo yo yo yo yo, stretch it out nigga\nLet the motherfucker pass us that blunt nigga\nThey heard what that nigga say, \"Puff puff pass motherfucker\"\nYeah, \"Puff puff pass motherfucker\"\n\nYo.. yo yo, yo, yo..\nSim Simma—who got the key to my Beemer?\nJack move, that's how we act when we team up\nThrow your triple beam up, this is fish scale\nI bailed out the county with counterfeit bills\nMy slang be high range Brick City\nWatch how you sniff son I'm highly octane\nAll you hear is BANG, BANG, BANG, BANG\nYo, remember you bitch? Shit, I forget my last name!\nIt's all about game, nuttin else, for delf\nWalk through the woods then stomp on your foot\nWith high, I take out any comp in the hood\nGorilla impact in this rap habitat\nGet you steppin in your Air Max - BOUNCE!\nYou cockin it back but where dat? BOUNCE!\nI got a six pack of Heineken and Big Kap on the wheels\nIn two laps, I give Stella Her Groove Back\n\n[Hook]\nMy middle name must be Fuck You\nCause every time I walk by\nNiggas be like, \"F-U-UCCCK YOUUUUU!\"\nI'll be dat, I'll be dat, I'll be dat, I'll be dat\nMy first name must be He Ain't Shit\nCause every time I'm in a car\nBitches be like, \"He ain't shit!\"\nI'll be dat, I'll be dat, I'll be dat, I'll be dat\n\nYo nigga, yo yo nigga\nI heard the party goin on in there - YEAH\nWell let me shake my stankin ass in there - YEAH!\nSoon as I walk in, dogs are barkin (ARF ARF ARF)\nHaters play the back, I stay in front like handicapped parkin\nStartin arsons from, Jerz to\nArkan--sas me coughin out that dread apartment\nRoll up to the jam with the front end bent up\nWatch them chickens, 'fo end up gettin' salmonella\nI'm ghetto like D&D, fuckin wit D\nYou be on Banned From TV Part III\nIn a heartbeat, tiger, straight out the cup\nYou're light in the ass son, you weigh bout a buck\nBut I'm one-ninety physique, two-hundred and thirty-fo'\nPounds total when I'm carryin the heat\nNot platinum on wax but, platinum in the streets\nAny nigga dat disagree, smack him in the teeth\nThen I bag his little piece, rockin the ice\nGive it to the projects for the rhyme of the night\n(Why you actin like dat?) The weed made me do it\nDevil's Advocate hot, can take days to do it\nMy crew do drugs that Duane Reade couldn't breed\nDry me in the sun I'll amount to ten keys\nRedbones I'm bonin, MC's be clonin\nThat's before Doc stretch and mornin yawnin!\n\n[Hook]\nMy middle name must be Fuck You\nCause every time I walk by\nNiggas be like, \"F-U-UCCCK YOUUUUU!\"\nI'll be dat, I'll be dat, I'll be dat, I'll be dat\nMy first name must be He Ain't Shit\nCause every time I'm in a car\nBitches be like, \"He ain't shit!\"\nI'll be dat, I'll be dat, I'll be dat, I'll be dat\n\nNiggas and you bitches, puff puff give\nNiggas and you bitches, puff puff give\n\nYo, yo\nIf you gotta be a monkey, be a gorilla\nIt's four A.M., I'm off a tab and still a\nWorld rap biller, push a big Benz\nWith a chickenhead drawers hangin from my antenna\nI'll be god damned if a nigga take mine\nOn foot, shit, put rollerblades on\nMind your business, the nine with swiftness\nI'll pull it, stretch it like Fonda Fitness\nI'm a \"Everyday Nigga\" like I'm Toyota\nYour A&R hope we don't drop the same quarter\nWrapped the puta, in a Hefty Two-Ply\n(Yo he ain't from Chi) So haul ass back to Utah\n\n[Hook] -] repeat 2X\n\nF-U-UCCCK YOUUUUU!\n\n[Big Tigga from Rap City]\nYea yea yea yea yea\nIt's W Fuck All Y'all radio, ya man Big Tigga\nI'll Be Dat, ya heard? Yo!\nIt's like thirty degrees down here in D.C\nAll my niggas strap the Timbs up\nGet out the puffy coats and alla that\nAnd I'll see all you chickenhead ass bitches at the club later\nI'll be dere, heh.. I'll Be Dat!", "image": "https://images.genius.com/0e9c4b7c725259990be9e9092f4c1953.600x600x1.jpg"}], "artist": "Redman"}