{"songs": [{"title": "Can’t C Me", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro: George Clinton]\nThe blind stares of a million pairs of eyes\nLookin' hard but won't realize\nThat they will never see the P!\nYou must be goin' blind\n\n[Verse 1: 2Pac]\nGive me my money in stacks and lace my bitches with dime figures\nReal niggas fingers on nickel-plated 9 triggers\nMust see my enemies defeated\nI catch 'em while they coked up and weeded\nOpen fire, now them niggas bleedin'\nSee me in flesh and test and get your chest blown\nStraight out the West, don't get blown\nMy adversaries cry like hoes, open and shut like doors\nIs you a friend or foe? Nigga, you ain't know?\nThey got me stressed out on Death Row\nI've seen money, but baby, I've gots to get mo'\nYou screamin', \"Go 2Pac!\" and I ain't stoppin' till I'm well-paid\nBail's paid now, nigga, look what hell made\nVisions of cops and sirens, niggas open fire\nBunch of Thug Life niggas on the rise, until I die\nAsk me why I'm a boss player gettin' high\nAnd when I'm rollin' by niggas can't see me!\n\n[Chorus: George Clinton]\nThe stares of a million pairs of eyes\nAnd you'll never realize\nYou can't see me\n\n[Verse 2: 2Pac]\nBeen gettin' word that these square motherfuckers with nerves\nSayin' they can get with us, but picture me gettin' served\nMy own mama say I'm thugged out\nMy shit be poppin' out the record store as if it was a drug house\nMy lyrics bang like a Crip or Blood\nNigga what! It ain't nothin' but a party when we thug\nAnd there I was, a young nigga with heart, ain't had shit to lose\nPullin' my pistol on them fools, you know the rules\nD-R-E, you got me heated; my words like a penitentiary dick\nHittin' bitches where it's most needed\nMoney and weed, Alizé and Hennessy\nTo my thug niggas in lock down: witness me\nBail on these hoes in floss-mode\nThe life of a boss player, fuck what you thought though\nMy enemies deceased\nDie like a bitch when my album hit the streets; niggas can't see me!\n\n[Chorus: George Clinton & 2Pac]\nNiggas can't see me\nThey can't see me\nWhich way did he go, George?\nWhich way did he go?\nOh!! Which way did he go?\nWhich way did he go?\n\n[Verse 3: 2Pac]\nYou niggas made a mistake\nYou should've never put my rhymes with Dre\nThem thug niggas have arrived and it's judgement day\nHey homie, if you feel me\nTell them tricks that shot me that they missed, they ain't kill me\nI can make a motherfucker shake, rattle and roll\nI'm full of liquor, thug nigga, quick to jab at them hoes\nAnd I can make you jealous niggas famous\nFuck around with 2Pac and see how good a nigga's aim is\nI'm just a rich motherfucker from the way\nIf this rappin' bring me money, then I'm rappin' till I'm paid\nI'm gettin' green like I'm supposed to\nNigga, I holla at these hoes and see how many I can go through\nLook to the star and visualize my debut\nNiggas know me, player, I gotta stay true\nDon't be a dumb motherfucker 'cause it's crazy after dark\nWhere the true thug-niggas see your heart; niggas can't see me!\n\n[Interlude: 2Pac]\nYo, check this out: stay off his dick\n\n[Outro: George Clinton & 2Pac]\nNiggas can't see me\nRight before your eyes, I'll disappear from here\nYou niggas can't see me\nYou can't see me\nI know it's hard nigga, I'm all up in your face\nBut you still can't see me\nYou can't see me\nAll up in your range, but niggas can't see me\n20/20 vision won't visualize\nI'm in the flesh, baby, but you can't see me\nAll those glasses won't help you realize\nYou blinded, you blinded, you can't see me\nYou can't see me\n\nThug Life, baby\nDon't believe everything you read!\nAlizé and weed\nYou can't see me, right before your very eyes\nYou won't even visualize, you can't see me\nDr. Dre all day, 2Pac\nNiggas can't see me\nI dedicate this to you punk motherfuckers!\nThis one's for you, BIG baby\n'Cause you bitch-ass niggas can't see me\nNiggas can't see me\nYou can't see me\n\nSee no evil, hear no evil, speak no evil\nYou won't see me\nYeah, first you see me, now you don't\nWanna see me, but you won't\nCome to see me, but you can't\nOh, you can't see me\nYou can't see me\nRight between your eyes and you'll never realize\nRight before your eyes, you won't even realize\nVisualize what you can't see", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}