{"songs": [{"title": "One Night Stand", "album": "The Worst", "year": "2000-09-12", "lyrics": "[Intro: Nachia Woodley]\nI just want a one night stand\n\n[Verse 1: Tech N9ne]\nPeep me, uh\nI rock and Nina while I get cleaner with pieces I purchase\nMore glitz and ritz than Versace\nNo first base, I'm hittin' homers, put groupies in what?\nComas, with a hella boner minus condyloma\nWhen rollin' Sunset or Prospect\nWe on the lookout for some hot sex on a platter\nWho we rock next don't matter, pay attention\nYou friends say I'm a no hit\nBut did you know my oral is in ten different posit's?\n[?] one nihzizzy\nSprung from smelling my Issey Miyake\nThe suns of bizzy when I gun you dizzy\nRide you like Kawasaki\nSo if you don't try to stop me\nYou'll have a night of yellin' Bonsai like Mr. Miyagi\nWhere's the party? (not my place) I belong to somebody\nWhy am I spittin' 'cause I'm naughty-naughty\nScorpio we slick as ice hockey\nWhen I'm bombin' like a Shockley\nWe rock these socks of Ewoks\nOne night nooks, N9na's off the hook\n\n[Chorus: Nachia Woodley]\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\n\n[Intermixed with Chorus: Tech N9ne]\nHa ha ha ha\nI know what you want baby, and I'll tell ya again\nIt's all delicious, we kick it, whatever you want to do, you down?\nYou down for a one night stand?  I told you that\nI had somebody, I had to be real up front\n[?] we can do this\n\n[Verse 2: Tech N9ne]\nGirl what's happenin' wit' ya?\nLose the Mitchell if he trippin' I'ma take his picture\nYou make me sizzle gots to get ya, what's the deal homie?\nIf you're real lonely, let me spank it but don't do an Anita Hill on me\nAwful to scare a homie with a lawful ceremony\nDemi Moore, Disclosure\nIn the pen yellin' \"I miss dosia\"\nAll because of one night, but if you woulda gave me the chance\nIt would've been done right\nI would've made the nana sneeze, gesundheit\nWill ya over?  We just met but I can soak ya\nStrip poker, unsober, got us tossin' on the sofa\nYou saw me starin' at you, when ya done ah-carin'\nThat you never ever climaxed, inside the IMAX\nMy one night stand can make you call the Sandman\nSprung over the first name of the host of American Bandstand\nI heard you say you ain't gon' even call me\nThat's how it is in showbiz it's in the Bible\nDon't ya think?  Though it is bitch\n\n[Chorus: Nachia Woodley]\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\n\n[Intermixed with Chorus: Tech N9ne]\n[?] you can't buy this shit from me\nIt's all delicious, that's how we do it\nI mean, it was passed down to my father from his father, passed down to my father and his father and ah, my father passed it down to me.  How we do this player shit\nLike, can I sing to you for a second?\n\n[Verse 3: Tech N9ne]\nThe scene is green exposure\nThe club is filled with dosia\nWhat I'm about to recruit\nPartner picture had the hunter in the private school suit\nI seen her peepin' me and since there ain't no type of geek in me\nI made my way to the specimen, stressin' it's the freak in me\nSo I shifted into Barry White mode\nThe closer that I got homie, the more she was cold\nShe had a trunk load, I walked up on her like dwam\nThe record said start, she grabbed me and said that's my jam\nYou know you gets the nookie after a Luke song\nYou take the hooch home, so you can get your shoots on\nI wanna take you out your normal state of mind lady love\nAnd if they shoot us, they just takin' us out this land of Judas\nWe can ride the ninth cloud, and seventh heaven then land right\nOn my mattress and drop you after one night, Beatrice\n\n[Chorus: Nachia Woodley]\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\n\n[Intermixed with Chorus: Tech N9ne]\nWhat'cha mean?  It ain't cruel?  Y'all do it too\nYou can't tell me you ain't never met no nigga that you just wanted to...you met at the club and you just wanted to, you know, take him home after y'all got done drinkin' a couple of Caribou Lous.  Ya know what I mean?\nDo what you came to do to the nigga, ya know what I mean?\nWe do it every day, you do it, you know what I'm sayin'?\nY'all keep it, at the club and y'all got a good way of keepin' that shit hidden.  You know what I'm sayin'?  Y'all ain't right\n\n[Verse 4: Tech N9ne]\nI'm short, dark and rugged, and lots of ladies love it\nWhen I covet any object with fur I gots to rub it\nI'm mister rapper man, Dapper Dan who's bad\nNow they know me when see me in the brand new Jag\nPullin' up on the club scene, you and homegirl's gaze\nHeard the N9na flips the tongue in many ways, plus he paid\nA super freak, so for the tongue they got to seek\nSo they come and get a piece of N9na but they fall in love a little when they peak\nOn the [?] human hydraulics excites me, hypes me psyche\nTonight I hope I'll be the victor like Nike\nI'm poured and now we Motel 6'n liked it, bashed it\nLater found out she burns through Jimmys, nitric acid\nI fasted on one nights for a split\nI'm back and now the Tech is highly hated by the Mitch clique\nIf you get it Mitch like bitch quick you hitched\nBut yo if you's a one night stander throw your hands in the air like this\n\n[Chorus: Nachia Woodley]\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\nOne night stand (one night)\nWhy can't you be my man? (one night)\nOne night stand (one night)\nWhy can't you understand?\n\n[Intermixed with Chorus: Tech N9ne, woman]\nYou agreed to do it with me, but now, after we get through it, you actin' like, you know what I'm sayin', that I did something bad to you, that ain't right.  You know what I'm sayin'?\nYeah, that's what I said, know what I'm sayin'?  I mean, you said, I told you in the beginning that, you know what I'm sayin', I was with a mothafucka, but, you know what I'm sayin', you said it was cool, you know what I'm sayin', but now you're lookin' at me like, you know what I'm sayin', like everything ain't right, so it's...\nUh, what the, where y'all?\nWant to [?] my pajamas?\nI have to think about that\nWould you do that for me?\nI can do that\nIf you do, we can start with some, Caribou Lou\nOoh, that sounds good\nGet blowed\nHigher than a mother fucker\nGet fucked up\nReal fucked up and it's all delicious", "image": "https://images.genius.com/87934aebc9ee54de45c58f2e2bede516.369x369x1.jpg"}], "artist": "Tech N9ne"}