{"songs": [{"title": "I Ain’t Wired Right", "album": null, "year": "2012-09-04", "lyrics": "Yeah, yeah\nI’m loosin' it\nWhat up Trax?\nMy veins open up now, chuch\nLet’s get it\n\n[Verse 1]\nThey ain't rip it, they just plain can't get it\nNot the way I spit it cause I'm different\nMagnificent when I kick it, huuh\nFlow too vicious, eat rappers like they delicious\nKillin' everything which is fictitious, for the riches\nNow can I get a witness, haa?\nLook at what a nigga did\nFuckin' with a lyrical contortion is hard\nForcin' the scars, scorchin' a mark, make it so sick\nI leave 'em prayin' to the porcelain god\nComin' with a [?] of lyrics, anybody wanna differ\nTell it to me when you're lookin' at the grill\nLot of luck, G for the great Bonneville\nPickin' up a bitch and take a [?deep amount of pill?]\nLike I'm off a pill\nRadioactive when I ride it, when I do it\nAnd let 'em know they can't fuck with him\nOn the block like Jordan, take a shot like Duke\nSo bring the Dutches in\nAbout bitch niggas I could give two fucks\nLike the Ku Klux was in\nYou could murder what I write?\nI was just spazzin', who said I touched a pen?\nWhen I do, I bet you see it on Billboard\nWhat the fuck you think I'm blowin' on kill for\nWe gon' see which one of us a nigga feel more\nRelax sometimes but doesn't get real bored\nDisappear for a minute, when I come back, I'mma kill 'em\nI'm a rap ??\nBut never get it twisted, I'm a livin' of a villain\nWhen I clap, I spray\n\n[Chorus 2x]\nI ain't wired right\nI ain't wired right\nI'm 'bout to set this bitch on fire\nI ain't wired right!\nI ain't wired right, nah\nI ain't wired right\nCause a blackout in this bitch\nNow can I get a witness, haa?\n\n[Verse 2]\nBetter be scared of my legacy, homie\nYou won't diminish mine\nFinna curl swing with a verse, like a nigga first\nTo cross the finish line\nWho would'a ever thought a nigga in the game\n20 years and still be in his prime\nI eat up that new\nMotherfucker you finna sign\nFiercely in it, Chi-Town\nBut you think I put a little bit of Philly in it\nIf I said it, then I really meant it\nTear a nigga up like an Achilles tendon\nBetter yet an ACL, they see hell, when I hit the dank\nGet 'em in the paint, stick 'em with a shank\nCelebrate and roll another round of kush\nHit it till I'm feelin' like a nigga finna faint\nYou don't like what I said, screw you\nYou don't know what I said, \"SCREW ME\"\nTexas style, I can wreck this style\nLike I was a Mossberg or an Uzi\nNigga, for you to be called, I'mma see\nIf you can spit cause I can serve a hater on a platter\nWith the security code of a G\nSo you can never tap into the data or the data\nThe ultimatum is I gotta be strong in a whole city full of fiends\nThat's why my niggas stay holdin' metal like Wolverine\nThe cause-a-riot type\nBut me, I'm the quiet type\nThey be the ones that you really gotta watch out for\nCause they ain't wired right!\n\n[Chorus 2x]\nI ain't wired right\nI ain't wired right\nI'm 'bout to set this bitch on fire\nI ain't wired right!\nI ain't wired right, nah\nI ain't wired right\nCause a blackout in this bitch\nNow can I get a witness, haa?", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}