{"songs": [{"title": "Literally", "album": "508-507-2209", "year": "2017-06-16", "lyrics": "[Verse 1]\nShe say I think with my dick and she probably right\nAnd it's Friday night\nAnd he gon' do whatever when he feeling good\nBut girl I promise you that me and him are not alike\nI swear he 'bout to be the death of me, I can't fight it\nAnd he gon' do whatever when he feel like it\nI tried to teach him 'bout relationships and he don't like it\nAnd he gon' go inside whoever when he feel invited\nI had a conversation with him from the get go\nHe said \"Nigga calm down let me finish, yo\nDon't understand why you acting like a bitch, though\nAin't nothing wrong with a little bit of sex, hoe\nYou ain't gotta stress yo\", my nigga, listen, you a part of me\nYou get me in trouble then you fall asleep\nAnd all it takes is some liquor and some R&B\nBut you gon' fuck around and turn me into Charlie Sheen\nLook nigga, I've been getting teased while the guys get played\nSweating in your jeans all goddamn day\nTryna feel a little breeze you can get a little wet\nGo swimming 'til she screams, make her feel it in her chest\nLove a bitch that'll suck me and swallow your kids up\nKiss me on my eyes while she tyin' her hair up\nThen give a massage as I lay it down\nShit I could do this all night, I don't play around\nMy nigga, you don't ever take your time so it never lasts\nYou sabotage every chick I ever had\nWhen you see another chick you say goddamn\nThe blood rushin' to your head and then you dive in\nAnd you willin' to say whatever just to get some\nYou better hope that I don't ever fuckin' catch none\nCause you a dirty motherfucker you should listen to me\nOr I'ma have to cut you off, literally\n\n[Chorus]\nI've been thinkin' with my dick, baby I ain't got control\nI try to fight it but he got a mind of his own\nI've been thinkin with my dick but I'm tired of these hoes\nAnd this is my confession, I can't lie anymore\nI've been thinkin' with my dick, baby I ain't got control\nI try to fight it but he got a mind of his own\nI've been thinkin' with my dick but I'm tired of these hoes\nAnd this is my confession, I can't lie anymore\n\n[Verse 2]\nShe say I think with my dick and she probably right\nYeah it's Friday night\nAnd he gon' do whatever when he feeling good\nBut girl I promise you that me and him are not alike\nHe sayin' \"Hi, hello\" and got a thing for Adele\nHe got a mind of his own, he really think for himself\nIt's hard to keep him happy, he a heavy hitter\nWhen bitches call him daddy then his head get bigger\nI had a conversation with him, had to set him straight\nHe said \"Nigga calm down, homie listen, J\nAin't nothin' wrong with some pussy and a little brains\nBesides I don't really know if this is just a phase\nAnd I don't mean to be rude or to hate though\nBut I get bored when I'm in and out the same hoe\nThe same pussy every night I'mma lay low\nAnd I could care less if she keep her fuckin legs closed\nI love a bitch that'll suck me and swallow your kids up\nKiss me on my eyes while she tyin' her hair up\nThen give a massage as I lay it down\nAnd as soon as I'm done with her, I'ma make my rounds\nAnd you don't ever take your time so it never lasts\nPlus you sabotaged every bitch I ever had\nAnd you ain’t even being safe, you fuck it you lazy\nAnd as soon as you fuck up, then I'm stuck with a baby\nAnd I hope that you know you givin' me a bad reputation\nAll because you don't know how to relax and be patient\nNow these bitches trippin' they gettin' mad at me blatant\nThey call me a bunch of names, that's some bad defamation\nAnd today I'm gettin' checked at the fuckin' clinic\nAnd if I got somethin' then I know who fuckin' did it\nCause ever since the other day, I kinda feel a little burn when I'm pissin'\nAnd if I got somethin' I hope my girl don't get it, hold up\nUh, yeah\n\n[Brief Message]\nThis message is for Mr. Lucas, Dr. Kipling's office calling\nUh, your lab results came in today\nAnd, uh, quite a few positives on there\nSo please give the office a call back as soon as you can\nThank you\n\n[Interlude]\nOh my God, you gotta be fucking kidding me!\nC'mere you dirty little muh'fucker, should've listened to me\nWhat did I do?!\nNow I'ma cut your ass off (\"wait, what did I do?!\")\nLiterally (\"Stop! Joyner stop it!\")\nGet the fuck over here! C'mere! Get the fuck!\n\"I'm sorry! No, noooo!!\"\n\n[Chorus]\nI've been thinkin' with my dick, baby I ain't got control\nI try to fight it but he got a mind of his own\nI've been thinkin with my dick but I'm tired of these hoes\nAnd this is my confession, I can't lie anymore\nI've been thinkin' with my dick, baby I ain't got control\nI try to fight it but he got a mind of his own\nI've been thinkin' with my dick but I'm tired of these hoes\nAnd this is my confession, I can't lie anymore\n\n[Outro]\n\"You have reached the National Suicide Prevention Hotline\nAlso serving the Veterans' Crisis Line\nIf you are in emotional distress or suicidal crisis\nOr are concerned about someone who might be, we're here to help\nPlease hold on while we route your call\nTo the nearest crisis center in our network\"", "image": "https://images.genius.com/15c4c3c9fa26958e4841c4e8276492ed.1000x1000x1.jpg"}], "artist": "Joyner Lucas"}