{"songs": [{"title": "Smash Sumthin’", "album": "Malpractice", "year": "2001-05-22", "lyrics": "[Adam F]\nHere come the remaining beautiful people\nAnd for all of you who survive, we hope you enjoyed the ride\n2002 will see some new added features\nSuch as - the Spinal Spinning Spiral Splitter\nAnd - the Corkscrew Cock Cruncher\nPlus, the Fat Fuckin Bitch Backslapper\nAnd not forgetting - The One Finger Ringer\nSo, until next time boys and girls, goodbye!\nCunters journey home, toodaloo, ta ta - and FUCK OFF!!\nFrom the \"Rollercoaster Malpractice\"\n\n[Redman]\n(Red-man!) They done let me out\n(Red-man!) They done called my name\n(Red-man!) They done read the four chapters..\n.. now I'm back, Brick City, I've been born again\nMaster, hit the switch - Igor, he's ALIVE!!\n\nYo.. set it off\nSet it off, yo yo yo\nLet's start ridin, my flows bring the tide in\nWhile John Cochran break your pride in\nI shagged her before you married her\nTook the ring, pawned it for an Acura\nDOC, breakin the sound barrier\nHardcore bullet, fo'-fo' pull it\nGot your camp runnin, used it for footage\nBrick City suspects couldn't(?)\nYo, watch me leap through trees\nAttackin sharks in the _Deep Blue Sea_\nAim lock on, _Goldeneye_\nWar in the snow storm, with double-oh on\nU.K. blow your horns\nPut you in, I.C.U., gettin blood drawn\nDoc did it, off an Adam F bomb\nI move like Robotron, turn the lights off!\n\n.. girl she had a big FAT ass\n.. we smokin weed tonight, we smokin weed tonight, c'mon\nWhat I want everybody to do right now\nIs blow your motherfuckin horns\nLouder, LOUDER!!\n\n[Hook: Redman]\nYo, if you want that shit (that shit)\nThat hardcore rough shit (rough shit)\nMotherfuckers, blow your horns\nThen SMASH SUMTHIN, CRASH SUMTHIN\nIf you want that shit (that shit)\nThat smoke and fuck a bitch shit\nMotherfuckers, blow your horns\nThen SMASH SUMTHIN, CRASH SUMTHIN\n\n[Redman]\nYo, yo yo, from hunger, to hungry, to hungriest\nPack two cannons by the pancreas\nYour whole camp enlists, abandon ship\nPush your knuckles up and dance with it\nI'll shut down cops, steal they badges\nOff of 'Operation: Kill Da Wabbit'\nPPP niggas be jackin cabbage\nLooked in the camera and pull the mask up\nLaughin at ya - yeah I X'd you out\nSomebody help him out with mouth to mouth\nYou to me son, what you talkin bout?\nIf your third eye look then I gouge it out\nBitches fuck me barely walkin out\nFor a thievin ass ho fo' mark it out\nIt's one mo' body in the hall for now\nVerbal assault killer, calm him down\nI open fire, made you retire\nHung your shoes from a telephone wire\nSo when I ride by, I brag on it\nParagraphs fly wit toe tags on it\nI plant a bomb where you pick your mail up\nIt's BRICKS, so y'all hit the fallout shelter\nDoc, niggas, bitches, jump up\nCriminals, hustlers, hoes, jump up\n\n[Hook] - 2X", "image": "https://images.genius.com/20ed9666eb00b5750f05430735598620.599x525x1.jpg"}], "artist": "Redman"}