{"songs": [{"title": "I’m Looking", "album": "Q.B. 2 Compton", "year": null, "lyrics": "[The Game]\nI'm from Compton where them guns bust, watch Poppa George pop\nCats tellin jokes at them car games\nSeen big face hundreds, handle the rock like Nate Archibald\nWhat?  This nigga only sixteen\nAnd I wanted to be, just like him, middle school fightin\nAny nigga with a chip on his shoulder, whattup nigga?\nYou want beef with me?  Now I let the heat speak for me\nNo more talkin, just outline chalkin\nNigga Witta Attitude from birth, \"100 Miles and Running\"\nGunnin bustin shots like fuck the cops\nNotorious for burnin blocks, weavin in and out of traffic and chop\nGame the young Robin Hood of the block\nSteal from the rich, give to the poor, coward niggas rock\nSecond comin of this black Alfred Hitchcock\nKick in the door, wavin the four-four\nTen shots to your spleen, let them violins sing\n\n[Hook: Blue Chip] + (The Game)\nYo, I'm just a ghetto nigga stuck in this game, young'uns runnin with 'caine\nRain hits so we floodin the game\nWhen you come to Compton respect the grounds, leave you shook man\n(And I look good, from Compton to Brooklyn)\nHey yo I don't give a fuck who you are, fuck ya ice\nFuck the block that you claim, fuck your Bentley Azure\n(Dead presidents is all I represent)\n('Til y'all met me y'all niggas ain't met gangsta yet)\n\n[The Game]\nFast cars, money and muscle, the hustle I was brought up in the 80's\nGangbangin, dope traffic, shit get crazy\nFrom where niggas grow up hard like dicks raised\nThem hustlin guns like Knicks players, we got mouths to feed\n'Til they put flowers on me, moms kiss my cold cheek\nIn that pine box, I'm buyin rocks, eyein cops\nFuck a cell block, the young kid makin it happen\nWho you think got them fiends runnin back like Bo Jackson?\nI'm a gangsta, what else could I say?\nI'm ahead of myself like it's Y4K\n2Pac, Scarface, N.W.A\nTaught me how to dodge them bullets, keep my wig in play\nKeep fo' snug in the waist or pay a thousand to have 'em\nNiggas in the street move faster than, Michael Jackson's album\nBut the shit don't really matter to me, we get better G\nBet the four slow 'em down like PCP\n\n[Hook]\n\n[The Game]\nReal gangsters never talk shit, handle they business\nFuck the dry snitchin and bitchin, niggas die when them bullets fly\nWho fuckin with him, ha?  Not a nigga alive\nEnd up dead in that 5\nHe got no sympathy for them dead guys, friend or foe\nWatch that chest cave in, what that vest savin?\nMake it sloppy for the autopsy, leave my enemies in a frenzy\nOn the frontlines holdin a 9\nEveryday a new chapter, my own niggas plottin on me\nTryin to hit me but they won't get me, feel the semi first\nFuckin with my dough, is the worst way to go\nY'all know, niggas cry when them bullets burn slow dummy\nIn and out of spots watchin my money\nIf one dollar come up missin bodies start to come up missin\nNo one too heavy for the Expedition, piss on your corpse\nWatch your soul shiver, throw him in the river, bitch nigga\n\n[Hook]", "image": "https://images.genius.com/40d38d21ace3ff6fcc01da5f319eae00.1000x1000x1.jpg"}], "artist": "The Game"}