{"songs": [{"title": "He Who Ate All the Caviar", "album": null, "year": "2012-10-17", "lyrics": "[Intro]\nFuck you mean, “I’m drunk,” mo'fugga?\nYou crazy?\nShit, you didn’t say that a hour ago!\n\n[Verse 1]\nUh, I made more than this money, don't label me as no business\nCame up in this country, started out in the Civic\nPray for rain til' it's muddy, praying more than just sunday\nEating good, I'm still hungry, left no evidence on these dishes\nWatching movies, no sound, smoking weed in this dope house\nAnd my bitch coked out, smoke loud when she go down\nDamn, this the life, riding on Gary Fisher bikes\nKnow the kid is nice, piece of cake, you won't get a slice\nAny time of night, hide your kids, hide your wife\nFind a sip, bottle Sprite, high as shit, blind a bitch, dynamite\nBitch, tell me what your problems like\n(I wanna know, for real, I just wanna know)\nJust got the pipe, we could talk all night, sike\n\n[Hook 1]\nI get money, I fuck hoes\nI wear really nice clothes, I\nGo to the club and buy all Patrón (all of it!)\nI get a lot of\nBitches who love to suck my dick (bitch!)\nI made a lot of money\nI'm real motherfucking rich (I'm so motherfucking rich!)\n\n[Hook 2]\nI get money, I fuck hoes\nI wear really nice clothes, I (you're a bitch!)\nGo to the club and buy all Patrón (cash, motherfucker)\nI get a lot of\nBitches who love to suck my dick (slut-ass hoes)\nI made a lot of money\nI'm real motherfucking rich (I'm so motherfucking rich!)\n\n[Verse 2]\nWhy the fuck did I start this? Now, I'm spitting retarded\nThat bassline, made that, that's the hardest\nRegardless, I could get this yardage\nCause I'm a quarterback, bitch, gimme my quarter back\nChange, vending machine, make it rain\nBuying out the whole bottom floor, buying out the whole bottom drawer\nBuying out the whole bottom row\nThere's ice in my mouth right now, lemme chew that shit, bitch, I'm cold\nYeah, I'm cold, all you rappers, you old\nDon't go to award shows cause they smell like nursing homes\nYeah, never wanna get nominated\nYeah, I do, I'm just pissed I haven't got nominated\n\n[Hook 1] + [Hook 2]", "image": "https://images.genius.com/b63c3983ac34b93844f9244055f90e7f.500x500x1.jpg"}], "artist": "Mac Miller"}