{"songs": [{"title": "One Never Knows", "album": "Insomnia: The Alchemist vs. The Cousin of Death", "year": null, "lyrics": "[NAS]\nIn my darkest days lighting up the rightous smoke\nCause I'm dealing with this thug life crisis and can't cope\nNiggas on my dick beef don't stop\nNiggas asking what happed to the Firm\nDid you and AZ bone Fox? No\nHow was it working with Dre though?\nHeard you was fucking Lil Kim and Mary J, Whoa , the list goes on\nThere is rumors that Brandy broke my heart\nThe world want to know what's in the life of the prettiest Don\nNas, was Jay fucking with your baby mom's?\nWas she involved with a plot, to deceive my perfect degrees of\nThree hundred and sixty, he ugly she pretty that's life\nNever been married eloped with dope; Music's my wife\nIt's true, me and 2 PAC once steped to each other\nConfronted our like's and dislike's in front of Suge Knight, we left it as brothers\nAs a child pop's blew his weed in my face, results, mixing ether with base\nI'm the rebel to America, less is the nasal voice chipped tooth bastard\nWhat your hearing is a replica\nI never had a clue, that all you dudes should be in dresses\nDouble edges playing both sides of the fences\n\n[Hook] [Nas & Lake]\nWhere my soul going to go when my ditch is dug?\nOne never knows do one\nThe things that I've seen in the streets I'm from\nOne never knows do one\nThe stuff that I've done what I've become\nOne never knows do one\nAm I crazy what they make me out to be or what?\nOne never knows...\n\n[LAKE]\nThe streets say what up wit Lake, not showin his face\nAnd did he really shoot at the Jake's?\nWhen he just came home, and dude shot at Capone, for his necklace\nWhy was Lake name mentioned?\nWas he reppin on the island taking phone time?\nDid he get Prodigy his chain back in \"99\"?\nWho's writing his rhymes? He is\nDo he be with Kingpin like Delson and Jesus, What was he thinking?\nOn Revolutionary Warfare when he said, He's a modern day Hitler\nDid he shoot more niggas, Than every dude in QueensBridge?\nWhy his last case made the daily news in June?\nDo he have the strength to unify heads from BX to Harlem?\nWho did he stomp and walk naked in his Projects?\nDid he get shot in his chest, never fall with no vest on shoot duke and walk off\n\n[Hook]\n\n[NAS]&[LAKE]\n[N] A yo these niggas don't understand me\n[N] There's going to be a murder my reason insanity\n[N] The acts in the involvement with a homicide Nas\n[N] Who did you shoot at the time when you could've got robbed?\n[N] Do you call yourself a prophet of God?\n[N] Did your hood set fire to your car in your project's in '95'?\n[N] Did Jungle shoot up the club lately?\n[N] Did Jungle kidnap Philly's Most Wanted, then they drove him to his safety?\n[L] Yo, what happened to Puffy and Steve Stoute?\n[L] Why did they scuffle with champane bottles smashing, what was it about?\n[N] My video nailed to the cross\n[N] Now Stoute started hating me, hanging with my enemies\n[L] They ask everyday on my block\n[L] How did I survive in ? by keeping it gangsta, why Nas\n[L] Did you leave a clothes company after you made it millions?\n[N] Cause Esco's weak I start a new line a ILL one\n\n[Hook]", "image": "https://images.genius.com/1021aef37ee8310ae6a31c1d044210e5.457x457x1.jpg"}], "artist": "Nas"}