{"songs": [{"title": "Large Amounts", "album": "The Red Light District", "year": "2004-12-07", "lyrics": "[Hook 4X: Clive Reville]\nIn this life, one thing counts\nIn the bank, large amounts\n\n[Ludacris - over end of Hook]\nThis life, that's all that everybody care about man, money\nThat's all everybody want nigga that's gon' solve all your problems\nIt's the BEGINNING of yo' problems, man listen here, look\n\n[Ludacris]\nNow everybody wants a piece of my pockets\nAnd it don't help when I'm screamin on these records that I'm rich\nCallin people from my number, now I block it\nCause ain't nothin worse than gettin haunted by a stalkin-ass bitch!\nOh yeah! Cause good game, I talk it\nAnd yet you so true, some women'll have you feelin blue like Crips\nI lay my feet upon the path and I walk it\nI spread my wealth out or someone close'll have me layin in a ditch!\nI've had my friends steal from me (yup) snatch my credit card\nOut my wallet, hit the town and leave outstandin bills for me\nThey say I got the cash fo' it, and I can't recall\nOne single member of my family that never asked fo' it\nThey be kickin down doors, and bustin out floors\nCan't get me on the phone so they'll surprise me at my shows\nAnd everybody needs a loan plus they say they won't blow it\nAll I hear is, \"C'mon cuz - you know I'm good fo' it!\" Man..\n\n[Hook]\n\n[Ludacris - over Hook]\nAnd I got one of the biggest families y'all ever seen in y'all life man\nImagine that - fourth and fifth and sixth cousins\nCallin me and shit I don't even know who these..\nI ain't never met these people in my life!\nMomma I KNOW you ain't givin these people my number\nI know you so you wouldn't do it, but y'all my family\nI guess it's only right for y'all to ask me\nIf if you had it, knahmsayin, maybe I'd ask YOU\nIt's crazy man, but look here\n\n[Ludacris]\nNow don't get me wrong, cause bein rich is such a beautiful thing\nBut mo' money, mo' problems, people drive me insane\nNot givin no handouts no mo', some take advantage and flee\nMy goal's to set my friends up to make some paper like me\nPut 'em in position to make they wishes come - true\nSo they can have multiple accounts that gain interest overnight\nGiven a million dollars what you gon', do?\nMap your life out for your kid's kids, or would you spent it overnight?\nNow see me I'll do both, I got unlimited funds\nMy daughter's life was set before her stankin butt turned one\nAnd it don't help that I got fo' or five retirement funds\nSo if I choose before I'm thirty I can lay in the sun\nMy dividends can show and prove the REAL meanin of fun\nThat's why I live by the sword but you can die by my gun\nThe IRS'll never sweat me or even put up a fight\nCause I'm sure I've paid more in taxes than you've made in yo' LIFE, because\n\n[Hook]\n\n[Ludacris - over Hook]\nDon't play with that IRS man, I'll swear, ain't nothin more embarassin\nThan havin them come take all yo' shit out yo' crib man\nDon't think it can't happen to you man, I'm tellin you man\nJust like games on the street collect tax\nThe government markin income towards collectin tax\nIt happened to some of our heroes, Redd Foxx, Willie Nelson\nPeabo Bryson, knocked out one of yo' cribs, you don't even know it man\n(Whattup J.D.?) Women don't like a nigga who got the IRS all on they ass\nI'mma tell you like this\n\n[Ludacris]\nAnd women these days don't want a man without a nice paycheck\nSo we splurge, even though our lives ain't in the right place yet\nBuyin jewelry and some cars just to impress these whores\nMeanwhile your child's poor like, \"Daddy what you left me for?\"\nYeah but it all comes back, that's why I named my daughter Karma\nWho's teachin me the lesson of life and makin me smarter\nI sweep her off her feet cause I'm her knight in shinin armor\nAnd I'll have your FUCKIN HEAD if anybody tries to harm her (kill yo' ass)\nGotta teach her about the game that most us niggas'll spit\nAnd about these scandalous-ass women that get money through gifts\nThey'll suck a cold hard wood for some cold hard cash\nOr ride a brother good then put a foot up on the gas\nOf that brand new ride..\nPick up her friends while you slip and she slide..\nDrop top Benz, gold diggers inside.. crazy what the world'll do for money\nThinkin that everything will be alright, cause\n\n[Hook] - repeat to fade\n\n[Ludacris - over Hook]\nYeh! They don't call it the root of all evil for nothin people\nListen to my words, believe what I'm tryin to tell you man\n\"Money can't change ME!\" That's what e'rybody say man\nBut you know what, money really can't change me\nI don't think it did, shit if it did somebody come tell me right now\nEverybody talkin 'bout, \"If I get rich I don't need all those cars\nI only need one or two cars,\" BULLSHIT! Hahaha\nI can't lie, I'm guilty of splurgin too man\n'Til I learned the difference between assets and liabilities\nReally important man, I swear\nSometimes I wish I didn't have all this money man\n... nah I'm just playin, I'll work through my problems", "image": "https://images.genius.com/57e6650f3864beef0e227e02f76d83b0.1000x1000x1.jpg"}], "artist": "Ludacris"}