{"songs": [{"title": "My Turn", "album": null, "year": null, "lyrics": "Aye yo, home, I'm number one mutherfucka (Fuck you.)\nThe Doctors Advocate, nigga. (Fuck you again.)\nJust get used to me, man. You can't get ride of me, bitch\n\n(Dj Skee WORLD PREMIER)\nThese niggas had a chance, now their shit is over\nIt's my turn, my turn, my turn, my turn\nDon't be mad at me cause I kept it rollin'\nIt's my turn, my turn, my turn, my turn. (HAHA!)\n24 low on hearts on that '06 rose\nIt's my turn, my turn, my turn, my turn. (The Doctor's Advocate)\nLet the sun roof back and I keep on coastin’\nIt's my turn, my turn, my turn, my turn\n\nI can hear niggas talking, whispering in the dark they're like dogs with no bark\nWhen I pull over and park then guns starts to spark and the bullets find the mark\nNiggas outlined in the chalk and I speak from the heart\nWhen I say I killed you, it's simple and plain\nDon't say shit about Dre and don't mention The Game\nThis industry is fake and I can't understand how a grown ass man\nSent a bitch to the pen, how you snitched on stan; he's a bitch like his man\nHe'd of did you for a grand. Eminem called him stan\nI'm going to say it again\nIf I had one more chance I would've break all of his ribs with my bare fuckin' hands\nI'm a gangsta on fire\nYou ain't, you a liar\nYou ain't got no pride, there's a snitch in the wire\nYour fan base knows that you're gangsta is dying\nI won't stop until that wanksta retires\nI'm gone\n\nThese niggas had a chance, now their shit is over\nIt's my turn, my turn, my turn, my turn\nDon't be mad at me cause I kept it rollin'\nIt's my turn, my turn, my turn, my turn\n24 low on hearts on that '06 rose\nIt's my turn, my turn, my turn, my turn\nLet the sun roof back and I keep on coastin’\nIt's my turn, my turn, my turn, my turn\n\nThese rap niggas hate and they smile in my face\nYou rabbit niggas mad, cause the turtle won the race\nAnd, the radio debate what the fuck they going to play\nAll the hot shit is my shit; they take what I say\nPlay Scrabble with my words and put it on the front page\nThey go find a picture of 50 and Game\nSay it's East vs. West; New York and L.A\nSince I dont' button up, now I'm beefin' with Jay\nApologize in seconds\nYou niggas is reckless, you're not going to pay me to beef with a legend\nMy pride I'd protecting, the streets I'm respecting\nI'm not trying to replace Pac so accept\nAfter 5 million records; the Dr.Dre lectures; and 3 world tours\nWest Coast Resurrected\nMy form to the group of help was rejected\nI felt abandoned so I threw away my necklace\n\nThese niggas had a chance, now their shit is over\nIt's my turn, my turn, my turn, my turn\nDon't be mad at me cause I kept it rollin'\nIt's my turn, my turn, my turn, my turn\n24 low on hearts on that '06 rose\nIt's my turn, my turn, my turn, my turn\nLet the sun roof back and I keep on coastin'\nIt's my turn, my turn, my turn, my turn\n\nAfter 20 magazines and a couple of awards\nI can close my first chapter; put my plaques on the wall\nTo the top of the billboard\nWho ever knew that I would sell more than Destiny Child and U2?\nOr do a song with Busta, go neck and neck with Usher?\nWent gold in a week, I'm a bad mutherfucka\nThis Gangsta Disciple and Vice Lord shit\nBrown pride, Latin King\nThis is Blood, this is Crip\nHit the Impala switch\nI keep a clip for any nigga that said I fuck his bitch\nOr changed cause I'm rich, saying Game used to strip\nNiggas weren't saying shit until I came with a hit\nNow you want to see me dead, blood stains in his whip\nTake a father from his son, put my name in cement\nAfter I'm gone they're sample my songs\nYou can bury my bones but my music lives on\n\nThese niggas had a chance, now their shit is over\nIt's my turn, my turn, my turn, my turn\nDon't be mad at me cause I kept it rollin'\nIt's my turn, my turn, my turn, my turn\n24 low on hearts on the '06 rose\nIt's my turn, my turn, my turn, my turn\nLet the sun roof back and I keep on coastin'\nIt's my turn, my turn, my turn, my turn\n\nAye yo, man, I don't really give a fuck about all that shit ya'll doing, that shit ain't making no noise. I'm saying that shit is bullshit. Man, why you niggas trying fucking kill my mutherfucka career? Man, Shit! It ain't going to happen, nigga. Not as long as my mutherfucka Bentley got 22 inch low in hearts on it, nigga. Shit! I'd be damn, nigga. I'm under the black ten light like \"What!\"\nI'm rich Game, Bïtch", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}