{"songs": [{"title": "Give Me the Ball", "album": "Straight from the Lab Part 2", "year": null, "lyrics": "[Verse 1: Eminem]\nMy name is Chauncey Billups, I'm kind of like a raunchy Phillips\nScrewdriver, my crew's liver when you can't sleep and you're still up\nI get the ball and I'm like Rip, you can't get a grip\nYou probably got stripped, you wanna rumble, no reason to trip\nI grab her like Gnarls Barkley holds the mic, your snarls spark me\nI smile like Charles Barkley come on I'm hard, guard me\nAin’t booin’, ain’t pursuin’, no lawsuits, I ain’t suin’\nI know what I’m doin’, give me the ball and your life is ruined\nI'm like Rasheed, I remind me the spirit of Proof\nI'm happy and lucky, ballin' and groovin', I'm on the move\nI'm smooth with it, give me the ball, you don't know what to do with it\nShoot it in the basket, you other teams need a casket\nLeBron sayin' don't respond, there's no back and forth\nThis game is mental, man, I play aloud and walk away just to hush the crowd\nYou trying to touch? Sit down\n\n[Hook: Eminem]\nDetroit basketball\nHomie like I told you this is Detroit basketball\nMan I don't think you ready for the\n\n[Verse 2: Eminem]\nI get the crowd rolled up Like a U-Haul truck\nJust call me 2 Ball Chuck, ain't too tall what\nI'll leave Utah stuffed\nMan I love this game, who the hell you called up?\nYou need points on the paint, I'm the joints when they stained\nAll my coins in the bank and we're going all the way\nYeah baby it's true, I'm talking to you\nYou already know what to do\nJust pass to me, it just so happens to be\nThat I adapt with this heat so strap in your seat\nI got a grasp on this beat, you ain't convinced?\nGive it to Tayshaun Prince, we haven't stayed calm since\nLeave the ball with delayed palm prints\n\n[Hook: Eminem]\nDetroit basketball\nHomie like I told you this is Detroit basketball\nMan I don't think you ready for the\n\n[Outro: Eminem]\nWe get everybody involved homie, we get everybody involved\nI said we get everybody involved homie,we get everybody involved\nYeah\nAhh\nI said ahh\nGive me the ball\nYou gotta walk before you crawl\nTell me you ain't listenin\nThis is Detroit basketball Homie, hey yo\nBeam me up Scottie\nHahahahahahahahahahahaaaaaaaa", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Eminem"}