{"songs": [{"title": "Where You At", "album": "500 Degreez", "year": "2002-07-23", "lyrics": "[Hook]\nAll my niggas if you with me\nWhere you at? (oh!)\nAll my soldiers if you with me\nWhere you at? (oh!)\nAll my hustlers if you with me\nWhere you at? (oh!)\nWhere you at? (oh!)\nWhere you at? Say (oh!)\nNiggas if you with me\nLet me hear you say (oh!)\nSoldiers if you with me\nLet me hear you say (oh!)\nHustlers if you with me\nLet me hear you say (oh!)\nSay, say (oh!)\nSay, say (oh!)\n\n[Verse 1]\nAye (Oh!)\nI come and do my thang and hold down my side\nEagle Street man throw my set up high\nWeezy we gang call them boys that squad\nThat squad, squad up! you know\nAnd we get a lot of dough on the strength of me\nGet a lotta dro on the strength of Fee\nGet a lot of blow\nBut keep that on the D\nD what?...DL! you know\nAnd oh you don't wanna fuck with a nigga\n'Cuz a nigga might fuck with the trigger\nLeave a nigga on the floor\nTruly I don't buck with you nigga\nLet my tooly talk, talk to you nigga\nBitch man is an itch to a rich man whoa\n'20s on the six with the kicks sitting low\nSticky in my swish man gasoline floor\nFire spit man Weezy is about to blow\nYa know!\n\n[Hook]\n\n[Verse 2]\nAye (oh!)\nPass the pine to the pimp old juice killer\nCatch your eye in one glimpse old school with the\nAss up high the front dip drip bam\nMami like damn, Lil Wayne stop playing\nBaby I'm a baller I hustle with my father\nIt's the Birdman and Birdman Jr\nI flip them birds man eighteen grand just order\nEighty-five for half and forty-five for quarter\nYeah! Tity baby put it in the air\nI'm jumping out this atmosphere\nAnd I'm jumping in your bitch if she had a player\nJumping in the painted thing on them dang-a-dangs\nYou see the arm when I pass nigga bang-a-lang\nYou now I'm armed we can mash man it ain't a thing\nYou know I'm calm but I'm a gorilla ain't a game\nI got a banana clip for all you orangutans\nLet's bang!\n\n[Hook]\n\n[Verse 3]\nAye (oh!)\nIt's young Weezy can't none see me dawg\nI get you done easy with one easy phone call\nAnd the sawed-off make your arms fall off\nLike a short sleeved polo, won't bother me no more\nIce like strobe light, look like I'm moving slow mo'\nFerrari look nice on low pro Yokohomas\nWith '20 inch chromes poking out 'em\nChrissy till the dome tote the ganja\nRed-bone in the shower\nHello! Pocahontas give a long stroke poke for hours\nFloating vagina hoe, I'mma holla\nSold coke in the '90s,  I'm honest man\nNothing big maybe ounces, grams\nBut I know how to double, and sometimes it's scams\nBut I know to hustle, and some Glocks'll jam\nBut I know how to bust 'em, and some drops'll slam\nAll alloy buttons that's all stunting\nThat boy's something\nYeah!\n\n[Hook]", "image": "https://images.genius.com/06d6c620f4a4954116cb0d087b9189fc.1000x1000x1.png"}], "artist": "Lil Wayne"}