{"songs": [{"title": "Butter Knives", "album": "Shaolin vs. Wu-Tang", "year": "2011-03-07", "lyrics": "[Kung-fu sample]\nThey say he's a swordsman\nThey say he's a swordsman\n\n[Intro]\nBack to that fly shit, Silicone Valley good shit, right here, boy\nMore money on this rhyme right here, boy\nTake y'all back to the front of the motherfuckin' 1-6-Ooh shit\nYo, lord, that first Wu shit\nYou know what it is, it's that motherfuckin'\nSpecial made, high powered, special made forces\nWhat up what up what up, a-yo, a-yo\n\n[Verse 1]\nChef that fly with a meat cleaver, swing on a young nigga\nSmack flames at him, no gun neither\nLeave him with a bump, what the fuck\n(\"They say he's a swordsman\") Get that little, nigga\nWho give a fuck if he's a swordsman, I'm a gunman, I run from nothing\nChain came from rent days and pumping\nYSL with velours on, drawers is colorful\nI do this, forever nigga, raw style\nLighting Phillies, fly by willies, can't come through\nUnless your vehicle three hundred chain, silly\nLaying in the park with the killers, the coupes, the villains\nNo rims, we just ball for the millions\nThe emperor of slang lords, kings get clapped in they dome\nGet your throne rushed, and I ain't got a gun on\nHigh power ninjas who touch you, lay a gun on\nDrinking with the best of the hustling\n\n[Hook]\nI got butter knives, like you got butter knives\nCome through huddling, run through the spot thirty times\nAll my niggas old school robbers, do what it do\nI got a sixty-two, a black pair of goggles\nFila approaches, the Bee Hives, the vultures and the roasters\nCan't come through with cedar toasters\nIt's going down, only in the town\nYour heart get tested, and gunplay is only an investment\n\n[Verse 2]\nFlying shooters, eyewear rugers\nStars and swords in front of the building, five thousand students\nCocaine cops they know him (\"They say he's a swordsman\") You already know that, man\nDiamonded up, double O sevens, come through, 1-8-7\nBack to the Hill in a second, yeah\nSons jump in front of them bullets, push me up in the bullet\nStay cool, I got shit, where ya weapon?\nHurricane slammers, earthquake clips and cannons\nBack of the building, with the jammers\nLive well, eat well, Welcome to the Terrordome, sleep well\nWho don't like beef? Keep shells\nI flow with the souls of sharks and criminals in they heart\nPlay parts of this in detail\nWell carried mannered, blampers, ninjas black down\nPop up on spots and vanished (\"They say he's a swordsman\")\n\n[Hook]\nI got butter knives, like you got butter knives\nCome through huddling, run through the spot thirty times\nAll my niggas old school robbers, do what it do\nI got a sixty-two, a black pair of goggles\nFila approaches, the Bee Hives, the vultures and the roasters\nCan't come through with cedar toasters\nIt's going down, only in the town\nYour heart get tested, and gunplay is only an investment\n\n[Outro]\nGet down, Lord!\nThey say he's a swordsman!", "image": "https://images.genius.com/bd1e2ea326f22bdcaa7332457249e1c5.1000x1000x1.jpg"}], "artist": "Raekwon"}