{"songs": [{"title": "Way Out", "album": null, "year": null, "lyrics": "[Big Sean]\nMan I wish that I could kill her\nI wish that I could still feel her\nNow I'm at the club lookin for a feel up\nBartender make sure my drink stays filled up\nMan look at this mess I'm in\nIn my darkest hour I can't see the horizons\nBut I still remember her sizes\nThirty-four, twenty-two, thirty-five it, and\nAnd I'm the man to these broads\nWith one glance I could get 'em to minaj\nThrough all of the screamin and all the applause\nI'm Mr. Big Shot, but you was my star\nHey Juliet, I guess our book's done huh\nYou know I ain't book smart\nCause I just thought it was a bookmark\nAnd we coulda picked up where we left off\n[Mr. Hudson]\n\nThere's nothing left to say now\nCause I'll be on my way now\nAnd I'll be moving way out, way out, way out\nThere's nothing left to say now\nCause I'll be on my way now\nAnd I'll be moving way out, way out, way out\nOutta your way\n\n[Big Sean]\n\nMan I wish that I could shoot her\nI wish that I never knew her\nMan what I'm sposed to do huh\nShe my backbone how I'm sposed to manuever\nAnd I know I said it last time\nBut I swear last time was the last time\nBut now she say it's all past times\nAnd I feel like I see my flatline\nAnd I'm supposed to be a man and all\nBut when you get That involved\nYou gotta start thinkin with ya head\nNah ya real head not the one in your pants and all\nMan she was sposed to be my baby\nMan we was sposed to see a baby\nMan I woulda gave her everything\nBetter life, wedding ring, everything we never seen\n(I guess we'll never see it now)\n\n[Mr. Hudson]\n\nThere's nothing left to say now\nCause I'll be on my way now\nAnd I'll be moving way out, way out, way out\nThere's nothing left to say now\nCause I'll be on my way now\nAnd I'll be moving way out, way out, way out\nOutta your way\n\n[Big Sean]\n\nMan I wish that I could stab her\nRemember when I used to grab her\nI wish a nigga still had her\nIt's gon' hurt to see another nigga have her\nWhen I call it's no answerin\nShe ain't love Big Sean she love Sean Anderson\nMan you could probably feel me dyin\nAnd you could probably hear her cryin\nShe killin me from the inside out\nTook everything in the crib that was inside, out\nShe priceless and I can't afford it\nYou want space baby and I gave you orbit\nSo come home, Home is where the heart is\nShe said whenever I'm here I feel heartless\nSo it's time to part then\nI beg your pardon won't be back tommorow, nah\n\n[Mr. Hudson]\n\nThere's nothing left to say now\nCause I'll be on my way now\nAnd I'll be moving way out, way out, way out\nThere's nothing left to say now\nCause I'll be on my way now\nAnd I'll be moving way out, way out, way out\nOutta your way, Outta your way, Outta your way, Outta your way", "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg"}], "artist": "Big Sean"}