{"songs": [{"title": "Blood Money", "album": null, "year": null, "lyrics": "[Intro: Prodigy]\nGotta get this money son...\nNeed a whole lot of them reserve notes!\n\"Aggin's\" is that leave 'em tender...\nAyo H!\nTell 'em!\n\n[Havoc:]\nAyo! - Shit can't get worse - it'll only get better\nHomie I'm a die tryin' chasin' that old chedda\nThey can say what they want I know, it's small forever\nI have niggas sayin': \"Hav' did his thing through-out his ten-year! \"\nCapital H - went through wakes\nCold sweat bitches looking at me like I'm buggin'. (buggin'?)\nSleep talk cause them dreams be real cousin (real!)\nThey say death come in threes but it should come in dozens\nGotta watch who you loving cause that bitch'll switch sides (uh-huh!)\nSome put me on so I know that bitch lyin'. (haha man!)\nA blind make 'em see! - And that shit no good. (naaah!)\nThe hood raised a nigga but - I'm dyin' to leave!\nSpread my wings, leave that nest (yo!)\nGet that good money almost feel like sex. (yeah!)\nAnd fuck! - If it don't happen then, it's not me\nWhoever said that bullshit - they ain't see these checks!\n\n[Hook: Prodigy]\nEverything we wake up to this hell - reality bite. (reality bite...)\nYou niggas think shits sweet - 'till somebody die. ('till somebody die...)\nAnd then we smoke to the memories, and get high as a kite! (get high as a kite...)\nDrinking on some Hennessy! - And everybody goin' with their life. (goin' with their life...)\nPeople say that the dough we make - That's Blood Money! - That's blood money!\nThey say our music corrupts the kids... so That's Blood Money! - That's Blood Money!\nThey try to tell me the dough I spent... That's Blood Money! - That's Blood Money!\nPeople say the dough that we ho-ooold... That's Blood Money! - Straight Blood Money!\n\n[Prodigy:]\nYEAH! - In 2006, 2000 ain't shit\nI spend that on weed - spend that on kicks\nWhen I was fucked up - nobody gave a shit\nBut now I'm up! - Ery'body on my dick. (ahahaha!)\nYou now 'bout to witness the power of Mobb Deep\nBy the time we through - we gon' be undefeated!\nBy the time I'm done - they ain' gonna wanna hear your weak shit\nOur raps is murder! - In the beats underneath it!\nProduced by Havoc. - Yeah you know where's it at!\nIf you need to put out a hit - you gotta see the man\nLil man study our words to help him understand\nHow to survive - and get through the bullshit\nBUT! - I ain't no fuckin' role model!\nShorty follow me you gone be bussin' off the nozzle\nI'm picking up the bottle. - Smoking on the weed\nTreatin' bitches like hoes - and gettin' this money\n\n[Hook]\n\n[Outro: Prodigy]\nLet 'em know dunn! Let 'em know why they put us through hell!\nFlood our hoods with drugs guns and disease...\nTell us to shut up when we speak on it!\nMan this world was built on blood...\nAll money is Blood Money! (that's right!)\nShit America stole e'rything!\n\"In God We Trust\"...\nWho God are we talkin' 'bout? (hummm!)\nWe don't trust nuttin' that come from these muhfuckers!\nWe never asked to be here...\nYOU FORCED US!\nSo now we don't have a choice, (let 'em know Dunn!)\nGet rich or die fucked up and broke! (NAAAAHH!)\nNew World Order? !\nFucking right it's a new world!\nAnd we run this shit!\nThe new breed!\nDo we scare you?\nIf so I don't know why...\nWe're just the monsters y'all created... (yeeah!)\nI just hope we alive when this motherfucker BURN THEN!\n'Till then...\nIt's the Infamous Mobb Deep!\nGorilla-Unit... !\n'TILL THE DEATH!\nAnd there's nothing you can do about it!\n'Ahahaha!\nRevenge is so sweet! (Whoooooo!)\nSO SWEET! [beat fades out]", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}