{"songs": [{"title": "Niggaz Know", "album": "Born Sinner (Deluxe Version)", "year": "2013-05-30", "lyrics": "[Intro]\nThese niggas know\nHuh\n\n[Verse 1]\nArmed and dangerous, call the law\nStick to the script, no audible\nCountry ass nigga with an Audemars\nCan't spell the shit but I order more\nFrench hoes treat me like Charles De Gaulle\nGet good head on the Autobahn\nHit hood hoes out in Baltimore\nPack the shows like wall to wall, my God\nFive steps like Dru Hill\nCame home from the first tour, with\nBad credit and a school bill\nMiddle finger to the bursar\nFinally famous but\nAin't too much really change with us\nStraight up weed; no angel dust\nLabel us notorious, that was 9-7\nSaw my old teacher and she asked how I'm livin'\nYou ain't know my shit drop bitch? 9-11\nGettin' more hoes than that nigga John Legend\nGettin' more hoes than that nigga John Legend\nNigga you should too, if you knew\nWhat this game would do to you\nLook at all the bullshit I've been through\nBetter me than you\n\n[Bridge]\nI must confess, I copped the chains\nI hit the club, I made it rain\nI hit the road, I made a name\nI came home, I ain't the same\nI ain't the same\nI ain't the same\n\n[Chorus]\nMade a mil' off the flow, make sure these niggas know\nMade a mil' off the flow, make sure these niggas know\n\n[Verse 2]\nThese niggas know, boo-ya nigga?\nCame through the door like who y'all niggas?\nStole a nigga flow, I could sue y'all niggas\nBetter yet put a hot one through y'all niggas\nNah, let me stop frontin' for y'all niggas but\nDon't let the college shit fool y'all niggas\nAin't the hardest nigga in the land\nBut a grown ass man, and I will step to y'all niggas\nLike what's the problem?\nAin't gettin' paper, nigga here's a loan\nMy shit long, need a hair salon\nGet it cut, shut the fuck up\nAnd wipe your face with my money 'til your tears is gone\nNo cryin' ass, lyin' ass\nCan't afford a whip, but you buyin' ass\nThis Fresh Prince nigga, I ain't Jazz\nFucked yo bitch, nigga I ain't ask\nShe pitched it to me like Sosa (Oh God)\nWhat the fuck was I s'posed do?\nDeny that, rather try that,but I never fly that\nKeep hoes bi-coastal\nAnd they buy postals, ain't shit for free\nDick the only thing that they get from me\nSit VIP, get a sip for free\nLater on she'll be sippin' me, literally\nPicture me at the tip-top\nWith your bitch lip-locked on my dick when my shit drop\nThis B.I.G. nigga, this Pac\nMinus six shots, but it's still this hot\nThirty grand and that's just for the wristwatch\nHate to brag but backpacker that's hip hop\nWrite my life and make sure that the script hot\nAnd pray the kids watch, if not\nThese niggas know\nIf not, these niggas know\n\n[Bridge]\nI must confess, I copped the chains\nI hit the club, I made it rain\nI hit the road, I made a name\nI came home, I ain't the same\nI ain't the same\nI ain't the same\nI must confess, I cut the chains\nI hit the club, I made it rain\nI hit the road, I made a name\nI came home, I ain't the same\nI ain't the same\nI ain't the same\n\n[Chorus]\nMade a mil' off the flow, make sure these niggas know\nMade a mil' off the flow, make sure these niggas know", "image": "https://images.genius.com/44be7d0a43599b319699c53207f182c2.600x600x1.jpg"}], "artist": "J. Cole"}