{"songs": [{"title": "Fuck Wit Dre Day (remix)", "album": "Death Row Greatest Hits", "year": null, "lyrics": "Yeah, hell yeah, know what I'm sayin, yeah\n\n(Verse One: Dr. Dre)\nMista Busta, where the fuck ya at?\nCan't scrap a lick, so I know ya got your gat\nYour dick on hard, from fuckin ya raw dog\nThe hood you threw up with, niggas you grew up with\nDon't even respect your ass\nThat's why it's time for the doctor, to check your ass, nigga\nUsed to be my homey, used to be my ace\nNow I wanna slap the taste out yo mouth\nMake you bow down to the row\nFuckin me, now I'm fuckin you, little ho\nOh, don't think I forgot, let you slide\nLet me ride, just another homicide\nYeah it's me so I'ma talk on\nStompin on the 'Eazy'est streets that you can walk on\nSo strap on your Compton hat, your locs\nAnd watch your back cause you might get smoked, loc\nAnd pass the bud, and stay low-key\nB.G. cause you lost all your homey's love\nNow call it what you want to\nYou fucked wit me, now it's a must that I fuck wit you\n\n(Break One: Dre)\nYeah, that's what the fuck I'm talkin about\nWe have your motherfuckin record company surrounded\nPut down the candy and let the little boy go\nYou knowhatI'msayin, punk motherfucker\n(**We want Eazy, we want Eazy**)\n\n(Verse Two: Snoop Doggy Dogg)\nBow wow wow yippy yo yippy yay\nDoggy Dogg's in the motherfuckin house\nBow wow wow yippy yo yippy yay\nDeath Row's in the motherfuckin house\nBow wow wow yippy yo yippy yay\nThe sounds of a dog brings me to another day\nPlay, with my bone would ya Timmy\nIt seems like you're good for makin jokes about your jimmy\nBut here's a jimmy joke about your mama that you might not like\nI heard she was the 'Frisco dyke\nBut fuck your mama, I'm talkin about you and me\nToe to toe, Tim M-U-T\nYour bark was loud, but your bite wasn't vicious\nAnd them rhymes you were kickin were quite bootylicious\nYou get with Doggy Dogg oh is he crazy?\nWith ya mama and your daddy hollin' Bay-Bee\nSo won't they let you know\nThat if you fuck with Dre nigga you're fuckin wit Death Row\nAnd I ain't even slangin them thangs\nI'm hollerin' one-eight-seven with my dick in yo mouth, beotch\n\n(Break Two)\nYeah nigga, Compton and Long Beach together on this motherfucker\nSo you wanna pop that shit get yo motherfuckin cranium cracked nigga\nStep on up. Now, we ain't no motherfuckin joke so remember the name\nMighty, mighty D-R. Yeahhh, MOTHERFUCKER!\n\n(Verse Three: Dre and Snoop)\nNow understand this my nigga Dre can't be touched\nLuke's bendin over, so Luke's gettin fucked, busta\nMusta, thought I was sleazy\nOr though I was a mark cause I used to hang with Eazy\nAnimosity, made ya speak but ya spoke\nAy yo Dre, whattup, check this nigga off loc\nIf it ain't another ho that I gots ta fuck with\nGap teeth in ya mouth so my dick's gots to fit\nWith my nuts on ya tonsils\nWhile ya onstage rappin at your wack-ass concerts\nAnd I'ma snatch your ass from the backside\nTo show you how Death Row pull off that whoride\nNow you might not understand me\nCause I'ma rob you in Compton and blast you in Miami\nThen we gon creep to South Central\nOn a Street Knowledge mission, as I steps in the temple\nSpot him, got him, as I pulls out my strap\nGot my chrome to the side of his White Sox hat\nYou tryin to check my homey, you better check yo self\nCause when you diss Dre you diss yourself, MOTHERFUCKER\n\n(Outro)\nYeah, nine-deuce\nDr. Dre, dropin chronic once again\nIt don't stop, Punishing punk motherfuckers real quick like\nDoggy Dogg in the motherfuckin house\nLong Beach in the motherfuckin house\nCompton style nigga, straight up, really doe\nBreakin all you suckaz off somethin real proper like\nYouknowhatI'msayin?\nAll these sucka ass niggas can eat a fat dick\nYeah, Eazy-E Eazy-E Eazy-E can eat a big fat dick\nTim Dog can eat a big fat dick\nLuke, can eat a fat dick\nYeah", "image": "https://images.genius.com/9b791e9e8865e577e788752e38145914.1000x1000x1.jpg"}], "artist": "Dr. Dre"}