{"songs": [{"title": "I’ma Let You Tell It", "album": "The Bar Exam", "year": "2007-02-27", "lyrics": "[Hook: Royce Da 5'9\"]\nBut I'mma let you tell it\nAnd you can ask me who's the illest around\nBut I'mma let you tell it\nYeah, I can probably tell you my opinion on that\nBut I'mma let you tell it\nDon't ask me, \"Who the illest MC?\"\nI'mma let you tell it\n\n[Verse 1: Royce Da 5'9\"]\nIt ain't rocket science, I know you ain't cock no iron\nI know who you run behind if them shots is flyin'\nI know who the crime, the crook, the lolly gag sets\nThe rhymes, the book, the hookers who probably have sex\nThe kinds, the shook ones, the pawns the rook\nAnd how the lines would look, if I'm hooked to a polygraph test\nCall me papi, the best, the answer to the solution\nTo the problem in hip hop, you copy the test\nI'm the cockiest catch, you a throw\nYou the treat at the end of my hook, you the eaten\nYou a ho, you seem to be 'bout losing\nThere seem to be parts of my style, lingerin' in your bowel movement\nI took the courage and built my own company\nI own somethin' that's why I purchased the silk tie\nThis is words to live by, watch your words\nCause words trigger the trigger herbs get killed by\nShut up it's two shooters, bet I can give you a tip\nGet a new whip and set up a new jeweler\nGet wet up this .2 2 will, light up your head\nAnd exit your lip and swell up your soup coolers\nAll your teams involved in things\nThat enter in your body and end all your dreams\nEnter in your shoulder, exit out your ass\nHittin' every organ like a pinball machine\n\n[Hook: Royce Da 5'9\"]\nBut I'mma let you tell it\nAnd you can ask me who's the illest around\nBut I'mma let you tell it\nYeah, I can probably tell you my opinion on that\nBut I'mma let you tell it\nDon't ask me, \"Who the illest MC?\"\nI'mma let you tell it\n\n[Verse 2: Kid Vishis]\nVishis in this bitch\nWith something that will melt you like Dorothy did the witch\nYou backtalk, nigga, and gats spark, nigga\nBust shots at your bike, make them catwalk, nigga\nWe ain't stingy, we will let you have it\nGuns drawn on command like Inspector Gadget\nBoom! They call me the Kid but I don't play\nYou don't know me so me and T.I. feel the same way\nBlat! ASAP, fire melt into your wave cap\nPush your hairline back, give you the George Jefferson\nLearn your lesson, try to test and get aggressive\nSmith & Wessons at your chest will make a mess and leave your vest\nWhole fleet hold heat, trusty O.G\nGo before he blow you lonely\nTwo 4's chromy, not rims, homie\nLoud sound, light's out like James Toney\nMaroon goons with rifles, boom boom your idol\n[?] will fight you, dude will bite you\nMike Tyson trifling, fighting lives with knives\nDespite a license, we're riding with 9's\nThe kid with no nonsense, we're riding for mines\nThe team for no nonsense, we ride or die\nEyes, red, I'm high, [?]\nI'm fly, wise guy, why ask why we live, mister\nNice guy with wives, I'd pipe your bride\nMany tried, none survived their crime\nCall it drama, whole armada's the problem\nAll bearing revolvers, click and your clique's stalling\nYes y'all, involved in what you call arson\nSpit fire contents, meat market your carcass\nTrying to creep, put them where the crocodiles sleep\nGuns don't cock, we just let the fully automatic heat\nBoom!\n\n[Hook: Royce Da 5'9\"]\nBut I'mma let you tell it\nAnd you can ask me who's the illest around\nBut I'mma let you tell it\nYeah, I can probably tell you my opinion on that\nBut I'mma let you tell it\nDon't ask me, \"Who the illest MC?\"\nI'mma let you tell it", "image": "https://images.genius.com/4f966eb73a81b58069fb8aff648de307.700x700x1.jpg"}], "artist": "Royce da 5'9'’"}