{"songs": [{"title": "By my side - main", "album": null, "year": null, "lyrics": "Right by my side\nB. Hudson, Jadakiss, Ne-Yo\nI think it's me and you tonight ma, let's go\nThey say every good woman needs a thug\nThey say every good woman needs a thug\nGo baby, you so wavy\nAnd I ain't never felt this way 'bout no lady\nConsidering going half with you on your baby\nSomething about you, making me go crazy\nKnow if I ain't soured up, I'm so hazy\nMe and you on the same page, so amazing\nNeed your love girl, so many ways\nAnd we could only hold out for so many days\nAnd got enough points to score but you shaving\nHell yeah, I'm anxious, but you craving\nTime keep flying, I'ma keep trying\nAnd bottom line, I need your L-O-V-I-N\nCome on!\nGirl, make no mistake, right by my side\nLittle mama that's your place, keep holding me down\nAnd you can help me spend this cake, right by my side\nRide with me, all I need is you right by my side\nSuch a small fella to recognize the Mason Martin Margielas\nWhat could I tell her?\nMan, I swear you gotta see her to believe her\nThen maybe you could understand why I need her\nBesides her being a diva she wasn't bothered by the chiba\nZodiac sign was a Libra, definitely a keeper\nI just wanna put her in the sleeper, then fall out underneath her\nWake up, take a shower, then get deeper\nJuice up, get some power and then freak her\nAfter the feedback, then I could G Mack\nBut it's something about her love making me need that\nCome on!\nGirl, make no mistake, right by my side\nLittle mama that's your place, keep holding me down\nAnd you can help me spend this cake, right by my side\nRide with me, all I need is you right by my side\nWhen the drama comes my way\nLong as I got you, girl it's nothing\nBaby, it's nothing, I'm good\nWhen these streets, girl, come what may\nShorty, we do what we do, so it's nothing\nBaby girl, your love is something I need\nYo, they say every good woman needs a thug\nI totally agree, that's why I need your love\nAnd I can't help it if I'm selfish\n'Cause I need your love and nobody else's\nI'm starting to taste it, pardon the bracelet\nThe chance of a lifetime and I can't waste it\nIf being beautiful was a test, she'd have aced it\nHer skin is flawless, her hair is waist length\nHi I'm Jason and ma I'm patiently\nWaiting for us to have relations\nKissing me is just history in the making\nSqueezing and hugging, I need your loving\nCome on!\nGirl, make no mistake, right by my side\nLittle mama that's your place, keep holding me down\nAnd you can help me spend this cake, right by my side\nRide with me, all I need is you right by my side\nBounce\nBounce\nI think we got one\nWhat you think?\nBounce", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}