{"songs": [{"title": "Synergy", "album": "Top 5 Dead or Alive", "year": "2015-11-20", "lyrics": "[Click here to see what Jadakiss has to say about rapping back and forth with Styles P on “Synergy”]\n\n[Intro: Jadakiss]\nWhat?!\nHA-HAAAEEH! Uhh, ah yeah\nHA-HAAAEEH!\nYeah, Ghost...\n\n[Just Blaze]\nJust Blaze!\n\n[Verse 1: Jadakiss & (Styles P)]\n(We don't ride how you niggas ride)\nPolitics to the side, no one sicker than I\nFirst the devil will try to conquer (then he'll divide)\nIt's my job as a man (to forever provide)\nWhat's the meaning of livin' (since you barely survive?)\nIf you came from the dirt (now you touching the sky)\nYou keep fucking with me (you must be rushing to die)\nSo you better decide ('cause it's better to ride)\nI'm 2 slots after the 3rd dead or alive\n(You can give me the racks instead of the shine)\n'Cause I been doin' what I been doin' ahead of my time\n(If you ain't hearin' what I'm doin' you better rewind)\nThe only thing I'm scared of doin' is federal time\n(I sold crack out the building, several dimes)\nAnd I done counted up a million several times\n(Gold plated Desert Eagles, incredible nines)\nBetter flows, better fabrics, better designs\n(Family and loyalty) then the cheddar's behind\n(I put some money on ya head) or some bread on ya mind\n(We a problem alone) but we better combined\n(Do it for those not here) and forever confined\n(And we ain't promised tomorrow) so let's treasure the times\n(And we ain't givin' it away) so let's measure the lines\n(So keep killin' these niggas) pleasure is mine\n(We get better with time) so you better resign\n(Yeah) before death be the treasure you find\n\n[Chorus: Both]\nWe don't care\nCuban link, Rollie affair\nRoof missin', blowin' smoke in the air (HA-HAAAEEH!)\nFreaky women and Benjamins, soldiers was here\nYou know it's lit 'cause you know we was there\nAnd oh yeah, we don't care\nThrow a gun in the sky, get ya money and slide\nBut keep in mind, still ride or die\n\n[Verse 2: Jadakiss & (Styles P)]\n(What really make you the top 5?) Cannot lie\nDead or alive, you cannot find bars better than mine\n(Go head and ask the other 4)\nThe tip of the gun is hotter than the oven door\n(Get baked 'cause I'm half baked)\nBoss of the mob (you just a protege like Billy Bathgate)\nPrototype car at the crib 'cause the cash straight\n(Boss don dada) wa-dadda-dang\nListen to my 9 millimeter go bang\nHeroin and cocaine with Hov' (chilled with Dame)\nI got a gold (chain) and then them hoes (came)\nYup (red bottoms), the head got him\n(You don't wanna hear ya homeboys name and) the Feds got him\n(Niggas caught him slippin') hit him, the lead got him\nT5DOA (G5 Benz truck)\nWhen I was 19, I said I could sell a key a day\n(It ain't hard work if the white hard, spot jump)\nAnd I'm jumpin' in just like a lifeguard (on the deep end)\nWhat you know 'bout 50 on a weekday (100 on the weekend?)\n(Ya heard, man?\nNo we ain't Jeezy and Baby, but we Snowman and Birdman)\nManteca Jada, Perico Pinero\nAny further questions, you speak to the barrel\n\n[Chorus: Both]\nWe don't care\nCuban link, Rollie affair (what?!)\nRoof missin', blowin' smoke in the air\nFreaky women and Benjamins, soldiers was here\nYou know it's lit 'cause you know we was there\nAnd oh yeah, we don't care\nThrow a gun in the sky, get ya money and slide\nBut keep in mind, still ride or die\n(You know I'm the Top 5, what?!)", "image": "https://images.genius.com/9446bcee74c95e2da1688d832878aa59.1000x1000x1.jpg"}], "artist": "Jadakiss"}