{"songs": [{"title": "Busted in the Hood", "album": "Till Death Do Us Part", "year": "2004-03-23", "lyrics": "[B-Real]\nWell here's a little story I got to tell\nAbout a thugged out homey I know so well\nIt started way back, when I was a teen\nIn the hood, on the corner, slanging dope to fiends\nHad the little stash that could serve your need\nYou can do what you want but I got weed for me\nRiding for my fam, trying to hit a grand\nCRASH unit on my ass, now I'm in demand\nOne lonely family I be\nAll in the hood, I got nobody\nThe sun is beatin down on my red dark hat\nPigs are roaming through the alley so I gotta toss my gat\nForgot about the sack, looking for a place to hide\nIf they ask me for my name - fuck 'em, I'mma lie\n\n[Hook]\nOne O.G. gangster I be\nBusted in the hood, I got no more weed\nPigs are coming down on my gangster stash\nWhen they caught me with the weed and the dope and hash\n\n[B-Real]\nHe said a little something, I wasn't so impressed\nNo more running homey, now you're under arrest\nThe sack was in my hand, felt like a sack of bricks\nI swore he couldn't see it when I threw it in my whip\nHe said he wanted some, I said I don't have none\nFound it in the sun on the floor next to my gun\nNext thing I saw was the gun to my head\nNow the lead will make me dead, and yo this is what he said\n\n[Sen Dog]\nMy name is Sgt. Slacker with a license to kill (uh-huh)\nI think you know what time it is, it's time to get real (yea)\nNow what do we have here? A banger and his peers\n\n[B-Real]\nHe cuffed my hand you understand he threatened me with tears\nSorry motherfucker had his gun out with a grin\nYou think the story's over but it's ready to begin\n\n[Hook]\nOne O.G. gangster I be\nBusted in the hood, I got no more weed\nPigs are coming down on my gangster stash\nWhen they caught me with the weed and the dope and hash\n\n[Sen Dog]\nNow I got your crack and most of your crew\nYou got a couple choices of what you can do\nBetter make the right decision if you know what I mean\nYou can do some time or fork over your green\n\n[B-Real]\nI said I got no green he started looking at me harder\nI said I don't have nothing you can go fuck your daughter (what?)\nHe hit me with the fist, he hit me with the gat\nHe put the night stick to my back, so\nI think I'm done, the pig's got my gun\nIt isn't lookin good, I got ink on my thumb\nAnother pig walked in, said he's playing games\nHe gave another look at me, found out my false name\n\n[Hook]\nOne O.G. gangster I be\nBusted in the hood, I got no more weed\nPigs are coming down on my gangster stash\nWhen they caught me with the weed and the dope and hash\n\n[B-Real]\nSitting there pissed as I dwell in my cell\nThe place smells like shit in the County Jail\nHomey looking at me like he seen me before\nHe started throwing up a set, then he spit on the floor\nI think ay-yeah yo, I know this kid\nIt's the same motherfucker cocktailed my crib\nThis dude said, \"Get ready\", pulled a shank on me\nI said c'mon homey you a bit too sloppy\nFool tried to stab me, socked him in the eye\nThe guards yelled, \"Give it up!\" and let two fly\nThe guards said down and we hit the floor\nIf you make a move after you won't move no more\nHe said I see you once again best protect ya neck\nI said eat a dick from me you don't get respect\nI said you wanna come with it, any time and place\nAnd I'll leave you like Pacino with a scar on your face\nThey put him in the hole, and all the bullshit stopped\nBut when his boy had beef, yeah he got dropped\nP.D. had no witness, D.A. dropped the load\nI got probation for the gun and the dope, case closed\n\n[Hook]\nOne O.G. gangster I be\nBusted in the hood, I got no more weed\nPigs are coming down on my gangster stash\nWhen they caught me with the weed and the dope and hash\nOne O.G. gangster I be\nBusted in the hood, I got no more weed\nPigs are coming down on my gangster stash\nWhen they caught me with the weed and the dope and hash", "image": "https://images.genius.com/bbdbef4d71e94241d00e6cf766f68925.640x640x1.jpg"}], "artist": "Cypress Hill"}