{"songs": [{"title": "Dreamchasers 2 Intro", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Sample: Mike Tyson interview]\nI’m the best ever. I’m the most brutal and most vicious and most ruthless champion there’s ever been. There’s no-one can stop me. I’m Alexander, he’s no Alexander. I’m the best ever. There’s never been anybody as ruthless. I’m Sonny Liston. I’m Jack Dempsey. There’s no one like me — I’m from their cloth. There’s no one that can match me. My style is impetuous. My defense is impregnable, and I’m just ferocious. I want your heart. I want to eat his children. Praise be to Allah!\n\n[Intro: Meek Mill]\nYeah!\nGangsta Gri-zillz!\n\n[Verse 1: Meek Mill]\nIt's a lot of bad bitches in the building, amen (Amen)\nCame in the game killing niggas, J-Lin\nWhen it comes to whips, I'm on some shit\nI'm probably eight in (Woo!)\nAnd I got that four door Aston Martin on the way in\nY'all niggas come out (Come out), all the hoes stay in (Stay in)\nEvery time I come out (Come out), movie in the making (Yeah!)\nRealest nigga in it all you got to do is say it\nIf a nigga rap dissing, when I see him I'mma spray him\nLike bang, nigga it ain't no game (Game)\nPhilly niggas ain't the same, step in your lane (Lane!)\nBefore that chopper hit your brain stay out the frame (Frame!)\nCause when I let it bada-boom, that's bada-bang\nPussy nigga, ahhhh! Right back like I never left\nRollie on my wrist cost a Camaro, yeah, the double-S (Hater!)\nEver since I made a milli, I ain't been in trouble yet\nStill walk in the building and go bonkers with a hundred racks\nHundred stacks, hell yeah, hell yeah, fucking right\nBoy, I got your favorite singer really tryna fuck tonight (Ha!)\nY'all niggas was sleeping on me, I was really up at night\nTryna chase my dream, now I ball out the team\nMan, I lean off of this Phantom (Skrt!)\n\"I'ma Boss\" my anthem (yeah)\nMMG my clique, that's why your bitch all on my dick\nI got thirty racks in my pocket, I keep thirty shots in my clip\nI get thirty racks for my verses, y'all don't get paper like this\nI'm getting money, must be Illuminati\nThey think I signed up\n'Cause I just bought a new Ferrari (New Ferrari)\nAnd when I make a hundred I'mma buy a new Bugatti\nI be with some Philly niggas, they just trying to shoot somebody\nTell 'em (Tell 'em!), I swear I tried to tell 'em (Tell 'em)\nLampin' in this penthouse, I started from the cellar (Cellar)\nAnd if she want that hammer all up in her I'mma nail her\nWord to my nigga, Ricky, we gon kill the game this summer\nAhh!", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}