{"songs": [{"title": "How Great", "album": "Coloring Book", "year": "2016-05-12", "lyrics": "[Intro: Nicole Steen & Choir]\nHow great is our God?\nSing with me, how great is our God?\nAll will see, how great is our God? (Ooh)\nHow great (How great), is our God? (Oh)\nSing with me, how great (How great), is our God?\nAll will see, how great, how great is our God?\nName above all names (Name above all names)\nWorthy of all praise (And my heart will)\nAnd my heart will sing how great is our God?\nName above all names (Name above all names)\nWorthy of all praise (Worthy of all praise)\nAnd my heart will sing (Heart will sing), how great is our God? (Woah-oh)\nHow great (How great), is our God? (Is our God?)\nSing with me (Won't you sing?), how great is our God? (And all will see)\nAll will see how great (How great, how great), is our God? (Oh)\n(How great), how great (How great is), is our God?\nSing with me (Sing with me), how great is our God? (And all will see)\nAll will see how great (How great), how great (How great)\nHow great (How great), how great (How great)\nHow great, how great is our God? Oh\n\n[Interlude]\nThe first is that God is better than the world's best thing\nGod is better than the best thing that the world has to offer\n\n[Verse 1: Chance the Rapper]\nMagnify, magnify, lift it on high\nSpit a Spotify to qualify a spot on His side\nI cannot modify or ratify, my mama made me apple pies\nLullabies and alibis, the book don't end with Malachi\nDevil will win employee of the month by the dozen\n'Til one score and three years from the third when he doesn't\nMy village raised 'em a child, come through the crib and it's bustin'\nYou meet anyone from my city, they gon' say that we cousins\nShabach barak, edify\nElectrify the enemy like Hedwig 'til he petrify\nAny petty Peter Petigrew could get the pesticide,\n79th, 79th\nI don't believe in science, I believe in signs\nDon't believe in signing, I seen dollar signs, color white collar crime\nGood God, the gift of freedom,\nHosanna Santa invoked and woke up slaves from Southampton to Chatham Manor\nMy dream girl's behind me, feel like I'm James Early\nThe type of worship make Jesus come back a day early\nWith the faith of a pumpkin seed sized mustard seed\nHear, for I will speak noble things as entrusted me\nOnly righteous, I might just shrug at the skullduggery\nI couldn't stand to see another rapper lose custody\nExalt, exalt, glorify, descend upon the earth with swords\nAnd fortify the borders where your shortage lie\nI used to hide from God, ducked down in the slums like \"shhh\"\n\n[Verse 2: Jay Electronica]\nI was lost in the jungle like Simba after the death of Mufasa, no hog, no meerkat\nHakuna matata by day, but I spent my night time fighting tears back\nI prayed and prayed and left messages, but never got no hear back\nOr so it seemed\nA mustard seed was all I needed to sow a dream\nI build the ark to gently, gently row my boat down Noah's stream\nSometimes the path I took to reach my petty goals was so extreme\nI was so far down in the mud, couldn't even let my light shine\nBut you was always there when I needed to phone a friend or use a lifeline\nFrom a lofty height we wage war on the poltergeist with the exalted Christ\nSpark the dark with the pulse of light\nStrike a corpse with a pulse of life\nI spit on the Tidal, it's tidal waves\nI spit on the Apple and kill a worm\nA fire in Cali'll swallow a valley\nFor every African village burned\nJay Elect would've never made it\nO' son of man, O' son of man\nWho was the angel in Revelations\nWith a foot on water and a foot on land?\nWho was the angel that rode a Harley\nFrom the project to the house of Parliament\nAnd opened the book in the Devil's chamber\nAnd put the true name of the Lord in it?\nOld Jerusalem, New Jerusalem\nComes like this beast with a ball of fire\nThey poisoned the scriptures\nAnd gave us the pictures of false messiahs, it was all a lie\nMystery babylon tumbling down\nSatan's establishment crumbling down\nThis is the year that I come for the crown\nBury my enemies under the ground", "image": "https://images.genius.com/b17a54d05a3de269cc6ea53c3f71f73e.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}