{"songs": [{"title": "I Don’t Like", "album": "Top 40 Underdog Series", "year": "2012-12-02", "lyrics": "[Intro]\nBismallah/Basmalah\nFirst of all shout and respect to ?\nShout and respect to Lupe Fiasco\nShout out to Mr. West\nShout out to Rashid Lonnie Lynn\nKing Louie, L.E.P Bogus\nWhole Chicago movement\nReal Recognize Real, check it!\n\n[Hook]\nWhite supremacy is what I don't like!\nSugar-ass crackers, what I don't like!\nThe Bank of America, I don't like!\nWhen they lynch and cynicism, yeah I don't like!\nI don't like, I don't like\nThe way the ghetto living, man I don't like!\n\n[Verse 1]\nGot us strapped up in the system, man I don't like\nAin't too different from a prison jacket, ain't right\nAin't no freedom at the trap, hustlers everywhere\nYou could feel it in the air, pure despair\nHungry hands only take when they reaching out\nCampaign, smoking, geek up, gun pow\nUgly politicians, new election year\nCrying bout their care, they are not sincere\nIt's the greedy and the rich ones that make war\nThat the hungry, young, and poor ones paid for\nThe little homie stretched out in a coffin\nThey dying younger, and they dying more often\nThe rent too high, the wage too low\nThe top five stupid songs up on your radio, nah!\nI don't like (I don't like)\nAll this cackling and caring on, I don't like\nAll this sucka-ness and scary shit I don't like\nAll these Afri-coon Americans, it ain't right\nAnd that goes to crazy-ass crackers\nSmall claim corp. clowns, and strip club rappers\nOut in broad day with they nipples out\nWith they stretch marks, blackheads and pimples out\nYuck, you suck, go away\nYou're always talking, and you never got much to say\nYuck, you suck, go away\nYou're always crowding space, fix your thirsty face, nah!\nI don't like, I don't like\nThe way your shoulders looking sound, I don't like\nThe way I see 'em getting down, I don't like\nMake you wonder how they get around, it ain't right\nIn the land where crooks get to write the laws\nBut people hide their eyes, and shut their jaws\nWho the realest? Never mind\nWho doing it for the best, there ain't lies\nWhat they wearing, who is there?\nAsk yourself, why you care?\nSomebody going ham on a gossip site\nCatching feelings over rumors that are not your life\nI don't like, sometimes I even hate\nBut not the people, they acts and ways\nI don't like, sometimes I even hate\nLord forgive, let us pray\nFor pussy posers, dummy greed\nPolluted seas, them wacky weeds\nNazi po-lice, wasted time\nZombie recruitment, legal crime\nI don't like\nYou don't like it neither\nYou said...\nRebuke, forgive, and pray for these fake niggas", "image": "https://images.genius.com/ce0e2c6d6ae9fec90c32c39501778107.557x557x1.jpg"}], "artist": "Yasiin Bey"}