{"songs": [{"title": "Shake Them Haters Off", "album": "Chicken Talk", "year": "2006-10-11", "lyrics": "[Intro]\nYeahhh, chyeah, meowww\nBig Kitty Records, meowwww\nLa Flare Entertainment\nI don't care about your tattoos nigga\nGot another nigga name tatto'd on you like you was a bitch\nI can't do that nigga (I can't do that dog)\nI'm too real, I fuck with realest niggas\nHow you gon get another nigga tattoo'd on your arm nigga?\nWhat you Lil Wayne nigga? nigga ain't even got no car\n\n[Chorus:]\nI shook dem haters off [16x]\n\n[Verse1 :]\nI'm the type of guy, hit the studio smoking dro\nAnd you the type of guy, in the O with none to smoke\nNow I'm the type of guy, hit the club and I make it rain\nAnd you the type of guy like, Cat buy me a chain\nI'm the type of guy, hit park and drop my top\nAnd you the type a guy, baby mamma at the bus stop\nNow I'm the type a guy, swing on you soon as I see you\nYou got on them Dickies, I got on them Evisu's\nI'm the type of guy, keep money cause I be hustling\nYour the type of guy, I use to pay to tow my luggage\nAnd you the type of guy, hit the mall but window shopping\nGucci can I be your hype man? hell nah you garbage\n\n[Chorus:]\nI shook dem haters off [16x]\n\n[Verse 2:]\nYou the type of bitch. old as hell still trying to rap\nAnd I'm the type of nigga, young as hell and I run the trap\nNow your the type of freak, say lick your Georgia peach\nYou married to a lame, and that lame don't won't no beef\nNow he the type of nigga that an old lame ass bitch would want\nAin't never drank no beer, ain't never rolled no blunt\nNow she the type a girl, ain't got no ass on her back\nNo Kirk ain't got no money I heard she fucking cat\nNow Jace the kinda guy go both ways think I don't know\nI heard he fucking Kirk in ass on the D-Lo\nNow Jace the kinda guy tell you, you gon make millions\nBut he's a pedophile, on the low he fucking children\n\n[Chorus:]\nI shook dem haters off [16x]\n\n[Verse 3:]\nNow your the type of guy, put a soldier rag on your stuff\nBut let a nigga black your eye, nigga at yo prom\nNow you the type of guy rap about it but you don't live it\nAnd I'm the type of guy catching charges bout to go to prison\nYour the type of guy in a five year old jersey\nYou say you got Grown Money but your ones so dirty\nNow your the type I look at like my lil sister\nA nigga black your eye and you, you had a pistol\nYou're the type guy always talking bout pimping\nYou claim you from Bankhead, but really yo ass from Griffin\nYou the type of guy who never gon be shit\nAin't never gave you three dollars, I know you'd suck Cat dick\n\n[Chorus:]\nI shook dem haters off [16x]\n\n[Outro:Gucci Mane Talking]\nYeah, Gucci Mane in the building man\nI just murked the track dog\nYou feel me\nBlood in blood out we in the building dog\nZone 6 la flare entertainment\nSo Icey Entertainment dog\nWe ain't letting shit slide dog\nRight now I got a Vette dog\nI told em I don't even want a spare tire cause I ain't sparing anybody\nNah mean? don't give me no radio cause I ain't played on the radio\nYou feel me dog\nAnd on the real talk dog\nLet me talk about these niggas real quick dog\nThese nigga shoes dirty as fuck dog\nThese niggas talk about they got pistols can't even buy bullets\nThese niggas, I'm give you scenario fact\nIt's like this, fact, I'm at the club, I'm performing\nYou wanna beef with me? the difference is, it's like I wanna beef with him but\nCan you get Gucci Mane to get us through the door to beef with him\nCause we ain't got no money to get in\nI mean I got like, 30 dollars, and Snead got no money\nAnd I got 30 dollars cause I robbed sneaker man for 2 pair of air force ones\nYou bitch ass nigga, you's a broke nigga. with 100 dollar lick hitting ass nigga\nIf you wanna step up to the plate nigga and get you some real beef and beef with a real nigga\nNigga I'm in East Atlanta nigga, Moreland Avenue all day every day nigga\nRiding around nigga, you'll see me in that yellow Vette, that candy red 74 Oldsmobile on 6s\nNigga my rims cost more than your whole life nigga, no money getting ass nigga\nNigga ain't never did a show, nigga ain't never got paid for a feature\nNigga you not really a rapper nigga, you like a nigga making demos nigga\nYou had one mixtape nigga that shit ain't did shit nigga\nNigga you not known nobody knows you dog\nAnd guess what I'll call everybody name out except yours\nNobody will never know you dog I swear\nBlack who? oh you mean who? I'm gone dog, You better beef with them other niggas\nCause I'm not a sucka dog, I'll ruin your motherfucking grill, you bitch", "image": "https://images.genius.com/fd50390549db246760c0aa670d9948cf.400x400x1.jpg"}], "artist": "Gucci Mane"}