{"songs": [{"title": "Moment 4 Life", "album": "Pink Friday", "year": "2010-12-07", "lyrics": "[Verse 1: Nicki Minaj]\nI fly with the stars, in the skies\nI am no longer trying to survive\nI believe that life is a prize\nBut to live, doesn't mean you're alive\nDon't worry 'bout me, and who I fire\nI get what I desire, it's my empire\nAnd yes, I call the shots, I am the umpire\nI sprinkle holy water, upon a vampire ('Pire)\nIn this very moment, I'm king\nIn this very moment, I slayed Goliath with a sling\nThis very moment I bring\nPut it on everything, that I will retire with the ring\nAnd I will retire with the crown, - yes!\nNo, I'm not lucky, I'm blessed, - yes!\nClap for the heavyweight champ - me!\nBut I couldn't do it all alone - we!\nYoung Money raised me, grew up out in Baisley\nSouthside Jamaica, Queens and it's crazy\n'Cause I'm still hood, Hollywood couldn't change me\nShout out to my haters, sorry that you couldn't faze me\nAin't being cocky, we just vindicated\nBest believe that when we're done, this moment will be syndicated\nI don't know, this night just reminds me of\nEverything they deprived me of (Kyuh!)\nP-p-p-p-put ya drinks up!\nIt's a celebration, every time we link up\nWe done did everything, they can think of\nGreatness, is what we on the brink of\n\n[Chorus: Nicki Minaj]\nI wish that I could have this moment for life, for life, for life\n'Cause in this moment, I just feel so alive, alive, alive\nI wish that I could have this moment for life\nI could have this moment, I could have this moment\nFor life, for life\nI could have this moment, I could have this moment\nThis is my moment, I just feel so alive\nI could have this moment, I could have this moment\nAlive, alive\nI could have this moment, I could have this moment\n\n[Verse 2: Drake]\nYeah, yeah, yeah, uh\nWhat I tell 'em hoes? Bow, bow, bow to me, drop down to ya knees\nYoung Money the mafia, that's word to Lil' Cease\nI'm in The Dominican, Big Papi Ortiz\nDoing target practice, all these bitches just aiming to please\nShout-out to the CEO, \"500 Degreez\"\nShout-out to the OVO, red wings and fatigues, oh\nNiggas wanna be friends, how coincidental\nThis supposed to be y'all year? We ain't get the memo\nA young king, pay me in gold\n40 got a bunch of weed he ain't even roll\nThese niggas be droppin' songs, they ain't even cold\nWeezy on top and that nigga ain't even home, yet!\nYeah, be very afraid\nThese other rappers getting bodied and carried away\nFuck it, me and Nicki Nick gettin' married today\nAnd now you bitches that be hatin' can catch the bouquet, ooh\nYeah, you a star in my eyes\nYou and all them white girls, party of five\nAre we drinking a lil' more? I can hardly decide\nI can't believe we really made it, I'm partly surprised, I swear\nDamn, this one for the books, man\nI swear this shit is as fun as it looks, man\nI'm really tryna make it more than what it is\nCause everybody dies but not everybody lives, ah!\n\n[Chorus: Nicki Minaj]\nI wish that I could have this moment for life, for life, for life\n'Cause in this moment, I just feel so alive, alive, alive\nI wish that I could have this moment for life\nI could have this moment, I could have this moment\nFor life, for life\nI could have this moment, I could have this moment\nThis is my moment, I just feel so alive\nI could have this moment, I could have this moment\nAlive, alive\nI could have this moment, I could have this moment\n\n[Bridge: Nick Minaj]\nThis is my moment, I waited all my life\nI can tell it's time\nDrifting away, I'm one with the sunsets\nI have become alive\n\n[Chorus: Nicki Minaj]\nI wish that I could have this moment for life, for life, for life\n'Cause in this moment, I just feel so alive, alive, alive\nI wish that I could have this moment for life\nI could have this moment, I could have this moment\nFor life, for life\nI could have this moment, I could have this moment\nThis is my moment, I just feel so alive\nI could have this moment, I could have this moment\nAlive, alive\nI could have this moment, I could have this moment", "image": "https://images.genius.com/44a8be97aef4cdd5114bd6cec02b2357.1000x1000x1.png"}], "artist": "Nicki Minaj"}