{"songs": [{"title": "Jamba", "album": "Wolf", "year": "2013-04-01", "lyrics": "[Verse 1: Tyler, The Creator]\nPop ain't call even though he saw me on TV, it's all good (Fuck you)\nBut now my balls, balls deep in this broad's jaw\nSwallow girl, it's just nut\nBitches scared to let me smash on they ass\nYeah, they heard I'm fuckin' nuts like the swag of a fag\nLike me and Tekeli was gagging in the back of the cabin\nCamp Flog Gnaw, nigga, you can tell by the badge\n(Hodgy, pass me my inhaler)\nI'm sick of hacking and coughing, I'm often this fucking awesome\nI'm animal, Noah's arking, all from this rapping nonsense\nFour stories in my home like \"What the fuck's an apartment?\" (nigga?)\nGet shit poppin' like Peter's pores during puberty\nTake bets on how quick Tyler can reach maturity\nCussing out Siri like a waitress with no patience\nOh, you want a tip bitch, well here's my dick for gratiturity, bitch\n\n[Hook: Tyler, The Creator]\nShut 'em down!\nNigga, shut 'em down!\nShut 'em down!\n\n[Verse 2: Hodgy Beats]\nI tumble-crush on huzzy sluts, give money up then nutty butt\nProfessor Nutty Buddy Klump gets petty when you touch his lunch\nLike, what the fuck? I'm drunk as fuck, turn the fucking music up\nSo I can't hear these stupid fucks, talk-no-walk, let you discuss\nYou're talking too much, who the fuck are you to us? Uterus\nI put that on my pubes and nuts, if I don't begin moving up\nI'm shooting up, you and her crew on turf, new desert\nI can see the bitch in a nigga through his shirt\nI can smell the whore on a bitch when she walk around my crew to flirt\nIt's on ya' shoulder, lose the dirt, yeah, it's the movement first\nFuck a human nurse! I'm ill I used this earth to infuse the birth\nOf my scrotum on the Channel 10 news, my only motive is to\nSkip to my Lou, get hip to the pew\nYou can drink piss and eat a dick in a few, the sickening view\nOf visuals, woo, I'll eat your ribs, I'm a wolf\nThen meet your kids after school, and give them drugs cause it's cool, fucker\n\n[Hook: Tyler, The Creator]\nShut 'em down!\nNigga, shut 'em down!\nShut 'em down!\n\n[Verse 3: Tyler, The Creator]\nHodgy, fuck this beat, nigga, let's smoke weed\nThat shit I need, be the shit that's green\nA little purple and pink, come get some Swisher Sweets\nAbout three or four more than needed be\nI got a eighth I could face, I got a blunt flavored grape\nI hate the grape, I could taste it when I'm inhaling the vapes\nYou could smell us in places when we walk in our clothing is always covered in flakes\nEnough for two shake blunts; and what the fuck is this? Uh...\nI think this Mary is laced; my heart is beating at paces\nThat Pacquiao can't relate I'm fucking faded like gradients\nShit, I'm stuck like tape that's super glued\nTo the center of Kelly Price first waist\nIt's like my first date with Mrs. Mary, the shit is scary\nThe paranoia from this marijuana's very heavy, I'm lifted\nFainted by my fifth hit, Lionel, pass the sherm\nLet's use the Philly as a dipstick for this bath salt, you dipshit\n\n[Domo Genesis]\nC'mon, my nigga. You don't even smoke, you weak as fuck, my nigga. You do not smoke, no tucks, my nigga. You're as weak as.. F your butt my nigga. Oh, mark ass nigga, Cuh, oh my God, bro. Here come this weak-ass nigga, Samuel", "image": "https://images.genius.com/dde81a162bfe7b81092c8630cdf16d70.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}