{"songs": [{"title": "Pilot", "album": "Animal Ambition: An Untamed Desire To Win", "year": "2014-03-20", "lyrics": "[Produced by Shamtrax]\n\n[Hook]\nMe, I'm like a pilot, G5 Jet I'm fly as shit\nYou cannot deny it, oh no, no-no, no-no\nBitches be on my dick, designer threads, I'm fly as shit\nYou cannot deny it, oh no, no-no, no-no\nBetter back up off me, bitch, watch me ball (ball)\nBetter back up off me, bitch, watch me ball (ball)\nBetter back up off me, bitch, watch me ball (ball)\nBetter back up off me, bitch, watch me ball (ball)\n\n[Verse 1]\nNigga every law and every rule I break\nFeds tryna watch the moves I make\nEveryday I get birthday cake\nThere's a hundred racks there in that safe\nHundred grams there on that plate\nI ain't thinkin' 'bout catchin' no case\nNigga my safe house super safe\nI zip Giuseppe's, I don't tie no lace\nTom Ford, Y-S-L, nigga, run and tell, I'm fly as hell\nBig Bentley, Mulsanne, no LP, just two songs\nA-side, B-side, Ryder gang, bitch, that's right\nFrom N.O. to N.Y, I got shooters bitch, don't act cute and shit\nWe was born broke, no silver spoon\nMy niggas strapped, they super goons\nThese niggas here kinda soft\nWe get the bread, then fuck it off\nGet more money, then fuck it off\nMake your bitch wan' suck me off\nWe ain't had shit, we learned to ball\nThem ghetto bitches they love us all\n\n[Hook]\n\n[Verse 2]\nShorty bounce it and she clap that\nSlide down the pole, she's a super ho\nThat gold cuban, I jack that\nYou niggas know how this 'sposed to go\nI'm in the club with niggas, I clap that\nThat P90 I pack that\nYour fuckin' head, I crack that\nYou wan' test me? Don't test me\nLook, lover boy what're you trippin' for?\nNiggas don't even want your ho\nMy nigga Ill fresh out the pen\nYou gonna make him go back again\nThem bottles coming, we turnt up\nThem sparks burnin' now watch us shine\nYou do this shit once a year\nWe do this shit all the time\nNow captain come and save her\nGet her from around this paper\nShe'll never be the same\nI mean like everything will change\nShe cute blow a little cheese on her\nGet her ass shots, throw D's on her\nThem shoes more than you think though\nMy bitch look like my bank roll\n\n[Hook]", "image": "https://images.genius.com/df5f960b0570dafe172535ca49869715.640x640x1.jpg"}], "artist": "50 Cent"}