{"songs": [{"title": "9th Inning - With Timbaland", "album": null, "year": null, "lyrics": "(Intro - Timbaland)\nYeah, yeah, check this\n\n(1st Verse - Missy Elliot)\nNow I'm in the 9th inning\nThought I fell off ain't quite finished\nYeah I'm 'bout to put my foot in it\nTalk with it, walk with it, I'm no gimmick\n2012 there'll be no games\nReal rap, real pause, I'm not playing\nHaters you all lame, you ain't miss a thing\nI'm a beast in the booth, I'm just saying\nI make 'em wanna get low\nDuck with it, buck with it, let's go\nEvery time I spit a rhyme it's a sick flow\nYou newcomers better sit back and take note\nThis here my time. Here I come, better run take what's mine\nAbout to let off like a tech nine\nThis rhyme gon' make 'em push rewind\nYeah I'm so hot\nUp on the charts, number one spot\nSee me when I drop and I won't flop\nMissy never stop got the music game on lock\nWhen I get served\nYou third, you second but I come first\nFlip my verse like I flip birds\nI'm fine, Yes Sir\n\n(Chorus)\nWe hitmakin', hitbreakin', party shakin', innovating\nGroundbreakin', sole creatin'. We be the most anticipated\nHitmakin', hitbreakin', party shakin', innovating\nGroundbreakin', sole creatin'. We be the most anticipated\n\n(2nd Verse - Timbaland)\nNow I'm in the 9th inning\nN***** think I fail when I'm still winnin'\nSo I've been gone for a hot minute\nI love this shit, that's why I gotta gift in it\nF*** n***** get fly\nN**** can't talk with a gun in his mouth\nN****s b**** up and they run in their house\nI can smell bulls*** when they walk by\nHeard that old saying yo\n\"Never ever cross a one day, give ya most\"\nNever ever act funny for the white folk\nI'm a big fish remember you a tadpole\nI like Lady Gaga. Why you let a n**** do your whole album?\nWhere you think that fake producer got ya style from?!\nCome f*** with a n****, watch the outcome\nAin't no real artists\nWack talent get in, real starvin'\nAll you hear in music is a chorus\nWell that's okay Timmy back in the story\n\n(Chorus)\n\n(During Chorus - Missy Elliot)\nY'all can't be serious\nWe break records, I done told y'all\nHow many of y'all got a catalogue this long?\nDon't worry, I'll wait!\n\n(3rd Verse - Missy Elliot)\nDown to the 9th inning\nI'm the real deal, y'all pretendin'\nYears later my songs still spinnin'\nI do record deals no less than ten milli\nMy hits be yay long\nMy songs go on like a marathon\nGet ghost, get gone, you a dum-dum\nBetter round here, come on biters like a python\nWhen I act fly\nWhen I act like you better than a M-I\nShakin' em, bakin' em all like a bean pie\nTakin' em, burnin' em down like I'm left Left Eye\nFuturistic\nY'all can pack it up, I done ripped it\nWhen you say my name call me Miss Bitch\nI make the next chick run to the exit\nYeah I got a Sixth Sense\nI'm makin' this a movie like a Netflix\nI'm on the guest list, on the check list\nI'm the flyest chick, now tell me who the best is?!\nElliot be the name\nElliot back in the game\nElliot hit 'em with a BANG!\nBring the hook back in Timbaland\n\n(Chorus)\n\n(Missy Elliot during chorus)\nDid y'all forget?! I think they forgot!\nThey think we done\nAll we do is make hits?!\n\n(Outro - Missy Elliot)\nAnd if you want a hit? Maybe we'll return your call\nDon't call collect\n(Operator Voice)\nYou have a collect call from... (Dial Tone)", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}