{"songs": [{"title": "Low", "album": "The Infamous Mobb Deep", "year": "2014-04-01", "lyrics": "[Verse 1: Prodigy]\nYeah\nSecret love, that's what this is\nI gotta go, the wife and kids\nDon't want to leave it, you already know\nWe so in love but what can we do?\nMy wife is your best friend\nHow the fuck did we let this thing get so far gone?\nThere's no way we could fix it\nBaby boy on the way, if she only knew that's mines\nShit is like a daytime soap or movie on Lifetime\nBut nah, nigga, this real life and it hurts\nMissin' you or lyin' to her I don't know what make it feel worse\nAnd me puttin' her first makes me feel like shit\nI hate seein' you cry, wipe away your tears\nFuck it, I'ma just leave her but what about our kids?\nDon't wanna break they little hearts, let's wait a few more years\nOh God, I swear to God I wish that we could just bounce\nDon't even pack no bag, just break the fuck out\n\n[Chorus: Mack Wilds]\nHow can we love when we love\nIf this love is never supposed to be\nLivin' lies that the truth could see\nSo now tell me love, can we love\nIf we know this love can't be this way\nLet's keep this love low\n\n[Verse 2: Havoc]\nMy feelings for you got me feelin' foul\nHow we even get here?\nFeel funny being in here, my homie used to live here\nWhen he died, a part of me died\nSeein' you have to suffer, just wanted to comfort not turn into lovers\nThat shoulder you could lean on, I know shit got you stressin'\nThe kids askin' for daddy, they keep askin' the question\nCame around to check up on y'all, I know my homie do the same\nGuilty like a motherfucker, how we get into this thing?\nThat love shit is real, is all that wrong?\nPeople lookin' at us like we crazy\nNow we spend nights on the phone all night long\nGot so much in common, this shit is crazy\nIt's more than just physical 'cause mentally you stimulate me\nAnd if I ain't up on it, baby, you just educate me\nAnd vice-versa, that's what we both in search of\nWant to love and get it, somebody that we could nurture\nIs it wrong?\n\n[Chorus: Mack Wilds]\nHow can we love when we love\nIf this love is never supposed to be\nLivin' lies that the truth could see\nSo now tell me love, can we love\nIf we know this love can't be this way\nLet's keep this love low", "image": "https://images.genius.com/d36f3c5fdf16cb402e39bef763e25bf4.1000x1000x1.jpg"}], "artist": "Mobb Deep"}