{"songs": [{"title": "Badunkadunk", "album": "Kamikaze", "year": "2004-01-27", "lyrics": "[Hook: Jazze Pha]\nBadunkadunk - all in your face when you're at the club\nBadunkadunk - slide down the pole for the dirty dub\nBadunkadunk - look at your ass girl, it's so much fun\nBadunkadunk - I tell the DJ, I need a hundred ones\nBadunkadunk - What!\nBadunkadunk - Drop your\nBadunkadunk - all that\nBadunkadunk - bounce your\nBadunkadunk - big fat\nBadunkadunk - I love your\nBadunkadunk - I tell the DJ I need a hundred ones!\n\n[Verse One: Twista]\nOh shit!\nDamn shorty! Look at the motherfucking fatty!\nCome to daddy\nTell me what I've got to do to get you licking in my custom Caddy\nNever want to let you get up out the ride\nWhen I first took a look my mouth was wide\nLook at titty's with them little, bitty shorts\nYou got on with the thighs hanging out the side\nWhen you work it you gon' hurt these other bitches. (That's right)\nTurning me on with the way you're strutting\nEven though you only walking\nIt be still looking like you shouldn't do that shit in public\nI can tell it now from what I see you're working with\nYou ain't even got to ask for the blunt\nBooty so fat\nGap so nice you can see the ass from the front\nYou fitting to hurt me how you twerk that thing\nYou get me heated when you pop it, baby!\nFell in love when you came up in the club\nWith the whole bottle of Mo', don't pop it, baby!\nI know you got up in a rump shaker contest\nLet us see what you can do\nSip a little something while you bounce that ass\nGirl, you got to badunkadunk!\n\n[Hook: Jazze Pha]\nBadunkadunk - all in your face when you're at the club\nBadunkadunk - slide down the pole for the dirty dub\nBadunkadunk - look at your ass girl, it's so much fun\nBadunkadunk - I tell the DJ, I need a hundred ones\nBadunkadunk - What!\nBadunkadunk - Drop your\nBadunkadunk - all that\nBadunkadunk - bounce your\nBadunkadunk - big fat\nBadunkadunk - I love your\nBadunkadunk - I tell the DJ I need a hundred ones!\n\n[Verse Two: Twista]\nNow put that ass in Burberry for the Bentley\nNow go and put on the bikini for the Lamborghini\nNow let me see you in a thong for the big Brougham\nAnd when you shake it for the dollar, holler when you see me\nNow I don't want to see no fatty full of rigor mortis\nGo ahead and jiggle it for the one with money in his hands\nGo and get up off the stage with your thick ass\nAnd come over here by the table and give me a lap dance\nBend it over, come and get this dust\nGot a player thinking that we fitting to cut\nGots to hit that from the back\nShorty got a little junk in the trunk\nLook at how she make one butt cheek freeze\nLook at how she make the other cheek move fast\nLook at how she switch, make the other cheek move\nThen work both sides and clap that ass\nRemember them times\nWhen you met two shorty's and you really want the cutey\nBut you let her slide\nCause the other girl with her got a big old donkey booty\nNow shorty think she fine\nOnly if she really knew the truth\nI ain't gon' lie girl, twerk them thighs\nI'm in love with your big badunkadunk\n\n[Hook: Jazze Pha]\nBadunkadunk - all in your face when you're at the club\nBadunkadunk - slide down the pole for the dirty dub\nBadunkadunk - look at your ass girl, it's so much fun\nBadunkadunk - I tell the DJ, I need a hundred ones\nBadunkadunk - What!\nBadunkadunk - Drop your\nBadunkadunk - all that\nBadunkadunk - bounce your\nBadunkadunk - big fat\nBadunkadunk - I love your\nBadunkadunk - I tell the DJ I need a hundred ones!\n\n[Verse Three: Twista]\nCan you make it go wobbly wobbly?\nCome on and follow me, take you on a bodily odyssey\nAnd uh, if you let it go jiggly jiggly\nMaking it wiggly baby you can never get rid of me\nAnd uh, twerk something!\nOh yeah! Bet the booty's softer then a teddy bear\nSo fat I could barely stare\nGirl the derriere's kind of scary there\nCome and drop it for the nigga named Twista\nCome and pop for me like a pistol\nGot badunkadunks from my mob\nAnd I got badunkadunks for Jazze Phizzle\nGirl you deserve respect\nYou look so good girl I commend you!\nThe hottest thing on the menu\nWhen I'm off up in the strip club I like when you\nStrut that thing, floss that ass\nWork it all the way down to the floor\nClimb to the top, shake it upside down\nSlide down the motherfucking pole\nWork that crowd, give a lap dance\nShake it like it's one eighty proof\nTake all the ballers up in VIP\nGirl go and work your badunkadunk\n\n[Hook: Jazze Pha]\nBadunkadunk - all in your face when you're at the club\nBadunkadunk - slide down the pole for the dirty dub\nBadunkadunk - look at your ass girl, it's so much fun\nBadunkadunk - I tell the DJ, I need a hundred ones\nBadunkadunk - What!\nBadunkadunk - Drop your\nBadunkadunk - all that\nBadunkadunk - bounce your\nBadunkadunk - big fat\nBadunkadunk - I love your\nBadunkadunk - I tell the DJ I need a hundred ones!\n\n[Outro: Jazze Pha]\nShake that thing girl! (This)\nWork that thing girl! (is a Jazze fizzle)\nShake that thing girl!\nWork that thing girl! (productshizzle)\nShake that thing girl! (my nizzle)\nWork that thing girl! (Twista!)\nShake that thing girl!\nWork that thing girl! (Legit balling daddy!)\n\n[adlib]\n(Ball out daddy!)\n(Spend some daddy!)", "image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg"}], "artist": "Twista"}