{"songs": [{"title": "Hello", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro]\nHello\nAllow me to introduce myself\nMy name is Shady\nIt's so nice to meet you\nIt's been a long time\nI'm sorry I've been away so long\nMy name is Shady\nI never meant to leave you, yeah\n\n[Verse 1]\nYou see that chick in the gym, checking me out?\nAny second I'm 'bout to stick her neck in my mouth\nI lose a pill and I'm recklessly wreckin' the house\nThat was supposed to be breakfast, where the heck is it now?\nThere's the necklace I lost, right next to Stephanie's blouse\nMan, I should check to see if my mom left any out\nNope, guess I'll re-route\nMaybe somewhere in the depths of the couch\nOh, jackpot, yeah, open sesame mouth\nDown the hatch, and the feeling you can't match it\nI rat-tat-tap on your door with a damn ratchet\nAttack-tack-tacking a whore with a damn hatchet\nA knapsack packed with like forty-some Xanaxes\nShorty come back, I'm tryna score me some lap dances\nI'm 'bout to relapse, so baby pour me some Jack Daniel's\nFormula 44D and 40's with bad capsules\nThe bad apple spoils the bunch, I'm back at ya\n\n[Chorus]\nGirl, I don't mean any harm\nAll I wanted to do is just say hello\nAnd are you menstruating, baby?\nMy little friend's waiting to say hello\nThe way your titties are wigglin'\nAnd your booty's shakin' like jello\nGirl, I don't mean any harm\nAll I wanted to do is just say hello, yeah\n\n[Verse 2]\nMy equilibrium's off, must be the lithium\nI don't need to buy any drugs, man, people give me 'em\nIt just becomes everyday, extra-curriculum\nNo reason in particular, it was strictly fun\nA fifth of rum and two bottles of 151\nFifty-one people asleep in my damn living room\nExcuse me, hun, but what is your name, Vivian?\nI woke up next to you naked, and uh, did we, um?\nOf course we did, but didn't I strap Jimmy, hun?\nI'm looking for the torn wrapper but there don't seem to be one\nNo offense baby girl, I don't mean any harm\nBut disease is something I'm trying to keep my penis free from\nI find the package and I'm cool, I immediately run\nLike Speedy Gon-zales to see if I see anyone\nWho might have a couple of 3's, I'm fiending for some\nMy head is pounding to the beat of the drum\n\n[Chorus]\nGirl, I don't mean any harm\nAll I wanted to do is just say hello\nAnd do you happen to have anything on you\nTo make my mood mellow?\nSome are oval and some are pink\nSome are blue and some are just yellow\nGirl, I don't mean any harm\nAll I wanted to do is just say hello\n\n[Verse 3]\nOh, those were the days, they certainly were\nIt's hurting me to know that I'll be closing that curtain for good\nWord-word, chk-word-word, chk-word, chk-chk-word\nI second that and I third, rushed to emergency surgery\nTo try to flush me because of the drugs that he purchased\nHe's no longer getting them free, hundred bucks for these Percodans\nPlus it's getting to be where he lustfully search the den\nPain is hitting his knee and his muscles be hurtin' him\nTirelessly on the phone trying to rustle up\nMuscle relaxers for his back and a couple of Paxils\nNow he's doubling backwards and he's stumbling back\nSlipped and fell, hit his back, boom, heard something go crack\nNow he's up in the bathroom like he's busting a nap\nAlmost ended it that soon because of the fact\nI'm just busting my own chops while I'm busting a rap\nResuscitated and rejuved, so fuck it, I'm back\n\n[Chorus]\nGirl, I don't mean any harm\nAll I wanted to do is just say hello\nAnd do you happen to have anything on you\nTo make my mood mellow?\nSome are oval and some are pink\nSome are blue and some are just yellow\nGirl, I don't mean any harm\nAll I wanted to do is just say hello\n\n[Outro]\nAnd so I'm saying, hello\nAllow me to introduce myself\nMy name is Shady\nIt's so nice to meet you\nIt's been a long time\nI'm sorry I've been away so long\nMy name is Shady\nI never meant to leave you\nYeah, it's like starting over\nClean slate, hah", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}