{"songs": [{"title": "As Soon As I Wake Up", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Intro]\n\"To really to be a creator, you must ask yourself, 'In the stillest moment of your night, if it were truly denied you to create, would you die?' And if your answer is yes, you have no choice. That is your choice, because there is no euphoria in a different place for an artist. That's where you are; that's what you do. That's it and it's not an easy life, but it's your life.\"\n\n[Hook]\nAs soon as I wake up\nI'm gonna change my ways\n'Cause the music's my savior\nAnd no one can take my pain\nExcept for this paper\nThe page, it flows like rain\nAs soon as I wake up\nI'm gonna change my ways\n\n[Verse 1: Xperience]\nInstead of staying the same\n'Cause I see better days ahead of me\nI paint them on the page\nThen I save them for the rainy ones\nWhen anger and the anguish want to hang around\nI say 'em outloud and complain to them\nI figure I'm made to live and haven't gone that far\nBut I made it here, so if there is a God I give thanks to him\nThen I take the pen and make amends again\nThe only way I know to repent\nI know somebody's listenin'\n\n[Verse 2: Macklemore]\nDear God, I'm so thankful for you keeping my plate full\nThe struggles, heartache, pain, the progress and the breakthrough\nEvery single track has made who I am to this day\nThrough this page is the only way to paint you\nBut lately it's like my soul feels counterfeit\nScared to pick up the pen to see what the hell might come out of it\nSo God, grant me the serenity without giving me the christening\nBecause all I ever needed was a beat and people listening\nStep Cousins\n\n[Hook]\nAs soon as I wake up\nI'm gonna change my ways\n'Cause the music's my savior\nAnd no one can take my pain\nExcept for this paper\nThe page, it flows like rain\nAs soon as I wake up (Good Morning)\nI'm gonna change my ways\n\n[Verse 3: Xperience]\nInstead of rotting away and plotting my grave, hiding in a bottomless shame\nI found a way to fight my way out and see the light of day\nAnd proud to say I took the safe route, but there's a price to pay\nThey like to keep my name in they mouth and tell lies on me\nWhat you see is what you get, truth in the flesh, homie\nYou can do the rest, I'm through with trying to prove myself to you\nI'll see you when you wake up, hope the feeling is mutual\n\n[Verse 4: Macklemore]\nNow for artists and musicians, you see the target's to listen\nTo the heart and then script it, with no margin, no limits\nTo make to pain, strengths, sun rays a part of the picture\nAnd convey it in every shade and take it farther and vivid\nThey're gonna say what they say, to barge in the vision\nAnd whatever the DJ plays, they market the gimmick\nBut I've got a path to follow and the longer the distance\nI realize I'm already awake\nI'm just starting to live it\nMy language\n\n[Hook]\nAs soon as I wake up\nI'm gonna change my ways\n'Cause the music's my savior\nAnd no one can take my pain\nExcept for this paper\nThe page, it flows like rain\nAs soon as I wake up\nI'm gonna change my ways", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}