{"songs": [{"title": "My Life", "album": "Down With the King ", "year": "2004-11-30", "lyrics": "Daz: You know it's your life nigga, you do as you please\nT.I. : That's right\nDaz: But you know when you fuck up\nT.I.: huh... dig\n\nAy, ay, ay\nYea\nYea, yea, yea, yea\nAy, ay, ay\nYea, uh yea yeaaa\n\nDaz: Dat Nigga Daz & T.I.'s in the mufuckin' house knahwhatImean?\nIt's yo life nigga....live & die\n\n[Hook: T.I.]\nCan't ya see I'm on fyyyaaahh\nSo quit hatin' on me pimpin' I'm just livin' my life\nThink I ain't gon' riiiiiide\nOn all you pussy niggas tryin' put an end to my life\nYou can't do it, don't tryyyyyy\nI know you sucker niggas wish that you was livin' my life\nIn white linen I'm flyyyy\nTop down in the Spider, be a rider for the rest of my life\n\n[Verse 1: T.I.]\nA-town veteran, started at 11\nWent and bought an 8-ball, I was stayin' down ever since\nThat's why it's hard to find a young rap nigga better then\nThe Bankhead resident, Westside represent\nPimp Squad mobster, Grand Hustle president\nHeart of a lion and the nuts of an elephant\n\"Trap Muzik\" heaven sent, you hatin' and it's evident\nYou tryna stack presidents, I'm tryna set precedents\nThe comparisons insultin' my intelligence\nCuz real recognize real, and real you ain't never been\nAnd never will\nI catch ya where ya chill\nHolla at ya where ya live, nigga fuck a record deal\nPimp graduated out the yay to stack a couple mil\nWould you figure it'd be a rap nigga I'd have to kill?\nMy patnas tellin' me \"shawty ya have to chill\"\nBut I'mma end up hatin' with the steel, watitis\nStill Dope Boy, trap niggas worldwide lovin' me\nHaters see the Spider and they wanna put a slug in it\nFuck it, I'm a G, I been a rider, I ain't studyin' it\nYa better get your mind off mine and start hustlin'\n\n[Hook]\n\n[Verse 2: Daz]\nAs a BG gainin' them stripes\nI avenge when I strike\nPrey on my victims, blind them niggas all with the light\nGet it right, hold it tight, blast with all your might\nSee we hustle for them grams 'til the early light\nFollow my plan, on command, leave them dead where they stand\nAin't no stoppin' the man, nigga with grands in my hand\nLivin' the fast lane, Grand Hustle the grand when the cash came\nThe police book me, take my fingerprints and last name\nNow I'm stuck in the cell, how would I maintain?\nLoc up on these niggas, the penitentiary mind frame\nI strive for perfection, my method is quite collective\nCheck out the fuckin' way I just rep it\nIt's Dogg Pound Gangsta in a black stinkin' Lincoln\nRims shinin', fresh paint and T.I. countin' paper\nBig moves, stay on deck with the tools\nAll ya niggas and bitches with niggas get sprayed with the tool\nRrrrrrrraaahhhh\n\n[Hook]\n\n[Verse 3: Daz]\nThis how we hustle for the paper, cuz the hustle get harder\nI'm Dogg Pound out in that Atlanta Brave starter\nMoney, weed and bitches, 24 inches\nConversatin' with T.I., plottin' on gettin' these millions\nDown for my niggas murderin', killin'\nReal in the spot, or on a mission..\nAll my niggas...y'all know how the fuck we kick it\nI'ma...keep my eyes on a meal ticket\nHustle it up, muthafucka we'll kick it\n\n[T.I.]\n\"All Eyez on Me\" with my Westside homie\nIn a drop '65 on D's\nWanna ride on me? I got a 45. on me\nIn a hurry to die homie? get live on me\nBe charged with tryin' an OG\nAnd I'm creepin' thru the crowd low-key\nNigga you don't know me\nI learned from niggas befo' me\nI got insomnia, shawty, I don't sleep\nI bomb, I don't creep\n\n[Hook]\n\n[Daz]\nY'all niggas know how we do this shit, T.I., Dat Nigga Daz yaknahmean\nIt's my life, your life, our life, his life, let's live it to the fullest\n\n[T.I.]\nOne time for 'Pac... we miss you nigga\nOne time for Shawty B for keepin' it pimpin'\nP$C, Grand Hustle pimp\nFuck nigga let this be a lesson to ya\n\nY'all niggas better start trainin' man\nYou better be a damn good ducker nigga when I goddamn let loose with this\nChopper ya understand that?\nI ain't playin' with y'all niggas\nOnce the muthafuckin' judge slam that goddamn gavel, nigga got his\nMuthafuckin' case beat\nNigga I'm at y'all ass nigga\nMark my mothafuckin' words fuck boys\nI'm layin' low for a reason pimp\n\nHa....fuck niggas", "image": "https://images.genius.com/639bf5b825c66e0f59d87574014bc4cf.600x600x1.jpg"}], "artist": "T.I."}