{"songs": [{"title": "Fast and Furious", "album": "The Saga Continues", "year": "2017-10-13", "lyrics": "[Intro]\nPass the fuckin' weed, nigga\nMan my fuckin' phone is goin' crazy right now, man\nOnce this nigga hit me up and bring me this blunt\nShit, man\nAhh this bitch\nAyo, ayo\n\n[Verse 1: Hue Hef]\nIt's like six in the morning\nMe and Miller just finished our pack\nCouple fiends on the avenue, they lookin' for crack\nGrab the Nextel like yo L, police on the jack\nI'm in that wide-body six and I'm sippin' on yak\nBlunt of the apple haze got me chilling on lean, back high\nMean like, drive by pumpin' that lean back\nPeace out, ridin' the whip\nLook at how I'm ridin' my six\nFour fifth tucked right on his hip\nSome dumb drunk, this nigga has stick\nWas parked right on the block\nWatchin' us but I ain't peep him and shit\nAnyway, back to the story, you steamin' and shit\nPass the piff, we got fiends waitin', fiendin' and shit\nConnect got me waitin', fuck, so I'm heated and shit\nOn the phone cursin' at shorty, \"I'm leavin' you, bitch\"\nToo much goin' on at one time, I'm dumb high\nSeen a group of [?] tryna run by\nThis man in a whip, threw the clip and my gun dry\nPlease cock back, but he spin around one time\n[?] his man comin' by\nWe're like two more trucks and they creep from behind\nThrew it in drive, now Hue ride sick when he high\nPull up [?] they want us to die\nLoose cannons do damage, well I'm dumpin' this 9\nWhole clique in the back and we ready to ride\n\n[Chorus: Hue Hef]\nI said I'm fast and I'm furious, headed on the I-95\nReady to ride when I'm blastin', I'm killin' shit\nFast and I'm furious, y'all want it with me?\nTake a shot, here's a hundred and three\nShit I'm fast and I'm furious, headed on the I-95\nReady to ride when I'm blastin', I'm killin' shit\nFast and I'm furious, y'all want it with me?\nTake a shot, here's a hundred and three\n\n[Verse 2: Raekwon]\nHey, yo\nGot the call from the connect from down bottom\nThey said they got the squares\nAnd they all for a good price and they solid\nReply 10-4, hung up the horn, got dressed\nWaves, rest the best, yes, threw the Franck Muller on\nSophisticated, nothin' flashy, solid king, move like a boss\nBut the calm flowin' into somethin' nasty\nPuffin' on the finest cheeba, green as a rainforest\nDoin' a buck on I-95, screamin', \"I live for this,\"\nThey just seen us comin', blew a flat\nPulled over to the shoulder\nPop the trunk to see if it's a spare in the back\nA van pulled up, with Florida tags\nThree men jumped out with guns drawn and they all wore masks\nSnatched me up and handcuffed me\nHit me with the butt of the gun\nI'm thinkin' to myself, \"The war just begun\"\nThirty minutes in the ride, the mask came off\nThe chickens dropped, the two in the back had Russian accents\nAskin' who my connect is, where he rest shit\nYou better off squeezin' that tool bitch\nHe said, \"Nah, you're worth more to us alive than dead.\"\nHe's flashed his badge and started laughin'\n\"Cocksucker, we the feds\"\n\n[Chorus: Hue Hef]\nI said I'm fast and I'm furious, headed on the I-95\nReady to ride when I'm blastin', I'm killin' shit\nFast and I'm furious, y'all want it with me?\nTake a shot, here's a hundred and three\nShit I'm fast and I'm furious, headed on the I-95\nReady to ride when I'm blastin', I'm killin' shit\nFast and I'm furious, y'all want it with me?\nTake a shot, here's a hundred and three", "image": "https://images.genius.com/eecbc338b41b5535b01202d581e34a21.980x980x1.jpg"}], "artist": "Raekwon"}