{"songs": [{"title": "On Fire", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Intro]\nYou know, critics, man\nCritics never got nothin' nice to say, man\nYou know, the one thing I notice about critics, man\nIs critics never ask me how my day went\nWell, I'ma tell 'em\n\n[Verse 1]\nAugh, yesterday my dog died\nI hog tied a ho, tied her in a bow\nSaid: \"Next time you blog, try to spit a flow.\"\nYou wanna criticize, dog? Try a little mo'\nI'm so tired of this I could blow, fire in the hole\nI'm fired up, so fire up the lighter and the dro\nBetter hold on a little tighter, here I go\nFlows tighter, hot-headed as Ghost Rider\nCold-hearted as Spider-Man throwing a spider in the snow\nSo you better get lower than Florida\nInside of a lowrider with no tires, in a hole\nWhy am I like this? Why is winter cold?\nWhy is it when I talk I'm so biased to the hoes?\nListen, dog, Christmas is off, this is as soft as it gets\nThis isn't golf, this is a blistering assault\nThose are your wounds, this is the salt, so get lost\nShit, dissin' me is just like pissin' off the Wizard of Oz\nWrap a lizard in gauze\nBeat you in the jaws with it, grab the scissors and saws\nAnd cut out your livers, gizzards, and balls\nThrow you in the middle of the ocean in a blizzard with Jaws\nSo sip piss like sizzurp through a straw\nThen describe how it tasted like dessert to us all\nGot the gall to make Chris piss in his drawers\nTickle him, go to his grave, skip him, and visit his dog\n\n[Chorus]\n(You're on fire) That's how you know you're on a roll\n'Cause when you're hot it's like you're burning up everyone else's cold\n(You're on fire) Man, I'm so fuckin' sick\nI got ambulances pullin' me over and shit\n(You're on fire) You need to stop, drop, and roll\n'Cause when you say the shit to get the whole hip-hop shop to blow\n(You're on fire)\n(You're on fire)\n\n[Verse 2]\nI just put a bullshit hook in between two long-ass verses\nIf you mistook this for a song, look, this ain't a song\nIt's a warning to Brooke Hogan and David Cook\nThat the crook just took over, so book\nRun as fast as you can, stop writing and kill it\nI'm lightning in a skillet, you're a fuckin' flash in the pan\nI pop up, you bitches scatter like hot grease splashing a fan\nMr. Mathers is the man, yeah, I'm pissed\nBut I would rather take this energy and stash it in a can\nCome back and whip your ass with it again\nSaliva's like sulfuric acid in your hand\nIt'll eat through anything, metal, the ass of Iron Man\nTurn him into plastic\nSo for you to think that you could stand a fuckin' chance is asinine\nYeah, ask Denaun, man\nHit a blind man with a coloring book\nAnd told him color inside the lines or get hit with a flying crayon\nFuck it, I ain't playin', pull up in a van\nAnd hop out on a homeless man holding a sign sayin'\n\"Vietnam vet\", I'm out my fuckin' mind, man\nKick over the can, beat his ass, and leave him nine grand\nSo if I seem a little mean to you\nThis ain't savage, you ain't never seen a brute\nYou wanna get graphic, we can go the scenic route\nYou couldn't make a bulimic puke\nOn a piece of fuckin' corn and peanut poop\nSayin' you sick, quit playin', you prick, don't nobody care\nAnd why the fuck am I yellin' at air\nI ain't even talkin' to no one, 'cause ain't nobody there\nAnd nobody will fuckin' test me\n'Cause these hoes won't even dare\nI'm wasting punchlines, but I got so many to spare\nI just thought of another one that might go here\nNah, don't waste it, save it, psycho—yeah\nPlus you got to rewrite those lines\nThat you said about Michael's hair (Woops!)\n\n[Chorus]\n(You're on fire) That's how you know you're on a roll\n'Cause when you're hot it's like you're burning up everyone else's cold\n(You're on fire) Man, I'm so hot\nMy motherfuckin' firetruck's on fire, homie\n(You're on fire) You need to stop, drop, and roll\n'Cause when you say the shit to get the whole hip-hop shop to blow\n(You're on fire) Yeah\n(You're on fire)", "image": "https://images.genius.com/7b93181ae4ed594c902bf7e4e2149ca7.1000x1000x1.jpg"}], "artist": "Eminem"}