{"songs": [{"title": "Buy U Some 2", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "Pimpin' Incorporated, woo!\n\n[E Dub] Erick Sermon... Too $hort\n[$hort] Wassup player? We got the young homey from Decatur, Georgia\n[E Dub] Young Lloyd\n[Lloyd] A-Town\n[E Dub] Woooo! Word is bond\n[Lloyd] You never met a nigga like me\n[E Dub] Uh-uh! (Hey!) Word is bond\n[Lloyd] I don't think you ever met a nigga like me\n[$hort] Motherfucker!\n\n[Erick Sermon]\nAiyyo this is part two of the shit, of Too $hort and E Dub\nNew York, Oakland, stand up\nShow love you beeeitches\nNo need to talk about the reeiches, I mean Trump punk\nUnderstand we back, rap mack, I'm Goldie\nI'm an oldie but goodie, in jeans and hoodie\nOutside is the Benz McLaren, the doors lift up\nNext week the new Bentley Coupe I'll pick up\nA chick like Jessica Rabbit lays in back\nYoung Lloyd in the back serenadin the crack\nYup, ask my nigga X man, \"I'm vanglorious\"\nNigga they call me ex-land, dough before sex man\nI spend cash when I want and you save\nI'm a peeeimp, it say that on my Banner, ask Dave\nMy favorite color is blue, but I ain't crippin\nI like Too $hort too, but \"I Ain't Trippin,\" uhh\n\n[Too $hort]\nMe and Erick Sermon in a Benz on the interstate\nWish this motherfucker had wings cause you in the way\nLet the car pass, we ain't signin autographs\nUnless you got every tape with every rhyme I ever rapped\nWe rollin non-stop to the A-T-L\nHow we stayin on top? You cain't make me tell\nAnd no we don't claim to be the biggest stars\nBut when they see nigga's cars.. bitches pause\nTryin to, find a way to be my friend\nClimb in her vagina so deep, I'm in\nAnd all these mad rappers tryin to flag me down\nI throw a piece sign, I'm 'bout to turn back around\nBut I keep flyin, lil' homey keep rhymin\nWhile you keep whinin, when you see me big timin\nCain't keep it to myself, man I had to tell\nYou still rappin in my ear, I'm still mad as hell\n\n[E Dub] Nigga I had the Benz when I was 7\n[$hort] I was fuckin supermodels when I was in 6th grade\n[E Dub] I fucked four thousand bitches\n[$hort] Nigga I'm rich\n[Lloyd] Bet you never met a nigga like me\n\n[Lloyd]\nIn the, big do', six-fo' deluxe\nRidin slow while the hydro's rollin up\nGettin paged different dames la-di-da what's up\nSay they tired of playin games and they tryin to fuck wit'chu\nSpittin game, watch 'em open up\nOh yes I love sex so just my luck\nAin't too many young niggas get mo' bucks than us\nAnd shorty fuck the price I like ice on my nuts\n\nHeyyy, you never met a nigga like me\nI don't think you ever met a nigga like me\n\n[E Dub] Woo!\n[$hort] Ay Lloyd, I can't even name all the R&B bitches I've fucked\n[E Dub] Man I've fucked so many movie star bitches they call me Mr. Hollywood\n[$hort] Nigga how much you worth?\n[E Dub] Man I just bought Egypt\n[Lloyd] You never met a nigga like me\n[Lloyd] I don't think you ever met a nigga like me\n[$hort] Buy you some, part two beitch\n[Lloyd] You never met a nigga like me", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}