{"songs": [{"title": "A Dedication", "album": "Dedication 4", "year": "2012-09-03", "lyrics": "[Andre 3000]\nThis just my interpretation of the situation\n\n[Lil' Wayne]\nAnd this is my dedication\nWhat's poppin’ dedication 4 ho (D4)\nAnd this is dedicated, first off\nTo my city\nThe lost city of New Orleans\nBut umm, I wanna speak to my city\nAnd I wanna let ‘em know that\nWe can’t be lost for long\nAnd we damn sure can’t be lost forever\nSo it's time we find ourselves\nWithin all that water\nWithin all that dirt, within all that blood, within all that pain, within all them cries\nIt’s time to find ourselves, New Orleans\nBecause memories are everything\nAnd when I say memories are everything\nI mean it’s important what you are remembered by\nAnd trust me. I, you, we\nDon’t wanna be remembered as the lost city\nI’d rather be remembered of the city that found glory after all that tragedy\nStrength, yea\nAlso I built that skate park down there and get them kids off the streets\nYou’re welcome\nBut umm, we gotta get up man\nFuck it\nRise above it\n\nSo a lot of people ask me\nWhat you gonna do for your city?\nI be like motherfucker, you ain’t hear what you just said?\nWhat you gone did for your city?\nMotherfucker, that’s my city\nTherefore I still got family members in that city mane\nWhat the fuck I’mma do for them?\nYou know what I mean?\nAnd I do my best, trust me\nAnd that’s what the fuck I do for my city\nI do this right here for my city man\nThat’s what the fuck I do for my city\nI do me for my city\nSo therefore I am remembered by my city\nYa dig?\n\nAnd this is also dedicated to\nThem bitch niggas\nYou ho niggas, you pussy niggas\nYou broke niggas yea\nFuck you with a sig dick\nPause\nI can’t stand you pussy ass niggas\n\nAnd this also dedicated to the bad bitches\nFirst off, them chocolate women\nI know I talk about them yella bitches in the real bits all the time\nBut um this dedicated to them chocolate women\nYa dig? I ain’t say bitches or hoes\nNot how it seems like\nYea\n\nAnd this is dedicated to them yella bitches and them red bitches\nKnow what I’m talkin’ ‘bout? Ugh\nIt’s also dedicated to my niggas, my homies\nThey still pump that bass\nFool nigga to dick nigga\nWuchu gonna do about that?\nIt’s dedicated to all my motherfuckin’ niggas that’s fuck this with me\nPause\nBeen down on me since day one\nNigga they been down on me since day two\nNigga they’ve been down on me since today\nThis love nigga\n\nAnd this song’s also dedicated to the motherfuckers that helped out with this mixtape\nMy nigga Mike Bailey\nMy nigga Young Jeezy\nJae Millz\nJ Cole\nJ Gutter\nReal Flow, Lil' Mouse\nThe beautiful Nicki Minaj\nDJ Drama\nMy nigga Tez Poe, Mack Maine\nKnow what it is\nStunna Man\nAll young money, cash money man\nIt’s also dedicated to my skatin’ niggas\nTruk fit, truk the world\nFyber O, DJ Crack\nKnow what it is\nSupra\nAll that shit\nShout out to the hoes skatin’ world\nI appreciate you all for acceptin’ a real nigga\nBustin’ my ass and shit but um\nPause, I get it\nWe that shit nigga\nFuck wrong with you?\nAnd this also dedicated to you\nWhoever you are\nWherever you are\nHowever you are\nI hope I’m remembered\n\nD4 ho\nRest in peace Chris Lighty", "image": "https://images.genius.com/1cca3a7cb35e2d8b6baa82593cc9844d.525x525x1.jpg"}], "artist": "Lil Wayne"}