{"songs": [{"title": "Big Poppa (So So Def Remix)", "album": null, "year": null, "lyrics": "[Verse One:]\nTo all the ladies in the place with style and grace\nAllow me to lace these lyrical dooches in your bushes\nWho rock grooves and make moves with all the mommies\nThe back of the club, sippin' Moet is where you'll find me\nThe back of the club, mackin hoes, my crew's behind me\nMad question askin', blunt passin, music blastin'\nBut I just can't quit\nBecause one of these honeys Biggie got to creep with\nSleep with, keep the ep a secret why not?\nWhy blow up my spot cause we both got hot\nNow check it, I got more Mack than Craig and in the bed\nBelieve me sweetie I got enough to feed the needy\nNo need to be greedy, I got mad friends with Benz's\nC-Notes by the layers, true fuckin players\nJump in the Rover and come over\nTell your friends jump in the GS3, I got the chronic by the tree\n\n[Hook:]\n(I love it when you call me big pop-pa] x3\nThrow your hands in the air, if youse a tru playa\nTo the honies gettin money playin niggas like dummies\nIf you gun up in your waist, don't shoot up the place\nCause I see some ladies tonite that should be havin my ba-by\nBaybee, uh\n\n[Verse Two:]\nStraight up honey really I'm asking\nMost of these niggas think they me mackin', but they be acting\nWho they attractin' with that line\n\"What's your name, what's your sign?\"\nSoon as he buy that wine, I just creep up from behind\nAsk you what your interest are, who you be wit?\nThings to make you smile, what numbers to dial\nYou gon' be here for a while, I'm gon' call my crew\nYou go call your crew\nWe can rendezvous at the bar around two\nOr three o' clock, Lil Ceas pull the truck up out the parking lot\nRoll a blunt cause he like to spark a lot\nSteam on the way to the telly go fill my belly\nA T-bone steak, cheese eggs, and Welch's grape\nConversate for a few, cause in a few, we gon' do\nWhat we came to do, ain't that right boo (truuuue)\nForget the telly, we just go to the crib\nAnd watch a movay, in the jaccuzay, bay-bay\n\n[Hook]\n\n[Verse Three:]\n(How does a true playa live?)\nNigga, Versace down\nDonna Karan, Diamonds glarin', Niggas starin'\nNow I got my pants draggin in the Benz wagon\nRaggin' sippin' D.P on my way to D.C\nThe biggest willies, smokin' phillies\nThai & skunk together, Junior M.A.F.I.A. forever\nThuggin to say youngin and you knows that\nI steps in where the Mo and the Hoes at (Baybee)\nNiggas know the better on the Coogi sweater\nButter leather, chrome beretta see\nYou know who that nigga be\n\n[Outro: Jermaine Dupri]\nShit you ain't know, ha ha, That's the stride for ninety-five Baby\nStraight up playerlistic mentality\nYou just do your thing, Cause I'm definintley gone do mine\nAnd we gon' hook up a lil later and do thing you never heard of\nCan you feel me?\n\n[Hook]", "image": "https://images.genius.com/264fd77ec80b9ec9afbb1fdca8ea2533.600x600x1.jpg"}], "artist": "The Notorious B.I.G."}