{"songs": [{"title": "Respect This Hustle", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Intro]\nHuh, yeah (AY! You already know what this is homie!)\nAiyyo what you yellin for man? (Man shut the fuck up talkin to me man)\nMan calm down shorty\n(Nah you calm down, I ain't got shit to say to you man)\nMan see that's why I don't even fuck wit'chu dawg\n(Hollywood ass nigga, I don't fuck with YOU)\nYou be on that bullshit man\n(Yeah man, well you better respect my muh'fuckin hustle)\nMan you ain't the only one gotta hustle nigga (I told you once man)\nYou can't tell me shit! (You heard me) Aight now\n\n[Hook]\nR-E-S-P-E-C-T, M-Y, H-U-S-T-L-E\nShould respect this hustle, respect this hustle\nWon't accept nuttin else so respect this hustle\nI ain't in it for the fame, I ain't in it for the glory\nI'm down to die for it, absolutely mandatory\nRespect this hustle, respect this hustle\nWon't accept nuttin else so respect this hustle - AY!\n\n[Verse One]\nThese niggas bitch-made, I'm gettin paid six ways\nSix laid, shit's sprayed with lemonade with blades\nKeep your mouth closed, you don't wanna get sprayed\nShoot you up your body, let it sunbathe six days\nKamikaze renegade, nah he never been afraid\nKept the trap hot enough to fry an egg in the shade\nI ball 'til the day I'm lyin dead in the grave\nI leave the Feds behind the wall cause I ain't get away\nChopper round the corner and a bushel with a brick of yay\nA bust can happen any day, we out here trappin anyway\nGettin money's an addiction, damn what a nigga say?\nI got a real bad condition if I ain't gettin paid\nHand over fist, well I miss it, gotta get busy\nI know you see this car I drive and see the house that I live in\nAnd figure this is enough (what nigga?) I want way mo'\nReally this is Play-Doe, you set your sights way low\nHad enough of the game, I don't know whether to stay or go\nAnd different group of lames and suckas e'rywhere which way I go\n(But nigga know you King, why you always gotta say it fo'?)\nCause they said I couldn't say it befo'\nAnd I remember all it did was fuck my temper up mo', Doug and J know\nI said I wear a crown, not a halo - sorry\nNiggas think they seein me but they so sorry\nThey fast but they ain't no Ferrari {*YOOM!*}\n\n[Hook]\n\n[Verse Two]\nAy, don't you think you been pullin gats fussin cussin enough?\nRound here braggin 'bout these niggas you be bustin enough\nMan look around, ain't nobody sufferin but her\nYou could beat a hundred cases, catch one and you fucked\n(Man I get probation) Is you crazy? Pull a gun in the club\nSee how many folks and polices put you down in the club\nIf we gotta come with a slug, why we come to the club?\nHow much more of this shit you think we can sweep under the rug?\n(Look, we already told them \"I Told You So\")\nBut all these niggas speakin out who wouldn't spoke befo'\nDon't take it personal, people wanna be close to folk\nWhat you think the televisions and the posters fo'?\n(Yeahhh man I'm claustrophobic though) Well you need to see a doctor for it\nAnd I ain't jokin, you close Tip and you 'bout to blow it\nDid you forgot about them nights in the cells, was you honest\n(I dunno) When we was havin talks with God and you promised\nIf he made a way for you to be large, and you done it\nOut the gate, \"Urban Legend\" went on to do numbers\nSold a mil', made \"ATL\", \"King\" first week five hundred\nWon the Grammy's (but not the one that I wanted)\nWhat about them eight figure deals and that other new money?\nBut ask yourself somethin, where the gun you got from me?\nKeep it real\n\nTalk about somethin other than yourself sometime (man)\nDid you keep your promise partner? (Ay, just keep it real)\n\n[Hook]\n\n[Numerous ad libs to the end]", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}