{"songs": [{"title": "You Ain’t Fuckin’ Wit Me", "album": "Genesis", "year": "2001-11-27", "lyrics": "Yea.. aiyyo Uncle Pat, turn up the beat just a lil' more for me bruh\nYea.. {*imitating the beat*}\nThis sound like Frankenstein's baby, yea\n\n[Verse One]\nBusta Rhymes! You know we live and in color (color)\nShit butter hot, but just a little mo' gutter (gutter)\nSmash shit regularly, word to my mother\nShow love for the bitches and put it down for my brudda (brudda)\nHot butter funk make it rain, close the shutter - violate\nCatch it from one of my bitches, boxcutter (cutter)\nAhh, articulate! Feels so great\nThat I can bless my niggas with shit they appreciate ('ciate)\nNo jive y'all niggas can take a nosedive\nShit so live bitches wanna give me a high five (five)\nUNGHHH! Fuck it, it is a must we hold grands\nGet with the program and fuck bitches who love to hold (hands)\nFoul shit, way out of order\nFuck shit up leave bitches hot and sweaty drippin buckets of water (water)\nDisorderly conduct, will erupt\nWhen the live shit come on niggas do what they wanna (wanna)\nAight bitches, now show yo' asses\n\n[Hook]\nThe shit we droppin be sure to get y'all movin (get the fuck up)\nWe keep it poppin, feel how gangsta the loop is (we keep it boppin)\n(we keep it gangsta muh'fucka)\nAnd it ain't no stoppin the way that we gon' do this\nNow what you want me to say? Say you ain't fuckin with me-ahhhhhhh\n(what the fuck, c'mon)\n\n[Verse Two]\nHuh, you see I got so much new hot shit stored\nGot you givin me an award, floored a couple on the come up\nStretched a few, put 'em flat on they back\nAnd laid 'em stiffer than a board, the way I make my niggas applaud\nMy price tag, just to show up the shit\nMight be somethin you can't afford\nMake you say the Lord is my shepherd, how we astonish\nMove forward on novice niggas like Cedric Ceballos with a hot song\nNow niggas know we rock on, cock-strong\nAll y'all niggas is straight popcorn, AHH!\nTalk the trash, comin forth get past lie duke\nPass shorty with the big horse ass (ASS)\nNow ain't no stoppin how we comin full blast\nMix the fire with gas, that's how we put it on smash (smash)\nNo lie, never deny - so hot we cook the shit well done\nJust like a deep fish fry; UNNNGHH, snap crackle and pop\nWhat we drop and how we keep shit comin\nHow we maneuver so fly (fly), so high is where we gon' take it\nControllin the land, controllin the sea\nNow we control the whole sky; perhaps make niggas collapse\nMake bitches shake they shit to the floor\nAnd feel the soul up in my raps and your face is the gutter we slap\nMake you crash all in your whip when you drive\nI hope your seatbelt's strapped, aight niggas! Now throw yo' hands up..\n\n[Hook]\n\n[Busta Rhymes]\nYeah, this sound like.. the music to Frankenberry or some shit\nThe fuckin.. groovy ghoulies and friends or somethin {*laughing*}", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}