{"songs": [{"title": "The Movement", "album": "Kristyles", "year": null, "lyrics": "[KRS-One]\nWhere the real at!\nWhere the real at!\nYeah!\n\n[KRS-one]\nYo\nWhere I come from gats bust for nothin'\nThugs, ministers, cops, teachers, all be hustlin'\nYour family's the only one ya trustin'\nClubs be jumpin', redesigned cars be bumpin'\nNow there's ranks supreme KRS is a free man\nIn Hip-Hop culture, I'm like Allen Greenspan\nI tell the culture what's hot and what's not\nNow look who's on top and look whose shit just dropped\nWe ain't about sellin' records, we ain't music merchants\nWe emcees we go straight to the club and hurt shit\n\n[Hook]\nNew York, New Jers', Boston, COME ON!\nCalifornia, D.C., Baltimore, COME ON!\nTexas, Atlanta, New Orleans, COME ON!\nPhilly to Chicago, Carolinas, COME ON!\nMemphis to Nashville, Colorado, COME ON!\nDetroit to Pittsburgh, Cincinnati, COME ON!\nSeattle to Miami, Arizona, COME ON!\nSan Fran', Oakland, Hip-Hop, COME ON!\n\n[KRS-One]\nDown to the spot this is real Hip-Hop\nJoin this movement; them other cats steal a lot\nYou can feel the knowledge of self or feel this Glock\nI'm authentic, KRS I'm really hot\nYo, what up Fat Joe that's my nigga for life\nRemember when Pun fell off the stage, right on my wife\nIn the Bronx, we all laugh about it today\nWhat up Freddie Fox, 2 Glocks, Pik and Spay\nDr.Dre all day, both of them\nDr.Dre with Ed Lover and the one with Eminem\nThis a movement, all over the world we reach\nI can prove it, all over the world I teach\nYou hear that Dr.King, \"I Have A Dream\" speech a lot\nBut no where is it manifested but in Hip-Hop\nWhile them other cats be lookin' for a radio song\nI'm in Washington Heights, puttin' them Dominicans on\nYou can feel it I'm strong, I last longer lets do it\nYou want the real Hip-Hop well join this movement\nWe ain't about sellin' records, we ain't music merchants\nWe emcees we go to the club and straight hurt shit\n\n[Hook]\nUtah, Minnesota, Mexico, COME ON!\nV.A., Arkansas, Portland, COME ON!\nIndiana, Oklahoma, Kansas, COME ON!\nEast St.Louis, Milwaukee man, COME ON!\nMontreal, Toronto, Canada, COME ON!\nEast Coast, West Coast, Dirty South, COME ON!\nMid-West, Bible Belt, Up-Top, COME ON!\nHip-Hop, COME ON!\nHip-Hop, COME ON!", "image": "https://images.genius.com/2333a9607025ac4cc5a6777157dbce5f.220x220x1.jpg"}], "artist": "KRS-One"}