{"songs": [{"title": "I Gotta Feeling", "album": null, "year": null, "lyrics": "[Into: Lil Wayne]\nNo ceilings\nHaaa, yeah!\n\n[Intro: Lil Wayne]\nParty on the beach\nP-Party on the beach\nParty animal, they done let me off the leash\nI got my weed from the west\nMy pills from the east\nAnd two bottles of Goose, that's Geese\n\n[Hook: Mack Maine]\nNo ceilings\n(No ceilings muthafucka'!)\nTonight's gonna be a good night\nTonight's gonna be a good night\nTonight's gonna be a good good night\n\nNo ceilings\nTonight's gonna be a good night\nTonight's gonna be a good night\nTonight's gonna be a good good night\n\n[Verse 1: Lil Wayne]\nTonight's the night, I’m high as height\nI'm young and restless, I shines my guiding light\nAnd uh, I’m living right, my health alright\nMy money good and my girl a dyke\nShit, let's live it up, no dying down\nLets shoot the bar, I’ll buy the rounds\nI’ll take the shots, I’m bulletproof\nNike just do it, I do what it do\nI was drinking 'fore I came\nWhen I got here, I did the same\nI don't like beer, I like champagne\nSo, cheers to Lil Wayne\nAnd if she think she get my number, just hope my number don’t change\nGirl stop playing, I got that pussy on a string\nNow let’s do it!\n\n[Bridge]\nLet’s do it, let’s do it, let’s do it, let’s do it (No Ceilings)\nAnd do it, and do it, let’s live it up (yeah)\nAnd do it, and do it, and do it, do it, do it (ahaha)\nLet’s do it, let’s do it, let’s do it (Young Mula babbbyyy)\n\n[Hook]\nNo Ceilings (woo, hah)\nTonight’s gonna be a good night (No Ceilings)\nTonight’s gonna be a good night (motherfucker)\nTonight gonna be a good good night (Young Money)\nNo Ceilings\nTonight’s gonna be a good night (Now I’m about to really go in)\nTonight’s gonna be a good night (I’m going in!)\nTonight’s gonna be a good good night (Scoob I see you)\nNo Ceilings\n\n[Verse 2]\nKush got my dutch fat as fuck\nWeezy F, I’m bad as luck\nI’m already at the top, I'm 'bout to pull the ladder up\nFlow crazy, I need a counselor\nI’m hip-hop's announcer\nI’m in the gun club, do you wanna meet the bouncer?\nBeen a beast and still I am\nNow I rock and still I jam\nFew niggas with me got that white girl like Will.I.Am\nLook up bitch, ain't no ceilings\nSee me at the top controlling things\nAnybody beat, it's a motherfucking murder scene\nI do it\n\n[Hook]\n\n[Hook]", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}