{"songs": [{"title": "Pray for ’Em", "album": "4/4", "year": "2016-01-16", "lyrics": "[Intro]\nDC, unos, dos, tres, cuatro\nFree El Chapo!\n\n[Verse 1]\nFuck your bitch, get a bag from her, then I never call her\nNow she trippin', goin' crazy, nigga tell her let up off us\nOGs see me comin' through and they say, \"That's a baller\"\nThat's that nigga really started from the bottom really in that order\nMake a call, bring them plans down\nSmokin' loud like surround sound\nNiggas wanna come around now\nCause they know that Meek Milly got the crown now\nPut my mask on, put the crown down\nTell 'em turn up\nWhen it come to action, niggas ride with me\nScreamin' murder\nNiggas fallin' off, bitches fallin' through\nCallin' plays like an audible\nGet that money, what you oughta do\nNeed the plug, got them niggas callin' too\nPut you on, nigga, put you on, I can put you on\nWhat you doin', nigga, what you doin', nigga, what you doin'?\nGet the bag but I'm way triller\nYou around cause you paid niggas\nIn the dark when we spray niggas\nWhen we run into you, we ain't playin' with you\nMeek put a rapper on CNN\nNiggas said I wouldn't eat again\nI just counted 5 mil' in cash\nI'm a real nigga they won't see again\n\n[Hook]\nPray to my God we don't go to the feds\nWe don't go to the feds\nI pray all that money don't go to my head\nDon't go to my head\nI pray on my Glock when I'm goin' to bed\nWhen I'm goin' to bed\nNow pray for the suckas that wanted me dead\nCause all of 'em dead! Fuck 'em\n\n[Verse 2]\nPeople locked me, put them chains on me\nWonder why I got these chains on me\nAudemars, I got a range on me\nShit a hundred thousand ain't a thing to me\nWhat's your range, homie? This another level\nFlood the Rollie, get another bezel\nShe don't dig me, get another shovel\nGo and get the money, we don't ever settle\nWent to jail, came back home, then I got rich, damn\nWent to jail again, then I came home then I got Nick, damn\nNiggas prayin' that I go to jail again so they can pop shit, damn\nOnly trap nigga doin' real numbers spittin' hot shit\nNiggas hatin' cause my numbers down, what'd you do, 50?\n20 somethin', I did 250\nMAC 11 hit you 20 times, now you Harlem Shaking like you Diddy\nPop niggas spittin' melodies when it's really nothin' they can do with me\nBallin' on 'em ain't new to me, fuckin' bitches ain't new to me\nSummers, summers\n10 summers I've been at my tempo like I'm Mustard\nAt the Grammys with the hustlers\nWent to trap 'cause you a busta\nSpillin' lean on the red carpet\nPhone tapped, I hear the feds talkin'\nStill trappin' out the bando\nMoonwalkin' on that damn marble\nBallin', ballin', ballin', ballin', ballin'\nBallin' on 'em like I'm James Harden\nI don't drive it if it ain't foreign\nI don't fuck it if it ain't foreign\nStill eatin' and I ain't tourin', nigga gettin' it\nGot that ladder with me with the 33, I'm Scottie Pippen it\n\n[Hook]\nPray to my God we don't go to the feds\nWe don't go to the feds\nI pray all that money don't go to my head\nDon't go to my head\nI pray on my Glock when I'm goin' to bed\nWhen I'm goin' to bed\nNow pray for the suckas that wanted me dead\nCause all of 'em dead! Fuck 'em\n\n[Outro]\nBallin', ballin', ballin', ballin', ballin'\nBallin' on 'em like I'm James Harden\nI don't drive it if it ain't foreign\nI don't fuck it if it ain't foreign\nStill eatin' and I ain't tourin', nigga gettin' it\nGot that ladder with me with the 33, I'm Scottie Pippen it", "image": "https://images.genius.com/759fe167d70daac9ee9784373750615b.1000x1000x1.jpg"}], "artist": "Meek Mill"}