{"songs": [{"title": "Owe Me", "album": "I Decided.", "year": "2017-02-03", "lyrics": "[Chorus]\nAll that shit you told me, I believed\nThe smile on your face the only thing I can't read\nLeft and now you back inside my life\nIt's gon' take more than that to set it right though\nCause, you so, fuckin', outta, line\nFor ever, letting, them taste what's mine\nTaste what's mine, taste what's mine\nYou so, fuckin', outta, line\n\n[Verse 1]\nFeel like you owe me checks, owe me time, owe me sex\nLong nights, no reply, I got no regrets\nYou disrespect, disrespect, only time I seen you now's on the internet\nJust to see if it's somebody else that you tied to\nI hit you back when I decide to, you got my tattoo, we was tribal\nThen you left and we turned rivals, now you back with the revival\nThey don't make you feel like I do, they didn't make you perform for me\nYou was my American Idol how you rocked the mic\nMan, we went from long text, now they shorter than a haiku\nSeems like all you got is hate for me\nAll you ever did was take from me\nCause you know you got that walk from me\nHow you dress and how you talk from me, yeah\nLet's not ever disrespect what I meant to ya\nIt took us being over to see all I did for ya, damn\n\n[Chorus]\nAll that shit you told me, I believed\nThe smile on your face the only thing I can't read\nLeft and now you back inside my life\nIt's gonna take more than that to set it right though\nCause, you so, fuckin', outta, line\nForever, letting, them taste what's mine\nTaste what's mine, taste what's mine\nYou so, fuckin', outta, line\n\n[Verse 2]\nI'm just trying to let the past pass\nAin't no future in that, yeah\nI stay 100 like my dash, yeah\nHave you cummin' faster than The Flash, yeah\nIs it all mine, all mine? You know me, I had to ask\nCan I hit it like I crash? Sipping pinot by the glass, glass\nHonestly, I had to take the time to let my ego go\nRealized that that held us back and back's not where we need to go\nThis don't replace what you did to me\nThis don't replace what I did to you\nSometimes it ain't about what we did or didn't do\nIt's about what we getting through\nLook, I'm not tryna play the blame game\nPoint the fingers while we skip the point\nKnowing that we both want the same thing\nRiding for each other even if we gotta change lanes\nIf we don't work it out, shame shame\nI can't touch these hoes I can't trust, I don't wanna have a fake us\n\n[Chorus]\nBut all that shit you told me, I believed\nThe smile on your face the only thing I can't read\nLeft and now you back inside my life\nIt's gon' take more than that to set it right though\nCause, you so, fuckin', outta, line\nForever, letting, them taste what's mine\nTaste what's mine, taste what's mine\nYou so, fuckin', outta, line\n\n[Outro]\nMy friends say I should be over you\nGetting hurt every time I'm close to you\nI think me and you are overdue\nI think this is what we supposed to do\nCause, you so, fuckin', outta, line\nForever, letting, them taste what's mine\nTaste what's mine, taste what's mine\nYou so, fuckin', outta, line\n\n[Skit: Paparazzi]\nNigga, you know what's about to go down when you walk out that door\nMan, I hope these niggas not out here man, fuck\nBig Sean, boy, swerve\nI don't...with you\nOk, we see you\nNew girl, new car\nLamborghini Mercy, ok we feel it\nAyy, is this the- is this like the real thing this time with this one?\nOr is this another one of those flings?\nLike, you gonna bring her home to mom\nDoes mom know about this one?We know you're close with your mom\nWhat you say about animal cruelty?\nLike do you think they should have shot Harambe or like what?\nI mean do you think he was going to maul the kid?\nWe seen you in the furs man, don't lie", "image": "https://images.genius.com/15fe74f551404783e7b7cb1a8ba102e9.1000x1000x1.jpg"}], "artist": "Big Sean"}