{"songs": [{"title": "Laugh at Em", "album": "DIME TRAP", "year": null, "lyrics": "[Intro]\nYou know what the fuck goin' on, man\nYou better strap in your seat\nWell, it's gon' be a rough ride\nIt's the king, bitch\nJust Blaze!\n\n[Verse 1]\nNo introduction really necessary\nGet the message like a secretary\nBoy, I'm legendary\nWhen I'm dead and buried, still be kicking flavor in the cemetery\nTrap music originator, fresh off of my hiatus\nYellin', 'Fuck you' to all of my haters, they Skywalker, I'm Darth Vader\nPromise, I don't give a shit about 'em\nLet 'em know, turn him red, tell 'em he don't even matter, yeah!\nLike I'm pimpin in a Kangol and a new Cadillac with some all gold hammer\nLong as I remember, I done ran Atlanta\nI could give a damn 'bout a dog faced hoe\nSister used to gettin' thangs from a check, so how can I\nSettin' numbers in the hood, do what I say do\nTell 'em niggas break bread or fake dead\nOr bare it, they hate that, 50 million, yeah, died to make that\nMiddle finger, if you vote for Trump, see me outside well you know what's up\nI ain't hearing no peace talk, ain't shit funny, no hee-haw\nLike a Black Panther, we armed to the teeth, cracker tried me, we squeeze off\nSwear to God, I could've been Freddie Gray or Mike Brown gettin' shot down\nWith a pistol on me and a half a brick of yay, blam-blammin' by Sandra Bland\nListen, boy, your challenge with the runnin' man\nI will challenge with a gun in hand\nWhat you see before you, fuck what they done told you\nBitch I brought this shit from nothin', man\nGrand Hustle over errythang, Molly, Becky and the Mary-Jane\nIt's the king, nigga like a 18-wheeler swervin' in and out of every lane\nNever been a part of they in-crowd, got a problem with me? I say, 'Fuck y'all'\nGot the same friend that I came in with, duckin' all that lame shit, ayy\nEveryone I know is on go, drive-bys all rolled in a 4 by 4\nBelieve, if I catch him, that the hoe gon' go\nSee me with it, you ain't gon' see the hoe no more\nThey love when I talk that shit\nRoll by the car lot, went and bought that shit\nCaught case after case and I fought that shit\nThen watch he give a damn, went and off that brick\nI lived the shit that they rappin' 'bout\nCare nuttin' 'bout what they cappin' 'bout\nBankroll mama, we know what this, we cashin' out, we baggin' up\nStackin' up them zeroes, certified neighborhood hero\nYou can try one of them sucka niggas, better not try it with me though\nAyy, ayy, ayy\n\n[Bridge]\nYou know you done fucked up, don'cha?\nYou know you done fucked up, don'cha?\nAin't no stoppin' this shit, partna\nAnd you know what happened if you run me hot in this bitch, now\n\n[Verse 2]\nWe turned to the max, Atlanta hat\nCocked to the left, turned to the back\nNigga tried, see, we weren't havin' that\nSend shots where your bandana at\nDrop a nigga off where Alabama at\nThat's what nigga get for tryna battle rap\nHead shot, should be one and done\nNo drive-by, but we run and gun\nA nigga walk up to you, while you showin' off stunts\nTell you, \"Up your jewelry, nigga, run that money\"\nNigga playin' games, think it sure not funny\n'Til my young nigga went and done it for me, yeah\nFor the love of the bankroll, keep your business to yourself\nNigga, don't nobody care 'bout it\nDon't nobody wanna hear 'bout it\nYou got problems, huh? Well, it's the same thing for everybody\nAnd, nigga, I ain't gon' lie, I promise, not a day go by\nI ain't on the grind, if I ain't on fire\nIf any thing that I want, I can go buy\nTryna put six wheels on a Range Rover\nI ain't playin' no games, not with you, no sir\nIf you think you're at the top, tell 'em move over\nModern 2Pac and the new Hova, goddamn\nKnow the hustle now, come with us and down\nWe dodgin' suckas, steady duckin' clowns\nWe chasing mills so we can put that down\nBullshit talk but we run that town\nBut with millions and no cap and gown\nWent from trappin' raw, look what happen now\nMetal throne, concrete crown\nCross that line, you're gettin' beat down\nReal dope boy veteran, dope boy academy\nThese dope fiends still remember me when they were sick and needed their medicine\nYou better watch it partner, you ain't' from 'round here\nThink it's sweet, you got the wrong idea\nGet stripped naked, left out there, tell 'em, \"So, what the fuck I care?\"\n'Bout the trap music, all black Uzi, still packin', I'm that stupid\nStill down to do it, if you act stupid, get locked up and get back to it, yeah\nTrap music, all black Uzi, get locked up and get back to it, yeah", "image": "https://images.genius.com/762209f629de50995145f116f95b5ea9.750x750x1.jpg"}], "artist": "T.I."}