{"songs": [{"title": "Lift Ya Skirt", "album": "A Son Unique", "year": null, "lyrics": "[Intro: Ol' Dirty Bastard]\nTurn it up!\n\n[Ol' Dirty Bastard]\nOne nigga, two nigga, three nigga, four\nOne of you niggas is about to get fucked up\nIt's the Ol' Dirt McGirt, live and uncut\nLive and uncut, ready to bust a nut\nLike when I first came home, I boned Simone\nFucked her so hard, pussy started to groan\nSeven in the morn', woked up and yawned\nThe bitch scrambled my eggs, she wrote me a song\n(Sing it!) It's all because of Dirt Dog\nThat the reason I took my skirt off\nYou went away -- now I'm back with (what?)\nAnd this is where the bullshit stop\nPlus these voices in my head, want me to go back\nPick up your guns, don't take your Prozac\nRitalin, Codelin, Zoloft, cocaine\nWu-Tang, nigga, it's the new John Coltrane (hahahaha)\n\n[Hook: girl (Ol' Dirty Bastard)]\nDirt Dog, Dirt Dog, you our man\nIf you can't do it, then no one can\n(Mr. McGirt, gonna get you dirty\nLift up your skirt, I'm gonna get you dirty)\nDirt Dog, Dirt Dog, you our man\nIf you can't do it, then no one man\n(It's the (what) in the house, gonna get you dirty\nThe Wu-Tang Clan gonna get you dirty)\n\n[Missy Elliott]\nI hopped on the scene, spit sixteen bars lean\nCross your face like a smear of Mabeline\nWet jeans, get rised, ecstatic clean\nIs it cuz my sex feel like you on morphine\nThey-they think, I'm so much\nI talk tough, burn your mouth and handcuffs\nMakin' hits, I'm making paper, cake it up\nLookin' haters in the face, like 'nigga what?'\nNow scream, how many of these muthafuckas respect me\nCuz I'm the only chick who freak any beat\nSo pack it up, with that O.D.B\nOh, it's a bad bitch...\nShame on a nigga, who, who tried, to run game\nOn a nigga, like a gold digger\nI pull my trigger, I bet my gun bigger\nNow how ya'll figure, that's how ya die quicker\n\n[Ol' Dirty Bastard]\nA Son, what? what?\n\n[Hook]\n\n[Outro: Ol' Dirty Bastard]\nDie, drin', die, come on\nThis is strictly for the radio\nYo... can't stop...", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}