{"songs": [{"title": "Siempre Peligroso", "album": "Los Grandes Éxitos en Español", "year": "1999-12-07", "lyrics": "[Verso 1: B-Real]\nYo te meto en candela, prende la vela pa' la pelea\nCuando crees que tu ganas yo mato a quien sea\nCypress Hill son asesinos\nYo fumo mota con todos mis vecinos\n\nAbre tus ojos si tu quieres entender\nYo te enseno todo porque tengo el poder\nTe llevo a la loma pa' tirarte en el hueco\nPuto yo te mojo y me quedo bien seco\n\nDios me perdona porque no estabas listo\nTu sangre en el piso y Cypress Hill lo hizo\n\n[Estribillo]\nCaminando por la calle siempre peligroso\n(Siempre peligroso)\nCorriendo en el pleito mueren los mocosos\n(Mueren los mocosos)\n\n[Verso 2: B-Real]\nHijo no te pierdas porque voy a comenzar\nA quemar mis enemigos que me vienen a matar\nYo no me escondo, tengo familia grande\nSi tu quieres un pedazo, sigue ven pa' 'lante\nPuto\n\n[Verso 3: Fermin IV]\nAh, mira\nUna vez mas y por segunda ocasión\nEl poder de la yerba abre la mente\nY ahora en español mira, já\n\nTa ta ta ta taa!\nComo el profesor Jirafalez dando su lección\nAquí estoy listo y preparado para la ocasión\nMira, mis instintos me van guiando, tropiezo menos\nPues no doy ningún paso en falso, así he representado\n\nArtillería Pesada presentando, Fermin IV\nCapitán, piloto, aviador de la bala de plata\nSiempre cumplo lo que prometo\nPor eso ahora siento que voy creciendo sin miedo\n\nAgarro el micrófono como el machete que va abriendo\nLos caminos y las veredas aquí en la tierra\nA 33 1/3 revoluciones me mantengo\nAhora si, tratando de llevar el ritmo perfecto\n\n[Estribillo]\nCaminando por la calle siempre peligroso\n(Siempre peligroso)\nCorriendo en el pleito mueren los mocosos\n(Mueren los mocosos)\nCaminando por la calle siempre peligroso\n(Siempre peligroso)\nCorriendo en el pleito mueren los mocosos\n(Mueren los mocosos)\n\n[Verso 4: Sen Dog]\nMi nombre es el Perro, ¡Grraw!, cuando ladro\nNo hay problema, cuando empiezo, te desmadro\nSi soy cubiche sos y tengo mi machete\nEn la tronca de la ranfla y jeta de los cuetes\n\n¿Que tu le que, le que? Ven pa'ca yo te la quito\nLa mando pa' San Juan, encuentrala en Puerto Rico\nTe jodo chico, nada suave como rico\nSoy el pingu, tremendo peligroso tipo\n\nCuidado con mis cañones, me roncan los cojones\nDile al tipo de la estación que limpia todas las maldiciones\nEmpuja los botones, antes que tu la pones\nMis palabras son el humo que te rompe los pulmones\n\nHace de que bola, ¿Que se dice?, ¿Que se cuenta?\nVente compra el disco porque ahora está a la venta\nHay que pagar la renta, corre pa' la tienda\nY oye como Sen y el Machete representa\n\n[Estribillo]\nCaminando por la calle siempre peligroso\n(Siempre peligroso)\nCorriendo en el pleito mueren los mocosos\n(Mueren los mocosos)\nCaminando por la calle siempre peligroso\n(Siempre peligroso)\nCorriendo en el pleito mueren los mocosos\n(Mueren los mocosos)\n\n[Fermin IV] - this goes with the chorus\nMira...\nCypress Hill, diremos algo\nPero nosotros, el Machete, aquí rondando\nCon los grandes, representando, mira\nAh ah!\nDesde Monterrey, el Cerro De La Silla\nNos los llevamos a Los Angeles\nColocando nada mas así ah ah\nTransportamos por todos lados a donde vamos mira\nAh el Control Machete ah\nArtillería Pesada, ah\nCypress Hill, Mellow Man Ace, mira\nAh ah AH! AH! AH!...\nAsi es", "image": "https://images.genius.com/7ed2aaa22a809f0477e1657ee204d5a1.1000x1000x1.jpg"}], "artist": "Cypress Hill"}