{"songs": [{"title": "Hard", "album": "Layers", "year": "2016-04-15", "lyrics": "[Teacher speaking]\nEverything is hard, hard, hard\nI mean life is hard, bills is hard\nShit, it’s all hard (hard, hard, hard)\nGot to get that out your mind\nI want to think that hard, be real with yourself. College ain’t for you\nIn fact, I want you to take up a trade\nYou know, become a carpenter\nDid you know Jesus was a carpenter?\nShe don’t want you. Getting in that girl’s drawers is hard\nRemember that, boy, hard\nGood luck, baby\n\n[Royce Da 5’9”]\nTeacher, Teacher I don’t understand what you even wanna talk for\nUnless an interpreter’s gon' come up there and talk for me\nBecause we don’t speak the same language, you say shit like “take up a trade and your thoughts bore me”\nYou don’t teach me nothing, you just talk towards me\nI’m gon' need your assessment and fast\nLook around you, do I look anything like the rest of your class?\nCan’t you see that I’m special?\nI don’t act like these fucking crumb snatchers\nI don’t even breathe like ‘em\nI was born with my lungs collapsing\nI walked right up to the drug dealer in my class and asked him\n“How did you get such a bad bitch?”\nHe said “it was hard and the best ones are the hardest to get”\nAnd I went on to see the world, and he went on and started the trick\nAnd now when I see his girl, she be on my dick\n\n[Chorus]\nI guess fucking the baddest bitches around wasn’t hard as I thought\nMan, what the fuck was I thinking? (Get Money)\nJewelry and cars (cars, cars, cars)\nAchieving the highest level of success ain’t as hard as I thought (top the world)\nWhat the fuck was I thinking? (I was drunk)\nI was drunk or I was lost (You was lost) (Yeah)\nMy people said it would be hard (Hard, Hard)\nMy teacher said it would be hard (Hard, Hard) (It’s gon’ be hard)\nWhat the fuck was she thinking?\nWhy did I listen to y'all?\nWhat the fuck was I thinking?\n\n[Verse 1]\nMy finest hour is here, this is what I see in my prayers\nThis is me, though I’m facing all of my fears\nMaking all my enemies look in the mirror\nAnd see the meme of the Jordan face with all of the tears\nWhat most of you analysts ignore, it’s my explosive animal allure\nI went away to get in the way of my wife planning a divorce\nHandled it and came back more talented than all these rappers\nThough I’m DiCaprio, all they have on me is the awards\nI’m a Steinway grand piano, they’re Casios, I will kindly pass them the torch\nThe day that one of them are able to hold a candle to my corpse\nI’ll put a hand on your whore, even if she ain’t my type\nAnd this song is inspired by Broadway play called Hamilton I saw that changed my life\nRight away, so my next move is to either screenwrite a movie or write a play\n\n[Chorus]\nI said fucking the baddest bitches around wasn’t hard as I thought\nMan, what the fuck was I thinking? (Get Money)\nJewelry and cars (cars, cars, cars)\nAchieving the highest level of success ain’t as hard as I thought (top the world)\nWhat the fuck was I thinking? (I was drunk)\nI was drunk or I was lost (You was lost) (Yeah)\nMy people said it would be hard (Hard, Hard)\nMy teacher said it would be hard (Hard, Hard) (It’s gon’ be hard)\nWhat the fuck was she thinking?\nWhy did I listen to y'all?\n\n[Verse 2]\nI’m looking like the black Bond in Africa\nHotel room look like a beautiful crime scene, in fact it’s a\nSpectacular Halle Berry, Vivica massacre\nLeft behind by a serial bachelor\nFall back, y’all, I really don’t fall back enough\nYou’re not gon’ not sound soft to us\nThe shotgun will throw a box of black balls at ya like Count Chocula\nThat last line, I was just on my Pharoahe Monch\nRappers, kneel before me like I’m trying to prepare a punt\nI’ll cut your body up and put it in two different cars\nPut it in the river, have you swimming in a pair of trunks\nMomma asking when I’m coming to the church\nMy little brother asking for the Aston\nI threw the keys to him like I’m fronting up some work (Ha, good looking, Nickle)\nI used to not be a trendy guy\nNow I probably got more pairs of Balmain jeans than Wale and Envy got\nAh, somebody pinch me\nPardon me\n\n[Interlude]\nTeacher, teacher, I’m so sorry I’m late\nI’m Lyric Montgomery’s father, I’m here for Career Day\n(Hi, Mr. Montgomery)\nCan I talk to the kids?\nHello, children, how was your day?\nI’m Royce Da 5’9”, and over the years\nI’ve been blackballed\nI’ve been in jail\nI’ve seen lives turned\nBut guess what I’ve learned?\n\n[Chorus]\nI learned that fucking the baddest bitches around wasn’t hard as I thought\nMan, what the fuck was I thinking? (Get Money)\nJewelry and cars (cars, cars, cars)\nAchieving the highest level of success ain’t as hard as I thought (top the world)\nWhat the fuck was I thinking? (I was drunk)\nI was drunk and I was lost\n\n[Verse 3]\nAnd you know what else\nEverybody asking me just because I'm a lyricist in this business\nHow come I haven't gone broke yet?\nI tell 'em it's cause I'm the flyest backpacker ever\nI'm flyer than Mos Def in a Trump tower surrounded by four chefs\nFixing him some salmon croquettes with Kendrick, Cole and Kweli\nIn their Jidenna clothes, try me, you and your crew will bleed\nY'all bums ain't shot for the stars since New Years Eve\nNothing was given to me\nI had to go upside heads just to get upside hills\nNever over the hill though, so I don't strike when the iron is hot\nI strike whenever the fuck I feel\nI eat what the fuck I kill\nI got this way from not being allowed to eat dinner\nIf you knew how much I've lost, you'd have no problem with me winning\nHow many times could I be reinvented?\nMoney is the deadlier of the five venoms, in my denim\nDefinitively got a wad in 'em, garages with cars in 'em\nHanging out in bars to have menages with bartenders\nGod was an artist and Jesus was a carpenter\nThey put me together like an easel in the darkness of hell\nAnd lost it and left me some loose screws, but\nThese are the nails to your coffin\nThese are the folk tales of a starving artist\nBattling demons through his notepad like Adam and Eve eating kale in the garden\nFlying private away from all charges", "image": "https://images.genius.com/533ac062d389201c4e7eb9a973709ea4.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}