{"songs": [{"title": "Solid", "album": "Mixtape", "year": "2010-03-23", "lyrics": "And soon both of us learn to trust\nNot run away, it was no time to play\nWe build it up, we build it up, we build it up\nNow it's solid, solid, beat and shut out of money\nTook this wallet, should it halla, please help me\nSomebody stop me, is this so healthy?\nFrom dog, pop cross over\nI pop nigga and cross over, get the plug\nI was going throw something wrong was right\nI shouldn't wait to get off the ghetto, to throw a fight\nEven if a mama bite and it's on a [?]\nGo hard, mad should be your whole life and\nFuck with you, I know this gonna be alright cause people [?] he sees all night\nAway and stress everyone to bet himself\nTrusting the fact, you can see [?]\nKeep shit so real that he can't even tell you\nIt's so real, it's still me around\nMan, now the nigga is hurting Ram-Page and X\nGet nigga burning\nCome on, man, get out the page and shit looks like move like away from States, States\nCome on, come on man\nI'll be getting down, hands in the air, when a nigga hit down\nRampage I'm back in the street again\nMe and he, get back on the street again\nTell the block, tell the streets, tell the hood\nHey! Ooh niggas is up turn up [?]\nDon't get it messed up, you didn't mess up, you don't after\nYou don't get shot, you get brake up\nYou get claimed up, be on the wake up, you get scratched up\nYes I check out, nothing can't stop, what?\nYou can't change, what?\nThis how we bang what?\nAnd we get touch, this switch will drive you nuts\nAnd yo I got the guts, I got a couple of something and need to switch you up\nIn the middle of the club we will smack you up\nClose, so close, my dudes gonna back it up\nWe shutting in the hood, weppening, we got the hole\nMan now nigga hurting, Ram-Page and X, get nigga murding\nMan get out the gang shit, move like way, state to state\nCome on yeah, I'll be get down\nHands in the air and a nigga hit down\nCome on, just stop in the floor\nNigga you sure you wanna fuck with me\nGoing down, can't hit what you can't see\nAlright, you really want it, then just say my name\nYou got all these fucking playing and ain't no game\nWhat this gonna be with this man\nDo you really want a man how's missing?\nI come to where you rapping\nAre you rapping in New York?\nYou better run then walk, as you run don't talk\nCause nigga come throw and it's all\nLike my, my get in, I know you wanna fuck with\nNigga get deep, in a [?]\nGet down, go hard, this shit is solid\nMan, now the nigga is hurting Ram-Page and X\nGet nigga burning\nCome on, man, get out the page and shit looks like move like away from States, States\nCome on, come on man\nI'll be getting down, hands in the air, when a nigga hit down\nMan, now the nigga is hurting Ram-Page and X\nGet nigga burning\nCome on, man, get out the page and shit looks like move like away from States, States\nCome on, come on man\nI'll be getting down, hands in the air, when a nigga hit down", "image": "https://images.genius.com/c768a0855d18bfa64f81a797bb10d78f.355x355x1.jpg"}], "artist": "DMX"}