{"songs": [{"title": "Maserati / Jurisdiction", "album": null, "year": "2014-09-17", "lyrics": "[Part I: Maserati]\n\n[Intro]\nMmm\nThis shit make me wanna, like, hop in the whip and just swerve\nUh, Joyner\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah\nUh, woo\n\n[Verse]\nMan, I wish I had a Maserati (Maserati)\nI'd be taking pictures for the paparazzi (paparazzi)\nFeels so good, she wanna pop a molly (woo)\nR.I.P. to Whitney, I ain't knockin' Bobbi (knockin' Bobbi)\nGo check my history, can't nobody stop me (nobody stop me)\nI should take a picture with Mahatma Gandhi (yeah)\nWas creating the music when the cops behind me (cops behind me)\nAnd now I'ma bring them strippers to the private party (private party)\nBlack laces, I don't rock Versace (never)\nI be speeding with the engines on the Kawasaki (vroom)\nCouple shots to the kamikaze (tank)\nWe can get to cookin' like some hot hibachi (hot hibachi)\nMy Spanish bitch, she give me sloppy-toppy (bang)\nYou should use your manners when you talkin' 'bout me (use 'em)\nI've been ridin' solo, I ain't got no posse (uh-uh)\nI just saw the people that forgot about me\n\n[Segue]\nDon't you wish you were? (yeah, yeah)\nDon't you, don't you wish you were? (yeah) (yeah)\nDon't you, don't you wish you were a little bit hard? (yeah)\nDon't you wish you were a little bit hard? (yeah)\nAnd don't you wish you were?  (yeah)\nDon't you, don't you wish you were?\nDon't you, don't you wish you were a little bit strong? (yeah)\nDon't you wish you were a little bit strong? (yeah)\n\n[Part II: Jurisdiction]\n\n[Intro]\nJoyner, Joyner, Joyner\nYeah, yeah\n\n[Verse 1]\nUh, put the cause on the totem, put the balls on the boat\nAnd hit 'em all with the motive (with the motive)\nJoyner's all in the focus\nAnd the blogs want to post a niggas songs and you notice (and you notice)\nI'm a star, undervoted\nI'm a dog, I'm a Doberman pinscher, you a pony\nYou a unicorn, Louis Vuitton, sneakers on woadie\nTrying to be up on me and my niggas like you know me\nYou don't me\nYou just know what the people wanna tell ya (yeah)\nTalkin' on the low, but the speakers gonna kill ya\nSleepin' on my back with the TV on the ceilin'\nGot Jeezy on, chillin' with the kiwi hard sippin'\nE'erybody wanna live like Tony Montana (Tony Montana)\nSniffin' out the coke with the homie, don-da-da\nDrug dealin', bang bang, with the phony bandanna\n'Til the homies run right up in your cozy mañana\nThat's real (that's real)\nFuck a talk (fuck a talk)\nFunny how a funny nigga come across (come across)\nFunny how the money make a sucker talk\nWhen it feel good like a nigga took the rubber off (that's filthy)\nI see both sides like tug-a-war (tug-a-war)\nJoyner's on fire, close the oven door (woo)\nBeat the pussy up like a drummer boy\nThought you ran the city, what the fuck you niggas runnin' for?\nFuck the law\nTell the politician I'm a terrorist (terrorist)\nAnd tell the government that I'm a colored kid\nTryna make a penny off of half a G\nAnd that'll be the day you catch me workin' at a god damn Applebee's\nNigga, don't be dappin' me (dappin' me)\n'Cause we ain't got shit to talk about unless you talkin' 'bout a salary (salary)\nAnd rappers wanna talk about battle me\nBut they can suck my dick with a mouth full of cavities\nOh, you in trouble (trouble)\nAnd I love it how they hate you (how they hate you)\nBut they actin' like they love you\nThen they kiss you, then they hug you (then they kiss you)\nMake a screwed face at you (uh-huh)\nMiddle finger saying \"Fuck you, nigga\"\nThat's just motivation (motivation)\nI ain't hatin' like a sucker (uh-huh)\nBut I treat you like a slugger\nUppercut you 'til you crumble (uh-huh)\nHave you singin' like Usher (like Usher)\nYou a dish to my supper\nMotherfuck a nigga, uh\n\n[Verse 2]\nNever ever have I ever\nEver seen another motherfucker fuck her\nFuck her better, better than him\nIf I ever did\nThen I was never ever on this planet\nBut I plan to dead him and forget him\nIf I ever seen another\n'Nother different mother fucker\nOn a level of a level one\nLevel headed rapper\nThat be rappin' circles\n'Round the circles that you rappers burnin'\nBurnin' rappers like I'm burnin'\nBurnin' bridges with the niggas\nThat be burnin' bitches\nOn a murder mission\nStay the fuck up out my jurisdiction (jurisdiction)\nStay the fuck up out my jurisdiction\n\n[Verse 3]\nI'm on a murder mission\nStay the fuck up out my jurisdiction\nStay the fuck up out my jurisdiction\nThe judge told me I don't listen\nStay the fuck up out my jurisdiction\nStay the fuck up out my jurisdiction\nRun and tell the competition\nStay the fuck up out my jurisdiction\nStay the fuck up out my jurisdiction\nI said, I'm on a murder mission\nStay the fuck up out my jurisdiction\nStay the fuck up out my jurisdiction\nI'm on a murder mission\nStay the fuck up out my jurisdiction\nStay the fuck up out my jurisdiction\nThe cops told me I don't listen\nStay the fuck up out my jurisdiction\nStay the fuck up out my jurisdiction\nRun and tell the competition\nStay the fuck up out my jurisdiction\nStay the fuck up out my jurisdiction\n\n[Outro]\nJurisdiction\nRegarded as mercilessly destructive and unstoppable\nSomething that demands blind devotion\nOr sacrifice\nWhat are you willing to sacrifice?\nTo censor the word is ground\nWhen you can, it's comparable\nTo mean something more than\nJurisdiction", "image": "https://images.genius.com/310b187de2d4998868352b9f651998a1.480x360x1.jpg"}], "artist": "Joyner Lucas"}