{"songs": [{"title": "Girls (Limp Bizkit Diss)", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Intro]\nAyo, dawg, I got some shit on my motherfuckin' chest\nThat I need to get off 'cause if I don't\nI'ma fuckin' explode or somethin'\nNow, look, this is the story about\nSome little fuckin' girls that I know\nIt goes like this\n\n[Verse 1]\nIt's so easy for me to make enemies any more, it's sickening\nPeople are lookin' for an excuse to jump on my shitlist\nStickin' their noses in shit that isn't none of their business\nI never asked, cared, gave a fuck, or wanted opinions\nNow I'm in the position that I don't wanna be in shit\nI never had no beef with you corny son-of-a-bitches\nBut now the shit is broken, you can't do nothin' to fix it\nSo I'm tellin' you right now, motherfuck a Limp Bizkit\nNow I'ma be real, B-Real was real\nHe ain't say shit the whole time me and Whitey was beefin, see, he chilled\nHe was cool with the whole situation and kept it neutral\nI'd have never involved my crew if it wasn't for pupils\nPeoples, whatever your backpackin' cipherin' name is\nHad I not opened a magazine and seen what you were sayin' and\nI'da never involved you, but you had to add your two pennies\nNow I gotta go grab my shitlist and add some new enemies\nHit the studio and I'll admit, I had a few in me\nFuck it, I roasted you, I ain't mad at you any\nBut let it be known that song was never released, it leaked\nI'da never gave you that much attention intentionally\nThen I look on the TV, now look who's mentioning me\nThat little fuckin' weasel, DJ Lethal, on MTV\nAfter I gave you props in that song, you on national TV\nTalkin' 'bout Everlast is gonna whip my ass when he sees me?\nCome on, dawg, he was s'posed to be on that song\nTalkin' 'bout how bad you hate him, now you all on his thong?\nWhat's wrong? You scared? And Fred, you said you was dissin' him too\nI shoulda knew better than to listen to you\nYou fuckin' sissy, up on stage, screamin' how people hate you\nThey don't hate you, they just think you're corny since Christina played you\nAnd I dare you motherfuckers to try to diss me back\nThat's a sissy act, and don't call me kissin' my ass\n'Cause I swear to God this ain't just a song, I'm tryna to pre-warn you\nLethal, when I fuckin' see you, dog, I'm swingin' on you!\nMotherfuckers must think 'cause I'm in trouble with the law\nThat I won't jaw 'em, up my sentence and double it tomorrow\nY'all some...\n\n[Hook]\nGirls (Y'all are some goddamn girls)\nWhy do you act this way? (Why do you act this way, huh?)\nWhy do y'all act like fuckin' sissies, you pussies\nKeep talkin' shit behind my back, you just some bitches for that\nAnd we all know (we all know, hah)\nHow fuckin' cowards roll (Keep rollin' rollin' rollin'!)\nIn fuckin' Bentleys and pretend to be down\nBut as soon as someone calls you out\nYou put your tail between your legs and bow down\n\n[Post-Hook]\nNow, I don't ask nobody to share my beliefs\nTo be involved in my beefs\nI'm a man, I can stand on my feet\nSo if you don't wanna be in 'em, all I ask\nIs that you don't open your mouth with an opinion\nAnd I won't put you in 'em\n'Cause I don't ask nobody to share my beliefs\nTo be involved in my beefs\nI'm a man, I can stand on my feet\nSo if you don't wanna be in 'em, all I ask\nIs that you don't open your mouth with an opinion\nAnd I won't put you in 'em\n\n[Verse 2]\nNow see if you diss me and I respond, the beef is on\nBut if I help you sell one record\nAnd I see you at a show, I'll strip you naked\nSee, I was smart, I came back and scooped up my friends\nNow I got five dawgs that'd die for me like I'd die for them\nI'd fight for them, swing or shoot like I fight for Kim\nAll of 'em been with me through this fucked up life that I'm in\nThat goes for all of my dawgs, from Royce to Dre\nFrom Xzibit to Mel-Man, 'til I'm hoist away\nIn my coffin I'll never soften, no matter how often I'm tested\nI'll never give a fuck, I won't never be interested\nLove me or hate me as much as Fred wants to be hated\nI will solemnly stand by every statement I stated\nThis shit that I been through my pencil never could pencil\nBut I will never be this gullible ever again no, nope\nNext time I'll know when someone's copyin' off me\nI'm not bein' cocky, I just know when somebody's mockin' me\nI stick up my middle finger, he sticks up his finger (hey!)\nI say, \"Fuck Christina!\",  he says, \"Fuck Christina!\", but meaner\nSo from doin' a song with Method to beggin' to get accepted\nI'm peggin' Fred with the bottle of dye that he bleached his head with\nAnd as for Lethal, don't forget what I said\nI'm fuckin' you up, punk, you're dead! Don't think that I'm playin'!\nAnd fuck Bizkit! 'Cause I know you're sayin', \"Fuck D12!\"\nOnly not to our face, under your breath to yourselves\nLittle ...\n\n[Hook]\nGirls (Motherfuckin' females)\nWhy do you act this way? (Why do you act this way, huh?)\nWhy do y'all act like fuckin' sissies, you pussies\nKeep talkin' shit behind my back, you just some bitches for that\nAnd we all know (we all know the truth)\nHow fuckin' cowards roll (Keep rollin' rollin' rollin'!)\nIn fuckin' Bentley's and pretend to be down\nBut as soon as someone calls you out\nYou put your tail between your legs and bow down\n\n[Post-Hook]\nNow, I don't ask nobody to share my beliefs\nTo be involved in my beefs\nI'm a man, I can stand on my feet\nSo if you don't wanna be in 'em, all I ask\nIs that you don't open your mouth with an opinion\nAnd I won't put you in 'em\n'Cause I don't ask nobody to share my beliefs\nTo be involved in my beefs\nI'm a man, I can stand on my feet\nSo if you don't wanna be in 'em, all I ask\nIs that you don't open your mouth with an opinion\nAnd I won't put you in 'em\n\n[Outro]\nAnd that's it, that's all there is to it, dawg\nIf you didn't wanna do the fuckin' song\nDon't say you're down with doin' the fuckin' song\nAnd then back out at the last minute\nAnd then go on motherfuckin' MTV talkin' about\nEverlast can whip my motherfuckin' ass\nIf you're scared of Whitey Ford, dawg\nJust say you're scared of Whitey Ford, that's it\nThat's all you had to fuckin' say, I wouldn'ta said shit\nI woulda backed off, did the motherfuckin' song myself\nAnd not put you motherfuckers in it, that's all\nNow, I ain't even on no rap shit no more\nI'm on some fuckin-you-up-shit when I see you\nAnd I will see you, too\nOh, and by the way, Fred\nThat wasn't an accident\nI didn't mean to give you a play at the Music Awards\nHaha!", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "Eminem"}