{"songs": [{"title": "Break (All of the Lights)", "album": null, "year": null, "lyrics": "[Intro]\nTurn on the lights in here, baby\nExtra bright, I want y’all to see this\nTurn on the lights in here, baby\nKnow what I mean, want you to see everything\nWant you to see all of the—\n\n[Verse]\nHollering at this Japanese girl, Asian mommy\nBut is it too soon for Japanese girls? Too tsunami?\nIs it racist if I say she tastes like edamame?\nWas I supposed to stay uncool? Please remind me\n(What the fuck is up?)\nYeah, it’s Cheezy, ho\nI’m so cheesy, ho, my swag’s got high cholesterol\nI know y’all girls, I met them all\nYou're her ex-man like Cannonball\nI ain’t got shit to say to ya, I’m known for bad behavior\nLook at me\nMan, I went to the W from Double Tree\nMakin’ out with girls who black and yellow like a bumblebee\nCan I live up to all this hype they have for me? It’s hard to tell\nBut these girls I’m kissin’ chase the blues away like Gargamel\nI’m back in the game, coach put me in\nT-Pain flow, all I do is win\nWith a glass full of Macallan to mess me up\nAnd the cash we can throw at them unless we fuck\nDopeness\nAfter this I hit the highway\nI’m headin’ west like I’m fuckin’ blowin’ Kanye\nRead the fuckin’ news, Huey Lewis, nigga\nYou can’t go H.A.M, you’s a Jewish nigga\nDonald Glover, you don’t have to call me \"Childish\"\nExcept for when I’m flirting with your half-Latino stylist\nPhotoshoot, beach house playin’ Beach House, free wireless\nSo I can post these pictures on my website of her smilin’\nI kissed this girl I’ve liked since back when I was just a sophomore\nBut I’m afraid to text her “What the fuck it take so long for?!”\nWhat the fuck has changed? Is it swagger? Is it money?\nI still dress the fuckin’ same and my nose is still as ugly\nAs the day you fuckin’ met me\nThey tellin’ me I’m the rapper for these white kids\n‘Cause black kids can’t possibly like the same shit\nI wanna bring you back to the studio, try and get your number\nThese black girls with natural hair who keep up with their tumblrs\nI like it when you tweet me, you smell like baby lotion\nI wanna suck your breasts and finger blast to Frank Ocean\nHer pussy tastes like vanilla, tasty ho\nClown niggas then I kill ‘em, Gacy flow\nIt’s crazy how these labels and these blogs are on my dick\nI’m Pryor in his last years: comedian who’s sick\nFuck, but I am sick, seriously, I don’t feel so good\n‘Cause I don’t get sleep, and I’m always travelin’\nAnd I don’t go home, and my friends don’t call\n‘Cause I turned off my phone\nI’ve made mistakes, I bumped my head\nInside of this girl, inside of my bed\nWhatever, man, I’m just havin’ fun\nI’m sorry that I fucked her but now you know that she’s not the one\nI’m doin’ you a favor, like every time I rhyme or write a script or do a movie\nThere’s a million ways to shine, choose one\nInstead of what you’re doing tonight\nIAMDONALD, coming soon, we've got all of the lights\n\n[Outro]\nTurn on the lights in here, baby\nExtra bright, I want y’all to see this\nTurn on the lights in here, baby\nKnow what I mean, want you to see everything\nWant you to see all of the—", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}