{"songs": [{"title": "Right Back", "album": "Independent’s Day", "year": "2005-06-28", "lyrics": "\"To attack without knowing the enemy's strength is foolish\nAnd after being warned, to still attack, is stupid\nPeople who are that stupid just don't deserve to live\nBut strangely though, one does find, people who are that stupid.\"\n\n[Hook: Royce]\nPop that trunk, get the K nigga\nGet to sprayin nigga, get the pump nigga\nCome - RIGHT BACK; dump on a nigga\nGive him what he want if he want we'll hunt for 'em all\nHe'll be - RIGHT BACK; it's got to be like that\nExpect niggas not to respect you, kill him\nAnd get it - RIGHT BACK\n\n[Royce Da 5'9\"]\nFor those that don't know me\nAllow me to reintroduce myself\nMy name is {*chk-chk, BOOM*} 5-9 nigga bottom line is\nBye-bye if you out of line wit him\nItemize y'all deaths in, chronological order\nThose either gon' support him or idolize\nAll you could do is try to dodge me\nWhile you plottin my demise while I'm tryna rise now we got a problem\nCause if I'm surrounded, I'm known\nTo pull out the pound and shoot, get on the phone\nAnd still come - RIGHT BACK - wit a army of dudes\nIt's all true, just armed with Uzis lookin to resolve this\nGood Lord, can you hear him callin?\nThey just still ballin, they feelin lawless, we kill 'em all\nIf it costs too much, we hun-ga-ry\nIt means if you floss too much your gums'll bleed\nThat's why I don't talk with chumps, I was taught to thump\nMy way to 21 'til I was taught to come - RIGHT BACK\n\n[Hook]\n\n[Juan]\nFor those who don't know\nAllow me to reintroduce myself\nMy name is {*chk-chk, BOOM*} Juan Corleone\nDie real soft, fire in a while then he blow\nWhile you niggas act raw with your dawgs\n'til revolvers gettin drawn, splash markin the walls\nI don't know but I'm givin it to 'em\nHittin 'em brutally with them Uzis man really amusin\nHow niggas duckin, divin, hollerin, hidin under shit\nBullets bustin, bruisin they body, barely bouncin shit\nLike, why you lookin at me smirkin nigga?\nI got a short man complex, murk a nigga\nBigger than me, taller than me, my squad in the league\nI ride slow ballin for sheez, all of you plead\nWho wanna test? Keep scrutinize you and your guys\nTwo of them nines, better shoot them now 'less you wanna die\nI'm stupid high, Lord super sized blessin the dome\nHuggin some long John Wayne shit, fuck is you on?\nWe comin..\n\n[Interlude: Royce - having a conversation]\n(Man hell naw, that's Royce) Right, what's up wit it?\n(Whattup nigga, where you been?) I been callin you\nSomethin must be wrong with your phone right? (Yeah, yeah, no, yeah)\nOhh okay, what's up, you got that for me? (Naw, yeah, naw)\nNaw? Alright well, I'mma get up outta here\nCause I see you havin fun with your people (Nah shut up man)\nYour man he's a funny guy and all that (Yo hold up)\nI'mma see you later (Hold up Royce, hold on)\n\n[Kid Vishis]\nFor those that don't know me\nAllow me to reintroduce myself\nMy name is {*chk-chk, BOOM*} yeah, Kid Vishis\nThat sick shit, listen, I hit henchmen\nFrom shotgun wit a shotgun, surprised when pellets flyin\nAnd niggas that was hatin us dyin\nRoll with them Chaldeans that get mad if you call them an A-rab\nYou might get stabbed for your antics\nStay rude shooters with Rugers, put the block-a\nOut the windows guns cocked screamin out \"Erub Khaba!\"\nAll races are frown faces with heated ways (yeah!)\nWith somethin in the trunk that thumpin just like bass\nTrust me, no mics, this shit gon' get ugly\nBefore the boys cuff me, \"take that\" like Puffy\nYou've been hexed, squeeze this Tec\nShots hittin jugular veins, give 'em taco necks\nI rep my set, Rock City, what you bet?\nM.I.C. regardless, you garbage niggas, we comin\n\n[Hook]", "image": "https://images.genius.com/5296587baa4eefd1b2b1ef7daff66f78.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}