{"songs": [{"title": "I See Ghost’s", "album": "Fuck Da City Up", "year": "2012-01-01", "lyrics": "[Hook: Future]\nHey I think I seen a ghost\nHalf a million dollar car, ain't even got no note\nBitches layin' on the bed, bitches on the flo'\nMoney to the ceiling, money come and money go\nI think I seen a ghost, I think I seen a ghost\nHamiltons and Franklins, they come in every show\nMoney to the ceiling, how you love you can go\nGraveyard in my pockets, dead presidents to blow\nI think I'm seeing ghosts\n\n[Verse 1: Future]\nMoney burning in my hand while I'm still counting\nWe put drivers in the seats, I'm in the back lounging\nMy bitch she don't even speak no English when she come in town and\nI'm seeing dead people, man I got like four accountants\nIt's all my yayo in that pot we need a water fountain\nWe put that yayo in the East and in Fulton County' (?)\nI'm counting dirty money, I don't need no help to count it\nIt had blood, it had sweat on it when I found it\nI'm going higher than a elevator out the country\nI do whatever for that paper, it ain't on my country\nI went to sleep inside a ghost, I think it was a phantom\nMan I get rock and roll high, dog I'm off the channel\nI got sixty racks on me just in case she want to gamble\nAnd I go crazy with that back, it ain't nothing I can't handle\nI'm in my room with the light off, burning candles\nYoungest nigga with the set, repping Atlanta\n\n[Hook]\n\n[Verse 2: T.I.]\nHis money timid, hear motherfuckers talk money\nI inhale bills, breathe Gs, cough money\nI'm still making cake even when I lost money\nA multimillionaire, stil lspending soft money\nI'm balling way above par, got golf money\nThe bus full of duffel bags and that's all money\nYou wonder what my motivation? Bro, it been money\nMake extra jet cause my little mama love to spend money\nWe Texas Hold 'Em, rolling dice with your rent money\nGet out my face and fuck your life if you ain't getting money\nSay boy, I spend the money you're trying to make\nSell 100 Gs and it's sad to say\nBig dough, I get that\nIn a fear? Push your shit back\nI'm arrogant and I'm cocky cause I got a graveyard in my pocket\nSpent 100K on my chain and a couple mill on my watch here\nMy chick ride in that car you in\nThis city, I argue in\nGet big money, no little dough\nSee dead presidents, real ghosts\n\n[Hook]\n\n[Verse 3: Rocko]\nBoo! That's the look on the haters face when I pull up in the ghost like Casper\nOoh! That's what your boo said when she snuck a peek at me right before we got ghost\nOn my chopper with a chopper, they call me Ghost Rider\nI swear my pen dripping, I should be a ghostwriter\nI see them suckers, I get ghost\nI don't fuck with busters\nToo busy sitting ghost, you know how that goes\nGive me more, Demi Moore\nYeah I ghost that work\nWhip it like Goldberg\nYeah I ghost that word\nHeavyweight, Goldberg, I'm a wrestler, ho\nClothesline that bankroll, I be wrestling ghosts\nChauffeur find our way back, trunk passengers ghost\nGot my green from the Bay, ghost ride the whip\nHey man, Hallelujah in my True Religion denims\nYeah, Rocko do the most, pocket hundred full of ghosts", "image": "https://images.genius.com/c4a42649ba1a4f401f2ed78317e312fc.1000x1000x1.jpg"}], "artist": "T.I."}