{"songs": [{"title": "Fuck Y’all", "album": "Osirus", "year": "2005-01-04", "lyrics": "[Intro: Ol' Dirty Bastard]\nWhy ya'll always be talkin' shit (I'm comin')\nYou're always talkin' shit (want me I'm come? We coming)\nWhy ya'll always be talkin' shit (I'm comin')\nYou're always talkin' shit (want me I'm come? We coming)\nShit (we coming, we coming!)\n\n[Ol' Dirty Bastard]\nI'm the nigga walkin' through the Hill, with the gun out\nLookin' for the big mouth, showin' off in front of bitches\nTalk about Dirt, leave you lumped up in stitches\nDig a lotta ditches, for you six feet spitters\nPut the barrel in ya mouth, I'm the shell case shitter\nMasquerade paid, stay on the front page\nPlayin' on streets, like streets was arcade\nMy hand's all sprayed, like Charles blades the gensu\nFeel the lucy, and spark up the neptune\nResurrect them, to dawn on, protect 'em\nOutside set up, guess who inject them\nWalk through zoo, but no Zu, is Brooklyn\nHeavy artillery, thug chains in Brooklyn\nStrapped in the back of the Ac', Dirty rolls like that\nThat's a Crooklyn fact, find Dirty\nAnd you find where the cash is at, fuck y'all\n\n[Hook 2X: Ol' Dirty Bastard]\nWhy ya'll always be talkin' shit (fuck y'all)\nEverytime I hear you talkin' shit (fuck y'all)\nAnd anytime I hear you talkin' shit\nWill be the last thing that you be talkin', shit (fuck y'all)\n\n[Ol' Dirty Bastard]\nSpit fire like a livewire, the messiah\nTake you higher than the last hit, mythological\nIn pussy logic, gynecolagist you can swallow\nCuz it' O.D.B., bitch!\nBring it like the Warriors, on the D Train\nExplosive rap game, like a Meth thing\nSpit acid, the Ol' Dirty Bastard\nPull like coast, to toast it, while I'm acid\nTen stories up, penthouse, only us\nMeanwhile I'mma strain, what I can't crush\nFresh, wild and bold like the Cold Crush\nPurple haze keep a nigga with the robut (fuck y'all)\nOn the major when the bitch slap, giddy up\nI'm an ass man, but I tear the titty up\nTear ya whole city up, bring it if you grittier\nDirty ain't so pretty, even when the legs are levetated\nEscalated, cuz I'm made of Baby Jesus\nWelfare card expired, so I need this\nDirty rolls like that, that's a hood fact\nFind Dirty and you'll find where the cash at\n\n[Hook 5X]", "image": "https://images.genius.com/4250840e6d0ec82feb74e42c448c72d7.455x455x1.jpg"}], "artist": "Ol’ Dirty Bastard"}