{"songs": [{"title": "Who Fucks wit Me", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "[Nelly] WOO! Uhh uhh, yeah\n\n[Hook: Avery Storm] + (Nelly)\nI ain't even gotta talk no more\nAll my letters speak for itself\nYou see my numbers, you can add 'em up\n(Now who fucks with me?)\nI ain't even gotta rap no more (no!)\nMy money works for itself (uhh)\nI'm runnin interest while I'm sleepin man\n(Now who fucks with me?)\nOooh-oooh-oooh-oooh-oooh-oooh-oooh\n(Yeah, now who fucks with me?)\nOooh-oooh-oooh-oooh-oooooh\n(Uhh, uhh, now who fucks with me?)\nOooh-oooh-oooh-oooh-oooh-oooh-oooh\n(Ay, now who fucks with me?)\nOoh-ooh-ooh-ooh-ooh (I'm earnin interest as I'm speakin man)\n(Now who fucks with me?)\n\n[Nelly]\nI ain't even gon' talk no mo'\nWhen you done with the minors ma come to the pros\nSee I could put you in all them clothes\nYour neck, wrist, ears, hands, all that froze\nHe could never ever put you in a rose\nBut anything goes when you dealin with the baller\nStand on my money if I wanna be taller\nSmack him with a G, I bet he go and get his lawyer\nCause he really wanna sue me\nTake the bitch route, cause he know he cannot do me\nKnow he can't outdo me in the records or the movies\nMan, I don't want your girl, plus I heard she got the cooties\n(Ah, ah, ahh...)\nIf you mean what you feel then I mean what I said\n(Ah, ah, ahh...)\nYou don't like cheap sex, I laid a mil' on the bed\nSpread it all out and we can roll around in it\nHop off in the whip and we can roll around in it\nIn the back seat and we can go to town in it\nOr maybe on the hood, sound profound, did it?\nHe ain't get the message ma, act like he ain't get it\nHe ain't catch a hint when you gave him back his rented\nNow his lil' condo one less tenant\nAnd I did it - but you know what?\n\n[Hook]\n\n[Nelly]\nYo, yo, yo, yo, yo\nWell who you know with ten mil' on a plaque?\nHit the Superbowl once so they brought me on back\nRide around with my Grammy's on the 'Llac\nBetter bag up nigga, Nelly bonds are the bag\nMe be the rapper, Nicky Bonds be the crack\nThink I fell off when they fell from the track\nYou wanna come to Nellyville I'll draw you the map\nFollow that yellow brick road\nFollow that rainbow of diamonds down to the gold\nFollow shorty as she slide down a pole\nHe tryna make it rain but it's comin down slow\nI hope he got the gloves cause I'm about to make it snow\n(Ohh, ohh, ohhh...)\nLike kids seein Santa when I walked in the club\n(Hohh, hohh, hohhh...)\nBut I only brought presents for the girls\nListen, play with me nigga if you wanna, if you feel\nWon't kill at will but will kill Bill\nSomebody better grab Bill, tell him to chill\nBefore somebody find him buried in the hills\n(Ah, ah, ahh...)\nI got a reach, try on an order myself and such\n(Ah, ah, ahh...)\nCause I be feelin myself too much, now listen\n\n[Hook]\n\n[Nelly]\nWOO! Ohh\nUh, uh - now who fucks with me?\nYeah, I ain't even gon' talk no mo'\n(I ain't even gon' talk talk talk no mo', talk talk no mo')\nI ain't even gon' talk no mo'\n(I ain't even gonna talk no mo', talk no mo')\nNow who fucks with me?\n\n[Hook]", "image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg"}], "artist": "Nelly"}