{"songs": [{"title": "Last Ones Left", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: 2Pac]\nNigga, westside!\nWestside in this motherfucker\nWestside in this motherfucker right here\nWestside in this motherfucker\n\n[Verse 1: 2Pac]\nCan't nobody stop us when we blunted up and swervin'\nPacked in a Suburban\nScreaming, \"Outlaw!\", runnin' on the curb\nThey never try me, ‘cause right behind me a killer team\nI get the word, cut the head off a nigga, like a guillotine\nThis Hennessy will keep me calm though\nSittin' in the back of the club, tradin' convo\nLivin' like a Don in my own mind\nSignal Kadafi, nigga, watch me with the chrome 9\nAll the time drinkin' champagne\nWalk through the crowd, let the tramps hang\nNiggas player hate but do a damn thing\nPicture me doin' 80, down a one-way\nStuck in the trunk, caught in gunplay\nSo I gotta keep my eyes open\nGettin' high, wonder why we gotta die smokin'\nMy alibi; a victory\nVictim of a rhyme in a mark for death\nSpendin' my nights like it's the last one left\nI'm an outlaw\n\n[Hook: 2Pac]\nAm I wrong? I wanna get it goin' on\nLast to leave, 'til I see everybody's gone\nI'm at the bar, you can catch me, hands full of liquor\nOr puffin' on a sweet Swisher\nI'm the last one left\nTell me, am I wrong? I wanna get it goin' on\nLast to leave, 'til I see everybody's gone\nI'm at the bar, you can catch me, hands full of liquor\nOr puffin' on a sweet Swisher\nGuess I'm the last one left\n\n[Verse 2: Napoleon]\nI got my back against the wall, gat chillin' by my balls\nPrior to war is a rider nigga that's only 5'6\" tall\nNapoleon only knows on we Outlaws, fuck fear\nBetter strap down to the fullest, ‘cause we outchea\nThug passion all up in me, feelin' like I took some Henny\nIt ain't easy, I'm tryin' to make a dollar out of two pennies\nWhat we got is rep, nigga, wanna pull their gat, nigga\nHe’s only got my side ‘cause they think 'Pac died, nigga\nBlast niggas with our TEC's, takin' showers in our vest\n'Pac, come and catch weight, nigga, we the last ones left\n\n[Verse 3: 2Pac]\nIf we would've known the zone inside my own dome\nFresh outta jail, it was hell, but I'm finally home\nLookin' for niggas that was woofin' that shit\nWhen I was locked back\nHands on the pump, make 'em jump when it cocked back\nFuck 'em all, they're bitches inside a world of weak\nBitch niggas be afraid to speak; we the last ones left\n\n[Hook: 2Pac]\nTell me, am I wrong? I wanna get it goin' on\nLast to leave, 'til I see everybody's gone\nAt the bar, you can catch me, hands full of liquor\nOr puffin' on a sweet Swisher\nLike I'm the last one left\nAm I wrong? I wanna get it goin' on\nLast to leave, 'til I see everybody's gone\nAt the bar, you can catch me, hands full of liquor\nOr puffin' on a sweet Swisher\nLike I'm the last one left\n\n[Verse 4: Kastro]\nI eat and sleep the worst shit, cursed from birth\nMe and my team super supreme, puttin' in work\nI'm passed out, drunk as a fuck, 'til it hurt\nAnd I call Earl screaming, \"Fuck the world!\"\nI got a bitch on the side wanna be my wife\nAnd wifey beefin', wanna know if she gon' see me tonight\nAnd I know it ain't right, but it's the life I got\nAnd that's until I see Yak, and that's until I see 'Pac\nYoung know I lost a troll, somebody owed me down\nAnd if the world was a girl\nI'd stick my dick in the ground; fuck the world!\n\n[Outro: 2Pac]\nWestside in this motherfucker right here\nWestside in this motherfucker…\nUh, Outlaw in this motherfucker right here\nOutlawz in this motherfucker\nWestside in this motherfucker right here\nWestside in this motherfucker…\nUh, Outlaw in this motherfucker right here\nWestside in this motherfucker\nIn this motherfucker right here…", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}