{"songs": [{"title": "Between Me, You & Liberation", "album": "Electric Circus", "year": "2002-12-10", "lyrics": "[Verse 1: Common]\nShe rested her head upon my chest\nSensed liberation in between breaths\nWonder if sex is what she found it in\nPeace, found it laying down with men\nWasn't there to judge her, many ways I loved her\nIt was more than bodies we shared with each other\nWe layed under the cover of friends\nA place where many lovers began\nI began, to feel her body shake in my hand\nBody language, it's so hard tryna understand\nUsually after sex, it's a good feel\nTook by silence, emotion stood still\nI could feel, her tears spill from her grill\nHurt from before that began to build\nShe told me, \"Hold me\", a story she assembled it\nTellin' it, trying not to remember it\nIt was a story of innocence taken\nThought she could redeem, through love makin'\nWhen she was eight, she was raped by her father\nAnd tried to escape through multiple sex partners\nFelt pitiful, she had only learned\nTo love through the physical, inside it burned\nMy heart turned, I thought of what this man did\nShe forgave him, she grew to understand it\nHer soul was tired and never really rested\nOnly through men, through aggression\nSaid it was a blessing and it happened for a reason\nBy speaking it, she found freedom\nBetween me and you\n\n[Hook: Cee-Lo]\nSometimes I wish a, careless whisper\nStill could be heard, without speaking a word\nBecause of you I'm stronger, I'm afraid no longer\nI feel so alive in me, you help liberate me, me, me\n\n[Verse 2: Common]\nShe laid, I watched her breathe\nHappy to be here, not afraid to leave\nI couldn't concieve her not being here\nDeath in her face her not having fear\nLess than a year, she was diagnosed with it\nMemories of that year, so close and vivid\nHappiness, would only visit, once in a while\nTo watch an adult, becoming a child\nSomehow, I knew she'd make it\nThe life of one so given early, would God take it?\nHurt she placed in, hope and prayer\nHurt she placed in chemo and lost hair\nI stare with my eyes closed\nWonder when the body leave, does the mind go?\nWatchin' Jordan became less important\nSeeing this disease eat away my aunt's organs\nAccording to doctors, there's no cure\nWe went through doubt, and cases of insure\nWish I knew then how to heal with herbs\nKnew a part of her I could heal with words\nBut the creator was sending for her\nWhat seemed like the end was the beginning for her\nLike that, she didn't want us to remember her\nNo more medication did she want us to give to her\nIt spread from her liver to her lungs to her last breath\nOnly to be freed through death\nBetween me and you, between me and you\nBetween me and you, between me and you\n\n[Hook: Cee-Lo]\nSometimes I wish a, careless whisper\nStill could be heard, without speaking a word\nBecause of you I'm stronger, I'm afraid no longer\nI feel so alive in me, you help liberate me, me, me\n\n[Verse 3: Common]\nHe spoke with his eyes, tear-filled\nA lump in his throat, his fear built\nMy whole life it was instilled\nThis ain't the way that men feel\nA feeling, he said he wish he could kill\nA feeling, not even time could heal\nThis is how real life's supposed to be?\nFor it to happen to someone close to me?\nSo far we'd come, for him to tell me\nAs he did, insecurity held me\nI felt like he failed me\n'Til his spirit yelled help me\nI'd known him for like what seemed forever\nAbout going pro we dreamed together\nNever knew it would turn out like this\nFor so long he tried to fight this\nNow it was no way for him to ignore it\nHis parents found out and hated him for it\nHow could I judge him?\nHad to accept him if I truly loved him\nNo longer he said had he hated himself\nThrough sexuality he liberated himself\nBetween me and you, between me and you\nBetween me and you, between me and you\n\n[Hook: Cee-Lo]\nSometimes I wish a, careless whisper\nStill could be heard, without speaking a word\nBecause of you I'm stronger, I'm afraid no longer\nI feel so alive in me, you help liberate me, me, me\n\n[Outro]\nLiberation, peace", "image": "https://images.genius.com/4f09b702f3b5aead8b4d73c0bfdb708e.936x936x1.jpg"}], "artist": "Common"}