{"songs": [{"title": "They want me back in (feat. big rich)", "album": null, "year": null, "lyrics": "[Ice-T]\nYeah, sh*t is going down again!\nThis motherf**kers want me back in! f**k!\n[Method Man: Word up, our niggas is strapped, ready for war!] [4x]\nGet out the H-K!\nF**k!\nNiggas talking crazy cause they say\nThat I kill one-a-day motherf**ker\nSucker ass busters, did he, did not\nI got more drama with the niggas from the other side\nCall my nigga Rich and he's right!\n[Big Rich]\nF**k them niggas I got a truck full of 38, some bullet shields\nIce, we can send this niggas all to Hell\nI never like them niggas from the gat\nGo use to braken my cr*ps and f**k all the motherf**kin hoes!\n[Ice-T]\nMade another car-hit 30 Killers on the hip\nReady to rock, packin, eggin and Glocks\nMan connections who trips the question\nNiggas on the way to play in a laser rain\n[Big Rich]\nNigga you got two strikes and I got two strikes\nWe can feudally no f**kin witness tonight\nBut if this is what they want is like Christmas to me\nIt's been a long time since the Big Rich caught a body\n[Ice-T]\nF**k it, I Like the way you think my man\nI pack 20 motherf**kers in a ??? van\nWe bash abd creeo about 12:30, dirty\nNigga be ready to roll, I know you heard me!\n[Big Rich]\nNigga it's on, so don't trip I'm down\nI got to saw ??? and I'm ready to claw\nBless the nigga in the Face kill his f**kin hoe\nIce, you don't did this kind of sh*t with me before!\n[Method Man: Word up, our niggas is strapped, ready for war!] [8x]\nThey want me back in!\nNiggas want me back in!\nThey want me back in!\nDamn!\n[Ice-T]\nNiggas wanne ill, but my nigga get iller\nStreets full of hardcore stone-face Killers\nOne Love my nigga Big Rich puff\nI don't get high, I wanne see some niggas die!\n[Big Rich]\nYo, some niggas hit the corner with the lights of Ice\nThat sh*t don't look nuthin nice\nBut if this niggas wanne rollin my Hood\nYo then f**k it, brake out the whole World, boys f**kin buck it\n[Ice-T]\nNiggas pulled out my crew is ready\nMe turn the fire rock the punks steady\nWhen they shoot and stop car look like confetti\nWent my ass home jump back in the bed G\n[Big Rich]\nF**k why they wanna f**k with us\nWhen they know my posse is crazy and they down to bust\nBig Rich take no sh*t from these busta ass tricks\nCheck your punk ass nigga like check a b**ch\n[Ice-T]\nI got no love for no nigga flippin, trippin on my fam\nGot damn, I make L.A. hot as Vietnam\nBut ill niggas should be left alone\nPlease excuse me, while I rest my dome!\n[Method Man: Word up, our niggas is strapped, ready for war!] [8x]\nThey want me back in\nNiggas want me back in\nThey want me back in\nWhy......niggas want me back in?", "image": "https://images.genius.com/86b9e63b9a38d5cc3e34cf27569b4d81.300x300x1.jpg"}], "artist": "Ice-T"}