{"songs": [{"title": "Need Some Bad", "album": null, "year": "2011-12-01", "lyrics": "Yeah\nPremier and Slick Rick kid\nJonah Hill\nYeah kid, check it out\n\n[Hook]\nGood gosh the world's so bad\nIt's trying to drive me, a sane man, mad\nGreat gosh I needs some bad\n'bout to drive me, a sane man, mad\n(Kick it Rick)\n\n[Slick Rick]\nAre you peeping this floosie\nOr queens, eh excuse me\nCan't believe how many times I had to eat the chick's sushi\nWho she?\nLook at how a brother gotta roll\nAll cold, kid\nAnyway truth being told\nFit boy too, big\nWhich one you pick\nRico suave or chick one, two kid\nOnce I was born in this thick\nWhy I gotta deal with this horniness tip\nThis, not enough flair\nThis, lack lot wares\nGot her holding my tears, trying to act like who cares\n\nReaching, if I say I see kids in the mix\nWanna cuddle, go out something, trick with the chick\n\nMotivate through it though I know it ain't true\nWhy argue, tell a chick \"You're okay too\"\nDelilah\nThough I flirt too beside her\nEasy to play dumb while your IQ is higher\nWhy ya, you treat me like a sucker\nI don't know should I keep maneuvering Tanaka?\nTo what, something sexual, puppy\nAnything to get into this shallow chick's body\n\n(Know what I'm saying kid)\nCause it bad, trying to drive me a sane man mad\n(Say what my kid)\nI needs some bad about to drive me a sane man mad\n(Bring it on kid)\nGood Gosh the world so bad, trying to drive me, a sane man, mad\n(Bring me home kid)\nGreat Gosh need some bad, about to drive me a sane man...\n\nI want you, munch too, comes to hun, how long do\nMa duke caught the kid masturbating once too\n(no)\nPassed, looked stunned, kept on like\nDon't you have a steady piece to smash yet son?\nWhat to do Mom, none touching dude's joint\nLike to see me out here buying some prostitute's bum?\nNo?\nPicking up scroin, cop pursuing\nFrom the stripper club hairdoing\nThen laughed and none but wise after\nSoulmate, more than sex, a live partner\n\nSnatch can't get, cat frantic\nSo, in the meantime stripper club, lap dance tip\nA professional press box arouser\nSome condoms so I don't mess up me trousers\nThen start paying, mark swaying\nGirlfriend just sit down and start playing\nHere's an extra, parading the wealth\nDon't want a real kid feel like I'm degrading myself\nBouncing on me funny, bouncing with my money\nOr its back to playing cat and mouse games with the honey\n\n(You know what I mean kid)\nCaught a script so bad, trying to drive me, a sane man, mad\n(Say what Slick Rick)\nI need some bad 'bout to drive me, a sane man, mad\n(Premier)\nGood gosh the world so bad trying to drive me, a sane man, mad\n(Jonah Hill kid)\nGood gosh, need some bad, about to drive me a sane man...\n\nI need some bad X 4", "image": "https://images.genius.com/25774c2cdb2e84bbe2e389673e5fe7dd.500x500x1.jpg"}], "artist": "Slick Rick"}