{"songs": [{"title": "Fuck You Mean (Night Vision Ep. 1)", "album": null, "year": "2018-03-26", "lyrics": "[Intro]\n(Pluto)\nGot these diamonds on my teeth, yeah\nI got diamonds on my teeth, yeah\nI got diamonds on my teeth, yeah\n(If Young Metro don't trust you, I'm gon' shoot you)\nIt's so hard getting sleep, yeah\nWhen you always getting geeked, yeah\nMoon rocks on my feet, yeah\nGot that Draco on the seat, yeah\nYeah\n\n[Verse 1]\nI'm from the bottom, you can get your door knocked\nWe'on't like to talk to cops, even in the road block\nI put in more work, went and bought a drop top\nNew millennium, please don't penny-pinch\nI made all the films, I was born a pimp\nI'm goin' off the M, I've been in the gym\nI've been liftin' money, Metro flippin' money\nPerky, sippin' muddy, I'm supposed to flood it\nI was over-busted, bust it down and flood it\nEverything was dirty, we so star studded\nI got pinky rings, got my ring finger\nGot my fur drippin', got my nigga sippin'\nDiamonds all over me, sauce all over me\nDrip all over me, you can't roll with me\nI got your ho with me, you can't roll with me\nGot your ho with me (Wassup?)\n\n[Chorus]\nLet my bitch try some codeine, she rock new Celine\nMade my dawg a millionaire, what the fuck you mean?\nShe just fucked a millionaire, what the fuck you mean?\nBussin' bales down in the bath, what the fuck you mean?\nI went crazy in the trap, what the fuck you mean?\nMy lil brother'll rob you now, what the fuck you mean?\nDrinkin' lean and poppin' tabs, what the fuck you mean?\nNumero uno in a lab, what the fuck you mean?\n\n[Verse 2]\nTied bandana round my head, they play with 'Tro they dead\nWe so icy on these meds, they so broke and scared\nRun my money up instead, like I'm on a tread\nPut your dawgy on a shirt, don't even call the meds\nWhen I'm on a Percocet I might try Qualitest\nUsually I be sippin' purple, I'm on pineapple red\nAll my family call me Pluto, don't you never forget\nDon't be fabricated, like I ain't play with the Pyrex\nDrop ten thousand on the ground, it's still in the wrapper\nI'm a boss, I got the crown, I'm still in the trap\nMoonwalkin' with the hammer, plugged in with the scammers\nKill first for Atlanta, serve first in Atlanta\nT-shirts in the Lambo, 35 and you can have 'em\nRob coke, you can't have it, gotta re-rock, little daddy\n\n[Chorus]\nLet my bitch try some codeine, she rock new Celine\nMade my dawg a millionaire, what the fuck you mean?\nShe just fucked a millionaire, what the fuck you mean?\nBussin' bales down in the bath, what the fuck you mean?\nI went crazy in the trap, what the fuck you mean?\nMy lil brother'll rob you now, what the fuck you mean?\nDrinkin' lean and poppin' tabs, what the fuck you mean?\nNumero uno in a lab, what the fuck you mean?\n\n[Verse 3]\nThe AP gold with the fish tank face\nOff the record got my young nigga straight\nStraight promethazine, straight Hydrocodone\nPinky ring clean, straight up Billy Jean\nShout-out Screwed Up Clique, my OG's can't forget\nCuban links on my bitch, cuban links on my bitch\nHibernatin' with your bitch, ridin' round with the stick\nSearching 'round for a lick, a half a brick that's a split\nNo Metro ain't gon' switch it, he switchin' yo bitch\nWith another yellow bad bitch, they ain't havin' money like this\nThey ain't havin' cash like this\nYou got a Rollie but it ain't this\nYou got an Audemar, it ain't this\nBuy a foreign car for my bitch\nGot the yacht, I'm with the shits\nGot the trap spot with the bricks\nG taught me how to fry fish\nWhite girl givin' Bill Clint'\nI'm Hank Aaron up to bat\nI'm throwin' slugs for these racks\nThis chopper tour Iraq\nI went up to Jupiter flashing\nI make it look good when I'm attackin'\nMy chain and my rosé a present\nI'm havin' my way with some peasants\nI told my jeweler \"Baguette it\"\n\n[Chorus]\nGot my bitch a lil codeine, she rock new Celine\nMade my dawg a millionaire, what the fuck you mean?\nShe just fucked a millionaire, what the fuck you mean?\nBussin' bales down in the bath, what the fuck you mean?\nI went crazy in the trap, what the fuck you mean?\nMy lil brother'll rob you now, what the fuck you mean?\nDrinkin' lean and poppin' tabs, what the fuck you mean?\nNumero uno in a lab, what the fuck you mean?\n\n[Outro]\nTied bandana round my head, they play with 'Tro they dead\nWe so icy on these meds, they so broke and scared\n(If Young Metro don't trust you, I'm gon shoot you)", "image": "https://images.genius.com/72234ce576071e25ff4707e2f1f3fbd3.1000x1000x1.jpg"}], "artist": "Future"}