{"songs": [{"title": "Wizard Of Oz", "album": "Bobby Tarantino II", "year": "2018-03-09", "lyrics": "[Chorus]\nBitch, I've been runnin' my city like I am the Wizard of Oz\nI don't do this shit for nothin' but the family and the squad\nMoney ain't everything, tell me now, what's that money to a god?\nIf they tell you money make you better than others, then somebody lied\nBitch, I've been runnin' my city like I am the Wizard of Oz (yeah, I am)\nI don't do this shit for nothin' but the family and the squad (squad)\nMoney ain't everything, tell me now, what's that money to a god? (to a god)\nIf they tell you money make you better than others, then somebody lied (somebody lied)\n\n[Verse]\nI just paid ten million in taxes\nFinger-fuck all of them bastards way back in my GED classes\nI don't mean to stunt on they asses, but I'm finna stunt on they asses\nYeah, I'm finna stunt on they asses\nFast forward, I rap for the masses, from Maryland to Calabasas\nIt's on, all this other shit that's on my mind now\nMy girl said she wanna let me find out\nI'm way too diverse to stay in one lane\nIncrease the autotune so y'all could feel the pain (yeah, yeah!)\nPour that drink up and might have to catch a vibe (catch a vibe!)\nI am way too turnt right now, don't need to drive (woo!)\nI might fuck around and say some real shit (yeah!)\nLike people tend to do when they get real, real lit, yeah (woo!)\nI've been sippin' on that liquid courage (ooh, ooh, yeah!)\nThe beat is tellin' me, \"Don't be discouraged\"\nI think I'm the best rapper alive\n'Cause they tell me I'm the best rapper alive\n\n[Chorus]\nBitch, I've been runnin' my city like I am the Wizard of Oz\nI don't do this shit for nothin' but the family and the squad\nMoney ain't everything, tell me now, what's that money to a god?\nIf they tell you money make you better than others, then somebody lied\nBitch, I've been runnin' my city like I am the Wizard of Oz (yeah, I am)\nI don't do this shit for nothin' but the family and the squad (squad)\nMoney ain't everything, tell me now, what's that money to a god? (to a god)\nIf they tell you money make you better than others, then somebody lied (somebody lied)", "image": "https://images.genius.com/2d421963ae73ffc51d48c6f69cb23ef1.1000x1000x1.jpg"}], "artist": "Logic"}