{"songs": [{"title": "We Deep", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Intro: Trick Trick]\nNephew, these lil' faggot pussy-ass bitch-ass niggas\nThink they wanna do somethin with us?\nWhat they wanna do with the D?\n\n[Chorus: Royce Da 5'9\"]\nAll you gotta do is say my name\nI make the gun sing (sing) like (ooooh)\nYou don't want it, I'll have you niggas bleedin\nLayin' down hurtin' on the corner like (owwww)\nClose yo' mouth, before yo' mouth (ooooooooh)\nGets you into somethin' with them Detroit niggas\nWe deep!\n\n[Verse 1: Royce Da 5'9\"]\nC'mon with that, the throne's intact\nWe the reason niggas gotta buy they own shit back\nThirty niggas spit black in this bitch strapped\nFoul-mouth niggas get a clip, full of tic-tacs (woooo!)\nMr. Porter's sick track, Trick Trick back\nThis that, riff-raff, tell your bitch lick that\nAlcoholic ass clique, this a big frat\nCross the line when we steppin it's gon' be click-clack\nNiggas fakin, they throwin them hissy fits\nThey make us start but they ain't makin out like ya boy and his kissy bitch\n'Til they get taken out like your boy do his prissy bitch\nMy high price laywer's still hood like a Dickie fit\nMy words like a fo'-fo' on page\nHold on, you gon' collapse like JoJo on stage\nIf you, ever fuck around with me I'll lift you\nIt's however you want it long as I ain't gotta ride wit'chu!\n\n[Chorus: Royce Da 5'9\"]\nAll you gotta do is say my name\nI make the gun sing (sing) like (ooooh)\nYou don't want it, I'll have you niggas bleedin\nLayin down hurtin on the corner like (owwww)\nClose yo' mouth, before yo' mouth (ooooooooh)\nGets you into somethin with them Detroit niggas\nWe deep!\n\n[Verse 2: Trick Trick]\nOkay, Trick\nThe godfather and the king of the D\nLeavin these niggas slept butt-ass naked like they was sleepin with me\nYou lil' bad mouth faggot-ass lil' boys\nI was bustin seven-six-two's, when you was playin with toys\n{\"Transformers!\"} Hahaha, G.I. Joe\nMotherfucker you like playin games, well see I don't\nI like, givin the order for distributin the satchel\nDenyin allegations that I was the one that got you\nFuck em'! Kill 'em all and let the Lord sort 'em out\nDuct tape, covered with lines and board up the house\nGo on nigga run yo' mouth, and go out of place\nBut hide yo' momma, brothers and sisters cause nobody's safe\nI paid mine a long time ago, you ain't seen dues\nI got a family that'll knock these bitches out of they shoes\nSo listen to a professional, we'll get the best of you\nAnd run a gas truck through the center of yo' position, nigga!\n\n[Chorus: Royce Da 5'9\"]\nAll you gotta do is say my name\nI make the gun sing (sing) like (ooooh)\nYou don't want it, I'll have you niggas bleedin\nLayin down hurtin on the corner like (owwww)\nClose yo' mouth, before yo' mouth (ooooooooh)\nGets you into somethin with them Detroit niggas\nWe deep!\n\n[Verse 3: Royce Da 5'9\"]\nShow me some respect, or get your shit checked\nYou act dry then you probably gon' get your shit wet\nI ain't tryin to be Big, give me a big check\nThen spit tecs, split up the team like DipSet\n\n[Verse 4: Trick Trick]\nOkay, see these niggas rollin deep in a truck\nGot the world sayin Detroit niggas skeetchy as fuck!\nTakin niggas shit for nothin, but if you say somethin\nFully automatic double clips I'll be dumpin\n\n[Verse 5: Royce Da 5'9\"]\nDumpin, boy we hot, look at the dough we got\nBroke, no we not; he spoke then you know he's shot\nSlug him with forty shots, the proof is my porty pot\nMy crew startin shit like your boy 40 Glocc\n\n[Verse 6: Trick Trick]\nYou niggas worry about me you better worry about sweets\nGoon Squad, M.I.C., controllin the streets\nFuck with niggas that take bread for heads, cocaine slangers\nFuck you lil' sissy-ass MySpace gangbangers (hohh!)\n\n[Chorus: Royce Da 5'9\"]\nAll you gotta do is say my name\nI make the gun sing (sing) like (ooooh)\nYou don't want it, I'll have you niggas bleedin\nLayin down hurtin on the corner like (owwww)\nClose yo' mouth, before yo' mouth (ooooooooh)\nGets you into somethin with them Detroit niggas\nWe deep!\n\n[Outro: Royce Da 5'9\"]\nGeah, Goon Squad Crip ass\nMotherfuckin M.I.C. gang ass\nStreet Lord Mafia ass niggas\nY'all niggas come here you better call somebody\nTrick, me, Juan\nCall one of the bosses", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}