{"songs": [{"title": "You Don’t Know", "album": "Eminem Presents: The Re-Up", "year": "2006-11-07", "lyrics": "[Intro: Tony Yayo & 50 Cent]\nShady!\nYeah\n\n[Chorus: 50 Cent]\nWho run it? You know, you actin' like you don't know\nWe run it, yeah, you know, but you actin' like you don't know\nWho run it? You know, you actin' like you don't know\nWe run it, yeah, you know but you actin' like you don't know\nYou know, you actin' like you don't know\nI tear the club up fo' sho'\nThis flow is gon' bring mo' dough\nYeah, you know, but you actin' like you don't know\n\n[Verse 1: 50 Cent]\nNow, homie, I say I run it, run it 'cause I'm in control\nHpnotiq, Hennessy, a couple shots of Patrón\nI have you feelin' a'ight, I get you high as a kite\nParty poppin', shawty says she comin' with me tonight\nI ain't shoulder leanin', I ain't snappin' and poppin'\nEither I'm bobbin' my head or I'm just standin' there watchin'\nI'm a hustler, I hustle; you can tell that I'm paid\nAnd I protect what I got, I'm in the house with my blade\nNigga, you front, you gon' get it, okay, now maybe I've said it\n'Cause I want you to tridip, yeah, I be on that shidit\nYou should see when I'm stuntin', I flash the stones to be wantin'\nPush the whip, see me rollin', you can tell that I'm holdin'\nI'm just doin' my thang, you know the Unit's the gang\nI got my grimy Shady with me, you front, you'll have to get me\nOff yo' ass, I pay the lawsuit and laugh\nHaha! It's not a big deal, it's nothin' but some cash\nLet's go!\n\n[Chorus: 50 Cent]\nWho run it? You know, you actin' like you don't know\nI tear the club up fo' sho'\nThis flow is gon' bring mo' dough\nYeah, you know, but you actin' like you don't know\nWho run it? You know, you actin' like you don't know\nI tear the club up fo' sho'\nThis flow is gon' bring mo' dough\nYeah, you know, but you actin' like you don't know\n\n[Verse 2: Eminem]\nWhen me and Fif' got together to do this music\nThe more we became enveloped\nWe just developed a fellowship through it\nIt's no pretend shit, it's friendship, mi nemesis es su nemesis\nSame for him, it's just media, see to them it's just images\nBut this shit is no gimmicks, this is blood in and blood out\nWhen it's beef you just gotta know when to butt in and butt out\nIf there's a problem we solve it, if we don't resolve it\nIt usually just evolves into one big brawl\nAnd we all get involved in it\nAnd we should all get a merit, this much beef we inherit\nAnd wear it like a badge with honor, pass it around and share it\nAnd let it go to whoever's holdin'\nThe most current beef on their shoulders\nAnd their soldiers got their backs 'til it's over\nBut tonight we ain't come in here to beef with nobody\nWe came to party: Banks, Ca$his, and Mr. Ferrari\nSo it's Shady, Aftermizath, back in that ass, you izzask?\nCome izzon, what kinda fizzuckin' quizzestion is that?\n\n[Chorus: 50 Cent & Eminem]\nWho run it? You know, you actin' like you don't know\nI tear the club up fo' sho'\nThis flow is gon' bring mo' dough\nYeah, you know, but you actin' like you don't know\nWho run it? I said, you know but you actin' like you don't know\nI tear the club up fo' sho'\nThis flow is gon' bring mo' dough\nYeah, you know, but you actin' like you don't know\n\n[Verse 3: Ca$his]\nPistol play, ricochet, see where the victim lay\nSlumped over bleedin'; J.F.K\nHK 'til your chest plate cave\nI'ma ride to the death, do you rep that way?\nForever I'ma be a Shady 7-4 gangsta\nPussy, I'll survive everything you got in that chamber\nI thrive off of danger, jumpin' in all beef\nYou keep talkin' shit, now the squad have called me\n\n[Verse 4: Lloyd Banks]\nEnough holdin' back the steam, Em let off a magazine\nDappadon Cappa Queens, mixed in with Ca$his creams\nStarted off with half a dream, developed into what you see\nTellin' ain't my cup of tea, can't tell I'm a fuckin' G?\nI'm on automatic when I'm at it, start static\nAnd you splattered, shit shattered, I'm a walkin' bitch magnet\nSpit it how I live it, live it all-way to the limit\nAnd I'm always on my pivot for my digits, you dig it?\nSee…\n\n[Chorus: 50 Cent]\nWho run it? You know, you actin' like you don't know\nWe run it, yeah, you know, but you actin' like you don't know\nWho run it? You know, you actin' like you don't know\nWe run it, yeah, you know but you actin' like you don't know\nYou know, you actin' like you don't know\nI tear the club up fo' sho'\nThis flow is gon' bring mo' dough\nYeah, you know, but you actin' like you don't know\n\n[Outro: Tony Yayo]\nYou know who this is\nShady, G-Unit, Aftermath\nLloyd Banks, Ca$his, Marshall Mathers, Ferrari F-50\nIt's a movement, you can't stop it\nTalk of New York, Tony Yayo", "image": "https://images.rapgenius.com/a9060cbcd74c6a9fc3c4351cd341e771.600x524x1.jpg"}], "artist": "Eminem"}