{"songs": [{"title": "Wu Banga 101", "album": "Supreme Clientele", "year": "2000-02-08", "lyrics": "[Verse 1: GZA]\nYo, too advanced, Digi' stance, made the CD enhanced\nI move with the speed and strength of ants\nIdentical in form with the Bees they swarm\nHold up, the cold current appear warm\nMy first verbal brawl, started on some yes yes y'all\nTo the beat y'all, break your windshield, your jeep stall\nMr. Traffic, dumbin' shit, from ecclesiastic\nCashier, holdin' out, fine, cut off the plastic\nSee the logo? A monument in Hip Hop\nCarved out, in the giant landscape, of broken rocks\nWhether heard in herb spots, jukebox or malt shops\nUncut live, drop eighty-five, in one shot\nSpotlight hits the metal mic, majority stare\nHeard the Wu snare, while my iris cut down the glare\nWalk a road the great length you find too long to measure\nMy Clan'll make me rhyme like D. Banner under pressure\nNo surprise, double disc touched five\nThose elements, kept environments colonized\nWith the high flyin' depth-defyin' flow like the Rebel\nRight there, but you're one light year, from my level\n\n[Verse 2: Ghostface Killah]\nUh-huh.. yeah.. yo.. check it.. yo..\nBottles goin' off in the church, we broke the wine\nSlapped the pastor, didn't know Pop had asthma\nHe pulled out his blue bible, change fell out his coat\nThree condoms, two dice, one bag of dope\nOooh! Rev. ain't right, his church ain't right\nDeacon is a pimp, tell by his ice\nMrs. Parks said, \"Brother Starks, meet you at the numbers spot\nHeard you got red tops out, and I want a lot\"\nShirley fainted dead on the spot\nTwo ushers slipped eighty dollars right out the pot\nOh shit!\n\n[Verse 3: Raekwon]\nEgyptian, brown skin brown suede Timbs\nMasqueradin' X-rated throw blades, all occasions\nRound nozzle touchdown, Haagen-Dazs goggles White House\nGucci flag on the roof, call us rock groups\nMere intelligent, buy Neiman Marcus out\nNo doubt, all we saw he bought, Lori mom's all blow\nWas simple, blamp instrumentals run camps the stamps get you\nThe way we lamp, fans come and get you\nPlay, fullback strapped like a fuck, war at\nThe black, Carlo Gambino's stash house in Hackensack\nPack capsules, Green Bay 'em lay 'em down like wax do\nIt's all actual we build, like Crash Crew\nCoconut, incense, one sentence, aiyyo\nControl the holy flinch hit this, new whips\nRoman numerals, sun splash them niggas like, Tango and Cash\nAlcatraz cats roll out fast..\n\n[Verse 4: Cappadonna]\nWu thousand nuthin' but hardcore\nWe tryin to get land riches and more\nGhost put me on to it\nWe just do it, floss or whatever\nTake care of the business, there's too many roughnecks\nGive two of these to Flex, tell him it's real rap like Ghost\nHad to beat niggas with toast\n'Cause we got clientele, we lay it down flat\nPulled out on y'all kid, now where your mans at?\nFakin' the real like, \"Damn I can't stand Cappa'\"\nThen my wardrobe flooded the next chapter\nY'all heard about us like we heard about you\nBless the mic with reality, hit you with the virtue\nCalm down not tryin' to hurt you, burst through\nFat shit, fatter than all y'all nigga’s outfits\nWe the glitch like Y2K\nCatch the ball when it drop, guns pop, y'all have a nice day\n\n\"Doctor Kanabuta, Iron Man, he is invincible\nHis remarkable armor is supreme!\"\n\n[Verse 5: Masta Killa]\nYo, sometimes I'm liable to spaz and break fool\nGrab my gun, select one, snatch son\nPut the barrel by his face, blast one by his eardrum\nPiss run, you drop thinkin' you're shot\nScreamin' like a bitch, kicks to your face\nShots to the body that shake like the bass\nI'm Ghostfaced up, military style down\nNuff ammunitions of rounds across the chest\n\n[Verse  6: Ghostface Killah]\nSkip to the intro, rap through post\nSmashed a fresh ball of wax Caesar\nFlashy penthouse that overlooks the vista\nWally Moc' half tied, swimmin' trunks\nThree chunks of ice sit in Johnny Walker for advice\nCatch the moment, fundraiser at will, work with the homeless\nPolish diamond edge, Flintstone shit, sealed in a comb pick\nCarefully, swing the B seven series Christmas lights\nToo bright, Ghost is comin' y'all fix the mirrors\nRelax like pudding, confidence strangle my man couldn't\nExile he no longer in the hood\nBless the kid that max the most\nMe I turn a wedding into hoax\nRoses tied to bombs on posts\nOn commercial breaks, piss in the apple juice\nRasta nigga rock the big do's\nJiffy Pop it's only chant Wu", "image": "https://images.genius.com/f0013dbd91dff7fd77352a0283ad6ec5.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}