{"songs": [{"title": "Happy Timbuck2 Day", "album": "DROGAS WAVE", "year": "2018-09-21", "lyrics": "[Intro: Timbuck2]\nMe and Lupe Fiasco, Hollywood, California\nPalm trees, Hollywood lights, enjoy the show\nBefore we take it down\nI need everybody in the building tonight right now\nFrom front to back, left to right, to put both hands in the sky\nRight now before we get to the next song\nWe got any hip-hop fans out there?\nWhere y'all at? Make some noise\nY’all ready for Lupe Fiasco?\nLet me hear you make some fuckin' noise\n\n[Refrain]\nSay insane, insane in the brain\nIn the brain, I bring the pain\nYeah, I came, that's why I came\nIn the game to do my thang, so whatchu think?\nWrite my story on the wall, on the wall\nOn the wall, ah-all, in Hall of Fames\nGot a day in the city, ooohh\nNot too gangster to be dancin’ in the video\nSay insane, insane in the brain\nIn the brain, I bring the pain\nYeah, I came, that's why I came\nIn the game to do my thang, so whatchu think?\n\n[Verse 1]\nSee when loves comes from the center, I'm Mutombo to my members\nI heard you heard that I was fly so I'm Dumbo to my listeners\nGimmie them inches I make miles out them bitches, brew\nListen, you couldn't do a mountain trial while on my intertubes\nTour de Force, tied so I am not the daddy\nHad to move the club all by myself 'cause I ain't had no caddy\nGladly, didn't always have that cake but I always had a patty\nOr at least a home girl like Aesha from Cincinnati\nWord to Ken and Kathy, who says that we can’t be happy?\nSadly that it ain’t no joke on that block, like Laffy Taffy\nTried to trap me, dug out like a nappy snappy, even Lassie\nAttacked me, tag me for grapplin' so I can get back to wrasslin’\nFor the love because the foundation is my heart, that's my start\nPlay my part, make communications with my art\nGive my DJ the Serato, got that chico from my vatos\nDown in Chicos in El Paso, Tapatío on my tacos\n\n[Chorus]\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (why?) Cause they ain't kickin' it right\n\n[Verse 2]\nYeah, uhh\nDoin’ them capers for the paper like I'm Superman\nPast, wanna put it all behind me like a movin' van\nFuture, want it cuter than Karrueche Tran, Hula dance\nNot like Yokozuna in booty pants, on Hoover, I do the Dam\nOr at least I'm tryin', in the hopes that I see some diamonds\nOn a boat and a piece of mind and on a coast with a decent climate\nWhere dopes wanna seek refinement\nAnd the pros wanna keep it client\nAnd the cults wanna see my rhymin'\nFor the dose of the secret science (yeah)\nWade through the maze on the way\nTo the stage at the pace of \"Amazing Grace\" (okay)\nAnd a raisin raised in the rays of the Sun\nWouldn't fade in the shade of the day (okay)\nWill you lay in a cage with a snake\nGettin' flailed on the back and it nailed to the palm?\nNot the nails from salons but the nails that attack\nAnd a rusty razor blade to the face\nTo clear your sins? Nah\nThey don't want that fate, no\nThey won't take that place, yeah\nGotta get mine from the love from below and above in the mud\nAnd the mind of a kind that recline, and relaxed\nBut design all the time like floods\nIf you see me from the high road, more Tzatziki on my Gyro\n\n[Chorus]\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (why?) Cause they ain't kickin' it right\n\n[Refrain]\nSay insane, insane in the brain\nIn the brain, I bring the pain\nYeah, I came, that's why I came\nIn the game to do my thang, so whatchu think?\nWrite my story on the wall, on the wall\nOn the wall, ah-all, in Hall of Fames\nGot a day in the city, ooohh\nNot too gangster to be dancin' in the video\n\n[Verse 3]\nYeah, uh, uh\nHappy Timbuck2 Day, in the groove you got that Lupe\nAnd I'm smooth as Michael Bublé eatin' creme brulee and Kool-Aid\nYou can scroll down just like Jubei\nMy whole timeline got that sousei\nHard and soft when I lay it down, gotta Wu-Tang logo on my duvet\nThat's ying-yang, that's Baby Boy and Ving Rhames\nThat's the best of both worlds like God caused the Big Bang\n(Mind blown) Now this might drive you insane\nKeep blacks all around that waste, but don't wanna make us senseis\nThat's senseless, send slaves, man's like, \"I don't wanna work, send slaves\nOn ships, on waves, in waves\", okay\nColder than a goalay, golder than my Rolay\nTold her hope and hold her 'lobe just like Evander Holay\nThat's cleaner than a solar panel, power panoramic camera\nTanner family photo album, used to smuggle cocaine\nNow they don't want that beef, let that child talk like a king\nLet that cow walk in the street, extra mild sauce on my wings\n\n[Chorus]\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (whatchu want?) Gimme the mic (whatchu want?)\nGimme the mic (why?) Cause they ain't kickin' it right\n\n[Refrain]\nSay insane, insane in the brain\nIn the brain, I bring the pain\nYeah, I came, that's why I came\nIn the game to do my thang, so whatchu think?\nWrite my story on the wall, on the wall\nOn the wall, ah-all, in Hall of Fames\nGot a day in the city, ooohh\nNot too gangster to be dancin' in the video\n\n[Outro: Timbuck2 & Lupe Fiasco]\nWe got any hip-hop fans out there?\nWhere y'all at? Make some noise\nGot a day in the city, ooohh\nNot too gangster to be dancin' in the video\nTimbuck2, basically just a kid from Chicago that loves DJ'ing", "image": "https://images.genius.com/86aa1a0cb9e9a473ce83eb531fa78079.500x500x1.jpg"}], "artist": "Lupe Fiasco"}