{"songs": [{"title": "Like They Used to Say", "album": "Beats for Insomniacs", "year": null, "lyrics": "\"Like they used to say\" *repeated in background*\n\n[Common]\nWe dealin wit some very critical and crucial times\nSome of the most critical and crucial times I've ever seen\nI was on Stoney Island with my guy\nHe was tryin to tell me about the S-I-E experience\nTried to tell him about the C-S-E experience, you know?\n\nYo I'm the rap profession, I go the session\nStudy MC's like a god do lessons\nMic testin in the rain, I brainstorm\nYou feelin me out nigga? We got the same form\nI drop heavy in spots you scared to put your weight\nThere's only so much ice you can skate on\nShit cats write for you, you say wrong\nNo time to debate on, who's your pop and who's not\nOr who shot Big and 2Pac\nOr who this stud fuckin or how much this crew got\nThat's ho shit\nThat ain't me or the type of niggas I roll wit\nI Cold Get Dumb, like a brother in prison\nWho hasn't had a chance to hold his son\nSacrificin like Abe did his oldest son\nTryin to hold my come, I think of raps\nSeen the BDP cover and I start thinkin back to\n\n* \"Silly Hoes\" sample* say what? \"Like they used to say\"\n\"Kool G Rap and Polo, back again\" [Kool G Rap]\nYeah \"Like they used to say\"\n* \"Ain't No Half-Steppin\" sample* yeah \"Like they used to say\"\n(Dig it, like they used to say) *Biz Markie sample* \"Like they used to say\"\n\n[Common]\nI walk through triple darkness wit a childproof lighter\nAll your homeboys are biters, so what's up wit that?\nYour producer pumped the track\nTold him, \"Naw, I can't fuck wit that\"\nNice way of sayin \"Big, bring a rougher track\"\nMy boy in my ear said \"Enough of that humble rap\"\nNow every single you drop I'mma double that\nJigga-jigga Joe cut the record down to\nMy sound surround you like racism, you feel it all around you\nI go into a soundproof booth and change flows\nTrack the strange hoes wit headwraps and Bangles\nHip-hop is gettin strangled by this Puff Combs syndrome\nNiggas Been Around The World actin like they never been home\nI ain't hatin cuz I can only love niggas\nIt's just outta the game, I wanna sub niggas\nI be dub figure rusty to adjust the in-dustry\nAnd speak up, like when my homey's musty\nHere we go yeah * \"Roxanne Roxanne\" sample* yeah, dig it\n\"Like they used to say\"\n\"You don't want it\" [T-La Rock] \"Like they used to say\"\n\"F-R-E-S-H\" [Fresh 3 MC's] \"Like they used to say\"\n\"My Adidas, walk through concrete doors and broke\" [Run-DMC]\n\"Like they used to say\"\n\n[Common]\nYo *repeating \"zen zen zen zen\" for about 20 sec.*\n\"Like they used to say\" 3x\n\nYo yo check it\nAppreciate the art that came through Puerto Ricans and Blacks\nSpeakin the facts, the sound is much deeper than wax\nDug Inf, the Lumberjack I'm keepin the axe\nLayin on passed out nights wakin up reekin wit raps\nGeek like the Fat Boys ?produce the feeb? in fat\nIn shows I get more hoes/holes than a seam in the matt\nRaps develop like film (so what?) so call me Instant Common\nThis business of pimps and hoes, I stick out like Bishop Juan\nTalk to my nigga Ron about openin shops\nHoldin up cops, I'm from the 'Go, it don't stop\nContract ain't show enough options, it's time to pop guns\nIt's gon' be some Shook, Lost and popped Ones\nAskin How Come like Wyclef, they'll be Gone before November (yeah)\nName'll be in sentences wit the word \"remember\"\nWrote a letter to '88, let's get back, love me tender\nThe letter came back three days later, return to sender\nDamn!\n\n\"Like they used to say\"\n\"Hot damn ho here we go again\" [MC Lyte] \"Like they used to say\"\n\"I want it like that, I got it like that, I have it like that\" [Kool Keith]\n\"Like they used to say\"\n\"You gots to chill\" [PMD] \"Like they used to say\"\n\"Boyz in the hood are always hard\" [Eazy E] \"Like they used to say\"\n\"One for all and all\" [Brand Nubian] \"Like they used to say\"\n\"Zoom zoom zoom, zoom zoom zoom zoo zoom\" [MC E-Z]\n\"Like they used to say\"\n\"I get money, money I got\" [Milk-D] \"Like they used to say\"\n\"Plug one, plug two\" [De La Soul] \"Like they used to say\"\n\"For all the pioneers, I'm goin way back\" [Just-Ice] \"Like they used to say\"\n\"I think that's about as far back as we can go\" [Just-Ice]\n\"Like they used to say\" 3x\n\"Yo what happened to the beats\" [Eric B.]\n\"Like they used to say\"\nPEACE!!! \"Like they used to say\" \"Like they used to say\"", "image": "https://images.genius.com/389a5f204ebb87e2a72b5655ddc0a0bf.789x789x1.jpg"}], "artist": "Common"}