{"songs": [{"title": "Roll My Shit", "album": "California Republic", "year": "2012-04-05", "lyrics": "[Hook: Snoop Dogg]\nNigga I tell the bitch quit\nSit down, shut up and floss my shit\nMy music gone, all that talkin' ain't it\nSo sit down, shut up and roll my shit\nNow smoke with me, hook up my funk with me\nNow take this money and hold this up for me\nNow let it soak for me\nNow bitch is you ready?\nI gots to get it, I got, gots to get it\n\n[Verse 1: The Game]\nWhen I wake up in the morning sometimes I feel like goin' back to sleep\nBut I gotta keep this product on the street\nTryna take over my turf\nStretch me out in a hearse cause that is what it's worth\nBaby momma keeps sweatin' it nigga, cause the rent's due\nTon son's, daughter on the way, I think I'm Fixed too\nGet out on the streets stack the money like bill Gates\nAnd do whatever it takes to keep my family straight\nLivin' in Compton, some say it's suicide\nCrossin' the street and catch a bullet from a drive by\nMy homie Dan's got it sippin' on a séance\nSo many dead homies\nWhen I hear about it I can't cry\nI lost my grandmother, that's when I flipped\nOnly decision to make now, blood or a crip\nDrove across the tracks, opened up the door on my Lac\nPut the dope in the front, hop in the back\nIt was like that\n\n[Hook: Snoop Dogg]\nNigga I tell the bitch quit\nSit down, shut up and floss my shit\nMy musics on, all that talkin' ain't it\nSo sit down, shut up and roll my shit\nNow smoke with me, hook up my funk with me\nNow take this money and hold this up for me\nNow let it soak for me\nNow bitch is you ready?\nI gots to get it, I got, gots to get it\n\n[Verse 2: The Game]\nThrow on some clothes, grab the 4 and hit the back door\nHop the back gate and meet the fiends by the liquor store\nCops drop by, lookin' at us like we stole somethin'\nThey hit the brakes, that's when everybody starts runnin'\n8 ball in my sock, sprintin down the block\nCut through the projects and that's when I threw the Glock\nGod damn it felt good to be home free\nThe city don't sleep, right next to Long Beach\nHard to survive in this motherfuckin' jungle\nRunnin' with the wrong niggas, that will take you under\nThat's what happened to my nigga Big Wheel\nTrusted the wrong bitch, that's what got his ass killed\nA blunt and some Hennessey, a lot of good memories\nHow do you survive when everybody's your enemy?\nBefore you brush your teeth grab your strap\nCause niggas will pull the jack and bitches will peel you cap\nBelieve that\n\n[Hook: Snoop Dogg]\nNigga I tell the bitch quit\nSit down, shut up and floss my shit\nMy music gone, all that talkin' ain't it\nSo sit down, shut up and roll my shit\nNow smoke with me, hook up my funk with me\nNow take this money and hold this up for me\nNow let it soak for me\nNow bitch is you ready?\nI gots to get it, I got, gots to get it\n\n[Verse 3: The Game]\nAin't nothin' better than a down ass bitch\nWhen you're locked up in the pen and she sellin' you neck and flicks\nOn the tear, reminiscin' like a mother\nTwo strikes on the case file, locked up state\nNow tell me how the fuck I'm supposed to be a father to my kids?\nSon gang bangin' cause his daddy doin' nine years\nAnd that happens in every hood in America\nShoot your own brother up and wonder why they scared of ya\nAnd your momma at home without a back bone\nYour girl gettin' tired of waitin' so she get her back blown\nBy your homie, that used to be your man\nAnd you can't do shit cause you're sittin' in the can\nAnd when you get out, you'll probly go and kill this nig\nOn the third strike, man the jury 'bout to kill this nigga\nThat's why I don't trust a nigga or a bitch\nCause either way a nigga always ends up caught up in some shit\n\n[Hook: Snoop Dogg]\nNigga I tell the bitch quit\nSit down, shut up and floss my shit\nMy music gone, all that talkin' ain't it\nSo sit down, shut up and roll my shit\nNow smoke with me, hook up my folk with me\nNow take this money and hold this up for me\nNow let it soak for me\nNow bitch is you ready?\nI gots to get it, I got, gots to get it\n\n[Outro: Snoop Dogg]\nYea\nGame recognize game, nephew\nSee, when a bitch with me she know if to talk\nShe gon sit down, shut the fuck up and roll motherfuckin' weed\nTalkin' is not an issue, you understand me?\nBitch, you do as I say\nWhen I tell you to talk, you talk and I ain't told you to talk so shut the fuck up\nYou hear me?\nReal pimp shit nigga\nWest Coast\nWe stay keepin' our hoes in check\nHey, that's your own problem man\nBitches takin' your all equip, runnin' you niggas crazy\nGot niggas wanna kill like yourself\nMan, fuck a bitch man\nI grab a bitch, same dizzle and wizzle\nYou understand me?\nI keep bitches like I keep weed\nI got blueberry, AK-47, trainwreck\nWhatever you need, ya dig?\nThat's it", "image": "https://images.genius.com/e6b76fdc2635fdc0e9d62ceb9907eb3c.750x750x1.jpg"}], "artist": "The Game"}