{"songs": [{"title": "Strangers [paranoid] - feat. bun b", "album": null, "year": null, "lyrics": "Becau-cau-cau\nBecau-cau-cau\nBecause I'm paranoid\nBecau-cau-cau\nBecau-cau-cau\nBecause I'm paranoid\nBecau-cau-cau\nBecau-cau-cau\nBecause I'm paranoid\nNo boundaries, no borders\nWe're crossing many waters\nThem haters can't ignore us\nThe government record us\nThey used to take our sons\nAnd think it's fun to rape our daughters\nNo, our health care system pitiful\nThat's how hospitals profitable\nThey try to put the drugs inside of you\nLie to you, say that you gonna die tomorrow\nSo why pay? That's not logical\nSee the bullshit that they try to pull\nThey tapping laptops like a bad plot out of a bad movie\nObama say it ain't so, in a perfect world correlation\nOf the willing is coalition of the rainbow\nWho the enemy? Who the friend in need?\nHow do you choose your target\nWho you aim for, what you aim for?\nDamn, still running with the race\nBut I'm running out of pace\nSo fast just the last guy to let it go\nWondering if my concentration on the race misplaced\nTake your marks, set, ready, go\nEvolutionary flow, ever-luminary glow\nWhen they show but the revolution never know\nShot to make you famous, we in your face with bangers\nAbout to face some danger, I just misplace my anger\nViolence entertainers, rappers took the place of Segas\nPapa said, \"Don't talk to strangers, don't talk to strangers\"\nGotta let the people know from the get go\nBun B is a product of the ghetto\nGood or bad man I just can't let go\nNo I ain't a rich man but it's been set though\nAnd I'm still on the grind trying to get dough\nWhy the government wanna keep me in debt for?\nThey wanna keep me in debt for?\nLook at AIG and the bailouts\nStepping on the fish just so you can help the whale out\nGot his ass out or should I say tail out\nNeed another job like a paper or a mail route\nWe the fresh, best in take the stale out\nMake it rain, they see it I'm a put a pail out\nMan, I'm a put a pail out know, what I'm saying?\n'Cause I'm stuck in the mud like a tractor\nI ain't gotta lie plus I'm not a good actor\nBullshit laws that they enact to keep us\nLocked out the big game in the back bru\nI got sacked, now I gotta get a sack to\nMake ends meet cause the money is a factor\nOh yeah, the money is a factor\nDamn, now I'm back on the block for the hustle\nUsed to be hot, now your boy just cold\nGotta build my bread up and my muscle\nHaters talk down, sometimes it's a tussle\nBut the smoke gonna clear and the dust don't settle\nNow it's like def jam wit no Russell\nLike def jam wit no Russell, we'll be alright though\nShot to make you famous, we in your face with bangers\nAbout to face some danger, I just misplace my anger\nViolence entertainers, rappers took the place of Segas\nPapa said, \"Don't talk to strangers, don't talk to strangers\"", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}