{"songs": [{"title": "Boblo Boat", "album": "Book of Ryan", "year": "2018-03-23", "lyrics": "[Intro: Sample + Cedric The Entertainer]\n\"Cruising down the river; dancing till your feet got numb; cool summer breezes blowing through your hair as you stood gazing down the river in anticipation of the thrill of the dizzying rides at the amusement park—ah, memories of Boblo Island.\"\nAll is your world ain’t nothing but a squirrel tryna get a nut. Just jealous of everybody that’s headed out on that Boblo boat. It is the perfect weather and the perfect time to enjoy a few snacks. Aw, man, I wish I was joining you—a little cheese and crackers, a little Cana wine, a little Riunite on ice, some Harvey’s Bristol Cream—but let’s do this, only on Smooth FM. \n\n[Verse 1: Royce Da 5’9″]\nNothing compared to our family trips\nMy uncle shook hands with a manly grip\nAll this hand-me-down-shit; I had had an uncanny fit\nAll the gangstas I had in my family had me anti-bitch\nMy granddaddy mistress caught the business from my granny fist\nThat was back ‘fore I was born\nPop told stories ’bout it that would last for hours-long\nAnd as a family, we was just so happy\nWhen him and mama got along on the Boblo boat\nUh, on our way to that black amusement park\nWood rollercoasters, crack sold on plastic scooter cars\nUh, smoking grass at the vintage food court\nBroken glass, waiting on you on the swimming pool floor\nI came across my identity on the Boblo boat\nThat’s where I lost my virginity, no condom, though\nThat’s when paranoia hit me like when superstition does\nLeft my inhibitions I guess where my supervision was\nParties on the way to the island would be the livest, though\nFirst time big bro hit the bottle was on the Boblo boat\nBut neither one of us knew that we would both\nGrow up and turn to alcoholics, though, the Boblo boat\n\n[Interlude]\nHey, hey, hey, lil’ Craig, come here. Aye, hit this, nigga. Nigga, don’t worry ’bout what the fuck it is, just drink!\n\n[Bridge: J. Cole]\nYeah yeah, yeah\nSome of my better times, I shared with you\nI shared with you, yeah\nShit, all of my better days, I shared with you\nI shared with you, shit\nAnd now I gotta wake up, wake up, wake up, wake up, wake up\nShit, stuck inside a rat race (fuck)\nRat race (fuck, fuck)\nWake up, wake up, wake up, wake up again\nStuck inside this rat race (fuck)\n\n[Verse 2: J. Cole]\nYeah, look\nTwist the cap, lift the bottle back, swig it\nDig it, ten-inch rims on my mama’s Civic\nTen-inch woofers in the trunk, to be specific\nThey bump, rattle the license plate, plus the windows tinted\nDon’t even give a fuck that it’s dented, bitch, I’m the man now\nI’m rolling, driving it slow as if it’s stolen\nPiling up bros like we was clothing on a dresser\nCalling up hoes like we was Jodeci, let’s check her\nDouble D’s like double-deckers, I wanna sex her\nBut these keys don’t come with game on how to finesse her\nFive semesters left until college, I’m under pressure\nI’m not a real nigga ’til I undress her, I gotta ‘press her\nThis was my main concern back when concerns were lesser\nNowadays, I often yearn to press the\nBackspace button or hit return but life is not no word processor\nMost folks would burn the sess to burn the stress of\nMy real-life trauma plus fickle niggas thinking they done heard the best of\nJermaine Lamarr but that’s insane, it couldn’t be further left of\nThe truth is that my new shit slap, you never heard it better\nGive me a sec, I murder sectors, prefer to let ya\nSee it rather than say it, but it spill out, I gotta chill out\nSay “Fuck the world” and never pull out\nWe had no Boblo boat but I could note\nThose times is like a Bible quote\nBC, before cell phones, the first time I would smoke\nI was six years old, but that’s for another chapter\nThat’s for another story, to God be the glory\nI made it out unscathed and now I sunbathe\nWith my son in Tanzanian sunrays thinking ’bout them days\nThinking ’bout them days\n\n[Outro]\nThis is; 808-Ray\nNigga don't worry about what the fuck it is, just drink\n\n[Produced by 808-Ray and Cool & Dre]", "image": "https://images.genius.com/fd49ced3f7eb846d37ae982821d97f1f.600x600x1.jpg"}], "artist": "Royce da 5'9'’"}