{"songs": [{"title": "Get a Job", "album": "Behind Bars", "year": null, "lyrics": "[Slick Rick]\nWell I'm riding round the Benz truck with fake friends\nWord, here they come now, yo Ricky lend me couple lenses\nFor lunch and all of that, I got to listen to this nonsense\nWhat the hell Crumb, don't you have a consciense?\nIll treat the vogue, get the gold, chuck a heat in gear\nDon't understand it til the blood sucker beat it\nI see my doc, I'm said 'yo, doc, how's the health there'\nDon't worry bout these pretzel muthas acting like your welfare\nWord to parasites, tell me, hasn't it ever occured of\nStand on your own two, please, I never heard of\nBy the window in the bathroom, that one did it\nGot a dress like a brother, then both of them will quit it\nPotential is intelligent, and it's me you wanna rock\nHey, half cent hookers trynna act like snobs, get a job...\n\n*DJ scratches*\n\n[Slick Rick]\nYou want a damn hood? No, here she go, I'mma gonna try, here to try it\nRick, my baby needs pampers; so buy 'em\nCome on take me to Pizza Hut, work class cow\nWhat would your man say if he could see your slut ass now\nFor five bucks, cool, window while she drives, barely missed him\nPissed him, dissed him, turn up the system\nYou ought of treat, that's the dinner, I'm hungry, said her daughter\nShe tried to crawl behind home, and heat bread & water\nA rich girl, don't like, I said he's always the best\nYea, whatever, no question, project destined\nYo, what the hell is with you people, are you all incoherent?\nFifty years old, and still you living with your parent?\nNot a break to breathe, yell on the phone\nTake all I own, everything, and leave me the hell alone\nWord up, now shorty rock steals her ride\nFor you half cent hookers trynna act like snobs, now get a job...\n\n*DJ scratches*\n\n[Slick Rick]\nReserve my hotty, it's the not, used to buying pearls\nPlease drive me across the whole entire world\nMy new man still can't work and he ain't too bright in math\nLike it's my fault he couldn't manage money like that\nSurvive with your man, I didn't say grind the strife\nAnd even worse when they never heard of 9 to 5\nAnd you can't be gentle, or they get all sentinental\nI don't work for white people, well work for Oriental\nHer baby's mother, her friend, that's why plenty get killed\nI'm in Peru, kids hurt, and I need twenty mil\nOn man written traps, deaf, dumb, blind too\nI lost my wallet, son, sorry Grams, lost mine too\nLonely on the step, but still I have a cold heart\nSo on the spot, is one horny old fart\nWord thinking he intelligent, it's me you wanna rock\nAnd all you half cent hookers trynna act like snobs, get a job...\n\n*DJ scratches*", "image": "https://images.genius.com/9492e61c778d8d1c0b9cddf2393d4e25.500x500x1.jpg"}], "artist": "Slick Rick"}