{"songs": [{"title": "One", "album": "B.o.B Vs Bobby Ray", "year": null, "lyrics": "[Hook]\n\"One, is the loneliest number that you'll ever do\" [4x]\n\n[B.o.B]\nTell me, who don't wanna be at the top of this?\nThe top of the game, that's obvious\nI'm like Superman in Metropolis\nBut you can't see me through binoculars\nAs I fly high over the populace\nTryin to find where the hell my childhood is\nI cain't even see it with my irises\nThe only thing that I see is the irony\nThink about the past and the life I lived\nAll of the days and the nights I spent\nIn the bottomless pit called poverty\nLocked in a room, don't bother me!\nSo if you plan on stoppin me\nYou need more than your vitamins\nThe rap game ain't a lottery\nGo to school, get a scholarship\nCause you still gotta deal with the politics\nHow you gon' not deal with it?\nThat's like goin up inside of a brothel\nAnd comin out remainin monogamous\nIt just don't make a lot of sense\nSo I just stay positive\nAnd if you ain't where you tryin to get\nThen it's a prison of the mind you in\n\n[Hook]\n\n[Big Kuntry]\nYou know who this is, mayyyyne\nBig Kuntry Kainnng\nOnly one it's only me, who gives a fuck 'bout 2 and 3?\nYou suckers been played out, like them damn Ferrari jeeps\nI see you niggas on the creep but y'all never next to me\nCain't see you rock climbers when I'm on my mountain peak\nWhy peep? Open yo' eyes - you see the cherry Mase' right?\nYou see the streets, rollin with me, cause my notary certified\nYou a hundred deep, but they be respectin me when it's only I\nGreen pie, back it up, tell Matty pass the mic\nKnow what I'm sayin I'm nasty right, my lyrics got me creamin dykes\nI'm by myself when takin flight, and fuckin them girls that keep it tight\nRedbox, is the movement, Tim, where's they (Home Improvement)?\nWhile you rappers keep on tryin, I'm #1 already proven\n\n[Hook]\n\n[Mac Boney]\nWhat is the numero uno?\nI dip and I slide in my two-do'\nDeez niggas be watchin while bitches be jockin\nBut Boney jack keep it so cool doe\nI'm seein 'em checkin my moves out\nBe careful while keepin my tool down\nThey know that I'm reppin that A-Town\nSo why do these fuck niggas play 'round?\nI guess you can hate now - we straight\nWe got cake, we got bread, we got made clown\nWhile you broke niggas stayed down\nI stayed up on my game and my business I'm paid now\nI'm never gon' lay down\nWe (Grand) and we (Royal) y'all niggas just stand down\nFor yo' homey be man down, we done ran down\nTyler bent on his ass now\nI'm the head of my class now\nSo I'm never gon' bet for these boys that stick hands out\nI prefer to keep hands down\nSo I know who you are when I'm throwin my fans out\nWhy swing on my Denzel?\nI've been ridin and swervin these niggas since oh-fo'\nBut in one-oh, I drop one mo'\nSo these niggas'll know I'm the one ho!\n\n[Hook]", "image": "https://images.genius.com/43ec171838184bac0a8baa89f9e6d0a9.600x600x1.jpg"}], "artist": "B.o.B"}