{"songs": [{"title": "Vapors (DJ Battlecat Remix)", "album": "Neva Left", "year": "2017-04-19", "lyrics": "[Skit]\nDon't disrespect me. Do not disrespect me. I don't disrespect you niggas, I don't bother you niggas. I get my money the way I do. Leave me alone. I don't disrespect you niggas. Leave me alone. Don't disrespect me. Please, just leave me alone. I'm getting my money the way I do, I'm in my own comfort zone. Leave me alone. Don't disrespect me. Keep to myself, you keep your yourself. Leave me alone\n\n[Verse 1]\nRadio, TV, and even the press\nThey want the meaning of V-A-P-O-R-S\nNow the meaning of this word without no doubt\nMeans nobody wants to be down when you're down and out\nNow when you established and got a lot of money\nEverybody wants to be your buddy and honey\nLike tall buildings they call skyscrapers\n(Here comes the vapors)\nCan you feel it, nothing can save ya\nFor this is the season for catching the vapors\nAnd since I got time, what I'm gonna do\nIs tell you how it's spreading throughout my crew\nWell you all know Nate Dogg, who sings on my records\n\"Never Leave Me Alone\", \"Ain't No Fun\", now check it\nBack in the days before Nate Dogg began\nHe used to try to holler at this girl named Pam\nThe type of female with fly Gucci gear\nShe had a big herringbone with a weave in her hair\nWhen they tried to kick it, she'd always fess\nTalking about, \"Baby please, you out here serving stress\"\nSince he wasn't no type of big chronic dealer\nThe homie Nate Dogg didn't appeal to her\nBut now he sport boots that match with his suits\nPush a Lexus Coupe that's extra cute\nAnd now she stopped fronting and wants to speak and\nBe coming round the Pound every single weekend\nTo get his beeper number she be begging please\nDying for the day to eat these\nShe caught the vapors\n\n[Hook]\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors\n\n[Verse 2]\nI got a little cousin that's calm and plain\nHe bring the heat with the beat for the Dogg Pound gang\nA mellow type of fellow that's laid back\nBut back in the days he wasn't nothing like that\nI remember when he used to scrap every day\nWhen my auntie would tell him he would never obey\nHe wore his khakis hanging down with his starks untied\nAnd a blue and grey cap that said the Eastside\nAround my neighborhood the people treated him bad\nThey said Daz was the worst thing his mom ever had\nThey said he would grow up to be nothing but a gangster\nOr either in jail, or someone would shank him\nBut now he's grown up to their surprise\nD-A-Z got a hit record slanging worldwide\nNow the same people that didn't like him as a child\nBe like, \"Can I burrow a dollar? You a star now.\"\n\n[Hook]\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors\n\n[Verse 3]\nI got another homie from tha L-B-C\nKnown to y'all as DJ Warren G\nHe cut, scratch, transforms with finesse\n{scratching} and all that mess\nI remember when we first started to rock\nHe tried to get this job at Calvin's Record Shop\nHe was in it to win it, but the boss fronted\nSaid \"Sorry Warren G but there's no help wanted\"\nNow my homie Warren still tried\nOn and on and on til the like break of dawn\nTo work at tha V-I-P would be the lick\nBut they looked right past him so my homie straight dipped\nNow for the year after Regulate\nWarren G is having papers so my homie's like straight\nHe walked into the same record shop as before\nAnd the boss be like \"Warren, welcome to my store\"\nOffering him a job, but nah he don't want it\nDamn it feels good to see people up on it\nCause I remember when at first they wasn't\nNow guess what they caught since he busting\nThe vapors\n\n[Hook]\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors\n\n[Verse 4]\nLast subject of the story is about Snoop Dogg\nI had to work for mine to show I was a true hog\nWhen I was a teenager I tried to be down\nBut since they wasn't trying to hear me I made the Dogg Pound\nI saw a crew on 2-1 street and said, \"Can I be down champ?\"\nThey said no, and treated me like a wet food stamp\nAfter getting rejected, I ain't run off the set\nI sat and wrote some Dogg doo-doo rhymes at my rest\nWhen I used to go to parties, they'd make me wait\nWould have to beg to get on the mic to set MCs straight\nI ain't never love no hoes I was just into my music\nThey acted like I wanted to keep on hanging with the juzi\nBut now things switched from West to East\n\"Yo dog do you remember me from 21st Street, G?\nWe used to Cee down back in the day\"\nIt happens all the time, so brother don't be amazed\nYou caught the vapors\n\n[Hook]\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors\nHe caught the vapors\nShe caught the vapors\nThey caught the vapors", "image": "https://images.genius.com/60bf707949edab977c5ad8da61ef82a2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}