{"songs": [{"title": "Spit Game (Freestyle)", "album": "Build and Destroy", "year": null, "lyrics": "[Royce Da 5'9\"]\nFuck you.. yeah\nStrictly rough copy (yeah yeah yeah yeah)\nYo, yo yo yo yo\n\nFo'sho' nigga, I'm in this game and it's all good\nI've changed, I've not been the same, I came from a small hood\nI knew the first time I got sleepy on the job\nI was greedy, wait 'til you see me, I'm easy on the eyes\nMy father told me, \"Stay where the feelin is at\"\nFrom hell and back, I'm feelin that, that's why I rep 7 Mile\nNo, I don't live there nor was I raised there\nIt's where my niggas is at, where my niggas is at\nEach word fall down from the heavens, I will reign\nKeep a weapon and an alias pet to my real name\nProbably gotta get shot to sense that I feel pain\nWhen it's beef I transform into 'Pac, like Lil' Zane\nI'm street valuable cause of the lead in the holster\n('Nuff said!) When I post up, head on a poster\nIn the kitchen with, bread in a toaster\nDo you like EPMD did to the heads when they broke up\nFunk Flex - droppin bombs 'til he damage his thumbs\nHave Clue goin (\"HOOOOOO!\") 'til he damage his lungs (\"WEEEEE!\")\nEach face you see on them bills is my brothers\n'cept George, love you but, we don't see each other much\nI'm a dog, if I don't know you I don't FUCK witchu\nIf I love you then I'm STUCK witchu - your blood is mines\nGot Feds everywhere like, these are the guys\nIf, he's greater than me then he's not alive\nWhen it's war B-U-double-L-E-T's gotta fly\nIf, he's not smellin me, he's gotta die (yeah)\nBoth pockets pokin like a Jew\nNasty and hot when I'm open like a brew\nWords spoken like a true\nYou niggas better show me a peace sign or somethin\nI'll murder-murder-murder-murder you like Esham or somethin\nA fine line between a fake and a real thing\n'Bout to separate the niggas who hate from the real game.. {*echoes*}\n\nI spit GAME nigga\nYeah yeah yeah.. yo, yo\n\nFUCK THAT! Niggas don't spit it like this no more\nNiggas heard \"Boom\" don't wanna buy SHIT no more\nNow, call your label up, tell 'em don't SHIP no more\nEven Cali niggas is sayin, \"The shit's so hard!\"\nEvery nigga roll I fuck WITH want war\nKnock you out, you won't even know you HIT no floor (uhh)\nI spit game cause I'm always WITH game nigga\nRank high from the chain to the nickname, nigga..\n\nFuck outta here..", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}