{"songs": [{"title": "Swang", "album": "SremmLife 2", "year": "2016-08-12", "lyrics": "[Intro]\nMmm boy, it's nasty (Uh)\nUhmm\nKnow some young niggas like to swang (Yeah, uhmm)\nKnow some young niggas like to swang\nKnow some young niggas like to swang (Ride, uh)\n\n[Chorus: Swae Lee]\nKnow some young niggas like to swang (Swang)\nKnow some young niggas like to swang (Swang)\nBig bank take little bank\nEveryday spillin' up drank (Drank)\nShe want the whole crew, shawty brave (Brave)\nWhen the money talks, what is there to say? (Just say it)\nBlow away, watch it blow away (Blow, blow)\nWhen I die can't take it to the grave (Yo)\nHop out, drop, top, fuck y'all talkin' I need it right now (Hey)\nCash in the air, yeah, what goes up gotta come down (Woo)\n\n[Verse 1: Swae Lee]\nGettin' dough ain't a thing change (Nothin' change)\nCoasting, grippin' grain (Grip)\nGoin' through the money like a phase (Like a phase)\nDon't say my name in vain (Woo, woo)\nI'm so glad that you came (Yeah)\nAll these bad bitches gettin' slain (Slain)\nBroke ass nigga get a clue (Clue)\nAll these niggas know how we do (Let's go)\n\n[Chorus: Swae Lee]\nKnow some young niggas like to swang (Swang, swang)\nKnow some young niggas like to swang (Swang, swang)\nBig bank take little bank\nEveryday spillin' up drank (Up drank)\nShe want the whole crew, shawty brave (Shawty brave)\nWhen the money talks, what is there to say? (What is there to say)\nBlow away, watch it blow away (Watch it blow 'way)\nWhen I die can't take it to the grave (Watch it blow 'way, Watch it blow 'way, blow 'way)\nHop out, drop, top, fuck y'all talkin' I need it right now\nCash in the air, yeah, what goes up gotta come down (Ayy, ayy)\n\n[Verse 2: Slim Jxmmi]\nI know some young niggas from the bottom\nThey'll do anything for a dollar (Dollar)\nI coulda went to school to be a doctor (Doctor)\nBut I dropped out and chose to be a baller (Woo)\nSwitchin' lanes, spittin' game in my new drop (Drop)\nStill on a paper chase that don't ever stop (Never)\nEverybody with me family, that's how we rock (Rock, rock)\nParty at the mansion, we bout to flood the spot\nSremmlife!\n\n[Chorus: Swae Lee]\nKnow some young niggas like to swang (Swang, swang)\nKnow some young niggas like to swang (Swang, swang)\nBig bank take little bank\nEveryday spillin' up drank (Up drank)\nShe want the whole crew, shawty brave (Shawty brave)\nWhen the money talks, what is there to say? (What is there to say)\nBlow away, watch it blow away (Watch it blow 'way)\nWhen I die can't take it to the grave (Watch it blow 'way, Watch it blow 'way, blow 'way)", "image": "https://images.genius.com/3ae5fce394cec0598165a7fe68c8fa74.1000x1000x1.jpg"}], "artist": "Rae Sremmurd"}