{"songs": [{"title": "Throw Back Muzic ’86", "album": "Against the Grain", "year": "2005-08-23", "lyrics": "[Intro]\nYeah, Kurupt Young Gotti, Rider Redemption. Hey Mark, let's take them back in the days, to the real G shit, let's make it back!\n\n[Chorus]\n'86 golf pads, cocoa sacks, single sacks, nickel sacks, rumble packs, switching back, gunshot!\nThrow back music, that throw back music!\nGangster roll [?], R eight sevens, two elevens, one eight sevens, five point o mustang\nThrow back music, that throw back music!\n\n[Verse 1]\nYeah, back in the day, you can remember\nYoung dumb and full of cum\nHorseman, full shades, John Mere [?] bong\nUsed to live life with no fear\nFresh faced niggers getting thrown off the fence\n[?] trucks motherfucker! Ever get jacked with a truck, motherfucker?\nCrenshaw, Sunday nights was on deck\n[?] the homies had curls and combs\nThe homies used to meet up on Mount Vern\nD's [?] push that Y\nRiders die, homicide\nTriple and double, with the hood to get under\nIt was all about fellas, banging with straight\nAnd then came K's, and then spray paints\nAnd when K spread, everything stopped!\nThis was after the 9, and before the Glock\nGirls had [?] braids so, so thick\nYou know we used to flip\nSuzuki side kicks\nCrack hit the hood, watch us work this game\nS curls, K Swiss, Turkish chains\nYou had to pick a side to ride, rider\nDark blue khakis, black, green or flamed\nPurple or dark brown, I tell you the reals!\n\n[Chorus]\n\n[Verse 2]\nNigga, Washington High losing to Hawthorne High!\n[?], then they go and get high!\nI got the alchool, remember 8-ball?\nEvery time you drink it, you break a nigga's jaw!\n[?] Co-ed Gym, what's the words?\nI used to sneak some of the big homie's Thunderbirds!\nThe Latino homies, they own Budweiser\n[?] swap-meet, with the[?]\nMad Dog turning 20 into 22's\nLost in the hood\nBut it was all good!\nHit off [?]!\nEverything's game, insane in the brain\n[?] with the grape Kool-aid!\nThe big homies stayed, showing us things\nTurned 16, started drinking Nitrene\nNever gave a fuck, I had to do my own thing\nLost in the hood, couldn't move like I'm crippled\nBefore that I sipped some of grandma's Ripple!\nSummertime, '86 mania\nThey let the vampires out of Transylvania!\nEverybody banged out, everybody's hard\nIt's all about pushing lines, and pulling niggers's cars!\nBut one thing I just can't get used to\nIs busters, let me show you what we used to do!\n\n[Chorus][x2]\n\n\n[Outro]\nCome get high with me! Yeah, Kurupt, the one and only Kurupt Young Gotti, Neil Paul, Vitti, Stallone, The Juggernaut , Mad Deal, Hannibal the 8th, Troy Hood, nigga!\nWe're going to show you how we do it, this is the West Coast, back in the days, this is how we used to roll, nigga!\nYeah, deadliest turpentine! Swallow that, you sucker ass niggers! We're going to keep it real hood!\nDeath row Records! Yeah, you know what I've got nigga! Gestapo! Pentagon!\nRiders, we're doing this!", "image": "https://images.genius.com/901ee868384c5cb1f3a23f4bff250845.500x500x1.jpg"}], "artist": "Kurupt"}