{"songs": [{"title": "Real Killer", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro]\n*phone ring*\n-Yo\n-It's me\n-What’s wrong?\n-I'm just gonna say I'm due in October!\n-Ahh sshh...\n\n[Verse 1: Tech N9ne]\nI was kicking it with this chick for a minute\nShe picked me to hit it, real stiffly I sitted\nHe spit then we quit it\nThen I told her to miss me and splitted\nQuickly I lit it up, no problem to get it up\nThen she called and said she needed me to help her get rid of what?!\nA baby! She said she wanted me to kill it\nNo evidence, blood - Don't spill it\nI'm saying at first, I didn't feel it\nBut then I started to ponder on what was coming up yonder\nA baby by a fling made days seem really somber\nSo we both were in agreement, the baby I seen it\nThinking of killing it made me almost fall to the cement\nThis ain't a job I can do myself, I ain't got the brain for this\nSo I called a homie in Kansas who was trained for this\nHe said the way I rap and make skrill for a living\nHe said he kills for a living\nFor the grip span, he's a hit-man\nSo I paid him a fee, he told me what date it would be\nMe and her was down, but I really don't think the baby was G\nSo we three road to Kansas, baby probably thinking we scandalous\nCan't even walk and we band his life\nMan is trife, walked in and he told us to relax\nI sat and he took her and baby to the back\nBefore I came I smoked some dope to calm me\nThey came back and she was baby-less and she was looking like a zombie\nBaby gone (Baby gone)\nWere we wrong? (Hella wrong)\nGotta move on (Gotta move on)\nLet it alone (Yeah)\nI dropped her off but she didn't hate me for killing the baby\nShe said she still wanted to date me, crazy!\nI'm riding and I'm thinking \"Why?!\"\nI took a life but I ain't tweeking\nI know God probably thinking I should die!\n\n[Hook: Tech N9ne]\nReal killer (That is me!)\nReal killer (That is me!)\nReal killer (That is me!)\nThis is what you call a what?!\nReal killer (That is me!)\nReal killer (That is me!)\nReal killer (That is me!)\nI don't really give a fuck!\nReal killer (That is me!)\nReal killer (That is me!)\nReal killer (That is me!)\nKnow that ain't nobody iller!\nReal killer (That is me!)\nThat-is-me, that-is-me (Mass murderer)\nThat-is-me! (Natural born killer)\n\n[Verse 2: Tech N9ne]\nA couple of years later, I'm creeping with this chicklet\nLittle thick chick, hit it raw and gave her triplets\nI need to learn to hold my liquid\nSo I called my man in Kansas City, Kan\nI told him I needed him to do it again\nAfter he put 'em away, I asked him\n\"Homie, how could you be so raw?\"\nHe said to me \"How could YOU be so raw?!\"\nWe scattered, one year later I splattered in the same chick\nShe wanted to have it, but I made her do the same shit\nSo I murdered five kids of mine\nI'm 'bout to sit in hell a lifetime bid for mine\nCause of abortion (No more)\nAbortion, now it's blown out of proportion\nInsane... Never again\n\n[Hook]", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}