{"songs": [{"title": "Hole in the Head", "album": "Cypress Hill", "year": "1991-08-13", "lyrics": "[Sen Dog] Ganxsta Ridd, whassup yo?\n[Gxt Rid] It's a Tribe thang\n\n[Verse One: B-Real]\nMadman gonna gat cha, quick with the cuete\nSee a gang, no there ain't no jugete\nRollin like a pyscho with the windows rolled down\nWho you lookin at, you tryin to fade me clown?\nPlato, si mon, you want static\nWhen you reach for your gat to load your automatic\n(Boo-yaa!!) Spittin out buckshots\nHomey say blood claat, so you can call a pig\nCause no one could handle, aguanta en loco\nInsane in the brain, you get the bullet and\n\n[Hook: B-Real, Sen Dog]\nA hole in your head\nA hole in your fuckin head/A fuckin hole in your head\nIn your head!\nA hole in the/your head, a hole in the/your head\nYou get a hole in the head (a hole in the head) in your motherfuckin head\nHuh!/In your head\nA hole in the head, a hole in the head\n\n[Verse Two: B-Real]\nEight barrel pumpin, system thumpin\nSee a fine heina, c'mon baby jump in\nI stop to cop, here let me tell you somethin\nMe and you, ruca, we should be humpin\nHoney likes the mack, homey's got her in the bag\nBut there's vato's rollin out, and they're stickin up the flag\nHe jumps out with the sag, hey where ya from homes?\nIt's on... he sees him reachin for his chrome\nBuckshot to the dome, jumps in the Brome\nHoney's in the back but she just wants to go home\nBut he trips to the store homeboy needs a forty\nWhite boy at the counter's thinkin oh lordy lordy!\nPushin on the button, panickin for nuttin\nPigs on the way, aiyyo I smells bacon\nDips out the store, one-time hits the corner\nAnd he hits the fuckin alley like if homes was Pop Warner\nStill had the forty, comin out the alley\nSeen the chief's son, pig Officer O'Malley, oink\nIn the black and white thinkin he's gonna jack him right\nWrong, hah, it's gonna be on\nThat pig better saca la chrome (P.D. 187)\nA to the motherfuckin K! (You know whassup Sen)\nShoot your ass down! And by the way\n\n[Hook]\n\nA Scooby Doo y'all, a Scooby Doo y'all\nScooby Doo!\nA Scooby Doo y'all, a doobie doobie doo y'all\nDoobie doo!\nA Scooby Doo y'all, Scooby Doo y'all!\nScooby Doo!\nA Scooby Doo y'all, a Scooby doobie Doo y'all\n\n[Verse Three: B-Real]\nSix rollin up and now he's really baffled\nBrother's thinkin \"Damn I never got this gaffled\" (to' up)\nBeat down (down) on the way to the station\nGaffled up from a false accusation\nOink to the pen, you know homes the one that's where the\nAttitudes are flying and the punks will be dying\nMade a comb to a shank, I'm gonna stick ya\nWet ya, you know homes the picture\n(Yeah you never been to jail boy!)\nBroomstick up your ass\nAnd by the way, you get\n\n[Hook] - repeat 2X\n\n[Sen Dog] Yeah South Central and the Westside teamed up\nThis is hell boy\n[Gxt Rid] It's a Tribe thang... straight up! It's a Tribe thang\n[Sen Dog] What side is that Ridd?\n[B-Real] Can they kick it?\nCan they kick it?\nYeah, can they kick it?\nI'm Sirnose and they cannot kick it", "image": "https://images.genius.com/c219dd3c8a82f4fe8368158d27c1a173.897x887x1.jpg"}], "artist": "Cypress Hill"}