{"songs": [{"title": "The Breakthrough", "album": "Bigger and Deffer", "year": "1987-05-29", "lyrics": "[LL Cool J]\n\nKnuckleheads spreadin' gossip all over town\nEvery time I drive by you're just standin' around\nHundred-bottles in your pocket, forty-dog in your hand\nDon't you know you're just a worker and your boss is my man?\nL.L. this, L.L. that, soon as I walk in the place\nI wanna take my gun and shoot you in your muthafuckin' face\nYou're playin' me too close with the schemin' and games\nI guess the beef and the bullshit is the price of fame\nMovies, records, goin' on tour\nTwenty-thousand people hip-hoppin' on the floor\nWhole parties body-rockin', and everything's chill\nGet back to New York, and the suckers act ill\nSee I fought with the devil, made a promise to God\nI have experience in goin' all the way to the top\nIt's harder harder than hard\nAll the suckers are barred\nYou used to try to talk down now your ego is scarred\nSee the problem is you want what another man has\nHis car, his wife, or his razzamatazz\nBut that's weak, you gotta do work on your own\nCuz when you're rich you got friends\nBut when you're poor you're alone\nSo get your own on your own, it'll strengthen your soul\nStop livin' off your parents like you're three years old\nInstead of walkin' like you're limp and talkin' yang about me\nWhy don't you take your monkey-ass and get a college degree?\nOr write a rhyme and ride a bike and try to live carefree\nHope my message reaches you before you're seventy-three\nA old man, when people ask you what you did with your life\nYou'll say \"I hated L.L. and I carried a big knife\"\nEvery day is a chase, every day is a race\nAnd every day you're being overpowered by my bass\nToo much juice to be a deuce, I had to be a ace\nIt's like the fire's in my eyes and the gun's in my face\nI'm stompin' stupid knuckleheads until they bleed\nI'm the leader of the show, so it's up to me to lead\nI'mma lead you away from drugs and petty crime\nLead you away from wack beats and rhyme\nLead you to that ticket line\nSo you can come in my show and watch the stars shine\nGet busy, not dizzy, wanna teach the young\nThe last man who didn't listen ended up gettin' hung\nNot that I killed him, it's just\nHe didn't wanna trust\nThe words of a master that's why you must\nTake heed to the speech, it's gonna reach your ear\nDon't try to say you can't hear cuz the words are clear\nThrowin' flurries, punks scurry and I bury the rest\nYou better hurry up and rock a rhyme and give it your best\nCuz tonight's the night we gonna see the big fight\nTwelve-gauge on the stage in case it don't go right\nE-Love drives a tank, he's strong like a truck\nIf you're cryin' while you're dyin' we ain't givin' a fuck\nL.L. Cool J is on the microphone\nTellin' all you punk ducks \"Leave me the hell alone\"\nCuz I'm rated X, born to snap necks\nStraight up and down, no special effects\nI'm the professor, the teacher, the hip-hop dean\nIf Russia bombed the U.S., they'd be scared to touch Queens\nCuz that's where I live, and this is what I give\nTurnin' top-notch crews into fugitives\nThey run, they frightened, they hide from King Titan\nLike a sniper when he's shootin' or a viper when he's bitin'\nHere I am, tellin' the truth\nAnd I'm spreadin' the word to my fellow youth\nIt goes man-to-man and jam-to-jam\nI got hip-hop, rock, and love song fans\nAll you petty MC's in the state of New York\nGettin' a thousand for a show but you still wanna squawk\nCan't get a decent contract, your beats ain't workin'\nDogged-out Pumas plus you're manager's jerkin'\nYour mic sounds weak, remember that skeezer\nI'm badder than Napoleon, Hitler or Caesar\nI'm a hitman, but I'm not for hire\nFly girl's desire, the man you admire\nNot only on the stage, I rock in the park\nAnd I'm a killer in the daytime, and worse after dark\nSo don't never ever mess with the king of the sound\nL.L. Cool J, the baddest around", "image": "https://images.genius.com/360d16b8aeb2fd205516a7b8c96f11b2.1000x1000x1.jpg"}], "artist": "LL Cool J"}