{"songs": [{"title": "Make It Ruff, Make It Smooth", "album": "Lethal Injection", "year": "1993-12-07", "lyrics": "Intro: K-Dee, Ice Cube\n\n[Hey yo cube]\nMAKE IT RUFF\n[Cube check it out]\nWhassup?\n[Yo this bitch was suckin my dick, you know what I told her?]\nWhat?\n[Make the music with ya mouth biiiyaaatch!]\nHahahaha, k-dee baby!\n[Hahah ya like that]\nMAKE IT RUFF\n[Naw, make it smooth]\n\nVerse One: Ice Cube, K-Dee\n\nI make niggas say 'woof' cos I'm in the coupe with no roof\n[Ya smell like somethin 90-proof]\nCos I'm ruff, and nigga you can buck these nuts\nIf you comin with that smooth shit, hard core rules shit\n[I make the hoes say 'hay' each and every day\nBitch cos I'm the k-dee, no I'm not a g]\nMothafuckin wannabe mack\n[But I'm smooth like that]\nI gots ta buck...you...right on up, punk you lucky that cha livin\nCos I'm the unforgiven; I like power, ain't a damn thing funny\n[I like pussy and money\nAnd I won't slam like onyx or never ever stutter\nBut I'm b-b-butter;\nLeader of the new school, you hard core fool!]\nNigga make it ruff! [make it smooth!]\n[And I'm here]\nMAKE IT RUFF [naw, make it smooth.]\n\nVerse Two: K-Dee, Ice Cube\n\n[K-Dee]\nYou can lick me up and down till I yell stop!\nDamn bitch ya missed a drop...cos I don't play when I sway\nIt's the quicker picker upper;\nA pro that moves slow before this ho I'm quick\nTo dump her; so eeny-meeny-miney-mo, where's my dough?\nI gots ta make a livin, I out ta get mo;\nMoney, and got more nuts for ya honey; so\nCome and break me off, this nigga's walkin soft;\nIt's the smoothness that make niggas move to this;\nFor you ruffnecks, i'll check you with my tool and shit;\nDon't sweat 'em, just let 'em play that hardcore\nRole; we still cool, but just make it smooth...\n\n[Ice Cube]\nYou know what, it's like a jungle sometimes it makes me wonder\nHow I keep from goin under, I'm chocolate thunder;\nRuff as sin, cuts on ya skin\nAnd I blend with the tracks, see I'm black\nK-dee is the mack; matter fact\nNiggas hit me up with the c's and b's\nBut you don't wanna fuck wit these\nCos i'll put 'em on ya\nAnd we'll have to wake ya mothafuckin ass up with ammonia\nCos hardcore rap is always on the map and it don't stop\nDevoid of pop; and if I drop another smooth hit\nIt'll still be hard, cos I helped start this shit;\n\nSo make it ruff [naw make it smooth!]\nMake it ruff! [make it smooth!!]\nMake it ruff! [make it smooth!!]\nMAKE IT RUFF\n\n[..naw...make it smooth.]\nMAKE IT- MAKE IT RUFF\n\n[Naw, make it smooth.]\n\nVerse Three: Ice Cube, K-Dee\n\nI hate when niggas get too fuckin sexy on the track, I'm pro black\n[Well I'm a pro-mack.]\nI like hittin switches\n[I love hittin bitches, cos I'm a player.]\nHard rhyme sayer!\n[I thought you knew, but ain't no thang, you knew the way I swang;\nCreepin, ain't no sleepin, ain't a damn thing changed; I hit ho after\nHo with this laid-back shit.]\nFool, I kill at will and still can fade that shit; cos it's the\nPredator, I edit(?) her, so nigga watch yo step!\n[You in a gang like starr, tryina get a rep!]\nIt ain't no sweat for me to buck buck nigga don't give a fuck; you\nBetter duck duck or get your ass stuck stuck!\n[Don't let the smooth shit fool ya, cos I can get it on; cos I be\nBreakin bones like dragonfly jones; quick to put em on ya.]\nDon't make me act a fool! nigga, make it ruff!\n[Make it smooth!]\n[And I'm in here...]\n\nMAKE IT RUFF\nMake it ruff [make it smooth]\n\nMAKE- MAKE IT- MAKE IT RUFF\n...make it ruff [make it smooth!]\n\nMAKE IT RUFF\nIce cube's up in this motherfucker\n[K-dee's up in this motherfucker]\n\nMAKE IT RUFF [naw make it smooth.]\n\nMAKE IT RUFF [naw, make it smooth!]\n\nMAKE- MAKE IT RUFF- RUFF\n\nMAKE- MAKE IT RUFF [naw make it smooth.]\n\nMAKE IT RUFF- RUFF [naw, make it smooth.]\n\n[Naw, naw, make it smooth]\n\n[Naw, make it smooth]", "image": "https://images.genius.com/7130347bb47a4a618915a6de2818699a.1000x1000x1.jpg"}], "artist": "Ice Cube"}