{"songs": [{"title": "Hold on Be Strong", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "[Produced by Choo]\n\n[Intro]\nHold on... *lighter flicks up*\nYeah, it's gonna be alright\nDon't trip, baby *inhales*\nIt'll get better... *coughing*\nAye, do this thug style, man, thug style\nWhen this whole beat drop\nWe just gon' run it to 'em\nBet, it's all good, uhh\n\n[Verse 1]\nI never had much, ran with a bad bunch\nLittle skinny kid sneakin' weed in my bag lunch\nAnd all through Junior High, we was just gettin' by\nAnd drive-by's robbed my homies of their young lives\nI never did cry, and even though I had pain in my heart\nI was hopeless from the start\nThey couldn't tell me nothin', they all tried to help me\nThe marijuana had my mind gone, it wasn't healthy\nI traveled places, caught cases, what a ill year\nI felt the pain and the rain, but I'm still here\nNever did like the police\nLet the whole world know, now I gets no peace\n‘Cause they chasin' me down\nAnd facin' me now, what do I do?\nThese things that a thug goes through\nAnd still I rise, so keep your head up\nAnd make your mind strong\nIt's a struggle every day, but you gotta hold on\n\n[Hook]\nHold on, be strong!\nHold on, be strong!\nHold on, be strong!\nWhen it's on, it's on\n\n[Verse 2]\nThere's never a good day, ‘cause in my hood they\nLet they AK's pump strays where the kids play\nAnd every Halloween, check out the murder scene\nCan't help but duplicate the violence seen on the screen\nMy homies dyin' before they get to see they birthdays\nThese is the worst days, sometimes it hurts to pray\nAnd even God turned his back on the ghetto youth\nI know that ain't the truth, sometimes I look for proof\nI wonder if Heaven got a ghetto, and if it does\nDoes it matter if you Blood or you Cuz?\nRemember how it was?\nThe picnics and the parties in the projects\nSmall time drinkin', gettin' high with them armies\nJust another knucklehead kid from the gutter\nI'm dealin' with the madness, raised by a single mother\nI'm tryin' to tell you when it's on\nYou gotta keep your head to the sky\nAnd be strong, most of all, hold on\n\n[Hook]\nHold on, be strong!\nHold on, be strong!\nHold on, be strong!\nWhen it's on, it's on\n\n[Outro]\n(Hold on, be strong *repeats in background*)\nI know them ain't tears comin' down your face\nWipe your eyes\nIn this world, only the strong survive, you know?\nHehe, I know it's hard out there\nWelfare, AIDS, earthquakes, muggings, car-jackings\nYeah, we got problems\nBut believe me when I tell you things always get better\nGod don't like ugly, and God don't like no quitters\nYou know what Billie Holiday said?\nBay-bee, God bless the child that can hold his own\nYou know? You got to stand strong\nAnd when these bustas try to knock you out your place\nYou stand there to they face\nTell 'em \"Hold on!\", and be strong\nThe game don't stop, huh\nThis here is black, man\nIf you don't never learn nothin', learn one thing\nIt don't stop, 'til the casket drop\nThug for life... feel me?\nAll my homeboys and my homegirls, stay strong\nWhen things get bad\nEspecially come the first and the fifteenth\nStay strong, and stay ballin', hold on\nI'll catch y'all at the next life, we in traffic", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}