{"songs": [{"title": "Sometimes I Wonder", "album": "In My Ghetto", "year": null, "lyrics": "[Intro: Nas]\nQB, the whole NYC\nWe gon' bounce to this\nAll my niggas (yeah, yeah)\nAll the ladies\n\n[Hook: Nas]\nSometimes I wonder\nWill a nigga go under because of his hunger?\nThis game is risky\nIf a nigga slipped six feet, will these niggas really miss me?\nDead partners too soon\nAll these niggas flippin' on me ‘cause I won't give no loot to 'em\nSometimes I wonder, sometimes I...\n\n[Verse 1: Nas]\nTop of the world is what I'm aimin' at\nThese niggas is flamin' gats at my circle\nI catch you, my first reaction's to hurt you; I'll hit your bird, too\nTwo in your scalp, then you out, your thug crew is out\nBlood oozin' out, some servin' caine\nKnowin' nothin' about this murder game\nIt's easily told but hard to hear\nWhen niggas finally find out it's real\nThat's when they heart pumps fear\nThe real remain, the weak will disappear\nMy words are 20/20, my vocals are crystal clear\n911 style sits on your mind like chrome\nLet's say your brain's a V12, put it in drive, let it roam\nWhat color? Might as well make it the same as your dome\nYou need your thoughts together means destination is unknown\nAs we travel on this road, an infinite path\nI get into this math, drop and get intense for the cash\nWill I be subject to kill? Live my life by the gat?\nJust when I think I made it out, the street is calling me back\n\n[Hook: Nas]\nSometimes I wonder\nWill a nigga go under because of his hunger?\nThis game is risky\nIf a nigga slipped six feet, will these niggas really miss me?\nDead partners too soon\nAll these niggas flippin' on me ‘cause I won't give no loot to 'em\nSometimes I wonder, sometimes I...\n\n[Verse 2: Nature]\nI know a lot of fiends by their first name, livin' in Queens\nA lot of cats gettin' stuck for they chains\nHoldin' dirty guns, the young old dirty ones\nRunnin' wild, nigga, I raise hell above ground\nLive in sin, holdin' rocks, Benjamin Grimm\nFigure once I got knocked, it would end—never that\nThey try to tell me I don't love my own\nThe thugs know, they ride my zone, like The Cyclone\nTrademark for Coney Isle, yeah, they know me now\nI'm givin' niggas fake hugs, phony smiles\nStack profits, you know how niggas on the block get\nTry to give you dap just to stare at your pockets\nCrews advance, nothin' new, just the rules of the land\nYou couldn't tell if they wolves or lamb (Ha, word)\nYou could fight like a few, there's a few that ran\nOr you could feed them and lose your hand\nWhat you wanna do?\n\n[Hook: Nas]\nSometimes I wonder\nWill a nigga go under because of his hunger?\nThis game is risky\nIf a nigga slipped six feet, will these niggas really miss me?\nDead partners too soon\nAll these niggas flippin' on me ‘cause I won't give no loot to 'em\nSometimes I wonder, sometimes I...\n\n[Verse 3: Nas]\nBlessings be to the ones who left us\nTo transcend into spiritual essence, in Allah's arms you restin'\nTo Him we pray for my peeps\nLouie Lloyd Floyd, Twin and Taiyeh, Mr. Sonny back in the day\n\"Get that money, yam,\" he used to say\nNot only nice with hands but street smarts, he was twice a man\nI try to understand life's deep plot, I think of Weewop\nShikeisha, they both was mad nice on the rock\nThey woulda went pro, but only God, he only knows why not\nLike my nigga Bing, let your sneakers be not clean\nYou come around, he start snappin' on you, makin' a scene\nKept the lye, cool nigga, warm heart, and stayed fly\nYou still alive, I see you in your sister's face\nAre you nearby or lookin' on, just from a distant place?\nMy thoroughbreds, Black Ed, quiet but real\nExpect to see your black Jeep come fly over the hill\nIn the spirit of Richie Lou, tribute\nRemind the world of the crime that NY pigs do, we miss you\nNever forget you, Harry and Sonia\nRest in peace to Marty, a 41st side of Vernon soldier\nT.J. Black, better known as Killer\nI can't replace you, but in me\nHavoc will always have a brother, my nigga\nMy man Will, until we meet again\nYou hold it up there, I'll hold it down here\nI hope y'all hear my prayers clear\n\n[Hook: Nas]\nSometimes I wonder\nWill a nigga go under because of his hunger?\nThis game is risky\nIf a nigga slipped six feet, will these niggas really miss me?\nDead partners too soon\nAll these niggas flippin' on me ‘cause I won't give no loot to 'em\nSometimes I wonder, sometimes I...\n\n[Outro: Nas]\nRest in peace to my grandfathers, Papa Charlie...\n(Will a nigga go under because of his hunger?)\nRest in peace to my man's Horse pops, nam'sayin'? One love\n(If a nigga slipped six feet, will these niggas really miss me?)\nCan't forget Nana, my man L.E.S. grandmom, nam'sayin'?\n(All these niggas flippin' on me ‘cause I won't give no loot to 'em)\nThey still wit' us, though; I wonder where they at?\n(Sometimes I...) How near, how far?\nSometimes I wonder (What?)\nWill a nigga go under because of his hunger? (Can't go under)\nThis game is risky\nIf a nigga slipped six feet, will these niggas really miss me?", "image": "https://images.genius.com/fa91cff72cfd37fd6ea86da4dde45a21.300x300x1.jpg"}], "artist": "Nas"}