{"songs": [{"title": "Dear Anne", "album": null, "year": "2011-06-13", "lyrics": "[Chorus]\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?\n\n[Verse 1]\nDear Anne, my number one fan\nI write with the light from the lamp on my night stand\nWith my pen in my right hand and that's also my mic hand\nCodeine in a Sprite can, ink on the white pad\nAnd I'm thinking of life, Anne, and wrong and right, Anne\nAnd sometimes I'm right and sometimes I might\nCannot find the light still my rhymes are bright\nSo I continue my plan and I'm sure like white sand\nThat they'll be price paying before my flight land\nBut still, I want to see more than my sight can\nAdore so I can't ignore what I want anymore\nSo I just go you can call me the goer\nAnd oh, yeah, I got a girl, she act like I owe her\nAnd uhm, sometimes it seems like I just don't know her\nAnd yeah, the relationship is starting to feel like a chore\nBut I really hope I'm not starting to bore, page one\n\n[Chorus]\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?\n\n[Verse 2]\nDear Anne, my number one fan\nI write you this letter, I hope everything's grand\nI hope everyone's good, I hope everybody's praying\nI hope, hold up baby, let me switch hands\nSee, lately I've been dealing with a lot of shit, Anne\nIt's burning me and I can't get out of this pan\nAnd everytime I look there's a problem with this man\nBut I ain't tryna expose, I'm just tryna expand\nBut your support held me up like kickstands\nAnd I'm also being more careful in how I pick friends\nAnne, I'm trying to stay up out them chicks' pants... but I just can't\nBut on another note, this ain't just another note\nThis is more than a rap, this is more of an oath\nAnd I know you're wondering what this letter is for\nAnd I'm just hoping that you read this far, page two\n\n[Chorus]\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?\n\n[Verse 3]\nDear Anne, my number one fan\nBy now, you probably think that I'm portraying who I'm saying\nAnd sometimes I wish I wasn't him but I am\nAnd it's people like you that make me proud of what I am\nHey, you are the shit, damn, pardon the gram'\nBut it's like you make me feel like I'm a part of the fam\nAnd shit, when my life is like some sort of exam\nIt's a jungle out there, lions, horses and rams\nShit, as I sit and wait for the war to begin\nI just think of you then I'm rewarded again, Anne\nWith you is where my artistry can, Anne\nSo with you is where a part of me stands, Anne\nI hope I see you in the stands, Anne\nBecause you know I understand, Anne\nAnd I'm sorry about Stan\nSo I wrote this to say that I'm your number one fan\n\n[Chorus]\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?\nOut of sight, out of mind, out of time to decide\nDo we run? Should I hide for the rest of my life?", "image": "https://images.rapgenius.com/arztdpno5k3dxhqat6i0rs6xj.1000x1000x1.png"}], "artist": "Lil Wayne"}