{"songs": [{"title": "The Teacha Returns", "album": "Adventures in Emceein", "year": null, "lyrics": "[Intro]\nBam Beatz on this one, let's rock out!\nTaking you low...\n\n[Verse one]\nThis The Teacha, I do this for life\nPlus I'm psychic, but I ain't gon tell you who's doing your wife\nYou ain't raw like the coke in your rhyme recital\nYou been cut so much, you starting to look suicidal\nYou trifle, trifling, you need to stop and listen\nYou need to hear 2Pac when he was locked in prison\nMan, for real, I'm expanding\nThis ain't whiling out, you'll get nicked with two cannons\nYour team's not loyal, you're not harming me son\nIf I said \"Who wanna go on tour?\" you'd be an army of one\nWhat's that shit around your mouth man, cum?!\nFace the fact, you lost, we got it, we won\nYou better off trying on some lottery run\nThen to go against The Teacha, I put the Glock to you dunn\nI be rockin' them drums, all you doing is shoutin'\nWhat's your address, 69 Brokeback Mountain?!\nIt seems my skill you doubtin'\nI spit lyrics, I flow like a fountain\nListen, you'll get crushed like a kush going into my blunt\nI take it way back, all you do is front!\n\n[Interlude]\nYeah... haha, ha...\nYeah, yeah... KRS!\n\n[Verse two]\nSpit-tacular, you spit at me, I spit it back at ya\nI'm an emcee, not an actor\nMy lyrics won't trap ya, they'll free ya\nBut rappers still wanna test The Teacha, let 'em have it!\nWhat you in my face for, in my space for?\nThis is what you rappers get smacked in your face for\nY'all talk about cutting the bass raw\nBut you draw the cops, this what you get chased for\nI'm forever above your world in whatever you do\nRappers, I will level your crew\nWhen I'm through, they won't even be able to TELL if it's you\nI'm an emcee, this tradition goes back to Pebbly Poo\nMan, I speak the truth, I'mma show you what God is\nI heard your CD; from the start, it was GARBAGE!\nClick, click, click, I load the cartridge\nLook in the palm of my hand man -- THAT'S where your heart is!", "image": "https://images.genius.com/ad42a510e6be3523569fba6178f6bcf5.419x382x1.jpg"}], "artist": "KRS-One"}