{"songs": [{"title": "Freak Daddy", "album": "Soundbombing III ", "year": null, "lyrics": "[Life is one big road with alotta signs]-- repeats in background\n\n(Alright)\nPeace, peace this is Mos Def\nBig shouts to my man Cipha Sounds (alright) and Mr.Choc\nHolding it down Sound Bombing (yeah) number three\nFreak daddy shit like Big Jones (it's almost over) and Mos Def\nBelieve me (alright, yeah)\n\nIt's almost over, it's almost over\nWhat are you getting ready for? (haha)\nYa'll ready? (they ain't ready) (haha)\nYa'll really ready? (let's see who ready)\nWe will see right now (ha, check it)\nWe gon' see who ready (ha, check it)\nWe gon' see who really ready (ha, check it)\nWe gon' see who ready (ha, check it)\nWe gon' see who really ready (ha, check it)\nWe gon' see who ready (ha, check it)\nWe gon' see who really ready (ha, check it)\n(ha ha check it ha ha)\n\nAlright, yeah\n\nIt's almost over, it's almost over\nWhat are you getting ready for? (haha)\nYa'll ready? (they ain't ready) (haha)\nYa'll really ready? (let's see who ready)\nWe will see right now (ha, check it)\nWe gon' see who ready (ha, check it)\nWe gon' see who really ready (ha, check it)\n(ha a haha awwww)\n\n[Verse 1: Mos Def]\nHands high, everybody move\nYes muthafucka that means you\nYa'll want some, I want some too\nThe difference is, I want mines more than you\nSo make way when my truck roll through\nOr get rolled over like you was new road\nMos Def with the Jack Jones super shooter tap long\nAct wrong and get bbbb packed on\nThen get thrashed on in all forms of fashions\nBlack, Latino, Asian, and Anglo-Saxon\nYou rhyming like you got the next nigga pants on\nI'm in the street getting my grown man's trance on\nYou want the ice cream then fill' em with they hands tore\nDude I ain't shit that they need to put they hands on\nParty people let me see where your hands are\nBrooklyn in the building got'em scared ya'll\n\n[Hook]\nRock wilding wilding out in the beat another freak\nDaddy got'em hot in the street\nAnd it's the rock\nWilding wilding out in the beat another freak\nDaddy keep'em hot in the street\nI need to hear it from you mami (freak daddy you nasty)\nThen let me see you work your body (what daddy like this?)\nOh yeah hold your finger high in the air\nYeah So I can roll 'bout to lock and load right there\n\n[Verse 2]\nJones Brooklyn New York\nYou see Mos Def, you see a black man a walk\nWhen I kill with the pussy boy dark\nThis full of big shot the world boom boom shot\nBoom the block when I response for that\nCome ice on that to make the ghetto run hot\nNon-stop for the night and the dark\nOne shot gon' make the ghetto bbbbbbb\nThe Buck stops here and the club rocks here\nTo see the game change 'till ya must watch here\nMy flow automatic see my gun cock here\nThe rubber rock love make the dog shot here\nI put it in your ears but I won't stop there\nI put it in your body if you can not hear\nYou smell something nice dude it's not hot here\nIt's freak daddy blow it to ya hot must fear\n\n[Hook]\nRock wilding wilding out in the beat another freak\nDaddy got'em hot in the street\nAnd it's the rock\nWilding wilding out in the beat another freak\nDaddy keep'em hot in the street\nI need to hear it from you mami (freak daddy you nasty)\nThen let me see you work your body (what daddy like this?)\nOh yeah hold your finger high in the air\nYeah So I can roll 'bout to lock and load right there\n\nYeeeeeaaaaaah aaaaaawwwoooo jumping on'em now\nHa ha freak daddy ha, say my name say my name\nHa freak daddy ha, say my name say my name\nYeah, freak daddy ha Jack Johnson ha\nGet ya fingers up ghetto blaow blaow blaow {screaming}\n\nFreak daddy ha say my name say my name ha\nFreak daaadddy say my name say my naaaamme\nFreak daaadddy say my name say the name say the name\nSay the name say the name is Black Jack Johnson ......", "image": "https://images.genius.com/d9e12ac076751af2018144a8f963b6c6.640x640x1.jpg"}], "artist": "Yasiin Bey"}