{"songs": [{"title": "Fanstic Voyage (Re-Recorded / Remastered)", "album": null, "year": null, "lyrics": "Come on, y'all, let's take a ride\nDon't you say shit, just get inside\nIt's time to take your ass on another kind of trip\n'Cause you can't have the hop if you don't have the hip\nGrab your gat with the extra clip\nAnd close your eyes and hit the switch\nWe're going to a place where everybody kick it\nKick it, kick it, yeah, that's the ticket\nAin't no bloodin', ain't no crippin'\nAin't no punk ass nigga's set trippin'\nEverybody's got a stack and it ain't no crack\nAnd it really don't matter if you're white or black\nI wanna take you there like the Staple Singers\nPut something in the tank and I know that I can bring ya\nIf you can't take the heat, get yo' ass out the kitchen\nWe on a mission\nCome along and ride on a fantastic voyage\nSlide, slide, slippity slide\nWith switches on the block in a '65\nCome along and ride on a fantastic voyage\nSlide, slide, who ride?\nNo valley low enough or mountain high\nI'm tryin' to find a place where I can live my life\nAnd maybe eat some steak with my beans and rice\nA place where my kids can play outside\nWithout livin' in fear of a drive-by\nAnd even if I get away from them drive-by killers\nI still got to worry about those snitch ass niggas\nI keep on searching and I keep on looking\nBut niggas are the same from Watts to Brooklyn\nI try to keep my faith in my people\nBut sometimes my people be acting like they evil\nYou don't understand about runnin' with a gang\n'Cause you don't gang bang\nAnd you don't have to stand on the corner and slang\n'Cause you got your own thang\nYou can't help me if you can't help yourself\nYou better make a left\nCome along and ride on a fantastic voyage\nSlide, slide, slippity, slide\nI do what I do just to survive\nCome along and ride on a fantastic voyage\nSlide, slide, who ride?\nThat's why I pack my 45\nLife is a bitch and then you die\nStill tryin' to get a peace of the apple pie\nEvery game ain't the same 'cause the game still remains\nDon't it seem kinda strange? Ain't a damn thing change\nIf you don't work, then you don't eat\nAnd only down ass niggas can ride with me\nHop, hop, hop your five quickly down the block\nStay suckafree and keep the busters off your jock\nYou gotta have heart, son, if you wanna go\nWatch this sweet chariot swing low\nAin't nobody cryin', ain't nobody dyin'\nAin't nobody worried, everybody's tryin'\nNothin' from nothin' leaves nothin'\nIf you wanna have something, you better start frontin'\nWhat ya gonna do when the 5 roll by?\nYou better be ready, so you can ride\nCome along and ride on a fantastic voyage\nSlide, slide, slippity, slide\nWhen you're living in a city it's do or die\nCome along and ride on a fantastic voyage\nSlide, slide, who ride?\nYou better be ready when the 5 roll by\nJust roll along, that's what you do\nJust roll along, that's right\nJust roll along, that's what you do\nJust roll along, that's right\nDo you want to ride with me? Do you want to ride with me?\nDo you want to ride with me? Do you want to ride with me?\nDo you want to ride with me? Do you want to ride with me?\nDo you want to ride with me? Do you want to ride with me?", "image": "https://images.genius.com/80e7d4d7290ea57cc76b3c5e101a8d2f.755x755x1.jpg"}], "artist": "Coolio"}