{"songs": [{"title": "We as Americans", "album": "Straight from the Lab", "year": "2003-11-07", "lyrics": "[Intro]\nThere's an intruder in my house\nHe cut my phone line: can't dial out\nI scream for police, but I doubt\nThey're gonna hear me when I shout\n\n[Verse 1]\nA couple of cocktails'll send me to jail\nThere's a couple of cops hot on my trail\nBut this time, when I get pulled over\nThere's a Doberman Pinscher and a Pit Bull in the seat\nThese pigs'll get bit foolin' with me, quit foolin' with me\nBitch, you're gonna see, no pistol in the seat\nWhy it always gotta be an issue when you're me?\nAnd which you're gonna see\nIn the long run, I'ma be the wrong one\nYou wanna harass with this limo-tinted glass\nFlashin' that flashlight on my ass — where was you at\nLast night when them assholes ran up on my grass?\nRapper slash actor, kiss the crack of my cracker slash ass\nThey took away my right to bear arms\nWhat I'm 'posed to fight with, bare palms?\nYeah, right! They comin' with bombs\nI'm comin' with flare guns; we as Americans\n\n[Hook]\nWe as Americans, us as a citizen\nGotta protect ourselves, look at how shit has been\nWe better check ourselves\nLivin' up in these streets\nThrough worse and through better health\nSurvivin' by any means\nWe as Americans, us as a citizen\nWe are samaritans, what do we get us in?\nWe better check ourselves\nLook at how shit has been\nTake a look where you live\nThis is America, and we are Americans\n\n[Verse 2]\nI make beaucoup bucks, wearin' beaucoup vests\nDrama hangin' over my head like a voodoo hex\nI coulda been next to fly over the cuckoo's nest\nWith you-know-who, with an S tatooed to my chest\nBut I've finessed it, now I've got the industry pissy\nEver since me and Dre split it fifty-fifty on 50\nIt's funny, we got a buzz spreadin' quicker\nThan makin' paper airplanes out of a twenty\nFuck money! I don't rap for dead presidents\nI'd rather see the President [dead]\nIt's never been said, but I set precedents\nAnd the standards and they can't stand it\nMy name shoulda been bastard\nThe shit shoulda been plastered\nOn my forehead with a stamp, I shoulda been blasted\nI shoulda been had a cap put in my ass\nBut I'm too swift and fast for that, I'm past it\nI'm too old to go and cruise Gratiot — fuck that shit!\nI done seen how fast this rap shit\nCan turn into some pap-pap shit, that quick, snap click\nBut this time, they got the fucking automatic\nAin't no one gon' test this man — clack-click!\n\n[Hook]\nWe as Americans, us as a citizen\nGotta protect ourselves, look at how shit has been\nWe better check ourselves\nLivin' up in these streets\nThrough worse and through better health\nSurvivin' by any means\nWe as Americans, us as a citizen\nWe are samaritans, what do we get us in?\nWe better check ourselves\nLook at how shit has been\nTake a look where you live\nThis is America, and we are Americans\n\n[Verse 3]\nSshhhhh I got a secret, if you can keep it between us\nI tuck two nina's under my jeans either side of my penis\nUnder my long johns, under my Sean Johns\nOne run-in with the long arm of the law I'm long gone\nI'ma do five years — no less than that, no questions asked\nSo it might be a good idea that I stop right here\nAnd quit while I'm ahead, already in the red\nAlready got a steady infrared meant for my head\nA target on my back, bigger problems than that\nBin Laden on my ass, he probably gon' send a task\nI ain't gon' even ask, they ain't gon' let me pack\nThey ain't gon' give me my semi, but I got my weed back\n\n[Hook]\nWe as Americans, us as a citizen\nGotta protect ourselves, look at how shit has been\nWe better check ourselves\nLivin' up in these streets\nThrough worse and through better health\nSurvivin' by any means\nWe as Americans, us as a citizen\nWe are samaritans, what do we get us in?\nWe better check ourselves\nLook at how shit has been\nTake a look where you live\nThis is America, and we are Americans", "image": "https://images.genius.com/ca202e99ed636ab9842ddf5fb603b6af.567x567x1.png"}], "artist": "Eminem"}