{"songs": [{"title": "Metal Lungies", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "[Intro: sample]\nWorld, world, world, premiere, premiere, premiere\nWorld, world, world, premiere, premiere, premiere\n\n[Ghostface Killah]\nWhat these clown niggas hollerin'?\nWhat they need to be hollerin', is \"There go Theodore!\"\nPut the ball down, we can't score\nThey pen shit to blackboards, make queens out of wack broads\nYou see us comin'? Fuck that Fam shit, just pass off, you bitch\nCrystal' Dana Dane's wrapped around your neck\nLookin' rich, baow, you fucked up now\nSee my gun, nigga? This baby got stuffed uptown\nShouted out, made a whole safe with the pump root pounds\nMy buddy, keep my gun, right next to my tummy\nAsk the click, yo, they spit metal lungies\nDetach wigs, kill flunkies off contact, sonsee\nDidn't mommy tell y'all niggas to wear clean undies?\nSee y'all should have listened to her\nShe knew her son had a big mouth, and some day death would occur\nPlease for Ms. Gale's sake, and her seeds\nPastor Freddy ain't fuckin' around, they knocked him with weed\n\n[Hook: Ghostface Killah]\nUh-oh (word up)\nIt's them (what you talkin' bout, baby?)\nReal kids spit that shit\n\n[Sheek Louch]\nLet's go, let's go, let's go, yo, yeah\nMe and Starks clear projects parks\nWith our '93 shit, army coat green and light tan Clarks\nNiggas think I'm lucky, bitches wanna fuck me\nAnd put me in the tub with them like I'm a rubber ducky\nI got a revolver in the pump about the size of Chucky\nI remember faces easy as I tie my laces\nHere, put the metal in your mouth, like you was rockin' braces\nI spit an iron lungie, yeah, I'm old school like the Iron Monkey\nMy shit powerful enough to lift a fuckin' donkey\nI got heavy chrome, niggas don't care if you live or die\nThey happier that Marbury home\nYa'll niggas better kill me, my street niggas feel me\nLouch gotta eat, ends gotta meet\nThe hard shit you kickin' bout as R&B as Tweet\nThis is Theodore, D-Block, the year adore\nThe sunroof open with the four-four, niggas like..\n\n[Hook: Ghostface Killah]\nUh-oh (word up)\nIt's them (what you talkin' bout, baby?)\nReal kids spit that shit\n\n[Styles P.]\nYeah... nigga this is Ghost with Ghostface\nI don't sell millions but I get millions from the fiends who smoke base\nSomebody leavin' out with a poked face\nTone, you burn him and kick his teeth out, so we don't catch no case\nI'ma make him look like he smoke base\nWe don't leave no trace\nThese rap niggas swear that they so safe\nI don't wanna talk to you holmes, I don't communicate\nMy guns be in my hand more than my phone\nAnd I could dial your number, knock the smile off your face\nWith the H.K. 9, out the all-black hummer\nMetal lungies'll spit the grungiest shit\nHungriest shit, seventeen dummies a clip\nTell them rap niggas to suck my dick, fuck the industry\nIf shit shut down, they'll still bust my shit\nI got some hustlin' ass niggas that'll pump my bricks\nAnd some dust head niggas that'll dump my clips, what?\n\n[Hook: Ghostface Killah]\nUh-oh (word up)\nIt's them (what you talkin' bout, baby?)\nReal kids spit that shit", "image": "https://images.genius.com/1563d407e670f05603a84947a6af2c41.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}