{"songs": [{"title": "Your Gyrl Friend", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "(Girl)\nYeah right, I ain't no motherfucking ho\nMy home girl a ho\nShit nigga, I got my own shit\nAnd I'm tryin' to get up on your mind nigga but shit\n\n(Kurupt)\nJust another day sunny C-A-L, try to pass and tell\nI knew it was your bitch by the way her pussy smell\nBut what's this?\nThis nigga actin just like the bitch\nCause he like the bitch\nHe just like the bitch\nYour girl ain't nothing but a bitch leavin messages on all on nigga's service\nYou actin just like the ho\nActin' like he don't know\nThe all-mighty, ball-blowing, ball blowing- jaws like jaws a lil lower\nYou hit the spot?\nPerfect bitch\nEver seen your bitch when she slurp on dicks?\nWith that birth mark right on her upper thigh\nWith a mouth like that I don't sympathize\nShe do things with her mouth you gotta see wit your own two eyes bitch nigga\nActin surprised\nSee Daz beat the cock\nBut you love the bitch\nShe be eatin dicks and you kissin the bitch\n\n(Chorus [Daz])\nYou know. . .that I know. . .That your gyrlfriend, is a ho\nI know. . .that you know. . .That your gyrlfriend, is my ho\n\n(Kurupt)\nI want it blow\nGet it on\nDrop 6-6 on 5 hoes nigga its on\nCadillac domes\nMagnum and chromes\nPut it on, strap it on\nDont take it off more than 3 days it'll (??)\nGet the whole tip of your dick burned off\nFuck around with that bitch of yours\nShe's no different from the rest of the whores\nMight be nasty, unclassy, sassy, untrustworthy plastic bitch\nAnd you got the nerve to fall in love with the bitch\nAnd actin' like your ballin Captain Fall In Love With a Bitch\nNow you know about the girl that you chose to love\nChillin with the homies, buyin' sacks from K-Dubb\nSmokin' up, chokin' up, payin for the smokin up\nIn the cut, take this game and start soakin up\nLocin' up with Jesus what I see\nWhile Daz takin' your bitch upstairs I be\nWaitin' to fuck, my goddam self\nWith 18 rubbers, cause your bitch is hazardous to health\nAnd you know, like I know, that your trick ass, skanky ass bitch is a ho\n\nChorus\n\n(Daz)\nAny Nigga can get the pussy, (yeah right)\nAll it takes is some time, (yeah that's right!)\nYou can hit it like you want it, (Uhhhh)\nHit up or from behind\n\n(Girl)\nYou ain't sticking that big dick up in my ass uh-uh, that shit looks ferocious\nOh I'm straight nigga. Please Be-weave-it\n\n(Kurupt)\nShut the fuck up bitch\nEat a dick bitch\nEat a bowl of shit bitch\nMunch on a mouthful of balls, in halls and malls\nJust shut the fuck up bitch and work your jaws\nTake a pill bitch, chill bitch\nJerk your jaws\nEat the pussy in then work the walls\nI seen that nigga last week it's like this\nWhat a ho ass nigga, he still in love wit the bitch\n\n(Girl)\nI'm taking yo' punk asses right to the bank, ching ching\n\nChorus\n\n(Girl)\nYeah that's all right though I'm a ho, yeah you know, yeah I'm a ho, yeah ya'll can keep calling me a ho but how you going to get this pussy though\n\nBEITCH!!!! (Fuck You)", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}