{"songs": [{"title": "Buffalo Bill", "album": "Relapse: Refill", "year": "2009-12-21", "lyrics": "[Intro]\nAhh! You sick asshole let me go\nSomebody please! Help!\nOh my God, please help me! Oh\n\"It fits perfect\"\n\n[Verse 1: Eminem]\nBetter watch out, sucka, now I got ya where I want ya\nOnslaught coming and I'm packing in my lunch a\nBunch of missile launchers and a bunch of contra–\nBand, van full of ganja, now come on, jump\nMan, stop moshin' Marshall; oh my God, ya\nDoing the cha-cha and the Cucaracha with a quadra–\nPlegic, boogying down to Frank Sinatra\nLindsay to the Lohan, lick it while you let me watch ya\nWho'da knew the Buddha'd do to me what it's done?\nSuch cynicism when there’s izm in my system\nBlunt hypnotism, lift the spliff up to my lips, son\nSo much on my hands, I got to give my kids a fist bump\nChristo–pher Reeves swimmin' in my swim trunks\n\"Mister – Help me\" is what he said to me and then sunk\nWomen, skinning them and cutting them up in chunks\nIn comes the woman with cocoa butter skin, once\n\n[Chorus]\nOnce again, they call me Buffalo Bill\nBuffalo Bill, Buffa-Buffalo Bill\nSkin 'em up, hem 'em, sew 'em up in those kilts\nUp in those kilts, uppa-up in those kilts\nMan, you don't want to go up in those hills\nUp in those hills, uppa-up in those hills\nYou better beware, stay clear of Buffalo Bill\nBuffalo Bill, Buffa-Buffalo Bill\n\n[Verse 2: Eminem]\nAlways, you can see him lurkin' in the hallways\nCarcasses of Caucasian females in his crawl space\nHow the hell did he fit 'em all into such a small place?\nHide 'em in the wall, well, how long will the drywall take?\nWell, fuck it then, I got nothing but time, I'll wait\nUntil it dries, for the moment, I guess you're all safe\nAfter I sand it and buff it, I guess that I'll paint\nMy chainsaw's out of gas, my regular saw ain't\nNow here I come again, damn stomach rumbling\nYou can even hear the evil spirits coming from within\nSomeone's in the back of my damn house, rummaging\nIt's a girl, she looks pretty thin, but I want her skin\nVinn, on the hunt again, when will it ever end?\nEvelyn, why you trying to fight? You will never win\nSeverin' legs, arms; damn, there goes another limb\nPull the lever then; trap door, death is evident\n\n[Chorus]\nOnce again, they call me Buffalo Bill\nBuffalo Bill, Buffa-Buffalo Bill\nSkin 'em up, hem 'em, sew 'em up in those kilts\nUp in those kilts, uppa-up in those kilts\nMan, you don't want to go up in those hills\nUp in those hills, uppa-up in those hills\nYou better beware, stay clear of Buffalo Bill\nBuffalo Bill, Buffa-Buffalo Bill\n\n[Verse 3: Eminem]\nNow what you know about Buffalo Bill? Nothin', so chill\nFuckin' ho, you better fuckin' hold still\nMake sure none of that lotion in the bucket don't spill\nCut 'em, gut 'em, and just get to stuffin' those girls\nMan, I think she had enough of those pills\nSedate her, then I wait, I come back later\nJust-a clutching those steel\nBlades, baby, when I cut ya don't squeal\nI hate the loud noises, I fuckin' told you!\nI keep hearing voices like\n\"Wouldn't ya like to go and get your butcher knife\nAnd push it right through her\nWhile you put ya shish kebab skewers into her\nBarbecue her, would you do to her what you usually do\nTo a girl who's skin's newer?\"\n(In a world of sin you are, this is turning into a\nTorment tournament of sorts, Christmas ornament you are)\nI'll be sure to Ginsu ya 'til there's no more skin to ya\nBoo-yah! Who ya think you're fucking with?\nDuck, because here he comes again\n\n[Chorus]\nOnce again, they call me Buffalo Bill\nBuffalo Bill, Buffa-Buffalo Bill\nSkin 'em up, hem 'em, sew 'em up in those kilts\nUp in those kilts, uppa-up in those kilts\nMan, you don't want to go up in those hills\nUp in those hills, uppa-up in those hills\nYou better beware, stay clear of Buffalo Bill\nBuffalo Bill, Buffa-Buffalo Bill", "image": "https://images.genius.com/359763f457fb02b0c04642b2422c031f.1000x1000x1.jpg"}], "artist": "Eminem"}