{"songs": [{"title": "Party Crasher", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "Intro: club bouncer\n\nAww shit... not these niggas again!\nAiyyo listen!\nI'm only lettin five of you motherfuckers in here tonight\nIf your man ain't on the guest list\nHe get to the BACJ of the fuckin line\nAnd you know another motherfuckin thing?\nI don't give a fuck if a bitch spill a drink\nIn this motherfucker tonight\nI'm kickin ALL y'all the fuck outta here\n\n[Method Man]\nUhh\nMuh'fuckers be up in the club scared to fuckin death\nNigga if you scared why don't yo' ass just stay the fuck home\nCheck it out uhh\n\nMe and mines at the door, ain't tryin to pay your fees\nStop playin, you fuckin with me, I push my way in\nBum rush there's plenty of us to tear the club up\nGuzzlin Bacardi and such, I split a Dutch\nBouncin nigga lookin like he want war\nNow I ain't the one you got to front Pah\nPattin me down like the law\nAs I stumble in the party\nTopsey off the Limon Bacardi for sure\nLoungin near the bar section, rolled the L\nAnd kept steppin, concealed weapon, razor sharp\nBlue star hatchet, in the sleeve of my jacket\nWho that kid, on the dance floor lookin for matches?\nBurn somethin, one toke got me blasted\nTook another toke then I passed it, choke!\nFantastic, herb ain't no joke\nEspecially that indo smoke mixed with hashish\nLadies on the dance floor, shakin they asses\nGot millon dollar broke niggas, that makin passes\nHoney with the eye glasses, body work is Boombastic\nSkin like blackberry molasses, mmmmm\nAt last it's, time to step and make her mine\nNiggas headin toward the bathroom tuckin they shines\nBrothers got to keep it movin, playin with kids\nThat won't hesitate to snatch a Cuban\nYou know what this is...\n\n(\"Yo Duke that's your diamonds right there God?\nYo that shit'll go RIGHT where my people ain't right now..\"\n\"Yo don't touch my shit!\")\n\nNow it's on in the lavatory, I heard a scream\nEnd of story couldn't find shorty, party scene's\nNow a fucked up chaotic thing, won't be long\nBefore the sirens intervene, the terrotory\nCan't we all get along, without the ruckus\nGot big bouncin muh'fuckers, tryin to rush us\nI can take a hint, what? Can smell the stench\nOf a hell bent environment, the odds against us\nBack to the wall y'all, refuse to fall\nAll hands on deck yes, prepare to brawl\nUhh, every time I try to have a good time why?\nSomebody always fuckin it up, killin my high, damn\nMonkey wrench they whole program, party over\nBy that time I'm dead sober\nIn the midst of this whole shit fo' soldiers, dead gone\nYou can tell that they was heat holders\nEverybody hit the deck when they expose tech, I fled the set\nBitch slipped and caught a broke neck, some Brooklyn kids\nRushed the coat check, they whole set, stompin Duke\nHalf to death and took his Rolex, it's horrible\nLike a front page article, Mister Pitiful\nAbout a step away now we critical, uhh\nAs I boned out I heard the people shout\nNIGGAZ, yea cold turn the party out!\nUh uh uh uh uh uh uh\n\n( sirens )", "image": "https://images.genius.com/7bb2fc25db22a3900f489969a9537f35.954x951x1.jpg"}], "artist": "Method Man"}