{"songs": [{"title": "Unify", "album": "The Art of Storytelling", "year": "1999-03-25", "lyrics": "[Verse 1: Snoop Dogg]\nI falls off into a party in the N.Y.C\nNiggas lookin' at me strange but they lovin' my chain\nBang bang, same thang, game came when I left 'em\nI do it by my lonely, now, I'm the Big Homie\n\n[Verse 2: Slick Rick]\nBut I'm his Royal Slickness, ghetto weakness, 'cause  Rick is\nThe one who expose cornball rappers with the quickness\n(Uhh) Who bum from and who balls you hung from\nWouldn't give a fuck what part of the country you come from\n\n[Verse 3: Snoop Dogg]\nI'm Snoop Dogg, I'm smooth and imperial\nI wake up every mornin' to my Lucky Charms cereal\nTimes get drastic, yeah, I'm a classic\nDogg Pound Gangsta chokin' off that Boombastic\n\n[Verse 4: Slick Rick]\nNow, put my verse on the first one, peep the herds come\nSo, be careful 'cause my rap will make you eat your words, son\n(Word to God) Scratch I? Who the hardest to match? (I)\nBite, rewrite, you're still garbage to Patch Eye\n\n[Verse 5: Snoop Dogg]\nHaven't you heard? I'm loose, shook the Feds like The Juice\nSnoop Dogg is 121st proof\nFool, you's a deuce-deuce of some Genuine Draft\nI'm genuine, like vintage wine and all about cash\nCash, cash, so indeed I got the weed\nAnd keep the lighter for the hash\nHas it ever been a time when you didn't have a dime\nAnd the only way to get it was to go and do a crime?\n\n[Chorus x2]\nMany underclothes hangin' on the hoes\nSince (Snoop, Slick Rick) crushed anyone opposed\nLot of ladies - pop Cristal, toast to all those\nLike (Kid Capri) helpin' to Unify both coasts\n\n[Verse 6: Slick Rick]\nI'm shreddin' ya temper, none 'head of the emperor\nWashed up gang member? Better remember\nI wipe my feet upon a rapper like a doormat\nI hit 'em where they sit around actin hardcore at\nThank God for the guardians, in light of this\nRappers always beg for me to show them who The Mighty is\nGats gonna limp, snaps on a kid\nThat always wanna start rap, boy, they're not gonna win\nAnd wanna dash at lethal or evil\nCould a King bring style and class to black people?\nStick a whole log in and he buggin'\n'Cause I represent self, with my man Snoop Dogg and 'em\nI drop a pile of semen on 'em\nEven in a Yugo, I could take they woman from 'em\nI make the hardest chew they kewl to this\nKid Capri (Yeah?) Notify the peasant who The Ruler is\n\n[Chorus]\n\n[Verse 7: Snoop Dogg]\nI'm 26, still in the mix\nMy hair gettin' longer, my game gettin' stronger\nA nigga been on one, I thank God\n'Cause life in the city of stars is gettin' hard\nAnd it's odd, for a G to get a job\nSo, I'd rather steal and rob and mob with my squad\nMy homie used to bang, now we follow Farrakhan\nUsed to read The Source\nNow all he read is the Holy Qu'ran\nTime brings change and change brings time\nListen to me hit you with this gangbang rhyme\nNigga, whattup? Who up? YOU up!\nDoggy Dogg is on the mic, I'm here to fuck it izzzup\nI give it to y'all, like you really gotta have it\nDogg Pound Gangstaz, boy, this shit is gettin' tragic\nBut I'mma make me a grip and dip quick\nAnd fuck with my nigga Kid Capri on this G shit\nDial tail and bail with my nigga Slick Ricky\nAnd all you niggas talkin' bullshit can just miss me\nCan't twist me, you fuckin' paper haters\nI'm dippin' in my '98 gold Navigator\nI'm dippin' like a lo-lo\nBouncin', smokin ounces', fo' sho', tho\n\n[Chorus x1.5]", "image": "https://images.genius.com/73539fff4e6ebc470e6cab73853f0ac6.1000x1000x1.jpg"}], "artist": "Slick Rick"}