{"songs": [{"title": "Back In The Days", "album": null, "year": null, "lyrics": "Woman:\nJerome!, Jerome!\nPut on that Bobby Womack\n\nMan:\nNaw, Girl I Wanna go way back\nCheck This Out\n\n(Teddy Pendergrass' \"Turn off the lights\" starts)\n\nChorus:\nBack In the days when I was young\nIm not a kid anymore but somedays\nI Sit and wish I was A Kid Again\nBack In the days.....\n\nRoyce Da 5 9\n\n(Verse I)\nBack in the days when I was just a little niggero\nI looked up to my bigger bro begged if I could kick it\nSo when he when out with girls I could go taggin along naggin\nIf she had a sis I could mack a baby hoodrat\nYall remember way back then when it was 1985 all the way live\nI think I was about ten\nOne of those happy little niggas singin the blues\nThat be always tryna bag with the shag and karate shoes\nSayin yo momma black his momma this his momma that\nThen he'd get mad and wanna scrap we'd stay mad about\n10 minutes then its like back on the bike to play Hide and Go Get It\nWith the younger hoes by the bungalos then switch to playin ding dong ditch\nWhen that gets old and too cold to hack it\nThrow on a bomber jacket\nYou could tell the ballas 'cause they bailed wearin Gazelles\nIf they really had money raised we sportin new K's\nAnd all the girls had they turkish link\nIf it broke then they made earrings too\nLike they meant to do it\nBut sometimes I still sit and reminiese and\nThink about the years I was raised back in the days\n\n(Chorus)\n\n(Royce and Others over chorus) (3x)\n(Royce)\nAnd everybody say..\n\n(Others)\nI remember way back when\n\n(Variations)\n\n(Royce)\nWhat?\n\n(Others)\nBack in the days\n\n(Royce)\nWhen?\n\n(Others)\nBack in the days\n\n(Verse II)\nIm still back in the days but now the year is 87, 88 thats\nWhen my crew and I were in Jr. High in 7th grade I hated school\n(Wished it had blown up)\nNo doubt I couldn't wait to get out\n(And be a grown up)\nBut let me finish this reminiscin and tellin\nBout when girls was bailin tight courderoys like\nFor the boys basket weaves, Nike, Cortez, and Footsie Socks\nAnd eatin pickles with Toosie Pops and it dont stop\nIm glad 'cause when J.J. fad that Supersonic\nIt was kinda like a sport, to wear biker shorts\nOr, to wear jeans and it seemed like the masses\nOf hoochies had Poison airbrushed on they asses\nDudes had on Nike suits and the Pumas with the fat laces\n'cause it was either that or K-Swiss\nI miss those days and so I pout like a grown jerk\nWishin all I had to do now was finish homework\nIts true you dont real-a-lize really what you got til its gone\nAnd Im not gonna sing anotha sad song\nBut sometimes I do sit and reminisce then\nThink about the years I was raised\nBack In The Day\n\n(Chorus)\n(The variations w/ royce and others)(2x)\n\n(Verse III)\nWell, its the niggero I figga that now Im all grown up\nBe'cause Im 18 years old and guess you could say Im holdin down\nA steady job, true steady mobbin, you steady bobbin your head\nAnd Im paid so I got it made but\nDidn't always have clout useta live in South\nCentral L.A. thats where I stayed and figured a way out\nI gave it all I had so for what its worth\nI went from rags to riches which is a drag but now Im first\nSo (??? is on our way up)\nYup, we said that we was gonna make it since a kid\nAnd we finally did but\nSometimes I still sit and reminisce then\nThink about the years I was raised\nBack in the days\n\n(Chorus With Variations)", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}