{"songs": [{"title": "Strange", "album": "The Worst: 2K Edition", "year": "2005-03-22", "lyrics": "[Intro: Tech N9ne]\nThe strangest, straight derangest, Stronjay, Stronjay\nUh, MidwestSide... 3DQ Soundlab\n\n[Verse 1: Tech N9ne]\nLet's get it on, rap's new phenomenon\nHit 'em up with the flippers and rupture your dome\nMe calm down, never you say me song sound like Butch?\nYou say I'm washed up? Nigga what, what, what?\nThis is when I kick it, get with this rhythmic Syphilis\nFuck them N9ne rhymes, make 'em go blind every time\nOn that cannabis, anidous, not for a mini mind\nBut the mind of a gauge (high)\nOn stage cause minimum wage has me in a maximum rage\nPage ma-ster scrap, Velociraptor of rap\nSee me, come tight like a pig in a bikini\nPlease! All emcees know I be's on my Q's and P's\nEven Run-D.M.C.'s, I'm a deadly disease\nHigh voltage, just take a look at the psychosis\nDeranged, I claim, damaged plane, atrocious\nFlows be constant, I rock from here to Wisconsin\nMy killer flows makes me jerk my Johnson\n\n[Hook]\nHe's strange and I like it\nHe's strange just the way he is\nTecca Ninna, Tecca Ninna (What's up?)\nWhy you so damn psycho? (Couldn't tell you, baby)\n(Makin' rella, baby, flippin' hella, baby)\n(Ask your nearest fortune teller, baby)\n\n[Verse 2: Tech N9ne]\nMushroom headed, keeps me prophetic\nBut the slow-motion makes me see life like a movie\nThe Bombay brother with the ganja stickin' it\nGonna stick it if you let it\nCome here, but no calming Aaron Donte'\nJust call me the strange or Stran-gé, bombay\nDistinguishing the kcuf of tihs\nFrom hip-hop come this\nApokolips got control of your hips\nIts venomous, how the rap metamorphosis\nMC corpses is around me\nThey found me Jacuzzin' with my sorceresses\nFire up the vapor, get blowed\nAnd roll to a spot with biancs\nThen bust holes and they over\nSo different, they wanna kill me like they killed Bruce Lee\nOn the set, no shit\nSaw my bianca with baguettes\nMiddle West flex flows, likes to sex those\nLittle Wet flesh holes, insane brain games\nNever that plain Jane\n\n[Hook]\n\n[Verse 3]\nI give myself a C-section with a rusty jagged weapon\nBungee wit 100 feet of slack\nIn front of my kids with no discretion\nStrange days like Julia Lewis and Angela Bassett up in a casket\nTrippin' with the 9\nGet your brain blown like a head gasket\nMissouri is in the house for the '99 shot\nFuturistic ladies love me a whole whole lot\nWhen demons try to do me too\nThey know they wicked\nSo I bust and if you ain't down with IIIDQ\nWho be you?\nNina Tech, respect, MidWest Side\nFor life, grab a mic, and hurt ya like a lavia commercial\nThe sound-lab got my microchip screwed\nMalfunction, tihs kcuf ?, now I'm cool\nPain givers, slang spitters, hang niggas, insane triggas\nNo shame, aim triggas, brain brain splitters\nVein slitters, Gain critters, Dame hitters\nWayne livers, narcotical strange nigga!\n\n[Hook]", "image": "https://images.genius.com/a948579698830c97f054acf70a17900c.750x750x1.jpg"}], "artist": "Tech N9ne"}