{"songs": [{"title": "What the Fuck You Want!!", "album": "E.L.E. (Extinction Level Event): The Final World Front", "year": "1998-12-15", "lyrics": "[Intro]\nFlipmode motherfucker, Flipmode motherfucker\nWhat the fuck you want, what the fuck nigga?\nWhat you want, what the fuck nigga ?\n(We gon hit it down like this. nigga what?)\nCheck it out\n\n[Verse 1]\nI be, testing your faith and wrecking your face, invading your space\nAnd watch the tables turn like you're trading a place\nI pull stunts like Evel Knievel, me and my people fly like an eagle\nAnd blow your entire cathedral, hurry hurry, don't worry worry\nHit y'all with a flurry flurry of jabs, leaving y'all niggas blurry blurry\nBrew up some shit like I'm cooking for y'all\nWhen I'm done then I come looking for y'all\n(Huh huh hold up hold up)\nFederal cases cause nuff bodies end up in medical places\nIn they blood finding them chemical traces\nLeaving special investigators going through skeptical phases\nWhile we getting money the decimal changes\nI was a Seventh Day Adventist apprentice\nNow I strike with a vengeance\nBlowing the door right up off of the hinges\nThis be that, \"Put Your Out Of Your Misery\" song\nAnd make you ask your man is this the joint he dissing me on\nThat's when I ask\n\n[Chorus]\nWhat the fuck nigga what you want?\nWhat the fuck nigga what you want?\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga\n\n[Verse 2]\nMoving your muscle and doing the hustle\nSee nowadays we getting money like Russell\nWho really wanna tussle? Challenge the super saber in a nigga\nBlast the challenger way out of space, like Galaga nigga\nBattle star Galactica, cross my diameter nigga\nDerange your whole circular shape, into triangular nigga\nYo, so what it was my fault?\nThat I had to bring this shit to a screaming halt?\nWhat you need to do is open up the vault\nThat's why I make sure, that my vest will be on\nSo when I blast you, and your additional stress will be gone\nThen I sprinkle just a little bit of salt, on your plans\nAnd watch your shit shrivel up right in the palm of my hands\nI ain't afraid of ya, but I thank all of my niggas for saving ya\nI was about to take you back, to when your mother was making ya\nClapping you up, slapping you up, trapping you up\nHolding you hostage, duck taping and Saran wrapping you up\nYo!, first she was sober, I smell aroma\nPut you in a Trans, and slip into an irreversible coma\nFuck y'all cubic zirconium niggas, it's over\nClosing in on all y'all niggas, while we're moving in a little closer Then I evaluate and elaborate, confiscate your shit\nAnd dare your ass to retaliate, that's when I ask\n\n[Chorus]\nWhat the fuck nigga what you want?\nWhat the fuck nigga what you want?\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga\nWhat the fuck nigga what you want?\nWhat the fuck nigga what you want?\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga what you want\nWhat the fuck nigga", "image": "https://images.genius.com/74d986e571f31c27df8d6f3000e2079f.500x500x1.jpg"}], "artist": "Busta Rhymes"}