{"songs": [{"title": "Rub My Back", "album": "The DEFinition", "year": "2004-08-31", "lyrics": "[LL Cool J]\nSippin somethin on the rocks\nI got a shorty that makes the bed hop\nI got plans to spoil you even though you sayin stop\nI'ma drop that phantom on you baby watch\nRoberto Cavali and the Denali, am I hot?\nMalibu Beaches and hydrofoil yachts\nBaddest Mercedes, Lorenzos, and silver fox\nI keep it flowin see we goin to the top\nI'ma get you everything, give a damn how much you tell me stop\nYou want it hotter then we take it 'cross seas\nParty jumpin is bumpin, tokin somethin in Belize\n.. I know you want it sucka free\nKnow you wantin to shine, even though you fightin me\n.. Take it easy player\nTalkin greasy player, know you can feel me player\nUhh.. you put it down tight\nYeah you not havin what you want don't even sound right\n\n[Chorus: Timbaland]\nHey lady!  I'm gonna hit you with a wine Mercedes\nSomebody's gotta work the mouth my baby\nAll you do is rub my back\nRub my back! Rub my back! Rub my back! Rub my back!\nI said MY baby\nWatch television in the Escalade-y\nGo shoppin when you want to baby\nAll you do is rub my back\nRub my back! Rub my back! Rub my back! Rub my back!\nOhh!\n\n[LL Cool J]\nLay down for a while pretty, relax a minute\n.. I caught a feelin when you represented\nGave you that Mercedes, you better get up in it\n.. Get off the corner, come to pop some vintage\nYou never seen a player flip your whole life\nDip the Caddy on the freeway, hittin the strobe light\n.. You got a mean walk at times right?\nI'm here to shine like, I get your mind right\nUhh, Charles Jordan girl if you wanna take a hit\nGotta {?} between the lippers this is it\n.. Lazy, lay back and count the chips\nSome call it trickin or ballin, depends on who you wit\nHim or L baby, so who you gonna pick\nMack motor, I told ya, I want ya livin rich\nYou don't know about a brother\nBlow around a brother, money flow around a brother\n\n[Chorus]\n\n[LL Cool J]\nDon't trip I know you like the rocks\nWanna dip 'round the corner in the drop\nMusic bumpin you frontin although you say you're not\n.. You got your eyes on the watch\nYou love the Pasha, the {?}, the Cartier is hot\n.. Baby you need somethin, shop\nYou got me trippin and goin bananas, baby stop\nI caught a mean one, you never seen one\nShe like cream, how brothers gonna front on me?\nSpoilin somethin the average homey never see\nI mean it's only some money, nuttin to me\n.. But yet and still you question me\nI got it that's if you want it or I'ma set you free\n.. Got 'em in line they beggin me\nBaby regardless your body is killin me\nGirl I'm lovin your anatomy\nYour personality, so whatcha want from me?\n\n[Chorus]", "image": "https://images.genius.com/b42398fade2d37f1bf7eaa68c9bd69dc.1000x1000x1.jpg"}], "artist": "LL Cool J"}