{"songs": [{"title": "One Blood, One Cuzz", "album": "I Wanna Thank Me", "year": "2019-08-16", "lyrics": "[Intro]\nTop of the morning, there's just something I wanted to address real quick. You know, there's a lot of people that didn't, like, really appreciate the Unity Walk yesterday. Don't like peace and all that, and I understand. When I was out there, I didn't understand it either. They couldn't talk peace with me. They tried, and I was like, \"Nigga, that's schoolyard.\" You can't find a home in my generation that put in more work than me. You may find one or two that put in as much as me, but you ain't gon' find none that put in more than me. And I'm here to tell you that shit was worthless, bro. When they try to peace, I don't wanna peace. Look where I'm at. This shit ain't cool, bro. Crazy part of this, you go this way to me, two steps that way, you got 60s. You go two steps this way, you got Bloods. We wait for each when we walk to trial, bro. We united in here. Nigga might not hang with a nigga every day, but we know we got each other's backs. And I don't knock y'all out there that ain't with the peace, but don't get on people that are. Some people's just tired of this shit, bro.\n\n[Chorus]\nOne Blood, one cuz, now put them all together, we got one love\nOne Blood, one cuz, now put them all together, we got one\nOne Blood, one cuz, now put them all together, we got one love\nOne Blood, one cuz, now put them all together, we got one\n\n[Verse 1]\nFor God so loved the world he gave us a good Crip\nThe late, great Neighborhood Nip\nDippin' in this L.A. bullshit\n'Bout as solid of youngsta as a nigga could get (Yup)\nWasn't nothin' like these thug phonies\nWas always showin' love and big respect for all the Blood homies (What up)\nYou understood the values in the youth\nMan, I swear to God, nephew, you was the truth\nDamn, how could this nigga do this?\nIt's 'cause every neighborhood Jesus got a neighborhood Judas\nWho hate to see your team ridin' rich\nYou see that envy and that pride, that's that green-eyed bitch\nWorse than a woman scorned (Damn)\nIt had been better for that man if he had never been born\nBut Mary, don't you mourn, Martha, don't you weep\nYou see, your son still affected us deep\nGive us the faith to take that leap\n\n[Chorus]\nOne Blood, one cuz, now put them all together, we got one love\nOne Blood, one cuz, now put them all together, we got one\nOne Blood, one cuz, now put them all together, we got one love\nOne Blood, one cuz, now put them all together, we got one\n\n[Verse 2]\nAll it take is one, one, one brave Blood and one brave Crip\nStanding up together like we did back on them slave ships\nOut on high sea waves, fighting other whips\nSteady hearing \"Jesus saves\" out of devils lips\nShackled at the hips for the color of our skin\nHundreds of us, yeah, we knew we was brothers then\nBut here we go again, underneath the gun\nThey got us thinkin' we all different when we (One)\nSo I'm givin' thanks to the gangstas, givin' praise to the neighbors\nDamus and Pirus, y'all got the whole world amazed\nSpecial shout out to the Hoovers for showin us how it's done\nAin't nothin' greater than when we unite as (One)\nAin't got no ulterior motives and no other agendas\nFakin' like you with us just like some puppet pretenders\nWe ready to end this\nFor every eye that still cries\nIt's time to realize God will rise when we tie us\n\n[Chorus]\nOne Blood, one cuz, now put them all together, we got one love\nOne Blood, one cuz, now put them all together, we got one\nOne Blood, one cuz, now put them all together, we got one love\nOne Blood, one cuz, now put them all together, we got one\n\n[Outro]\nOne Blood, one cuz, yeah\nOne Blood, one cuz\nNow put them all together, you have one, one, one\nOne Blood, one cuz\nMotherhood, brotherhood, ain't no other hood\nJust imagine if we all was one hood\nNow put them all together, you got one", "image": "https://images.genius.com/e706b466d23f08adcaee1a620528b010.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}