{"songs": [{"title": "Torture", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "[Intro]\nYou know? Through being humbles\nTrue Mast' on the track. Like that, you know?\nBeen in this rap game for like the past..\nFour bullets now, you know? Doing bids, yeah-yeah\nI done peeped a lotta cats come through\nCourageous cats, stray cats, ha-ha\nTop cats with top hats, you know what I'm saying?\nBut it all boils down to this: we talking lyrics\nRhymes, line for line - numero uno, who the best? I don't know\nCheck it\n\n[Verse 1]\nFlame on, I rain fire, when Johnny Storm\nI'm shocking like live wire, you have been warned\nI prolong this next chamber, to make it strong\nAnd prove all them doubters wrong\nKillin 'Em Softly with this song, adding on\nLet them toes get they tag on, dead men run no marathons\nOn my shift, shooting that gift, knowin' he snitched\nOn the telethon, running his lips, sinking the ship\nGive back what his mother gave him, mother made him\nAnd now she can't even save him, Johnny Blaze 'em\nSend him to his final resting\nBack to the essence, Faces of Death, the Final Lesson\n\n[Hook]\nTorture, torture, torture\nMothafuckin' torture, y'all niggas know\n\n[Verse 2]\nWho got John Blaze shit?\nSucking my dick to get famous\nSo I switched Blaze to Dangerous\nWelcome to my torture chambers, torture chambers\nWhere John Doe's remain nameless, hear me?\nI know it's Def Jam, but think clearly\nI made it possible for y'all cats to come near me\nKeep your enemies, close and your heat closer\nI slam just like my culture on all theories\nDead that, straight off the meat rack with this one\nYou get burned playing Nix-on, Hot Biscuit\nStand back, don't make me spit one, and paint pictures\nOn the walls of your mental\nWith hot lead from out these pencils\nIron Lung since I was young and not knowing\nWhere the next meal was coming from, been troublesome\nTo all those posing a threat\nIf I go, everybody gotta go next, y'all niggas know\nThe code of the street soldier, I'm watching time\nAnd time watching me colder, Grim Reaper\nBreathing death on my shoulder\nWaiting for the day to take me over, take me over\n\n[Hook]\n\n[Verse 3]\nThat you can never touch my flow, go 'head and hate me\nStill tryna fuck my ho, Johnny-come-latelies?\nGot me in a world of shit, and now I'm pissed\nMama said there'd be days like this\nThis the Season for Ducks and my pen's bleeding\nLeaving kids barely breathing for sneak-thieving\nFamished from lack of eating and lack of teaching\nBanished from Rhyme and Reason for high treason\nCan it be, that the kid with the knock knees\nGot G to make a grown man cop pleas, for this track\nI got a Lovebug like Starski\nBlow back, until I drop Tical Part 3\nAin't no stopping when you start me, John Jay\nPulling your card, mayday mayday, niggas owe they life to God\nAnd now it's payday, take it how ya wanna take it\nFully clothed or butt-naked, I learned the hard way\nAin't nothing sacred in this world, time to face it\nJohnny Basic, instinct, I'm sure to make it\nWhile others fake it, fuck the spotlight, G-O-D already got light\nSay what you like, just spell my name right\nNo doubt, this one goes out, to all you trout-fish\nCake niggas, keep my dick up out your mouth\n\n[Hook]", "image": "https://images.genius.com/7bb2fc25db22a3900f489969a9537f35.954x951x1.jpg"}], "artist": "Method Man"}