{"songs": [{"title": "Cocaine", "album": "Straight from the Lab Part 2", "year": "2010-12-29", "lyrics": "[Intro: Eminem & (Jazmine Sullivan)]\nYeah. (Oh)\nThis game is like cocaine. (I want this more than anything in the world)\nHaha... So do I... at least I thought I did\n(Got to have it, yeah I need it, I'm addicted, yeah I'm fading fading)\n\n[Verse 1: Eminem]\nThis is a beat with no words at first, it’s a blank painting\nExercising the mind, it’s brain strength training\nIt starts off something like, \"Shady's an insane maniac\nYeah, Slim Shady, that's a zany name, ain't it?\"\nNow all you need's an image to go with the name, baby\nWifebeaters and white t-shirts, Hanes mainly\nIt's a long shot, but is it possible? There's a lane, maybe\nIf not he's gon' have to come and change the whole game, ain't he?\nHe wants the fame so bad he can taste it, he can see his name up in lights\nWomen screaming his fucking name, fainting\nShady did it, he sold out the whole dang stadium\nJoe Shmoe made it, he took his Plain Jane lady\nAnd his baby Hailie out the trailer but he ain't trailing anymore\nHe's ahead of the race, while maintaining his innocence\nLittle does he know his train is derailing\nAnd he's about to be raped by this game anally, now\n\n[Hook: Jazmine Sullivan]\nWhat would you do for a little bit?\nWhat would you give for a little bit of that C-O-C-A-I-N-E?\nI got to have it, yeah I made it, I'm addicted, yeah I'm fading\n(Cause once you cave in, you don't want to leave)\n\n[Verse 2: Eminem]\nYou’re operating on all cylinders, syllables spit like dillingers\nSpilling your guts, people are feeling your mic skills\nBut these haters are ice grilling ya\nWilling to sacrifice anything for the life that they might steal from ya\nFake friends will kill for ya, die for ya but you can’t decipher\nWhy for the life of ya, it wasn’t like this when you were cyphering\nArgue with your wife again, she found Vicodin\nIn your pants last night again, your dispute's public\nNothing is private anymore, oh, and your best friend?\nSay bye-bye to him, what kind of apple you take a bite of Slim?\n(But this is what you wanted Marshall, ain't it?) Fuck no!\nThe way that it turned out was nothin' like the picture that I painted\nIn my head, sometimes a dream and making it's more fun\nThan it's to actually make it, the game stripped me naked\nIt robbed me of ever having another real relationship\nWith another girl, this world is a fucking trip\nAs I slip in another world, proceed, take another hit\nSniff 'til I fucking hurl, tell 'em all to fucking sit\nAnd spin 'til they fucking twirl, middle finger up again\nRelapsing back in this game, oh well, fuck it then, now\n\n[Hook]\n\n[Bridge: Jazmine Sullivan]\nYou start off bright, just to see your name in lights\nJust so you can live the life\nYou take a bite and lose your sight, they call this (fame)\nYou think you're good, just cause you got out the hood\nConcerned only with getting dough, no longer poor\nBut you lost your soul, they call it (fame)\nI hear it callin', my name is callin'\nWhy you struggling when you could be ballin'?\nMy head is saying yes but my feet is stallin'\nSo many walkin' by the end they fallin'\nBut I gots to have it, like Eve and the apple\nShe had to grab it, I got to take it, I got to make it\nThat's the plan and I can't forsake it, yeah\n\n[Hook]", "image": "https://images.genius.com/53169f8d6d2915c59fe20ec0e78227f8.1000x1000x1.jpg"}], "artist": "Eminem"}