{"songs": [{"title": "The Prelude", "album": "Kingdom Come", "year": "2006-11-21", "lyrics": "[Intro: Pain In Da Ass]\nYou know, you've got this fantasy in yo' head about\nGettin' outta the life and settin the corporate world on its ear\nWhat the fuck you gonna do except hustle?\nBesides pimpin', you really ain't got the stomach for that\n\n[Verse: Jay-Z]\nThe game's fucked up\nNigga's beats is bangin', nigga, your hooks did it\nYour lyrics didn't—your gangsta look did it\nSo I would write it if y'all could get it\nBein' intricate'll get you wood, critic\nOn the internet, they like \"You should spit it\"\nI'm like \"You should buy it, nigga that's good business\"\nForget this rap shit, I need a new hustle\nA little bit of everything, the new improved Russell\nI say that reluctantly 'cause I do struggle\nAs you see I can't leave so I do love you\nBut I'm just a hustler disguised as a rapper\nIn fact you can't fit this hustle inside of a wrapper\nBack when crack was\nWhat these pills are, I was a real star\nComplete with real cars, no video ones\nYou can come and set up a camera, let the video run\nAnd my real life, complete with real ice\nVVS boulders all invisibly set\nHead and shoulders, my invisible neck\nYou see Hova wasn't digital yet\nBefo' Steve Jobs made the iPod\nWas getting head jobs, we call that interneck\nBack when rappers wouldn't dare play lyrical roulette\nWith a automatic weapon I was rappin' with a TEC\nFresh like Mannie be, chain like anti-freeze\nShoebox full of cash, dealer man hand me keys\nPantries full of Arm & Hammer, don't take Nancy Drew to see\nWhat it do, I'm a damn G\nJust sent a million dollars through a hands free\nThat's big money talk, can you answer me?\nBefore the answer was a 3\nI was down in Georgetown with a Hoya chick, lawyer chick\nSure he's rich now 'cause he saw the shit, all this shit\nThat's why they call him Hov, 'cause he came before all this shit\nBought a 6, quarter seven, skipped on them quarter eights\nBought a 9 for non-stop Glock work all the time\nWoo! Guess who's back?\nSince this is a New Era, got a fresh new hat\nTen year veteran, I've been set\nI've been through with this bullshit game but I never can\nI used to think rappin' at 38 was ill\nBut last year alone I grossed 38 mill'\nI know I ain't quite 38 but still\nThe flow so Special got a .38 feel\nThe real is back, hehehehe", "image": "https://images.genius.com/4371d45b1c52d7dc87e4204ae0aa8373.900x900x1.jpg"}], "artist": "JAY-Z"}