{"songs": [{"title": "Check Out Time", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro: 2Pac]\nAy what time is it nigga?\n(\"I don't know.\")\nOh shit, 12 o'clock\nOh shit, we got to get the fuck up outta here\n(\"Hell yeah.\")\nNigga, it's check out time nigga\nHey call up Kurupt, call Daz room\n(\"Hey there, bitch, where Suge at, nigga?\")\nCall Suge, call all the niggas tell 'em to meet me downstairs\n(\"Where K and them niggas at man?\")\nTell the valet, bring the Benz around\n(\"Ay, y'all seen my shoes?\")\nHey Kurupt, y'all niggas drivin' or y'all flyin' back, whassup?\n(\"Man, I'm rollin' man, fuck that shit.\")\nHey Syke nigga, come on man, get up out the bathroom fool\n(\"Fuck that, I lost some money, nigga.\")\nAw nigga, damn\n\n[Verse 1: 2Pac]\nNow I'm up early in the mornin', breath stinkin' as I'm yawnin'\nJust another sunny day in California\nI got my mind focused on some papers while I'm into sexy capers\nGive a holla to them hoochies last night, that tried to rape us\nWill these rap lyrics take us, plus room all up in Vegas\nI'm a boss playa, death before I let these bitches break us\nLast night was like a fantasy, Alizé and Hennessy\nA hoochie and her homie dirty dancin' with my man and me\nTold her I was interested, picture all the shit we did\nI got her hot and horny, all up on me, what a freaky bitch\nFirst you argued, then I fight it, 'til you lick me where I like it\nGot a nigga all excited, it don't matter, just don't bite it\nI never got to check out the scene\nToo busy tryin' to dig a hole in your jeans\nNow it seems, it's check out time\n\n[Chorus: Natasha Walker]\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\n\n[Collision: 2Pac]\nGotta go, gotta go\nYeah baby, hahaha, it's check it out time!!\nGotta go nigga, gotta go\n(\"Y'all know what time it is!\")\nAy, c'mon man get y'all bags man, call that valet motherfucker\nTell him to get a nigga shit, cause we out this, motherfucker\n\n[Verse 2: Kurupt]\nThey label me an outlaw, so it's time for the panty raid\nMy fantasies came true with Janet on, I'm in a escapade\nBut did it all, end too soon\nAll the homies runnin' through the halls room to room\nSo I assume, since I'm a playa like my nigga Syke\nThen it's only right for me to disappear into the night\nMy game's trump tight\nSo I find time to recline\nSneak in your room, instant Messiah, shit wines of all kinds\nI ain't got that much time\nSo hurry up and pop the Dom and let me hit it from behind\nSince I'm only here for one night\nI got to get you hot and heated\nPlay like Micheal Jackson, and Beat It\nOne more thing I like to mention, I'm done and I'm out\nCause there's someone else who deserves my attention\nSo all the homies round up in the lobby\nCause bustin' bitches is a hobby, nigga\nIt's check out time\n\n[Chorus: Natasha Walker]\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\n\n[Collision: Kurupt]\nAiyyo man 'Pac, ay, where the where the fuck is Daz at man?\nThis nigga locked up or somethin'?\nThe only one not to leave\nYo man, it's check out time, it's time to get out this mother\n(You seem them bitches?)\nWe out man, fuck that shit\nYo Rece! Yo nigga, whassup?\n\n[Verse 3: Big Syke]\nHey, I'm livin' the life of a boss playa\nThe front desk callin' but I'm checkin' out later\nMy behavior is crazy from what you did to me baby\nIf walls could talk, they'd say, you tried to fade me\nI'm puttin' in work, but didn't hurt from the jacuzzi to the bed\nCarressin' your thoughts, cause I'm livin' fed, heard what I said?\nPassion is crashin' the room\nFrom the liquor we consumed I heard a boom\nI'm blackin' out, you're yellin' out 'Big Syke Daddy'\nWe did it in the caddy on the highway, my way\nI'm lost in a dream and so it seemed, to be the night\nFive bottles of Cristal and I'm still tight\nOut of sight from 'Pac and Kurupt\nAs I get it up, once the doors close, you stuck\nIn a heaty, sticky situation\nGet up baby, you ain't on vacation\nIt's check out time\n\n[Chorus: Natasha Walker]\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\n\n[Collision: Big Syke]\nAy, it's check out time\nAy Pac, nigga where my motherfuckin', where my shoes go, nigga?\nWhere my motherfuckin' drawers and shit at man?\nMan, y'all niggas was in here partyin' too fuckin' much\nWhat the fuck y'all doin', nigga?\nKurupt, go tell Daz, man, and Bogart and the rest of them niggas\nC'mon man, niggas is trippin' man\nFront desk all callin' me, tellin' me to get the hell outta here, man\nI ain't got no more money, somebody loan me a hundred\n\n[Chorus: Natasha Walker]\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\nWe gotta go, we gotta go!\n\nWe gotta go!!! oooo!!\nWe gotta, go!!!\nWe, heyyy!\nWe!!, we gotta go!.. haaa!!\nWe gotta, go!! haa!!", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}