{"songs": [{"title": "Dust", "album": null, "year": null, "lyrics": "[Verse 1]\nAshes, dust to dust\nDeath all on her mind, don't let her fuck it up\nFucking with these hoes make you put it up\nAt least Adam and Eve got to bust a nut\nHigh of the blow just bought another nose\nAnd I might pull off in that Ghost like where that nigga go?\nDoctor gave her double D's cause she heard a nigga flow\nWhoa, she move the nigga aside cause he ain't important\nShe turn that\nCigarette to ash and watch it hit the dust\nGirl quit playing yeah you know that nigga boring\nNot too many in leather pants that can fuck with us\nNow let us dance while I throw the dust\nAshes, to dust to dust\nKnow they all throw they hands cause they fuck with us\nSo many bitches bob and weave but they don't bob enough\nNow these bitches mad look what I done started up\nPut that whip outside, I hit the key it started up\nI told them kiss my ass while I hit the dust\nI hit the weed then I hit the gas\nSo much gold you think a nigga broke\nSo we gon' pull of trunk first so that you niggas know\nWith an Irish centerfold but all she know is Adido\nDamn my momma proud a nigga made it out the moat\nWhere the sun always shine yeah but not no more\nWe party in the jungle till its time to go\nSo everybody rumble as they hit the floor\nAnd if the world end it don't matter cause we bout to blow\n\n[Chorus]\nIf the world crashing down, would you be here with me?\nThat's all I would die to see\nIf the world crashing down, would you be here with me?\nThat's all I would die to see\n\n[Verse 2]\nDriving 108 don't crash and hit the rail\nDon't look deep in her eyes you might see hell\n32 to 34 not that O'Neal\nSo many hours, after hours in hotels\nWhat a crazy night, I ran away from home just to change my life\nRemember when my niggas told them owls came out at night\nSo now we bout to touch the sky, just to play in the night\nCaught me standing now I'm in there standing, we staying the night\nDaddy left but that nigga never said goodnight\nMan that wasn't right, now I want all the power\nExpected a lot from that coward\nAnd any second I'm bound to wow ya, all them beats I dealt\nFor like two years momma all them beats I felt\nI can massage my own dick I don't need your help\nAnd I can crash my own whip, I don't need your belt\nTell me where the fuck was you when I couldn't feed myself\nAnd all that wack shit help me be myself\nI swear I never\n\n[Chorus]\nIf the world crashing down, would you be here with me?\nThat's all I would die to see\nIf the world crashing down, would you be here with me?\nThat's all I would die to see", "image": "https://images.genius.com/62d241389823ea14f6a4612f37e29db8.1000x1000x1.jpg"}], "artist": "Travis Scott"}