{"songs": [{"title": "Wild Boy Remix", "album": null, "year": null, "lyrics": "Steve-O:\nYeah Bitch, Yeah Bitch\nI Am Steve-O (Laughs)\nMGK:\nCobain's Back, Yeah\nCobain's Back\nGot All These Crazy White Boys Screaming Cobains Back\n\n(Hook)\nYeah Bitch, Yeah Bitch, Call Me Steve-O\nYeah Bitch, Yeah Bitch, Call Me Steve-O\nI'm A Wild Boy, I'm A I'm A Wild Boy\nI'm A Wild Boy, Fuck An Eighth I Need O's\n(Yeah)\n(2-Chainz!)\n\n2-Chainz Verse:\nYeah Bitch, Yeah Bitch, Call Me 2-Chainz\nEat Yo' Girl, Wear My Necklace, Call It FOOD CHAIN\nI'm A Wild Boy, Been That Way For A While Boy\nAll I Kill Is Beats And Pussy, Still Ain't Went On Trial For It\nSouth Side, My Chain Glowin'\nIf Them Lames Goin', Then I Ain't Goin'\nMy Aim Good, My Pistol Dirty\nShop For Cleavland Like Dish Detergent\nKobe Bryant But The Sicker Version\nBig Meech But The Spitter Version\nStacy Dash But A Thicker Version\nGettin' Head While The Engine Runnin'\nUGH!\n(Meek Milly)\n(MMMMMMM-Maybach Music)\n(Aye)\n\nMeek Mill Verse:\nIma Wild Boy, Strapped Down Like A Cow-Boy\nI'm Really In The Game, You Just A Towel Boy\nI Pull Up In That Thang All On Them Alloids?\nWith So Many Carrots On, Bugs Bunny'll Die For\nYo' Bitch Call Me Steve-O, Cause I Ball Like I'm D-Rose\nMy Neck Be On Sub-Zero, And I Won't Save Her, No Hero\nMy Wrist Done Cost Me A Mirro, Got Yo' Whip On My Wrist\nYou Keep My Name In Yo' Mouth, But It Keep Yo' Bitch On My Dick\nNigga!\n\nMystikal Verse:\nBitch, I Got My Beanie And My Hoodie\nHere Go The Dick, Bet You Know Where To Put It\nI'm Harder Than Buckweed's Head?\nYou Niggas Softer Than Jello Pudding\nI Stack Em' Up, I Keep Countin' Digits\nYou Fallin' Down To London Bridges?\nLaughin' At You Bitches Like Nana-BooBoo\nBITCH, Cause I'm Back Up In Here\nI Rip It Up, I Put It Down When It Get Mean\n2 Chain, Meek Millz With The Nicotine\nGet My Tatt On, Machine Gun Kelly?\nAin't Gotta Tell You How I Act On The 60\nBetcha Don't Ask No Mo'\nPussy Ass Nigga Better Stay In His Place\nIn The Time I Seen One Rapper?\nCruising In The Mutha Fuckin' Rav-4 With An Eighth!\n\n(Hook)\n\nFrench Montana Verse:\nR-R-R-R- Ridin' Wit Them Young Boys, Rollin' Up That O-G\nRather Have A Hothead, Then Ta' Have Some Cold Feet\nHomeboy It's A New Day, All My Jews Is Blu-Ray\nOn Your Wife Like Cool J, Beat It Up Like The New Dre\nMommy Hair Be Too Grown, Fresher Than A NewBorn\nThey Try Ta' Sign A Whole Group, Started From The Group Home\nMovin' Like A Boss Move, MGK, My Dog Fool\nYou Know Ima Wild Boy, Co-Cain CowBoy\n(YEHN)\n(Chea)\n(Yeah)\n\nYo Gotti Verse:\nHadda Show In Cleavland, Long Shut It Down\nTry'd To Gate The Shit, Security Couldn't Control The Crowd?\nBitches On That Drink, My Niggas On That Loud\nNiggas Talkin' Fowl? My Pistol Talkin' POW!\nYeah Bitch, Yeah Bitch, I'm A Dope Boy\nTop Gone, (Dre Pound), Where It Go Boy\nLamb Feta Cheese Sauce 'Scluse Side Broccoli?\nGot That Machine Gun Kelly Ain't Afraid To Cock It?\n\nMachine Gun Kelly Verse:\nEvery Body Shut Up, (Shut Up)\nI'm Never Ready To Do It Different Whenever I Tell Them Bitches To Come Up, (Come Up)\nAnd I Ain't Talkin' Bout The Stance, I'm Talkin' For Air Somebody Let Em' Front Up? (Front Up)\nCall Me Steve-O Bitch, I Put A Nut Up To In Front Of Ya' Mutha's Face Like It's Nothin'\nPuff It Till' My Eyes Yellow When I'm Wit Em' Sun Up, WHAT UP?\nWhat I Need A Shirt Fo? What I Need A Shirt Fo?\nTatt'ed Up From My Head To Toe, Like, What I Need The Shirt Fo?\nWhat Do I Need To Work Fo? I Smack The Boss With My Child Boy\nFLUCKIN' Hoes Like I'm Austin Powers, Givin' Golden Showers, That's WILD BOY!\n(Kellz)\n\n(Hook)\n(I'm A Wild Boy Repeats)\n(Steve-O Laughs)", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}