{"songs": [{"title": "The Cruise", "album": "Taylor Allderdice", "year": "2012-03-13", "lyrics": "Does anybody have regular size papers out there?\nKing size? I'll use those\nLet me see that grinder\n\n[Hook]\nGot the windows down, radio's on\n\n[Verse 1: Wiz Khalifa]\nYou got it all, well at least you think you do\nWhen it's time to ball, niggas better think of you\nYou see the life you wanna live on TV and wanna be a part of it\nSpend every night just popping bottles, pouring drinks in VIP, and you love it\nThe more you make, the more they hate, the more they're fake, don't worry, that's just how the game go\nThe more you make, the more they hate, the more they're fake, but I'm just singin' the same note, playin' the same song\n\n[Hook]\n\n[Verse 2: Wiz Khalifa]\nYou got it all, well at least they think you do (woo, yeah)\nWhen they say workin' hard, man, they better think of you\nCause all these plaques, nigga, that's because of it\nWouldn't have shit if it wasn't for it\nSmokin' on medicinal, spraying ozium to try cover it\nIn the game playin' hard, but I'm just in the game, I ain't in love with it\nY'all niggas tryin' to get famous, a nigga like me tryin' to get fuckin' rich\nFuckin' rich, fuckin' rich, broke ass niggas can't fuck with this\nFuck a deal, when it goes down, got a hundred mill on my bucket list\nY'all niggas gon' keep on hatin' but we ain't gonna stop then\nYou'll catch me in somethin' foreign and the top gon' be droppin'\n\n[Hook]\n\n[Interview: Rob Markman & Wiz Khalifa]\nWhen you think of those, you think of the\nJay Zs, the Diddys and Master P back when he was\nReally, really getting it\nNow, you didn't rank— number 11 is a nice place to land\n\nYeah, that's cool. And I did that on accident\n\nYou tripped and just fell?\n\nNah, forreal, I didn't even do that on purpose bro\nI'm not even stuntin' so imagine when I start tryin'", "image": "https://images.genius.com/cb8d494673bce7114840441aba72863c.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}