{"songs": [{"title": "Respect Power", "album": "Whiteboys (Original Motion Picture Soundtrack)", "year": null, "lyrics": "[Intro: Raekwon]\nWhat's up Big Chris?\nGoin to the store to get the papers. *echoes*\nGot ya, a little love on this one here\nHuh! *laughs* Word on. Word on\n\n[Hook 1: Raekwon]\nCommerical rap niggas get they domes smacked outta\nWe tired of these earthlings acting like they cowards\nWhen you fuck up, we gettin down for ours\nCoast 5 million niggas, sky 'em like twin towers\n\n[Raekwon]\nHennessey, dick kisser\nSlang lord, verbal pain commissioner\nLight fire to names, dame sizzler\nMulti, 40 karat bow tie\nN.Y. national league of big guys with stolen 5's\nAlbums cloud him, phantom of the opera style\nWith loud phones, system, 100 thousand watts in em\nRock rocks, delight exchange like stocks\nBars made like Comstock, dead man's Glock\nHoldin name down, spit a 100 in change now\nRange spin out, damn check The Weather Channel\nThrow the Gilligan on, just strain now, smack lames down\nFuckin with checks, throw the ringer on and blink out\nLink out, how the fuck this money come up short?\nWhat? You sniffed a half a quart?\nDart designer, emblem blow, seat recliner, rewind\nBlack caught an old timer, gold miner\nSpread love to golden glove, foamed up\nBlood, hibernatin with snubs, never rock Lugz\nChill, run tracks like Harriette Tub'\nBugs, spit cum all in ya girlfriend's mug\nMotion picture novel, Donna giones' third brother\nWhat? Bout to buy estate floodin with clubs\nWrapper around me, what's in my lap could seem astoundin\nBroke, but with no hands gone, sleep but soundly\nIt's cold water, rotti tried to drown me\nYou and ya boys surround me\nMeet the sleeper, static-free Downy\nSlang, wildin up, the nigga found me\nSick gowns, rock a sick gown, 4-5th brown\nReady to pop shit now\nThe Earth spinnin like a windmill\nWorkin ya swords, get ya link down\nHit down, cavalry ain't shit now\nValerie, number one asian, ancient from the pink cows\nNow we know how the fuck you think now\nTake off a nugget ring and think how\nBullet tank out\n\n[Hook 2: Raekwon]\nCommerical rap niggas get they domes smacked outta\nWe tired of these earthlings acting like they cowards\nWhen you fuck up, we gettin down for ours\nCoast 5 million niggas, sky like twin towers\nCowards, you gonna learn to respect power\nWe burn by the hour, one burst the remmy got us\n\n[Raekwon]\nCrank shit, Shawshank Redemption scholar\nRoll up, based on dollars, baseball hat, big collar\nChill, watch everybody crowd us, we bout it bouters\nRockwilders, rockin swim towelers\nBurst the 45 power, skate across the Isenhower\nKangol, 50 iguana, nugget trimmed, ice down iguana\nSplit it in half, holdin my anaconda\nBlack Marizana, true Don daughter, hide-out\nStashed in Ghana, guns about the size of ya mama, select drama\nTrauma rap, birds fall asleep, Ghana\nCaeser czar, come out ya rap par'\nFiddle with y'all car\n\n[Hook 2]\n\n[Outro: Raekwon]\nOnce burst the remmy out us...\nOnce burst the remmy out us...", "image": "https://images.genius.com/2561cbbf1a3c2518ad6a82dc5d614235.197x197x1.jpg"}], "artist": "Raekwon"}