{"songs": [{"title": "Cush cologne - feat. rico tha kidd & dj upgrade", "album": null, "year": null, "lyrics": "[Intro/Chorus: repeat 2X]\nShe keep callin me; she cain't leave me alone\nLove the smell of my cush cologne\nYeah she on it, on it\nRidin that thang like a pony, pony\n\n[Too $hort]\nMy cush cologne is in the breeze\nI smell like weed, I ain't smoked no trees\nBut I got - a fat sack in my pocket\nDo me like the purp' girl, smoke it, suck it!\nSwallow it, hold it in\nTake all of it, now you smoke it big\nIt's so big in your neck you wanna blow it out\nTurn you on to some shit you don't know about\nUsed to be a good girl, but you hoein now\nKnowin how niggas from The Town could burn you out\nSmokin back to back and that's a fact\nLike a little groupie she don't know how to act\nSo I break it down, spit a lot of game to her\nI seen her runnin 'round with some lame dues\nTurnin out hoes ain't a thang to me\nI got her hooked on my game and the weed!\n\n[Chorus]\n[Rico Tha Kidd]\nWe in the club and they playin my song\nGirl I see you over there hittin your drop until that clap on\nEd Hardy hat on, dress shirt with the bag on\nI walk past, she said \"Damn daddy that's strong!\"\nThat cush cologne got her hooked\nNow she'll do whatever for a little of that cush\nThat cush? All up in my face like she know me, she phony\nShe really wanna smoke weed and ride that pony\nI boxed the hallway in, now to cush my cologne\nI tell her \"Bitch don't bother me when I'm up in the zone\nI do my thang on stage girl that's how I get paid\nI bust money moves girl while yo' ass renegade!\" Look\n(You know you wanna hit this bud)\n(We keep that [?] but she fuck with us)\n(She only wanna get hiiiiigh)\n(I think that's why)\n\n[Chorus]\n[DJ Upgrade]\nCannabis for men, take the buds off the stem\nRip her clothes off, she's smokin hot, weed hotbox with her friends\nWe puffin on out, dude he 'bout to get backdo'\nThe bomb had me home dictatin like Castro\nShe was on me, the tree just an icebreaker\nRolled both blunts, Swisher sweeter than a Life-Savor\nGave her the chills and the thrill now she like danger\nGettin high and fly with a life changer\nOhh! And I love to watch her hit the weed\nI ain't gon' like, I take the Philly out and picture me\nGot kidnapped and bribed with some weed\nI'm a sucker for THC, That Hersh Cream\nPay taxes? We can play Madden\nKick it like Janikowski then run you like McFadden\nTake it to the black hole, beat her with a black pole\nWatch a sex tape, gettin higher than the Astros\n\n[Chorus]\n\n[Outro: Too $hort]\nYour bitch is on my dick nigga!\nCause I smell good, smoke good\nWe from The Town bitch!", "image": "https://images.genius.com/f7947ca6d18485b4713ba9c89b2980c7.800x800x1.jpg"}], "artist": "Too $hort"}