{"songs": [{"title": "Welcome to the Jungle (Freestyle)", "album": "E.P.I.C. (Every Play is Crucial)", "year": "2011-09-21", "lyrics": "On the battlefield I am the commander in\nThe war between the worlds, time to wheel the cannons in\nI’m out here salamandering\nThey out here slandering\nTry to smear a niggas image, damn who’s the camera man?\nWhere’s the man to man talk\nWhat a fuck? Get up off the nipple, man\nLet your momma have a mammogram\nBusting like Sammy Sam\nNiggas can’t even see me on the beat\nLike a blind pianist at a band exam\nBut fuck a punch line, fuck a metaphor\nFuck the niggas who said that they wasn’t feeling me before\nLife is like a movie, I just write the score\nLet me dumb it down, maybe you can understand me more!\nI got no time for this shock jock, get up above my cock\nPut the mic down, you’re looking sixty four!\nI’m guessing I’m the nigga that they love to hate\nBut they still watch a nigga, and they pay attention more!\nCloser to my words, and closer you observe\nTrying to decipher the flow you niggas know this shit is absurd!\nYou notice every verb and adjective and every syllable\nAnd why compare to me, there is nobody who’s identical\nInstrumental general, Grand Hustle emerald\nI’m ballin’ over here, give a fuck about your interviews\nNiggas talk, hoes too, but they know I’m one of the coldest overall and general\nThe more I ball the more the haters run\nWhen you fuck the game, the problems gonna come\nBack down never, I’m never known to run\nFuck life and get high, that’s what I call overcoming obstacles\nGet up off my tosticles, I got this under control\nI’m callin’ audibles, I know what I gotta do\nWhen you travel on this road, man after a while\nNobody’s on the either side of you\nReaching out the other artists for a wider view\nIn reality artists just don’t have the time for you\nIt is what it is, I don’t take it personal\nBut it’s a jungle out, and lions don’t eat vegetables\nI mean veggies, I’m all about my\nI don’t smoke bap and I’m never on the reggie\nI’m going full speed, but I don’t know where I’m heading\nSo keep up off my yard and never touch my hedges\nI’m on the edge, you should never cross the line\nNiggas feel safe when they’re online\nBut I’m out here touring, they out here keyboarding\nI’m bout to show ya'll what the fuck a high score is\nSo let me do this for east side bitch\nDecatuer GA, camera rolls on six!\nCall it what you want, but real recognize real\nSo to us, niggas don’t even exist!\nAh, Grand Hustle, yeah it’s B.o.B\nSaid free T.I.P, now the nigga back\nSo now we gonna see what’s up and what’s good\nBobby Ray coming to your neighborhood!\nStrange Clouds, dropping soon\nYeah that’s what’s up, good news", "image": "https://images.genius.com/e5a4565350f88e7eb8d8b6e1a5b364fb.500x500x1.jpg"}], "artist": "B.o.B"}