{"songs": [{"title": "Paris, Tokyo (Remix)", "album": null, "year": "2008-09-28", "lyrics": "[Lupe Fiasco]\nNow if you never left Houston get a passport\nNever left Little Haiti get a passport\nIf you live in South Central get a passport\nSo you can see the world\nYeah, and if you rep the five boroughs get a passport\nOr if you're in the Dirty South get a passport\nIf you're on the Westside get a passport\nSo you can see the world\n\n[Pharrell]\nNow I've been known to levitate\nLike a hobo tryna catch a freight\nTo get away, and clear the day\nThen I'll be smilin' at the stars like the hood does cars\nLittle ghetto mind you should travel like a bullet\nFrom your favorite gun's barrel or the Indian's arrow\nMathematically aligned like the pyramids or Pharaohs\nDon't let 'em bring demise like you and your boys are cattle\nFly to Paris, and end up in Tokyo\nLet's start a coalition so even the broke can go\nTo all those that never sold coke before\nAnd with no ambitions to rock or roll\nLet my, people go\nTo broaden their horizons\nSharpen all they minds in\nSharper than the prong or the Neptune's trident\nI'm just ramblin' - I ride my bike in the clouds\nMr. Spielberg, hire me at Amblin\n(To the nigga Pimp C) God bless your life\n(And the creators of the syrup) I hope you're restin' right\nBecause you screwed a lot of lives, kids and wives\nIn my mind I'm goin' \"woo-hoo\" just like The Hives\nBut in my mind, compromise my design\nLike a missin' puzzle piece, make completion hard to find\nHours resuscitated by Capri Sun juice packs\nWoke up singin' N.E.R.D. songs and you can YouTube that\nNow stay away from people that pursuit they lack\nAnd remember your starter kit was this Lupe track\nNow one love (one love) one love (one love)\nHey love, see you in Tokyo\n\n[Q-Tip]\nMy new passport has been issued so I'm ready\nTrekkin the Sahara or grazin the Serengeti\nI am there if there's speakers in the place\nI will see a foreign face\nMy magic carpet shuttles me through the human race\nBut, no matter what's on her mood to foreign district\nMy postcards so you I missed it\nIt bein us, how we would discuss findin treasures\nDeep in choral reefs, Tigerbillies Islands of pleasure\nHoldin you my pretty 'til I get home to our city\nIn this chitty-chitty bang-bang brutal to our bus\nSo I, take it in, the wonderments of the world\nSamplin each cuisine, a dinner without a girl\nPresents for my people like these silly t-shirts\nWhile Rebecca's at the sound check hooked to Mic Works\nI remember days when the dollar was strong\nHopefully it gets better, I won't be gone long - backpack\n\n[Hook: Lupe Fiasco]\nLet's go to sleep in Paris, wake up in Tokyo\nHave a dream in New Orleans, fall in love in Chicago\nMayne, then we can land in the motherland\nCamel back across the desert sands\nThen take a train, to Rome, or home\nBrazil, for real\nWherever I go she goes\n\n[Sarah Green]\nYeah, I'd done seen Paris, and woke up in Tokyo\nBut I'mma always be Sarah Green from the Southside of Chicago\nJust because you on Section 8 and he left\nIt don't mean a thing (\"Girl I can't go nowhere\")\nJust come and take a flight with me\nBaby girl it's a world to see! (girl go on wit all that)\nI never thought the Seven Wonders of the World\nWould be so wonderful (for real?)\nYou got your ghetto pass, now go and get your passport\nAnd make your swagger international (I'll think about it)\nIf you can, catch a flight, you can go, in your mind\nYour destiny, YOU DECIDE! Wherever I go, we go\n\n[Lupe Fiasco]\nOversees, even over here I over seer\nLike I'm tryna stop these slaves from gettin freer\nFrom the truth I never veer see, so, faithfully I steer\nAs I ride through yo' city like Revere, revered\nNow everybody gon' and put yo' hands in the air\nAll you haters with yo' hands in yo' ears - it's okay\nCause later, it will sneak up on you like it's Metal Gear\nPut you in a chokehold and then unconsciously you'll cheer\nRemain upper tier, ain't no cryin down here\nOnly shed is in the back, yard with the tools in it\nMy hood's in disrepair with no schools in it\nAll the food ain't got no fuel in it\nSo crude, that's why I'm duelin it\nSome dude's thinkin what Rasulullah do in it\nNot what they did then, but now what do you do with it?\nI know you sick of all the rat-tat-tat-tat\nWell this the soothin sounds from the backpack rat pack\nSeein Sarah Green from the FNF crew\nTwo from the Child Rebel and the Q\nWhen I be home I resist it like it's Ohms\nI was there, now I'm gone; Shalom!\n\nYeah, and if you rep the Midwest get a passport\nIf you from Detroit get a passport\nIf you from Chi-Town get a passport\nSo you can see the world\nGet that little black girl, a passport\nGet that little black boy, a passport\nIf you ain't got one, get yourself a passport\nSo you can see the world, yeah!", "image": "https://images.genius.com/b04d159056bfeb03408a5691081f46f9.240x240x1.jpg"}], "artist": "Lupe Fiasco"}