{"songs": [{"title": "Duck Down", "album": "Build and Destroy", "year": null, "lyrics": "[Royce Da 5'9\"]\nYeah, haha, yeah\nYeah, I'm on ya phone, ya friends and killers\nYou Capone 'til I comb the village from home to California\nRunnin up on ya Dozen, you cornered\nYou bust and be gone, I send ya mother a dozen begonias\nI make ya boss WISH that he had\nSomethin that's more vicious and I'm killin anything that he HAD\nPast you, I ain't only lyrically killin you BAD\nI'm killin you wit a passion and then I'm sealin your casket SHUT!\nToo many problems followin me sayin\nThat I am the +King+, I am a +dream+, I helps my game\nNot to offend or hurt the work you put it\nMy street niggas feel it, it's self-proclamied\nSo, who wanna creep?  What weakling wanna beef?\n+Ben Franklin+ run the streets, he came in a +hundred+ DEEP!\nYou niggas can keep ya thirty murkers\nI offer 'em all extra money man them niggas is workers\nWhere was them niggas when you had dreads, you liar\nYou Mekhi Phifer, lay on your side like a hyphen\nNigga I ain't built for who bitch, what now?\nTell 'em niggas when I see 'em it's on, they better DUCK (down)\n\n[Chorus: repeat 2X]\nA truce is impossible, fuck you\nIt's over, you was responsible for the drunk you\nYou punk you, when I see you you better DUCK (down)\nBUM!!  Wanted them guns to go boom, boom, boom\n\n[Royce Da 5'9\"]\nYeah, the problem's that all of you did\nSomethin that you can't take back, you all know what it is\nCompete on wax is what we coulda did\nBut you think that ya man is so hard just cause he don't rap\nWhat is the street nigga relatin to combat\nIf he-a put you in the grave then maybe I'm that\nType of nigga like you, I call you a cheapskate\nCause you cheap and when it's beef in the streets you skate\nNigga you can't deny the force\n35 hundred in the streets, all just so you can die on my porch\nPunk!  I will bust my gun 'til the round is finished\nYou gon' kill who I be stickin around for a minute\nPLUS, I'll be on my way; you sound like somebody\nWho sound like somebody, I don't believe NUTTIN you say (say)\nI will make your group feel like SHIT!\nPlus he hang where I hang, nigga I will take your booth\nWe get (down)\n\n[Chorus]", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}