{"songs": [{"title": "Kickflip", "album": null, "year": "2018-05-07", "lyrics": "[Intro]\nThey love it when I talk shit\nI'm a real drunk so\n\n[Chorus]\nThey love it when I talk shit\nI can hit em' with the rap or the rock shit\nCatch me on my skateboard with my Glock, stick\nI can catch a fuck nigga in the kickflip (Hey, pew, pew, pew)\nI feel like wearing all my BAPE shit\nNiggas sad and they feelings on they hate shit\nI'm just sad in my feelings on my hurt shit\nBut fuck the pain I'ma kill it with the perc shit. (Hey, ayy)\n\n\n[Verse 1]\nBoy, I know your pockets hurtin'\nOff the drugs I'ma whole different person\nCalled my ex on the phone, is it worth it? (hey)\nI'll be rich and she'll be hurting\nSo it's worth it, it's worth it\nI remember my momma thought I was a burden\nMom I'm sorry for the trouble since a [?]\nI remember the stress I put you through, yeah, you deserve it\nI remember when you was in the hospital\nYou was the only one I knew that was hurtin'\nNow I'm up in LA, doing drugs, drunk driving, I'm swerving\nPut my seat belt on, loving on that\n'Cause I know you be nervous\nGet me a Goyard bag and I'ma buy you a matching Birkin\nPromise when I owe you money\nI'm turning into a whole different person\n\n[Chorus]\nThey love it when I talk shit\nI can hit em' with the rap or the rock shit\nCatch me on my skateboard with my Glock, stick\nI can catch a fuck nigga in the kickflip (Hey, pew, pew, pew)\nI feel like wearing all my BAPE shit\nNiggas sad and they feelings on they hate shit\nI'm just sad in my feelings on my hurt shit\nBut fuck the pain I'ma kill it with the perc shit. (Hey, ayy)\n\n[Verse 2]\nThey never hurt me like this before\nEvery day I love a different whore\nEvery day I leave a different ho\nThey want the world, I'm so alone\nGot the Louis, Xanny dose\nHopefully that I don't overdoese\nI never fuck with a main girl\n'Cause these bitches do the most\nShe never seen me this high before\nI'm off a perc I need several more\nRockstar, rock dose\nJump in the pussy, feel like I'm Geronimo\nShe be loving all my tattoos\nI don't talk shit, my racks do\nOnly for me, that's cool\nI throw you to my Chiraq goons\nIt could be simple, It could all be so simple\nPay me what you owe or catch my extendo\nIf she don't get a minimum, she get talks like denmo\nI'm in hell tryna dance with the devil\n\n[Chorus]\nThey love it when I talk shit\nI can hit em' with the rap or the rock shit\nCatch me on my skateboard with my Glock, stick\nI can catch a fuck nigga in the kickflip (Hey, pew, pew, pew)\nI feel like wearing all my BAPE shit\nNiggas sad and they feelings on they hate shit\nI'm just sad in my feelings on my hurt shit\nBut fuck the pain I'ma kill it with the perc shit. (Hey, ayy)", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}