{"songs": [{"title": "Krazy", "album": null, "year": "2009-10-29", "lyrics": "[Intro: The Game]\nTimbaland, Game (uhh) Gucci (uhh)\n\n[Hook: Gucci Mane]\nEight girls with me, all dimes, that's crazy\nTimbaland and Game, Gucci Mane, young'n pay me\nThe wheels on my drop-top'll all stay crazy\nAnd my lady's waist small but her butt that's crazy\nCrazy, flyin down the interstate racin\nAmazin, we step off in the club then go crazy\nIt's crazy, she crave me when she know she can't take it\nCrazy, sex game, ice game crazy\n\n[Verse 1: The Game Gucci Mane]\nYeah, that Gucci Mane Louis game crazy\nRed LV bandanna, that's crazy\nBrown Louis belt match the Air Ones gravy\nFly bitch with me like we fresh up out the Navy\nPull up at the club, 22's on the 'cedes\nRoll down the tint, \"Is that Game and Tim?\" Yeah baby\nShe like Eminem, try to do Slim Shady\nTold Gucci that she tryin to have a nigga baby now that's crazy\n\n[Hook: Gucci Mane]\nEight girls with me, all dimes, that's crazy\nTimbaland and Game, Gucci Mane, young'n pay me\nThe wheels on my drop-top'll all stay crazy\nAnd my lady's waist small but her butt that's crazy\nCrazy, flyin down the interstate racin\nAmazin, we step off in the club then go crazy\nIt's crazy, she crave me when she know she can't take it\nCrazy, sex game, ice game crazy\n\n[Verse 2: Gucci Mane]\nBurr, burr, burr! Wowwwww\nLadies say that Gucci's her baby, crazy\nShe want the dick so bad she might pay me, greatly\nLately it been two shows daily, crazy\nThese haters hate but still they can't phase me, crazy\nThere's somethin in the purple leaves bakin\nGarbage full of kush, bills all over my bakery, crazy\nNow international like Macy's, crazy\nDon't want no problems, all my dudes crazy, crazy\n\n[Verse 3: The Game]\nUhhh, got a chauffeur but I ain't lazy\nRed twin Ferraris, Maserati and a May-B\nWhen I bring the Porsche out them bitches go crazy\nFebruary's on it, other niggas ridin basic\nYa ain't stuntin like I'm stuntin nigga face it\nAll white candy paint, my old school racist\nCome through shootin niggas dash like Stacey\nI'm straight jacket, Rain Man, Forrest Gump crazy\nThat's crazy\n\n[Hook: Gucci Mane]\nEight girls with me, all dimes, that's crazy\nTimbaland and Game, Gucci Mane, young'n pay me\nThe wheels on my drop-top'll all stay crazy\nAnd my lady's waist small but her butt that's crazy\nCrazy, flyin down the interstate racin\nAmazin, we step off in the club then go crazy\nIt's crazy, she crave me when she know she can't take it\nCrazy, sex game, ice game crazy\n\n[Verse 4: The Game]\nUhhh (wowwwww) sixes on my Phantom that's crazy\nFresh out the barbershop laced, fade wavy\nWhere I know you from? Nigga fuck you, pay me\nTry to jack me for my chain nigga that's crazy, crazy\n\n[Verse 5: Timbaland]\nHmm, Timbaland chillin with my white wife sippin Bailey's\nIn the black-on-black Maybach like it is slavery\nChillin at the wind on the slot machine daily\n\"That's a girlie, g-girlie machine!\" Nigga you crazy\nOver a hundred thousand dollars on the daily\nOn the slot machine, \"What dawg?\" That's crazy\nLarry Lyle - take this hundred thou' cause this shit don't phase me\nBut watch them niggas in they corner cause they keep pacin\nDon't they know we be strapped like them government agents?\nCause we will be all over them like a tax invasion\nBabe, let me lick on yo' pretty pink raisin\nGet you to screamin and sayin, \"WHOO, this is crazy!\"\n\n[Hook: Gucci Mane]\nEight girls with me, all dimes, that's crazy\nTimbaland and Game, Gucci Mane, young'n pay me\nThe wheels on my drop-top'll all stay crazy\nAnd my lady's waist small but her butt that's crazy\nCrazy, flyin down the interstate racin\nAmazin, we step off in the club then go crazy\nIt's crazy, she crave me when she know she can't take it\nCrazy, sex game, ice game crazy\n\n[Outro: The Game]\n(Wowwwww) 2010\nAnything hot, that's crazy\nMy Lambo, that's crazy\nModel ridin shotgun, that's crazy\nMy watch? Crazy, it's time", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}