{"songs": [{"title": "Right for Me", "album": "SHADYXV", "year": "2014-11-24", "lyrics": "[Verse 1]\nI feel phenomenal as usual\nPharmaceuticals, glue sniffin', pools of vomit at Bonnaroo\nBut I don't know if I'm in Tennessee, Chicago, or Houston\nIn the corner tryin' to seek solitude\nShallow but such a hollow dude\nI won't even swallow solid food\nAlcoholic too, plus I'm on lean like the Tower of Pisa\nTop it off I'm on mushrooms, so fuck all of you!\nRoses are violet, mollies are blue\nLost in a ball of confusion, it's all an illusion\nIt's probably the shrooms I'm on\n‘Cause I think I started hallucinating, ‘cause I just thought I heard Jay Electronica and Odd Future's new shit\nAnd all I could do was follow the music\nAnd end up with Paula Abdul at Lollapalooza\nFillin' water balloons with nail-polish remover\nJust to pop 'em and wallow in fumes\nI feel uptight, I gotta get looser\nAfter I finish polishing off this bottle of booze I got a solution\nConcentrated like orange juice, so I'm not as deluded\n‘Cause all this delusion got me seein' shit\nExcusez-moi, but that hoochie that passed\nYou see her ass? Wouldn't make her my main squeeze\nButt juicier, ass, it belongs in a juicer\nIt's mouth-waterin' too\nSo I walked over to her, like, “I’m Marshall\nWanna try to meet my standards? I'll introduce ya\"\nOh, I'm a misogynist too, but I'm not a masseuse\nBut my attitude is rubbin' off on the youth, uh!\nChronic abuser, and I don't mean a user of marijuana\nI mean verbal assault that I use to smoke all of you losers\nGot a bazooka, a shotgun, a Ruger, a Glock, and a nuke\nAnd a Rottweiler too, and I'm not in the mood, so\nWhen I say I'm bringing the TEC out\nI'm not coming to repair your fuckin' electronic computers\nGod, I'm gonna puke, I'm so gone off the hookah\nI think I swallowed a loofah\nI'm tore up, demolished, I'm fuckin' stoned like Oliver\nLike I looked Medusa in the eyeball to seduce her\nThe thoughts I produce are loony tunes\nThe box of reusable latex gloves and the socks and the shoes\nThat were placed next to Veronica's boobs\nAnd the paycheck stubs that were stuffed in the glove box\nIn a blue Honda with used condoms were clues\nThe girl was just not the one suitable for him\n\n[Hook]\nRight for me, (that will) change me\nRearrange my head to be\nJust right for you and me\nDon’t laugh, please listen to me\n\n[Verse 2]\nThought I’d give in to the pressure\nCollapse and crumble perhaps, relapsing under that\nWell, that's a bunch of crap\nIn the clutch, I'm the Captain Crunch of rap\nAnd I'm sick of acting humble, that's enough of that\nFuck that shit, cut the sack\nLike it's a natural reaction\nThat's why I'm actually trapped in this shoving match\n‘Cause push keeps coming to that\nI can keep getting my ass kicked and coming back\nLike a sarcastic crumpled sack of shit, still mad\nDisgruntled, had some struggles, yeah\nBut that passion and hunger's back\nWhat a fantastic juggling act!\nAnd the way I flip my tongue on the track\nIt's like verbal acrobatics, but in fact\nLast time I tried to pull off a dramatic stunt as drastic\nI fuckin' crashed my hovercraft\nAfter I strapped a duffel bag to my back\nAnd stuffed a massive punchin' bag in it\nAnd an elastic bungee strap, rubber, plaster, a thumb tack\nAnd a piece of plastic bubble wrap\nWent spastic and fuckin' snapped\nJumped and splashed in a puddle of battery acid\nStumbled back, recovered, back flipped\nAnd landed on a gymnastic tumble mat\nAnd for my last trick, lunge on back\nLatch on a NASA shuttle flap, fuckin' snap the rudder in half\nChuckled and laughed, utter my last rebuttal\nAnd just as I'm to come crashin'\nI grab my Go-Go-Gadget inflatable gigantic humongous mattress and ceramic construction hat\nRub my magic mushroom tat\nFor luck, then splat, get up from that\nFace taped to a waste paper basket\nThrow up, then gasp, lungs collapsed\nAnd that's more likely than finding someone that's…\n\n[Hook]\nRight for me, (that will) change me\nRearrange my head to be\nJust right for you and me\nDon’t laugh, please listen to me\n\n[Verse 3]\nCouple of shots of Jäger\nPublic intoxication, dis-fuckin'-combobulation\nFlooded with thoughts of anger\nWhile I was away I know probably some of you got to thinkin'\n\"You're top ten, ain't cha?\"\nStop it, you fuckers are talkin' crazy\nAnd stop interrupting, you're not even up in that conversation\nWhether you're punchin' a clock or famous\nUnderground, pop, or nameless\nWhatever your job is, I give a fuck what's your occupation\nYou're thinkin' just ‘cause you came in with scrubs\nAnd you brought the scalpel and sponge\nThe oxygen tank and the suction and shot the brain surgeon\nStuck in the operating room\nOnce you done swapped your name with him\nSmuggled in Ronald Reagan\nIf you dug him up; Donald Fagen\nWhile juggling waffles, bacon\nA fuckin' McDonalds egg and cheese sausage bagel finagled it\nFlung it across the table\nThen bump it and knock it shake it\nJumped and got in the way, then disrupted my concentration\nI said fuck it and lost my patience\nThey all woke up from sedation\nAin't none of you Dr. Dre, so then what is it got you thinkin'\nYou can fuck with this operation?!\nAftermath, still running hip-hop amazin'\nI'm still pluggin' along\nNo need for an assumption, here's confirmation\nI'm up for the long duration\nI'm just looking for something to walk away with\nSome pocket change and a little integrity\nThough I'll probably be jumpin' across the stage\n'Til I'm fuckin' Madonna's age and\nStuck in an awkward place in my life\nBut I shit you not like I'm plugged up with constipation\nThat day will come\nBefore I finally stumble upon some lady that’s…\n\n[Hook]\nRight for me, (that will) change me\nRearrange my head to be\nJust right for you and me\nDon’t laugh, please listen to me", "image": "https://images.genius.com/acc348ccdf6bd18c7aee7ae7c6c3d865.1000x1000x1.png"}], "artist": "Eminem"}