{"songs": [{"title": "It Ain’t Easy", "album": "Stoned Raiders", "year": "2001-12-04", "lyrics": "[B-Real]\nI remember times I hustle, times I struggle\nTimes I had to get over the everyday shuffle\nPeople trying to muffle my thoughts and all my dreams too\nPeople who I thought were down, and see true\nBut I blame me too 'cos it's a Chronicle\nMy life, I realise I'm responsible for obstacles\nIn front of me, my own self to blame\nBut I worked hard to receive the wealth and fame\nIt's a worthless game, but if you're willing to play\nThere's sharks in the water who are, willing to pay\nThe price of your soul, but if you give it away\nYou silly motherfuckers are all committed to stay\nIt's a cold world, but you still want a part of it\nSo then you'd better fuck around and learn the art of it\nDon't walk through life with your blinders on\n'Cos you'll keep going crazy till your mind is gone\n\nChorus : B-Real (repeat 2x)\n\nIt Ain't Easy\nBut you got people trying, to put you down, believe me\nI keep gaining ground, It Ain't Easy\nHow many times, must you deceive me?\n\n[Sen Dog]\nI been around for many days, of musical mainstays\nCypress, is Worldwide and we like it that way\nYou can't fade-ER, or compare TO\nThe Original Pyscho-Baiter\nGot the next rhyme and we'll check you all later\nCan't nobody fuck with them Cypress Hill Raiders\nHeard it all before and I don't need no more\nAdvice on the game and how to kick hardcore\nPlayed the game out here with the best\nToured around the world and got big respect\nNow, what's (?) all with this year 2000's?\nWe putting the Smackdown and we ain't clowning\nNot many have lasted\nSince we first blasted\nUp on the scene, singing about the dream\nRecruiting for our team, niggas know what I mean\n?Damn?, you defy, when you live or die\n\nChorus (repeat 2x)\n\n[B Real]\nTimes I hated, times I waited\nTimes I went by where I was drunk and faded\nThey said I wouldn't make it, but where are those people now?\nStill hating, creating all the evil now\nYour insecurities are showing, exposing you\nYou're tripping on me and showing emotions too\nDon't you spend your life full of envy, it's deadly\nHeed me, as I spit the venom believe me\n\n[Sen Dog]\nI keep my guard up, and always let you see my rage\nI get pissed, like a pitbull in a cage  (*barking*)\nNot that many can deal with the fury\nAttack and ransack and kill in a hurry\nI kill and observe and go in an instant\nI bring the pain like the Rampart precinct\nI kept it right for the brother in the chullo\nSomething I bump when your gates in the (?)\n\nChorus [B-Real]\n\nIt Ain't Easy\nBut you got people trying, to put you down, believe me\nI keep gaining ground, It Ain't Easy\nHow many times, must you deceive me?\nIt Ain't Easy\nBut you got people trying, to put you down, believe me\nI keep gaining ground, It Ain't Easy\nIt Ain't Easy, yo, It Ain't Easy", "image": "https://images.genius.com/b0e5201adaaa026dce5a41c0cb1c6c5c.300x300x1.jpg"}], "artist": "Cypress Hill"}