{"songs": [{"title": "After That", "album": "Monster", "year": "2014-10-28", "lyrics": "[Intro]\nYou heard me? (You heard me?)\nEsco, the coolest DJ in the world\nYou know what's coming after that M? another M nigga\nA billion\n\n[Chorus: Future]\nI got them young niggas tweaking like where them drugs at (what's comin' after that?)\nI make them old head niggas go get they plug back (woop woop woop)\nYou whipping up in the foreign, them hoes love that (skrrrrttt!)\nYou stack the racks on them stacks and commas come after that (turn up, they gon' come after that!)\nYeah you took a few shots but you know we’ll come after that\n(we gon' come after that)\nI smell that mula, that fetti, I’m coming after that (what's comin' after that?)\nSame for my Bimmer and Benz, see what come after that (we gon' come  after that!)\nI’m living this life of sin, what’s coming after that?\n(woo woo)\n\n[Verse 1: Future]\nOne whip whipped up, ten whips came after that (skrr skrrt)\nTwo bitches came up (come here)\nSeven bitches came after that (turn up)\nRich niggas in this building, rich niggas come after that\nI know you had that bitch but I'ma dock that pussy after that\nFuck niggas say som’n, when I step in jackers come after that\nWhite gold come after that (wow)\nGot Audemars coming after that (wow!)\nPresidentials coming after that, VVS’s coming after that\nGot so much money almost gave myself a rack attack\nOG coming after that, (woah)\nGood kush, lean coming after that (Drank)\nFirst class my flight nigga (yee)\nYou know what else coming after that (hah)\nPrivate jets coming after that, rock star my whole status (hee)\nClearport, no TSA, lil Mexico my drinking place\n\n[Chorus: Future]\nI got them young niggas tweaking like where them drugs at (what's coming after that)\nI make them old head niggas go get they plug back (woo woo)\nYou whipping up in the foreign, them hoes love that (skrrrt)\nYou stack the racks on them stacks and commas come after that  (they gon' come after that!)\nYeah you took a few shots but you know we’ll come after that\nI smell that mulah, that fetti, I’m coming after that\nSame for my Bimmer and Benz, see what come after that\n(yea yea yea!)\nI’m living this life of sin, what’s coming after that?\n\n[Verse 2: Lil Wayne]\nTalk shit, get bapped for that\nShe suck my dick, we don’t kiss after that\nGot to watch my own back, fuck around and get stabbed in that\nHollygrove my habitat, wish I could bring Rabbit back\nHundred shots come after that, call a ho a ho and a rat a rat\nI said a hundred shots come after that, ain’t looking good like cataracts\nI'ma buy me a Cadillac, cause I don’t see where I’m lacking at\nThem feds tryna throw me in the box, I’m like fuck that, throw Jack in that\nI'ma get that pussy wet, her other nigga just dampen that\nHe buy shit, he pamper that, she tapping out when I’m tapping that\nTryna get as high as me nigga, then where the fuck is your scaffold at?\nNiggas flip facts like acrobats, I click clack, what comes after that?\n\n[Chorus: Future]\nI got them young niggas tweaking like where them drugs at\nI make them old head niggas go get they plug back\nYou whipping up in the foreign, them hoes love that\nYou stack the racks on them stacks and commas come after that\nYeah you took a few shots but you know we’ll come after that\nI smell that mula, that fetti, I’m coming after that\nSame for my Bimmer and Benz, see what come after that\nI’m living this life of sin, what’s coming after that?", "image": "https://images.genius.com/adc81ddb71fc3b8fc301fb13d3cb2324.500x500x1.jpg"}], "artist": "Future"}