{"songs": [{"title": "Weed Man (Bonus Track)", "album": "Stoned Raiders", "year": "2001-12-04", "lyrics": "(*Inhale, exhale repeated throughout intro*)\n\n(Intro: B-Real)\nYou know, there are times when, you run out of weed\nThere's no one you can call\nBut at last there is one person you can call - Weed Man\n\n(B-Real)\nI've had drop dates with no weed to smoke\nNo roaches, no nothin' when I need to toke\nDamn, where can I find some shit to puff on\nDamn I need the kye cause it's gettin' tough on me (me)\nCause I'm a lumberjack and tree's\nGet chopped up and packed up and sold to D\nBolo's are free, did you hold one fee?\nHerchers for the herbics no waterin' the seeds\nSome of your friends just really see me\nCause sussin' this, losin' no GHC\nThe pigs always wanna PH me, my gush hits harder than some GHB\nBut some of these swine wanna hit off mine\nI just sit back, recline, and never waste time\nI'm the lead man, you read man, you need man\nCall me and all inhale- \"The Weed Man\"\n\n(Chorus: Sen Dog)\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), gettin' me HIGH!!\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), gettin' me HIGH!!\n\n(B-Real)\nYou can always call me all day, all light\nService with a smile, make you feel all right (yeah!)\nFrom college-heads, co-ex and dreadlocks\nLawyers, teachers, doctors buy my stock\nSo many call on me for what I got\nSo many try to compete to take my spot\nCaked out, how many dimes dropped?\nHow many times I lost one of my plots?\nThe competiton was to knock me out\nThe D.E.A. want to lock me out\nBroke in my home tryin' to sock me out\nBut the true blue stoners never locked me out\nI'm easy to find, call me whenever\nYou need some green and I'll make you feel better\nI'm the lead man, you read man, you need man\nCall me and inhale - \"The Weed Man\"\n\n(Chorus: Sen Dog)\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), gettin' me HIGH!!\n\n(B-Real)\nI'm the most well-loved, bringin' the bud\nStickin' the club up, everybody ridin' my nuts\nWhat? You say you want credit? You must be high\nThere's no free rides on my supply\nUnless you're one of my friends you need no ends\nJust sit back and wait for the joint to begin\nBut if you know someone in need of this weed leaf\nYou can take my number down and beep me\nI'll hook you up if you look me up\nJust don't give my number to a rookie huh!\nThen I'll cut you off and brush you off\nNever trust you and won't dicuss your loss\nI'm the lead man, you read man, you need man\nCall me and inhale - \"The Weed Man\"\n\n(Chorus: Sen Dog)\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), gettin' me HIGH!!\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), Weed Man, Weed Man\n(Inhale, exhale), gettin' me HIGH!!\n\n(Outro: B-Real)\nThere it is motherfuckers, you run out of weed\nCall somebody like me and I'll hook you up\nNo stems, no seeds and things that you don't need\nThat's right! I'm the Weed Man\nDon't trip I got gush, for a high price ho...", "image": "https://images.genius.com/b0e5201adaaa026dce5a41c0cb1c6c5c.300x300x1.jpg"}], "artist": "Cypress Hill"}