{"songs": [{"title": "Smilin’ Faces", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "[Shock G]\nYeah.. aiyyo Kris tell 'em what's up yo\n\n[KRS]\nYo, yo yo, one two!\nComin at you live and direct (that's right)\nDigital Underground kid, you know what's up\n\n[Shock G]\nAiyyo Kris is chillin, Shock G's chillin\nWhat more can we say, about the village\nThe real killers, chillin in the Whi.. I mean the not RIGHT house\nWant me to be they lab white mouse\nThe smile of seedy greedies, deprivin the needies, breakin treaties\nOverseas wildin while they profilin on the TV's\nSome of 'em cool though.. see I like that nigga Bill\nHittin everything in town, and he got that smile down\nNow let's break down the meaning of a smile\nIs it happiness and blissfulness, well let's go down the list\nYou got the real deal for real-real smile\nYou got the phony they don't know me let me hide my feel smile\nThe dumb embarassed smile\nThe ooh she look delicious, yo that girl is lavish smile (uh-huh)\nThen you got the shake your head nah black, that shit was whack smile\nThe across the bar, yeah it's cool, we can hit the sack smile\nThe crack smile, the caught in the act smile\nThe over my shoulder caught you schemin on me delayed react smile\nThe smile you're really glad to see when it comes round\nThe spot's hot, they got you boxed in, it's bout to go down\nYou glance back, your man who packs that once in a while\nGives you the - oh I'm strapped, do your thing, baby I got your back smile\n\n[Chorus: KRS-One]\nSmilin faces, sometimes\nPretend, to be your friend\nSmilin faces, show no traces\nOf the evil, that lurks within\n\n[KRS-One]\nWhaddya think I joke?  Whaddya think I sniff coke?\nMe a wild t'ing like Tone Loc, you better be dope\nWhen the soundclash erupt, rev up, step up to the cut\nWhassup?  I show up to blow up and leave the spot TO' UP\nYou know what?  I'ma go nut, but you know what?  Yeah, so what!\nIt's the regular, when you checkin the, one that perfected the\nSmilin faced people posin as your equal\nKnowin they wanna beat you defeat you and eat you, but they greet you\nWith peace and love, not with the piece but the dove\nNot beneath but above, now the cheek give a hug\nSnug, no grudge, 'til you turn your back and learn the facts\nCalled learnin truth, the tree is only KNOWN by its fruits\nThese smilin faces, in many places, sometime they racist\nSometime they sexist, sometime they want your Lexus\nSometime they be your family members remember\nOh no not my lady, oh no not my fella, with them you thought\nYou'd never ever sever, but they was two-faced - it happens\nWith a whole 'nother agenda but clever to say whatever forever\nLet me make this relationship better, if you real stay real\nBe real, the truth we got to treasure, not these\n\n[Chorus]\n\n[Shock G] And they be lurkin\n[KRS] You know what's up, ha!\n[KRS] KRS-One, Shock Gigga!\n[Shock G] That's me baby\n[KRS] HA HA.. word\n\n[Shock G]\nYo, just let the beat breathe\nUhh.. yeah..\nCause they be lurkin\nNever trust a big butt and a smile baby\nUhh.. keep it goin, ah keep it goin\nYo Kris that's peace baby (uh-huh)\nThey know the deal\nSmile ain't nuttin but an upside down frown (word)\nNever trust a big butt and a smile", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}