{"songs": [{"title": "Intro", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Intro]\nAyo this is the infinite, intelligent, extravagant and eloquent\nThat shit y'all talkin' is irrelevant\nI put it down from the gutter to the tenement\nIt's LL Cool J, nigga, everything I do is excellent\nAnd I got to represent, Q-Boro, the thorough\nY'knawmean? We get down, we get down baby\nCheck this shit out right here, uh\n\n[Verse]\nE Pluribus Unum is the album I'ma drop\nIt'll make your bitch nipples as hard as rocks\nGivin' head to the Glock, pretend it's hard cock\nSplashin' niggas, I came slow through the block\nI, the original, visual, individual\nTen times platinum, your career's lookin' critical\nRich from this, motherfuck bein' a criminal\nLook in your bitch eyes, the vibe is subliminal\nYou wanna freestyle? Fuck that\nI need at least seven figures to even touch that\nBut since everybody was underestimatin' my format\nI dropped Ill Bomb and now niggas want more of that\nAin't a rapper dead or alive fuckin' with me\nAsk the last bitch that tried to come and get me\nTalk about paper, I can talk about broads\nI can talk about movies, I can talk about awards\nFuck the fantasies, yo I got all four\nAnd 2001 will be mine, by law\nWhy'd I name it 'Greatest Of All Times?'\nBecause for fifteen years I kept y'all standin' in line\nLovin' the way I shine and my lyrics combine\nWith the ruggedest, illest beats that Def Jam can find\nFuck them other niggas with their 9 or 10 hits\nMy hits run deep as the emotions of your bitch\nBack in the days it was the M-5 stick\nBut now the Bentley Azure get more whores on the dick\nThis one's for Clue and my Rikers Island niggas\nThat remember when I came through\nThe bing O B C C H D M 2 C 74\nLittle Nasi and the crew, y'all niggas come home\n\n[Outro]\nWord up, the new album gon' be the shit baby\nAin't no doubt about it, E Pluribus Unum\nOut of many, one, The G.O.A.T., Greatest Of All Time...", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}