{"songs": [{"title": "Because the internet Screenplay - Part 3", "album": "because the internet Screenplay", "year": null, "lyrics": "RAP GENIUS NOTE: This is Part 3 of the script, read Parts 1-2 if you have not already\n*******[PLAY SECRET TRACK 9 1/2 [CODED]\u009d NOW]*******\n\n(do not read on while \"Secret track\" plays. Wait until it is finished, then continue reading)\n\nCUT TO:\n\n****[PLAY \"PLAYING AROUND BEFORE THE PARTY STARTS\" NOW]****\n\nINT. MANSION - NIGHT\n\n[VISUAL]\n\nThe Boy sits at his piano; playing randomly, trying to make sense of everything/anything. Steve and Swank talk to Emily and MISLA in the kitchen. They're arguing about driving, or cooking with coconut oil instead of olive oil, or something else they themselves will not care about or remember in a month, year, ten years, 100 years, the age of the universe\n\nThe house is starting to look pretty bad. The cleaners that used to come stopped receiving their payment and stopped coming. Plastic cups are starting to spread like a blue rash across the living room and coffee tables. Every surface has a sticky spot. You used to be able to slide into the kitchen from the living room with a two second run and quick stop. Now, dried alcohol stops you before you even get to the kitchen door. The Boy really loved sliding into the kitchen when he was a kid. It was the closest you could get to having powers\n\n*******[PLAY SONG \"THE PARTY\" AT THIS POINT]*******\n\n[VISUAL]\n\nMinutes go by. People start to crowd around The Boy as he continues on piano. So many people he can't think\n\nFam daps up a kid as he walks in. They then walk over to a closet where Fam opens up a pantry of weed. It's not nostalgic rap video stocked with weed, but there's a lot of weed in there. Fam tosses an ounce of weed at the kid. The kid and his friend smell it and nod. They look to Fam to share a smile of like \"good shit, right?\", but Fam isn't there for em. Fam gives em the \"where's my money you privileged ass-hole\" look. They pull out some hundreds\n\nMisla is sitting knees to chest with a french dude in the center of the pool table. They're eating s'mores\n\nEmily and Steve are jumping over the fire pit like idiots\n\nThere are people saying things, giving opinions, feeling interesting. Everyone has a purpose tonight. It's a great time\n\nBut then:\n\n...this is a waste\n\n       THE BOY: Get\n\n...of time\n\n       THE BOY (CONT'D): Out. Everyone\n\nNo one can hear him. It's a party\n\n\n       THE BOY (CONT'D): Everyone needs to get out. NOW!\n\nPeople start to notice. The Boy gets up from the piano and grabs a pool stick. He quickly walks over to the ipod dock playing music and winds up like it's a bat\n\nSMASH\n\nEveryone stares\n\n       FUCKBOY 2: That's my phone, nigga!\n\nThe Boy looks up. There's a deep inhale, then he starts smashing everything. Glass sprays everywhere, alcohol splashes, people start running out\n\n       SOME DUDE 2: Worldstar!\n\nThe Boy continues hitting things. He's about to come down on somoeone's phone that's lying on the coffee table. He holds the pool cue above his head and lets it down fast\n\nBut right before, someone grabs the cell phone, laying their hand on top of it, daring The Boy to hit the hand. The Boy barely stops in time\nThe hand has a cast on it. The Boy looks up to see a girl (NAOMI) staring at him. She looks mad. The Boy is mad. But not at her. He's trying to look mad at her, but he really looks like \"sorry\"\nEyes locked\nShe slowly takes her phone, making complete eye contact the entire time, then walks out. Everyone stares at this strange interaction\nAs soon as she leaves, The Boy goes back to smashing things\n\n       THE BOY: Get out! Get away!\n\nSome people start running out trying not to get hit. Other people just laugh cause they're high or because they think it's pathetic. They all leave eventually\nThe Boy stands there for a moment. He turns to the bar next to the pool table. There's half a blunt and a bottle of Sriracha sitting there. The Boy takes the bottle and starts squirting it on the pool table\nWhen he's done, he's written: \"ROSCOE'S WETSUIT\"\n\n       FAM: Nice\n\nThe Boy turns. Fam's just sitting there. No one even noticed him. Fam gives him a SMH. The Boy leaves\n\nCUT TO:\n\n*******[PLAY SONG \"NO EXIT\" AT THIS POINT]*******\n\nINT. THE BOY'S ROOM - LATER NIGHT\nThe Boy lays in his bed. Blue and black stripes from the shades fold over his face. He can hear raccoons scurrying outside\nHe sees a spider in the corner of the room. Just sitting in its web\n94\nThe Boy doesn't particularly like or dislike spiders. They're everywhere in the house. It's a big house and it's right next to a reserve. But something about this spider sitting there...it really bothers him. It makes him mad. He can hear the spider. Just sitting there. Getting louder\nI'm going to describe it as emotional tinnitus: when everything is silent and quiet, you can see the empty web you're in. It is annoying. Which is the slowest form of torture\n...The Boy gets up\n\nCUT TO:INT. CAR - NIGHT\nThe Boy drives. I'm not sure where he's driving. He's not sure where he's driving\nHe drives about an hour out into some industrial wasteland-looking nook of Los Angeles\nHe parks his car\n\n[VISUAL]\nThen, barefoot, he sits on the roof of his car and watches the cars pass. Bright lights grow to an explosion then fade out as they pass. He goes into his pocket and holds the \"hackz\" flash drive that we saw on his desk at the beginning\nSomeone spray painted \"ROSCOE'S WETSUIT\" on the side of the bridge. The Boy is not surprised. It's not making more sense, but it's becoming more dependable, which is always nice\nThe Boy realizes he hasn't eaten all day. Maybe that's what's wrong\n\nCUT TO:\nEXT. FATBURGER - NIGHT\nThe Boy orders a burger in the drive thru\nA skinny Latino kid with a Bluetooth hands him the bag. The Boy pulls over to the side and opens the bag. He looks at the burger for a moment\nThe Boy throws the burger out\n\nCUT TO:\nINT. MANSION - NIGHT\nThe Boy walks through the house; locking all the doors and turning off all the lights. It's always a weird feeling to walk around the house at night because most of the walls are glass, so people can see right inside, especially when it's dark. It's pretty hard to even get to the house, it's the highest home on the hill and there's a long winding road before . But at the same time, if someone got up there, it'd be easy to figure out how to get in\nAll the lights are off now\nThe Boy walks over to The Buddha in the middle of the foyer. He sits on the floor next to him with his knees to his chest. Looking out the front door into half the darkness and half his reflection. He used to be terrified of this Buddha. When he was little, he'd run behind the statue like it would jump on him as soon as he past. But He slowly became something like a best friend. Something like that\n\nINT. THE BOY'S ROOM - NIGHT\nThe Boy pours Pelligrino into a wine glass. Then he continues to twist his metal weed grinder in his hand. He takes the top off the grinder and pours the white powder inside the glass. He drinks it, then sits on the foot of the bed and takes off his white T-shirt\nPulling the covers over his body, he looks at the spider in the corner...only it was gone. Where'd it go? Why would it leave? What about its parents? Won't they be sad? What a bout hi s frien ds? W hat ab o u   t all his s t uf f h o w  wa s h  esu p p ose d to ke e  p     all h is s ... .    . . . .....\nRAP GENIUS NOTE: This is the end of Part 3, continue on at Part 4", "image": "https://images.genius.com/85529bbeef5d1dc890a832d5d3953daa.600x600x1.jpg"}], "artist": "Childish Gambino"}