{"songs": [{"title": "Bird Flu", "album": "Back to the Traphouse", "year": "2007-12-09", "lyrics": "[Intro]\nYeahhhhh - it's Gucci!\nGucci, So Icy Entertainment, Atlantic Records man\n(Yeahhhhh) Let's get money man, Zaire\n\n[Verse 1]\nPay me fifteen G's, your track I'll sneeze on it\nHah-choo! I'm rich, say gesundheit bitch\nPlease excuse me miss, pardon my French\nMy necklace look like Crist', your diamonds look like piss\nI spent a quarter million dollars just to look like this\nIn the kitchen cookin chickens, tryin to pay my rent\nGot a cockeyed Bent', and a bowlegged Benz\nPigeon-toed Aston Martin with the off set rims\nI'm not like them, I done outshined him\nI done flatlined him, Gucci I'm still here\nGucci don't drink beer, but he does drink Dom\nHundred thousand dollar murder charge I made bond\nIt's Gucci!\n\n[Hook: repeat 2X]\nI got bird flu shawty, sellin bird's my business (yeah)\nCatch that bird flu shawty, that's a terrible sickness (yeah)\nI got bird flu shawty, in the summer it's Christmas (yeah)\nCatch that bird flu shawty, nigga handle your business (it's Gucci!)\n\n[Verse 2]\nMy chain got pneumonia and watch got the measles\nSellin like the Beatles and my jewelry game Skittles\nBird flu victim, your wife got sicker\nSee I ain't even trippin, cause I cain't even miss it\nGucci Mane lady, crazy karat Jakey\nI'm livin like Baby, more soldiers than the Navy\nIt's Gucci Mane Laflare baby how 'bout that?\nMake it rain on the stage leave yo' stage show wet\nSippin berry Moet, same hue my 'Vette\nGucci Mane how you? Shawty iced out too\nIt's Gucci!\n\n[Hook: repeat 2X]\nI got bird flu shawty, sellin bird's my business (yeah)\nCatch that bird flu shawty, that's a terrible sickness (yeah)\nI got bird flu shawty, in the summer it's Christmas (yeah)\nCatch that bird flu shawty, nigga handle your business (it's Gucci!)\n\n[Verse 3]\nGucci done it, does it, charm Ruben Studdard\nThat's colored, covered, that's flooded, studded\nRing Lynard, Skynard, watch sherbert, pervert\nWhip flagrantly fun, it's an Aston Martin\nIf you tricks didn't notice, watch me don't lose focus\nTrap boys get bricks, athletes gets trophies\nGucci Mane get cake, it's my birthday party\nWant a sweet sixteen? That's two times forty\nWatch look like Diddy's, chain look like 50's\nGucci Mane fuck with me, shawty I move chickens\nShawty I do live it, wanna take ad lib it\nI'm so hood with it, you hip-hop critic\nIt's Gucci!\n\n[Hook: repeat 2X]\nI got bird flu shawty, sellin bird's my business (yeah)\nCatch that bird flu shawty, that's a terrible sickness (yeah)\nI got bird flu shawty, in the summer it's Christmas (yeah)\nCatch that bird flu shawty, nigga handle your business (it's Gucci!)", "image": "https://images.genius.com/1ff1aa9b4b287b01863e51b57220c59e.450x450x1.jpg"}], "artist": "Gucci Mane"}