{"songs": [{"title": "Criminal", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Intro]\nA lot of people ask me stupid fuckin' questions\nA lot of people think that what I say on a record\nOr what I talk about on a record\nThat I actually do in real life or that I believe in it\nOr if I say that I wanna kill somebody\nThat I'm actually gonna do it or that I believe in it\nWell, shit, if you believe that, then I'll kill you\nYou know why? ‘Cause I'm a criminal!\nCriminal! You're goddamn right\nI'm a criminal! Yeah, I'm a criminal!\n\n[Verse 1]\nMy words are like a dagger with a jagged edge\nThat'll stab you in the head, whether you're a fag or lez\nOr a homosex, hermaph or a trans-a-vest\nPants or dress, hate fags? The answer's yes\nHomophobic? Nah, you're just heterophobic\nStarin' at my jeans, watchin' my genitals bulgin' (Ooh!)\nThat's my motherfuckin' balls, you'd better let go of 'em\nThey belong in my scrotum, you'll never get hold of 'em!\n\"Hey, it's me, Versace! Whoops, somebody shot me!\nAnd I was just checkin' the mail, get it? Checkin' the male?\"\nHow many records you expectin' to sell\nAfter your second LP sends you directly to jail?\nCome on, relax, guy! I like gay men\nRight, Ken? Give me an amen! (A-men!)\n\"Please Lord, this boy needs Jesus\nHeal this child, help us destroy these demons\nOh, and please send me a brand new car\nAnd a prostitute while my wife's sick in the hospital\"\nPreacher, preacher! Fifth grade teacher!\nYou can't reach me, my mom can't neither\nYou can't teach me a goddamn thing ‘cause\nI watch TV and Comcast cable\nAnd you ain't able to stop these thoughts\nYou can't stop me from toppin' these charts\nAnd you can't stop me from droppin' each March\nWith a brand new CD for these fuckin' retards (Duh)\nAnd to think, it's just little ol' me\nMr. Don't-Give-a-Fuck still won't leave\n\n[Chorus]\nI'm a criminal!\n‘Cause every time I write a rhyme these people think it's a crime\nTo tell 'em what's on my mind, I guess I'm a criminal!\nI don't gotta say a word, I just flip 'em the bird\nAnd keep goin', I don't take shit from no one\nI'm a criminal!\n‘Cause every time I write a rhyme these people think it's a crime\nTo tell 'em what's on my mind, I guess I'm a criminal!\nI don't gotta say a word, I just flip 'em the bird\nAnd keep goin', I don't take shit from no one\n\n[Verse 2]\nThe mother did drugs, hard liquor, cigarettes and speed\nThe baby came out, disfigured ligaments, indeed\nIt was a seed who would grow up just as crazy as she\nDon't dare make fun of that baby, ‘cause that baby was me\nI'm a criminal, an animal caged who turned crazed\nBut how the fuck you supposed to grow up when you weren't raised?\nSo as I got older and I got a lot taller\nMy dick shrunk smaller, but my balls got larger\nI drank more liquor to fuck you up quicker\nThan you'd wanna fuck me up for sayin' the word—\nMy morals went *thhbbpp* when the president got oral\nSex in his Oval Office on top of his desk off of his own employee\nNow, don't ignore me, you won't avoid me\nYou can't miss me: I'm white, blonde-haired, and my nose is pointy\nI'm the bad guy who makes fun of people that die\nIn plane crashes and laughs as long as it ain't happenin' to him\nSlim Shady, I'm as crazy as Em-\n-inem and Kim combined (The maniac's in)\nIn place of the Doctor ‘cause Dre couldn't make it today\nHe's a little under the weather, so I'm takin' his place (Mm-mm-mmm!)\nOh, that's Dre with an AK to his face\nDon't make me kill him too and spray his brains all over the place\nI told you, Dre, you should've kept that thang put away\nI guess that'll teach you not to let me play with it, eh?\nI'm a criminal!\n\n[Skit]\nDRIVER: Aight look\nEMINEM: Uh-huh\nDRIVER: Just go up in that motherfucker, get the motherfuckin' money and get the fuck up outta there\nEMINEM: Aight\nDRIVER: I’ll be right here waitin' on you\nEMINEM: Aight\nDRIVER: Yo, Em\nEMINEM: What?!\nDRIVER: Don't kill nobody this time\nEMINEM: Awwright… goddamn, this motherfucker gets on my fuckin' nerves!\n{*Whistling*} How you doin'?\nTELLER: Hi, how can I help you?\nEMINEM: Yeah, I need to make a withdrawal\nTELLER: Okay\nEMINEM: Put the fuckin' money in the bag, bitch, and I won’t kill you!\nTELLER: What? Oh my God, don’t kill me!\nEMINEM: I’m not gonna kill you, bitch, quit lookin' around\nTELLER: Don’t kill me, I've got two kids at home don't kill me!\nEMINEM: I said I’m not gonna fuckin' kill you\nTELLER: Don't kill me!\nEMINEM: Hurry the fuck up! {*Gunshot*} Thank you!\n\n[Verse 3]\nWindows tinted on my ride when I drive in it (Go, go, go!)\nSo when I rob a bank, run out and just dive in it\nSo I'll be disguised in it and if anybody identifies\nThe guy in it, I hide for five minutes\nCome back, shoot the eyewitness\nFire at the private eye hired to pry in my business\nDie bitches, bastards, brats, pets\nThis puppy's lucky I didn't blast his ass yet\nIf I ever gave a fuck, I'd shave my nuts\nTuck my dick in between my legs and cluck\nYou motherfuckin' chickens ain't brave enough\nTo say the stuff I say, so just tape it shut\nShit, half the shit I say, I just make it up\nTo make you mad, so kiss my white naked ass\nAnd if it's not a rapper that I make it as\nI'ma be a fuckin' rapist in a Jason mask\n\n[Chorus]\nI'm a criminal!\n‘Cause every time I write a rhyme these people think it's a crime\nTo tell 'em what's on my mind, I guess I'm a criminal!\nI don't gotta say a word, I just flip 'em the bird\nAnd keep goin', I don't take shit from no one\nI'm a criminal!\n‘Cause every time I write a rhyme these people think it's a crime\nTo tell 'em what's on my mind, I guess I'm a criminal!\nI don't gotta say a word, I just flip 'em the bird\nAnd keep goin', I don't take shit from no one\n\n[Chorus]\nI'm a criminal!\n‘Cause every time I write a rhyme these people think it's a crime\nTo tell 'em what's on my mind, I guess I'm a criminal!\nI don't gotta say a word, I just flip 'em the bird\nAnd keep goin', I don't take shit from no one\nI'm a criminal!\n‘Cause every time I write a rhyme these people think it's a crime\nTo tell 'em what's on my mind, I guess I'm a criminal!\nI don't gotta say a word, I just flip 'em the bird\nAnd keep goin', I don't take shit from no one\n\n[Outro]\nI am a criminal!", "image": "https://images.genius.com/e7f2305258d668431f8e250a41f3459f.1000x1000x1.png"}], "artist": "Eminem"}