{"songs": [{"title": "Live in the Sky", "album": "The Leak", "year": "2006-03-28", "lyrics": "[Intro: T.I.]\nWhat's happenin', man? This TIP, you know?\nI'd like to dedicate this song to anybody who done ever lost somebody\nTo the grave, to the streets, to the jail cell...\nI done been in situations where I done had to cope with all three, you know what I'm sayin?\nI feel the only thing I ain't done yet is die, you know?\nBut it ain't how I live while I'm here, it's how I live when I leave, ya dig?\n\n[Chorus: (Jamie Foxx) & T.I.]\n(Life's ups and downs, they come and go)\nBut when I die, I hope I live in the sky\nAll my folk who ain't alive, I hope they live in the sky\nPray to God when I die, that I live in the sky\n(It's true what goes around, comes back you know)\nSo when I die I hope I live in the sky\nAll my folk who ain't survive, may they live in the sky\nTell God, I wanna fly, and let me live in the sky\n\n[Verse 1: T.I.]\nMy cousin Toot ain't have to die right in front of his son\nAnd his wife, he lost his life struggling over a gun\nGive a damn what he done, that's my muhfuckin' folk\nAnd I love that nigga to death, no muhfuckin' joke\nI can feel my eyes fillin', the Lord is my witness\nIf I catch him, I'ma kill him, I made it my business\nBack in the day, you stayed in my business\nTaught me I ain't have to incorporate yay in my business\nCoincidentally, that's why today you not with me\nMy cousin died over some yay, and I miss him\nPlus he at his family house, let's say she the eyewitness\nBut her boyfriend did the shootin', judge gave a life sentence\nI heard that, now I'm dressed up in all black\nShot up the whole apartments, he still ain't brought back\nThe best friend I had in Tremell, I lost that\nGuess your death was a lesson in life, it taught me that\n\n[Chorus: (Jamie Foxx) & T.I.]\n(Life's ups and downs, they come and go)\nBut when I die, I hope I live in the sky\nAll my folk who ain't alive, I hope they live in the sky\nPray to God when I die, that I live in the sky\n(It's true what goes around, comes back you know)\nSo when I die I hope I live in the sky\nAll my folk who ain't survive, may they live in the sky\nTell God, I wanna fly, and let me live in the sky\n\n[Verse 2: T.I.]\nYou ever seen a nigga go to jail and sleep 'til day 2?\nWell, that's how sick I was when Jay-Ru\nFound out the hard way, that wasn't powder that they were tootin'\nOverdosed on heron, died at 22\nIf you ain't heard about your daughter, she smile just like you\nSo cute, even resorts to violence like you\nYou know your baby momma loose, but ha, what can you do?\nAnd I got four myself, yuh, it's been a few\nNow everything I do is for King, Messiah, Deyjah, Domani\nTell the Lord they all I've got, so please don't take them from me\nFrom me standin' in the trap, with carryin' this here cap\nLaughin' at the niggas who serve with no strap\nTell them niggas, man, y'all trippin' with no maps\nGet robbed and ask to borrow my pistol ain't gon' happ'\nMe, you, the crew just fell out over dough and a lil crack\nNever could apologize, you died, that's why they say that\n\n[Chorus: (Jamie Foxx) & T.I.]\n(Life's ups and downs, they come and go)\nBut when I die, I hope I live in the sky\nAll my folk who ain't alive, I hope they live in the sky\nPray to God when I die, that I live in the sky\n(It's true what goes around, comes back you know)\nSo when I die I hope I live in the sky\nAll my folk who ain't survive, may they live in the sky\nTell God, I wanna fly, and let me live in the sky\n\n[Verse 3: T.I.]\nI bet you niggas think I'm livin' it up\nTil you see polices laughin' as they pickin' me up\nWent from seeing how many bitches I could fit in the truck\nTo three hots and a cot, is you kiddin' or what?\nFuck how many millions I got, nigga, so what if I'm hot?\nWhen I got prices on my head, Feds rushin' my spot\nA million haters want me dead, forced to carry a gat\n\"But you's a seven-time felon, what you doin' with that?\"\nIt's a Catch-22, either you lose or you lose\nThat's the way the game structured, for real niggas to suffer\nAnd I ain't never been a buster, always stood on my feet\nLike a man prepared to take whatever coming for me\nA pussy nigga or polices with a warrant for me\nI'm a G, prepared to die for what's important to me\nLook anybody in the eye who say he want it wit' me\nPut up the house and bet the odds if it's comin' from me\nOG's say I need to learn to be patient\nYou telling me with these seven years of probation\nPistol charges and a host of other open cases\nIf niggas only knew the kind of time I was facin'\nI try to keep it to myself, but sometimes I couldn't take it\nGot four kids, the smiles on they faces\nMean more to me than my crown and my bracelet\nTake that away from me, and my life is butt naked\n\n[Chorus: (Jamie Foxx) & T.I.]\n(Life's ups and downs, they come and go)\nBut when I die, I hope I live in the sky\nAll my folk who ain't alive, I hope they live in the sky\nPray to God when I die, that I live in the sky\n(It's true what goes around, comes back you know)\nSo when I die I hope I live in the sky\nAll my folk who ain't survive, may they live in the sky\nTell God, I wanna fly, and let me live in the sky\n\n[Outro: T.I. & Jamie Foxx]\nHey man, I'd like to dedicate this song to my cousin Toot\nAlejandro Tremell Morgan, man\nI miss the shit out you, my nigga\nI'd also like to dedicate this to my homeboy Jay-Ru\nJamar Hendrix, what's happenin'?\nAlso my partner Bankhead, Man Lee Horton, what it is, nigga\nP$C for life, and death\nAnd my lil' homeboy Poncho, and my lil' homeboy Rico\nI shed tears writin' this song, homeboy\nThat's real talk man\nAy, I wanna live in the sky\nLet me live in the sky\nPray to God that I live in the sky\nI want to live in the sky\nI want to live in the sky\nI want to live in the sky\nWhy can't we live in the sky?\nThe sky", "image": "https://images.genius.com/5f31a9a41d6658aafdf3ed2fbca5e85f.600x600x1.jpg"}], "artist": "T.I."}