{"songs": [{"title": "Dream Forever", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Verse 1]\nYou're the only girl who never disrespected me\nYou always know how to bring out the best in me\nCupid shot us separately\nThen we came together, it was destiny\nI love you ‘till there ain’t no loving left in me, definitely\nOur souls will ride together, even when the stars die\nAnd when parted, my heart cries\nIt's angels like you, who make it hard why?\nIt's cause you beautiful, outgoing and smart\nAnd shit you really set the bar high\nAll you bring to me is happy moments\nYou make me feel like I'm cute even though my face got all this acne on it\nThe way I feel for you, you can't revoke it\nCause it changed me, and my family knows it\nDamn, we both just kind of fell into this\nYou gave me proof that heaven exist\nBut tell me, what is love without a headache or twist?\nYou come taunting, every night after twelve when I'm unconscious\nYou never come out when the sun's watching\nBaby, I need you\n\n[Chorus]\nWhere are you? Are you only in my dreams?\nOnly when the moon is shining\nThat's when you are beside me\nGirl, I need you\nAnd that's real\nI don't wanna wake up\nI'll stay asleep (You know baby)\nYour love is all I need\nI'm really hoping I find you\n\n[Verse 2]\nI wake up in the morning with this sensational pain\nIt goes straight to the brain then my day is invaded with rain\nEngraved in my veins is your name, this ain't gonna change\nIt is staying remain unless my heart is deflated and drained\nYour love is magic\nDaydreaming about you is such a habit\nThought I saw you when I was driving\nBut I was stuck in traffic\nIf other girls flirt they're sadly mistaken\nI tell em' scram cause they need to know I'm happily taken\nYou see my love life, it wasn't going well till I found you\nFellas get jealous and doubtful when I tell em' about you\nI know we had our fair share in the past, with selfish lust\nBut once we came together we sealed it and nailed it shut\nYour touch is that of a goddess\nWhen we kiss, I'm at a lack of words\nEspecially when we pull away\nAnd then you smile afterwards\nIn our hearts, we're no different in color\nWe live for each other, I'm glad you're my significant other\nI love you\n\n[Chorus]\nWhere are you? Are you only in my dreams?\nOnly when the moon is shining\nThat's when you are beside me\nGirl, I need you\nAnd that's real\nI don't wanna wake up\nI'll stay asleep (You know baby)\nYour love is all I need\nI'm really hoping I find you\n\n[Verse 3]\nBaby it saddens me to know that you only exist in dreams\nI sit and fiend for you when I'm awake\nAnd it seems like I’ll never be happy unless I sleep\nI failed to see the point in living without you\nIt got me thinking death is sweet\nI’ll never know unless I leap, I guess I reach for the stars\nCause girl I'm in love with you oh so desperately\nWhat I'm about to do I kept discrete\nI rest the cheek on the pillow as I'm counting sheep\nTake me to ecstasy\nI tried to get you out my head, the pain's a lot worse\nI love you more than anything, I won’t even put God first\nYou’re the only reason that I sleep so often\nI'm hurting nights I don’t see you\nI just keep on tossing and turning\nI feel so lost and deserted, you made my life good\nI told you if I had to take a bullet for you, I would\nSo baby here I go with the proof, this is it\nThe moment of truth, only for you *gunshot*\n\n[Bridge]\nWhere are you? Are you only in my dreams?\nI don’t wanna wake up\nI’ll stay asleep (You know baby)\nYour love is all I need\nI’m really hoping to find you\n\n[Outro]\nI don’t wanna wake up\nI don’t wanna, don’t wanna wake up\nI don’t wanna wake up I’ll stay asleep\nI don’t wanna wake up\nI don’t wanna, don’t wanna wake up\nI don’t wanna wake up I’ll stay asleep", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}