{"songs": [{"title": "SUICIDE SEASON", "album": "BEWARE THE BOOK OF ELI", "year": "2018-04-30", "lyrics": "[Intro]\nBurr, I'm gon' slurp her, like a Go-GURT, ayy\nYeaaah, ayy\nWhatchu say? Whatchu say? (Yeah)\nWhatchu say? Whatchu say? (Yeah)\nNatra\n\n[Verse 1]\nSaid I'm older and I'm sober in the middle of October\nLiving like I wanna die but it feel right (Yeah)\nMet a bitch a little older\nLike a bucket, knock her over\nMade me forget about thoughts of suicide (Ayy)\n\n[Chorus]\nSo throw that pussy at me baby\nThrow that pussy at me baby\nMade them legs go up like doors on suicide\n(Made them legs go up like doors on sui- oh)\nThrow that pussy at me baby\nThrow that pussy at me baby (Throw that, throw it)\nLiving life like I wanna die but it feel right, yah (Yeah, ayy)\n\n[Verse 2]\nBitch I'm smooth like grape in juice, okay\nYou smooth like pulp in O and J (Oh)\nI killed that pussy like O and J (Oh)\nLike A-okay (Oh), Like A-okay (Oh)\nMy hunting rifle, A-okay\nI'm hunting down the KKK (Phew-phew-phew, phew)\nTell their mothers and aunties that I am free today (Ayy)\nI'm free today (Ayy), I'm free today (Ayy)\nFuck it up, fuck is up, niggas always nuttin' up\nMan, I'm never shutting up, collared shirt with buttons up\nThe world don't give out love enough, I will be the light of us\nTruths only confinin' us and I will be the guide of us (Yeah)\nFall back to the basics, ayy\nGetting top from two bitches and it is gracious, ayy\nWhat's the location? Great Wall up out in Asia, ayy\nAnd I'm wondering if her daddy is racist, ayy (Hey, hey)\n\n[Bridge]\nGuns up in designer denim (What? What?)\nI think they be Ksubis (Ho-wee)\nYour bitch Icky Vicky (Ho-wee)\nThat hoe got the cooties (Ho-wee)\nOnly time that I would touch her (Ho-wee)\nWhen I give her noogies (Ho-wee)\nEither that or when I'm tryna rub off one my boogies (Ho-wee)\n\n[Chorus]\nSo throw that pussy at me baby (Ho-wee)\nThrow that pussy at me baby (Ho-wee)\nMade them legs go up like doors on suicide\n(Made them legs go up like doors on sui- oh)\nThrow that pussy at me baby (Ho-wee)\nThrow that pussy at me baby (Ho-wee, throw that, throw it)\nYeaaah, ayy", "image": "https://images.genius.com/6e77e87535290914a52b8d3117dde689.275x275x1.jpg"}], "artist": "Ski Mask the Slump God"}