{"songs": [{"title": "Who Killed It?", "album": "Hip Hop Is Dead", "year": "2006-12-19", "lyrics": "[Nas]\nLook here see\nPretty Mike shanked Two-Face Al over some gal\nFound the body dead in the isles\nDeath by strangulation\nMicrophone cord, a dirty broad\nGuess they'll never play it again Sam\nDamn that was my jam\nNow she's on the lam\nShe made it out with 200 grand\nWhat a scam\nWhile these two compete on who's the star of the show\nGolden legs there makes off with the dough\nI read the paper there with Joe the Butcher\n\"He said one glance is all it took ya\nShe's a real looker\nThey say her old mans a bootlegger\nTransporting in any weather\nAnd at this rate we'll never get her.\"\nFellas, think it's time to call it a night\nAll this talk of this mystery dame's gettin' me tight\nThought I saw her in my eyesight, right\nHate to spoil the party\n\"What are you guys havin', the same?\nWaiter another round for the gang.\"\nIt's strange how I always felt outta place\nJoe The Butcher's my ace, but in comes Freckle Face\nSo I said \"See you later.\"\n'Fore I hurt him and his two ugly thumb breakers\nHe met them in Louisiana wrestling gators\nAn idiot can tell they're involved with the caper\nSo I pulled the revolver on my waist up\nBetween the patrol car and the gray truck\nBehind the street lamp was a silouhette\nWhite gloves and a real long cigarette\nWhat do you know all this time she's got me in her scope\nShe spoke, says, \"The devil got you guys by the throat\nYour conspiracy theories won't work without evidence\nThat's the reason why Eric B. is not president.\"\n\nWell what do ya say\n\nYa see?\nYa see?\nYa see?\n\nLook here see\nI know you got soul you're trying to hide it\nHow did you kill a man out in Cypress\nOne Eyed Charlie\nHe only hangs with the criminal minded\nSays you guys did it doggy style is he lyin'\nShe says, \"Walk this way, I'll tell you a children's story.\"\nWe hit the bodega got her a few 40's\nWe jumped in my ride we drove and she cried\nTwisted off the cap there and opened her mouth wide\nSwallowed it, whole bottle's half empty\nDrinks like a fish now she's past tipsy\nThe truth came out as we got to her suave house\nChopped and screwed her mouth and sat me on the couch\nI said, \"It's gettin late, come on, give it to me straight\nWho's ya sponsor lady?\" She says, \"Bill Gates.\"\nWhat are ya born 77 or 78?\nShe says, \"Nah it goes way to an earlier date\nSlave times,\" claims the slaves said rhymes\nBut she fell in love with some fella named Clive\nWho? \"Clive Campbell from Sedgwick Ave, the Bronx.\"\nNow she shows me the cash\nI said who's Clive, don't play with me skirt\nShe said Clive Campbell\nHe's Kool Herc\n\nAh-ha!\nAh-ha!\n\nListen up sweetheart\nNow we gettin somewhere\nAs she's talking, she starts vanishing in thin air\nBut before she dropped the money bag on the floor and died\nShe said if you really love me I'll come back alive", "image": "https://images.genius.com/ff6738f83747060eafd4a7af4964cd8f.1000x1000x1.jpg"}], "artist": "Nas"}