{"songs": [{"title": "How You Like Me Baby", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Ghostface Killah]\nHey miss whattup? Tone got luck\nI wore a lot of jewelry and I never got stuck!\nCats like the way I write, dressed like a superstar\nTake care of family so I don't have stupid cars\nPeace to all the single ladies, struggle with a rough life\nBaby daddy threaten that's aight, check out my man Trife\nRepresent Stapleton, raised in the West\n780 Henderson, now I'm the best\nStoppin all bets, slammin niggas like Barkley\nBack in my reefer days, sellin you parsley\nAlways kept aluminum, bats in the car seat\nThem not show doin them, that's where the NARCs be\nCame to play no games and stay in your lane\nAnd the ratchet's on your brain and fuck entertainment y'all\nThe big spender rock a robe in November\nI never broke but I throw my trees up in the blender\n\n[Hook: repeat 2X]\nYeah, how you like it baby?\nYou want a good time, you alright, you alright?\nC'mon, how you like me baby?\nYou have a good time tonight?\n\n[Ghostface Killah]\nYo~! Better shoe spots, red and blue drops\nI used to serve those, those my rooftops\nDane cracked the window when the fuckin room's hot\nIf my CD was skippin get a different boombox\nNew socks full of Polo, champ rugged low Mocc's\nSo hot, right before I popped the fuckin show stopped\nYou can't box, I seen better hands on an old clock\nThe old ox never marked you, I'mma blow pop\nProphesized Don it's me, aqua blue mink\nAnd my bitch arms'll be, 20 G's scrill\nNiggas like \"Pardon me,\" I'mma be honesty\nYour man with the Dom P more like Sean Connery\nHeard he fight crime like the old man Barnaby\nGivin you the business, crackheads and the wannabeez\nAnd I keep drugs in the Tony Starks pharmacy\nDesperate Housewives slobbin me cause they honor me\n\n[Hook]\n\n[Ghostface Killah - singing]\nHey, Mister! Please let my niggas in\nThugs and my women in, you don't want no problem with meeeEEEE\nWe got them burners on the dancefloor\nGoons is already in, shanks and machetes in\nThree to the head again, Ghost Remy HennesyyyYYYY\nAll y'all haters wit'chall mad for?\n\n[Hook]", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}