{"songs": [{"title": "4, 3, 2, 1 (E-Dub Remix)", "album": null, "year": null, "lyrics": "HUHHHHHH!\n[Erick Sermon] Def Jam, No Limits\n[Master P] No Limit\n[Erick Sermon] Def Squad\n[Redman] Wu-Tang, and beyond\n\n[Redman]\tAiyyo, one two three four five six seven\nBlaze the hot\n[LL Cool J]\ttrizack that sound like heaven\nSeven six five four three two one\nMy mon Meth-Tical come and get some\n\n[Method Man]\nPlayin my position, hot Nixon\nThis one, for all the sick ones, confliction\nPosionous darts sickening, best believe\nFinger itchin with two broke legs, now I'm trippin\nOn MC's cliche, shot that ricochets\nStart trouble bust bubbles, hip to wicked ways\nGotta love me, G-O-D no one above me\nLook good but fuck ugly, tap your jaw\nFrom my Punch Buggy sunnin you\nGot you shittin in your last Huggie, runnin who?\nFuckin punk, get a speed bump comin through\nA single shot make your knees knock, respect Wu\n\n[Redman]\nAiyyo I put it on a nigga, shit it on a nigga\nTurnin Christian to a certified sinner\nThe bomb I release, time pent up (explodes)\nWhile you got set up I was hittin your ex hoe\nShit I kept low, petro' your metro\nPolitic, keep the chickenheads gobblin\nShit I'm drivin in, come with funk halogen\nTerrorize your city, from the spliff committee\nKick ass till both Timberlands turn shitty\nGritty, smack the driver's head in the chin see\nWhen I approach rappers be takin notes\nI drop like I shoulda invented the raincoat\nAbsolut, I love to burn to the roots\nI keep comin til your pour sperm from your boots\nVigilante hardcore to the penis\nTell you fuck you my attitude is anemic\n\n[Canibus]\nI'm the illest nigga alive, watch me prove it\nI snatch your crown witcha head still attatched to it\nCanibus is the type who'll fight for mics\nBeatin niggas to death and beatin dead niggas to life\nWhen you look at me long enough, I start to read your thoughts\nIf the signal was strong enough, and then I'll call your bluff\nLike, \"Yo, how many rhymes you got?\"  I think I'll go on\nFor more Milleniums than Mazda's got on the car lot\nAnd there's nowhere to run ta, when I confront ya\nNigga, I call your bluff like you had a phone number\nWho wanna see Canibus get wild, who wanna act fly and\nGet shot down with a surface-to-air missile\nI take em on in all shapes sizes and forms and spit on\nAnybody who ain't close enough to shit on\nZero to sixty?  I'm already doin a hundred\nWhen I'm blunted and I give it to any nigga that want it\n\n[DMX]\nStay out the dark, cause if I catch you when the sun is down\nRun it clown, come up off that, or I'm gon' gun it down\nWhen in doubt, however skull goes, it's gon' be that\nSee that, that shit'll finish you dawg, believe that\nWhere we at, do your value your life, as much as your possesions?\nDon't be a stupid nigga, learn a lesson\nI'm gon' get you either way, and it's better to live\nLet me get what's between your sock, cause it's, better to give\nThan receive, believe what I say when I tell you\nDon't make me put your somewhere where nobody'll smell you\nAnd when the lights is out, they don't come back on\nThis ain't a flick you ain't gon' come back on, you ain't that strong\nYou knew it was wrong, but you asked for it baby\nYou'se a pink nigga, ski mask for it baby\nSo I can hit you up on front teeth, you think I'm sweet?\nWant heat?  One deep, leave him behind, front seat\n\n[Master P]\nCut my mic on, it's time to get rowdy\nGot homies from the N-O to the N-Y, Bout It Bout It\nI break bread with the ballers\nProfessional killers, and shot callers\nI got game from the South to the West to the East\nTo the middle now remember me\nA young nigga with the gold teeth bumpin\nKeep the crowd jumpin, gotta say something\nUNNNNNNNNNNNNGGGGHHH, now have a Coke and a smile\nThe party don't stop but it get buckwild\nPass the Hennessey and weed, just blaze one\nSee a shorty, let's play one\nFor the cookies you can't be a rookie\nI'm a No Limit Soldier, that's why they book me\nMaster P rock bells, hell\nBut I gotta give it up to my homey LL\n\n[Redman]\tAiyyo, one [Meth] two [Red] three [Meth] four\n[Red] five [Meth] six [Red] seven\nBlaze the hot trizack\n[Method]\tShine like heaven\nSeven [Red] six [Meth] five [Red] four\n[Meth] three [Red] two [Meth] one\n[Redman]\tCome on Mr. Smith, come get some!\n\n[LL Cool J]\nWhen young sons fantasize of borrowing flows\nTell little shorty with the big mouth the bank is closed (yeah, word up)\nThe symbol on my arm is off limits to challengers\nYou hold the rusty swords I swing the Excalibur\nHow dare you step up in my dimension\nYour little ass should be somewher cryin on detention\nWatch your mouth better yet hold your tongue\nI'ma do this shit for free this time this one's for fun\nBlow you to pieces, leave you covered in feces\nWith one thesis (\"LL Cool J is hard\")\nEvery little boy wanna pick up the mic\nAnd try to run with the big boys and live up to the real hype\nBut that's like pickin up a ball, playin with Mike\nSwingin at Ken Griffey or challengin Roy to a fight\nSnappin, you ameteur MC's\nDon't you know I'm like the Dream Team tourin overseas\nFor rappers in my circle I'm a deadly disease\nRingmaster, bringin a tiger cub to his knees (uhh)\nIn the history of rap they've never seen such prominence\nYour naive confidence gets crushed by my dominance (word up)\nNow let's get back to this mic on my arm\nIf it ever left my side it'd transform into a time bomb\nYou don't wanna borrow that, you wanna idolize\nAnd you don't wanna make me mad nigga you wanna socalize\nAnd I'm daring every MC in the game\nTo play yourself out position, and mention my name\nI make a rhyme for every syllable in your name\nGo platinum for every time your grimy ass was on the train\nWatch your mouth don't ever step out of line\nLL Cool J nigga, greatest of all time", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}