{"songs": [{"title": "King", "album": "RGB", "year": "2017-02-25", "lyrics": "[Intro]\nNiggas tried to crucify me\nWe ain't never gon' stop\nWe come from the motherfucking dirt, you can't bury me, nigga\n\n[Verse 1]\n'Member niggas tried to bury me\nKept it real, now they mad at me\nThought the memes would embarrass me\nBut I done really been through tragedy\nMiddle of the jungle where the killers rumble\nHold the chopper up with accuracy\nKnock the power out his battery\nMake his mama feel the agony\nWhen it's beef, who gon' really ride?\nPlay it neutral, nigga switchin' sides\nNiggas worser than these ho bitches\nThey don't really know whose dick to ride\nIn the Bentley with the stick inside\nI can't lose my life in the field\nGotta pay the lights and the bills\nI ain't got time for a cell\nThey threw the book at the kid (the kid)\nYou really can look what they did (they did)\nThat shit just made me a monster\nI took the book and I ran\nI got niggas takin' real L's\nGave 'em life and they booked in the fed\nI put a stack on their phone\nI fill their books up with bread\nOodles and noodles for breakfast\nMade me so young and so reckless\nCome up and they ain't expecting it\nI'm 'bout to teach 'em a lesson\nI'm the one that taught the youngins\nWhen you come from nothin', niggas gon' respect you (they did)\nFrom the muscle, now we flexin'\nFuck it up and then we exit\n\n[Chorus]\nThey know I'ma ride for this shit\nThey know I'ma die for this shit\nI had to get me some money (some money)\nAnd I put the squad on this shit (I did)\nRemember they said I would lose (remember?)\nThem niggas was poppin' and shit (they what?)\nSo fuck 'em, we breaking the rules (rules)\nI'm like LeBron in this shit\nHo!\n\n[Verse 2]\nCame back off of three to one (three to one)\nWho thought that I'd be the one? (who?)\nIn the darkness, I can see the sun\nHeard 'em comin', they ain't even come (pussy)\nI put fear in these niggas' heart (pussies)\nI can hear when these niggas talk (pussies)\nI can hear when they hatin' on me (pussies)\nStill playin' with a bigger heart (ho)\nFuck it, I'ma take the high road (high road)\nKill these niggas with my eyes closed\nOut in Cali with my vatos\nWrap the chicken like a gyro\nI've been trappin' since like '05\nGettin' it and duckin' 5-0\nThey ain't even never see the paper\nThat's Dorito, paper, boy that's nachos\nOn the 'Gram, like it lit (You ain't lit)\nPunch your man, he's a snitch (You a rat)\nPut some money on a nigga head\nLast time I made a hit (bad)\nI've been chillin' tryna get the bread\nTry play me like vic (Suckers!)\nDid him dirty out the rip (prrrr)\nI ain't even wanna trip (ho)\nBullet holes in your car door (car door)\nJust to let you know the war is on (war is on)\nIn my hood it's like a warzone (yeah)\nNiggas really gettin' sparked on (yeah)\nYoung nigga tryna make it out (make it out)\nUsed to have to get our starve on\nBrought the richest to the baddest bitches\nNow I'm pullin' Wraiths with the stars on\n\n[Chorus]\nThey know I'ma ride for this shit\nThey know I'ma die for this shit\nI had to get me some money (some money)\nAnd I put the squad on this shit (I did)\nRemember they said I would lose (remember?)\nThem niggas was poppin' and shit (they what?)\nSo fuck 'em, we breaking the rules (rules)\nI'm like LeBron in this shit\nHo!", "image": "https://images.genius.com/5e18364fd8f31d9674b4505d861ebc8c.500x500x1.jpg"}], "artist": "Meek Mill"}