{"songs": [{"title": "Fuckin’ or What?", "album": "Kiss Tha Game Goodbye", "year": "2001-08-07", "lyrics": "[Intro- Jadakiss]\nWhat's up ma? Is we fuckin' or what?\nHaha, trying to say something tonight baby\nI know everybody ask their chick this question\nIn the house, in the club, in the car, outside, everywhere\n\n(Chorus)\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?\n\n(Jadakiss)\nAin't no need in buying a drink or holding a convo\nIf you ain't coming back to the condo\nIt's damn near 4 in the morning ain't shit to discuss\nTil you ask which dick do you suck\nI'm trying to fuck til it's light outside\nYou feel the same? Get your coat get your friends\nThe truck right outside\nListen ma I wanna ball out\nSo when I nut I expect you to suck it all out\nAnd let my man tear your walls out\nCause he just came home and he need pussy to fall out\nI get it crump ask the fellow players\nKiss hit more hoes than they list in the yellow pages\nIt's never to cuff 'em share 'em right after I fuck 'em\nTo come clean I'm a mellow gangster\nPass a chick like a baton runner to runner\nBeen through a million thongs from summer to summer\nSo you'll never see J stressed they always say yes\nEverynight dog I be bustin a nut\nI just can't stop gettin' the butt\nAnd the only thing I ask girlfriend is we fuckin' or what?\n\n(Chorus)\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?\n\n(Jadakiss)\nLook if you don't like men be out\nAnd if it's all good and you got a girlfriend then we out\nPlease don't hit me with the two worse lines\nHow you don't be doing this or this is your first time\nListen we all grown bitch you came here on your own bitch\nI leave them lawsuits alone bitch\nShe try to tell me she model\nI told her me too you ain't saying nothing slick suck it and swallow\nI just wanna hit you from the back and watch the Apollo\nAnd if the pussys all that I might holla tomorrow\nBut you acting like a rabbit how you cling to the carrots\nIt ain't the bling it's the nigga ma get it and stash it\nCaught a coy, caught a flashback check this out\nBring your girlfriend in the room shorty and lick her asscrack\nAnd even though your toungue stuck in her butt\nThe only thing I wanna know is we fuckin' or what?\n\n(Chorus)\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?\nAll mah stripclub honeys is we fuckin' or what?\nAll mah eat-pill honeys is we fuckin' or what?\nAll mah hoodrat honeys is we fuckin' or what?\nI just wanna know one thing, is we fuckin' or what?", "image": "https://images.genius.com/10bebd5a2f5f59c4db05f28ab2b731dc.574x258x1.jpg"}], "artist": "Jadakiss"}