{"songs": [{"title": "U Don’t Have to Call", "album": "STN MTN / Kauai", "year": "2014-10-03", "lyrics": "[Intro]\nGambino: Yeah, where'd you guys go?\n\nGirls: To where, In Atlanta?\n\nStrip Club Queen: When I used to live here, I was the strip club queen\n\nFam: Wait, wait, so what's up with Follies? Like lemme know\n\nStrip Club Queen: Follies is my favorite strip club ever, in Atlanta\n\nGambino: Follies is the realest\n\nStrip Club Queen: I swear to god-Follies is the realest, more-so because they have international bitches in there, you got bitches from Cambodia, you got bitches from fucking Italy, you got bitches from fucking Africa, you got bitches from...Kansas, you got bitches from everywhere in Follies\n\n[Verse 1: Childish Gambino]\nSituations will arise, in our lives\nBut you gotta be smart about it\nCelebrations, with the guys\nI sacrificed, 'cause you could not sleep without it\nGirl I, 'cause I loved you\nYou were my girl\nSee I, thought the world of you\nBut so you know\nYou don't have to call baby no\n'Cause I'mma be alright tonight\nYou don't have to call baby no\nI'mma be alright tonight\n\n[Interlude: DJ Drama]\nI mean\nI waited, and waited, and waited\nFor that phone call\nAnd then I served you what she was asking for\nNah, you ain't gotta make that call now\nStone Mountain, yeah, you started running that thing after us\n\n[Verse 2: Childish Gambino]\n(Don't you ever go away)\nWe are very rare\n(Please don't leave me girl)\n10% of a foster home trying to Cinderella this shit\nThis melanin pit they placed us in and said get out\n(I always knew baby)\nNo blueprint, hell's cruise ship\n(You don't have to call, just text me)\nTook him and her, who made him and her\nWho made him and her who made her\nWho ran away from the south at 14 pregnant\nWho made her who came back to the south\nAtlanta, Georgia who made me\nFunny hairline, white name\nBlonde dreads, African name , both of our parents\nOriginal black hippies, so what?\n(Deep inside, I'm deep inside your heart)\n(Please don't call me girl)\nLittle 5 points to Avondale to Stone Crest\nYou out in Lithonia though\nBut fuck that, I'm a high class nigga\nI catch you out at Lenox\nNah fuck that, I'm looking for hoes at Atlantic Station\nNah fuck that, I'm at South DeKalb Mall\nReally in the parking lot, leaning on some broke niggas Camry\nThe pic you sent last night says you really with the shits\n(You wanna go, you know where i am)\nMy leather passenger seat exhales\nWasn't ready for all that\n'Cause it's not me\nI mean who is right?\n(I just wanna die, i just wanna die, inside of your love)\nI'mma take you to Tongue & Groove\nThere's $20 to wear my hat inside\nI give em $100 and tell em to pay forward for the niggas behind me\nThey playing Jeezy like that shit came out yesterday\nThug motivation, I was never a thug and they used to respect me for it\nBut now the game's fucked up and I gotta Michael Corleone these niggas\nQuiet, confident, I talked to her\nShe came with you, but she left with me\nAnd now she's in the passenger seat\nSo, where we going?\nJust away\nWhich leaves you standing there thinking\nYou don't have to call, baby", "image": "https://images.genius.com/77a2349de407b4d4690746b19b39f6dc.500x500x1.jpg"}], "artist": "Childish Gambino"}