{"songs": [{"title": "I Love Life, Thank You", "album": "I Love Life, Thank You", "year": "2011-10-10", "lyrics": "Alright then, bitch\nHa. Yahhhh\nUhhhhh\nA million mothafuckin' fans on that ass, biotch!\nFeels amazin'!\nLadies and gentlemen, I've always been the same kid, but now I'm famous\nAnd I ain't even have to change shit\n\n[Verse 1: Mac Miller]\nHey yo, they keep on sayin' this dude back, this dude back\nBut I ain't sound like this dude, bitch I'm Mac\nNow these girls all tryna suck my dick, I rap\nI may let her if I'm sippin' that yak\nYeah, too fly, submarine in the sky\nCan't go out in public I better get a disguise\nIt's better to be yourself, don't ever just slip a lie\nWhile I'm drivin' with the top down, listenin' to plies\nChicken wings and fries, I'm in love with all the simple things\nLittle things, hoes just be around always bickering\nI got some money, threw some diamonds on a pinky ring\nThat's why your favorite girl probably on my ding a ling\nChief blunts with peanut, standin' on a tree stump\nRappers need to keep up, my bitch is double D cup\nShe fucks, but she ain't no slut and she know that\nShe freeze up, livin' in the moment get a Kodak\nHold that, wait for it to flash, get the picture\nI ain't doing much, just out on this adventure\nBus around the country, but I'm travelin' the world\nWith all these rappers that be hating like I'm battlin' with girls\n\n[Hook]\nHey yo this where the hook be\nBut I ain't got no hook you pussy\nI said this where the hook be\nBut bitch I ain't got a fucking hook you pussy\nYeah bitch, that could be a hook\nYou know what I'mma rap\nIf it's ok with ya'll\nAnd you can tell me if it was nice\n\n[Verse 2: Mac Miller]\nHey yo I kinda want a fur coat, kinda want a grill\nShe met me at the party, now she kinda want to chill\nI ain't on no pills, just a little weed, molly, and lean\nYeah I did a couple drugs, now they callin' me Sheen\nThis was all a dream just a week ago, now I got a heap of dough\nI keep a ho, that always got some weed to roll\nAll these rappers wack but I don't ever see 'em close\nThe illest mothafucka in it we don't need to vote\nCause I don't give a fuck what y'all think\nAnd I don't give a fuck what that dude on that blog think\nYeah I seen hay, been in an accord in 3 states\nHad to deal with cheapskates, who always want a free play\nYou hold the weight of the world, I bet your knees break\nPut my dick in a bitch hand, keepsake\nYou can't keep that, fuck off my case\nYou can keep some residue if I bust on your face\nI'm just playin', mistake him as asian\nAlways been amazin', since days I've been hangin'\nIn ancient places, now the kid famous\nAnd he ain't even have to change shit, biatch!\n\nA million mothafuckin' fans\nJust want to take a second to thank ya'll, you feel me?\nThanks for fuckin' with the kid from day one\nYou know what I'm saying, Blue Slide Park November 8th\nI'll see ya'll then alright\nChyaa\n\nSuck my dick\nHahahahaha\nWe should keep that\nOhh shit it worked again! Biotch!\nSo I just threw this fuckin' mixtape together cuz I love ya'll\nHow nice am I?", "image": "https://images.genius.com/986f803b4d2b7fff1f43a7344f02fb6e.375x375x1.jpg"}], "artist": "Mac Miller"}