{"songs": [{"title": "Ski Mask Way", "album": "The Massacre", "year": "2005-03-03", "lyrics": "[Intro]\nYeah, I'm trying to catch me something\nA little jux or something\n\n[Chorus]\nNigga that watch is nice, that's what you bought for me?\nThat chain is nice, that's what you bought for me?\nThem earrings is nice, that's what you bought for me?\nTake that shit off, move, I'll break you off properly\nI get mine the fast way, the ski mask way\nMake money, make money money money\nNigga if you ask me, this the only way\nTake money, take money money money\n\n[Verse 1]\nYou wanna spray at me? Go 'head; the last nigga that tried\nGot hit, keeled over, and bled 'til he died\nYour little sister calling you stupid, reason why?\nHer and your momma in the living room now hogtied\nI came up with two new ways to get rich, I can't wait\nGot a brand new SIG and that old .38\nI be scheming to put a little bread on my plate\nWatching dread serve skunk through a hole in the gate\nI stick a nigga for his shine, sell him back the next day\nYou thought I really wanted your pussy? Bitch please\nThis is stash house, jackpot, there go them keys\nMy black G-Unit hoodie just reek with marijuana\nCocaine coming out my pores in the sauna\nI'm serious, man, I'm so sincere\nThis the flow right here that fucked up Jeffrey's career\nMake money, take money, yeah nigga, YEAH!\n\n[Chorus]\nNigga that watch is nice, that's what you bought for me?\nThat chain is nice, that's what you bought for me?\nThem earrings is nice, that's what you bought for me?\nTake that shit off, move, I'll break you off properly\nI get mine the fast way, the ski mask way\nMake money, make money money money\nNigga if you ask me, this the only way\nTake money, take money money money\n\n[Verse 2]\nWho's that peeping in my window?\nWOW, the Feds on me now\nThey know when I'm sleeping, they know when I'm wake\nI know they got my phone tapped, I'm screaming fuck Jake\nI'm trying to stay out them pens, so I switched states\nBad News, VA - now that sounds great\nI see niggas with that ice on, rims shined up\nThis town's one big pussy, waiting to get fucked\nI holla at AI peoples to get gats\nThey charge me 500 apiece for two MACs\nThen I'm back doing me, I'm back out on a spree\nCatch me a nigga slipping out, pumping that D\nGet me a little crew I'll have 'em pumping for me\nThe more product I take the more paper we see\nChange my name in NY, they don't know where I be\nYeah, a nigga doing dirt, but a nigga low key\n\n[Chorus]\nNigga that watch is nice, that's what you bought for me?\nThat chain is nice, that's what you bought for me?\nThem earrings is nice, that's what you bought for me?\nTake that shit off, move, I'll break you off properly\nI get mine the fast way, the ski mask way\nMake money, make money money money\nNigga if you ask me, this the only way\nTake money, take money money money", "image": "https://images.genius.com/ca36dfbff5c6dfcea453afdb61476f86.1000x1000x1.jpg"}], "artist": "50 Cent"}