{"songs": [{"title": "Don’t Stop", "album": "Pac’s Life", "year": "2006-11-21", "lyrics": "[Intro: 2Pac talking]\nThis go out to C. Delores Tucker, Bob Dole\nAnd everybody else who feels like uh\nThey stronger than the constitution\nFreedom of speech big baby\nFreedom of speech\nHa ha ha\nOutlawz\nGoddamn! Rap music I hate that\nIt's just so violent and it destroys everybody, it makes the kids crazy\nThe kids kill people\nThey're cop haters\nHere goin' against society, I don't understand the music\nIt's too loud. It's too loud, it's too rowdy, it's too violent\nLet's ban all rap music\n(Outlawz)\nBan 2Pac, ban the Outlaw Immortalz, ban 'em\n\n[Verse 1: Young Noble]\nListen it ain't no stoppin' I gotta hustle\nCop it make it double\nTry to stop it and touch it\nI'ma cock it and bust it\nNiggas fuck it I'm tryna get it addicted to fast livin'\nGet rich or die tryin' nigga ask 50\nI've been Operatin' Under Thug Laws As A Warrior\nOppressed by the industry the Hip-Hop government\nWashed around by the Hip-Hop Police\nWhy you think Nas screamin' Hip-Hop deceased?\nNo justice (No justice)\nAll the judges got grudges\nGivin' my niggas life for a little next to nothing\nSo wherever you are, just a little extra something\nYou ain't the only one, we all goin' through the struggle\nPenny pinchin'\nIt's like you really ain't livin'\nResultin' on a 211’s, I'm cookin' in the kitchen\nLike we lookin' and we wishin'\nPrayin' will he hear it?\nIt's eatin' at my spirit\nSpeakin' for the spirits\n\n[Verse 2: 2Pac]\nYou can't break me, never make me busta soft the beats\nThis Outlaw style got a brother off the streets\nMiss Delores Tucker sue me I won't stop\n'Til we get justice for these crooked cops on my block\nTime Warner full of sissies, tell 'em all to miss me\nA bunch of hypocrites whistlin' Dixie\nGood riddance cause you never should of touched me\nYou cowards knew you couldn't take the pressure I'ma make you sorry\nTrust me\nDid I cry when they dropped me? (nah), can they stop me? (won't)\nTryna sell 4 million copies\nIf I wasn't spittin' it'd be prison or death\nThis rap game all we got left\nSo try to comprehend where we comin' from\nLife as an Outlaw, ain't meant for everyone\nSo here we come\nRecognize how we organize\nStrategize now we unified brothers on the rise\nAnd we can't stop\n\n[Chorus: Young Noble]\nNo way no how we got to keep movin'\nAnd puttin' it down\nWe can't stop\n(Outlawz)\nUntil we reach the top\nThrough the music we speak to the blocks\nBelieve it or not\n\n[Bridge]\nI don't know what you've been, told\nReal niggas don't stay on they go\nCan't stop until I get that you know\nWon't stop until I get that keep goin'\n\n[Verse 3: Hussein Fatal]\nBury me with a Makaveli suit and a MAC\nIf God strike me with lightnin', I'm shootin' him back\nSkinny cause I won't work out, my man is in the gym\nLong as I'm strong enough to put a hammer on your chin\nTrapped in the storm, fuck the world 'til I'm gone\nI'm buckin' at Corey Brooke he treatin' my niggas wrong\nUntil I'm gone\nThey gon' see who I be\nI picture this bricks duckin' from the penitentiary\n\n[Verse 4: Yaki Kadafi]\nSee\nMysteriously it seems\nThrough my deepest thoughts and dreams\nIt's all wrong pop too long gone\nAnd now 18 I'm stranded on my own\nAbandoned here in the zone\nProtect my throne pow like a king, Al Capone style\nFake no jacks on this grind\nCoked up with crack I get mine\nLivin' life as a Don, guess Gortex, Louis Vuitton\n\n[Verse 5: Hussein Fatal]\nYeah your boys back with the proper team\nWhen they think I'm wearin' Red I'ma rock the green\nOn a whole 'nother episode\nCops never heard of ya\nThe otherside'll hide down the block from the murder scene\nCatch ya man he dead with the fifth\nWhen it's hot on Nu he G-Ride from the clear to the bricks\nSo gangster how he switched from the clear to the bricks\nNiggas hate it but they scared of the fifth\n\n(And we won't stop)\nOutlawz!\n\n[Chorus: Young Noble]\nNo way no how we got to keep movin'\nAnd puttin' it down\nWe can't stop\n(Outlawz)\nUntil we reach the top\nThrough the music we speak to the blocks\nBelieve it or not\n\n[Bridge]\nI don't know what you've been, told\nReal niggas don't stay on they go\nCan't stop until I get that you know\nWon't stop until I get that keep goin'\n\n[Verse 6: Big Syke]\nThis rap game like a robbery\nCause it seem somebody hidin' me my nigga\nMake a motherfucker cop a Ki'\nMotherfucker ain't no stoppin' me my nigga\nIt's Mussolini see me all in the midst\nI'm still chillin' like I'm bottle of Crys'\nEnemies, sharpen they miss\nSo when you see me they can give me a kiss\nThe one posin' with the frozen wrists\nOutlaw immortalized we survived and curst\nSo I claim it like I'm bangin' a turf\nYeah it's easy like I'm puttin' in work\nNot an easy you wanna jerk\nCall me squeezey I'm ready to murk\nOutlaw, Makaveli nigga ready to flow\nSo baby are you ready to go?\nOutlaw my niggas what they screamin' at night\nBut Big Syko with the thug in your life\nMy nigga\n\n[Verse 7: E.D.I. Mean]\nDon't stop (Don't stop)\nKeep goin' (Keep goin')\nEven when the wheels fall off we keep rollin' (Keep rollin')\nThis Hip-Hop thing just won't stop\nIt's number one at the top of the charts\nHere to stay like 'Pac\nMan I just can't let it go\nIt's in my blood stream (Yeah)\nSo when I flow, I gotta do my thug thing\nFor the hood the under privileged and oppressed\nYoung nigga get rich, cash more cheques\nTake the hood life\nPut it on on wax\nGet stakes now we livin' the good life\nCar brand new and it shine so clean\nBought momma a house, on sweet sixteen's\nAnd we, sittin' clean in the latest edition\nFrom the block to the movie screen deep in and pimpin'\nRecognize how we organize\nStrategize now we unified brothers on the rise\nAnd we won't stop\n\n[Chorus: Young Noble & Stormy]\nNo way no how we got to keep movin'\nAnd puttin' it down\nWe can't stop\n(Outlawz)\nUntil we reach the top\nThrough the music we speak to the blocks\nBelieve it or not\n\n[Bridge]\nI don't know what you've been, told\nReal niggas don't stay on they go\nCan't stop until I get that you know\nWon't stop until I get that keep goin'\n\nOutlawz...\nOutlawz", "image": "https://images.rapgenius.com/89a60bdcbf172eccb379a42ee2d9b239.220x220x1.jpg"}], "artist": "2Pac"}