{"songs": [{"title": "Jungle Bash", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Intro]\nOh shit\nWe 'bout to go to the mother fuckin' jungle in this bitch\n\n[Verse 1: Hopsin]\nUh, yeah\nYo, you gain some you lose some, I blaze like some hookah\nI rock the crowd, leave the fuckin' place lookin' gruesome\nHow you think you killin' shit with basic ass maneuvers? (What?)\nThe games fake, filled with more snakes than Medusa\nI'm goin' Hollywood (hah!) you was lied to\nI only buy it if it benefits survival\nI had a busted whip but real shit it didn't drive smooth\nI had to open up the door to order in the drive thru\nI'm so rugged and low budget, so fuck it\nI'm cold blooded\nTo top it off, all the hoes love it\nGo dumb, leave the microphone bloody see?\nI'm so cold yall might leave with your nose running\nSee I got a fat flow, putting bars to rest\nI roll up like I'm rick Ross's Neck\nRipping it up and keeping it funky like I'm DAS EFX\nI'm flawless? Yes. My flow will dissolve your flesh, c'mon\n\n[Hook]\nMe and my boy, we've been on it for years\nYou might get snatched up if you try to come around here\nSay Ehhh! (Ehhh!) Ayeee! (Ayeee!)\nMe and my boy, we've been on it for years\nYou might get snatched up if you try to come around here\nSay Ehhh! (Ehhh!) Ayeee! (Ayeee!)\n\n[Verse 2: SwizZz]\nAlright!\nLet's have fun hop! Woo! C'mon!\nS-W, I am not here to trouble you\nI just came to chill, sip and drink, and smoke a blunt or two\nSlicker than a tub of lube, blow me like a cup of soup\nHad to fly to Decatur and came back huffing glue\nThanks Jarren, I could use a new habit\nTurn the volume to the max so we can knock it like madness\nWe been on this shit for years and we still doin’ damage\nYou’re at a disadvantage, take cover, the bomb has been planted\nWe bout to blow up like a doll, little nigga don’t get involved\nThe way she shakin’ her booty, her parents would be appalled\nThe temperatures heating up and I’m stripping down to my drawers\nExceeding my limits, forget it, we bouncin’ off the walls (watch out)\nYou’re coming up short like a midget up on his knees\nNigga please, I carry ‘round sore enemies\nWhat the fuck you mean? We ain’t gonna stop, so stop\nYou got it twisted like the bottom line\nBwa-bwaaaaa-boo yea\n\n[Hook]\nMe and my boy, we've been on it for years\nYou might get snatched up if you try to come around here\nSay Ehhh! (Ehhh!) Ayeee! (Ayeee!)\nMe and my boy, we've been on it for years\nYou might get snatched up if you try to come around here\nSay Ehhh! (Ehhh!) Ayeee! (Ayeee!)\n\n[Bridge]\nIf y'all down with the H-O-P\nAnd three Z's then please repeat after me\nSay ay! Ay! Ayy! (Ay! Ay! Ayy!)\nIf y'all down with the H-O-P\nAnd three Z's then please repeat after me\nSay Ay-ay-ay-yeah! (Ay-ay-ay-yeah!)\n\n[Verse 3: Hopsin & SwizZz]\n[S] Yo, we keepin’ it raw, now hand me the ball\nAnd I’m a score for sho though\nWe killin’ the villain and touchin’ the ceiling the minute we walk in the door\n[H] I been the remedy, niggas is feelin’ me when I be droppin’ the dope flow\nDrillin’ my enemies, when they be grillin’ me\nNiggas know Hop is loco, fo sho tho\n[S] And I still got you for the low dough\n[H] Yo, you wanna learn to body a track, come to the dojo\n[S] You know bro, the closest they get is probably a photo\n[H] Yea these niggas ain’t allowed to pick up a mic no more\n\n[Hook]\nMe and my boy, we've been on it for years\nYou might get snatched up if you try to come around here\nSay Ehhh! (Ehhh!) Ayeee! (Ayeee!)\nMe and my boy, we've been on it for years\nYou might get snatched up if you try to come around here\nSay Ehhh! (Ehhh!) Ayeee! (Ayeee!)\n\n[Outro]\nHa, it’s the Jungle Bash (yee!)\nYea (ow) Hopsin (Hop) three Z’s (me)\nMr. SwizZzle Fish (hahaha hi)\nYea, Funk Volume (what? Yup)\nIts Funk Volume (ha, yup)\nIts Funk Volume (uh, naw)\nFV motherfucker (hoo-hoo)", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}