{"songs": [{"title": "Aight", "album": "Brick Factory: Volume 1", "year": "2014-03-19", "lyrics": "[Intro : Gucci Mane]\nI know why they fuck with Bricksquad\nReal recognize real, it's Gucc'\n\n[Hook : Quavo]\nMy momma, my sisters are 'aight\nMy money, my pockets are 'aight\nI'm straight, I'm cool, 'aight\nDon't need to worry about me, 'aight?\nAight, 'aight, 'aight, 'aight\nAight, 'aight, 'aight, I'm straight\nMy momma, my sisters are 'aight\nMy money, my pockets are 'aight\nI'm straight, I'm cool, 'aight\nDon't need to worry about me, 'aight?\nAight, 'aight, 'aight, fuck nigga\nI'mma get mine by any means\n\n[Verse 1 : Quavo]\nDon't worry about me I'm 'aight\nMy pockets on take off finna take flight\nMy momma told me go and get that cheese\nGotta help the family put the shit on me\nShit get real out here in the jungle\nIon' trust a young nigga, I'm just tryin' to stay humble\nNigga wanna hit my phone bout some marijuana\nI wrap the pack up and get that shit to Tijuana\nMy daddy died, I miss you\nBut still nigga I'm 'aight (Aight?)\nYou niggas is fake, you niggas is snake\nYou go left, I'mma go right\nWhen Gucci called my manager, that night it changed my life\nNow all my hard work paid on, Young Quavo I earned my stripes\nGone!\n\n[Hook : Quavo]\n\n[Verse 2 : Gucci Mane]\nEvery time you see me nigga I be with a thousand\nYoung niggas that's wildin', all my dogs be growlin'\nAll my wolves be howlin', all my shooters prowlin'\nGoin' hard in the paint on these pussy ass niggas\nCause a fuck nigga tried to foul me\nBitch get the fuck from 'round me\nCrown me cause I'm royalty\nAll my niggas loyal to me, all my hoes they spoil me\nYou are not a plug if you don't charge what I'm charging\nCaught a murder charge, thanks to God I beat the charges\nShooters jumpin' out the van when the van park\nIn East Atlanta my house is a landmark\nYour favorite rapper in the Gucci Mane fan club\nI had to run out just to run my bands up\nYou wanna be a CEO then get your grands up\nYou wanna jack me you better change your plan up\nBroke into my house and they keep bringin' your name up\nDecapitation now you can't put your hands up\nIt's Gucc'\n\n[Hook : Quavo]", "image": "https://images.genius.com/d65a023cc756026019052ee1eeb88c31.591x591x1.jpg"}], "artist": "Gucci Mane"}