{"songs": [{"title": "Green Ranger", "album": "Dedication 4", "year": "2012-09-03", "lyrics": "[Verse 1: J. Cole]\nWhen this shit dropped I was like 16\nTryna get some head from a mixed thing, big dreams\nSay goodbye to ripped jeans, nigga got a job\nHad my little wad, worst fear was getting robbed\nFor my last 50 dollars that I had left over\nFive dollars and they pop a nigga in his left shoulder\nMinimum wage, $5.15\n13′s on the whip, kept my shit clean, uh\nActually that was my mama shit\nBut I’m drivin' 'round town on my Obama shit\nMiddle-class my ass, just to get a tank of gas\nHad to run the guns up the street and pawn the shit\nBut yeah, I’m headed for a scholarship\nLittle scrap game, but I got a lot of lip\nThat's why them niggas don’t like me and always wanna fight me\nA dumb nigga hate a smart mouth, most likely, uh\nI know the game, I’m an expert\nNigga, how you gonna jump me if my legs work?\nNigga I’m gone, showed up at the crib tryna bone\nAnd I ain't fuck yet 'cause her mama always home\nGod damn, Lord have mercy\nPlease God, don’t let this little broad have herpes\nMy nigga say she fast like Jackie Joyner-Kersee\nGold medals if we gave hoes medals\nNo rose petals on a bed in the ghettos\nSpiderman sheets, got her singing falsetto\nTall white tee’s, can’t believe we used to wear those\nWhite folks looking at us like we’re weirdos\nBut we was only kiddos\nGrabbing titties in the club, pocket full of skittle\nTryna get the kitty was like tryna solve a riddle\nTryna get to Diddy, 'cause I murder instrumentals\nThis that good old fashioned Mark Jackson\nFucked then I’ll pass, y’all Utah Jazz-in'\nYa borin’, I don’t play nigga, I’m Mark Madsen\nThat's why my knots thick like a fucking Kardashian\nI’m not askin', my nigga I don’t need favors\nI’m in the streets with the fiends, I done seen danger\nMy team major, we party like teenagers\nI’m in the green Range, nigga I’m the Green Ranger\nI fucking ran outta breath, heh\nTeam major, we party like teenagers\nI’m in the green Range, nigga I’m the Green Ranger\nCole\n\n[Interlude: Lil Wayne]\nYeah, yeah, yeah, I don't even like this beat but fuck it, I'ma only spit a few bars 'cause I don't like this beat, let's go\n\n[Verse 2: Lil Wayne]\nUh, bitch I’m not old news, I’m more like gold shoes\nShe eat my whole dick, she like Whole Foods\nThey say I’m old school, but I dropped out\nDrop ya body off at a cops house\nThey throwin' up them bricks, you better box out\nMy niggas got enough white to build Barack house\nI got my drawers on, Sam Rothstein\n.44 on my waist, Rick Ross jeans\nI’ve been faded, stone wash jeans\nNew pussy, new money, New Orleans\n50 up in that uzi, G-G-G, G-Unit\nI murk you with that bitch, scratch the serial number, re-use it, uh\nI’m from the N-O, stretch niggas out like limo’s\nUzi go zit-zit-zit-zit-zit-zit-zit, that's pimples, uh\nI’m bout to go banana puddin’, hehe\nYou a dyke 'cause your man a pussy\nHit you from the blindside, no Sandra Bullock\nNever bite the hand that feeds you\nAlways watch the hand that’s cookin'\nTunechi\n\n[Outro: Lil Wayne]\nHahaha, yeah man, D4 Ho. Shout out Cole, you already know what it is, Cole World. Wayne’s World. We in this bitch ho, special delivery at your front door, hahahahahahaha, redbone biatch!", "image": "https://images.genius.com/1cca3a7cb35e2d8b6baa82593cc9844d.525x525x1.jpg"}], "artist": "Lil Wayne"}