{"songs": [{"title": "Or Nah (German Version)", "album": "Blood Moon: Year of the Wolf", "year": "2014-10-31", "lyrics": "[Produced by Dre]\n\n[Intro: Too $hort]\nDon't fight the feelin'\nThat's right, don't fight the feelin'\n\n[Interlude: Game]\nSay, my life is like a movie, nigga, fuckin' every day\nFuckin' every day, nigga, fuckin' every day\nSay, my life is like a movie, nigga, fuckin' every day\nMissionary, doggy style, nigga, fuckin' every way, go\n\n[Verse 1: Game]\nI'm not the nigga you thought that\nThat trickin', we off that, I hit that, no callback\nShe ratchet, I like it, I hold it, she bite it\nShe lick it and suck it, I fuck it, he wife it\nNo feelings for a ho that ain't my main thing\nMy niggas on the same thing, all my niggas gang bang\nBitches do choke, this is my boo\nTwo C's on that bag but she throw a Piru\nAnd we off that Cîroc, she don't mind if I do\nHer girlfriend a thot, tell her hop in my coupé\nTell her hop in my bed, tell her hop off my roof\nMy baby-mama trippin' and that bitch can shoot but\n\n[Hook: Game]\nYou gon' let me hit or nah?\n(\"Can I get the dick or nah?\")\nYou gon' let me watch you strip or nah?\n(\"Can a bitch get a fit or nah?\")\n\n[Bridge: Eric Bellinger]\nGirl, once you get it, you got it forever\nOh, nah, so let me hit it\nGirl, once you get it, you got it forever\nOh, girl, so let me hit it\n\n[Verse 2: Eric Bellinger]\nIf you let a nigga come through\nI'm give it to you better than you ever had it\nGirl, I promise, I'm a be the only thing you want to do\nMakin' you forgot about your niggas automatic, you already know\nI can fuck you better, can we live together?\n\n[Verse 3: Problem]\nBitch a problem, bitch, you better follow me\nI give you this dick, you hit the lottery\nI know all the stars, astrology\nLast deposit fucked up the whole economy\nGet that, spent twenty-ten, bitch-nigga\nKush, piff in it, every white string infinite\nYou different, last night, niggas picturin'\nSeven times, had a black chick tryin' white shit\nFederline, I’m the future, real beef, I’ll shoot you\nWalk-walk, no talk-talk, no sub and no woofers\nIt's on, tell by my tone\nReal nigga call, better answer your phone\n\n[Hook + Bridge]\n\n[Verse 4: Kollegah]\nSo viele Nieten im Biz machen auf Gees in dem Biz\nEs ist wie ihr Rückgrat - viel Wirbel um Nichts\nUnd viele deutsche Rapper glauben, dass sie flowen\nWo sind alle hin, tz, ich glaube, dass sie flohen\nIch komm mit Haufen von Kanonen und tausenden Patronen\nPlus paar skrupelloser Gangster aus der Kaukasus-Region\nBedroh' dich mit Winchesters\nMein Waffenfetisch ist nicht mehr in den\nGriff zu kriegen wie ein verbogenes Springmesser\nIch baller' Rapper ab, knall' dann deren Sluts\nNaja, was man halt alles als Gewaltverbrecher macht\nDoch hab' ich den Alltagsstress mal satt\nBesuch' ich dich auf Intensivstation und schalte etwas ab\nDu hast Liebeskummer, Kid, ich schiebe Nummern mit\nDeinem Girl, geb' ihr den Cock, wo sie nie genug von kriegt\nRoll' im Beamer rum und blick' beim Online-Banking nie\nWelche Zahl da Kontostand und welche IBAN-Nummer ist\n\n[Bridge]\n\n[Outro: Too $hort]\nDon't fight it baby\nDon't fight the feelin'\nYou know a nigga tryna fuck\nI like that bitch, teah, baby\nYour pussy wet? Take them panties off\nDon't fight it, let a nigga hit that shit\nYou like to fuck, all these bitches love fuckin'", "image": "https://images.genius.com/3c242f72b054b6d20e2e8fd97f060d73.1000x1000x1.jpg"}], "artist": "The Game"}