{"songs": [{"title": "Give it to Ya Raw", "album": null, "year": null, "lyrics": "[Ol' Dirty Bastard]\nGive it to ya raw!\nYo, it's that old school shit\nAbout 12 years old\n\nLet's get physical, operate your brain to function\nI remember the Gods at the junction\nConjunction junction what's your function?\nI summed it up as the Ason sumption\nKnown on the microphone as Crazy Crucial\nDippin low on an MC like you and doin you\nSomethin, so step to the shit right now\nKickin on erything in my god damn town\nDoin expressure, a jam it to deadly\nDaredevil doin, cause I am the U-N\nI-Q-U-E funky fresh\nFunky do he get hype?\nYou're motherfuckin right I do\nAson, break it down sure anytime\nA serious outstandin never end it clever in the rhyme\nBreak down your shit, wherever you come\nThere's no one who can fuck with Ason\nI paralyze you make you realize who\nLost concern with my god damn crew\nQuiet as kept when I start any fuckin riots\nEven before you do in my nigga? Don't try it!\nFor you to get close enough to my style\nYou have to travel miles and miles and miles\nTo find a special rhyme like mines, you gotta look\nAt what you find in the Brooklyn Zoo\nRaw exit, killin the beat with all your might\nYou love a hip hop song baby, I don't wanna be right\nWake up, what, what, losin your head\nWoke up on the wrong side of the bed\nJuvenile faction of hard, you say you're livin large\nYou're the head nigga in charge\n\nI give it to ya raw!\nI said I give it to ya raaaawww!!\nI'm Ason baby, I'm the Ason baby\nI'm Ason baby, I'm the Ason\nI'm Ason baby, I'm the Ason\nGivin it to ya raw baby\nThe raw deal, because\n\nThese lovely rhymes made by the one and only\nI'm Ason, there's nothin phony about me\nSteady of course so hard to handle whip it\nLike a specialist I write my own music\nNow I make ya dance, get drunk or act wild\nBaby sayin \"Hey hey I love your style\"\nWhether you're sober, known just to holder, casanova\nGet chopped with the lawn mower\nSo get busy as Ason perform\nOn and on ladies scream my name Ason\nThat means the Ason girls fanatic\nRepeat it so much you get a throat infection\nYo I relieve the ones who believe\nYou're in the need of the God degree\nThat I build on with style and finesse\nKeep MCs in check like a game of chess\nSo to the folks, come to my rehearsals\nI look so good I should be on the commercials\nOn TV that tell original lie\nOf the Ason most high\nWho's your Jesus? Stop me and question\nThey'll never forget they can choke on position\nDon't charge a cent of excellent\nAdd the ingredients of Ason's elements\nFire, water, cold earth wood\nYo do the knowledge because it is good\nEnough to overstuff jumbo pack\nBrother like Ason will never be attacked\nA by a nigga couldn't figure how to pull the gun trigger\nAnd I say yo get the fuck outta here!", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}