{"songs": [{"title": "White Man’z World", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Intro: Malcolm X (Movie) & Danny Boy]\n\"You go bustin' your fist against a stone wall. You're not usin' your brain. That's what the white man wants you to do. Look at you! What makes you ashamed of bein' black?\"\n\n[Intro: 2Pac]\nNothin' but love for you, my sister\nMight even know how hard it is, no doubt\nBein' a woman, a black woman at that, no doubt\nShit, in this white man's world\nSometimes we overlook the fact\nThat we be ridin' hard on our sisters\nWe don't be knowin' the pain we be causin'\nIn this white man's world\nIn this white man's world\nI ain't sayin I'm innocent in all this\nI'm just sayin', in this white man's world\nThis song is for y'all\nFor all those times that I messed up, or we messed up\n\n[Verse 1: 2Pac]\nDear sister, got me twisted up in prison, I miss ya\nCryin', lookin' at my niece's and my nephew picture\nThey say don't let this cruel world get ya\nKinda suspicious, swearin' one day you might leave me\nFor somebody that's richer\nTwist the cap off the bottle, I take a sip and see tomorrow\nGotta make it if I have to beg or borrow\nReadin' love letters; late night, locked down and quiet\nIf brothers don't receive they mail, best believe we riot\nEatin' Jack-Mack, starin' at the walls of silence\nInside this cage where they capture all my rage and violence\nIn time I learned a few lessons, never fall for riches\nApologies to my true sisters, far from bitches\nHelp me raise my Black nation, reparations are due\nIt's true, caught up in this world I took advantage of you\nSo tell the babies how I love them, precious boys and girls\nBorn black in this white man's world—and all I heard was\n\n[Chorus: Danny Boy]\nWho knows what tomorrow brings\nIn this world where everyone's blind?\nAnd where to go, no matter how far, I'll find\nTo let you know that you're not alone\n\n[Bridge: 2Pac]\nOnly thing they ever did wrong (yes!, yes!) was bein' born black (no doubt), in this white man’s world. All my ghetto motherfuckers, be proud to be black if you proud to have this shit like this, 'cause ain't nobody got it like this (all my little black seeds, born black in the white man's world). All these motherfuckers wanna be like us. They all wanna be like us, to be the have-nots: all hail. God bless the child that can hold his own, no motherfuckin' doubt.\n\n[Verse 2: 2Pac]\nBein' born with less, I must confess, only adds on to the stress\nTwo gunshots to my homie's head, died in his vest\nShot him to death and left him bleedin' for his family to see\nI pass his casket, gently askin', is there a heaven for G's?\nMy homeboy's doin' life, his baby mama be stressin'\nSheddin' tears when her son finally ask that questions\nWhere my daddy at? Mama, why we live so poor?\nWhy you cryin'? Heard you late night through my bedroom door\nNow, do you love me, mama? Why they keep on callin' me nigga?\nGet my weight up with my hate and pay 'em back when I'm bigger\nAnd still thuggin' in this jail cell, missin' my block\nHearin' brothers screamin' all night, wishin' they'd stop\nProud to be black, but why we act like we don't love ourselves?\nDon't look around, busta, (you sucka!) check yourselves\nKnow what it means to be black, whether a man or girl\nWe still strugglin' in this white man's world\n\n[Chorus 2: 2Pac]\nWho knows what tomorrow brings\n(Born black in this white man's world)\nIn this world where everyone's blind?\n(In this white man's world)\nAnd where to go, no matter how far, I'll find\n(In this white man's world)\nTo let you know that you're not alone\n\n[Collision]\nWe must fight for brother Mumia\nWe must fight for brother Mutulu\nAnd we must fight for brother Ruchell Magee\nWe must fight for brother Geronimo Pratt\nWe must fight for [?], Zulu, [?]\nWe must fight for the countless political prisoners\nWho are locked up falsely by this white man\n\n[Verse 3: 2Pac]\nSo, tell me why you changed to choose a new direction\nIn the blink of an eye?\nMy time away just made perfection\nDid you think I'd die?\nNot gon' cry, why should I care?\nLike we holdin' onto lost love that's no longer there\nCan you please help me?\nGod bless me, please keep my seeds healthy\nMakin' all my enemies bleed while my G's wealthy\nHopin' they bury me with ammunitions, weed and shells\nJust in case they trip in Heaven—ain't no G's in Hell\nSister, sorry for the pain that I caused your heart\nI know I'll change if you help me, but don't fall apart\nRest in peace to Latasha, Lil' Yummy, and Kato\nToo much for this cold world to take, ended up bein' fatal\nEvery woman in America, especially black\nBear with me, can't you see that we under attack?\nI never meant to cause drama to my sister and mama\nHope we make it to better times, in this white man's world\n\n[Chorus: 2Pac]\nWho knows what tomorrow brings\nIn this world where everyone's blind?\nAnd where to go, no matter how far, I'll find\nTo let you know that you're not alone\n\n[Collision: Khalid Abdul Muhammad]\n\"You're out of touch with reality! There are a few of you in a few smoke-filled rooms calling that the mainstream, while the masses of the people—white and black, red, yellow and brown, poor and vulnerable—are suffering in this nation.\"\n\n[Collision: 2Pac]\nNever that, in this white man's world, they can't stop us\nWe've been here all this time\nThey ain't took us out, they can never take us out\nNo matter what they say, about us bein' extinct\nAbout us bein' endangered species\nWe ain't never gon' leave this\nWe ain't never gon' walk off this planet\nUnless y'all choose to\nUse your brain, use your brain\nIt ain't them that's killin' us, it's us that's killin' us\nIt ain't them that's knockin' us off\nIt's us that's knockin' us off\nI'm tellin' you better watch it, or be a victim\nBe a victim, in this white man's world\nBorn black, in this white man's world, no doubt\nAnd it's dedicated to my motherfuckin' teachers\nMutulu Shakur, Geronimo Pratt, Mumia Abu Jamal\nSekou Odinga, all the real OG's, we out\n\n[Outro: Minister Farrakhan]\n\"The seal, and the constitution, reflect the thinking of the founding fathers, that this was to be a nation by white people; and for white people, Native Americans, Blacks, and all other non-white people were to be the burden bearers, for the real citizens of this nation.\"", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}