{"songs": [{"title": "The Time We Faced Doom", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Produced by MF DOOM]\n\n[Phade]\nWhen this reporter babe get here, she gon' be on our tip, man. You know she gon' wanna write about me and my man here, all kind of long articles and stuff.\n[Robot Voice]\nFlash Message Top Secret Ultra\n\n[Union Crew]\nYeah, and when she does, and she puts his picture in the paper, that's gonna be the end, secret exposed, his face, for everyone to see man. That's the wack, you know.\n[Robot Voice]\nEars Only\n\n[Phade]\nYo, man, what the fuck you talkin' 'bout, man? That's gon' get my man big fame, man, cash money too.\n[Robot Voice]\nArrange Temporary Transfer This Agency\n\n[Raymond 'Zoro']\nYo, but what about money? Yeah. If I do this interview, will, you know, will I get paid for it?\n[Robot Voice]\nMetal Face DOOM\n\n[Phade]\nHell yeah, man! You gon' get G's!\n[Robot Voice]\nYour Concurrence In The Above Is Assumed\n\n[Union Crew]\nYo, where do you get your information from? “You’re gonna get paid,” you don’t get paid for an interview and shit, you don't get paid for that. Yeah, he'll come out in it, but he's not gonna get money.\n[Robot Voice]\nNotify MF, KMD, GYP, CM. Effective Immediately\n\n[Raymond 'Zoro']\nYeah, but that's true, what he said, man. I don't, I don't want my pictures in the papers\n\n[Phade]\nLook, man, I know how the publicity machine works. You're gonna get cash money for this. You might not get the money, like, right now, but you gon' have money like Barry White, man! You can do all kind of crazy shit you wanna do when you get this publicity, man.\n[Robot Voice]\nTop Secret Ultra End Of Message\nUm\nHuh\n\n[Otto Von Lenz]\nNow, who will be the first to tell me of a past adventure?\n\n[MF DOOM]\nI ain’t sayin’ nothing\n\n[Reed]\nWhy don’t you tell him about the time we faced Doom?\n\n[Sue]\nAlright. Well as I remember, Doom had threatened the world leaders with destruction of every major city on earth. *Telephone Rings*\nHeadquarters\n\n[Dr. Doom]\nGood evening\n\n[Sue]\nWould you believe it? It’s Doom on the phone!\n\n[Reed]\nWhat’s on your evil mind?\n\n[Dr. Doom]\nHold your insulting tongue and mark my words well. I have plotted my revenge on you. Now I shall have it! Bid farewell to your friends!\n\n[Reed]\nDoom hates us all, but in his warped mind, he has a personal score to settle with me\n\n[Robot Voice]\nOperation Doomsday", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}