{"songs": [{"title": "Artillery", "album": "Legit Ballin Vol. 1", "year": null, "lyrics": "Restraint!\nArtilerry motherfucker, legit balling bitch but don't get it twisted\nAin't no hoes over here\nYeah, we got guns nigga, aimed at all you hating bitches\nFrom K-Town to the Manor, Holy City to the Wild Hundreds\nThe war is on, and all my killers is riding\nTodd Nitty, what you got for these hoes (click...clock...blast)\n\n(Todd Nitty)\nI got that 9 double M Glock, with the infrared beam dot\nAiming at your knot, making your heart stop\nYelling out \"Fuck Tha Po\" who some call it 5-0\nBetter look out for when they pull that kick door\nNothing but gangstas, thats all who I hang with\nSlanging them thangs with, came up in the game with\nThe fucking hood rats, because them some broke hoes\nMe get a rich bitch and stick her for her dough\nThe Manor in that K-Town, thats how we put it down\nLetting off fifty rounds, thats how our shit sound\nArtillery up the ass, scullies and ski masks\n9's and bubble masks, gunning at your ass\nMotherfucking street thugs, legit ballers\nMoney and the power, moving that flour\nTaking no shorts and taking no losses\nHauling niggas asses off in coffins with that..\n\nHook\n\nOne, two, three, 45.'s\nSix, seven, eight, nine milli-meter\nTen, eleven, twelve gauge pump nigga (4x)\n\nA nigga riding with stealers, hustlers, killers all my life\nLegit Ballers bitch, don't even try to fuck with us gangsta's\nBecause we some mobstas\nYou come with that bullshit, then pussy I'll pop ya'\nSee it's that nigga Todd Nitty, that be squeezing triggers like bitches\nTitties\nWho is it, the most left on nigga, they crept on nigga, with that teflon nigga\nAnd it went BLOW! BLOW! body bag that bitch\nSent his ass to the morgue with the rest of them snitches\nI heat 'em up like a motherfucking Newport\nLeft his ass with more holes than a golf course\nWhat you thought boy, I'm from that 9th Ward\nWhere them stories are true about them Manor boys\nHow we leaving 'em, bleedin' and crawling on the ground\nLike he's a dead nigga now\n\nHook\n\nI got that love for my nigga Twist, for aid and assistance\nHe told me holsters, caught him up in some bullshit\nDon't even trips though, I'm heading in your route\nSoon as I roll up, we puttin' they lights out\nPoppin' a clip in, with one in the chamber\n\n(Twista)\nFinna' ride on a stranger, put the hoes life in danger\n\n(Todd Nitty)\nStarted letting off hollows, straight through they car door\n\n(Twista)\nI'm a G from Chicago, pull the game weightless where I go\n\n(Todd Nitty)\nBustin' pistols with laser injects, putting holes in they Avarex\n\n(Twista)\nGoing straight through your tailored vests, now it's you or your neighbor next\n\n(Todd Nitty)\nNow we got your boy tied up, to the hideout we ride up\n\n(Twista)\nThey gonna show us the stash-pot, with the little handles side up\n\n(Todd Nitty)\nTook the money and lello, and thats hwo the day goes\n\n(Twista)\nGet the bankroll, gotta gank hoes, and I got the 44\nTime to leave finna' go\nHit 'em with that...\n\nHook", "image": "https://images.genius.com/5060d4ef55ecae336f25c132a4f941f2.496x500x1.jpg"}], "artist": "Twista"}