{"songs": [{"title": "Killing You", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Intro/Sequel of Messages (Skit)]\nYou're the meanest person on this planet\nI can't even say anything more than that\nYou are the fuckin' devil!\nYou have fun making your goddamned K.O.D. album\n'Cause that's what you are, the King of Darkness\nYou're nothing but fuckin' hell!\n\n[Verse 1: Tech N9ne]\nI was born a beast, you don't wanna meet\nI'm the worst, a lot of women see the demon in me\nStill they want a piece, they want me carnally\nA lot of them are really searchin' for the semen in me\nI let 'em know at the front, I lust demon\nThe wannabe bust kitty, you're rubbin', I love many\nThey trust me with the cunt and I thrust plenty\nAnd jump in the next city, they wanted me, just kidding\nBut I can never tell a lie, if you look into my eyes you can see that I'm a\n(Angel / Demon)\nLookin' for the love in every thigh, makin' you wanna cry, spirit'll be\n(Strangled / Screaming)\nThat I'm a serial killer when it come to heartbreakin', hate and the fury, you better cynic and it starts makin'\nEverything wrong, everything's gone\nSo why do you say that you will forever ding-dong?\nThat just will make you much meaner, that's some mistake to love N9na\nIt sucks to hate the one thing that makes you come clean\nThen breaks and just leave you\nI'm just a fucked up individual\nI love lust and crushin' you for an interval\nPlus bust the gush off in a centerfold\nEating a meaty muff like it's a dinner roll\nYou should have kept away like I told you\nHow can you press to stay when I'm rover?\nI think it's safe to say that my fate's to lay and I'ma waste away when I'm older\nSo just step and give me the cold shoulder\n'Cause I'm a mess, the N9na's the most vulgar\nAnd I'm a threat, you'll never get no closure\nMy kiss is killing you, wake up and it's over\n\n[Hook: Tech N9ne]\nWhy can't you see me for the animal I am? (I warned you!)\nExpose my beast inside? Yes, dear, you are willing to (Willing to, willing to, willing to)\nYou took my invitation and they all told you never to take me in\nWhy can't you wake up and see that I am killing you? (Killing you, killing you, killing you)\n\n[Verse 2: Tech N9ne]\nI never knew why I had to be so cold\nInside of me so froze, it's gotta be no soul\nBecause when the lady want me in oath mode\nI put on my ghost clothes and get on a close road\nI'm tryin' to tell you that I'm sick in the encephalon\nI thought I could do it, but I guessin' we can never bond\nAs long as I'm chasin' the gold like a leprechaun\nMy heart'll be covered in cold ice and tef-lon\nI'm sick with it, I'm brick with it, N9ne twisted it\nTen times outta ten, if you lookin' for what it stems\nI guarantee that you gonna find a bitch did it\nBut I'm takin' it back, I won't blame it on you\n'Cause I be the one that be gamin' on you\nFamous and heinous the painin' you do\n'Cause I'm blatantly playing and laying the crew\nI ain't proud of what I turned into\nAll my fire keeps burning through, burning you\nUp in the inside, I'm knowin' the heat is concerning you\nI don't know what's gonna become of me\nAll I can say is don't anyone love me\nBecause I'm a monster, I'm sick and I want ya\nBut you better back up and when I come shove me\nBut then again I really, really need you\nI want up inside of you, wanna bleed you\nTo get the last drop and then I'ma leave you\nEvery last one of you I'ma speed through\nCovering every lady wanna see you\nOpen up wide, I wanna feed you\nInto the pit of evilness, I'ma lead you\n(I'm an animal, take what I like then release you!)\n\n[Hook: Tech N9ne]\nWhy can't you see me for the animal I am? (I warned you!)\nExpose my beast inside? Yes, dear, you are willing to (Willing to, willing to, willing to)\nYou took my invitation and they all told you never to take me in\nWhy can't you wake up and see that I am killing you? (Killing you, killing you, killing you)\n\n[Outro/messages sequel]\nYou are the meanest, evilest..\nYou are so evil to me, you are the goddamned devil!", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}