{"songs": [{"title": "How Can I Not", "album": "No Sleep ", "year": "2013-12-18", "lyrics": "[Produced by Metro Boomin]\n\n[Intro: Future]\nWe on that drank we on that drank\nI got 20,000 on me by mistake\nHow can I not ball until everything fade away\nHow can I not, how can I not\n\n[Hook: Future]\nHow can I not make a movie\nHow can I not do this shit that these niggas don't love\nHow can I not get the Xans and the mollies the percs and the drank and the drank in the Syrup\nHow can I not take my style back from niggas\nWhen niggas was taking my style way before\nHow can I not? How can I not? How can I not?\nHow can I not get this guala and flip all this guala\nBecause a young nigga was starving\nHow can I not make this music for dealers and killers and niggas who out there be robbing\n\n[Verse 1: Future]\nRun in your spot, smashing your ho, fuck on your couch\nQuit running your mouth, pimping my pen beginning to end\nTelling the plot, look at my watch, fuck all your thoughts\nI appreciate you niggas I appreciate you bitches for keeping me relevant talk all you want\nBrag all I want, how can I not make you niggas regret\nHow can I not go and get me a check\nHow can you not get hooked on percocet\nHow can you not be the one who was star\nHow can you not be the one who was king\nHow can you not come around and I stare at these niggas and niggas be rocking this bling\nCum bitch then cum again, how can I not want to fuck your friend?\nProper game make em all wonder how it feel being with a pimp\nEveryday something different money cars clothes different\nMe and money got a chemistry, me and you a big difference\n\n[Hook: Future]\nHow can I not make a movie\nHow can I not do this shit that these niggas don't love\nHow can I not get the Xans and the mollies the percs and the drank and the drank in the Syrup\nHow can I not take my style back from niggas\nWhen niggas was taking my style way before\nHow can I not? How can I not? How can I not?\nHow can I not get this guala and flip all this guala\nBecause a young nigga was starving\nHow can I not make this music for dealers and killers and niggas who out there be robbing\n\n\n[Verse 2: Young Scooter]\nGotta get this guap, set down that block, scrape them pots\nGotta call this plug, count this check, how can I not\nGotta work them spots, work them Glocks, watch that clock\nGotta move these bricks, I'm on probation bitch I'm hot\nHow can I not get all this money give all my niggas in the hood a block\nBuy a drop and another watch then flex some more nigga how can I not\nThem freeband niggas got all that money but BMG how we stamp them blocks\nWe remix bricks in Mexico you know we take a half off top\nJugg with my money nigga how can I not, fuck you mean I got 20 spots\nNiggas swagger jacking off of Future trying to steal his spot\nCause we make that million dollar music and we off the block\nDrought season hit up hector phone nigga how can I not\n\n\n[Hook: Future]\nHow can I not make a movie\nHow can I not do this shit that these niggas don't love\nHow can I not get the Xans and the mollies the percs and the drank and the drank in the Syrup\nHow can I not take my style back from niggas\nWhen niggas was taking my style way before\nHow can I not? How can I not? How can I not?\nHow can I not get this guala and flip all this guala\nBecause a young nigga was starving\nHow can I not make this music for dealers and killers and niggas who out there be robbing\n\n[Outro]\nWe on that drank we on that drank\nI got 20,000 on me by mistake\nHow can I not ball until everything fade away\nHow can I not, how can I not\n\nBefore you got in the race nigga\nI already lapped the niggas you with and\nThe niggas who coming behind me You Heard Me\nSubliminal ass bitches!", "image": "https://images.genius.com/954d4bfb2f1a939623e43520199dcb34.500x500x1.png"}], "artist": "Future"}