{"songs": [{"title": "V. 3005", "album": "Because the Internet", "year": "2013-10-22", "lyrics": "[Chorus (Condensed)]\nNo matter what you say or what you do\nWhen I'm alone, I'd rather be with you\nFuck these other niggas, I'll be right by your side\n'Til 3005, hol' up\n\n[Verse 1]\nOkay, hold up, wait a minute, all good just a week ago\nCrew at my house and we party every weekend so\nOn the radio, that's my favorite song\nMake me bounce around, like I don't know, like I won't be here long\nNow the thrill is gone, got no patience, 'cause I'm not a doctor\nGirl why is you lying, girl why you Mufasa\nYeah, mi casa su casa, got it stripping like Gaza\nGot so high off volcanoes, now the flow is so lava\nYeah, we spit that saliva, iPhone got message from Viber\nEither the head is so hydra, or we let bygones be bygones\n\"My God, you pay for your friends?\" I'll take that as a compliment\nGot a house full of homies, why I feel so the opposite?\nIncompetent ain't the half of it\nSaturdays we're Young Lavish-ing\nSaddest shit, is I'm bad as it\nBeans they took from the cabinet (Whoa)\nSorry, I'm just scared of the future\n'Til 3005, I got your back, we can do this, hold up\n\n[Pre-Chorus]\nNo matter what you say or what you do\nWhen I'm alone, I'd rather be with you\nFuck these other niggas, I'll be right by your side\n'Til 3005, hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up)\n\n[Chorus]\nNo matter what you say or what you do\nWhen I'm alone, I'd rather be with you\nFuck these other niggas, I'll be right by your side\n'Til 3005, hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up)\n\n[Verse 2]\nI used to care what people thought, but now I care more\nI mean, nobody out here's got it figured out\nSo therefore, I've lost all hope of a happy ending\nDepending on whether or not it's worth it, so insecure, no one's perfect\nWe spend it with no shame, we blow that like Coltrane\nWe in here like Rogaine, or leave it like Cobain\nAnd when I'm long gone, whole crew sing a swan song\nCause we all just ticking time bombs, got a Lambo like LeBron's mom\nAnd no matter where all of my friends go, Emily, Fam, and Lorenzo\nAll of them people my kinfolk, at least I think so, can't tell\n'Cause when them checks clear, they're not here\n'Cause they don't care, it's kinda sad but I'm laughing whatever happens\nAssassins are stabbed in the back of my cabin\nLabrador yapping, I'm glad that it happened, I mean it\nBetween us, I think there's something special, and if I lose my mental\nJust hold my hand, even if you don't understand, hol' up\n\n[Pre-Chorus]\nNo matter what you say or what you do (No, no)\nWhen I'm alone, I'd rather be with you (You and me)\nFuck these other niggas, I'll be right by your side\n'Til 3005, hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up\n\n[Chorus]\nNo matter what you say or what you do\nWhen I'm alone, I'd rather be with you\nFuck these other niggas, I'll be right by your side\n'Til 3005, hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up), hol' up (Hol' up)\nHol' up (Hol' up)\n\n[Post-Chorus]\nHol' up, hol' up\nHol' up, hol' up\nHol' up, hol' up\nHol' up, hol' up\n\n[Outro]\nNa—na—na, na—na—na—na—na\nWe did it! Yay!\nNigga, you so thirsty\n\n[Produced by Childish Gambino, Ludwig Göransson, & Stefan Ponce]", "image": "https://images.genius.com/1ead694d1ee891eb0d292ddcd83666ee.1000x1000x1.jpg"}], "artist": "Childish Gambino"}