{"songs": [{"title": "YSIV", "album": "YSIV", "year": "2018-09-28", "lyrics": "[Intro]\nIt's that Young Sinatra IV shit right here\n(Rest in peace Mac Miller)\nIt's been like 10 years\nHere we go (Yeah)\n\n[Verse 1]\nVisualizin' and realizin' my life is fuckin' crazy\nPoppin' like JAY-Z, Dirty Dancin' on the game like Swayze\nI'm one of the illest and bitch\nI've been ready to kill it, it's so amazing\nBitch, I've been blazin', I'm talkin' grass, I ain't talkin' grazing\nThey just hit the tape while I sip scotch\nLet the haters kick rocks, my shit is tip-top\nI never flip-flop, why? 'Cause my soul too strong\nDid this all on my own, 'cause waiting took too long\nThe flow sophisticated\nAll these youngins do is whine like they inebriated\nI'm hated, but yeah, that's how you know I made it\nI'm one of the illest, I'm one of the realest, I'm ready to kill this\nThe people, they feel us, me and my team made millions\nBut you know we still us\nThat's why they wanna kill us, that's why they wanna kill us\nRattPack, real all the time, we never phony\nI'm single-handedly running the game like a Sony\nWhile the rest of these rappers is acting\nPass 'em the Tony, pass 'em the Oscar\nFrom the new school rappers, yeah I'm the illest on the roster\nSmoke like a rasta\nBlack and white like Bob Marley, yeah, like Bob Marley\nThese racist motherfuckers hate that last line\nProbably haters on the internet ain't got nothing to bargain\nSaid I'd never make it, bitch, I just sold out the Garden\n\n[Chorus: AZ & Logic]\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we sip scotch\nLike Sinatra, screamin', \"Motherfuck the cops\"\n\n[Verse 2]\nThey say they want the old Logic, the one that flow like a faucet I'm still the same me, they just don't believe it like they agnostic\nIf I spit over the boom-bap, then they perceive it as nostalgic\nBut the truth is, my subject matter has been the same\nAnd my production selection is still flame\nBut they love you on the come up 'cause you ain't tainted by fame And you still they little secret\nThat's the type of bullshit that they frequent\nFrom 19, to 2019, been murderin' this shit for a decade\nFrom the boom-bap to the trap, I let my shits cascade (Listen, yeah, yeah)\nSo what's the dealy? Pass the Phillie, get silly, that's on the really\nWe snappin' like Uma Thurman in Kill Bill, I'm talkin' achilles\nTry to play me like I ain't me, but I provided all the deets'\nWho you know worth 50 million, still rappin on break beats?\nFrom Nasty Nas, Big-L, Tribe, The Roots, and many more\nOf course we could never forget Biggie and young Shakur\nFuck the police, no we ain't fuckin' with Al Pastor\nI'm the bastard that mastered the flow, I said it once before fa' sho'\nWhile 6ix produce the kicks from the soul, you already know\nFuck these youngins talking outta they ass with no class\nI'm here to school 'em\nThis that real shit, I'm never foolin'\nI'm killin' these squares, we call it a massacre\nI got the bread, but these fuckers need the dough like a baker\nThe legends above me love me like the RZA, like Nas, like Jay 'Cause I mastered the flow from back in the day\nRespected by my peers from Drizzy to Cole to Kenny\nThank you for the love and inspiration plenty\nYeah, I'm loved by many, and only hated by a little\n\n[Verse 3]\nNow I think it's time to switch to lyricism, peep the riddle\nI was born in mint condition, I'm everybody's life's mission\nAll right, listen, put me 'round your neck and I might glisten\nThe ultimate connect, I'll get you anything you need\nFrom good credit to good weed\nI can make any woman succeed\nControl you with a heart of greed\nAlong with anybody that's in need, I'll make 'em beg and plead\nI'm in the pocket of mafia crime lords and presidents\nWithout me, they'll evict you from your residence\nHov wrote about me on \"Dead Presidents,\" never irrelevant\nNot a soul on earth would love me if I weren't me\nNo matter what year I'm in, I'm current, see?\nPeople that have me, yeah, they power's so immense\nBut people without me, make no sense, god damn\nYeah, the world revolve around me, the law evolve around me\nThe shit people do to get a piece of me astound me\nBlood stains my face when drug deals go wrong\nI'm given to the greatest athletes when they go long\nYou could put me in check\nBut I'm still laughing all the way to the bank\nI'm the reason that the Titanic sank\nI'm always there for you, yeah, when it comes down to the wire And some people even tuck me away 'til they retire\nI usually come around on the first and fifteenth\nIf you owe me to somebody then they'll leave you beneath\nPeople go crazy when they feel me\nIn the Middle East they drill me\nIf you let your guard down, then some people'll steal me\nI knew these two dudes that's always been homies since fifth grade\nAlways schemin' on the block, selling crack to get paid\nNow they never graduated, thought that shit a charade\nOnly thing on they mind that wasn't me was get laid\nThen one day, they had a falling out on the block\nSee, one thought the other one had been stealing his rock\n'Cause he coulda sworn he had more weight in his stock\nPulled out the Glock and his homie yelled, \"Stop!\"\nBut before he had the chance to pull the trigger\nOh shit here come the cops\nThey saw the gun and blew them both away\nNow there's two more kids dead in the street all before twenty Over me, the most important thing to man: money\n\n[Chorus: AZ & Logic]\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die, that's why we sip scotch\nLike Sinatra, screamin', \"Motherfuck the cops\"\n\n[Break]\nWe just some motherfuckin' kids\nWe just some motherfuckin' kids\n\n[Outro]\nWe love and miss you, Mac\nFor those of y'all who don't know man, Mac is the whole reason that I started doing this Young Sinatra shit. I remember I loved Lord Finesse, all the shit he did with DITC, Diggin in the Crates. \"Hip to the Game\", one of like—one of the illest beats ever and I remember when Mac flipped that shit for Kool-Aid and Frozen Pizza—I thought it was the dopest shit man. Mac showed me that I could just do it all on my own—me and all my boys, all my homies— and if it wasn't for him killing that beat I would have never got on that beat for my very first mixtape Young Broke and Infamous. Damn... that's like 2010. And I titled the track \"Young Sinatra.\" And that was the birth of all this shit. So, thank you, I appreciate you, love you and miss you, yeah\nYeah, we just some motherfuckin' kids", "image": "https://images.genius.com/2bdac395ac5e383d08777fa471ffb275.600x600x1.jpg"}], "artist": "Logic"}