{"songs": [{"title": "Poisonous", "album": "Killer", "year": "2008-07-01", "lyrics": "[Tech N9ne]\nNow you know that I'll never give you anything that will hurt you, right baby?\nSo try this ... yeah ... yeah ... you like that?\n\n[Chorus: Liz Suwandi]\nI saw you back where we began\nThen you took me for a spin\nAnd captivated, brought me in and now\nSee I still watch you from a distance\nLost in you, lose all resistance\nPoisonous the way you took me out\nCause yoooooooooooooou ... got the best ... of me\nCause yoooooooooooooou ... got the best ... of me\n\n[Tech N9ne]\nN9na! I'm like a walking drug\nI can make your lady pop X, want sex from a nigga like me\nI can feel her nightly, even make her fall off in love\nGet away lost off in hugs, stalking blood for an awesome plug\nThis is addictive, vicious and wicked slick talking stud\nI take good gals, recruit 'em, pollute 'em\nPut X in they wood valve, to shoot 'em, they chewed 'em up\nAnd true enough, they would be popping, dropping, pursuing us\nPlus screwing the crew and such, a ruined slut living through a nut\nThat was then but now I see 'em, they be on the same shit\nBrainless, itching to get that quick trip, wanna be painless\nI don't fuck wit it no more, but I can arrange it\nI was like Dracula attacking her, when I give her game, hella vain language\nIt was they choice to trip, I kept her moist and slick\nNow she's an annoying chick, I started avoiding Miss\nGive her them toys and split\nI polluted so many women with bad habits and drugs, I guess I'm poisonous\n\n[Chorus: Liz Suwandi]\nI saw you back where we began\nThen you took me for a spin\nAnd captivated, brought me in and now\nSee I still watch you from a distance\nLost in you, lose all resistance\nPoisonous the way you took me out\nCause yoooooooooooooou ... got the best ... of me\nCause yoooooooooooooou ... got the best ... of me\n\n\n[Liz Suwandi harmonizes to end]", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}