{"songs": [{"title": "Game Over", "album": "The Untouchable", "year": "1997-03-11", "lyrics": "[Intro: Too $hort]\nMan, what's up with these niggas out here\nMad at us 'cause we on top\nI love to see niggas gettin' money\nBetter get it while the gettin' is good\nGet it while you can, man\nAnd stop hatin' me, fuckin' with my shit 'cause I got more hustle than you\nGet yours, get yours baby\n\n[Verse 1: Dr. Dre]\nI'm seeing millions, niggas don't understand\nKnow what? I'm makin' moves, puttin' cash behind plans\nTo blow up, will he style like this\nEveryday I parlay, sip Henny and Tanqueray\nStay in the mix like Alizé\nV.I.P., my shit parked valet\nOn the prowl again to get honeys familiar with the smile again\nSome try to assault Dre, its still cavi\nI'm eatin' steak while they struggle to break the slave mentality\nI givin' livin' definition long as my hearts tickin'\nI fought and made the world listen\nWhatever fly Dr. Dre invented\nTurn on the box and let my son watch these studio clowns on 60 inches\nI push a rover, shit platinum before the sessions over\nRap master with the Houston heat holder\nThese playas best to get they shit in check\n'Cause when I get my hustle on ain't no playin' with a full deck\n\n[Hook: Ice Cube]\nLord please, murda my enemies (Yeah)\nBurn em at a thousand degrees\nAnd lord please let me make mo cheese\n'Cause I ain't quite ready to leave (No)\nLord please, murda my enemies (Yeah)\nBurn em at a thousand degrees\nAnd lord please let me make mo cheese\n'Cause I ain't quite ready to leave (No)\n\n[Verse 2: Scarface]\nBuck the whole world\nMeant that, gotta stay strapped\n'Cause 99.9 a niggas, carry they gats\nSuper fist fightin' shit might come down to dyin'\nWhen the time comes down for the tryin' I got nine\nReasons why niggas shouldn't step in my face\nWith the nonsense, 'cause I'm always heated and you can taste this\nAudi little something out the seams a my trousers\nWith no hesitation I got a team to come clown ya\nI down ya, so let your people know what they face\nWith the type of individual that'll bomb a sub-station\nKaboom! and everybody dies outside\nThere ain't no escapin' the Reaper so don't try\nGo ahead, close ya eyes, who the next to step?\nFace down, hit, bleedin' on the steps a death\nCheck yo self, you just been invaded by true soldiers\nDecember 31st, '96 (the game is over)\n\n[Hook]\nLord please, murda my enemies (Yeah)\nBurn em at a thousand degrees\nAnd lord please let me make mo cheese\n'Cause I ain't quite ready to leave (No)\nLord please, murda my enemies (Yeah)\nBurn em at a thousand degrees\nAnd lord please let me make mo cheese\n'Cause I ain't quite ready to leave (No)\n(I've got all my life to live, plus with all my love to give)\n\n[Verse 3: Dr. Dre & (Scarface)]\nSmokin' weed I never trail, I lead\nSpendin' dough, tripped the cost of a ride like it was pocket money, Gs\nBut these are the things real playas do\nTalkin' shit is real things that the hatas do\nI'm namin' you\nShit's thick, its time to run for shelter\nI kept the word, things could happen to marks like it was Helter Skelter\n(Dear diary, I'm runnin' outta pages\nFadin', in and out, takin' purple hazes\nThe dazes, Revelations in the last stages\nRed skies institute, the silent horns playin'\nI'm prayin' with tears in my eyes\n'Cause I'm tryin' to make it into eternal peace without dyin'\nBut they eyein' my bank account with beams on my rover\nThe killa failed to launch his attack)\nThe game is over\n\n[Hook]\nLord please, murda my enemies (Yeah)\nBurn em at a thousand degrees\nAnd lord please let me make mo cheese\n'Cause I ain't quite ready to leave (No)\nLord please, murda my enemies (Yeah)\nBurn em at a thousand degrees\nAnd lord please let me make mo cheese\n'Cause I ain't quite ready to leave (No)", "image": "https://images.rapgenius.com/4c164d10c36bb521e7960b066aec8b81.400x400x1.jpg"}], "artist": "Scarface"}