{"songs": [{"title": "Who Do You Love (Remix)", "album": null, "year": "2014-01-01", "lyrics": "[Produced by DJ Mustard]\n\n[Verse 1: YG]\nI'm that nigga with the plugs\nI'm the nigga who got homies that be sellin' drugs\nI'm the nigga on the back street\nWith the fire heat, niggas better run like athletes\nI'm that nigga, I'm that nigga\nMy Bank of America account got six figures\nI'm that nigga on the block\nPolice pull up, I'm tryna stash the Glock\nUh, you that nigga on the low-low\nYou're the nigga, you're the one that be talkin' to the po-pos\nPorsche sittin' on Forgi's\nNiggas can't afford these\nThe Panamera shittin' on the 9-11\nI call my homies, not 9-11\nI'm the nigga with the juice\nBut I'll never do my nigga like Pac did Q\n\n[Chorus: YG]\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\n\n[Verse 2: Drake]\nI got a shorty name Texas and\nShe got a buddy name Young JB and now you know the deal\nWe turnt up in the studio late night\nThat's why the songs that you hear are comin' real tight\nOVO crew, nigga, thought I told you\nIf you a player in the game, this should hold you\nAnd man shout my nigga Game he just rolled through\nEatin' crab out in Malibu at Nobu\nA lot of fools puttin' salt in the game\nUntil these women get the notion that they runnin' the game\nThey got money that they jumpin' on the pole to make\nDid the model, took a flight to the golden state\nI'm the general, just makin' sure my soldiers straight\nHad to leave my nigga, homie got an open case\nBut I'm big on the west like I'm big in the south\nSo we gon' pay some people off, we gon' figure it out\nAnd my name too big, and my gang too big\nYoung money shit, me and Lil Wayne too big\nImma crush that ass even if it ain't too big\nI would pinky swear but my pinky ring too big\nWassup\n\n[Chorus: YG]\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\nBitch, who do you love?\n\n[Verse 3: Game]\nBlood Money, Cash Money, and that's all\nI'm the nigga with the crown on his head\nCross me and my city, I put the town on your head\nPut that click clack sound on your head\nMe and YG Tha Dogg Pound wearing red\nMe and my nigga Drizzy runnin' through Miami like LeBron\nShout to Nicki, shout to Tune, shout to Ricky\nRack to the town roll a pound, shout out to Nipsey\n1000 dollar blunts, blow it down if you with me\nGet lost in the cloud, shout to Pac, shout to Whitney\nRollin’ down Wilshire in the Wraith, shout to Biggie\nGot my 2 Chainz on feelin’ like Tity\nCiroc in my glass, no Diddy, just affili\nNo pity and the bitches give me kitty like Miaw\n35 million, how to make it? come and see how\nBallin' in the club, money tall as Boris Diaw\nMe and YG out, now tell me!", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}