{"songs": [{"title": "Let’s Get High", "album": "2001", "year": "1999-11-16", "lyrics": "[Intro]\nAll these niggas and all these hoes in here\nSomebody here gon' fuck\nAll these niggas and all these hoes in here\nSomebody here gon' fuck\nAll these niggas and all these hoes in here\nSomebody here gon' fuck\nAll these niggas and all these hoes in here\nSomebody here gon' fuck\n\n[Verse 1: Hittman]\nTalking that, walking that, spittin' at hoes\nSmoking this, drinking that, gettin' at hoes\nFuck this I'm hitting that I'm hitting em both\nHave one riding dick, one licking my toes\nWhen I'm loving these hoes there ain't no love involved\nNo hugs, no kisses, bear rugs, bare britches\nRare bitches like them hoes in them Black Tail pictures\nBitch jumped off my dick\n(Is that Dre over there?)\n\n[Verse 2: Dr. Dre]\nYeah, I just took some Ecstasy\nAin't no telling what the side effects could be\nAll these fine bitches equal sex to me\nPlus I got this bad bitch laying next to me\nNo doubt, sat back on the couch\nPants down, rubber on, set to turn that ass out\nLaid the bitch out, then I put it in her mouth\nPulled out, nutted on a towel and passed out\n\n[Hook: Kurupt]\nCome on let's get high, high\nLet's get high, high\nCome on let's get high, high\nLet's get high, all my ladies\nLet's get high, high\nHigh, high\nLet's get high, high\nCome on let's get high\n\n[Verse 3: Kurupt]\nI make the four hop\nPull up at the spot\nWeed by the barrels in my G'd up apparel\nStomping in the party\nKurupt, Young Gotti\nI'm fucking something in this bitch\nHit 'em with some gangsta shit\nPut something in your mouth bitch real tasty\nI'm looking real saucy in my gangsta-ass Stacys\nHit the party, ease up, Kurupt with an ounce an'\nGot all the hoes in this motherfucker bouncing\nBouncing\n\n[Interlude]\nYo, whattup, Scruncho?\nMel-Man. what's cracking?\nWassup wit all these ol' punk ass hoes in here?\n\n[Verse 4: Ms. Roq]\nNigga what, I'm a hustling bitch\nI like them get rich niggas\nThem hit the switch niggas\nNiggas bout the sex and which bitch to hit next\nWhile I'm kicking my game and collecting them checks\nGot all y'all niggas vexed to fuck this triple-X rated ho\nYou say you ain't eat it, you ate it though\nAnd uh, Roq don't stop, can't be dropping no drawers\nTo the niggas how you figure got you shitting in yours\nYeah, little dicks always running they mouth\nWhile a bitch is better off to masturbate and be out\nAll you bitches up in here know what I'm talkin about\nGet the loot, get the ice, fuck the wife, no doubt\nTrying to live lavy, marry a big dick and stay cavi\nHolla back at them niggas that hollered at me\nPop the Cris'\nWhip the six and shit\nAnd have all y'all niggas limp when I twist my shit\nYeah, bitch ass niggas", "image": "https://images.genius.com/f9713af0f8164e90022b622002fda842.600x596x1.jpg"}], "artist": "Dr. Dre"}