{"songs": [{"title": "The Town", "album": "Hoodmorning (No Typo): Candy Coronas", "year": "2011-07-29", "lyrics": "[Verse 1 - The Game]\nBack on the block nigga, chains on the rocks nigga\nUsed to move yay, I should throw up the Roc nigga\nBack with the Doc, so I just throw up the 'Math\nEight, two fingers down, get the ski mask\nThis is body bag shit, that open the bag spliff\nCoke in your lung, a muthafuckin monster is what I've become\nBars hotter than Pablo Escobar's stove\nGot the Venice Queensbridge Escobar flow, so\nBrat! Brat! Brat!\n50 rounds'll knock you niggas down, Ben Affleck from The Town This is my town nigga. King, mayor, all that\nNiggas better fall back or bullets in your gallbladder\nP-U-S-S-Y: that's what I call cats\nHardcore, die today if it brought Biggie Smalls back\nEyes low, 7 5/8, Black Wall hat\nR.E.D. Album, bitch, everything else all black\nEyes low, 7 5/8, Black Wall hat\nR.E.D. Album, nigga, everything else all black\n\n[Hook]\nNiggas keep saying that they run this town\nThey don't run this town, nigga I run this town\nNiggas keep playing when we come around\nYeah I run 'em down, they wanted now\nNiggas keep saying that they run this town\nThey don't run this town, nigga I run this town\nNiggas keep playing, I hunt 'em down\nGun 'em down, get a hundred rounds from me\n\n[Verse 2 - The Game]\nNiggas better break bread and niggas better play dead\nI step in front of the beam and take it off of Dre head\nEverything's straight red: my bitch, my car, the tip of my cigar\nMy Philly hat, my scarf\nY'all niggas pushing light weight\nBryon Russell ass niggas falling down, tryna put a hand up in Mike face\nThe fucking booth is in danger, ain't a mic safe\nMike Bibby, Mike Vick, nigga, Mike Jake\n4th album, cause I do my shit the right way\nAnd like Dre the fans gon wait, so have a nice day\nI'mma have a nice bitch sitting in the white 6\nColdest rapper alive: I write with a ice pick\nAnd I write sick, meaning that my bars ill\nFuck the world up, nigga, I'm a oil spill\nIn the 4-wheel, paint job orange peel\nNot like Picasso bitch, but I draw steel\n\n[Hook]\nNiggas keep saying that they run this town\nThey don't run this town, nigga I run this town\nNiggas keep playing when we come around\nYeah I run 'em down, they wanted now\nNiggas keep saying that they run this town\nThey don't run this town, nigga I run this town\nNiggas keep playing, I hunt 'em down\nGun 'em down, get a hundred rounds from me\n\n[Verse 3 - The Game]\nI ain't never gave no fuck, why would I start now?\nEverytime I get on the track, it's black hawk down\nI declare war, pullin' niggas' cards now\nAnd I ain't gotta fuck Sarah Palin to lay the law down\nBirds: knock em all down, you could push record now\nUsed to ball like Chris Paul, I'm John Wall now\nStill bang Dogg Pound, I don't like how y'all sound\nGun-butt a nigga in the grill, try to floss now\nI set the bridge on fire, try to cross now\nStill fuck Benzino, I don't care who run The Source now\nI got magazines inside of magazines\nWalk up, laid everybody on the porch down\nKill the drums cuz the track is a corpse now\nSpread my fingers when I shoot, Kyle Watson, Georgetown\nThink it's a movie then its A.I, Georgetown\nBut if it ain't a court 'round, I'm bustin' with the 4 pound\n\n[Hook]\nNiggas keep saying that they run this town\nThey don't run this town, nigga I run this town\nNiggas keep playing when we come around\nYeah I run 'em down, they wanted now\nNiggas keep saying that they run this town\nThey don't run this town, nigga I run this town\nNiggas keep playing, I hunt 'em down\nGun 'em down, get a hundred rounds from me", "image": "https://images.genius.com/c7e8ae0f47986bad415f5d58fc0b2281.320x320x1.jpg"}], "artist": "The Game"}