{"songs": [{"title": "If It’s Alright", "album": "The Infamous (Demo Tape)", "year": "2014-04-01", "lyrics": "[Produced by Havoc]\n\n[Hook: Prodigy, Havoc, and Big Noyd]\nIt's alright with me if it's all right with you\nBig P representing from the Mobb Deep Crew\nIt's alright with me if it's all right with you\nBig Hav representing from the Mobb Deep Crew\nIt's alright with me if it's all right with you\nBig Noyd representing from the Queensbridge Crew\n\n[Verse 1: Big Noyd]\nI'm representin', you know I'm representing kid check me\nGot to pack the gat when the beef is getting heavy\nI'm going all out\nYou know moves I never fake\nBut every time I blink at night all I see is snakes\nAnd I'm alone\nTrapped in this trife life zone\nBut Fuck it, y'know I'm turning snakes to stones\nYou say to ya man that I'm pussy but you wonder\nYou stupid, I'm putting niggas 6ft under\nSo check my style go deep into foul\nI was catching rats with the tecs since Juvenile\nListen, cut your conversation 'til I'm finished\nI'm about to give the definitions to the rhymes I'm kicking\nReal reality, life is just a tradegy kid\nDon't get mad at me\n'Cus that's the way ya had to be\nStruggling Striving\nAsking why my peoples dying\nIts too late to ask shawty, who got hit with the iron gat\nAll up in his back\nLike my man P said it's that unknown fact\nBut it's like that\nThe drama get iller down in the projects\nCatch a rat with the what what (nickel-plated tec)\nGuns are blasting, bodies dropping to the floor faster\nThan years are passing and I'm gasping for air I swear\n'94 kick it raw. The B-I-G N-O-Y-D kick it hardcore\nEscalate, elevate my rhymes doing another level\nHuh, Im I share my feelings with the devil\n(Im fiending!) No you got me dreaming\nLike Christopher Williams a bip in a BM\n\n[Hook]\n[Big Noyd] It's alright with me if it's all right with you\nBig Noyd representing from the Queensbridge Crew\n[Prodigy] It's alright with me if it's all right with you\nBig P representing from the Mobb Deep Crew\n[Havoc] It's alright with me if it's all right with you\nBig Hav representing from the Queensbridge Crew\n\n[Verse 2: Havoc]\nAyo it's the hard times that got me generating hard rhymes\nI'm confined to the projects running from one time\nConfide in my peoples they confide in me\n'Cus if It's alright with them if it's all right with me\nSo we be, upstairs at the tables planning\nThinking of ways we can make this happen\nOn this planet, I'm struggling\nWanna be hustling\nSo I'm ready to face any kind of repercussion\nIf its Jail or death, crippled up or broke\nThe only thing I'm thinking is slinging that Coke\nTo get on son, hitting niggas off for packs\nOnly niggas from my block 'cus we get down like that\nAs I combat the snakes and rats, watch my back\nDon't wanna be the one caught swallowing cracks\nLooking reazy, before it goes down I be ready on point\nJump on my bike and get deady\nIt's a family thing. I got love for my crew\nPour some beer for the niggas that ain't here (True)\nYeah my man Richie Lou, rest in Peace\nTo my man Poochy you know we still love you\nMy man Loui\nLloyd, WeeWop, and all of that\nMy man Tyeed\nWord Up just keeping it real, Ill Will and you won't stop\n\n[Hook]\n[Havoc] It's alright with me if it's all right with you\nBig Hav representing from the Mobb deep Crew\n[Big Noyd] It's alright with me if it's all right with you\nBig Noyd representing from the Queensbridge Crew\n[Prodigy] It's alright with me if it's all right with you\nBig P representing from the Queensbridge Crew\n\n[Verse 3: Prodigy]\nDon't ask why It's just like that. I was brought up to live the wrong way\nAt night to God I pray\nWill he let me breathe another 24 hours of air?\nI really don't deserve it\nBut really I don't care\nFrom what I see, whatever is, it's meant to be\nSo untill I drop, its the crime life for me\nSome say I need help, because the way i'm living's sick\nI reply, \"Mind your own 'fore you be another vict'\"\nMany years of corruption, what will I end up with?\nNothing but a pocket full of memories of foul shit committed as a youngster\nGrand larcenist/petty thief\nYo imma make this brief\nIn my early years, I was living fouler than most\nSmile all up in your face take your money and get ghost\nShit ain't right\nAnd I might regret it later that night\nWhile I be laying in bed holding my thoughts tight\nWaking up early in the me-our\nDo my thing correct so it don't lead to the pe-nal\n'Cus fuck that shit, I'll rather roam the streets freely\nPlan a box to get\nSend you home hurt, crying, broke feeling upset\nDon't take it personal, I'm only tryna live\nTonight we taking donations so what you got to give?\nThe dirt underneath my fingernails got a story to tell of they own\nAll things is shown, ain't nothing to hide. I speak the raw truth\nUncut\nRewind my whole verse if there is anything you overlooked\n'Cus I don't got time for your bullshit talk\n'cus niggas getting murdered in the streets of New York\nSo at the same time, I'm outside taking mine\nI'm taking yours\n'til I hit the figures in the fours..\n\n[Outro]\nYeah Uh huh\nI wanna give a shout out to my man up north\nMy man Stobo (Yeah) hold your head baby\nBe home in a little while\nNo Doubt, I wanna give a shoutout to all the brothers that's doing it real\nYa know what I'm saying\nWord up\nPeace out to my man T there up north\nRepresenting to the fullest\nMobb Deep in the house (yeah)\nAll the family that passed away\n'95 We won't forget you\n'95 and you don't stop\n...we won't forget you....representing..\n..representing..\n..representing....we won't forget you...", "image": "https://images.genius.com/d36f3c5fdf16cb402e39bef763e25bf4.1000x1000x1.jpg"}], "artist": "Mobb Deep"}