{"songs": [{"title": "Tracey’s Stalker", "album": "Emurge", "year": null, "lyrics": "[Intro]\nWe all got that special someone in our life, ha I know I do\nShoot, but sometimes things don’t always go the way you plan\nAnd that’s when I get mad, and I don’t like when I get mad\nYou won’t like when I get mad, we won’t like I get mad\nHere’s a song I wrote, and it goes like this:\n\n[Chorus]\nGirl you should feel like, somebody’s watching you\nYou ain’t got no privacy\nGirl you should feel like, somebody’s watching you\nDon’t be tryin to hide from me\n\n[Verse 1: Hopsin]\nYou make my life so whack\nOne day my mind go’s snap\nBlew up like nitro gas, call me a psychopath\nYup just like your dad\nAccept I don’t need the alcohol to make me put a scream mask on and give your house a call\nAnd I don’t give a fuck about the law\nCause you won’t have fingers to dial up the cops I just found my saw\nI had enough of you and that’s about it\nYou make me so mad, I don’t get angry I cry and laugh about it\nI’m not the one that’s up at your house every other day\nThat’s knockin at your front door hard and then runs away\nI’m the one with the fucking blade\nThe one that’s at your front door making your ass scream “put the gun away”\nAnd I’m the one up on your roof that’s right\nWith a new flashlight\nWatchin the shit that you do at night\nAnd I don’t care if you ain’t coo with it\nI’ll cut your face off stitch it to mine then murder bitches so they think that you did it\n\n[Chorus]\nGirl you should feel like, somebody’s watching you\nYou ain’t got no privacy\nGirl you should feel like, somebody’s watching you\nDon’t be tryin to hide from me\n\n[Verse 2: Hopsin]\nOh you think that I be creepy?\nLook out your window bitch, you’ll probably see me\nThen get your fucking face shot with BB’s\nI’m from the ghetto I know how to mug you\nShow up on the spot and cut you\nAnd if I beat your ass its cause I love you\nYou fail to see that\nWhore I’m clingy? Don’t be telling me that\nYou kissing him? Damn right this is a jealous-y act\nI’d rather fuck with you instead of relax\nBut when I’m done you can bet I’ll be back\nBitch defending my pack is way crazy\nYou make me stay angry\nYou gonna be in love with me?  Okay maybe\nI don’t wanna turn this into the worst disaster\nI wanna live happily after, chilling with hella laughter\nBut you like the man on some crack\nThis shit led to the macs\nYou lucky that you ain’t got hit in the head with a bat\nI’m already knowing I’m sorta psycho (Haha)\nBut you won’t ever find another dude who loves you more than I do\n\n[Chorus]\nGirl you should feel like, somebody’s watching you\nYou ain’t got no privacy\nGirl you should feel like, somebody’s watching you\nDon’t be tryin to hide from me\n\n[Verse 3: Hopsin]\nI used to make you nice old songs\nNow it’s the psycho songs\nCause I’m the dude you don’t like no more\nI was a nice a guy years a go\nNow you make me miserable\nI had to put this shit up on a track to let these niggas know\n\n[Bridge]\nWhy do I feel like, the police are watching me\nThere’s nothing you can do to me\nWhy do I feel like, the police are watching me\nYou don’t have to look past it’s me\n\n[Deputy Doyle]\nWe have subject Marcus Jamal Hopson in custody now\n\n[Hopsin]\nMan!\n\n[Commanding Officer]\nBring him to the station, Doyle! Now!\n\n[Hopsin]\nAw, man\nYou watch Tracey, you won’t get rid of me\nI don’t care how hard they try\nHow far you hide\nI know where you live, what car you drive (Hahaha)\nThis ain’t the start of the end\nYou gonna see Marcus again, there's no arguing friend\nI’m gonna be given you prank calls from the pen\n\n[Deputy Doyle]\nYeah, right!\n\n[Chorus x3]\nGirl you should feel like, somebody’s watching you\nYou ain’t got no privacy\nGirl you should feel like, somebody’s watching you\nDon’t be tryin to hide from me\n\n[Outro]\nBut I love you", "image": "https://images.genius.com/ec74857b2660ee45e3b1d2e79e99c58d.800x800x1.jpg"}], "artist": "Hopsin"}