{"songs": [{"title": "Hit ’Em Up", "album": "Greatest Hits", "year": "1996-06-04", "lyrics": "[Intro: 2Pac]\nI ain't got no motherfuckin' friends\nThat's why I fucked yo' bitch, you fat motherfucker!\n(Take money) West Side, Bad Boy killas\n(Take money) You know who the realest is\n(Take money) We bring it too\n(Take money)\n\n[Verse 1: 2Pac]\nFirst off, fuck yo' bitch and the clique you claim\nWestside when we ride, come equipped with game\nYou claim to be a player, but I fucked your wife\nWe bust on Bad Boys, niggas fucked for life\nPlus, Puffy tryna see me, weak hearts I rip\nBiggie Smalls and Junior M.A.F.I.A. some mark-ass bitches\nWe keep on comin' while we runnin' for your jewels\nSteady gunnin', keep on bustin' at them fools, you know the rules\nLil' Caesar, go ask your homie how I'll leave ya\nCut your young-ass up, leave you in pieces, now be deceased\nLil' Kim, don't fuck around with real G's\nQuick to snatch yo' ugly ass off the streets, so fuck peace!\nI'll let them niggas know it's on for life\nDon't let the Westside ride tonight (Ha ha)\nBad Boy murdered on wax and killed\nFuck with me and get yo' caps peeled, you know\n\n[Chorus: 2Pac]\nSee, grab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, uh\nWho shot me? But you punks didn't finish\nNow you 'bout to feel the wrath of a menace\nNigga, I hit 'em up!\n\n[Interlude: 2Pac]\nCheck this out, you motherfuckers know what time it is\nI don't even know why I'm on this track\nY'all niggas ain't even on my level\nI'ma let my little homies ride\nOn you bitch-made ass Bad Boy bitches, feel it!\n\n[Verse 2: Hussein Fatal]\nGet out the way yo, get out the way yo\nBiggie Smalls just got dropped\nLittle Moo', pass the MAC and let me hit him in his back\nFrank White needs to get spanked right for settin' traps\nLittle accident murderer, and I ain't never heard of ya\nPoisonous gats attack when I'm servin' ya\nSpank ya, shank ya whole style when I gank\nGuard your rank 'cause I'ma slam your ass in the paint\nPuffy weaker than the fuckin' block I'm runnin' through, nigga\nAnd I'm smokin' Junior M.A.F.I.A. in front of you, nigga\nWith the ready power tucked in my Guess under my Eddie Bauer\nYour clout petty/sour, I push packages every hour; I hit 'em up!\n\n[Chorus: 2Pac]\nGrab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, uh\nWho shot me? But you punks didn't finish\nNow you 'bout to feel the wrath of a menace\nNigga, we hit 'em up!\n\n[Verse 3: 2Pac]\nPeep how we do it, keep it real as penitentiary steel\nThis ain't no freestyle battle\nAll you niggas gettin' killed with your mouths open\nTryna come up off of me, you in the clouds hopin'\nSmokin' dope, it's like a sherm high\nNiggas think they learned to fly\nBut they burn, motherfucker, you deserve to die\nTalkin' about you gettin' money, but it's funny to me\nAll you niggas livin' bummy while you fuckin' with me\nI'm a self-made millionaire\nThug livin', out of prison, pistols in the air (ha ha)\nBiggie, remember when I used to let you sleep on the couch\nAnd beg a bitch to let you sleep in the house?\nNow it's all about Versace, you copied my style\nFive shots couldn't drop me, I took it and smiled\nNow I'm back to set the record straight\nWith my AK, I'm still the thug that you love to hate\nMotherfucker, I hit 'em up!\n\n[Verse 4: Kadafi]\nI'm from N-E-W Jers' where plenty of murders occurs\nNo points or commas, we bring drama to all you herbs\nNow go check the scenario: Lil' Cease\nI'll bring you fake G's to your knees, coppin' pleas in de Janeiro\nLittle Kim, is you coked up or doped up?\nGet your little Junior Whopper click smoked up\nWhat the fuck, is you stupid?\nI take money, crash and mash through Brooklyn\nWith my click lootin', shootin' and pollutin' your block\nWith a 15-shot cocked Glock to your knot\nOutlaw MAFIA clique movin' up another notch\nAnd your pop stars popped and get mopped and dropped\nAll your fake-ass East Coast props brainstormed and locked\n\n[Verse 5: E.D.I. Mean]\nYou's a beat biter, a Pac style taker\nI'll tell you to your face you ain't shit but a faker\nSofter than Alizé with a chaser\nAbout to get murdered for the paper\nE.D.I. Mean approach the scene of the caper\nLike a loc, with Little Ceas' in a choke\nGun totin' smoke, we ain't no motherfuckin' joke\nThug Life, niggas better be knowin'\nWe approachin' in the wide open, gun smokin'\nNo need for hopin', it's a battle lost\nI got 'em crossed as soon as the funk is boppin' off\nNigga, I hit 'em up!\n\n[Outro: 2Pac]\nNow you tell me who won\nI see them, they run, ha ha\nThey don't wanna see us\nWhole Junior M.A.F.I.A. clique dressin' up tryna be us\nHow the fuck they gonna be the mob\nWhen we always on our job?\nWe millionaires\nKillin' ain't fair, but somebody gotta do it\nOh yeah, Mobb Deep, you wanna fuck with us?\nYou little young-ass motherfuckers\nDon't one of you niggas got sickle-cell or somethin'?\nYou're fuckin' with me, nigga\nYou fuck around and have a seizure or a heart attack\nYou better back the fuck up\nBefore you get smacked the fuck up\nThis is how we do it on our side\nAny of you niggas from New York that wanna bring it, bring it!\nBut we ain't singin', we bringin' drama\nFuck you and yo' motherfuckin' mama!\nWe gon' kill all you motherfuckers!\nNow when I came out I told you it was just about Biggie\nThen everybody had to open their mouth\nWith a motherfuckin' opinion\nWell, this is how we gonna do this: fuck Mobb Deep! Fuck Biggie!\nFuck Bad Boy as a staff, record label, and as a motherfuckin' crew!\nAnd if you wanna be down with Bad Boy, then fuck you too!\nChino XL, fuck you too!\nAll you motherfuckers, fuck you too!\n(Take money, take money)\nAll of y'all motherfuckers, fuck you, die slow!\nMotherfucker, my .44 make sho' all y'all kids don't grow!\nYou motherfuckers can't be us or see us\nWe motherfuckin' Thug Life ridas\nWestside 'til we die!\nOut here in California, nigga, we warned ya\nWe'll bomb on you motherfuckers! We do our job!\nYou think you mob? Nigga, we the motherfuckin' mob!\nAin't nothin' but killas\nAnd the real niggas, all you motherfuckers feel us\nOur shit goes triple and 4-quadruple\nYou niggas laugh 'cause our staff got guns under their motherfuckin' belts\nYou know how it is: when we drop records, they felt\nYou niggas can't feel it, we the realest\nFuck 'em, we Bad Boy killas!", "image": "https://images.genius.com/a6d7f93a83ec4f3dde28a749c01a6465.480x480x1.jpg"}], "artist": "2Pac"}