{"songs": [{"title": "On the Run", "album": "Street Hop", "year": "2009-10-20", "lyrics": "[Intro: News Reports]\n\"Shot. They was talking right here, ran up the alley, and then, he was shot. Shot him.\"\n\"A good kid, with a bright future and a fiancée, was killed. The other victim was shot in the back, but is stable. The shooter is still walking the streets, armed and very dangerous.\"\n\n[Dialogue: Royce da 5'9\" & Clerk]\nROYCE: Excuse me, big fella\nCLERK: Hey, hey, how you doing?\nROYCE: How you doing, you got rooms available?\nCLERK: Yeah, what you need? A one-bed, or two-bed?\nROYCE: Uh, one bedroom\nCLERK: Okay. We just need you to fill this out right here, just a lil' information. You know, just in case. All right. Now, how would you be paying for this?\nROYCE: Cash\nCLERK: Cash?\nROYCE: Yeah\nCLERK: Okay. Aight, here are your keys, son. Uh, the elevators are that way, and your room is gonna be on the ninth floor\nROYCE: Aight, have a good night\n\n[Hook: Sample]\nLooking out my window, from my ninth floor hotel room\nI remember that cold, cold, rainy night\nLooking out my window\n\n[Verse 1: Royce da 5'9\"]\nFeeling all alone on the run, I'm still holding onto my gun\nBody on it from the previous evening, I found out I'm wanted\nNiggas snitching is what the media screaming\nI turn the channel on the TV, The First 48 on\nMan, it ain't a loyal nigga on this TV nowhere\nI cut the power off, disgusted\nI'm contemplatin takin a shower to take all the gunpowder off\nBut what if they bust in, busting?\nThe nigga at the front desk act like he don't recognize me\nBut shiiiit, there's a reward for me, that nigga there hustling\nI can't trust him, I gotta keep my eye on that window\nThinking about my kinfolk, wife and babies\nI can't talk to them, life is crazy\nWhoever thought it would come to this over rap nonsense?\nWrapped in the comfort of being attacked by my conscience\n\n[Hook: Sample]\nLooking out my window, from my ninth floor hotel room\nI remember, that cold-cold rainy night\nLooking out my window\n\n[Interlude: Royce da 5'9\"]\nI think I'ma write a letter to my children\n\n[Verse 2]\nIn case, I don't make it\nI'm up against time, but I won't face it\nI'm thinking about my life, what it is now\nAnd how one slug can change what it once was\nI'm accepting the fact that I did that\nI just want my wife back, I just want my kids back\nI just want my niggas that don't snitch back\nCause real niggas know real niggas ain't with that\nBut what's the use of me being real? I'm fucked now\nI'm seeing sirens out the window thinking \"What now?\"\nDamn, am I to do?\nCause now that shit hit the fan, I suddenly ran out of crew\nBut fuck it, I'm in the shit, I'ma end the shit\nNo way for me to benefit though I'm innocent\nI hear a knock on the door like, \"Let's finish this!\"\n\n[Interlude: Police]\nThis is the Detroit police! We got the building surrounded. We know you're in there, asshole. Come out! We're gonna give you to the count of three. One, two,... three! Get the fucking gun! Drop it! Officer down! Officer down! Hold your fire! Hold your fire! Suspect down! I repeat: suspect down!\n\n[Outro]\nThis life is about honor... respect... But more importantly, this life is about choices. You make 'em, and whether they turn out to be good ones or bad ones, you live with them. You die with them. Let's go back to how it all started...", "image": "https://images.genius.com/13187be577e518c77f5c6ac278ec366a.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}