{"songs": [{"title": "Pimp Life", "album": "What’s My Favorite Word?", "year": null, "lyrics": "[Too $hort]\nI chose to live this life\n\n[Devin the Dude - singing]\nI be stickin this dick up in these hoes hoes\n'til a couple of bitches bitches get caught by they niggas\n\n[Devin the Dude]\nNiggas trippin - and for what?\nWhy must he think he 'posed to change her\nWhen she'll give the pussy up even to a, total stranger\nAnd, I'm just one of 'em, you can't trust none of them\nThey'll say they love you while they wipin' your cum on them\nThen they'll run and tell her friends how she found another sucka\nTo pay a fee for pus-sy but not - me, motherfuckahHHH\nI move quick with my pool stick, Slicker than Willie\nSlicker than Kelly, slicker than KY Jelly\nBut really this dick has got me in a lot of trouble recently\nI bend 'em and go in 'em and don't even have the decency\nTo call her, my balls have been leaked of most of their fluids\nI used to put the rubber on and skeet straight through it\nAnd it seems, that I always keep my pipe in these hoes\nKeep my mic at these shows, 'cause that's the life that I chose\n\n[Devin the Dude - singing]\nPimp life!\nI chose to live the - pimp life!\n\n[Bun B of U.G.K.]\nCome talk a walk up in my shoes, pay a couple of my dues\nRoll my boulevard on trues, while your lady sings the blues\nGot everythang to lose, not a damn thang to gain\nI be tryin' to cross the line, but with that I gotta bring the pain\nNow, I tried to compromise, see the other side of the story\nBut that's easier said that done, when it comes to your pride & your glory\nI'm a pimp with a glide in my worries, limp pimp I'ma step when I wreck\nBut my armor's on at all times, cause I gots me a rep to protect\nNow, I mights be known for this, and maybe recognized for that\nBut they be high-beamin me; and I be like where my visors at?\nNowadays I'm a wiser cat, after what I been through I better be\nBack then I woulda broke ya broad, nowadays I just let her be\n'Cause through seconds, minutes, hours, days, weeks, months and years\nMan I reckon that it's power, fuck them freaks, blunts and beers\nThat ain't what I'm supposed to be\n\n[Devin] Pimp life!\n[Bun B] That's the life I chose for me\n\n[Devin the Dude - singing]\nI be stickin this dick up in these hoes hoes\n'til a couple of bitches bitches get caught by they niggas\nNiggas trippin\n\n[$hort] I chose to live the\n[Devin] Pimp life!\n\n[Too $hort]\nYeah, I have menage-a-trois with superstars, one night stands, quickies\nBooty calls, it ain't nuttin for her to just stick around here and lick me\n'Cause I run through broads and never get enough, maybe I'm too selfish\nBut I cain't help it.. can't stay witchu girl cause I can't tell if it's\nOfficial, or just another ritual\nIt's hard for me to find a wife, it's nothin for me to, get a hoe\nI know it sounds, pitiful, sometimes I'm blessed, sometimes I'm cursed\nIf it's supposed to be the best then tell me, what's the worst?\nI'll be a P-F-L, 'til I'm a old nigga\n'Cause I never spend my life with groupies, or gold diggers\nI see these bitches now, shakin' naked, tryna' make it\nIf you spendin all his money take it bitch you can't fake it\nWhen it's real, I'm cappin' like the snub-nosed, they pay me\nI love hoes, never go home when the club close\nI do shows, ride new Vogue's and keep two hoes\nI'm all about this money girl, that's why I chose\nTo live the pimp life\n\n[Devin] Pimp life!\n[$hort] I chose to live this life\n[Devin] Pimp life.. pimp life!\n[Devin] I chose to live the, pimp life\n\n[Big Gipp]\nPeople ask me question bout this, people ask me question bout that\nSay what? I'm a handsome John motherfucker independent of the nasty-ass cuts\nYoung, Gipp, still around the corner in the hood\nGipp, still runnin down in the wood\nGipp, still ridin' out like Vogue's\nGipp, still cruise hundred spokes\nStraight from the 80's ladies\nGrew up in nuttin' but dem Grady babies\nPimpin the game since ninety-six\nCan't sell a big ol' pimp no box of bricks\nGipp put it down for the A-Town to the Bay to the Oakland foothill strip\nToo $hort, Bun B, Devin and Big Gipp yo we all some pimps\nGettin money out the sexual industries\nAt the same, tryin' to get our slice\nNever lookin back twice - livin in the pimp life\n\n[Devin] Pimp life!\n\n[Devin the Dude - singing]\nI be stickin this dick up in these hoes hoes\n'til a couple of bitches bitches get caught by they niggas\n\n[$hort] I chose to live the\n[Devin] Pimp life!  Pimp life.. {*fades out*}", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}