{"songs": [{"title": "Recognize", "album": "Balls and My Word", "year": "2003-04-08", "lyrics": "...Motherfuckers out here rapping for protection\nI'm gonna expose yo ass you bitch...\nSee me in these motherfuckin' streets (don't stop), with ya fag ass\nGangsta Walk, yeah right, ya pussy...\n\n[Verse 1]\nLook out, we everyday grinding\nEverybody in the North gotta love us down South cause we blindin'\nAnd we don't trip the big diamonds\nWe mainly focus on the old schools with big blocks lying\nAnd I been around the world in one day\nChucking up the duece for S.A\nI'm a hood cat, and that's for searching me a hood rat\nWith good cat, something beautiful to look at, fa sho\nI kick it for my niggas in the ghetto\nAnd all my homies in the federal-\nLock up, behind the wall setting shop up\nThey beat the block up, yet and still they couldn't stop us\nDamn it feels good to be a gangsta back at it\nCause I'm the last of the Dons, God damm it\nI hear ya talking, but I don't cater to the chit-chat\nBut when I see you in the streets I got ya get back (word)\nIt ain't enough protection on ya ass, to fuck wit Brad\nI got a lesson for ya ass\nI showed ya, the Southside niggas tote heat\nI showed ya, the Northside niggas roll deep\nYa weak, cause I'm the biggest fish in the pond\nAnd when I say the magic word, bitch ya gone\nAssassinated, people lay steppin'\nEliminated, enemy with aggression\nSit back and smoke me one\nThe Obi Won Kenobi one\nFuck the champagne sippin', woodgrain grippin'\nI'm spittin' for the Vice Lords, gangstas and Crips and Bloods\nAnd everybody neighborhood\nFrom the Idery Wells, back down to Inglewood\nHow can a nigga from the South get a pass in every section\nAnd walk the projects with no protection\nBe surrounded by a mob, and not get robbed\nConsidered to be a savior, and not be God (Whoa)\nListen to the nigga flow now\nI can speed it up or slow down\nFace the facts baby, I got it locked like this and like that baby\nSouthern rap/rock baby\nThe last of a dying, we born again\nThe vicous life religous, I was born to win\nThe closoure after the greatest hit the sofa\nWhen I still ride for Prince like a soldier\nThe two-thousand millenium comes\nSince I'm the son of the father, that makes me the Don\nThe next up to bat, the Jordan, larry, cousy yo of rap\nAnd I ain't gotta walk around strapped\nJ don't tollorate the mack dirties\nYou in our motherfucking way, we tryin' to stack 30s\nNow back it up, for he send something back to you\nAin't plan to defend\nStaying loyal to the Prince to the end, so recognize\n\n[Hook]\nSo what you gone do Face? (Play till I win)\nSo what you gone do? (Double back and do it again)\nSo what you gone do Face? (I'm a play the game 'til I win)\nSo what you gone do? (Play till I win)\nSo what you gone do Face? (Play till I win)\nSo what you gone do? (Double back and do it again)\nSo what you gone do Face? (Play the game 'til I win)\nSo what you gone do? (Then I'm a double back and do it again)\n\n[Verse 2]\nSo here it is fool, I play the game where it's no rules\nDropped out in the 10th grade and told my mom to fuck school!\nCause they ain't teach a nigga shit, I learned to read when I was 5\nAnd plus I been smart a long time\nFuck a history test, I'm more concerned about respect\nI make my moves in an L like a knight nigga check\nIt's on 'til the break of dawn, I keep it on\nAnd on and on, and on and on and on and on\nLike clockwork, we hit these niggas where it hurt\nKnock they dicks in the dirt\nNow you the bitch that's in the skirt\nI'm passed the motherfucka out here paying his dues\nNot the average nigga out here rapping claiming he true\nI just stick to the script and take it in stride\nGet my daily dose of game from James and take it and ride\nYes yes y'all, funky fresh and in the flesh y'all\nThis time I'm aiming at the neck dog\nIt ain't no ducking when I'm bustin', I'm a leave you a nice-\nLittle whole in ya throat, releavin' ya life\nI'm going out with a bang, letting my nuts hang\nI'm outty like flame, the signature just James, recognize\n\n[Hook]\nSo what you gone do Face? (Play till I win)\nSo what you gone do? (Double back and do it again)\nSo what you gone do Face? (I'm a play the game 'til I win)\nSo what you gone do? (Play till I win)\nSo what you gone do Face? (Play till I win)\nSo what you gone do? (Double back and do it again)\nSo what you gone do Face? (Play the game 'til I win)\nSo what you gone do? (Then I'm a double back and do it again)", "image": "https://images.genius.com/c4214083902775e5126f0ba4f0770c9a.969x969x1.png"}], "artist": "Scarface"}