{"songs": [{"title": "Through the Wire (Live from Abbey Road Studios)", "album": null, "year": "2005-09-21", "lyrics": "[Intro]\nYo G, they can't stop me from rappin', can they?\nCan they, ha?\n\n[Hook]\nI spit it through the wire man\nIt's too much stuff in my heart right now man\nI'd gladly risk it all right now\nIt's a life or death situation man\nY'all don't really understand how I feel right now man\nIt's your boy Kanye to the\nChi-town what's going on?\n\n[Verse 1]\nI drink a Boost for breakfast, and Ensure for dessert\nSomebody ordered pancakes, I just sip the sizzurp\nThat right there could drive a sane man bizzerk\nNot to worry Mr. H said the izzles back to wizzerk\nHow do you console my mom or give her light support\nTellin' her her son's on life support?\nAnd just imagine how my girl feel\nOn the plane scared as hell, that her guy look like Emitt Till\nShe was with me before the deal, she been tryin' to be mine\nShe a delta so she been throwin' that Dynasty sign\nNo use me trying to be lyin', I been trying to be signed\nTrying to be a millionaire, how I use two lifelines\nIn the same hospital where Biggie Smalls died\nThe doctor said I had blood clots, but I ain't Jamaican, man\nStory on MTV and I ain't trying to make a band\nI swear this right here is history in the makin' man\nI really apologize how I sound right now man\nIf it's unclear at all, man\nThey got my mouth wired shut for like\nI don't know the doctor said for like six weeks\nYou know we had reconstruct\nI had reconstructive surgery on my jaw\nI looked in the mirror, half my jaw was missing\nIn the back of my mouth, man I couldn't believe it\nI'm still here for y'all right now man\nThis is what I gotta say, right here dog\nYeah, turn me up yeah\nWhat if somebody from the Chi that was ill got a deal\nOn the hottest rap label around?\nBut he wasn't talking 'bout Coke and birds\nIt was more like spoken word except he's really puttin' it down\nAnd he explained the story about how Blacks came from glory\nAnd what we need to do in the game\nGood dude, bad night, right place, wrong time\nIn the blink of a eye, his whole life changed\nIf you could feel how my face felt, you would know how Mase felt\nThank God I ain't too cool for the safe belt\nI swear to God drive a two on the sue\nI got lawyer for the case to keep what's in my safe, safe\nMy dawgs couldn't tell if I looked like Tom Cruise in Vanilla Sky\nIt was televised, there's been an accident like Geico\nThey thought I was burnt up, like Pepsi did Michael\nI must gotta Angel, 'cause look how death missed his ass\nUnbreakable, what you thought they called me Mr. Glass?\nLook back on my life like the ghost of Christmas past\nToys R Us, where I used to spend that Christmas cash\nAnd I still won't grow up, I'm a grown ass kid\nSwear I should be locked up for stupid sh** that I did\nBut I'm a champion, so I turned tragedy to triumph\nMake music that's fire, spit my soul through the wire\n\n[Outro Hook]\nY'know what I'm sayin'?\nWhen the doctor told me I had a um\nI was goin' to have a plate in my chin\nI said, dawg don't you realize\nI'll never make it on the plane now?\nIt's bad enough I got all this jewelry on\nShe can't be serious man\n(For a chance at loving you\nI'd take it all the way\nRight down through the wire\nEven through the fire)\n(Through the fire, to the limit\nThrough the fire, to the limit\nThrough the fire, to the limit\nThrough the fire, to the limit)", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}