{"songs": [{"title": "Shoot ’Em Up", "album": "Nastradamus", "year": "1999-11-23", "lyrics": "[Verse 1]\nOne .44, two .45's\nThree loaded clips, four niggas roll, one nigga drives\nFive hundred Benz, six reasons why this kid should die\nWe shooting every mothafucka outside\nPulled on his block, jumped out the car\nGuns in our hand, at the same time everybody ran\nThere that nigga go, hiding in the crowd\nLet the trigger blow, seven shots now he lying on the ground\nBlood on the floor then we shot some more\nNiggas he was with two niggas hit, one nigga fell\nOne tried to run, go get him son\nMake sure he's done 'fore we bail, I ain't tryna go to jail\nMust handle beef, code of the street, load up the heat\nIf these nigga think they could fuck around\nReal niggas do real things by all means\nNiggas knowing how we get down, it goes\n\n[Chorus]\nShoot 'em up, just shoot 'em up, what?\n(Kill-kill-kill, murder-murder-murder)\nShoot 'em up, just shoot 'em up, what?\n(Kill-kill-kill, murder-murder-murder)\nShoot 'em up, just shoot 'em up, what?\n(Kill-kill-kill, murder-murder-murder)\n\n[Verse 2]\nDriving through roads, Suburban Chevrolet\nSix tinted windows, and I'm on my way\nTo get up with my hoes, I pull up to they house\nNot a freak to be heard, nobody came out\nRinging the bell, where in the hell, could they be at?\nI'm about to leave stepping slow, where my truck was at\nWho the fuck is that? Could it be a jack?\nNow pull my strap, it's my man and we have the same plan\nThere them bitches go, Civic '94\nLooking funny though, open up the car door, funny smile\nFuck two already, third ass was heavy\n\"Nas this is Sherry, Sherry this is Nas and his man, ready?\"\nWalked in the house, snatched off they clothes\nRan through them hoes, plenty ice, that they all seemed to like\nCan't find my man, heard a blam-blam\nNow I'm wondering, \"In this scam, do I even stand a chance?\"\nHe killed the hoes, took all they dough\nFire in his eyes, higher than the sky coming down the stairs\nNow he wanting mine, reaching for my nine\nAiming with our guns at each others face, at the same time\nMy nine on his lips, his fifth on my chin, I start whispering\n\"Put your gun down, we can skip town\"\nRocked him to sleep, pushed back his meat\nLift off his chain, took his shit, emptied out close range\n\n[Chorus]\nShoot 'em up, just shoot 'em up, what?\n(Kill-kill-kill, murder-murder-murder)\nShoot 'em up, just shoot 'em up, what?\n(Kill-kill-kill, murder-murder-murder)\nShoot 'em up, just shoot 'em up, what?\nShoot 'em up, just shoot 'em up, what?\n(Kill-kill-kill, murder-murder-murder)", "image": "https://images.genius.com/d23a600c139bca90fa38b331a4e93acd.1000x1000x1.jpg"}], "artist": "Nas"}