{"songs": [{"title": "Dirty & Stinkin’ (Remix)", "album": null, "year": null, "lyrics": "[scratched up samples]\n\"I said if you could just\" - Ol' Dirty Bastard\n\"First things first, man\" - Ol' Dirty Bastard\n\"The rap assasinator\" - Raekwon\n\"Dirty Bastard\" - Method Man\n\n[Ol' Dirty Bastard]\nThis recordin is dirty and it's stinkin\nFunkier than Peppi Le Pew so I was thinkin, about\nDroppin this single on the charts, lettin ya know\nHey, the kid has heart, I never deny myself as being\nDope, but in my last jam, niggas slept on my notes\nYou thought that I was weak? Huh? Let me speak\nMy rhymes come funkier than ya grandfathers feet\nSo listen mister, don't you ever forget\nThe rhyme is dirty, you couldn't even clean it\nWith Comet, for even Wolrex, some tried Ajax\nOnly mix with the best, forty-eight tracks\nYo, I get down with the Ason sounds\nLyrics that be flowin from miles around\nSo let the music shut ya ass up, then feel the uppercut\nNow I make ya fall to ya butt\n\n[Chorus: samples scratched]\n\"Watch out for...\" - Prodigy\n\"The Ol' Dirty Bastard\" - Ol' Dirty Bastard\n\"The O.D.B.!\" - Ol' Dirty Bastard\n\"First things first, man\" - Ol' Dirty Bastard\n\"Watch out for...\" - Prodigy\n\"The rap assassinator\" - Raekwon\n\"Dirty Bastard\" - Method Man\n\"I said if you could just\" - Ol' Dirty Bastard\n\"Go back\" - Ol' Dirty Bastard\n\"The O.D.B.\" - Ol' Dirty Bastard\n\"First things first, man\" - Ol' Dirty Bastard\n\"Watch out for...\" - Prodigy\n\"The rap assassinator\" - Raekwon\n\"Dirty Bastard\" - Method Man\n\n[Ol' Dirty Bastard]\nYo, let me continue, verse number two\nStyle is wild, dirty and stinkin like doo-doo\nIf ya hangin around, ya changed ya mind\nIt is a bad influence, but yo it's my rhyme\nI sit down and I say to myself, \"Self\nYo, are you rated top the shelf?\"\nI drop the single for you to get a dose of\nAs I lay back like a pillow on a sofa\nGettin paid? Yeah right, Willy\nWhy askin me, G? What? What? What? What? You know me\nMy mouth is sugar, sweet as a honey bee\nTaste like a forty, stinkin like Old-E\nBut I drink Ol' English so I speak Ol' English\nYou gotta be dirty and stinkish\nAnd if it's not, well I guess I'm not\nThe A-S-O-N my friends, it's dirty and it's stinkin'\n\n[Chorus]\n\n[Method Man]\nI'm not a statuatory raper\nI'm _naughty_, but girl that ain't my _nature_\nJohnny Cash all about this paper\nYou playin' wit the big boys now, we rated r\nThis no place for a child, 17, not allowed\nWithout a parent and it's apparent that you belong\nWit a full grown man wit a mind just as strong\nHuh, so here's ya chance to advance\nGet in ya stance and we gon' set up it off like true romance\nAnd that's my word\n\n[Chorus #2: scratched samples]\n\"I said if you could just\" - Ol' Dirty Bastard\n\"Go back\" - Ol' Dirty Bastard\n\"The O.D.B.\" - Ol' Dirty Bastard\n\"First things first, man\" - Ol' Dirty Bastard\n\"The rap assassinator\" - Raekwon\n\"Dirty Bastard\" - Method Man\n\n[Chorus]\n\n[Chorus #2 2X]", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}