{"songs": [{"title": "Yes", "album": "Poindexter", "year": "2009-09-17", "lyrics": "Yes, I'm Mr. Big Stuff\nYeah, my stuff big, man\nKeep a girl's pussy bright red like a pig's tan\nFour shots and watch me lean like a kick stand\nI really need to change my name to, \"Hey, I'm a big fan!\"\nCause that's all I hear when I'm outside\nAnd my hoodie's never jealous of that tie-dye\nCheesy on the mic, like I'm laying on Jordan\nNo homo for you niggas homophobic\n\nYes, I back bend these girls aerobic\nAnd these hoes got a Spiderman like Tobey\nKeep these girls wet, call them Lakers like Kobe\nGot money trees, asking me, \"Do you grow me?\"\n\nLatin girls kiss my feet like they're Superga\nLatin girls see your face and call you \"stupida\"\nYes my name is Childish, so I guess I'm cheesy\nYes yes yes my wallet's cheesy\nThrow your hood up, are you queasy?\n\nYes, I am the Juggernaut\nYes, my name is Elroy\nYes, my dick will make that ho tell, like a bell boy\nAnd I get my tip, and my tip is in your girl\nAnd I'm gonna bust a nut like I'm a Gallagher squirrel\n\nIt's the man of the hour\nBetter yet, the century, check the whiskey sour\nLookin' like I'm drinkin' piss\nHow's he fuckin' thinkin' this\nEasy, I'm a mentalist, but I'm not on CBS\n\nUh, yes it's me Bam-B\nWhat is your daughter to do?\nI've been doing this ever since Harry Potter was new\nBoy! I don't play, I change games, I am too real\nSo my words stay hard like a blue pill\n\nI like pink, it always looks good on me\nAnd I like pink, it always looks good on me\nThat second part I was talking about vagina, homie\nFuck the game at an early age, now there hymen on me\n\nYes, I am a magnet\nYes, I do attract it\nRemember when these fake ass niggas called me faggot?\nCause I had glasses and a pink track jacket\nNow those things are assets to help me get some asses\nNow these nerdy hoes keep asking me to smash it\nBullies from middle school chatting on my Twitter status\nFuck you, you don't get shit from now on\nUnless you got a demo tape, then I can lay some brown on\n\nIt's the B to the AMBI, colors like candy\nNigga, I'm the Army. I'm being all I can be\nYes I dress dandy. Get a Klu, like the Klan B\nI live hard, I never sleep in, like an Amby\n\nThis is for the niggas thinkin' different\nWhile their friends are flippin' pigeons in they're stay po-pimpin'\n\nHe never lets the best go past him\nMy life says yes like it's having orgasms", "image": "https://images.genius.com/f91040fed34bb62107112ee6d6c78059.320x320x1.jpg"}], "artist": "Childish Gambino"}