{"songs": [{"title": "Psycobetabuckdown", "album": "Cypress Hill", "year": "1991-08-13", "lyrics": "[Verse 1: B-Real]\nI increase my throttle, uplift my shuttle\nTribe in a huddle, pilot on auto - bro\nI'm not a role model, more like a psycho\nA Bates type of psycho, cuttin' you like Michael\nHalloween character, or computer wizard\nHit you with the blizzard, cut your circuit with my scissors\nShorts'll get crossedwired, you're in the crossfire\nYou get blasted, you dumb-ass bastard\nSee you need the day-ta *, better I say dah-ta * * (data)\nYou're looking at the Tribe, and you're a hater\nComin' from inside, means I come better\nOr should I say rather, together I'm gonna set ya\nHead in the casket, your body in a basket\nA tisket, a tasket -- I told ya I'm gonna blast ya\nWhen I'm on the psycobeta, state of\nMind over magnum, you know I'm gonna tag them\nYou're gonna get funked when I buck ya down\nYou know you're gonna get funked when I buck ya down\nYou know you're gonna get funked when I buck ya down\nWhat you're runnin' from is a psycobetabuckdown!\n\n[Hook]\n[B] Psycho, alpha, disco, beta\n[S] Psycobetaduckdown baby!\n[B] Psycho, alpha, disco, beta\n[S] It's a psycobetaduckdown! Huh!\n[B] Psycho, alpha, disco, beta\n[S] It's a psycobetaduckdown!\n[B] Psycho, alpha, disco, beta\n[S] Somebody's gettin' bucked down\n\n[Verse 2: B-Real]\nSee I'm from South Central, bustin' out my metal\nRapid-fire petal, funk is making me get mental\nYo, it make no sense, so here son the scalpel\nSen start the massacre as I get nasal\nThe phase'll be like a murderer's maze yo\nYou won't find B-Real, inside any kind of cage yo\nSen is the gangsta, me I'm just a pimp\nBroads swingin' off my dick like a chimp, simpin'\nSo what's the story - you come looking for me?\nBetter just scatter, or you're gettin' leaded\nI'm the one who said it, boy it doesn't matter\nYou're gonna get splattered with my funky ill juice\nCause I'm \"The Phuncky Feel One\", makin' you get real loose\nMy intellect, dialect, dialogue, intellect, catalog\nFrom what you want me to select\nDifferent forms of beta, psycho for alpha\nThe way I stay in control of myself\nI'm not one of many penny ante on the gauges\nIn the stone ages, make minimum wages\nShow me where the stage is, I come to get the brain on\nHEY MAN, get the fuck off the 'caine bro!\nYou're gonna get funked when I buck ya down\nYou know you're gonna get funked when I buck ya down\nYou know you're gonna get funked when I buck ya down\nWhat you're runnin' from is a psycobetabuckdown!\n\n[Hook]\n[B] Psycho, alpha, disco, beta\n[S] It's a psycobetaduckdown baby!\n[B] Psycho, alpha, disco, beta\n[S] Psyco-beta-rrific, in profile\n[B] Psycho, alpha, disco, beta\n[S] It's a psycobetaduckdown!\n[B] Psycho, alpha, disco, beta\n[S] Somebody's gettin' bucked down\n\n[Outro: B-Real]\nPsycho, alpha, disco, beta\nYo where's the hooda?\nHahaha, funky, yeah\nI don't like that crazy shit man..", "image": "https://images.genius.com/c219dd3c8a82f4fe8368158d27c1a173.897x887x1.jpg"}], "artist": "Cypress Hill"}