{"songs": [{"title": "Only God Can Judge Me", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro: 2Pac]\nOnly God can judge me (that right?)\nOnly God can judge me now\nNobody else (nobody else)\nAll you other motherfuckers get out my business (really)\nOnly God can judge me now\n\n[Verse 1: 2Pac]\nPerhaps I was blind to the facts, stabbed in the back\nI couldn't trust my own homies, just a bunch of dirty rats\nWill I succeed? Paranoid from the weed\nAnd hocus pocus, I try to focus, but I can't see\nAnd in my mind I'm a blind man doin' time\nLook to my future, ‘cause my past is all behind me\nIs it a crime to fight for what is mine?\nEverybody's dyin', tell me what's the use of tryin'\nI've been trapped since birth, cautious ‘cause I'm cursed\nAnd fantasies of my family in a hearse\nAnd they say it's the White man I should fear\nBut it's my own kind doin' all the killin' here\nI can't lie, ain't no love for the other side\nJealousy inside, make 'em wish I died\nOh my Lord, tell me what I'm livin' for\nEverybody's droppin', got me knockin' on Heaven's door\nAnd all my memories of seein' brothers bleed\nAnd everybody grieves, but still nobody sees\nRecollect your thoughts, don't get caught up in the mix\n‘Cause the media is full of dirty tricks\n\n[Chorus: 2Pac]\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me now\nOnly God can judge me, only God\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me\n\n[Flatline]\n\n[Verse 2: 2Pac]\nI hear the doctor standin' over me, screamin' I can make it\nGot a body full of bullet holes, layin' here naked\nStill I can't breathe, something's evil in my IV\n‘Cause everytime I breathe I think they killin' me\nI'm havin' nightmares, homicidal fantasies\nI wake up stranglin', tangled in my bed sheets\nI call the nurse ‘cause it hurts to reminisce\nHow did it come to this? I wish they didn't miss\nSomebody help me, tell me where to go from here\n‘Cause even thugs cry, but do the Lord care?\nTry to remember but it hurts\nI'm walkin' through the cemetery, talkin' to the dirt\nI'd rather die like a man than live like a coward\nThere's a ghetto up in Heaven and it's ours\n\"Black Power!\" is what we scream\nAs we dream in a paranoid state\nAnd our fate is a lifetime of hate\nDear Mama, can you save me? And fuck peace\n‘Cause the streets got our babies, we gotta eat\nNo more hesitation, each and every black male's trapped\nAnd they wonder why we suicidal running 'round strapped\nMr. Police, please try to see\nThat there's a million motherfuckers stressin' just like me\n\n[Chorus: 2Pac]\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me now\nOnly God can judge me, only God\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me\n\n[Interlude: 2Pac]\nThat which does not kill me can only make me stronger\nThat's for real\nAnd I don't see why everybody feel as though\nThat they gotta tell me how to live my life\nYou know?\nLet me live, baby, let me live\n\n[Verse 3: Rappin' 4-Tay]\nPac, I feel ya, keep servin' it on the reala\nFor instance, say a playa-hatin' mark is out to kill ya\nWould you be wrong for buckin' a nigga to the pavement?\nHe gon' get me first, if I don't get him fool start prayin'\nAin't no such thing as self-defense in the court of law\nSo judge us when we get to where we're goin wearin' a cross\nThat's real, got him, lurked him, crept the fuck up on him\nSold a half a million tapes, now everybody want him\nAfter talkin' behind my back like a bitch would\nTellin' them niggas, \"You can fade him\"\nPunk, I wish you would\nIt be them same motherfuckers in your face\nThat'll rush up in your place to get your safe\nKnowin' you on that paper chase\nGrass, glass, big screen and leather couch\nMy new shit is so fetti, already sold a ki or ounce\nBitch, remember 2Pac and 4-Tay\nThe same two brothers dodgin' bullets, representin' the Bay\nPac, when you was locked down, that's when \"I'll Be Around\"\nStart climbin' up the charts, so sick, but they tried to clown\nThat's why they ride the bandwagon\nStill be draggin', sellin' lies\nDon't think I don't see you haters, I know y'all in disguise\n\n[Verse 4: 2Pac]\nGuess you figure you know me, ‘cause I'm a thug\nThat love to hit the late night clubs drink them buds\nBeen livin' lavish like a player all day\nNow I'm bout to floss 'em off, player shit with 4-Tay\n\n[Chorus: 2Pac]\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me now\nOnly God can judge me, only God\nOnly God can judge me\nOnly God can judge me, only God\nOnly God can judge me\n\n[Outro: 2Pac & Rappin 4-Tay]\nOnly God man\nThat right?\nThat’s real\nHahahahahaha\nFuck everybody else, you know what I’m sayin'?\nMan, look here, man\nMy only fear of death\nIs comin' back to this bitch reincarnated, man\nThat’s for the homie mental\nHehehehe\nWe up out", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}