{"songs": [{"title": "Show Out", "album": "Mr. Philadelphia", "year": "2010-08-08", "lyrics": "[Verse 1: Meek Mill]\nAll this money in my pocket I be showing off\nWhen they play me in the club them hoes be going off\nThey heard that Make 'Em Say and they thought I was going soft\nBut I'm like coca in the pot cause I be going hard hard\nNiggas check my resume\nCatch me in that Aston with my bad bitch her name Desiree\nFuck shit I don't ever say, my niggas don't ever play\nWe stunt on shit like everyday and trust me I don't ever hate\nI be on that money shit, you be on that funny shit\nI never count no dollar bills and never fuck no bummy bitch\nShe say why you go so hard, cause I be on that hungry shit\nI think I ate so many Benjamins my fucking tummy sick\nSpit up all my shit up\nNigga play around with me I guarantee you he get hit up\nThis a stickup, take your ho\nNiggas tried to take my flow but I just had to snatch it back\nYou know I ain't having that\nMatter fact you can keep em cuz I switch em like my bitches\nAnd I change em like my clothes and its the same just like my hoes\nNiggas ain't fucking with me\nOut my range, just like my rolls\nBecause I shine even in the dark and in the light I even glow\nEvery where I go out\nAll I do is show out\nMe against these other rapper niggas, that's a blowout\nI could fuck your girlfriend, we don't even go out\nShe say she on the monthly ok Imma fuck her throat out\nYou mad we eatin' doe\n[?] got them bricks he moved them birds just like Meechie though\nBring 30 tomorrow and that's for sure that he gone feed you though\nCuz my swag on 100 and I got to feed your flow\nLA down MIA, MIA to Philly bitch\nCatch me out in ATL with TI and we killing shit\nWe be photo posing, polo horsing and I'm willing\nHe like hello all my diamonds vvs yellow and I'm stealing shit\nTykeem he stay killing shit, you know I'mma murder it\nI can make a nigga beat sound like you never heard of it\n40,000 people with a mixtape, no nervous shit\nI step up on the stage and treat that bitch like I was Jay\nAll I do is show out! I say all I do is show out! I say all I do is show out!\nShow! show out! show out!", "image": "https://images.genius.com/02fee89da0cebb67c2da7a31768e15c2.500x500x1.jpg"}], "artist": "Meek Mill"}