{"songs": [{"title": "The Syndicate", "album": "Power", "year": "1988-09-13", "lyrics": "[ Ice-T ]\nLiquid, solid, gas - we'll be kickin ass\nIn any form, or matter, or mass\n(This ain't science class) I know but it's science\nFrom the rhyme boss of the Syndicate alliance\nBallin', makin' ya feel the growth\nRhyme Syndicate brotherhood, we rock a blood oath\nRadical posse down to death\nWhile your crew's on the tape, Donald-D break\n\n[ Donald-D ]\nSyndicate comin through, I'm talkin to you\nFlexin hardcore, what could you do?\nWhen we roll up you send your girl up to the crib-o\nIs it Rambo? No, the mic ammo\nStompin you down on the ground, task forces\nLet you know Rhyme Syndicate bosses\nAny show, any tour, we house program\nDonald-D is who I am, damn\n\n[ Hen-Gee ]\nAtttempt to do this, boy, you're takin a risk\nCause my voice sounds doper than a compact disc\nStyles and lyrics, precise right in the pocket\nStupid dope beats and Evil E rocks it\n( ? ) straight from my heart\nMy jam is sure to hit the top of the charts\nRam is my sign, he's different from all kinds\nRock you all of the time, just form a single line\n\n[ Ice-T ]\nA lot of MC's like to talk 'bout they self\nA first-grade topic, I think you need help\nHow many time on one album can you say you're def?\n\"I'm baaaad\" - Yo punk, save your breath\nThat's weak shit from a weak mind\nAnd a weak mind creates weak rhymes\nYou ain't never kicked knowledge one time\nJust livin on your own dick (that's a crime)\nHomeboy, why don't you talk about somethin\nYou just talkin loud and sayin nothin\nAnd if you get mad, sorry brother\nAnd when you're in LA, watch your colors\n\n[ Donald-D ]\nI'm a MD, but no medical doctor\nMic-Dominator Donald-D has got you\nComin to the jamboree to hear the poetry\nAnd when you break north, the melody\nStick to your mind like paste, it can't be erased\nFace to face I overpower like bass\nTo the climax, I don't carry a sax\nI carry a axe to tax and wax those who rap\n\n[ Hen-Gee ]\nBorn in Brooklyn, crib West Coast\nMC's I toast, you that talk most\nTrash, noise, can't throw, get with it\nComin from the mouth of Hen-Gee from the Syndicate\nBallers, mafia down to throw\nGangsters, convicts throwin solid blows\nStart prayin, your sisters I'm layin\nI'm Hen-Gee, a Spinmaster, hear what I'm sayin?\n\n(Party on the dancefloor)\n\n( *DJ Evil E cuts up* )\n(Evil E's in the place)\n(Doggin the wax)\n\n[ Hen-Gee ]\nAn organization, alliance, no duplication\nRhyme Syndicate, a strong creation\nThe Syndicate's stronger day by day\n12-gauge leave suckers brutally..\nLayin in a ( ? )\nYour lines are thin, Hen-Gee came to win\nDon't talk a bunch, just known to crunch\nMy one-two punch will put your butt out to lunch\n\n[ Donald-D ]\nFull-court pressure's what I'm applyin\nNo relyin on the next man, roar like a lion\nFlexin, plexin ultra, the Bronx is my culture\nStrikin hard like a vulture\nFlingin, I'm slingin my hammer like Thor\nNo singin, bringin it raw to the core\nShogun assassin maxin in a limousine\nYou stick your head in, out comes the guillotine\n\n[ Ice-T ]\n( ? ) the game as I kick it\nDon't miss it, get with it\nDiss it, you're a knucklehead evicted\nFrom the crowd that's proud to be the Syndicate connection\nRespect mandatory, up is the direction\nI stand alone, one man that's true\nBut you, my crew, you're on my side\nWe're on a ride\nPower and pride is our gift\nAnd you're down with\nThe Syndicate", "image": "https://images.genius.com/90b363e617bc82f06e45c5cc1d830e6a.1000x1000x1.jpg"}], "artist": "Ice-T"}