{"songs": [{"title": "Who’s On Top", "album": "I Came From Nothing 2", "year": "2011-12-20", "lyrics": "[Intro: Young Thug]\nMPA, what up?\nIt's Thugga, Thugga baby\nGot my whole crew behind me\n\n[Chorus: Young Thug]\nI want you to say, say\nR.I.P. to my big dawgs, let's pray\nMe falling off any time soon? No way\nI'm ballin' for a lifetime and a day\nAnd I get money, that shit run in my family\nLet them goons get on your head, yeah they from Los Angeles\nAnything I ask them to do, do believe they handle it\nI got one question just answer it\nWho's on top?\n\n[Verse 1: Lil Duke]\nAnd I'm sitting back thinking of a master plan (What you thinkin' 'bout?)\nTrap going crazy, we smoking shit from Amsterdam (We on that loud now)\nI been doing this for a very long time now (How long?)\nThe only option is climbing up, ain't no falling down (Ain't no fallin' down)\nAnd I been a Young Thug (Thugga), and I'ma get wicked 'bout that paper (Wicked)\nMomma always told me to shit on all haters (Rrr)\nThey're real VVS ones or you can call 'em glaciers (Them VVs)\nComin' to get they cash, this ain't the movie Takers (This ain't the movie)\nSend me a scout, send me a scout, I could shoot the work (I could shoot the work)\nI don't need no shooter with me 'cause I'm shooting first (Bitch, I'm shooting first)\nI'm such a boss, somewhere eating a healthy meal\nRunnin' in and out the marina (Where you at?), we in Beverly Hills (Duke)\n\n[Chorus: Young Thug]\nSay, say, hey (Ayy, what you tell 'em Thug?)\nR.I.P. to my big dawgs, let's pray (Ayy, put your lighters up)\nMe falling off any time soon? No way (I can't come down)\nI'm- I'm- I'm ballin' for a lifetime and a day (Hey)\nAnd I get money (What? What?), that shit run in my family (Okay, cool)\nLet them goons get on your head, yeah they from Los Angeles (Yeah, yeah, yeah, what?)\nAnything I ask them to do, do believe they handle it (Yeah, yeah)\nI got one question just answer it (Yeah, yeah)\nWho's on top?\n\n[Verse 2: Wicced]\nThey got me thinkin' like Einstein with the number (Number)\nI got a money vision, all I see is commas (Commas)\nI want the sleep dreaming, going down the money tunnel (I dreamed)\nDreams come to reality, don't you wake me for nothin' (Right now)\nI'm livin' out my dream, everyday countin' money (Count up)\nRental car traffic traffickin', movin' strong packages (Strong)\nI stay strapped so the kid move rapidly (Ooh)\nAin't shit sweet, let the iron fill his cavity (Brrt)\nGoons on go, and they kill for the passionate (Brrat)\nBitch I got a money high, I think I lost gravity (I ain't comin' down)\nAnd it ain't shit you can tell me (Nah)\nMoney runnin' out the ass, you can smell me (Ha)\n\n[Chorus: Young Thug]\nI want you to say, say (Hey, hey, hey, ayy, what you tell 'em Thug?)\nR.I.P. to my big dawgs lets pray (Ayy, put your lighters up)\nMe falling off any time soon? No way (I can't come down)\nI'm- I'm- I'm ballin' for a lifetime and a day (Hey)\nAnd I get money (What? What?), that shit run in my family (Okay, cool)\nLet them goons get on your head, yeah they from Los Angeles (Yeah, yeah, yeah, what?)\nAnything I ask them to do, do believe they handle it (Yeah, yeah)\nI got one question just answer it (Yeah, yeah)\nWho's on top?\n\n[Verse 3: Young Thug]\nOh, who's on top? (Who's on?)\nEveryone's on top (Haha), so let's see who flopped (Better not fall, nigga)\nYeah, this a wonderful life (Yeah)\nMy goons'll kill a nigga for such a wonderful price (Brrat, brrat, brrat)\nMy weed smell like poop rocks (Ayy, what, ha)\nMy blunts are extra fat like a tree top (Hey, hey)\nI say, I smoke weed until I pass out (I smoke weed all day)\nHaiti Slang's the reason why you bitch got her ass out (Okay, cool)\nI know Haitians that'll take over the city (They'll take your city over)\nMake big dogs feel like midgets (Yeah, take your shit over)\nChickens, my J.R. no crickets\nYou wanna get it? I'll eat you alive (Talkin' 'bout)\n\n[Chorus: Young Thug]\nSay, say, hey (Ayy, what you tell 'em Thug?)\nR.I.P. to my big dawgs, let's pray (Ayy, put your lighters up)\nMe falling off any time soon? No way (I can't come down)\nI'm- I'm- I'm ballin' for a lifetime and a day (Hey)\nAnd I get money (What? What?), that shit run in my family (Okay, cool)\nLet them goons get on your head, yeah they from Los Angeles (Yeah, yeah, yeah, what?)\nAnything I ask them to do, do believe they handle it (Yeah, yeah)\nI got one question just answer it (Yeah, yeah)\nWho's on top?", "image": "https://images.genius.com/05e3961a9ac62f65057356629bb5559c.500x500x1.jpg"}], "artist": "Young Thug"}