{"songs": [{"title": "No Competition", "album": "Follow the Leader", "year": "1998-07-26", "lyrics": "[Verse 1]\nCompetition is none\nI remain at the top like the sun\nAnd I burn whoever come in the chambers of torture I caught ya\nYou should have brought ya\nNeighborhood to support ya\nNo one in my path can withstand\nUnder pressure the wrath of a swift man\nYou name the day, the grounds could be neutral\nSpeak your piece, the feeling's mutual\nWe can go topic from topic whenever I drop it\nTry to stop it\nIn other words, what the brother heard\nHe tried to catch it, but what occurred\nWas too much weight for one brain to take\nTry to concentrate maintain then elevate\nFrom gram to ounce from pound to pound\nThe matter of weight can't hold my mind down\nPermanent damage, I do away with\nNo time for fun, cause I don't play with competitors\nIt's only one when I'm done\n\nCompetition is none\nIt's no competition\n\n[Verse 2]\nCompetition is none\nI'm the sole survivor, emcees get live but I get live-r\nIt ain't a Memorex, live in concert\nIn every network, the R's the expert\nWhoever goes against causes friction\nIntroduction, music, where's the mixing\nRa will never die, soon they'll never try\nTo beat or defeat me because whenever I\nPut poetry in motion\nFrom the Nile, then out to the ocean\nThree-fourths of water makes seven seas\nA third of land, 360 degrees\nI circulate and remain to rotate\nSeven days a week at a quick or a slow rate\nBe prepared whenever I come\n\nCompetition is none\nIt's no competition\n\n[Verse 3]\nCreator, the alpha. Bet. Let's communicate\nWhen I translate, the situation's straight\nNo dictionary's necessary to use\nBig words do nothing but confuse and illuse\nFrom the first step, my concept is kept\nTo the end of the rhyme, it get more in-depth\nAll thoughts I come across, my mind's the source\nMade by the R, of course\nSeven holes in my face as I'm looking out my window\nSpeak with the beat and it seems like the wind blows\nThrough the speakers, I hear it so pump this\nAnd we can fill up the whole circumference\nWith competition, on an impossible mission\nComing up with nothing, keep fishing\nNo runner up, just lost or forfeits\nThey all get butterflies, soon as the door gets\nUnlocked, lines for blocks and blocks\nMight be trifling, to call the cops\nBring along paramedics\nBut that won't help you, not even calisthenics\nI'm God, G is the seventh letter made\nRaining on rappers, it's no parade\nSo if you ain't wise, then don't even come\n\nCompetition for this and the mixin is none\nIt's no competition\nCompetition is none!", "image": "https://images.genius.com/9b590ab143a3ba007bcb44a5bd6af57b.953x953x1.jpg"}], "artist": "Eric B. & Rakim"}