{"songs": [{"title": "My Jeep", "album": "Summer Knights - EP", "year": "2013-10-28", "lyrics": "[Hook: Chuck Strangers]\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nYou remind me of my Jeep\nI wanna wax it\nIn traffic, in traffic\n\n[Verse 1: Joey Bada$$]\nSwitchin lanes, I'm swervin\nGetting brain I'm learning\nNigga getting burn, how he gettin his earning\nTurn me to ashes, I put it on they asses\nBack from the dead with the dead button\nDash is the fastest, swervin' thru traffic\nDon't worry I'll catch him I'm barely distracted\nAttractive bad bitch tryna get wax like my hash is\nAnd if you crashin know pussy cats get caskets\nDon't get gassed, and if you clutch just know these blunts won't get passed\nI put your guts in a open bag, why you toten that?\nWhere ya tokens at? This just ain't potent packs shit is choking gas\nSim simmer who got the keys in the bimmer?\nWho see police in the mirror? Who do Mach 3 speeds on the highway?\nBeast coast where I lay won't stop till my day\n\n[Hook: Chuck Strangers]\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nYou remind me of my Jeep\nI wanna wax it\nIn traffic, in traffic\n\n[Verse 2: Issa Gold]\nRacing in my drop top, one god one pop\nShawty going on about her main how his team flop\nShe mesmerized as I hit her mind\nHow I hit her spot back at my spot right on my mothers couch ouch\nWe on that Brooklyn shit, speeding soulfully thru the game\nLiving up fuck your fame I'm above uh\nGrowin' up they say you never really change\nBut since my younger days I been switchin' lanes paving the way\nSchool we never showing up, home with homies rollin' up\nSittin' in the back of the bus pourin' a 40 up\nNiggas never quacking at us, homies'll fold em up\nWorld about to end so whaddup, lets roll the whole thing up\nYeah the whole OG, keep it in motion\nBeast Coast yeah we chosen, nigga sick got the potion\nI'm hoping the knowledge me and my niggas spoken\nWill find  a nigga in the villa smoking on something potent\nYou niggas is fucking hopeless, and me and my niggas focused\n\n[Hook: Chuck Strangers]\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nYou remind me of my Jeep\nI wanna wax it\nIn traffic, in traffic\n\n[Verse 3: Meechy Darko]\nLawd ah Mercy!... uhh\nI'm sitting in the whip dreaming about tactics\nOn this rap shit and how to make my cash flip\nYou need practice, I already get my ass kissed\nFlows nasty I could probably sell a blank disk\nKate Moss tee on 28 grams bitch I get my OZ on\nLaney 14's bitch I get my OG on\nGot on Christian Dior but we living like we demons\nTalking shit and rolling up thats the wave that we on\nMCM jacket, gold teeth like I'm Jerome\nTea shroomed up, acid drops in my cup\nDon't just sit there girl what's up\nPop that pussy crack a dutch, and roll it up take one puff\nRubber cover me up, you know some women are crazy\nLil nigga ain't mine—that Trojan got yo' baby\nShe said, \"Meech—don't even try to play me.\"\nI switched gears; Jeep went \"Ehr!\" like Jamie\n\n[Hook: Chuck Strangers]\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nLa la la la la\nYou remind me of my Jeep\nI wanna wax it\nIn traffic, in traffic", "image": "https://images.genius.com/60f61a2b14144b0d03132d7b42297d35.550x550x1.jpg"}], "artist": "Joey Bada$$"}