{"songs": [{"title": "Bring It to Da Cypher", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "[KRS-One]\nEvery once in a while\nYou got to put aside childish things\nAnd get with the teachers and the kings\nK-R-S... Truck Turner...\nBring It To The Cypher\nLike this, like this y'all\n\n[Verse One: Truck Turner]\nI'm at the end of my rope, I'm bout to snap\nCut a nigga throat, put a bullet through his hat\nWith his head attached\nWhat's the deal new jack? Who dat? Got his chest blew back\nClak! Clak! Bullet through his teeth, nigga true that\nYou in my way, move that, Truck coming through that\nRun up in your spot, come out, raising two gats\nMove back, give a nigga room, let me hit this\nWay back, since up in the womb, I was with this\nEvery sentence, we doom with consistence\nBe the witness, let me spit this, Kris hit this\n\n[KRS-One]\nYo... if it's all about the hundreds, let's try to get two 50s\nDon't stop and switch a temple, let's work and build a city\nYou see the equation, to this whole situation?\nIf I'm the God of rap and you battling me, you Satan\nAnd that's why you hating, creating debates\nWhen you know damn well that your title will be taken\n\n[Hook: 2X]\nYou think you all that son?\nBRING IT TO THE CYPHER!\nYou only got platinum?\nBRING IT TO THE CYPHER!\nYou think you got props son?\nBRING IT TO THE CYPHER!\nYou living Hip Hop son?\nBRING IT TO THE CYPHER!\n\n[Verse Two: KRS-One]\nYo... daytime, nighttime, anytime, I got plenty time\nTo kick many rhymes, big time, all time\nTaking it to you over time, so when I'm flowing rhymes\nBright I shine, simply cuz I'm\nLyrically be kicking out the tighter rhyme, till I climb\nBring in the chime, in your mind, you fall behind\nPicking up your rhyming skill, I am fulfilled, when I kill at will\nStill number one for fun, kill another one\nBattle your bugging son\nLook I cut your tongue, KRS-One is never done\nI am the proper one, this ass-whipping will make you better son\nGo and tell your mum I took a bite out of your bum\nAnytime you want it, doggone it, yo put me on it\nNever running up on it, you never disappointed, get on it\nI simply jam, not that I give a damn\nLet me tell you who I am, just ask your buddy\nPut your cash on Kris, I bet you double up your money\nYou can call me Chris Rock, ain't nothing funny\n\n[Truck Turner]\nNigga what, let me change my style up, in a rough\nNigga duck, dropped your face, pick it up, shook 'em up\nAutomatic fire - Brrrrrrrruh! Brrrrrrrruh!\nAll up in the party, clip it out, give it up\n\n[KRS-One]\nWhere's the money for this single, get it out, give it up\nBlastmaster's coming through Truck, what\n\n[Hook: 2X]\n\n[Verse Three: Truck Turner]\nAt night I let the fo'-fo' bark, spark right off the dark\nBody parts chalked, where we live, how we get down\nCome up on my block making noise, keep the shit down\nI cripple you, pull up a wheelchair, permanent sit-down\nPerfect fit now, now clown, who the shit now?\nFo'-fo' aimed at your dome, bout to spit rounds\nMe and you, getting it on? Don't even go there\nOnce I bring it to you, you won't be save nowhere\nOh yeah, your mom's funeral don't even show there\nIt'll be a double burial dukes, when the smoke clears\nLove you like a brother, but I'll kill you if you rally\nStay on my good side, my bad side, I annihilate\nDon't hold me back, get off me, told these cats never cross me\nBut they crossed the line, I gotta show 'em\nMy fo'-fo' snub is what I owe 'em, Kris you know him? (Nah)\nIce pick, Attica style, I'm bout to blow him\nDudes get trifle, catch the barrel of the rifle\nFuck you, until more niggas looking just like you\nDump two when you hear me squeeze off the cycles\nI squeeze you load (I squeeze you reload)\nI squeeze you reload till this whole shit can roll\nWhere I'm from, that's the code, BDP got your shit sold\nLike bad heads that fold at war, anything goes\nMade us, broke the mold, another Bronx episode nigga what\n\n[Hook: 2X]\n\nTruck... Turner... express, ya don't stop\nK... R... S......\nTruck... Turner... express, c'mon y'all\nK... R... S......", "image": "https://images.genius.com/25e021faafe86c3b0a281946953d7601.813x813x1.jpg"}], "artist": "KRS-One"}