{"songs": [{"title": "You Don’t Hear Me Doe”(feat. DMG", "album": null, "year": null, "lyrics": "SCARFACE\nMiscellaneous\nYou Don't Hear Me Doe\"(feat. DMG\n[DMG]\nCall me psychotive but I'm bad, nigga yo!\nAnd I'ma do ya bad, black\nAnd when I come, I'm bustin up niggas to hear me, black\nYa should of never let a nigga see\nIf there was niggas and bitches and bitches and niggas that hated me\nHuh, I waited for my date to come-of-age\nAnd now I'm of-age I can't escape the fuckin front page\nSo I guess that nigga D is up to hit again\nI kicks the funky shit and coke, and stupid like I'm Gilligan\nI'm P, supposed to hit a lick for a jack\nThe only thing I gained is the pain of niggas comin back\nNigga lookin for they shit, aggravated and pissed\nNiggas they can't fuck with my clique\nI'm here to break em off for chunk\nA D-E-A-T-H-L-Y, a motherfuckin punk\nAnd I be rollin with the brass\nDon't answer with the ziggers in your hood, he break your neck to roll a\nPass, nigga\nDon't even stop to say 'Whattup?' cos I bust for the fuck\nAnd pay some quick to light a motherfucker up\nNext time you stop me on your block, I hope you leave the place\nOr be the next to meet the Lord face-to-face\nNigga, I ain't the one to take no bullshit\nCos see a nigga like the D is game to empty out the full clip\nSo when I come for ya, act like ya know\nSittin motherfuckin smooth to the curb but you don't hear do'\n\n[Chorus:]\nI'ma bring ya to ya asshole (uh)\nDo it like the G-to-O (yeah)\nBustin on that ass but still I see that you don't hear me do'\n(But you don't hear me do')\nBring ya to ya asshole (uh)\nDo it like the G-to-O (yeah)\nBustin on that ass but still I see that you don't hear me do'\n[DMG]\nIt's time to fuck em up, here it comes, BLAST, nigga!\nThump to your chest and they comin out your ass, nigga\nI grew apart, livin my life as a criminal\nNiggas G to kill but still I see that you don't hear me do'\nSo I'ma serve it to ya fat, hit the deck, mate\nHit the deck mate, call me Flipper when I checkmate\nD-um divertin nine, Tre-9, full Glock, Glock\nMy Glock makin sounds and it don't stop\nSo nigga pass the swisha quick\nAnd I'ma blaze til the motherfucker burn me off my fingertips\nCos, see a nigga gotta saty high\nI try to smoke til I can't smoke and then I won't smoke\nBut still I got my fingers on my shit\nAnd click, click, click, ya die, die, die, ya dead, bitch!\nYou tried to test the wrong nigga, be a tested\nStraight from St.Paul but clockin G's down in Texas\nSome think I'm talk cos I play it cool\nBut I ain't the average motherfucker, I do the shit that niggas won't do\nHuh, like pistol whip a woodie for his bank\nThen after that I gate and grab his bitch and do the same thang\nAnd I will pain up the asshole\nCollectin grips on my drips as I stroll but you don't hear me do'\n\n[Chorus]\n[DMG]\nAin't no mistakin what I'm bringin, you motherfuckers still ain't had\nEnough\nSo I'ma continue to break you off for proper ass chunk\nMay it be 9, may it be a gauge, may it be a shank\nAny way you come I'm in your motherfuckin shit, mate!\nHuh, a nigga bustin caps, smokin fires\nQuick to bring it to your ass and keep on goin til your ass die\nAnd it ain't no runnin down dem backstreets\nCos I got slugs to catch em with Carl Lewis on the track meet\nHuh, and still you wanna test a nigga so\nAudi 5, nigga, hate to see ya go but you don't hear me do'\n\n[Chorus]\nYeah, check it!", "image": "https://images.genius.com/4a83e0fa554b5f2e5c5acce61362bbe7.1000x1000x1.png"}], "artist": "Scarface"}