{"songs": [{"title": "Pushin’", "album": null, "year": null, "lyrics": "(feat. Bun B)\n\nPushin'\nKeep on pushin'\nI've got to keep on pushin'\n\n[Intro: Bun talking over sample]\nSay man I don't give a fuck about the FEDs\nD.E.A., A.T.F., Task Force, Jump-out boys, or your local neighborhood robbers\nBaby I got to keep on pushin'\n\n[Bun B]\nWell it's the king of the hover trade and the sergeant of snow (Snow)\nThey call me Mr. Killa Gram in case yo ass ain't know (Know)\nI'm the boss baller of blow when you come to the Gulf (Gulf)\nOther cats holdin' some weight but they ain't holdin' enough\nI've been around way before the Interstate was on fire (Fire)\nBefore they hid it in the gas or the tire (Tire)\nBefore a motherfucker even knew about a stash box\nWe just put work in the back of the car (Man), and mashed out (For real)\nNow ask a nigga that was doin' it in nine-three\nOn the Interstate in a rental car you can find me\nSuitcase is stuffed like a holiday turkey (Turkey)\nChopper right beside in case a nigga try to jerk me (Jerk me)\nI did the city thing plus I played it out of state\nEither way a nigga was known for havin' a lot of weight\nTry to knock me down but it only made me bigger\nHaters wanna see me fall but a nigga gotta keep on pushin'\n\n[Scarface]\nI feel you Bun, I feel you Young, I mean, I feel you\n\nI'm on the corner from sun up to sun down\nCompetition gettin' hectic, I'm headed for out of town\nWhat I was, sellin' for twenty, niggas sellin' for ten\nSo I'm bout to take it to drastic measurements for my ends\nMy partner Rob in seventeen and in the Benz\nAnd me I'm in a bucket but fuck it, that's how it is, shit\nI got an ounce about to cut it into stones\nNext stop: Port Arthur, Texas, I work it in the Lones\nI'm a little nigga on his hustle bout to rise\nI was cuttin' seventeen and I was only payin' five\nA week went by, and a nigga took that dry\nBack to H-Town, with re-up about to score me nine\nA Pyrex bulb and the whoop so throwed\nI cooked it for nine then I stretched it for nine more\nWhoa, I'm that nigga bakin' with holes in his door\nCrummy niggas sellin' that ether but fuck it, shit sold\n\n[Young Jeezy]\nAy, no matter how hard it get you know I'mma…\nReal talk, real niggas do real things you know they… (CHEEAAA)\nYou already know, free Pimp C nigga (LIFE NIGGA)\nU.G.K. for motherfuckin' life, U.S.D.A. nigga, C.T.E. nigga (CHEAA)\nYou know them Houston niggas you know they niggas keep on pushin' nigga (PUSHIN)\nG.A. niggas you know they already…\nReal niggas do real things nigga you already know nigga\nC.T.E. nigga, Rap-A-Lot records (AYE, AYE, AYE)\n\nOne day you're here, the next day you're gone (WHAT?)\nCuz some nigga set you up on the phone (DAMN)\nShit, I play it how I go, I'm in a league of my own\nYou ain't gotta front me shit nigga, I'm buyin' my own (HAHA)\nWhether it's sixteen bars or sixteen bricks (CHEA)\nMove 'em one at a time, I'll take sixteen trips (LET'S GET IT)\nI'm in the kitchen with the white, choppers by the back door (AYE)\nMind on my money, but I swear this shit stack dough (HAHA)\nSquare's in the closet, a hundred thousand in the box spring\nGot the stash box in the back of the Mustang (CHEA)\nYou know I keep a down ass bitch to dry that shit\nLook, I-T a nigga yea she ride that shit\nHey, I hustle harder, I hustle smarter (AYE)\nJust left the magnum lot tried to whip me up a charter (HAHA)\nI'm so ahead of my time, ahead of my grind\nLook at snowman bitch, it's a must that I shine (YEAAAA)\nSee my watch is like...damn, my ears beggin' for attention (AYE)\nA quarter mill around my neck, in case I forgot to mention\nYou niggas actin' like hoes so motherfucker keep gushin'\nI'mma do what the gangstas do and nigga keep pushin' (AYYEEE)\n\n[Vocal sample and beat ride out til fade]", "image": "https://images.genius.com/4a83e0fa554b5f2e5c5acce61362bbe7.1000x1000x1.png"}], "artist": "Scarface"}