{"songs": [{"title": "Paperwork", "album": "Paperwork: The Motion Picture", "year": "2014-10-21", "lyrics": "[Produced by Pharrell]\n\n[Hook: Pharrell]\n(Paperwork)\nDon't do no business until you check his (paperwork)\nAnd if all else fails, I just hope that this (paperwork)\nWanna swing Bentley doors, blow smoke through the roof\nEverything got a cost, they gon' need something on you\n(Paperwork)\n\n[Verse 1: T.I.]\nATL, Westside, that's the only home I know\nIn '85, me and Uncle Quint used to ride around in the big Bronco\nTook me up to Charles' Disco, daytime, set me down at the bar\nWhere I drank Shirley Temple\n'Til he walked out with a bag and we got back in the car\n\"What you wanna be?\" he asked \"When you grow up big head?\"\nI just wanna be like you, ridin' round town gettin' bread\nWe shared a couple laughs, couple summer pass\nUncle Quint ain't nowhere to be found\nLater we learn that someone ratted him out\nFor that reason 10 years he won't be around\n\n[Hook: Pharrell]\n\n[Verse 2: T.I.]\nPicture me, in '93, I'm the only man I see\nFresh up off the porch\nLookin' for a drop Porsche and a fake ID\nIntroduce me to the crack game\nRap game was the furthest from my mind\nHad a notebook full of rhymes\nAnd a pocket full of crack rock dimes\nTime on my side, lil .45 in my jeans\nOpen fire if you seem to be blocking my dreams, yessir\nWelfare, food stamps\nSection eight, me and Ma lived in the trap\nI said fuck school, it holdin' me back\nI wanna bankroll, chasin' after that\n\n[Hook: Pharrell]\n\n[Verse 3: T.I.]\nLook at me, at 17, livin' on my own, peddlin'\nQuarter ki, now and then sellin' weed\nTotin' tools, caughtt my first felony\nThat's one of many, that were to follow\nDrinkin' Henney up out the bottle\nTote a choppa I think I'm bein' followed\nFamily don't think I'll live to see tomorrow\nPlenty have a story like mine\nKnow many of you had a little nine\nKnow many of you did a little dirt\nToo many of us did a little time\nWake up, 10 years of your life passed\nWhen you get your cake up\nDon't it seem lil' odd when the Feds on your ass passin' out?\n\n[Hook: Pharrell]\n\n[Bridge: Pharrell & T.I.]\nIf you think that you high, baby look above you\nIt's drones in the sky, there's nothing you could do\nSo left, two, three snap\nRight two, three snap\nDon't get serious now it's too late for that\nCause they got\nTime on my side, lil .45 in my jeans\nOpen fire if you seem to be blocking my dreams, yessir\n\n[Hook: Pharrell]", "image": "https://images.genius.com/0aedeee6f38d44bf87bbee70cb36cca3.640x640x1.jpg"}], "artist": "T.I."}