{"songs": [{"title": "The Heist", "album": null, "year": null, "lyrics": "[Raekwon]\nStraight up nigga, I'm a money nigga man\nYou know what time it is wit me, yo\nThat's right\nTake the track, cut the heads off, split it down the middle man\nTake the bones out man for real\nYeah all apple pie yeah\nStraight up, Flipmode BK king\n\n[Ghostface Killah]\nIt was the best heist since ice\nPrecise rituals\nSkated outta Jacob's wit the Fruit Loop jewels\nHolding a navy blue Uzi\nKrush Grooving waves off the atlas\nCooling, that's how we make movies\nBasketball gun brawlers, bounce\nBlack down 'bill-a-head banks, Malibu colorful shanks\nThat's the way we live, Staten Island kid\nOld dog in it, the thug vaccine wit no pork in it\nVivid imagination paper chasing\nDuffel bag swollen, we holding\nDrink chocolate milk before we roll in\nIt's like that y'all, we gangstas\nSticking all you Bay Ridge Benzes\nI'm out to get erect, terrific shit be the diamond district\nTiffany's, pretty Valentine brick is on the second floor balcony\nGems is magnificent, diamonds is crying\n\"Busta Rhymes take me, never mind help!\"\n\n[Raekwon]\nHey yo caught em at the ice pavilion\nDressy, salad bar style Nestle\nFour white niggas, covered in vest pieces\nThink like a mob flick\nGuessing like Patsy in the mask, piece bust\nGot aggravated, slapped the glass piece\nOne nigga beaming, faggot ass\nLay on the floor ya fuck!\nTied his broken arm to his Hush Puppies\nWrapped around trauma, everything realer than fuck\nTijuana left my nigga niece live comma\nThree young Italians, suited down personal style\nI'm in velours white designing on the 'dallions\nFelt like some crackers was in back of me\nSpit on the clerk, pass the Harry Winston set\nGhost backing me\nBust a shot, motored\nFour male in paper work Lord\nWe get together once more before we blow this\nMurdered nobody\nLeft em all baseball'd down, brother\nThree wicked ass 6's, Gucci colors\n\n[Busta Rhymes]\nMoney! Drop dead on the floor\nNigga, pass the keys to the door\nPass me all the cash in the drawer\nOr I promise you'll be payin the price\nFeeling like a nigga died twice\nExecute the world's greatest diamond heist\nY'all niggas know we out to get this money!\nC'mon money! [Repeat: x7]\nRaekwon, Ghostface, Rocky Marce c'MON!\nLet's get this money nigga\n\n[Rocky Marciano]\nYeah we ?near the mind? out west\nSomewhere in Africa\nThe Feds is after us, vest on my back\nWhipping the Acuras, feel like a mac busting\nA rug in Preston on percussion\nI'll bust in your gate, nigga it's nothing\nA hail storm, ice raining, mind containing\nInfo, nigga what you in for? Complaining\nSick bars deep in this language\nDid I tell you how my day's spent?\nSpeaking through the face of Ronald Regan\nIceberg History, calligraphy\nKaleidescope colors, hollow-head shells and flaring gunmen\nHate to see me coming like gray skies on day of judgment\nMakes you wonder where the love went\nHit a nigga, feed him to some buzzards\nPut up numbers, plus I'm one to push his mug in\nWe duck in the safe, check what I'm hugging\nRocks the size of some shit, out in the Congo\nMy arms full, let's get the fuck out, Busta I got you\n\n[Busta Rhymes]\nHey yo we do great study on fossils and stones like archaeologists\nGemologists, collect the most priceless ices anonymous\nCanary stones yellow like a pumpkin\nDunking Donut precious size stones make me want to cut the safe open\nRae pass the blowtorch, Ghost brought the dynamite stick\nMarciano brought a chisel wit an ice pick\nPrincess cuts, invisible settings\nPlanning the world's greatest diamond heist playin a tune by Otis Redding\nIcicle cones hang from the ceiling just like stalagmites\nTime to throw on a skully and tying a rag tight\nThrowing light went off and in the basket\nGrabbed the necklace from off the satin pillow while the glass casket\nIce lay across the crushed Burgundy velvet\nUp in the diamond slide-tray\nGun in your face, slide it right away\nRound table with Habib, Mirishnokof, and the rest of them Jewish niggas\nWe got them niggas drunk and talking foolish see\nYou know the way we straight manipulated the shit\nWe swindle them niggas for all their precious things before we skated and shit\nYeah, y'all niggas know we skated early\nDisguised ourselves as the Hasidic Jews and even left my sideburns curly\nBounce to Mexico and spend some pesos\nAnd bury the diamonds on an island your never heard\nLike Turks in Keikos\nEvery time we hit, we in and out quick\nDon't be surprised if we behind supplying niggas all the platinum and shit\nMoney [Repeats]\n\nYeah, the world's greatest jewel heist\nThoroughly and successfully executed\nBy none other than Ghostface Killah, Raekwon the Chef\nRock Marciano and Busta Rhymes\nA job well done fellas, very good piece of work", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}