{"songs": [{"title": "Ill Mind of Hopsin", "album": "Ill Mind of Hopsin Saga", "year": "2009-06-02", "lyrics": "[Intro]\nWho am I? Why am I even here, man?\nOkay, let's take a trip through my mind and see what we find. Yeah. Okay. Yo.\n\n[Verse]\nIn high school, Marcus wasn't a helpful student\nHe dropped out 'cause teachers would never help him through it\nAnd if I don't save this rap game who else would do it?\nThis is my motherfucking world, welcome to it\nIf you thinking that Hop's whack, then you is hating\nAnd what the fuck do my contacts have to do with Satan?\nI want a bitch with a bomb ass and some lubrication\nA loverboy, you see I'm that but I'm rude and blatant\nNow you listen here: I started a movement this year\nI will fuck you up if you interfere\nYou been a queer your whole fucking life and I'll kick you into gear\nYou trying to prove you a lunatic? Ooh, I'm oozing in fear!\nYou on some sloppy-clown bitch shit: I'll rip your head off\nPoke a stick through it, then beat the rest of your body down with it\nI start violence, cops come with the loud sirens\nNow I have to hop a barbed-wire fence\nThey find me in the broke down car I had been hiding in\nHomicide is now the charge I'm against\nWalk up to the jail cell with the guard I am with\nHe pushes me in and then the bar slides in\nThis new age of rappers, all they wanna do is floss, why?\nSwearing they're the boss guy, thinking that they're all fly\nYou, Lil' Wayne, Soulja Boy, this Asher Roth guy\nNormally I would mind, but this time I've lost mine\nWho the hell is he? The biggest hater that you'll ever meet\nWhite contacts, so you motherfuckers remember me\nLyrics put together so cleverly, you will never be\nOn my level, I chop all of you rappers to celery\nFake thugs rap like: \"I'll let the Glock spit at you\nJust got out the pen 'cause I move how real niggas move\"\nNo, don't lie, 'cause it hurts when you hear the truth\nYou got out the pen and wrote a verse with it, didn't you?\nFuck life, you can't tell me nothing\nI'll shove a knife in your back and leave it poking out through your belly-button\nSir, your daughter wasn't that reluctant\nYou see this 8-inch dick bulging out of my pants? Well, she sucked it\nI went to Wal-Mart with a Visa card, bought your wife a leotard\nAnd made her try it on to get my penis hard\nI'm pissed enough, I can never find a bitch to fuck\nI beat my dick a lot, that's why only my right wrist is buff\nI go dumb off of two packs of Now and Laters\nThen fight niggas like I was the black Power Ranger\nHead to the lake then wrestle a couple alligators\nThen run through the woods butt-naked; so what, pal? It's nature\nWhy the fuck would I collab witchu?\nYeah, you're good friends with Marcus but Hopsin don't wanna rap witchu!\nYou're full of shit like some ass-tissue\nAnd you're a bitch when you go to studios you bring your dad with you\nNo! Unacceptable, now watch me wreck a flow\nNiggas be hating 'cause I'm balling just like my testicles\nWord is bond, the way I'm on this mic and serving bombs\nI might as well have an Osama bin Laden turban on", "image": "https://images.genius.com/97082d935a6e1d042a7818ec8d9ad76d.800x800x1.jpg"}], "artist": "Hopsin"}