{"songs": [{"title": "Black Republicans", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nNow this is what they've been waiting for\nYa dig, Santana\nWeezy F\nAy Wayne\nWhat up man\nWhat you been workin' on nigga?\nOh you know, I got Curren$y's new album\nAnd prolly workin' on my album, ya dig\nOh I'm ready to brush my shoulders off and drop my next album too nigga\nThat's what it is\nBut dig this, they wanna know what we been workin' on together\nThat's that \"I Can't Feel My Face Shit\" they know that\nSo if they ever thought the South and the North was gonna collide\nGuess what, we already did\n\n[Verse 1: Juelz Santana]\nI'm feelin' like a black Republican, naw, I can't call it\nMore like a black Democrat runnin' 'em out of office (Get out)\nYoung Barack-a Obama, I'm all for it\nThe Rock of Gibraltar has now fallen, on ya\nI protect my land like a farmer\nPockets stay chubby like Toccara\nOr should I say fat like the Parkers\nTote big guns like I'm still playin' Contra\nY'all washed up like money that's laundered\nY'all funny, I'm bonkers\nHonest, girls strapped to my dick like a harness\nRock star, flier than an ostrich\nAnd I cover east, west, north, south like a compass\nI shall shine forever, never tarnish\nMoney buried behind my house like a garden\nAll green, my bank account's like a forest\nI Can't Feel My Face is gettin' started\nAnd Weezy is my accomplice, ya dig\nA black activist like Sonny Carson\nStripes of a sergeant, salute me\nAnd chicks, I get 'em high, higher than turbulence is\nWhite Phantom, lookin' so Fergielicious\nI'm from the city of big drugs and murder victims\nIts get rich, go to jail or be a murder victim\nAy! Now all y'all listen\nIf you can't take the heat, get out the kitchen\n\n[Verse 2: Lil Wayne]\nI feel like a black Republican, tote the MAC in the public and\nAct so southern n' die for my brethren, money\nMoney, money, like money Mac and publishing\nOne life to live, never ask for a mulligan\nStreets cold but the heat make me feel covenant\nBeen had cake, you late like Ed Sullivan\nFly like an eagle but no I'm no Donovan\nBoy you better go eat some soup with your mom n' them\nAnd my mind is on another continent\nI am real Cash Money, no counterfeit\nI don't parkin' lot pimp I just politic\nBut I get all in her mouth like Polident\nNew Orleans representer to the end. I\nCome from the city where the glitter don't glimmer\nThe sun don't shine and the guns don't sleep\nWake a nigga ass up like he got somewhere to be\n\n[Verse 3: Juelz Santana]\nI feel like a black Republican, drug money comin' in\nI'm a volcano filled with lava about to erupt again\nI stay with the iron, don’t make me plug it in\nStay outta rich kids' business, don’t be buttin' in\nI stay with a chick that's ready to unbutton it\nForget a tongue, she put a lung on it\nMy Listerine come out, she start guzzlin'\nI’m above you dudes, I’m hoverin'\nJuelz, why you duckin' them?, Duckin' who?\nI’m in the hood like, “What it do?\", comfortable\nAnd believe me, it's nothing to\nSend my London boys to English muffin you\nYou poodles barkin' too much they bringin' muzzles through You ain't gully, you gullible\nThey need love, they need hugs\nThey need church, Jesus! Could it be 'cause\nThey them (Losers), and we us (Winners)\nAnd we up, this is just a sample, yeah, a free drug\nThe shipment is in, we done re'd up\nBut, I don’t trust dudes, like a prenup\nThey cockroaches, they gotta be bugged\nI’m ballin' for real, you gotta D up\nI don’t hear you boys, you gotta speak up\nWhat are you guys saying?\nI have the chauffeur hold the umbrella over my head when it's not raining\n\n[Outro]\nAnd we wanna let the world know\nThis is not a diss song either people\nWe don't diss them we dismiss 'em, ya dig\nRecognize or step aside, ya dig\nWe let the music talk, Drought 3\nAnd by the way, it's Santana, I'm back\nIt's Weezy!\nYou dudes gotta stand in the mirror backwards cause you can't face yourself\nAssholes\nDipSet for life\nCash Money, whaddup\nYoung Money", "image": "https://images.genius.com/32e1b9a7e336b3f316f0f5de4d6c2815.300x300x1.jpg"}], "artist": "Lil Wayne"}