{"songs": [{"title": "Big Ego’s", "album": "2001", "year": "1999-11-16", "lyrics": "[Spoken Intro]\nLos Angeles approach control\nThis is Cessna 0281-Echo-119.3, over\nCessna 81-Echo, Los Angeles approach control, roger, go ahead\nCessna 81-Echo is over the Compton Airport, 5-2 at 5000\nRequesting ground controlled approach\nTo the Los Angeles Airport, over\n81-Echo, Los Angeles approach controlled, roger\nRadar identification; turn right, heading\n0-3-0\n\n[Verse 1: Dr. Dre]\nI got mo' class than most of 'em, ran with the best of 'em\nForgave the less of 'em and blazed at the rest of 'em\nWhat can I say? Cali-for-ni-a\nWhere niggas die every day over some shit they say\nDisconnected from the streets forever\nAs long as I got a Beretta, nigga, I'm down for whateva\nI roll with my shit off safety, for niggas that been hatin' me lately\nAnd the bitches that wanna break me\nIf Cali blew up, I'd be in the Aftermath\nBumpin' gangsta rap shit, down to blast for cash\n'Cause from Eazy-E, to D.O.C., to D.P.G\nStarted from that S.O.B., D.R.E\nLike Dub-C, I'm rich rollin', pistol holdin'\nPockets swole nigga, that's how I'm rollin'\nPut the flame to the killer, nigga\nWorldwide homicide mob figure in the building, for real\nI'm hittin' switches, makin' bitches eat bitches\nSee me grab my dick every time I pose for pictures\nI own acres, floor seats watchin' the Lakers\nI'm cool with eses who got AK's in cases\n\n[Chorus: Hittman]\nDedicated to all of those with big egos\nNever fakin', we get the dough and live legal\nHaters hate this, we sip the Mo' and yank the Heezos\nNiggas play this in their Rovers, Jeeps and Regals\nDedicated to all of those with big egos\nNever fakin', we get the dough and live legal\nHaters hate this, we sip the Mo' and yank the Heezos\nBitches play this in their Benzes, Jeeps and Geos\n\n[Verse 2: Hittman]\nI'll bust a Mr. Toughy, slash a Smoovy Doovy\nCrashin' Flex on Tuesdays, harassin' hoes at movies\nPassin' by with Uzis, like who you aiming at?\nThat shady bitch and that bitch nigga that was claimin' that\nRat-a-tat-tat\n*Automatic gunfire, screaming, followed by tires peeling*\nI don't sympathize for wack hoes and wimpy guys\nYou gotta recognize Hittman is an enterprise\nCali pride, Bronson rider South Central-ised\nThe Henny got me energized, smoke the guys\nTryna focus on mines, poke they eyes out, I'm L.A.'s loc'est\nHope they don't have to find out the hard way\nLike snitch niggas in the pen that get hit\nWhen the guards look the other way\nWe hittin' hard – Hittman and Dre\nYou playin' games? I suggest you know the rules\nWe puttin' guns to fools, make you run yo jewels\nTake yo honey and cruise to the Snooty & snooze, cop booze\nPop coochie 'til the nut oozes, you shouldn't fuck with crews\nThat's sick, the aftermath is we rule shit\nI'm Big Hitt, don't confuse me with no other\n'Bout to blow, motherfucker\n\n[Chorus: Hittman]\nDedicated to all of those with big egos\nNever fakin', we get the dough and live legal\nHaters hate this, we sip the Mo' and yank the Heezos\nNiggas play this in their Rovers, Jeeps and Regals\nDedicated to all of those with big egos\nNever fakin', we get the dough and live legal\nHaters hate this,we sip the Mo' and yank the Heezos\nBitches play this in their Benzes, Jeeps and Geos\n\n[Outro: Hittman]\nYou look like AC Green, bitch, don't call here anymore\nWith feet like Ben Vereen's, bitch, don't call here anymore\nNo no, no no\nWhat up? It's Hittman\nI ain't at the crib right now\nSo you can leave your name and number after the beep\nUnless it's Tammie's ugly ass – I ain't fuckin' with you", "image": "https://images.genius.com/f9713af0f8164e90022b622002fda842.600x596x1.jpg"}], "artist": "Dr. Dre"}