{"songs": [{"title": "School Street", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "Grrrrrrr.. uh, uh, uh, YEAH!\nUHH! Fourth motherfuckin time baby (WHAT?)\nOut the gate! (uh-huh)\nYou motherfuckers can't be serious (you can't be serious)\nYou thought I'd let you have this shit (WHAT?)\nYOU THOUGHT THIS RAP SHIT WAS YOURS? (UH-UH! Uh-uh!)\nYou motherfuckers done lost your mind (uh-huh)\nFor real - get the fuck outta here with that bullshit\nI'm about to let y'all niggas know, how it's goin dizzy baby\nUhh, uhh, UHH, UHH, UH!\n\nSchool Street, School Street, home of the brave\nSuckers actin like they want it, ends up in the grave (c'mon!)\nI'm DMX but my, name ain't Dave (uh)\nStep to my title and I'll crash yo' wave\nBuilding #80 (uh-huh) used to L-I-V-E (uh-huh)\nCome through on the, late night tip and you could see me (uhh!)\nCoolin with D-Nice and Box, my man (WHAT?!)\nM.R., my number one fan (WHAT?!)\nSmall Paul, Mike Lou, native New Yorkers\nChase a.k.a. Kenny, and Chuckie Walters (UH!)\nBlack Shawn, Black Tim and Black Darren (woo!)\nBlack Tyrone, Black Al and Black Baron (woo!)\nRob and Carlos, Jersey and Dink (UH!)\nJames Weldon with the, cuban link (c'mon!)\nLittle Nick, Tony Koch, and Ollie (uh-huh)\nRemember Dre, the one that used to fuck wit Holly (yeah!)\nAbby and Blue, B-Boyin Shawn\nBill Smith, Nick Bird, Scoop and Shawan (UH!)\nCan't forget Long, Paris, Tone and Donny (WHAT?!)\nAdman to Steve, Fat Reggie, and Ronnie\nBlack Lonnie, D-Mack, and Michael\n{*BLAM*} Ha ha! A.K.A. Psycho (WHAT?!)\nMe and Nick Styles used to get piles of cash (c'mon!)\nMy man Reg kept a jammy in the stash (c'mon!)\nAiyyo Flocko, Doug and Jerome (uh-huh!)\nIt won't be long before Ice comes home\nNate Karasha, Bin, Buck\nG's, Bashir, don't give a fuck! (WHAT?!)\nLittle Joe, kickin like Chuck Norris (WHAT?!)\nMost of all I can't forget my man Forrest (WHAT?!)\nFourteen K Alfie, Bubbles Bo (UH!)\nRalph (?), Smooth and Derenzo (WHAT?!)\nThe old school with Money Mark and Red Mack (yeah!)\nKool Breeze, Dry Kool, and Kangol Jack (uh-huh!)\nDavid Earl, Jeff Kato, and Dylan\nPeace to Mike Coleman (WHAT?!) heard the brother's chillin (woo!)\nLittle niggas, like Big Joe and Nutty\nEighty-eight Dave Dan, the Peanut gettin money\nTweety Bird, Big Monty and Docky (UH!)\nHis brother Chico Red Mask Brother Hockey (UH!)\nGots to give a shoutout, to the deceased (aight?)\nLittle Monty and Paso, rest in peace\nYo I remember all that, cause I was there\nSchool Street got shit sewn up all the way to the square (WHAT?!)\nNo one would dare even, stop to stare (UH!)\nCause they know we don't care and we don't play fair (UH-HUH!)\nYeah, School Street is schoolin (WHAT?!)\nFuck what you heard, nigga, School Street duelin (WHAT?!)\nWho you think you foolin you'll end up in yo' grave (c'mon!)\nFuckin with School Street, home of the brave (woo!)\nMotherfucker, now you know...\nWhere I'm from... where it's at....\nWHAT?! Motherfucker get the gat!\n{*rapid gun blasts*}\nBitch-ass nigga. Home of the brave! {*BLAM*}", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}