{"songs": [{"title": "Wylin Out (RJD2 remix)", "album": null, "year": null, "lyrics": "(feat. Diverse, Prefuse 73)\n\n(Diverse)\nMy mind compliance like a science\nAnalyze my data, not a fader on the face of the earth\nCan blend rhythms like my will, surreal spinnin\nEver-movin like evolution it's retribution\nFor sellin roots, lessen futures, I'm steppin to fuse? ya\nSun rises my subconsciousness culminates constant\nLive to see various i-de-ologies, angles like isosceles\nRead my auto-b-i-ography\nSo many stars? to me that vibrantly shine\nVelocity's properly thick like mahogany dimes\nWe findin beauty in this urban-gritty usually overlooked by many\nMovin through the densely populated city\nAnd soon and eventually - 'we gotta get ova'\nI document culture closer to the edge\nBolder than a print, open to interpretation, gazin deep into the\nGlitz?\nTo my people, raise you fists\nI know it stays intent, whatever pays your rent, but saves your\nSoul\nYou know the drill, it go:\n\n(Mos & Diverse simultaneously)\nHotter than most dudes\nFrom left to right, on top and below you\nFlow like the coastals, move like smoke do\n-I'm Diverse- these other cats is just hopefuls\nWhen they ask who put it down, baby, you know who\nTell your whole crew, it's somethin that you need to know, dude\nThis is how we go through\n\n(Mos)\nWho the poisoned pen?\nMos got the inkwell full of syrum\nPrescribed for any emcee claimin they ill\nA small dose'll change the way that they feel\nMilligrams in the raw, snow-cut, check how I label the pill\nIt's MD, the spit-doctor, chant like a witch-doctor\nRecite me, and ya whole ailment get proper\nI'm the, medicine man, representin my clan\nMixin the potion with verse fire and simmer, my man\nAnd stay shoutin out the home team wherever I am:\nIt's the B-R-O double akh-K-L-wY-liN out\nThe cowboys who don't fret to pull they lamas? out\nIronhorse style cab?, hoop-te ville ridin out\nNo lights, no cam, action - drama'd out\n?? out, absorb the shit that I'm about\n\nInner-city Bruno, ghetto folks, holla out\nI'm good money, tell the doubters get they wallets out\nHot when the dice is out, they go broke findin out\nSmack ya mojo, caught a half of 'oh no'\nMagical vocals, get it down like coastals?\nUnderground nigga that spoke truth and broke through\nShine bright when I'm far from my close-to\nI told you, you know how Mos do\n\nHotter than most dudes\nFrom left to right, on top and below you\nFlow like the coastals, move like smoke do\n-I'm Mos Def- them other cats is just hopefuls\nWhen they ask who put it down, baby, you know who\nTell your whole crew, it's somethin that you need to know, dude\nThis is how we go through\n\n(Diverse)\nExposed to a higher set of variables, as fly as aerial\nDefinin stereo components, moments with my master\nRemasterin techniques, havin some fresh sheets\nDamagin margins with a broader outlook - 'we lookin out, y'all'\nMe and Mr. Mighty Mos, we outlaws\nBlazin in the saddle, raisin like the mornin star, formin\nMajestic\nCandescent like the street lamps, I-be-amped to inn-o-vate\nReminiscent of technology, probably just my will to build\nTo real notions of emotions similar to the seven seas\nSteadily sparkin cables, tables turnin like the high tide\nI'm captive to this music, vastness, into it i skydive\nTumblin like buildings crumblin on inner-cities cumbersome\nThey comin to run us out, my niggas shout for justice\nYou wanna link with me, then let me know\nThis music is like my vessel so we seem to be inseparable\nFrom C-?Sea?-town, headed eastbound\nYou know the rest, it go:\n\nHotter than most dudes\nFrom left to right, on top and below you\nFlow like the coastals, move like smoke do\n-It's D-I- these other cats is just hopefuls\nWhen they ask who put it down, baby, you know who\nTell your whole crew, it's somethin that you need to know, dude\nThis is how we go through", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}