{"songs": [{"title": "Ignant Shit", "album": "So Far Gone", "year": "2009-02-13", "lyrics": "[Intro: Drake]\nYeah, I appreciate your patience tonight\nIt's been a moment since I've done some public speaking\nI find nowadays it's, you know, best to keep quiet\nBut, uh, sometimes you just gotta let it out\nYoung Angel and Young Lion, you know what it is\n\n[Verse 1: Drake]\nUh, look, I'm the property of October\nI ain't drive here, I got chauffeured\nBring me champagne flutes, rosé and some shots over\nI think better when I'm not sober\nI smoke goodie, no glaucoma, I'm a stockholder\nPrivate flights back home, no stop over\nStill spittin' that shit that they shot Pac over\nThe shit my mother look shocked over\nYeah, but with a canvas I'm the Group of Seven\nA migraine, take two Excedrin\nI'm the one twice over, I'm the new eleven\nAnd if I die I'ma do it reppin', I never do a second\nI swear niggas be eyein' me all hard\nAnd lyin' to they girls and drivin' the same cars\nSittin' there wishin' their problems became ours\n‘Cause we have nothin' in common since I done became star\nI done became bigger, swervin', writin' in my peers' lane\nSame dudes that used to holler my engineer's name\nOne touch, I could make the drapes and the sheers change\nAnd show me the city that I without fear claim\nWhat I set seems to never extinguish\nCoolest kid out, baby, word to Chuck Inglish\nCount my own money, see the paper cut fingers\nMy song is your girlfriend's waking-up ringer\nHeh, or alarm, or whatever\nShe be here at six in the morn' if I let her\nBut I never get attracted to fans\n'Cause the eager beaver could be the collapse of a dam\nI always knew that I could figure\nHow to get these label heads to offer him good figures\nAnd me doin' the shows gettin' everyone nervous\n'Cause them hipsters gon' have to get along with them hood niggas\nIt's all good, I'm goin' off like lights when the show's over\nMake pasta, rent a movie, call hoes over\nRest in peace to Heath Ledger, but I'm no joker\nI'll slow roast ya, got no holster\nWet glass on your table, nigga; no coaster\nBurn bread everyday, boy; no toaster\nG and Tez got a SIG, but I'm no smoker\nThey just handin' chips to me, nigga; no poker\nI'm with it, Young Money, Cash Money soldier\nMy cup runneth over\nThe same niggas I ball with, I fall with\nOn some southern drawl shit\nRookie of the year, '06 Chris Paul shit\nD-R., CJ, and Po, I see y'all\nThese cases don't work out, I hope we can agree on\nMakin' enough to pay any Judge Judy off\nFirst thing I'ma do is free Weezy, go\n\n[Verse 2: Lil Wayne]\nAnd I'd take probation\nI don't want that T.I. and Vick vacation\nPrivate plane, pick location\nI'm goin' to the bank to make a big donation\nYeah, I don't stunt, I stunt hard\nAnd if the food ain't on the stove I hunt for it\nBut in the meantime you can call me young Roy\nJones Jr. fightin' the drugs and gun charge\nShit, don't leave me unguarded\nAnd I'm a cheesehead, word to Vince Lombardi\nWord to Marky Mark, leave a snitch departed\nAll that blood like the Red Sea parted\nMy gun go crazy like it's retarded\nRed light on it like it's recording\nI ain't recordin', I'm just C-4in'\nMy currency foreign; we are in a league they aren't\nBetter dig in your pocket and pay homage\nBetter cover your eyes, your face fallin'\nWatch the game from the side, I'm play callin'\nNo, I didn't say that I'm flawless\nBut I damn sure don't tarnish\nMy pistol got comments for your garments\nI'm so high I can vomit on a comet\nK-Y, no homo, I'm on it\nWeezy F Baby, new born bitch\nYou know what they say 'bout when your palm itch\nI'm gon' get money, money I'm gon' get\nYoung Money in your tummy and we gon' shit\nAnd get that toilet paper quick, like when Bones spit\nThat's right, bitch, I'm back on my grown shit\nThat Audemars Piguet, no ice, just chrome shit\nAnd your boyfriend softer than a foam pit\nI scream, \"Fuck the world with a long dick!\"\nMotherfucker, I'm me! Yeah, bitch, I'm me!\nYou niggas sweet, like the pussy in which I eat\nFireman burn down your entire street\nSo fly I'ma take off when I leap\nBye! And you can suck my wings\nStand on my money, headbutt Yao Ming\nPut your hand in the oven if you touch my things\nI'm shufflin' the cards, 'bout to cut my queens\nBut I ain't the dealer\nHouse full of bitches like Tila Tequila\nYeah, I'm the man in the mirror\nMy swagger just screamin', motherfucker, do you hear her?\nYeah, Drizzy Drake what the lick read?\nWe make magic, boy; Roy and Siegfried\n\n[Outro: Lil Wayne]\nWoo, Young Mula, baby\nYeah", "image": "https://images.genius.com/83ad0a4cdf492e299e507a370ad173a4.1000x1000x1.jpg"}], "artist": "Drake"}