{"songs": [{"title": "Better Off Alone", "album": null, "year": null, "lyrics": "[Intro]\n808, 808, 08, 808\nGang, gang\nWe in Chiraq, ya dig? (Skrt, grra)\n\n[Pre-Chorus]\nYesterday, I tweaked, then I took a Xan'\nToday, I said that I won't do that shit again\nMy brother told me to describe the perfect bitch\nI said \"Percocets\" (Hahaha), I said \"Percocets\" (For real)\n\n[Verse 1]\nThe blue pills, they give me the perfect itch (Oh yeah)\nShe told me she want her a Birkin bag\nBetter put the Percs in a Birkin, bitch (Oh yeah)\nMy ex bitch call me a snake\nWait, I'ma show you what a serpent is (Oh yeah)\nLook in the mirror, the vision can't get any clearer (Uh)\nAnyways nigga, It's my year (Uh)\nBall 'til I'm bald like Britney Spears (Uh-huh)\nThree round burst up in that chopper (Uh) grra, musketeers (Uh-huh)\nCodeine in my double cup, I am not drinking beer (Sip sip sip)\nUh, I ain't take no pills today, I'm startin' to get the bubble guts (What the fuck?)\nTwin barrels on that shotty, yeah, and it's a horny gun (Grra)\nI'm gon' cock it back, let it off and watch it double nut (Grra)\nI still got my 40 tucked, that's another horny one (Oh yeah)\nGot so many horny guns, you thought we were shooting a porn or somethin' (Sex)\nUh, shoot like the Mavericks (Ah)\nCouple semis and a few automatics (Uh-huh)\nRun up on me, you get cut up in traffic (Uh-huh)\nAll my niggas stretch him out like elastic (Uh-huh), yeah, yeah\nYou don't want static, but me? I'm havin' it\nI'll leave your body packaged like the bricks in my cabinet (Yeah)\n\n[Chorus]\nI ain't have no Perc's, I'm mad (Bitch)\nMay wanna shoot your dad (Bitch)\nI feel like a savage, huh, still a sad kid\nI ain't have no Perc's, I'm mad (Bitch)\nMay wanna shoot your dad (Bitch)\nI feel like a savage, huh, still a sad kid\nOoh, uh, demons in my head, leave me alone\nUh, I think I'll be better off alone\nIn my mind, I roam\n\n[Verse 2]\nFeelin' delirious (Wait)\nRan out of Percocets, bitch, is you serious? (Wait, wait)\nThem drugs control me like a eye in the middle of a pyramid\nI need some more, period\nI mean, point blank, muhfuckin' period\nDon't try to understand, you will never understand\nBroke up with the drugs but I need a second chance\nI'll do whatever it takes, I'll even take on a Dr. Phil\nThat's how you know it's real\nLove for real, love for real, love for real (I'm in love for real)\nI gave her a chance, the devil wanna dance\nThat wasn't a part of the plan\nI only came down here to buy some Xans\n\n[Pre-Chorus]\nYesterday, I tweaked, then I took a Xan'\nToday, I said that I won't do that shit again\nMy brother told me to describe the perfect bitch\nI said Percocets, I said Percocets\n\n[Chorus]\nI ain't have no Perc's, I'm mad (Bitch)\nMay wanna shoot your dad (Bitch)\nI feel like a savage, huh, still a sad kid\nI ain't have no Perc's, I'm mad (Bitch)\nMay wanna shoot your dad (Bitch)\nI feel like a savage, huh, still a sad kid\nOoh, uh, demons in my head, leave me alone\nUh, I think I'll be better off alone\nIn my mind, I roam", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}