{"songs": [{"title": "Emotions (Remix)", "album": "Adrenaline Rush", "year": "1997-06-24", "lyrics": "[Johnny P]\nI can get inside your head\nAll day everyday, and play with your emotions..\nLet me get inside your head\nAll day, everyday, and play with your emotions..\n\n[Twista over P in background]\nHuh.. yeah it's Twista again y'know\nThese females be trippin me out y'know?\nCertain stuff they be sayin\nLike this other female she came up to me\n(This other female she came up to me)\nShe said a little somethin like this\n(She said a little somethin like this)\n\n[Twista]\nI thought you love me though? Now how you gonna be wrong\nJust cuz you know you got me gone in the head?\nYou be twistin with the lovely flow, but whatchu actin all ugly fo'?\nLeft me alone in the bed\nWhere you goin cause I'm not done, cool til you got some\nTrippin when I got sprung, but you ain't fly love\nYou da shit but your petty money can't but love\nIs that what I does? My reply was, you know why cuz\nI could tell you was prone-to-bone niggas I hang around\nBut the reefer I was zonin on, make me the one you freakin on da mo'\nFrom how I lay you down\nNow you trippin cause I'm not attached, hangin with a lot of rats\nHer concerned whether I'mma act\nNow you the momma mack, comin back with a lot of scratch\nGo on witcha bad ass, but I gotta catch\nI done peeped the way you look into my nigga's eyes\nI done recognized that I won't be hypnotized\nCriticized, no more inner cries, now I'm ener-gized\nWith my eyes on the prize just a flick of thighs\nI can't let nobody ride with me that'll lie to me\nSmokin stanky up and play with me the way you do\nAnd you trippin cause I played you too? Sho' you right\nTake the whole thing in stride like the way I do\nAnd let me play with your emotions slow\n\nChorus: Johnny P, Twista\n\nI can get inside you head\nAll day, everyday, and play with your emotions\n[T] Let me play with your emotions slow\nTo the rhythm of a kick-drum, take a body get sprung\nLet me stimulate your mind, body, and soul\nYou know I got a quick tongue, so if you want some get some\nLet me get inside your head\nEveryday, all day, and play with your emotions\n[T] Let me play with your emotions slow\nTo the rhythm of a kick-drum, take a body get sprung\nLet me stimulate your mind, body, and soul\nYou know I got a quick tongue, so if you want some get some\n\n[Twista]\nNow tell me how you gon' act though? I saw you creepin out the backdo'\nWhatchu run up on my mack fo'?\nLay you on your back slow cause you know I got you with my lasso\nBlow your mind like an afro\nCome and take a glimpse of the stairs\nIt's the aroma of a pimp in the air, I bet you notice the smell\nIt's like a lotus when I flow this, cause my eyes be the lowest\nIf you didn't notice, then you bogus as hell\nI'm puttin woman under my spell, lock them up in the brain\nPimpin her vain with games with the anatomy that's feminine\nThen fillin them up \"Adrenaline\"\nGot 'em geekin we're speakin approachin up a pimp like a gentleman\nSubmission and surrenderin and ain't no end in it\nIf it's on with a blunt from my bomb sack\nIn the right place with the right mind and the right line\nYou can get a lifetime contract\nThen be wise until I look into your eyes\nNow shorty freaked when she spotted mine\nTook her over to my crib laid low hit it raw from behind\nThen she signed on the dotted line, and she was like..\n(Ooh daddy.. don't make me feel like this..\nI don't want nobody else, you got the bomb!)\nYour mind I don't mean to make a disaster of\nLike when daddy mastered love\nBut if a bogus brother breakin you for every penny you earn\nThen how could you still show the bastard love?\nI guess I'm with a cold clique\nThought you was gon' be spendin me? I bet you think you sho' did\nBut game recognize game now you lame in the brain stupid trick\nThat's what you get for tryin to gold-dig\nNow let me play with your emotions slow\n\nChorus\n\n[Twista]\nWhassup girl? It's the Twista and the Verbal Tantrum once again\nWith a sack big enough for me and a friend\nYou do know how to roll B's don't you?\nWell let's fill one up with a dub and a little bit of love\nAnd take it to the head\nFor some of this long-lastin blunt passion\n\n[Twista]\nI know you think it's blasphemy\nBut won't you show my boys and pass for me, after he past the B?\nSince you said I was your majesty, I had to see\nAnd when you get paid then push some cash to me\nIs it a tragedy, that I can get her so gone\nThat she be trippin talkin up \"I love a lot\"\nBut the only love I got, is when I grip a mic\nOr when I hug the Glock or when I rub the twat\nI'm pickin up a dub in spots, skip the studs in the clubs\nAnd the phony perpetrators with jobs\nThe Speedknot, Psycho Drama shocked the world\nTriple Dark, there's a Conflict, be pimpin 'em with gators n darts\nCollectin papers n gobs\nPlaya haters remarks'll get smoked to a blunt dust\nSo keep walkin and next time you hear grown folks talkin\nOther people better shut the (fuck) up\nCause I make the women suck up\nYou insist to be trippin when we be gamin like Don Juan\nWithout the filet mignon and Grey Poupon\nThe thieves just ain't the charm because I made the bomb?\nNow I don't mean no harm; but either come on in or get on gone\nNow watch me live a kosher flow\nIn between your thighs come take a pull and divide\nBut let your tongue go coastin low\nNow let me play with your emotions slow\n\nChorus", "image": "https://images.genius.com/d3d24875934a3f4e43760767e5f7584d.1000x1000x1.jpg"}], "artist": "Twista"}