{"songs": [{"title": "City Don’t Sleep", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Intro]\n\"I don't feel there's any point in trying to survive when people don't try to help me.\"\n\"When we—we share a community, we should all be engaged and more involved in each other's wellbeing, you know?\"\n\n[Verse 1: Macklemore]\nNow everyday that I walk outta my building\nI see homeless people sleeping and chillin' on the steps to the apartment that I live in\nI’m not saying everyone’s a victim\nBut the people that I live with treat ‘em more like villains than actual citizens\nI walk past a man laying in his own vomit\nHe gets his food and his garments by digging in the garbage\nI beg your pardon, Mr President, but I'm a resident\nAnd since you've been in office I haven't seen any evidence\nOf things changin', we go into Iraq and attack\nWhen we got people on the streets without a roof over their back\nWe've come to accept the homeless as part of our landscape\nThe money the government wastes could provide them with a safe place\nTo eat and sleep, but we cease to see\nThat our own country is based around war, power and greed\nWe got families on the street with nowhere to go\nAnd the concrete's the only place they have to call home\n\n[Chorus 1: Don-P]\nNowhere to call your own\nOut here in the cold\nWishing you had a home\nFeeling you're all alone\nNowhere to call your own\nOut here in the cold\nWishing you had a home (Yo)\nFeeling all alone\n\n[Verse 2: Macklemore]\nNow every face tells a different story, a different message\nNow how can we judge the book when we don't know the beginning?\nWe don't know what turned 'em to the bottle, or started injectin'\nWe just see dirty clothes and another bum beggin'\n[?] the kid who was an addict the second that his mom was pregnant\nOr the young girl who was raped and stripped of everything sacred\nWho now stands downtown walkin' on the block pacin' 'Cause the only way she knows how to make it is gettin' naked\nWe don't want to face it, and it being the fact\nThat the government created the ghetto and gave it crack\nTo oppress immigrants and blacks, and give 'em more of a setback\nLike the last five-hundred-years wasn't enough to accomplish that\nNow look at the homeless rate, and tell me to my face that race\nDoesn't play an intricate part in your fate in the United States\nNow think about your home, and the place that you sleep\nAnd the homeless, who only have the concrete\n\n[Chorus 1: Don-P]\nNowhere to call your own\nOut here in the cold\nWishing you had a home\nFeeling you're all alone\nNowhere to call your own\nOut here in the cold\nWishing you had a home (Yo)\nFeeling all alone\n\n[Chorus 2: Macklemore]\nNow if you wanna see change then throw your ones in the air\nYou think the system that we're living in is not fair?\nYou wanna see change? Then put your ones in the air\nNow point it to the ground, 'cause change starts right there\nNow if you wanna see change then throw your ones in the air\nYou think the system that we're living in is not fair?\nYou wanna see change? Then put your ones in the air\nNow point 'em to yourself, 'cause change starts right there\n'Cause change starts right there\n\n[Outro: Don-P]\nThe streets are cold, all alone\nIn the city\nWhere you lay your head is your home\nWhat a pity\nPeople pass you by with a glance\nSay you're filthy\nBut they don't know they pain you've been through\nNo, not really", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}