{"songs": [{"title": "All My Bitches Love Me", "album": "From Zone 6 To Duval", "year": null, "lyrics": "[Intro]\nShe loves me, she loves me not\nShe loves me, she loves me not\nVVS all my rocks, my watch\nI love you too baby (It's Gucci! So Icey CEO)\n\n[Verse 1]\nShawty says she loves me but I’m thinking maybe\nWanna have my baby\nAnd wanna name him Radric\nMy name Radric Davis, I am not a savior\nRadric is a player but Gucci is the mayor (It’s Gucci!)\nShawty fine as hell but she slick as hell\nLove the way she walk and I love the way she smells\nShawty says loves me, but I don’t believe her\nWhat about your ex-man? Could have been your husband\nWhat about your boyfriend? Better yet your girlfriend\nGirl got a girlfriend, But I don’t have a girlfriend\nBut I got a bitch tho sitting in my seven four\nRidin through the Six slow hood love me\nSo Icey Boyz everybody got a bad bitch\nJuice keep a bad bitch, Zay keep a bad bitch\nFrenchie got a bad bitch, Whoo got a bad bitch\nGucci got a bad bitch and Waka got a bad bitch\n\n[Hook]\nAll my bitches love me, all my bitches love me\nAll my bitches love me, I am very lucky (kisses hahahaha)\nMy bitch says she loves me, my bitch says she loves me\nI am very lucky, cuz my bitch say she loves me\nAll my bitches love me, all my bitches love me\nAll my bitches love me, all my bitches love me\nAll my bitches love me, my bitch says that she loves me\nI am very lucky, I think that she loves me (It’s Gucci Baby)\n\n[Verse 2]\nAll my bitches love me, my bitch is not ugly\nMy bitches ain’t dusty, but your bitch is busted\nYo bitch is a buster, my bitch is a hustler\nShe don’t fuck with suckas, she know you a sucka\nYou probably know of her, you may even fucked her\nShe can’t give me nothing but a nut because I’m stuck up\nGucci got a dump truck and he got a hummer\nAnd he painted all of his cars green for the summer\nYou a freaky gurl but I don’t want your number\n(noooooo) I just want that thang beat up just like it’s a drumma\nBumBumuBum grab you by your palm Palm\nThen I pull out a condom and make her want some (It's Gucci)\n\n[Hook]\n\n\n[Verse 3]\nGucci Mane a bachelor, damn you attractive\nLooking for the baddest bitch cuz I think I can handle it\nMy swag is conceited, some bitches can’t stand it\nSome over stand it, but some don’t understand it\nAll my bitches love me, but I’m not romantic\nBut I love it when they were their dress without the panties\nGucci Mane, I’m madness, don’t you think I’m handsome?\nCurling a Lambo, You handle like a Phantom\nHotter than a candle you trying to get a temper\nCan I get a sample? I feel like a need a pamper\nSo Icey the shit girl, don’t you think we handsome?\nDon’t you think we handsome?\n\n[Hook]\nAll my bitches love me, all my bitches love me\nAll my bitches love me, I am very lucky (kisses hahahaha)\nMy bitch says she loves me, my bitch says she loves me\nI am very lucky, cuz my bitch say she loves me\nAll my bitches love me, all my bitches love me\nAll my bitches love me, all my bitches love me\nAll my bitches love me, my bitch says that she loves me\nI am very lucky, I think that she loves me (It’s Gucci Baby)", "image": "https://images.genius.com/fcc541d6d90cfb0abd7802a11141eeaa.500x500x1.jpg"}], "artist": "Gucci Mane"}