{"songs": [{"title": "My Burnin’ Heart", "album": "Beginnings: The Lost Tapes 1988–1991", "year": null, "lyrics": "[Verse 1]\nI lay awake tonight, because I wanna be with you\nIf you were beside me, I'd playfully kiss you\nEach time I see ya, the feelin gets stronger\nYou sit a bit closer, we stare a lot longer\nHuh - reach for my drink and for a second we touch\nWords are muttered I stutter, cause I want you that much\nThe situation is a no-win, cause he's my best friend\nBut now I'm guilty, of fallin for his girlfriend\nI know it's wrong but my heart is filled with purity\nI offer passion but he offers security\nIts like a trap that I'm sinkin into\nI wake up sweaty when I'm sleepin cause I'm thinkin of you\nThen we make eye contact, and I can't hold back\nI try to shake it but the feelin comes right back\nWhat have I gotten into, I feel posessed by you\nI have these thoughts at night, of undressin you\nIts kinda obvious blind men might see it\nBut he doesn't, so he keeps on trustin me\nLeaves me alone wit you, while he's on vacation\nWell how could he leave me, with this temptation?\nNow I'm confused, cause I'm no Casanova\nBut you keep callin - you're sayin to come over\nWhat do I do? Go or stay and play it smart\nIts gettin rougher cause I suffer from a burnin heart..\nMy burnin heart..\n\n[Verse 2]\nGirl, you are my one and only\nYou are my angel, and now ya wanna leave me lonely\nWhat did I do? Baby did I treat you bad?\nMy heart is broken, and now ya make me sad\nI remember, when this love affair first started\nWe was so in love, and now we are departed\nGirl, I'll buy ya anything ya heart desires\nI have to let ya know, baby you're my fire\nWarm and wet, each kiss is prolonged\nIt's your sweet caress that makes Rock T strong\nJust bein with you, and seein the two of us\nWalkin along the beach, cause girl you are my peach\nSo sweet and tender, my love I surrender\nNo need to pretend, that you'll want it to end\nI'll never let you go, you're forever my girl\nYa know why? Cause girl, you are my world\nMy burnin' heart..\n\n[Verse 3]\nTotally tounge tied, every three seconds I keep watchin you\nHe's my best friend, but I can't help clockin you\nHow could this be? How could we both love you\nNow I'm trapped in this position and don't know what to do\nI could forget about you, pretend that we never met\nBut when I'm here without you, I start to heavily sweat\nYou give me looks that reinforce the bond that's already there\nSo many times I find eyes locked up and just passionately stare\nPlay the role like you don't matter, he swears that we hate each other\nBut in reality we can't wait to taste each other\nYou're my addiction casue I fiend for your desperately\nI stand here fantasizin, because you're next to me\nWhat can I do, with this passion I feel\nIt's too hard to conceal, so I know it's for real\nWatched you so many times, I know where every curve is\nI think you reads my mind, and so I'm feelin nervous\nI wana tell you how I feel, but that wouldn't help\nIt would only cause problems so I keep to myself\nEven though, it drives me crazy, to see you sittin with him\nA tear rolls down my cheek, because I see you kiss him\nI know the words you're sayin before they can be said\nHear the thoughts that you thinkin before they come in your head\nWouldn't hurt the brother, for anything in this world\nBut damn I fell in love with his girl - my burnin heart, heart, heart..\n\n[Verse 4]\nMy heart is burnin, ya know it's yearin, for ya sweet caress\nI lay in ecstacy, as you kiss and rub my chest\nYou know ya love me, why must you deny yourself\nWhat I can offer you, yet you want somebody else?\nIt's not that - well then girl, what could it be?\nI hope I'm good for you, cause baby you're so good for me\nMany nights I cried and tried to make this work\nThen act the fool and cool and cruel like the church\nWell I'm sorry baby, I have to let you know\nYou are my life my strength I refuse to let you go\nYou are so beautiful, baby you light up my life\nI close my eyes and dream of that you'll become my wife\nDay in and day out, it's you I pray about\nDon't lock the door to your heart and make me stay out\nI love you cause honey, you're like a work of art\nYou got me on fire - my burnin heart..\n\n[Verse 5]\nI lay awake tonight, because I wanna be with you\nIf you were beside me, I'd playfully kiss you\nEach time I see ya, the feelin gets stronger\nYou sit a bit closer, we stare a lot longer\nHuh - reach for my drink and for a second we touch\nWords are muttered I stutter, cause I want you that much\nThe situation is a no-win, cause he's my best friend\nBut now I'm guilty, of fallin for his girlfriend\nI know it's wrong but my heart is filled with purity\nI offer passion but he offers security\nIts like a trap that I'm sinkin into\nI wake up sweaty when I'm sleepin cause I'm thinkin of you\nThen we make eye contact, and I can't hold back\nI try to shake it but the feelin comes right back\nWhat have I gotten into, I feel posessed by you\nI have these thoughts at night, of undressin you\nIts kinda obvious blind men might see it\nBut he doesn't, so he keeps on trustin me\nLeaves me alone wit you, while he's on vacation\nWell how could he leave me, with this temptation?\nNow I'm confused, cause I'm no Casanova\nBut you keep callin - you're sayin to come over\nWhat do I do? Go or stay and play it smart\nIts gettin rougher cause I suffer from a burnin heart..\nMy burnin heart..\nMy burnin heart.. my burnin heart.. my burnin heart..", "image": "https://images.genius.com/9e142d133ba86fd5bdc94a72f198e2e5.375x376x1.jpg"}], "artist": "2Pac"}