{"songs": [{"title": "Paper Plates (50 Cent diss)", "album": "Pro Tools", "year": "2008-07-15", "lyrics": "[Verse 1]\nYou ever see someone who roll with Mayweather\nRhyme like Ricky Hatton\nSmash whatever you throw, 1000 is what I'm battin'\nGot a few hooks but no jabs\nTook them out your corn dog books and notepads\nI get it, you Got Rich robbing those in the industry\nBite off this one, steal from your enemy\nNever try to play the hottest one out your camp\nHe might step off and take half the juice from your amp\nEnough to make you vogue on the cover of GQ\nOnly missing the sheer blouse, homie, you see-through\nStop sipping on that Formula 50\nThey want heat, I'll give it to them burnt and crispy\nRhymes too short to box with God, so stretch it\nEspecially these overrated rap steppin' fetchers\nI told you if I rain, there'll be an eternal drizzle\nWoodwork strips being chipped to charred chisel\nOne verse shatter your spine and crush your spirit\nNo matter what, you still window shop for lyrics\nIf you's a pimp, put chicks on a stroll\nAnd if those your soldiers, give 'em bigger guns to hold\nWho Shot Ya? You don't have enough on your roster\nMove like a Fed, talk like a mobster\nThat Yayo slangin, please abort it\nToo many cuts on it, cokeheads they won't snort it\nSpray the Flea-Unit with pesticides\nYou can get your best ghostwriters, get them all to testify\nHave you ever been stung by a thousand hornets?\nFive hundred killa bees, buzzing and really on it\nWhipped with Cuban Linx, cut with Liquid Swords\nChoked by Ironman 'til we crush your vocal cords\nYou ain't nothing but a pig in a blanket\nHoghead, the deadliest food at the banquet\nAll this rap crap that's trapped in your colon\nOnly means, get rid of the whack shit you're holdin'\nSweet-tooth dudes stay out the candyshop\nYou ain't gotta handcuff 'em to see the panties drop\nA few cats is looking for a rat with cheese\nGot something to pitch? They all swing a bat with ease\nGet your ankles rolled while doing your two-step\nLeave a Thank-You note for the crutches the Wu left\nProactive rap, you know they put drug in the cream\nYou hallucinate, see Kanye in your dream\nAnd yo, I don't smoke dust; I dust off Smokey and the Bandits\nWith the brush stroke off the canvas\nI walk on your Gators and lizards\nRaise the lynx that was killed for your minx, you be rocking them Blizzards\nWanna be caught 'til you walk the D-Block\nTo get a transfer, I'll spread your wings like Peacocks\nI was an emcee while you was in Nutville\nOn a world tour, you was gettin' your guts filled\nTen years your senior but I flow like I'm twenty-one\nStraight from Medina with a mass of many suns\nSupernova give off gamma-ray bursts\nAnd I'll finish this, only cause I let off first, what's up?", "image": "https://images.genius.com/c7e167ce2621e6f44da9330c4ba8a684.640x640x1.jpg"}], "artist": "GZA"}