{"songs": [{"title": "Writer At War: Kendrick Lamar’s XXL Cover Story", "album": null, "year": "2015-01-06", "lyrics": "Writer At WarKendrick Lamar in his own words.A lot of times in interviews, people ask me things like, “How does it feel now? What have you bought your mom and your pops and family?” Nobody ever really asks about what it’s like trying to adapt to fame and money and how much of a depression it can make for you. How much of a depression it could put you in knowing that so many kids hang on to your words. I can’t make a song like “i” without being in that dark place. “i” comes from going overseas, going to New York, being in L.A. and hearing kids saying, “Kendrick, I was gonna kill myself last week. Section.80, good kid, m.A.A.d city saved my life.” Or “I was gonna kill myself tonight until I came to your show.”\n\nI believe that they are telling the truth. At first I wasn’t so sure, maybe it was just they were excited to meet me. But then they showed me their wrists and had all these different scars from when they tried to take their lives but failed. Or I look into their eyes and their pupils are dilated and they on all these types of meds and drugs, it’s a whole different story to me. That’s when I learned that while I’m making music for myself, drawing from my own experiences and conflictions and battles within myself, this teenager listens to every word I say. And that’s spooky\n\nI think one of my biggest battles within myself is embracing leadership. You always grow up and you hate the term “role model.” You would say, “I don’t wanna be a role model. I don’t want none of that.” But in actuality, you are the biggest role model. It’s impossible to fight the title of role model. Especially when the type of music I make is so personal. People feel like they can relate to me or that they are me. They feel like they know my whole life story even though we from different worlds. So when I go out and meet them in public, I don’t get a response like, “Kendrick, will you sign this real quick?” Or, “I wanna just take this picture with you.” No, they want to have full conversations. I find out that they live their lives by my music and that right there is something\n[Kendrick Lamar's XXL Cover Story - Second Clip]When I try to soak it all in, that’s the only thing that kind’ve scare me, feel me? Life is sad in general and I’m meeting these different people every day. It kind’ve snaps me back into reality outside of what I do. Outside of the girls, outside of the cars, the money, it really ain’t that important when you meeting somebody that’s still in the struggle. These the people that live their lives in dark spaces, every day , you know, and they use my music as some sort of tool to keep going, almost like a Bible, you know? These kids feel like they got nothing to believe in but they see me and say, “Kendrick, I believe in you. I believe in your music.” And what happens it puts me in some type of space where it’s almost like some type of worship or responsibility, but I know it. I can see it\nAnything I say or do, I don’t take back, I don’t regret.I think one of my biggest assets is not knowing how famous I am. Or even excluding the word, I hate the word “famous.” I’m aware of it. I know people treat me different because of it. And the more I am aware of that and play into it, the more I become detached from the real world. So it’s really about balance. The more somebody opens the door for me and I walk through without acknowledging that they opened the door for me, the more I become separate from others\n\nI had a talk with Lauryn Hill and she said, “Try to completely throw away your ego.” How many times can you throw away an ego, you know? It’s tough. It’s something we all battle with. I battle with it all the time and the idea of being in all these places—the big spots, all the events, the lights—it’s all for your ego. It’s all for your own confirmation to be like, okay, I’m somebody. But truthfully, you’ve always been somebody. You don’t need the lights\n\n\n\n\nI try to think about that. Also, I like to look at old pictures and think of things from back in the day that kind of draws me back to where I came from. I think a lot of times when artists are in so much of the now, they only think of what’s ahead of them, which is cool. But I look at pictures of the small little apartment that I come from in Compton and things like that. And it always trips me out when I get too far out there where I’m missing phone calls or not responding to text messages on time or my peoples is hitting me, my moms is and I can’t get back to her. Sometimes you on the go and you forget about those little things\n\nIt’s definitely a gift and a curse when you make music as personal as I make it. Of course you get the kids out there that say that they relate to you and this song saved their lives, and you helped them with their assignment for this and that. And then at the same time, your privacy is not respected. And all entertainers go through it, but moreso the ones that make very personal music, because it’s not just me you’re focusing on now when I’m out in public, but also on individual characters that I’m talking about in my music. So that’s a whole other ballgame and it’s just something that I’ve gotta accept\nWhen I’m completely drained of inspiration, that’s when I’m finished with the project.I think the way it is, the positive aspect of me gaining more listeners and giving them some type of motivation and relatable effect, it’s more than running from somebody snapping a picture of my mom’s van that was on my album cover, that she actually still has. I’d never think that would happen, but it’s happened plenty of times to where she has to hide the van now. She can’t drive that thing no more. And she’s old school, she wanna drive it. But I never want them to be in this type of world, because not everybody can handle it. I think the average person wouldn’t be able to handle the day-to-day. It’s a lot of things you gotta deal with. So me doing that, it’s just a piece of me. I gotta find balance and try not to really get too frustrated over it\n\nI’d be lying to you to say I knew good kid, m.A.A.d city would be as successful as it has been. In the beginning I was very doubtful. Once I was done, the jitters hit me so fast. I was so confident in making it, because I was like, “This is it, man. Nobody heard this story and if you heard it, you heard it in bits and pieces but I’m finna put it to you in a whole album—from Compton, from the hood, from the streets—it’s a whole other perspective and light, I’ma go back and do the skits just like how Biggie and Dre and Snoop and ’Pac did it. And I’ma tell my story.” Then I wrapped up with it and said, “Man, what’s on the radio right now? I don’t think they doin’ skits and things like that.” I don’t know if the people are gonna understand what I’m talkin’ about on this album because it’s almost like a puzzle pieced together, and albums ain’t been created like this in a long time. Albums that actually still reach the masses, at least\n\n\n\n\nMy whole outlook on being signed was to have an actual massive commercial successful album. This is what you think as a kid. You don’t know nothing about creative process and things like that. So I didn’t know how blessed I was to actually go and make an album that I can create and control 100 percent. When I was done with it, I was like, “Man, these people believe in me like this? They let me just do this whole thing by myself like this? I don’t know. Y’all sure I’m right?”\n\nI was nervous because I didn’t think the people would understand it. And I get a call from Pharrell. He said he had a copy of the album and it’s amazing. And I was like, that call was right on time because that was when I was feeling super insecure about it. Pharrell said, “Never feel that way again. When that little negative man come behind your head, always follow your first heart, and that was your first heart, to put the album out like this.” This is his words verbatim, he said, “Watch what’s gonna happen.”\nI believe in this theory that when you get success and you get fame and money, it makes you be you times ten.When I come up to certain artists, artists that I’ve always looked up to, and they can recite my records that wasn’t the single, that puts me in a space where, okay, this is a person I always respect and to get their respect back was almost like confirmation for me. I always thought confirmation would be having a lot of money, and things I could do for my family\n\nBecause that was what we was taught when you come from these urban neighborhoods, you was taught that having money was success and that’s all you see, all you know. So once I got the money and everything else that comes with it, I felt like I wasn’t satisfied. I’m looking around like, this is great security, but I don’t even spend it on myself, I spend it on my loved ones. That makes me feel good knowing I can support somebody that’s in need. But at the same time, I’m feeling like, okay, what’s after this? So what I realized was, my greatest fulfillment of accomplishment was having somebody that I looked up to for so many years and knowing that I put in that same dedication and work and them saying, “Thank you.” And them being able to recite them lyrics\nKendrick Lamar - Bitch, Don't Kill My Vibe ([Explicit)]I think the first time I played “Bitch, Don’t Kill My Vibe” for Andre 3000 was before it came out. I never share my album while I’m creating. I think that the situation with Andre was one of those things where he was in the studio with Dre and Dre was like, “Play some stuff .” I can’t say no to Dr. Dre. But me creating music, I never really play music for anybody, even people inside the camp because it can almost sway your creative process 100 percent. So along with that, I cut off everything on the radio; I really just duck off from music. Because I’m gonna be influenced and I don’t want to be. That has always been my process. I just feel like, it’s really the only prized possession that I actually can control, you know? It’s selfishness for sure, but it’s my selfishness and I own it\n\nI know a lot of people that go around and play music to get approval because some are not so confident in the things they do. But with me, personally, I can only speak for myself, this is me. Anything I say or do, I don’t take back, I don’t regret. That’s how I was feeling at the time and that’s how y’all gonna get it, and I own it. Love me or hate me, I own it. It is what it is. And that’s how I look at it\n\nFrom 13 years old to the time I was 21, I was in a mode of mastering how to be a rapper. Like a rapper’s rapper, using my tongue as a sword, a fuckin’ barbarian. That’s all it was about, slaying words. So when I turned 21, 22, somewhere around there, I got into a mode where it became more of a writer aspect for me rather than just being a rapper ’cause this is around the same time where cats weren’t putting out mixtapes anymore. They was putting out full bodies of work and wasn’t even signed to a major label. So by that time, that’s when I started developing and actually constructing my music from a writer’s point of view. good kid, m.A.A.d city was probably one of them albums that you could unfold out into a book and read it. And that’s how I treat everything. Everything is critical like that from here on out. It’s the art of writing\nSo you ask yourself in the midnight hour, ‘Who am I? Is this really what I’m supposed to be doing? How did I get here? Why am I doing this? What’s my responsibility?'This is more than just music for me. This is actually a piece of me. I’m obsessed with it. And that’s how I take it. When I make my music, it comes from a genuine space where I’m already spreading myself wide to the world. So during my process in creating it, that time is for me, personally. That’s for my heart, those are my memories that helped me up with these lyrics and get inspiration. That was my memories. Taking those inspirations and going into that booth, that’s something that I hold dear\n\nWhen I’m completely drained of inspiration, that’s when I’m finished with the project. When I start maybe trying to tamper with things that I shouldn’t tamper with, I’ve already had done, that’s when I’m done and I know I’ve exhausted inspiration. That comes with not wanting to actually rush the process. I always want to put it down to the last idea, and once I’m drawn away from it, that’s when I say, okay, let’s take all these pieces—they might not even be songs—let’s take these pieces and construct it. So what I want to say, and how I want to execute it becomes clear\n\n\n\n\nIt’s the best part because the things that I say on my records—this is another reason why I don’t just play records for people—you won’t necessarily get it until it’s constructed. I know what type of artist I am. I’m not an artist that’s gonna give you a single and say, “This is what my album’s gonna sound like, go sell it.” That’s not me. I’m just not that artist to give you one or two songs here and there and run with it. Everybody has their own niche. With mine, I just own it, and I know that’s exactly what that is. And I wanna keep that lane. I don’t want to jump in somebody else’s lane and try to do their moves because it may not work for me like it worked for them. So I stay where I feel like I’m inspired\n\nWhat’s crazy to me is that I feel the same energy now that I felt before my first album. I know there’s lot of pressure for me on this new album but it don’t necessarily scare me. It’s almost confirmation, like, go in there and challenge yourself just the same way you challenged yourself the first time. Because I remember going to radio stations and them telling me this: “Dr. Dre had Snoop Dogg, 50 Cent, Eminem, you seen what Eminem did, right? Yeah, uh huh. Kendrick Lamar, he from the West Coast, and Compton, too. Dre from Compton, you see the legacy he left. Yeah, so I hope that album is good. Matter fact, you got the weight on your shoulders right now.”\n\nThank you for that. Let me get in the studio now since you just put the battery in my back\n[Kendrick Lamar Covers XXL Magazine's Winter 2014 Issue]I thought I was going to win Best Rap Album at the Grammys. I put a lot of work in on my album and the biggest thing for me is knowing that it was basically an underground album. It didn’t have big No. 1 records on it and there wasn’t really any commercial hits. It was great songs and I think the message behind it reached as many listeners and believers as a super mainstream album. So for me, when you’re saying, “rap,” that would be my definition of something that deserved an accolade. Yep\n\nI found out a lot about myself in these past two years. It’s scary. I know more about myself now than any other point of my life. I believe in this theory that when you get success and you get fame and money, it makes you be you times ten. I was a pretty shy and to myself type of person as a kid. And now 15 years later I’m in front of people every day, tens of thousands of people. So that makes me more of a recluse. That makes me not come outside of my world on the outskirts of L.A. and bounce around different places and things like that\nWhat I do is for a greater purpose and we all need money and things like that to survive, but the energy around some of these spaces, it can draw you into a crazy place.So you ask yourself in the midnight hour, “Who am I? Is this really what I’m supposed to be doing? How did I get here? Why am I doing this? What’s my responsibility?” It’s a real trippy thing, you feel me? And I think it’s something that nobody can understand; only an artist can. Things change for you with success when you get money. I noticed when people started treating me a little bit different, the people that I cared about the most, my close friends and family. The artist don’t necessarily change, it’s usually the people around them. Their expectations of you can sometimes be out of control. You can do one thing that can trigger something mentally in them that makes them think that you don’t care about them or you don’t fuck with them no more when that’s not the case. You’re just more focused on what you have to do because it’s bigger\n\nThe moment I start seeing change in people around me, that’s when I know something is a little bit different. Then there’s tension in the air that I probably can’t necessarily deal with at the moment. ’Cause when the industry don’t understand me, and the business don’t understand me, these are the people I can run to. What happens when I can’t run to them?\n\nArtists just get paranoid in any situation and circumstance. I’m always paranoid. I’m already a person who thinks a lot; sometimes I may overthink things or think too much. So when you’re put into a space where you feel like you can’t necessarily trust your close ones, that can do some whole other crazy thing to you psychologically. Seriously. All you got is you and God at the end of the day\n\nThe hard time for me was probably when I was on the road. It’s almost like you go on the road and you’re gone for two years. And this place you’ve known your whole life, these people you’ve known your whole life, everything is different when you come back. And you feel like, damn, your sanctuary is now on that tour bus. That dirty, stinky, smelly tour bus. And that’s one thing, among numerous other things, that have been hard sometimes. To the point where people are pulling for you left and right, where you feel like you don’t have control over your own life. Over your own well-being\n\nWhat I do is for a greater purpose and we all need money and things like that to survive, but the energy around some of these spaces, it can draw you into a crazy place. And I’ve seen and heard some of the greats go out because of it. And I’m saying this right now to let everyone know, it’s real and you have to be mentally steady 100 percent in order to keep doing it at a high level and still maintain your sanity", "image": "https://images.rapgenius.com/bd22f08574046822ccea9cab412ec7e0.670x916x1.jpg"}], "artist": "Kendrick Lamar"}