{"songs": [{"title": "Grindin’ My Whole Life (Rosenberg Freestyle)", "album": null, "year": "2014-09-08", "lyrics": "[Intro]\nI've been grindin' my whole life, nigga\nI've been grindin' my whole life, Rosenberg\nI've been grindin' my whole life, Fam\nYo, let me see, yo, uh\n\n[Verse 1]\nStuntin' on the low so they feel better\nDamn, why they hatin' on a real nigga?\nEast side Atlanta where they kill niggas\nI was in a coma but I stayed with you\nI'll be right by your side, radio play me that new 3005\nBino won't die, illest rapper alive\nSee what's up with Fredo when I'm out in the Chi\nMurder everything I touch, but I don't know why\nAnd he can get the business, your girlfriend love me\nTurn it up, who is this? Shots at your fitted\nGra-ta-ta, are we not that fly?\nAre we not young God, is this not black excellence?\nI could lie to you people but my soul too sensitive\nGam-b, y'all ain't got shit on me, man I'm so fly, like XYZ\nThreat to the throne, man, I'ma murder this\nYou are such a poser, you ain't ever heard of this\nShots at you fake boys walkin' 'round in turtlenecks\nAnd a du-rag? Wanna be me so bad\nAnd the hair so homeless, record labels want us\nBino well read, like Octobers\nHit me on my Snapchat, hit me on my Nextel Chirp\nRun up on them boys, get murked\nNigga sit down, he can't stand me\nCurly black hair, bright pink panties\nBlush on the vanity, tanner with her ass out\nWe don't have to love each other, she just wanna cash out\nStone Mountain bitch, run it off a mixtape\nThis is for my niggas up in Onyx getting shitfaced\nHe just dropped a mixtape, she got so excited\nTook her to a Clippers game and niggas ain't invited\nDrugs on the rider, need to clean my act up\nMan, I thought he was an actor\nThought he was a fuckin' joke, when I wrote them fuckin' notes\nEverything I do is dope, I hope you niggas overdose\nI hope you niggas hear the truth, so honest in my interviews\nIf Parker Lewis couldn't lose, I'm blackin' out at Tongue & Groove\nRoyalty, I run the crew, we them boys\n\n[Interlude]\nYo, I've been grindin' my whole life, nigga\nNah I'm talkin' 'bout?\nI'm just sayin' I'm grindin' my whole life, nigga\nNah know I'm talkin' 'bout?\nYo, I got some more, I got some more, yeah, yeah\nLet me see, Imma try and go in, uh, uhm\n\n[Verse 2]\nMothafuckin' right, we the niggas huffin' OG\nIn the club tryna keep it lowkey\nShe was all on my D, then we fell out of it\nCause I'm never really there and she tired of it\nReal nigga shit, real love, real pain, real intimate\nThese niggas so scared, I'm killin' it\nThese niggas so scared, I'm killin' it\nSo serious, gave the wrong young niggas money\nThey gave the wrong young niggas money\nGave the wrong young niggas money\nSchoolin' these niggas, got so many zeros they think I'm a dummy\nUnlike these other niggas, man I'm really from Atlanta\nThis dark-skinned art student with light-skinned advantage\nI'm ahead of my time, online messiah\nWho spits so much fire that you a God damned liar\nIf you say he ain't hot, numbers don't lie\nNiggas do though, when they say he ain't cold\nNiggas need to learn code, man I'm sick with the Python\nMothafucka, I'm ill, born just to die, that's the human curse\nThe world in my words, spit a universe\nI know they hate a nigga down in Spin Mag\nWorst album, best song, how you spin that?\nThe best part is that they love Chance\nBut our fans are the same, you should fuck with your man\nAnd I wonder what they'd say if that EP drop\n\"His verse was wack, his verse was hot\"\nI'm on my jock cause I don't need these hoes\nThey're all the same so I don't need these clothes\nSame white shirt with his nappy ass hair\nLike \"bitch do I look like I care?\"\nNah, in the end they will notice that we've been God\nI watched these niggas switch jerseys when your team lost\nAnd yet it's bitch move nigga, make the show 6 figures\nThen you fly to Kauai for a week off\nAnd his girl's body lookin' like a centaur\nThey do what they can, I do what I want\nLet's move it along, the point of this song\nI think you doin' fine all the time, drop a fuckin' bomb, nigga Vietnam\nOn my mom with my hand to God\nSo my hand's on my fuckin' chest, but you didn't notice\nNiggas hang around like we didn't notice\nNiggas can't help me but they want a selfie\nCause their girl is a fan and they really love us?\nKnow behind closed doors\nYou fuck with the kid or you still not sure? Be a man about it\nDon't talk your shit and shake hands about it\nBe a man, I doubt it, I don't know\n\n[Outro]\nI've been grindin' my whole life", "image": "https://images.rapgenius.com/34019cf50a505975a386a21a0cb21e1b.720x367x1.png"}], "artist": "Childish Gambino"}