{"songs": [{"title": "Wrote My Way Out", "album": "The Hamilton Mixtape", "year": "2016-11-17", "lyrics": "[Chorus: Aloe Blacc + sample + together]\n(\"I wrote my way out\")\nWhen the world turned its back on me\nI was up against the wall\nI had no foundation\nNo friends and no family to catch my fall\nRunnin' on empty, th'was nothin' left in me but doubt\nI picked up a pen and \"I wrote my way—\" out\n\n[Verse 1: Nas]\nI picked up the pen like Hamilton\nStreet analyst, now I write words that try to channel 'em\nNo political power—just lyrical power\nSittin' on a crate on a corner, sippin' for hours\nSchemin' on a come up, from evening'to sun up\nMy man awaitin' trial, misdemeanors we younger\nCourtroom prejudice, insufficient evidence\nJailhouse lawyers, these images still relevant\nFlickerin' lights inside my project hall\nSickenin', the mice crawl all night long\nAnd '87 Reaganism, many pages I've written on\nWritin' songs about rights and wrongs and bails bonds\nMaster bedroom, bigger than the crib that I was raised at\nI'm the architect like I wrote the code to Waze app\nI'm driven, black Elohim from the streets of Queens\nThe definition of what It Was Written means\nKnow what I mean?\n\n[Chorus: Aloe Blacc + sample + together]\n(\"I wrote my way out\")\nWhen the world turned its back on me\nI was up against the wall\nI had no foundation\nNo friends and no family to catch my fall\nRunnin' on empty, there was nothin' left in me but doubt\nI picked up a pen and \"I wrote my way—\" out\n\n[Verse 2: Dave East]\nI really wrote my way up out of 6E\nDevelop relationships with fiends, I know they miss me\nBefore the metrocards, it was tokens, I did the ten speed\nNever had wrote a rhyme in my life, what was a sixteen?\nAt sixteen, arrested in housin', trips to the mountains\nCame right back, trappin' off couches, watchin' for mouses\nOnly tools we was posed with, had a spot, smoke lit\nThe hate is just confusion, pay attention how them jokes switch\nDiadora was my favorite, the Mark Buchanans\nMama couldn't afford them, I learned everythin' on the border\nThat's a big 8, Clicquot parties with private dancers with no mixtape\nBumble Bee Tuna, now we could get steak\nI persevered, composition, I kept it close\nCompetition near, I'm a Spartan without the spear\nThree hundred rhymes, it was written before I wrote it\nOpportunity knockin', might miss it, that window closin'\nThis poetry in motion, I'm a poet\n\n[Chorus: Aloe Blacc + sample]\n(\"I wrote my way out\")\nWhen the world turned its back on me\nI was up against the wall\nI had no foundation\nNo friends and no family to catch my fall\nRunnin' on empty, there was nothin' left in me but doubt\nI picked up a pen and I wrote my way out!\n\n[Verse 3: Lin-Manuel Miranda]\nHigh speed, dubbin' these rhymes in my dual cassette deck\nRunnin' out of time like I'm Jonathan Larson's rent check\nMy mind is where the wild things are, Maurice Sendak\nIn withdrawal, I want it all, please give me that pen back\nY'all, I caught my first beatin' from the other kids when I was caught readin';\n\"Oh, you think you smart?\"—Blah!—start bleedin'\nMy pops tried in vain to get me to fight back\nSister tapped my brains, said, \"Pssh—you'll get 'em right back.\"\nOversensitive, defenseless, I made sense of it, I pencil in\nThe lengths to which I'd go to learn my strengths and knock 'em senseless\nThese sentences are endless, so what if they leave me friendless?\n\"Damn, you got no chill,\" fuckin' right—I'm relentless\nI know Abuela's never really gonna win the lottery\nSo it's up to me to draw blood with this pen, hit an artery\nThis Puerto Rican's brains are leakin' through the speakers\nAnd if he can be the shinin' beacon this side of the G.W.B and\nShine a light when it's gray out?\n\n[Bridge: Aloe Blacc + sample + together]\n(\"I wrote my way out\")\nOh, I was born in the eye of a storm\nNo lovin' arms to keep me warm\nThis hurricane in my brain is the burden I bear\nI can do without, I'm here (I'm here)\n'Cause \"I wrote my way—\" out!\n\n[Outro: Samples]\n\"—picked up the pen like Hamilton\"\n\"I wrote my way out of the pro—\"\n\"—wrote—\"\n\"—wrote my way out of the projects\"\n\"—pick—\"\n\"—picked up the pen like Hamilton\"\n\"I wrote my way out of the—\"\n\"—wrote—\"\n\"—wrote my way out of the—\"\n(\"I wrote my way—\")\n\"—picked up the pen like Hamilton\"\n\"I wrote my way out of the pro—\"\n\"—wrote—\"\n\"—wrote my way out of the projects\"\n(\"I wrote my way out\")\n\n[Spoken: Samples]\n\"Really, I saw, like, a hole in the rap game, so, if I wanted to put my little two cents in the game, then it would be from a different perspective.\"\n(\"I wrote my way out\")\n\"I thought that I would represent for my neighborhood and tell their story, be their voice, in a way that nobody has done it. Tell the real story.\"", "image": "https://images.genius.com/7ddd36cfe52ebd587314cd5a5962dacb.1000x886x1.jpg"}], "artist": "Nas"}