{"songs": [{"title": "Wuzzup", "album": "Hood Billionaire", "year": "2014-11-24", "lyrics": "[Verse 1]\nTatted tears for my woadies doin' bids in they 40s\nThe height a nigga go to for a penthouse with garages\nKeep my hand on the hammer, feds on the scanner\nBun B in my blood, Pimp C as I chatter\nRidin' dirty but my watches, I just took my bitches shoppin'\nJust landed in Detroit, I got a bitch as soft as cotton\nAll that talkin', it ain't nothin', Rozay comfy in the pocket\nTeddy Bridgewater run the trap just like a faucet\nHeroin on hollow tips, may I sit you with the highest?\nNo fly zone, muhfucka I'm the flyest\nGo and pay your rent, my new dicky covered in lint\nCanary  pinky ring, I got PETA all on my dick\n\n[Hook]\nI just pulled up to the office, time to link up with my partners\nBring a quarter to the table, we can go and get a dollar\nPut my bitches all on hold, like crackers sent me up the road\nThey gon' break off any way or time to do it for your woes, wuzzup?\nThey say them killas lookin' for me, wuzzup?\nThey say them people askin' questions, wuzzup?\nThey say them slidas slidin' on me, wuzzup?\nThey say my number's gettin better, wuzzup?\n\n[Verse 2]\nPhotoshoot fresh, four cubans layin' on my chest\nNigga hatin' from the start, still I wish 'em the best\nKilla with no regrets, chinchilla, so finesse\nTestosterone hella high, survived by gettin' by\nPolish up all your flaws, you can't be fuckin' her raw\nFinally made it to the majors, stealin' bases of course\nGivin' bitches your money, she givin' it to your dog\nHe who pillow talkin' the longest, may you rest in the morgue\n48 Laws flawed, my dawgs above the law\nDuck-tape Robert Greene, make him read the Qu'ran\nCouple dollars on my neck, DGK on my sweats\nCartier frames, Belaire on my breath\n\n[Hook]\nI just pulled up to the office, time to link up with my partners\nBring a quarter to the table, we can go and get a dollar\nPut my bitches all on hold, like crackers sent me up the road\nThey gon' break off any way or time to do it for your woes, wuzzup?\nThey say them killas lookin' for me, wuzzup?\nThey say them people askin' questions, wuzzup?\nThey say them slidas slidin' on me, wuzzup?\nThey say my number's gettin better, wuzzup?", "image": "https://images.genius.com/bef9a0948252c91da2c707ba7803fcfd.1000x1000x1.jpg"}], "artist": "Rick Ross"}