{"songs": [{"title": "Me & My Bitch", "album": "My Krazy Life", "year": "2014-03-18", "lyrics": "[Pre-Hook: Tory Lanez]\nUsed to have a girlfriend\nNow all I got is hoes\nJust looking for a down girl\nBut she was fuckin on the low\n\n[Verse 1: YG]\nHair done, nails did, caramel complexion\nPussy stayed wet like she was mixed with Mexican\nLove I invested in, Trust I invested in\nSo if she wasn't fucking with me I was stressing it\nWasn't no questioning, pussy was mine\nWasn't no questioning, Bonnie and Clyde\nStill living in my momma house, but I let her move in\nMomma thought I was tricking\nBut really I was just choosin', that was my bitch\nI was claiming her when we was fucking\nMy bitch, wasn't using condoms no nothing\nI was in love, she came first before my homies\nLike fuck it, I'm 'bout to get your name tatted on me\n\n[Pre-Hook: Tory Lanez]\nUsed to have a girlfriend\nNow all I got is hoes\nJust looking for a down girl\nBut she was fuckin on the low\n\n[Hook: Tory Lanez]\nAnd that was me and my bitch\nKnowin that these hoes ain't shit\nMe and my bitch\nCause nigga ridin' on that Westside shit\n\n[Verse 2: YG]\nDamn, I caught the bitch cheating\nDamn, she was with him last weekend\nWhat you mean you gon' call right back?\nWhat you mean you ain't got time like that?\nShe fucked a nigga I knew, ain't really fucked with his crew\nI did a song with his brother and she fucked with him too\nAll that shit she was talking, she wasn't really 'bout it\nAnd it made it even worse when my homie told me 'bout it\nI gave you your swag, told you to dress like that\nI hit your spot, made you say \"yes!\" like that\nAnd they ask me why I trust no bitch\nCause my ex had me feeling all embarrassed and shit\n\n[Pre-Hook: Tory Lanez]\nUsed to have a girlfriend\nNow all I got is hoes\nJust looking for a down girl\nBut she was fuckin on the low\n\n[Hook: Tory Lanez]\nAnd that was me and my bitch\nKnowin that these hoes ain't shit\nMe and my bitch\nCause nigga ridin' on that Westside shit\n\n[Verse 3: YG]\nNow she tryna get me back tho\nI had her sneakin, creepin through the back door\nI was horny, I just wanted to fuck\nI bust a nut in ten minutes I was in a rush\nReality, I hit it and she sad now\nShe pregnant, she know I coulda been a dad now\nShe text me like \"I love you\"\nI text her back like \"fuck you\"\nI looked down and looked up\nHer best friend ain't shit cuz my best friend hooked em up\nBut she know a nigga rich now\nShe text me like \"I'm stylin\", she just wanna be my bitch now\n\n[Pre-Hook: Tory Lanez & YG]\nUsed to have a girlfriend (woo)\nNow all I got is hoes (woo, woo)\nJust looking for a down girl (Bitches ain't shit)\nBut she was fuckin on the low (That's why I hit em in there)\n\n[Hook: Tory Lanez]\nAnd that was me and my bitch\nKnowin that these hoes ain't shit\nMe and my bitch\nCause nigga ridin' on that Westside shit\n\n[Outro: Female Voice & YG]\nYG, YG baby please can you talk to me? Please?\nI love you so much, whatever I did I'm sorry\nBitch\nFuck you", "image": "https://images.genius.com/ba2a73211e21ff3e11eba91f3f156e9d.1000x1000x1.jpg"}], "artist": "YG"}