{"songs": [{"title": "...And Then Again...", "album": "Keep Right", "year": null, "lyrics": "Peace and much love my people, I am Minister Server\nRight here with the teacher, KRS-One\nAlbum #13, \"Keep Right,\" or you gon' get left\nYou know what time it is, ain't no time to be frontin\nTrust yourself, get with the movement\nWww.templeofhiphop.org\nYo teacher, let 'em have it - like this, c'mon\n\n[KRS-ONE]\nYou get the CD and then, it's time to see me again\nYou break it open and then, no we not jokin again\nTurn on your player and then, the rhyme sayer again\nPut in the cd and then, you can't believe me again\nTurn up the volume and then, we blowin by you again\nYou start to listen and then, you see the mission again\nYou start to listen and then, you get the vision again\nU-N-I-T-Y that spells unity man\nOn G-O-D I demand, as you can see I don't end\nYour family I defend, don't battle me you won't win\nI'm not livin in sin, but I'm livin with Him\nHer/They/Them/Us trust yo let us begin\nKRS is unique, you can hear how I speak\nI be teachin the streets, I'm fin' ta reach for the peak\nI rock a club every week, I keep them thugs on they feet\nHe's back, just me, please, don't try to compete\nI kick that knowledge in college when I club it it gets rugged\nAnd you can see that these others be garbage and I love it\nUhh, what's the state of hip-hop?  Don't confuse it with rap\nIt's the state of your mind, it's the way that we act\nIt's that thing that makes you say yo I can never be whack\nIt's also clickin through my lyric lickings spittin the facts\nHot tracks y'all prep for combat\nBaby I'm back, they crazy whack, takin 'em out!\nThe philosophical flow son, that's live at my show son\nI'm soundin like no one, you feelin me though?\nThe people want me back like they want The Arsenio Show\nThey want the real, not a video ho!\nThis is KRS-One, you gotta believe me\nI'm sittin in the studio with Nice and B.C\nSee me tonight, we keepin it tight\nIt's another from the brother KRS, \"Keep Right!\"", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}