{"songs": [{"title": "Nobody’s Perfect", "album": "Cole World: The Sideline Story", "year": "2012-02-07", "lyrics": "[Intro: J. Cole]\nAy, oh, yeah\nCole world, ah, oh, yeah\n\n[Verse 1: J. Cole]\nYeah, this is for all the fans that waited, the bitch niggas that hated\nOld hoes we dated, look, Mama; we made it\nYour son out in Barbados, cheese, eggs, and potatoes\nSmokin' weed on the beach as my mind workin' like Plato's\nAnalyzin' the world, fantasizin' 'bout girls\nI'm handin' diamonds and pearls, and vandalizin' her curls\nSweatin' her weave out, moans as she breathes out\nFuck I'm doin' in parties with Hova and Steve Stoute\nI step over piranha, death over dishonor\nThey killin' niggas for J's, that's death over designer\nHey, Cole heatin' up like that left-over lasagna\nRemember when I used to be stressed over D'wana\nNow a nigga only text and get stressed over Rihannas\nI'm talkin' tens and better, hood bitches in Timbs and sweaters\nAnd we always argue 'bout the same thing\nAnd tell me, why we gotta argue about the same thing, same thing, man?\n\n[Chorus: Missy Elliott]\nNobody's perfect, uh\nNobody's perfect, ay ay, uh\nHey, but you're perfect for me\nNobody's perfect, uh (Ay, ay, ay)\nNobody's perfect, ay\nHey, but you're perfect for me\nWe rollin', we ridin'\nHe like to go inside and\nI love to go all night and\nWe rock the boat: Poseidon\nI love to call your name, name, name\nYeah, baby, I love to call your name, name, name, eh\n\n[Verse 2: J. Cole]\nOh yeah, to my college girl: Take the weekend off and come home soon\nI graduated way too long ago to be sneakin' all in your dorm room\nBut that thing tight like Fort Knox\nSo I call you when the tour stops\nBut baby, where your roommates?\nDid you make sure the door's locked?\nShe love it when we get together\nSmoke a little weed, put her shit together\nNow that I'm on I can pick and choose\nOnly fuck with hoes who got shit to lose\nYeah, I heard the stories 'bout different dudes\nHer man on campus, but it's fine by me\nShe say she only fucked like four–five niggas\nSo you know you gotta multiply by three\n\n[Chorus: Missy Elliott]\nNobody's perfect, uh\nNobody's perfect, ay ay, uh\nHey, but you're perfect for me\nNobody's perfect, uh (Ay, ay, ay)\nNobody's perfect, ay\nHey, but you're perfect for me\nWe rollin', we ridin'\nHe like to go inside and\nI love to go all night and\nWe rock the boat: Poseidon\nI love to call your name, name, name\nYeah, baby, I love to call your name, name, name, eh", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg"}], "artist": "J. Cole"}