{"songs": [{"title": "What’s Real", "album": "Gravitas", "year": "2013-12-15", "lyrics": "[Chorus: Talib Kweli]\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\n\n[Verse 1: Talib Kweli]\nI'mma start this story, my influence so enormous\nGot that shit you love to sing along with like every line is the chorus\nI'm born in Brooklyn like Biggie, I'm born in Brooklyn like Jordan\nI'm born in Brooklyn like Tyson, you don't live this, you just a tourist\nWe ride or die for them corners, fuck your private life they spy on us\nWhen they catch us man it's like practice for the new tactics that they try on us\nThem cops are lining them coffers, why we get shot we lying in coffins\nThey want my demise cause when I arrive they stop for lines so often\nNigga just stop, you might as well forfeit, we like Shia LaBeouf so lawless\nStill recognize real, real recognize real like the car I'm driving you foreign\nMy diamond cut so flawless, no not jewels, I'm talking 'bout songs, bitch\nSo if they after me like I'm Lauryn, I just tell the feds that I'm Moorish\nWe walking, all the girls is talking\nGenerally they butt fucking naked just like the Book of Mormon\nWe see the trees for them forest, my name ring them bells like a doorman\nY'all niggas game is so corny, that's why you grill them hoes just like Foreman, boring\n\n[Chorus: Talib Kweli & Res]\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\n\n[Verse 2: Talib Kweli]\nPaper chasing we on that grind, reputation on the line\nCrazy, borderline - pay me, on time\nCrazy, borderline - pay me, on time\nCrazy, borderline - pay me, on time\nExplore and discover what most fear, I will never wait till the brush clear\nSwear I will never get stuck here, America, fuck yeah\nMeasure my career in dog years, my passport got them dog ears\nI set sail, travelling the world like Jesus was doing in his lost years\nI might give you the pill like Morpheus, I'm like the P.E. logo in the cross hairs\nStanding out cause there's nothing but whores here, pimps rock crocodile like false tears\nBring it on through your force field, I'll be giving you nothing but the raw deal\nWhat I say on display is the purest skill, I'll be giving y'all niggas what's more real\nWhat's more real, what's more real? I got chicks fighting like floor sales\nYou gossiping bloggers all fail, like at the yardstick measuring your tall tales\nAnd you on all fours you small scale, all in between the legs like a dog's tail\nYou are what you eat, you don't want no beef, you completely vegan like all kale\n\n[Chorus: Talib Kweli & Res]\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\nWhat's real? Do you know?\nWhat's real? Let me show ya\n\n[Outro harmonies: Res]", "image": "https://images.genius.com/54775ab17c42667fc0aa1f24ca5154f5.500x500x1.jpg"}], "artist": "Talib Kweli"}