{"songs": [{"title": "Magnolia (Freestyle)", "album": "In Tune We Trust EP", "year": "2017-07-04", "lyrics": "[Intro]\nYo Pi'erre, you wanna come out here?\n\n[Verse 1]\nUh, in New York like Biggie, ROC, plants on my sock\nShe runnin' from the cock and when I shoot I *blatttt!*\nYeah, tell that thot her number blocked\nYeah, Stunna number blocked\nThis New Orleans milly rock, let 'em milly rock\nMe and woe don't really rock, evidently not, brrrr\nYeah, tell 'em it's the ROC\nIn New York, let Jigga rock, I'm higher than my socks\nI'm twisted like my locks, big up to the Lox\nI did a show with Ja\nYo Pierre, you wanna come out here?\nDid a show with Ja, soon as I left the spot\nPulled over by the cops, them bitches found my Glock\nThey threw me in the box, eight months tops\nStarin' at the clock, commissary stopped\nMan when Carter 5 drop, a nigga jaw gon' drop\nThe bitches' drawers gon' drop and then the calls gon' drop\nHello? I ball too hard, they flop, woah\nAnd all of these bitches got ass, how did they get it so fast?\nThey ain't have that in the past, I still smash\nIn L.A. they gettin' shots, bitch I know the docs\nM.I.A, we on a yacht, your bitch know where we dock\n\n[Chorus]\nHollup, I ain't from the 'Nolia, but Tunechi still a soldier\nAnd rest in peace to Soulja, 'cause he was real Magnolia, yeah\n\n[Verse 2]\nAnd I, fuck, these, hoes\nIf, I, don't, doze\nOff, on, that drank\nIf I, do, bitch you to blame, coochie lame\nWeed, stank, it better be the only thing\nBig bank, take lil' bank, you know the game\nAll these bitches want Young Carter, Young Carter\nThe fireman and firestarter, need water\nWoo, all of your bitches, they poo\nAll of my bitches, they're new\nThey got more bitches than you, all of these hoes in cahoots\nBut my bitch keep me in the loop\nShe blow me like hot Campbell's soup\nMy woadies come out like a troop, innocent bystander, oops\nEnjoying my financial fruits, I'm in a pineapple coupe\nPassin' you up like juke, turnin' heads like a screw\nGive that ho a tip, enough to buy a whip\nGive that ho some sip, she fall asleep, I dip\nI'm rich, bitch, Money, Mitch\nWhat's in that, bag?, 14, bricks\nYou got 14 bricks in that bag?\nUsed to, used to drive a Masi'\nUsed to be locked up, with the dude that stalked Ashanti\nUsed to be in Hollygrove with goons that caught them bodies\nTunechi got so many hoes, they call me John Thotty\nTell your bitch I'm Mr. Biggs, my nigga, Ron Isley\nI'm kamikaze-in' you niggas, Ronda Rousey\nIt's New Orleans, Milly Rock, Trukfit to the socks\nOVO Jordans, the ones that haven't dropped, uh\nWaitin' for Carter 5 to drop, uh\nIt's the, it's the Roc, uh\nTell them bitches it's the Roc, yeah, yeah\nI'm throwin' up the Roc, yeah\n\n[Chorus]\nI ain't from Magnolia, but Tunechi still a soldier\nAnd rest in peace to Soulja, 'cause he was real Magnolia, yeah", "image": "https://images.genius.com/d5517f57b983413b31c85d32bc3d7bec.768x768x1.png"}], "artist": "Lil Wayne"}