{"songs": [{"title": "Fuckin’ You Up", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Verse 1: Bizarre]\n'87 Maserati\nTwo gold Benz, bumping \"Lodi Dodi\"\nTwo old friends, twelve gauge\nCocked and loaded, Obama's in office\nBitch, she glad that she wrote it, I'm bad news\nRiding on a bad ass cruise, move down the city slick\nHere's some bad ass shoes, smack my bitch\nNow I'm on YouTube with some bad ass views\nNow what the fuck I supposed to do? Head in a trance\nI wanna see you dance, weed stink\nLike a rapper from France, face rotten\nLate soxy cotton, tie you up\nWatch you get fucked by Antoine Dodson and he ain't stoppin'\nI'm straight Nick coppin', old school\nWhite on white Reebok and can't tell me shit\n'Cause, bitch, I am the shit and the hard tuna fish\nYou smell this nasty shit? Nasty dick\nFor a nasty bitch (Fuck me in my ass)\nLet me do some nasty shit (I wanna fuck dude's balls)\nI got a nasty clique (Who's your security guard?)\nHis name is Nasty Rick (He's cute...) (Fuck him!)\nLet me suck on your nasty clit\nYou just a dirty bitch\n\n[Hook: King Gordy]\nWe like violence! We like fightin'!\nBitch, I'm Tyson! (I feel like fuckin' you up)\nWith rights and left jabs be [?]\nBe quite the fire! (But I feel like fuckin' you up)\nYou better protect yourself\nToo many punches are bad for your health (I feel like fuckin' you up)\nBut you need to ask yourself:\n\"Is he gon' beat my ass to death?\"\n\n[Verse 2: King Gordy]\nThis is insanity, y'all\nPicture a man finger fucking his family dog\nLick on its ass, stick it up in its vaginal walls\nDamn, he's having a ball, dog scratching my balls\nPlan to jam my hands in the ass of this dog\nNow he's laughing at y'all, you think he's insane\nBut has a unique brain to wrestle with gods\nI put Zeus in a figure four, Allah will get beat and forced\nOn your knees, you will bleed from Gordy intercourse\nAm I sick? Of course, I wear two horns, I will hit a dwarf\nSo hard in the fucking face with the poles at the North\nWhere Santa Claus at? While I'm still in the D\nTop illin' with some top tens [?] straw hat\nThe king of horrorcore, there's a fetus on the floor\nBeen fucked by a four year old, eat her whole [?]\nTill that fucking dead baby comes\nVisions of dead babies hung by their legs\nThere's the head of your baby son\n\n[Hook: King Gordy]\nWe like violence! We like fightin'!\nBitch, I'm Tyson! (I feel like fuckin' you up)\nWith rights and left jabs be [?]\nBe quite the fire! (But I feel like fuckin' you up)\nYou better protect yourself\nToo many punches are bad for your health (I feel like fuckin' you up)\nBut you need to ask yourself:\n\"Is he gon' beat my ass to death?\"\n\n[Verse 3: Swifty McVay]\nI sit in a dirty room with candles lit\nWith an alligator and pit, I'm laughin' at naked mannequins\nWith crack in the fryin' pan shootin' up smack in my right hand\nI never leave the crib without contraband\nI ain't human, I'm half man, an alien\nWith an attitude of a Taliban strapped with Nitrogen\nTo collide and die, every chance that I can\nThey don't wanna try, I'm a man with lyrical cancer\nThe Devil can't even dance with me\nTo be heinous, I was made to be\nLike a poison soaked in a handkerchief\nWalking behind your bitch\nI put the cloth to her lips like Dahmer\nAnd drag her out of that bar\nI'm a problem, psychopathic goblin\nThis llama tear the bladder outta the abdomen faster than zombies\nGet that ass beat, like a Nazi in Vietnam\nWith a swastika sign that's tatted on his body\n\n[Hook: King Gordy, Young Zee, both]\nWe like violence! We like fightin'!\nBitch, I'm Tyson! (I feel like fuckin' you up)\nWith rights and left jabs be [?]\nBe quite the fire! (But I feel like fuckin' you up)\nYou better protect yourself\nToo many punches are bad for your health (I feel like fuckin' you up)\nBut you need to ask yourself:\n\"Is he gon' beat my ass to death?\" (Let's go, yeah)\n\n[Verse 4: Young Zee]\nI make the three-eight and four-five blast\nTwo guns at once when I multi-task\nBow-bow-bow-bow, they both blastin' off\nTwo clips'll flip your lil Volkswagen car\nIt's Doctor Drankenstein\nI change my mind into Genghis Khan\nYou dudes face the Führer\nYou wanna kill my pets, man, you Ace Ventura\nMan, lay down and face the sky\nWhole new episode, a thousand ways to die\nYoung, man, I cock and squeeze it\nTurn your lil bitch to a quadriplegic\nOff the Pabst Blue Ribbon\nI slap two women and go back to prison\nGet a knife stuck in your gut\nI'm down with D12 and I feel like fuckin' you up\n\n[Outro: DJ Young Mase]\nShout out to Young Zee", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}