{"songs": [{"title": "Kansas City King", "album": "Murder Dog Presents Kansas City", "year": "2004-06-15", "lyrics": "[Intro]\n(Hog tie 'em x3)\nThem niggas is dumb niggas\nDisrespecting somebody that loved y'all niggas\nYou deserve everything you got coming you dumb motherfuckers\n\nThis one's for the rogues, this one's for the hoes\nThis one's for the shows, this one's for the ghettos\nThis one's for the rogues, this one's for the hoes\nThis one's for the shows, this one's for the ghettos\n\n[Verse 1]\n(Ey) Who put them asses in motion?\n(Ey) Who flow it fast like the ocean?\n(Ey) This shit is past the commotion\nI'm 'bout to push it further nigga rub it in with lotion\nSo many posed to be holding me totally foes to me\nGold to the protege his quota be so\nBut he alacrity rhyme motherfuckers know the design\nHow you gonna disrespect me when the whole city's mine?\nI been grinding like a motherfucker chasing my dream\nNo longer chasing I'm making my green\nAnd it seems that them niggas talking tough shit\nNot just some niggas but the hood I grew up with, niggas I grew up Get this (what's that), them niggas is pissed\nCause I got their house note, mistresses's house note\nFive car notes income tax return\nAnd three child support checks on my wrist\nI'm the...\n\n[Chorus] (x2)\nKansas City King\nI'm the baddest nigga that you ever seen\nYou stupid niggas don't really want no money green\nYou 'bout to see me take it about to see me bling\nAll you motherfuckers the\n\n[Verse 2]\nDown to the nitty gritty did I say nitty I said nitty\nCause ever since he left the shit ain't been pretty\nNigga had to skip scenes when he rammed his\nDick up in something sacred and your honor\nProbably gave him fifteen of the damnedest\nWhen I didn't have Scheiße to do\nI used to sit up on the block with the crew and drank brew\nNow niggas mad because I'm gone \"bonjour\"\nStupid niggas you never see me 'cause I'm \"on tour\"\nStacking cash and smacking asses with the masses\nYou still jacking stashes gun blastes\nFunny how my money it runs rapid\nLabelled me a devil cause your hustling level I done passed it\nNigga Will, my nigga still\nYou kept it real kept it all about the dollar bill\nThey wrong and you know it and I'm about to show it\nSince you said you was misquoted nigga I'ma hold it\nI'm the...\n\n[Chours] (x2)\n\n[Verse 3]\nBig Scoob you fixing to get schooled\nHow could you just diss dude and do something this crude you\nMotherfucking fool you\nI taught you patterns how to combat 'em cause you knew I was O.G. like TuLu\nI told you lets do the group called RDV\nAnd you said no cause ain't know we repping that R-E-D\nThen I said fuck that, I mean with R-A-P\nGet together and make the cheddar as far as they see\nSo I extended a hand to blend with with a band\nNow ex-friends with a man they'll send to the can\nWhen you pass me motherfuckers don't you ever ever ask me\nShit about Stuart Ashby simply because he slashed me\nWho used to trust you? (ME!)\nWho slept on your couch with and AK ready to bust who? (ME!)\nYou say people saying 5-7 R.D.V.'s ain't shit without me\nMake you wanna say fuck me, well FUCK YOU I'm the...\n\n[Chorus] (x2)\n\n[Verse 4]\nI started y'all gangster shit\nAnd this the motherfucking thanks I get?\nYou been challenging me ever since fourth and fifth grade\nMad cause you didn't get your credits on \"Mitch' Bade\"\nTalked to Don Juan, you don't want none\nLook at you blood you just a crab wonton\nMaking everything black and white the fattest\nNot at all but your business can't compete with Travis\nAt its worst status\nStrange will change the name of the game\nAnd claim domain and all lames will ravish\nMichael Whitebear, you been waiting to bust rounds\nAt a nigga well the opportunities right there\nSixteen bars ain't enough to express how I feel about you niggas\nNow I'm with my two niggas deuce niggas\nReign 'till I'm slain they will forever feel me\nThe only way to stop me you got to kill me the...\n\n[Chorus] (x4)", "image": "https://images.genius.com/02f52cb5179bc04ea0d60d2632c3758f.500x500x1.jpg"}], "artist": "Tech N9ne"}