{"songs": [{"title": "I Already Know", "album": null, "year": null, "lyrics": "[Verse 1]\nMan, Prince was a pimp, appolonia vanity\nSheila E. had me on the edge of insanity\nSwore if I made it in music I'd be similar\nHere I am, this is the future, I'm where the woman are\nRocking with Tim and Bob, y'all need me, shine a spotlight up\nIn the sky like Batman, I pops right up\nThis is Nas hate if u must hate been hot since the days of cassette tapes\nT-shirts over the thermals dripped in our memories\nSipping that Hennessey .45th in my denim jeans\nShe told me she was my eyelashes\nWhen we hump, I grunt just like a bull mastiff\nThey call me the best who ever did it\nOnly in the club one minute guess who I slip with\nA chocolate dike ghetto thing sweet\nWe going to pop tonight, bon appetite\n\n[Hook]\nDo you know who I am? And she says\nLa lalala I already know\nWhat we can't hold hands? And she says\nLa lalala I already know\nYou got to leave by three? you with me?\nLa lalala I already know\nSo until next week? you know, ma\nLa lalala I already know\n\n[Verse 2]\nYou know, mirror, mirror on the wall\nWho's the nastiest sexiest thug of them all?\nI seen her in the mall, she was wearing home\nDegarsole keyoke mose cherry cologne\nShe was looking very alone\n'Til this big weightlifting Mr. Universe clone starts grabbing her own\nBut she can't stop looking im in the zone\nOne look at the kid she taking of her stone\nCash crazy ass crazy hair long\nAnd baby amaze me because im in rare form\nShe like an ice cold bowl of post honeycomb\nFollowed me in the shop while I cop Nina Simone\nTap me on the shoulder I told her I her im on the phone\nI played it off well nobody was on the cell\nShit, she said the tone?\nShe said mister so and so should I leave you alone?\nI said\n\n[Hook]\n\nTick-tock, tick-tock time is passing\nHello?\nTurn the television off, focus here\n\n[Verse 3]\nYou know, lover not a fighter\nI'm the vagina liner reconstructor, bed sheet ruffler\nFor you freak girls undercover who loves ya?\nI'm not a priest don't front for me, but step in my confessional\nThat's the bedroom, tell the truth I'll be impressional\nWait before you pass your collection plate\nShow me you a professional so we straight?\nShe tried to kiss my lips, but no I don't do that\nWant me to kiss my lips but not with a new jack\nFew stacks spend my chips, yeah I do that\nSee the problem with you women is, look I got 'em\nYou can hear a mouse piss on cotton\nYou don't want to miss it then listen, stop stressing the man\nWe out to get as much sex as we can\nAnd you roll wit the plan, shorty you lie\nBut you got to leave, 2:45\n\n[Hook x2]", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}