{"songs": [{"title": "AZTECHNICAL", "album": "Just Like That", "year": null, "lyrics": "[Verse 1]\nIf you don't like what you singing, you sing a different hook\nIf you don't like what you cooking, you get a different cook\nIf you don't like what you wearing, you get a different look\nYou wanna escape Armageddon, read a different book\nWhen knowledge is right there, we don't even look\nDecember 2012 got this whole world shook\nBut look, the last days for others are the first days for us\nThe question to ask is who can you trust\nRespect to all that 2012 stuff\nBut when you really study it it's fear, it don't apply to us\nYo, Hollywood lies to us, all day\nThe question is what does your culture say\nWhere's your culture at? Who's your prophet?\nWhat history guides your spiritual logic?\nIt starts with a story, then it's hypnotic\nThen any myth that comes along, you just adopted it\nWhy? Because your culture, you forgot it\nDecember 2012, let's continue this topic\nTurn the page, the present world age\nBegan 3114 BC\nAccording to the Mayan calendar, this age concludes December 21st 2012 AD\nThis 5125 years cycle of calm is one world age\nNothing changes overnight, it's all a process\nA transition, it happens over many days\nIn the Mayan calculation a K'in, is one day\nThe Mayan Winal, that's 20 days\nThe Tun is 360 days\nA K'atun is 7200 days\nThe B'ak'tun is 144,000 days\nAnd they applied that to the Milky Way\nIn the cycles they saw the Sun\nMoving across the Milky Way's equator\nLining up with other galactic neighbors\nWe've been shifting for 30 years it seems\nFrom 1980 to about 2016\nThe shift is now, it's occurring now\nBut if you're learning from the movies you won't know how to survive\nOr stay alive after the storm\nCause after that a New World Order is born\nOh, you don't know, man? About they programs?\nYou still watching Lindsay, you don't see that low hand?\nLet go, man, the flood is coming\nDon't be scared, get prepared, keep your motor running\nRock with me\n\n[Hook]\nHigher level\n\n[Verse 2]\nYep, it's all mass control, here's the philosophy\nCortés knew about the Aztec prophecy\nBefore he invaded their society\nHe studied their cultural psychology\nHe knew they had armor, guns, and steeds\nSo he arrived in the Aztec year 1-Reed\nThat's the year Quetzalcoatl\nWas prophecized to return from exile in fact\nCortés played out the Aztec myth\nAnd took away those people's will to resist\nCortés played on religious beliefs\nAnd blinded the Aztecs, cause he was a thief\nLook, the Yucatan, that's a Mayan book of cycles\nIt lets the Mayans know when the Gods are gonna strike you\nIn fact, every 13 K'atuns you see\nThe Mayans were visited with a catastrophe\nSo every 200 and 56 or 7 years\nThe Mayan people lived with this fear\nSo on the island of Tayasal now Flores\nThe Spanish came armed with this knowledge\nThey knew according to the Mayan heavens\nThat the next cycle was 1697\nSo as the Mayans stood there fixed on the heavens\nThe Spanish showed up with all of their weapons\nMarch 13th, 1697\nThe Mayan people learned a terrible lesson\nYour fears and tears are used against you\nCause 80% of world control is mental\nBut back to the Mayans, they getting some more\n257 years after Tayasal\nA US-backed coup overthrows their democracy in 1954\nThat's exactly 257 years from when the Spaniards arrived at their shores\nI'm getting to the core of the lesson\nLets see what happens in 2211\nThat's the next cycle, that people remember\nLike 2012, the 21st of December\nThe consciousness may shift, you may turn the light\nBut you are the universe, you're gonna be alright\nThe pole may shift, your soul may lift\nTo higher consciousness but you know all this\nThe Edutainment style will persist\nForget the fear, it's knowledge that runs all this\n\n[Hook]", "image": "https://images.genius.com/d875b671438fbd543805b0533a6133b0.1000x1000x1.jpg"}], "artist": "KRS-One"}