{"songs": [{"title": "Tim Westwood TV Freestyle", "album": null, "year": "2015-05-02", "lyrics": "[Intro: Prodigy]\nQueens, New York, how we do this shit, man\nMobb Deep, go check this shit, man\n\n[Verse 1: Prodigy]\nYeah, let the lala hit you while P fix you up with this hot shit\nOh, what a mixture\nDope and Ds, some trees and Mobb Deep\nPut you right in that zone where you need to be\nGet you nice and roast, who writes the most?\nVivid shit, you're almost touchin' songs\nIt's like a fuckin' mirage when 'em guns go off\nAnd what you thought you saw don't hold up in court\nBesides, those that see is those that die\nIt's one love to Chi-Ali and he know why\nMmm, should've took two, but let one slide\nCome home like two in Madden 25\nWe cramped in the street and blend in the box\nSo, say if they wasn't locked, it probably be dead\nGo in like animal thugs, come out changed men\n2Pac told us not to be mad at them\n\n[Hook: Prodigy]\nI'm still goin', goin' to pack, pack my cali, cali\nSay what? I'm goin', goin' to pack my .45 cali, cali, cali\nUh, yeah, still goin', goin' to pack, pack my cali, cali\nLook, I'm still goin', goin' to pack my .45 cali, cali\n\n[Verse 2: Havoc]\nYeah, uh, lock the corridor, call the coroner\nThe drama's over, can't you feel the euphoria?\nA warrior, cowards gettin' cornier and cornier\nWe don't play games, never will we every toy with you\nCamp with you niggas, so my answer to niggas\nTake you for a swim, throw his ass in that river\nMy Lord, y'all bitches all fraud to me though\nNever banged out, we launch torpedo\nNiggas still on paper, he report to PO\nThen jump in the Lamb', man, we off to the show\nOh, play my cards right, never go see a ho, no\nOr catch me in the crib, compromise like, 'Oh, shit'\nBitch, what you got me into?\nMy goons'll will be here with the metal utensils\nLike pop-pop-pop-pop-pop-pop\nYou don't hear screams, all you hear is them shots\n\n[Hook: Prodigy]\nCause goin', goin' to pack, pack my cali, cali\nSay what? I'm goin', goin' to pack my .50 cali, cali, cali\nYeah, I'm goin', goin' to pack, pack my cali, cali\nUh, still goin', goin' to pack my .45 cali, cali, cali\n\n[Outro: Mobb Deep]\nInfamous Mobb Deep, M-O-B-B, yeah, B-B\nUh, know how we do this shit, man\nQueens, New York, H-A-V-O-C, Prodigy\nUh, how we do this, man, know how we do it, man\n2015, London Town, what up to the world?\nClip up, clip clip, what up?\nYeah, yeah, yeah, yeah, yeah\nShout-out to everybody out there\nSupportin' that Infamous movement\nThat Mobb Deep, smooth shit\nTwenty years, you heard? That gangsta shit\nKnow how we do this shit, nigga\nYeah, yeah, yeah, yeah, yeah\nWestwood, yeah, yeah, yeah, what up? Yeah", "image": "https://images.rapgenius.com/0690a63cc607f695ab7922c56ba957c9.1000x1000x1.jpg"}], "artist": "Mobb Deep"}