{"songs": [{"title": "DAPPER DAN", "album": "BEWARE THE BOOK OF ELI", "year": "2018-05-11", "lyrics": "[Intro]\nYes I'm still off of the new-\nYuh, yuh, yuh\nWho is it?\nSlime\nUh, who is it?\nWater!\nShout out, no mucus (Ha, ha, ha, ha, ha, ha)\nYeah, um, okay (Ayy, ayy, ayy, ayy)\nNatra\n\n[Verse 1]\nNever be sleeping 'cause I'm woke, bitch\nAnd yes, I'm still off of the Newport, bitch, uh\nI'm off dope bitch, she said my dick dope, bitch\nYuh, yuh, yuh, yuh, yuh\nRide me like animal\nYuh, yuh, yuh, yuh\nEat my meat just like a cannibal\nI wanna spoon that bitch like she a Danimals\nI be as fly as a bird with a beak\nMy chain as wet as the world's biggest cameltoe\nI smell yo' jealousy, boy, do it stink\nSo check out the Cuban links on top of the mink\nIt's wetter than my bathroom sink (Wet!)\nNiggas that think they know me think I think I’m giving a fuck what they speak\nSo I tell 'em-\n\n[Chorus]\nGet up, get up, get up, get up\nGet up, get up, get up, get up\nGet up, get up, get up, get up\nGet up (Woo!)\nMy energy get up like it do a sit-up\nI got the bitch lit up (Ayy)\nAnd I tell 'em, \"fuck you bitch\"\nAnd tell 'em suck my dick until you hiccup\nGet up-\n\n[Verse 2]\nNiggas fly like Peter Pan, call me Dapper Dan\nYes, I got a fan made of money up in my hand\nAnd I got a cannon, no Nick and no drum and band\nHotter than some sun on the beach when you're tryna tan\nTake a xan, 'cause I might scare ya like boogeyman\nBut really man, I pull up and droptop the minivan, man\nAnd a nigga rollin' like coasters at Disney Land\n(And a nigga rollin' like coasters at Disney Land, man)\nJump on a nigga like a pitbull, diamond biker chains, uh (Water!)\nWhen she sucking on my dick, sound like she eatin' lo mein, ho\nPeople swearing that they know the real me, bitch it's getting creepy (Look at it, look at it)\nFor everybody hating on me, suck my dick, bitch\nCan't sauce like me (Suck it!)\nOkay like-\n\n[Chorus]\nGet up, get up, get up, get up\nGet up, get up, get up, get up (Woo!)\nGet up, get up, get up, get up\nGet up\nMy energy get up like it do a sit-up\nI got this bitch lit up (Ayy)\nSo I tell 'em, \"fuck you bitch\"\nAnd tell 'em suck my dick until you hiccup\nGet up", "image": "https://images.genius.com/6e77e87535290914a52b8d3117dde689.275x275x1.jpg"}], "artist": "Ski Mask the Slump God"}