{"songs": [{"title": "Hollis to Hollywood", "album": "Mr. Smith", "year": "1995-11-21", "lyrics": "[Intro]\nYeah, you know it be buggin' me out, yknahmsayin in rap\nHow everybody like is usin' metaphors and all that\nIt seems like everybody's like a.. like some kind of metaphor freak\nSome kind of metaphorical freak or somethin' man\nYknahmsayin, word up, so, yknowhatI'msayin\nYou know brother's wanna make a movie and all that\nYknahmean? So I figured yknowhatI'msayin\nI'd just make a little movie, witcha chick involved\nHehe, y'dig? Check it\n\n[Verse 1]\nIf you saw the movie Wall Street I guess you know\nThe way I stack chips and regulate wild dough\nBut ain't no G-Funk and far from my era\nTales in the hood your boys'll feel terror\nMCs contaminating tracks with feces\nYou think I'm pussy until I flip like Species\nHigh-tech, yep, my pen got velocity\nJumping out the SSL like Virtuosity\nAnd never question what I'm doing to your girl\nShe let me dive deep like her panties is Waterworld\nBut are metaphors the only thing in rap?\nYou brothers need to stop with that\nI'm going from\n\n[Chorus]\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\n\n[Verse 2]\nCheck it\nI'll make the speed like I'm Keanu Reeves\nBut too many true lies can make a honey bleed\nShe said, I know you want this, ghetto Pocahontas\nI got higher learning and banging gets monotonous\nHer ass was classic, cheeks was Jurassic\nServing her justice, poetic the way I lasted\nI touch ground real windy with my lyrics\nMake her talk in tongue and feelash to swing\nWhen I do my thing my balls is ha the Holy Spirit\nHear it, pull it like strings, got mad ciry like The Lion King\nI'm in the jungle laying down my mack\nYou brothers need to chill with that\nI'm going from\n\n[Chorus]\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\n\n[Bridge]\n(Take me away) Uhh, you think I won't boo?\n(Take me away) Uhh, you think I can't boo?\n(Take me away) Uhh, you think I won't boo?\n(Take me away) Uhh, you think I can't boo?\nIt's kinda like miniature satellites floating in closets\nSpying in pockets\nJumping out of a helicopter into a football stadium filled with cotton candy\nWheeeeeeeeeeeeeeeeeeeeeeee!!\nYknahmean? Worrrrd up!\n\n[Verse 3]\nSo your man got a good job loving you so much\nBoss on his back coming home like, \"What the fuck?\"\nBut you be on his side through the thick and all the thin\nThat's when LL come in\nBlast her ass like Apollo 13, sugar dipped in cream\nPopping Dom in every direction, what a scene\nHe can't understand your best friend's plan\nRunning game while you chill with the demolition man\nGood love, mad fun, tight hugs and flowers\nI have your girl running off to fake baby showers\nBetter get down for your crown at home\nI got her standing on the bed, getting closer to the drop zone\nSome brothers won't appreciate that\nAin't it scary when you meet a real mack? Let's run it back\nSee the flavor's in my lifestyle, chill don't even lie to me\nBalls are lethal weapons, dick a menace to society\nYou ain't a player hater kid you took her off restriction\nI make her tell lies and knock the pulp out of fiction\nKid you know I'm game tight\nWhen you hit it tonight I hope she scream my name right\nThat's word is bond kid, you know why?\nI'm going from\n\n[Chorus]\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nHollis to Hollywood, but is he good?\n(See how it sounds? A little unrational)\n(Broken down to his very last compound)\nCheck it", "image": "https://images.genius.com/aba57f7703e47dacfcd5243398922d01.500x500x1.jpg"}], "artist": "LL Cool J"}