{"songs": [{"title": "6 in the Morning (Come On In)", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: Eminem]\nGood morning!\nWake your motherfucking asses up!\nAre y'all with us or what?\nWell come on then, you know what time it is\nStop sleeping on my group, BITCH!\n\n[Verse 1: Eminem]\nFor whatever it's worth, it's worth me having my ass whipped\n'Cause I'ma have the last lips, to ever kiss ass squished\nI just can't get passed these little pissants\nThat wanna be brawny bad asses so bad\nAnd they so mad they can't stand it, 'cause we can\nAnd they can't spit, and they can't handle it like a man\nAnd that's when it just happens and I snap then it's a wrap\nThen it's a scrap and it isn't rap, is it?\nHip-hop isn't a sport, anymore when you gotta go and\nResort back into that shit maybe I'm old-fashioned\nBut my passion, is to smash anyone rapping\nWithout having to slap him, believe me\nI'd much rather lift a pencil than a pistol\nWhen I'm pissed now, but it all depends on just how\nFar it gets took on the mic 'cause I'm telling you right now\nYou're not gonna like it, 'cause if I\nGet pushed over the edge, then I'm pulling you with me\nYou poke a stick at a Pit Bull, you get bit, B\nYour words stick to you, like crazy glue when you diss me\n'Cause they just bounce off me, like bullets do 50\nI'm the beautiful-est thing, and you're gonna miss me\nWhen I'm gone like Keith Murray, when he threw his stool\nAnd hit a girl accidentally, I do this for Swifty\nKon and Kuniva, Bizzy and Proof - are you with me?\n\n[Hook: Eminem]\nCome on then, everybody come on and\nKick your shoes off motherfuckers, come on in\n'Cause we get it on and, 'til the break of dawn and\nWake your ass up motherfuckers, quit yawning\n'Cause we ain't leaving 'til 6 in the morning\nSo have a sing along with the words of the song and\nIf you don't know the words and you can't sing along then\nFake like you know 'em motherfuckers and join in\nEverybody good morning\n\n[Verse 2: Swifty]\nThey consider me the, epitome of a beef starter\nIn the party with heat, it's hard to keep me without one\nFuck snubs, I walk in clubs with a shotgun\nConstantly popping slugs, they hot son, better not run (AHH!)\nThe bosses of all bosses; a holocaust\nTo whoever ain't cautious, In a house full of dog shit\nI'm a Gothic death prophet, you'll stop breathing\nYou'll die quicker than mach speed without bleeding\nIt ain't about what you reading, when you meet me\nBetter speak like it's Seasons Greetings, either that\nOr we'll be beefing frequent, niggas need an E just to speak shit\nYour leader's a petite bitch, keep the heater where you can reach quick\nI'll snipe you with it, and won't even keep it a secret\nNigga I did it, from the mind of a mental patient\nWhen Glocks sway, you can save that conversation for Satan\nYou brave?\n\n[Hook: Eminem]\nCome on then, everybody come on and\nKick your shoes off motherfuckers, come on in\n'Cause we get it on and, 'til the break of dawn and\nWake your ass up motherfuckers, quit yawning\n'Cause we ain't leaving 'til 6 in the morning\nSo have a sing along with the words of the song and\nIf you don't know the words and you can't sing along then\nFake like you know 'em motherfuckers and join in\nEverybody good morning\n\n[Verse 3: Kon Artis]\nI heard you niggas don't like us but so what\nThis beef is like what the fuck, did he say in his rap?\nEm, I can see that he just a punk, I mean these niggas'll squeeze on me\nPleased when seeing guts, I don’t need no enemies\nJust my family, a couple trucks, and my MPC and a mic\nThey empty out on them bike to fight you\nIn front of every reporter that I don't like\nNo need for metaphors to get points across when I write\nThis emotion's enough to say: \"Fuck you bitch and I don't like you!\"\nWHAT! I might as well give this up but that'd be, selfish as fuck\nTo leave D12 in this but we can't self-destruct\nI've never felt it this much, c'mon fellas get up!\nWe gotta fight like Bugz last night of his life, C'MON!\n\n[Verse 4: Kuniva]\nI walk with a limp, pistol hanging off of the hip\nI'm awkward and quick enough and sick when sparking a fifth\nYour carcass is split, even if beef is partially thick\nWe can't take you serious, you a comedy skit\nYou probably wish that you could be out, shooting at G's\nBut the only thing you shoot is the breeze, I can't believe\nYou speaking on moving keys, but every time we hear you kick it\nThe only thing that you selling is woof tickets\nI look wicked 'cause niggas'll test your nutsack\nSo when they bust, you better bust back or get your guts clapped outta your stomach, and when they want it I'll bring\nA hundred niggas from Runyon so get to gunnin' if you coming\n\n[Hook: Eminem]\nCome on then, everybody come on and\nKick your shoes off motherfuckers, come on in\n'Cause we get it on and, 'til the break of dawn and\nWake your ass up motherfuckers, quit yawning\n'Cause we ain't leaving 'til 6 in the morning\nSo have a sing along with the words of the song and\nIf you don't know the words and you can't sing along then\nFake like you know 'em motherfuckers and join in\nEverybody good morning", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}