{"songs": [{"title": "It’s Goin’ Down", "album": null, "year": null, "lyrics": "[Erick Sermon]\nYeah ya don't stop\nIn the motherfuckin house and ya don't stop\nEd Lover's in the motherfuckin house and ya don't stop\nOne-two, one-two\nRepresentin Queens, and ya don't stop\nRepresentin Ed Lover, Dr. Dre one time, one-two\nSo what'cha gon' do?\n\n[Ed Lover - overlapping Erick]\nYeah, hahaha.. it's goin DOWWN!\nE-Double.. ready to kill this shit\nBut I gotta represent, knowhatI'msayin?\nOn some East coast shit, cause niggas don't think that I..\nI got mad skills, check this out\n\n[Erick Sermon]\nRoad call!  E rock the mic for alla y'all\nThe beat technician, real with no science fiction\nI come way from beneath with my shit\nHere's Erick, choppin down the door like Jack Nich' (heyyy)\nThe super duper, Superfly break loose\nI'm deeper than Roots, Skywalk on niggas like I'm Luke\nPunk, I flow rhymes all the time\nGettin mines, get props like Prince or The Sign\nWhatever - I Jumpin Jack Flash on that sorry ass\nReal quick, for niggas that get slick (word 'em up)\nHeyy, if you didn't know I'm Erick Sermon (yeah)\nThe Green Eyed one, you step to me you gettin done\nFlame, number two is ready\nA drunk MC with rice, served, thinkin he was nice\nAlso with my clique, is Ed Lover\nMy entourage other brother\n\nChorus: [Ed Lover] + (Erick Sermon)\n\nIt's goin DOWWWN (one-two, and ya don't stop)\n(One-two, and ya don't quit)\nHell, yeah, it's goin DOWWWN (one-two, and ya don't stop)\n(One-two, and ya don't quit)\nYou ready sucka?  It's goin DOWWWN\n(Ed Lover's in the house, one-two y'all)\n(Ed Lover's in the house, one-two y'all)\nIt's goin DOWWWN (one-two, and ya don't quit)\n(It's part two on the verse gettin down like this)\n\n[Ed Lover]\nCheck this out\nBow to the wow, yippie yo yippie yay\nIt's the Ed Lover with my OWN Dr. Dre\nSpecial shout out, to the D-O-double-G\nThey can't tame ya so they framed ya for a 187 G\nWith a bow wow whoa, let me go, let me know\nLettin ya know I'm still down with my homies down below\nAnd ain't nuttin changed, ain't a damn thing strange\nFirst name is still Ed, my middle name is still James\nBut hold up, wait!  Let me pause for the cause\nI'm bustin all them suckers that be givin up them drawers\nLet them slide up in your back, for a fat contract\nMore Famous than Amos, but your shit is still wack!\nAnd Calvin Klein's, no friend of mine\nI only Karl Kani's, on my behind\nSo when you see me comin nigga gots to break wild\nEd Lover, Ed got love - for the other side\n\nChorus: [Ed Lover] + (Erick Sermon)\n\nHah yeah (it go like this, like that y'all)\n(To the beat to the beat to the beat y'all)\nHere we go - it's goin DOWWWN!\n(One-two it's goin down y'all)\n(One-two, one-two, it's goin down y'all)\nAll you clowns - it's goin DOWWWN!\n(Like this y'all, it's goin way down, way down)\nE-Double - it's goin DOWWWN!\n(Ed Lover, is in the house)\n(Dr. Dre..)\n\n[Keith Murray]\nNow Keith Murray's in a hurry quick fast\nTo get up in that ass with some ol' ill shit, and a paragraph\nAll y'all rappers comin with that happy-dappy\nScared to be nappy shit makes me wanna laugh\nBelieve me you I'll come through with a crew\nThat's sicker than the flu\nYou couldn't even take these niggas to the zoo\nCause when I rap competition perform disappearin acts\nAnd I jam like Smuckers\nMy style is funky like a six-pack of motherfuckers\nMurray emphasizes on rough poetry\nWith formality, with no sympathy\nI'm on the MC killer streak like John Wayne Gacy\nWith the funk, which is essentional with my recipe\nAnd I'm beatin Mother Nature down to her knees\nBy makin more papers than trees, niggas please - it's goin down\n\nChorus: [Ed Lover] + (Erick Sermon)\n\nIt's goin DOWWWN!  (Uhh like this y'all)\n(It's goin down like this like that y'all)\nY'all niggas don't fuck around\nIt's goin DOWWWN!  (Word 'em up like that y'all)\n(It's goin down like this word 'em up)\nHeyyyyy, it's goin DOWWWN!\n(Yeah, it's goin down like this y'all)\n(Like that like this y'all)\nAll the ladies in the 90's y'all, it's goin DOWWWN!\n(It's goin down, it's goin down like this y'all)\nNow this what I want all y'all ladies to say\nSay this right, come over here\n\nSay heyyayyyayyyayyy, Ed Lover\nSay heyyayyyayyyayyy, Erick Sermon\nSay heyyayyyayyyayyy, Redman (come on y'all)\nSay heyyayyyayyyayyy, everybody\nSay heyyayyyayyyayyy, Ed Lover\nSay heyyayyyayyyayyy, Erick Sermon\nSay heyyayyyayyyayyy, Redman\nSay heyyayyyayyyayyy, Dr. Dre\n\nIt's goin DOWWWN!\nThat's how we comin for the nine-fo' y'all\nIt's goin DOWWWN!\nYeah.. it's goin DOWWWN", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}