{"songs": [{"title": "Be Happy (Freestyle)", "album": null, "year": null, "lyrics": "[Intro: Raekwon]\nYeah, yeah, just dropped that Lost Jewelry too, man\nGo get that bag over there, it's right over there\nGood, good, good - go ahead\nGet at it, got get it - you'd better get that\nCool…\nYeah, we good (you know we good)\nYeah, I feel that right there, yeah, yeah, yeah (that's real, right there)\nCome on, Chef - milk this shit, man\nI'm right here, come on, man\nYeah, ladies and gentlemen (ladies and gentlemen)\nWelcome to this…\nThis that real, the real - let's go, man\nAyo, ayo…\n\n[Verse 1: Raekwon]\nLiquor all in his… he ready to fuck somethin'\nUp in the Bentley truck rollin' a blunt, stuntin'\nThe trainers right there is a G\nHad the neck game for free, sweats on, Rolex for me\nI like the sex… cause, give 'em jaw suggestions\nDrunk in a penthouse with drawers on, excellent\nListenin' to Commodores, blue magic, holdin' a new clapper\nI shot the masseuse, who tappin' her?\nA whole lot of character, check out the big man\nJewellery game hardheaded, check it in this land\nI got the seeds with me, plead with me\nDon't wanna catch no bodies, don't dis me, believe in me\nUp in the Ritz high as Hell\nKicks cost twenty-seven hundred, them shits came with bells\nI'm more flash than the president\nSo ether your favorite rapper - he can wear the suit while I black up\nAt last meet the greatest, his clique Canadians\nLook around, yo, and keep debating, huh?\nMoney bags, we rock the certified\nWord from the murder guys who don't fuck around but burglarize\nTax bracket is ill, shout out thankfully\nI've got a fish tank that's spanky, thank for me\nHundred floors up, the doors, it ain't no key\nPut your finger on the angle and blink to me\nYeah, relay, he in concernt, holding' it down, sir\nThat's Wu in the flesh, he a monster\n\n[Verse 2]\nHow can I love somebody else\nIf I can't love myself enough to know?\nWhen it's time, time to let go...\nSing...\n\n[Hook]\nAll I really want is to be happy\nAnd to find a love that's mine\nIt would be so sweet\nAll I really want is to be happy\nAnd to find a love that's mine\nIt would be so sweet\n\n[Verse 3]\nI ask for the sign from the sweet Lord above\nI know the answer is in front of me\nBut when you think you're in love\nYou only see what you wanna see\nAnd all I see is me for you\nAnd you for me\nOh I cannot hide the way I feel inside\n(No I don't know why)\nI don't know why but every day I wanna cry\nIf I give you one more try\nTo there rules, will you abide\nAnd if I mean anything to you\nWould it make everything all right?\n\n[Hook x2]\n\n[Bridge]\nI just wanna be so, so, happy\nBut the answer lies in me\nI do believe that we can be happy\nI said I wanna be happy, yeah, yeah...\n\n[Verse 4]\nLife is too short to be tryin' to play some games\nNow take some time and think about\nIf it's really worth losing me\nWhy must it be this way?\nWhy do you have to play with my mind?\nAll the time...\nHelp me sing it\nAll I really want is for me to be happy\nOh, just help me sing it\nAll I really want is for me to be happy\nYeah...\nAll I really want is for me to be happy\nOh, you know I wanna be happy, yeah, yeah\n\n[Outro]\nI don't wanna have to worry about nothin' no more\nSaid I wanna be, said I wanna be, said I wanna be\nSaid I wanna be, if it's alright with you\nI mean, it'll be alright with me\nWon't you help me sing? Just help me sing, yeah…", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}