{"songs": [{"title": "Old School", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Intro: 2Pac]\nHere we go; we gonna send this one out to the old school\nAll these motherfuckers in the Bronx, and Brooklyn, and Staten Island\nQueens, and all the motherfuckers that laid it down, the foundation\nYa know what I'm saying? Nothing but love for the old school\nThat's who were going do this one for, ya feel me?\n\n[Chorus: Grand Puba]\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\n[Verse 1: 2Pac]\nI remember Mr. Magic, Flash, Grandmaster Caz\nLL, Raising Hell, but, that didn't last\nEric B. & Rakim was, the shit to me\nI flip to see a Doug E. Fresh show, with Ricky D\nAnd Red Alert was puttin in work, with Chuck Chill\nHad my homies on the hill getting ill, when shit was real\nWent out to steal\nRemember Raw, with Daddy Kane?!\nWhen De La Soul was puttin Potholes in the game\nI can't explain how it was, Whodini\nHad me puffin on that buddha gettin buzzed, 'cause there I was\nThem block parties in the projects, and on my block\nYou diggy don't stop, sippin on that Private Stock\nThrough my speaker Queen Latifah, and MC Lyte\nListen to Treach, KRS to get me through the night\nWith T La Rock and Mantronix, to Stetsasonic\nRemember \"Push It\" was the bomb shit, nuttin like the old school\n\n[Chorus: Grand Puba]\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\n[Verse 2: 2Pac]\nI had, Shell Toes, and BVD's\nA killer crease inside my Lee's when I hit the streets\nI'm playing skelly, Ringolevio, or catch a kiss\nBefore the homies in my hood learned to smack a bitch\nI remember. way back, the weak weed they had\nToo many seeds in the trey bag\nI'm on the train headin uptown, freestyling\nWith some wild kids from Bucktown, profiling\n'Cause the hoochies was starin, thinking \"what them niggas wearing?\"\nI'm wondering if that's her hair, I remember\nStickball, humpin hoochies on the wall\nOr taking leaks on the steps, stinking up the hall\nThrough my childhood, wild as a juvenile\nA young nigga tryin to stay away from Rikers Isle\nMe and my homies breakin nights, tryin to keep it true\nOut on the roof sipping 90 proof, ain't nuttin like the old school\n\n[Chorus: Grand Puba]\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\n[Verse 3: 2Pac]\nRemember popping and locking to Kurtis Blow, the name belts\nAnd Scott LaRock the Super Ho back in Latin Quarters\nWhen Slick Rick was spittin La Di Da Di\nGaming the hoochies at the neighborhood block parties\nI remember, breakdancing to Melle Mel\nJekyll and Hyde, LL when he Rocks the Bells\nForget the TV, I'd rather hit the streets and do graffiti\nBe careful don't let the transit cops see me\nIt ain't nothing like the old school!\n\n[Chorus: Grand Puba]\n\"What more could I say? I wouldn't be here today\nIf the old school didn't pave the way\"\n\n[Outro: 2Pac]\nHaha, on the real though\nRemember seeing Brooklyn go crazy up in the motherfucking party?\nRemember motherfuckers used to go, \"Is Brooklyn in the house?\"\nAnd motherfuckers would lose they God Damn Mind!\nThat's the old school to me; that's what I'm sayin (Super, Sperm)\nI remember goin places that motherfuckers was scared to say\nThey was from anywhere but Brooklyn; that shit was the bomb\nBack in the motherfucking old school nigga\nRemember skelly nigga? Knocking niggas out the box, popping boxes?\nRemember stickball? Member niggas to run that shit like that?\nRemember the block-- 'Member screaming up at your moms from the window?\n(LL Cool J is hard as Hell...)\nThe ice cream truck, remember all the mother--\n'Member the Italian Ices, yo? Yo, remember the Italian Ices?!\nThe Spanish Niggas comin' down with the coconut ices and shit?\nI came through the door, said it before\nThat was the shit!", "image": "https://images.genius.com/aa900ef68a5861f06835ba38e4e6d764.640x640x1.jpg"}], "artist": "2Pac"}