{"songs": [{"title": "Man on the Moon", "album": "A Kid Named Cudi", "year": "2008-07-17", "lyrics": "[Intro]\nAlright, run it\nI never gave a fuck\nI never gave a fuck about what niggas thought about me\nI mean, I did, but like, fuck it, you know what I'm saying?\nYou gon' love me, man\nYou gon' love me, man\n\n[Verse 1]\nThey can't comprehend\nOr even come close to understanding him\nI guess if I was boring they would love me more\nGuess if I was simple in the mind, everything would be fine\nMaybe if I was a jerk to girls\nInstead of being nice and speaking kind words\nThen maybe it would be OK to say then\nI wasn't a good guy to begin with\n\n[Pre-Chorus 1]\nBut my mind is all crazy, crazy, crazy, crazy\nThey got me thinking I ain't human\nLike I came in from above, above, above, above\nFeeling like an airplane in the sky\nBut then they say I'm crazy, crazy, crazy, crazy\nThey got me thinking I ain't human\nLike I came in from above, above, above, above\nFeeling like a bird sitting high, high\n\n[Chorus]\nI be that man on the moon, I'm that man on the moon\nAnd I'mma do what I do, so do you, hey-hey\nI be posted with my blunt and a brew, my dude\nI'm that man on the moon, I'm up-up on the moon\n\n[Interlude]\nIt's like, I'mma play all my stuff for everybody\nAnd you know, and all my people they give me feedback\nYou know, and they'll be like\"Yo, yo, why your shit sound so different?\"\nYou know what I'm saying?\n\"Why your shit, like on another level--\nWhy's, why's it sound so different?\"\nLike that's a bad thing\nAnd I be like\n\"Why not? Nigga\"\n\n[Verse 2]\nClose my eyes, hide in the dark\nIt's a curtain call; come one, come all\nAll I do is try to make it simple\nThe ones that make it complicated\nNever get congratulated\nI'm something different, all aspects\nDon't want a woman just to love her assets\nI'll still wife her up, even with her flat chest\nThe type to get hurt, but that's the past tense\n\n[Pre-Chorus 2]\nMy mind is all hazy, hazy, hazy, hazy\nI be thinkin' that I'm wrong\n'Cause they used to call me lame, lame, lame, lame\nMy swag was a little different\nBut then my mind is hazy, hazy, hazy, hazy\nI be thinkin' that I'm wrong\nBut they the ones who lame, lame, lame, lame\nI got the last laugh, nigga\n\n[Chorus]\nI be that man on the moon, I'm that man on the moon\nAnd I'mma do what I do, so do you, hey-hey\nI be posted with my blunt and a brew, my dude\nI'm that man on the moon, I'm up-up on the moon", "image": "https://images.genius.com/4fb504d5b4dda8a236c224bb1cc11e2a.800x800x1.jpg"}], "artist": "Kid Cudi"}