{"songs": [{"title": "Amazing", "album": "Renzel Remixes", "year": null, "lyrics": "[Intro]\nRegardless of how it goes down, life goes on, am I right?\nAm I right? Am I right?\nJust the way I've conditioned my mindset\nFor me to stand position well, I can survive\n\n[Verse 1]\nLiving a life of crime is nothing you should glamorize\nWhen seeing your mother smile you had to fantasize\nBut now it's jellyfish in all the fish tanks\nSo rich, think what's on a nigga wrist fake\nAin't Jewish, thank jewelers for Frank Muellers\nTenth grade,  Mac 11s, they ain't schoolers\nTaught us to think foolish, degrade women\nCall all the bitches hoes, still amazed with them\nCorner educated, codeine medicated\nEvery night we celebrated cause we elevated\nI am Michael Tyson, Robin Givens in the wind\nShe knocking at the door, don't let that devil in\nOrdered her room service, caviar and cannabis\nShe ordered the nose candy with the candles lit\nAm laid back, status of a Corleone\nScreaming Maybach with my Yellow Rollie on\n\n[Chorus]\nAll my watches designer, all my women designer\nSimple gifts from the Gods, I pray you all pray for survival\nSmiling in your face, Mac 11 on his waist\nMake or break your day better, say your amazing grace\nNow you beefing with motherfuckers you never heard of\nIt's just another hurdle, they wanna see you murdered\nOr back to flippin' burgers, better bust your burners\nSay my amazing grace, before they reach they a verdict\n\n[Verse 2]\nHey hells kitchen burning me a bell pepper\nMinus the lady, P.I. 80 cuz it smells better\nSay my amazing grace, she says it's just a phase\nUnless it's sustained, am not in this for fame\nMinus the hoe shit, the most 'emo-shit'\nVersace, Neils, 60 mils selling blow shit\nCoudn't make a layer, labelled a brick layer\nPull up at the park in the six, player\nSix speed all the fares they can follow\nAm at the Delano, ﻿where my model mulatto\nTurn the strip club into an arcade\nFor a coin you could play dem broads, broad day\nGet them junkies blowing before I master Donkey Kong\nShit was funny till I started bringing money home\nStill think it's a game, aim at your high score\nCall it a rap beef, bitch I'm down to die for it\n\n[Chorus] [x2]\n\n[Outro]\nAll my watches designer\nAll my women designer\nThey wanna see you murdered\nBetter bust your burner\nThat's all I know, got a feeling\n100 million up, that's the realest\n(Maybach Music)", "image": "https://images.genius.com/26f2cdfc9fdcb22135f837c8ea35c566.1000x1000x1.jpg"}], "artist": "Rick Ross"}