{"songs": [{"title": "Pion [freestyle]", "album": null, "year": null, "lyrics": "Turn me up on the beat, yuhhh!\nNigga! nnnyeah\nAs this journey begins\nThe battle commences\n\nMotherfucka' what? do you really want\nMy flow is off the cusp\nMotherfuckas try to play me like what\nI am super duper motherfucka get it uhhh hands pleaseee\nUhm takin too long on the blunt I'm like yoooo\nPuff puff pass with your bitch ass\nNa salute to the masses\nIm a champ raise ya glasses\nNigga look at me, fix ya face\nKid cudi back nigga servin up a taste of the mashhhhh- potatoe flow\nNigga betta get with me for sho\nDouble o nigga from the go\nAll Midwest niggas ride slab, let the doors go\nAnd we dont give a fuck about the pigs\nMy niggas round here\nMy niggas do it big Ya Diggggg!\nYah! yeahnnn\n\nYou a peon, nigga you a peon\nI stomp on your world, I stomp on your world\nYou a peon, peon\nI'm in the touchdown in zone nigga doing the Deion\nYeah! you a peon, you a peon\nI stomp on your world in the touchdown, nigga do the Deion\nNigga you a peon, nigga you a peon. I'm in the in zone doin the Deion\nWhat the shit is he on?!\n\nWhat the fuck is that Nigga on! I bring em the..erriooo-o\nI got these niggas like a uh oh them niggas betta..oo-o uh oh I got these hoes cheerio-o\nThey flippin with the gogo- they know im gadget\nMy flow is mac-test my slip is all-rip\nI got these motherfuckers tryna play me awhhh shit\n\nBut I be that nigga that rip it any way that he wanna and sometimes he be tryna sing on a bitch!!\nBelieve it im possessed\nI dont even know who this soul is\nBut it dont matter my past life- on the moon\nGot my earth life so doomed\nWhile I consume mad blunts and drink mad henny\nTalkin bout the bitches that I wanna fuck plenty\nAsk bout that im gone get my money spend every penny till im bankrump MC Hammer\nTill I got bad bitches in my room I hammer\nMan im hammered\nSlithered off the budlight\nAnd I sip right when I get right I smoke and I puff good\nTell me what you know about G.O.O.D\nYou never seen a nigga this good besides music\nThe flow stay the truest\nY'all niggas spittin truancy til you heard of me kid cudder\nThe biggy biggy boss from the double o CL\nI move and ima..what you know about..git git!\nMe and my niggas get lit\nMe and chip tha rip, ask 'bout me!\nMy niggas get pissy\nSip cris think about my nigga lil chris\nAnd pour out liquor for my nigga chris\nCuz we gon do this shit we gettin rich!\n\nLet me hear that back...", "image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg"}], "artist": "Kid Cudi"}