{"songs": [{"title": "Tim Westwood Freestyle", "album": null, "year": "2014-03-01", "lyrics": "[Verse 1: Game]\nGame don’t freestyle\nGame don’t write\nGame don’t talk about niggas it’s on site\nGame don’t ride in cars, he ride bikes\nGame don’t buy dem J’s, he calls Mike\nGame don’t fly commercial, he fly private\nGame ain’t on Tim Westwood, he on my shit\nGame came in the game with Ross & Jeezy\nGame don’t stand in line, he call Yeezy\nYeezy don’t pick up, Game don't press redial\nGame know Khloe & Kim, they on speed dial\nGame don’t wear no tux at big dinners\nGame hit the Micky D’s with Kris Jenner\nGame ain’t makin’ amends with 50 Cent\nGame still tryin’ to find out where 50 went\nGame ain't the type of nigga to fuck with your favorite rapper on IG making them duck lips\nGame ain't at home, boy, Game in the UK\nFreestylin' off the top, he like a toupée\nGame got all the answers, I'm like two Ye’s\nI'm an MCM, I'm fucking on Tuesday\nGame don't do the Women Crush Wednesday\nIf I said I was, I was lyin' like Penn State\nI'm the type of Game you don't play, no Monopoly boards, no NBA\nNo Xbox, nigga no PS4, I bring the games to life, COD at your door\nSuge on Arsenio talkin’ about Game & Kendrick\nMy contract fucked up? How am I in this Bentley?\nHow am I in this Lambo? How am I in this Rolls?\nBlood Money poppin’ where the fuck is Death Row?\nDon’t mention Kendrick, let’s talk about what you got\nCause the big homie is exactly what you not\nWord to Big U, word to Big Wack\nGame came out niggas' mouths, then you heard the BBRRRAAAA\nMy niggas pull out guns, bitches starts crawlin’\nAfter the shots, like Julie back to ballin’\nAll y’all must have forgot what Game do\nGame don’t fall off nigga, he ain’t you\nNow hold up a second, don't brandish a weapon\nI got one in London, put holes in your brethren\nMy niggas is trippin', we all in your section\nLet one get away and them hollows'll catch him\nThen I PJ to Spain just to get a neckless\nSippin’ on syrup, like I play for the Texans\nThey talk about drugs and they know I’m connected\nYou can’t do shit with the boy, he protected\nBy la familia, 1 shot we killin’ ya\nBlood money in London, 'bout to stack a milli up\nLa familia, 1 shot we killin’ ya\nBlood money in Great Britain, 'bout to stack a milli up\nGrowing my beard out, lets bring philly up, Meek my nigga\nDon’t even bring Gillie up\nCause every time you do, we stack a milli up\nLike the new ROC go dig a milli up, boy", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}