{"songs": [{"title": "It Takes A Thief", "album": "It Takes A Thief", "year": null, "lyrics": "One dark night I need some ends\nI got a spot cased out I'm breakin' in\nI gotta cutter that'll cut thru ya window like butter\nSuction cup, window up\nNow I'm on the inside lookin' for some loot\n38 special I don't wanna have to shoot\nI ain't no young, raw fresh recruit, uhh\nSteel toed boots, black khaki suit\nA real quick search and nobody's home\nJust like I planned, now I'm home alone\nI hope ya don't mind if I use tha phone\nAnd fix me sometin' to eat before I'm gone\nI got the silver and the china, deuce-five and the 9\nRolex off the desk so I can tell the time\nNo one knows where the flow goes when the 'dults crow\nYou better take some No Doz\nNow I'm out tha back with a sack fulla goods\nThrow it in the truck, take it back to the hood\nLet me be brief, I'm on the creep\nI stole the sounds out'cha jeep, it takes a thief\n\n[Chorus]\nOh yeah! It takes a thief\nYeah yeah! It takes a thief\nIt takes a motherfuckin' thief! It takes a thief\nKeep both eyes open when you go to sleep\nOh yeah! It takes a thief\nYeah, yeah! It takes a thief\nIt takes a motherfuckin' thief! It takes a thief\nKeep ya hand on your gun when I'm on the creep\n\nI need a lick real quick-like\nMy mind ain't wrapped tight\nI scale like Mike Tys so call this fright night\nYou don't wanna see me comin down the street when I'm broke and it's dark\nSo run your motherfuckin' pockets 'fore they find your ass dead in the park\nPut your hands behind your head and interlock your fingers\nNo I ain't the cops, I just want your rings\nAnd your wallet and your watch and your fat gold chain\nDon't try nuttin' strange or I'm blowin' out'cha brains\nI rob from the rich so I can get rich\nI ain't got shit so I take what I can get\nI need my mail, my snaps, my dollars, my ends\nMy grip ain't high enough so I'm robbin on my friends\nSomebody out there's out to get me\nThe smaller the nigga, the bigger the gat be\nI don't give a fuck about your pain and your grief\nYou shouldn't of fell asleep, it takes a thief\n\nChorus x 1/2\n\nThere's a buster on the West Side, I heard he gotta grip\nAnd he's outta town on business so I'm schemin' on his shit\nI heard he got kis and Gs and deeds\nAnd guns and big trash bags full o' weed\nI stole a brand new fresh ass telephone van\nSo now I guess I'm the telephone man\nThe bathroom window ain't got no alarm\nI gotta skeleton brick that works like a charm\nIt didn't take long to find what I was lookin' for\nI was damned near finished when I heard a key in the door\nI jumped in the closet and checked my clip\nPulled my ski mask down, I can't believe this shit\nI counted to five and the front door opened up\nI counted three more and the front door was shut\nI counted five more to give me some space\nThen I jumped out the closet and bucked him in the face\nI loaded up the van in broad daylight\n'Cause Looky Lou's have their high beams on at night\nI take the backstreets to avoid the heat\nAnd never let em see me sweat, it takes a thief\n\n[Chorus]\n\n[Outro]\nOh yeah!\nYeah yeah!\nHey yeah!\nJust a reminder to let you know\nThere's motherfuckers out there that want your shit\nSo you better watch out, better watch your back\nCan't be goin to sleep, protect your shit\nKnow what I'm sayin?", "image": "https://images.genius.com/681f5b81de576ad7ba17ac999a7e7e8a.1000x1000x1.jpg"}], "artist": "Coolio"}