{"songs": [{"title": "Uber", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro: Mac Miller]\nWho put the spiders in my applesauce?\nTook the pins out my hand grenade?\nSomebody said that I deserve to die\nI looked him in the eye and said the devil's not circumcised\nWho put spiders in my applesauce?\nTook the pins out my hand grenade?\nSomebody told that I deserve to die\nI looked him in the eye and said the devil not circumcised\n\n[Verse 1: Mac Miller]\nSo play me a song on the guitar\nGot a rainforest in my cigar\nThere's knots in my yo-yo string\nPut a crown on my stallion, I'm the Polo king\nI fell in love with a go-go dancer, she's a single mom\nThe underdog, I like to play the game with Diddy Kong\nShe the god type, throw that bitch a Klondike\nEverything is alright, see it's written in the Psalms\nI told her I get rich off my little songs\nGave her a billion reasons that she should come along\nImmediately, she dropped her shit\nBut everywhere I go, they tell me \"Watch your bitch!\"\nGod damn! I guess I got another one\nGood vibrations, Marky Mark and the Funky Bunch\nI put the gourmet flavors inside the honey blunt\nGot my head underwater but I ain't comin' up\nFuck air, my bitch's ass is like a plump pear\nAnd she ain't pretty or ugly, I say she's just fair\nMan this life is unfair\n\n[Hook: Mac Miller]\nOkay I'm parkin' lot pimpin', I got nothin' to lose\nAnd I'ma do this 'til I'm a hundred and two\nWhy you tryna stunt when we stuntin' on you?\nI said I'm parkin' lot pimpin', I got nothin' to do\nAnd I'ma do this 'til I'm a hundred and two\nWhy you tryna stunt when we stuntin' on you?\n\n[Verse 2: Mac Miller]\nI'm readin' old Playboy magazines\nSomethin' from the 50's when the journalism had its peak\nYou play the background, you just a member of the faculty\nI'm actually out here decision makin'\nHad to get my shit together, I was missin' payments\nI just pray to God that my lady isn't famous\nShe threw the gown on and we hit the banquet\nShe got her own story; just let the bitch explain it:\n\n[Verse 3: Mike Jones]\nMac, I think the girl that you speakin' 'bout\nWas, in fact, the same chick, late night, creepin' out\nSneakin' out, my homie knew it, told me keep an eye\nFound out she was twerkin', found out she wasn't workin'\nThe whole game switched when my man hit\nGot me rollin' in a circle, top-down, blowin' purple\nSeen the parkin' lot, I'm 'bout to crawl up like a turtle\nSeen the parkin' lot, I'm 'bout to crawl up like a turtle\nSwang, switchin' lane to lane, still tippin'\nTrunk up, top down, call it parkin' lot pimpin' (Mike Jones)\nSwitchin' lane to lane, still tippin'\nTrunk up, top down, call it parkin' lot pimpin'\n\n[Hook: Mac Miller]\nOkay I'm parkin' lot pimpin', I got nothin' to lose\nAnd I'ma do this 'til I'm a hundred and two\nWhy you tryna stunt when we stuntin' on you?\nI said I'm parkin' lot pimpin', I got nothin' to do\nAnd I'ma do this 'til I'm a hundred and two\nWhy you tryna stunt when we stuntin' on you?", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}