{"songs": [{"title": "Murder", "album": "Sunday Service", "year": "2012-12-13", "lyrics": "[Verse 1: Game]\nStarin’ at Marilyn Monroe’s silhouette\nWhile smokin’ my first cigarette\nListenin’ to Marvin ask his father about his death\nHow you shoot a nigga out, then shoot a nigga out?\nDead bodies in my dreams, Bob Marley on my couch\nPass me the blunt, he was smokin’ when he died\nYou really think Elvis Presley committed suicide?\nI don’t, it’s either kill or you be killed\nTen pints of blood per human, ain’t no refills\nOne thing about us humans, nigga, we kill\nTurkeys, chickens, pigs, each other, fuck us, we will\nTake a life, lethal injection or free will\nTookie got murdered by the pigs, fuck did he kill?\nThat ain’t none of my business, though\nBut I’m the type of motherfucker make it his business, so\nOpen the book and turn that page\nIt reads Arthur Ashe died from AIDS, no\nThat’s murder, nigga\n\n[Hook: Kendrick Lamar]\nMurder\nGunfire, death is so quiet, ask why, tell ‘em it’s\nMurder\nThe sun rise then hide by grey skies, that cry sounds like\nMurder\nMurder, murder, murder, murder\nMurder, murder, murder, murder\n\n[Verse 2: Game]\nMalcolm X standing on that stage\nIt was staged for him to see that gauge\nMurder, nigga\nDoctor King outside that room\nWho knew that he would die that soon?\nThat’s murder, nigga\nJFK sittin’ in that drop\nHe waved goodbye, then they blew off his top\nIt’s murder, nigga\nDiddy seen Big, and Suge watched Pac\nThey both was ridin’ passenger when they got shot, it’s murder\nWho the fuck killed Michael Jackson, his physician?\nHe died slow in his music, you ain’t really listen\nNow his daughter gettin’ slapped by his sister\nAnd that’s probably gon’ kill they mama\nSo I’m sorry Ms. Jackson, I’m sorry Ms. Houston, sissy\nMight shed a tear but ain’t no sissy\n‘Cause Whitney’s sill with me\nAnd her death kinda hurt a nigga\nSo let’s get back to talkin’ ‘bout murder, nigga\nJohn Lennon got shot in the back\nAnd Paul McCartney couldn’t do shit ‘bout that\n‘Cause it was murder, nigga\nListen, this ain’t about you and me\nIt’s about Trayvon Martin and Huey P\nAnd how they shot down Sam Cooke\nTwelve years of school and it ain’t in one damn book\nLee Harvey Oswald ‘bout to serve a sentence\nFrom the crowd comes a revolver\nThat’s murder, nigga\n\n[Hook]\n\n[Verse 3: Scarface]\nGaspin’ for air, niggas cling on\nTryin’ to fight the inevitable, sing on\nYou hear that fat lady warmin’ up?\nThe end came without a warning, huh?\nThem niggas real with them rags on\nNiggas get killed ‘bout them flags, homes\nThe Game told you what the play was\nSo it don’t matter what you say, cuz\nSay Blood, these niggas livin’ what they die by\nYou out here playin’ while these niggas doin’ drive-bys\nIf murder was the case that they gave Snoop\nThen how the fuck you thinking they gon’ save you?\nThem niggas played you, you doin’ stand up\nYou a comedian there, boy, put your hands up\nDon’t turn this to a 1-8-7\nI have you leanin’ on the stairway to Heaven\nSpittin’ blood, these are tales from the hood\nSuicide sound quicker, but a murder sounds good\nWish a motherfucker would try to play me like a toy\nYou get a bullet in your motherfuckin’ head, homeboy\nThe people sayin’ that a drug overdose killed Hendrix\nThey bullshitted, it was murder\nOr a plane crash killed Otis Redding\nThat’s how they said it, but it was murder\nThe cops kill us at alarming rates\nThey point they guns at the ones they hate (niggas)\nIf Bin Laden brought the World Trade down\nThen how the fuck did he die just now?\nMurder, murder (Murder, murder, kill, kill)\n(They killin’ motherfuckers still)\n(And I’m just tellin’ y’all the real)\n(Nigga, murder, murder, murder\n(Nigga, kill, kill, kill, for real)\n\n[Hook]", "image": "https://images.genius.com/2377b35c4be48c418d9b99b8e5eb85a2.500x500x1.jpg"}], "artist": "The Game"}