{"songs": [{"title": "Statement on Kanye West Visiting Trump at the White House", "album": null, "year": "2018-10-11", "lyrics": "Now I’ve been extremely patient and made it a point to not jump to any premature conclusions about Ye’ & his antics... Partially due to the lessons learned from the outcome of other similar situations dealing wit my brother Wayne (which I admittedly mishandled a bit in hindsight) But now this shit is next level,futuristic Sambo,Hopping Bob, Stephen off Django ass shit Ye!!!!\n\nFrom what I can gather... This is the most repulsive,disgraceful,\nEmbarrassing act of desperation & auctioning off of one’s soul to gain power I’ve ever seen. Now I recall you asking me to come with you to have this meeting and I declined (naturally)... but bro... if ain’time I would’ve been in there wit you and you behaved that spinelessly in my presence,I feel that I’d be compelled to slap de’Fuq outta you bro For the People!!! You ass kissing and boot licking on a whole new level &I refuse to associate myself with something so vile,weak,& inconsiderate to the effect this has on the greater good of ALL OUR PEOPLE!!!! I’m a true believer in “It ain’t what you do,it’s how you do it.” And this shit is regurgitating🤮! At one time it was a pleasure to work alongside you... now, I’m ashamed to have ever been associated with you.\n\nTo all the people who follow Ye musically,socially, or even personally....who are confused, heartbroken, infuriated.... Let me make this clear... THIS SHIT AINT COOL!!! THIS IS A MOVE YE MADE FOR YE!!! THIS IS A PLAY TO PUT HIM IN A POSITION HE’D LIKE TO SEE HIMSELF IN...WE ARE NOT ON HIS MIND AS HE MAKES THESE COMMENTS AND DECISIONS. Don’t follow this puppet. Because as long as I’ve lived I’ve learned that it benefits a man nothing at all to gain the world,if to do so he must lose his soul. We just saw Mr.West’s Soul on auction. If you listen closely you can hear the tears of our ancestors hit the floor. All I can say is... I’ve reached my limits. This is my stop,I’m officially DONE!!!! 🖕🏽Trump & His Lil Cookie Boy. #USorELSE✊🏽", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}