{"songs": [{"title": "Phat People", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Verse 1: Billy Scafuri]\nOne, two, three, check it out\nOn the road to sandwiches and chicken wings\nFat people do phat things\nUsing salt and pepper for their seasonings\nFat people do phat things\nCheck it out\nIt's B to the I to the double L-Y\nMy friends all know I'm not an ordinary guy\nI like little things, like chicken wings\nBBQ sauce, honey mustard, onion rings\nAnd when my cell phone rings it goes jingle-jing\nI say hello, I say hello, I say who this be?\nThey say it's Fancy Ned, I got a fancy head\nI'll eat a fancy ass sandwich on some fancy ass bread\n\n[Verse 2: Childish Gambino]\nThe wait is over, shut up, bend over\nI hang with monsters, I chill with Grover\nThe boy Ebola, my boy fat too\nAnd my girl so fat that they call her Oprah\nI got that green like a bowl of okra\nLoose change so fat can't fit my sofa\nI head to the bank, call the shit my grocer\nIt's Sex in the City, get the fat mimosa\nMe and B, we fat boys, hang with fat girls\nDriving fat toys, fuck Dan Aykroyd\nI'm live on a Saturday night\nI got two fat girls, I'm doing it right\nLike my name John Goodman\nI got the fat crib so I'm doing real good, man\nAnd I'm up to no good, man\nThis is how I get fat, call the shit cooking\n\n[Chorus: Childish Gambino]\nFat people do fat things\nFat people do fat things\nFat people do fat things\nFat people do fat things\n\n[Verse 3: Billy Scafuri]\nI tip waitresses, I tip scales\nMy style is kind of fat like an Orca whale\nI'm sipping whole milk as I stare\nThinking I can be your Oprah, you can be my Gayle\nCause I am a fat boy, never been to Bally's\nMarried to this fat life, call me Kirstie Alley\nMarried to the snack life, counting every calorie\nMight just open up a fat boy art gallery\n\n[Verse 4: Childish Gambino & Billy Scafuri]\nWhat else you do, B?\nI'll make it easy\nWhat else you do, B?\nFor girls to squeeze me\nI'm phat but my numbers run\nListen, son, I'mma show them how it's done\nWhen my swagger weighs a ton\nStickin' straws inside of girls, you can call me the Capri Sun\n\n[Verse 5: Childish Gambino]\nI make the girls drip, so I guess I eat Gushers\nScreaming out yeah like I'm eating out Usher\nIn your dad's bedroom where I fuck you\nKnockin' on the door, so you're screaming out \"nothing\"\nBut they all know it's something\nYou didn't think I'd tear the pussy up, did you pumpkin?\nBut better and better like Benjamin Button\n\n[Verse 6: Billy Scafuri & Childish Gambino]\nI hang out with Chester Cheeto\nCooler than the ranch on your Dorito\nHotter than the peppers in your burrito\nGetting cheddar and cream, if you know what I mean\nYeah, I know what you mean, homegirl mistaken\nShe think Gambino won't bring home bacon\nOr bring home Swiss cheese, my dough got holes\nCause all these hoes want shoes and nice clothes\nThey want the Macy's, the Neiman Marcus\nThe Fendi purses, the Gucci parkas\nI know you want it, don't get me started\nThey see Gambino and they act retarded\n\n[Chorus: Childish Gambino]\nFat people do fat things\nFat people do fat things\nFat people do fat things\nFat people do fat things\n\n[Outro: Billy Scafuri]\nEat snacks, mother fucker, eat snacks\nEat snacks, mother fucker, eat snacks\nEat snacks coming out of packs\nGuaranteed to put a little fat on your back\nEat snacks", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}