{"songs": [{"title": "See No Evil", "album": "Jesus Piece", "year": "2012-12-11", "lyrics": "[Verse 1: The Game]\nI don't read the XXL\nTote a .45 at the church, think I'm destined for hell, oh well\nBlood tears off the face of my Jesus Piece\nIt's bloodshed, feel the cracks in my city streets\nI'm from the crack of them city streets\nUsed to sell crack in them city streets, born in Blood, nigga\nIn a coma five days, life of a thug nigga\nMomma ain't show, grandma almost pulled the plug nigga\nUsed to pull the gun out, just because of cuz niggas\nFive shots to the head 'cause I'm a Blood nigga\nNuttin' brewing but suwoo'ing where the fuck I'm from\nYou lucky if you make it out of Compton, ask Andre Young\nSmell the scent of dead bodies ridin' down Green Leaf\nNo peace so don't get caught up with no piece\nFuck Fatburger, we cooking that real beef\nMommas mourning they sons, I'm talking real grief\nReal funerals of them lost Juveniles\nTrying to be generals, be missing your dinner now, huh\nSay its a blessing when you die in ya sleep\n'Cause the coroner don't need no sheets, capisce?\nI'm sayin', stop playing, wrap him up in what he lay in\nFold a nigga arms, now a casket what he pray in\nCompton streets raised me\nCan't tell my grandma nothing 'bout her baby, you crazy\n\n[Chorus: Tank]\nI said she see no evil, she don't hear nothing at all\nYou want to see tomorrow, you promise not to talk\nSay we on our way now, I'ma see you again\nAnd when they ask you questions, you just answer\nWhat happened then? What happened then?\n\n[Verse 2: Kendrick Lamar]\nI live this life at a pace that anyone can go\nKnow your place and dedicate your role, to the faith that you'll die alone\nTrace your steps when I do step in a fire of broken bones\nAnd I require my heart's desire and when I reap what I sew\nI bought my momma a Benz, my boobie a Jag\nA car for my dogs, with a roof full of glass\nBut still I be feeling like none of my light never casts\nOut of that black cloud that's been watered down since my first chopper blast\nBut fuck that, I'm not worried, even when it's scary\nSkrrt off makin' them hurt off I should have hurt them in a hurry\nDirt off all under my fingers, dirt all of 'em gon is gone is burried\nShirt off when precedure, resuscitation came early\nI need you to keep quiet as a mouse\nWhich is ironic 'cause rats is what I'm talking about\nI'm hearin the sonics of gun fire\nThe whispers, the silent cries\nEven though I know it's an eye for an eye\n\n[Chorus: Tank]\nI said she see no evil, she don't hear nothing at all\nYou want to see tomorrow, you promise not to talk\nSay we on our way now, I'mma see you again\nAnd when they ask you questions, you just answer\nWhat happened then? What happened then?\n\n[Bridge: Tank]\nI was born a soldier, ride or die for mine\nTattooed tears and a lawyer, tried to give me life\nHeaven can you hear me? 'Cause I know that hell can\nSo heaven can you heal me? I'm only just a man, oh\n\n[Verse 3: The Game]\nYou want to go to Compton? Nigga I'll take you there\nHub City bodies get burnt butt-naked here\nRespect the code, a nigga's calling from the pen\nColombian neck-ties on the outside from within\nAnd then, your momma never see you again\nCasket to never wake up plastered in MAC make-up, huh\nNiggas can’t hear you talking from the sky\nAnd only five year olds see your ghost when you die, no lie\nKarma catches up to all you head honchos\n2 dome shots in that head, Griselda Blanco\nShit get real though inside the Foxhills though\nNigga living that fast life and get killed slow\nAsk Wack and Draws if a nigga run the streets\nMy grandmother’s prayers saved you niggas I never wanted peace\nLos Angeles, I’m the motherfucking King here\nNo first 48 'cause muh'fuckers don’t sing here, huh\n\n[Chorus: Tank]\nI said she see no evil, she don't hear nothing at all\nYou want to see tomorrow, you promise not to talk\nSay we on our way now, I'ma see you again\nAnd when they ask you questions, you just answer\nWhat happened then? What happened then?", "image": "https://images.genius.com/dd068b5a01b261090f4744693ea09c67.1000x1000x1.jpg"}], "artist": "The Game"}