{"songs": [{"title": "Jack the Ripper", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "[Verse 1]\nMilky, and I'm back\nMy ace in the hole was this brand new track\nI'mma slow it up and speed it up and now you're gonna eat it up\nListen to the funky beat, my tongue is gonna beat it up\nI did it, but the devil didn't make me\nI did it for the suckers who tried to shake and bake me\nProving a point that I'm a serious joint\nYou can roll me up and puff me, and then I'll anoint\nYour head with oil--lots of oil\nMake it run like water, watch it boil\nCause I made 'em play it, made 'em say it\nMade 'em okay it, made 'em obey it---HUH\nPrince of the growl is on the prowl\nHow You Like Me Now punk? You living foul\nHere's what my game is, kill is what my aim is\nA washed up rapper needs a wash up, my name is--\n\n[Chorus]\nJack the Ripper\nJack-Jack-Jack the Ripper\nJack-Jack, Jack-Jack, Jack-Jack, Jack the Ripper\n(King Hercules!)\n\n[Verse 2]\nBack for the payback, I must say that\nI heard your new jam, I don't play that\nIt ain't loud enough punk, it ain't hitting\nThis year you tried, next year you're quitting\nLast year you thought I was dying out\nBut again, and again, and again without a doubt\nIt's the gangster boogie, the earthquake sound\nPump it up and play it so they hear it all around\nI do it up rough, tough, I don't bluff\nAnd this is an example of funky stuff\nWhen you wanna make hits, you make 'em like this\nThey ain't like this they don't hit, they miss\nIt's a strong record, a record for the strong\nFor those who appreciate real rap songs\nListen how I won't allow myself to go off track\nStay back, I got the power, I'm--\n\n[Chorus]\nJack the Ripper\nJack-Jack-Jack the Ripper\nJack-Jack, Jack-Jack, Jack-Jack, Jack the Ripper\n(King Hercules!)\n\n[Verse 3]\nJack the Ripper, a man, not a myth\nA-k-a James Todd Smith\nHard like penitentiary steel\nBreaking necks while I flex my sex appeal\nHomegirls in the house, c'mon\nHomegirls in the house, give it up\nYou gotta want to get hotter\nMoving and grooving, and always improving a lot'a\nPeople don't know how nice I am\nHe was sleeping, so now I gotta slice my man\nLike ham in a pan, wrap him up in Saran\nKidnap him and slap him up inside of a van\nWhile you're doing your dance I want you to make moves\nNo one out there thought you could do\nYou know my name and my game and what I'm here to do\nParty people, lemme see if you can dance to--\n\n[Chorus]\nJack the Ripper\nJack-Jack-Jack the Ripper\nJack-Jack, Jack-Jack, Jack-Jack, Jack the Ripper\n(King Hercules!)\n\nBreak it down! x3\nYo Bob, show that old school sucker punk what real hip hop is boy\n[Scratches]\n\n[Verse 4]\n\"How Ya Like Me Now?\" I'm getting busier\nI'm double platinum, I'm watching you get dizzier\nCheck out the way I say my, display my fame, my\n'J' on the back, behind the Cool, without the A-Y\nI love to ride the groove because the groove is smooth\nIt makes me move and I'll improve\nAs it goes on, as it flows on\nWhen you see me, don't ask if the show's on\nHow that sound? Don't came around, playing me close, brown\nPull on my jock to be down\nYou need to stay down, way down, because you're low down\nDo that dance, the prince of rap is gonna throw down\nAiming to please while I'm killing emcees\nI'm gonna keep on hitting you with rough LPs\nDay after day after day\nYou're smacked in the face by the bass of Cool J\nI'm--[scratches]\n\n\"Jack the Ripper!\" \"The baddest around!\"\n\n[Verse 5]\nI'm a beast on the microphone, a night stalker\nA killing machine, a savage street talker\nJason with an axe, but I put it on wax\nTo eradicate the suckers who thought I had relaxed\nThe prince of hip hop, straight from Queens\nKicking it mean, keeping it clean\nAnd you've never seen anybody rock the party\nAll you funky beat-aholics, this beat's Bacardi\nI go to the show, and terrorize emcees, don't you know\nMoving my hand like I'm playing the piano\nDon't touch the dial, don't change the channel\nDon't let me hear you say I ain't debonair\nI'm better than any emcee out there\nAs a matter of fact, suckers can't compare\nWhen I'm rocking the mic people stop and stare, at..", "image": "https://images.genius.com/1ea2683f135bb5eb6eec7135479754d3.600x594x1.jpg"}], "artist": "LL Cool J"}