{"songs": [{"title": "Tru Dudes", "album": "Sick Boi", "year": "2008-06-05", "lyrics": "[Verse 1]\nIs it really that bad that my clothes is tight?\nThat I hydrate babes like Pedialyte\nThat I stay rock hard like a meteorite\nThought your homeboy here was an idiot right?\nWell, ya thought wrong, I got flavor\nI rock shows with the blue lightsaber\nI hit dimes but also date eighters\nI make moves, blow up like Al-Qaeda\nI'm in kicks that you can't buy yet\nYa kicks okay like your name Wyatt\nCare Bear Clockers, pink highlighters\nHaters wanna snatch my heat like firefighters\nBoys out there think they just like me\nNaw naw, y'all funny, y'all from UCB?\nY'all standin' in line, I'm in VIP\nY'all know shit 'bout me like TIP, hah!\n\n[Hook]\nOoh, bum bumbumbum bum bumbumbum\n\n[Verse 2: MC Chris]\nThink your voice's funny man, that's kind of hilarious\nI'm the rapper makin' noise when there's shadow in your area\nI’m like a damager cause I’m a little loquacious\nI do it for the hotties with the bodies bodacious\nI'm high pitched, might flip if ya diss my node\nThink Chris ain't the shit, you can kiss my chode\nWeak ass sales, not too early to boast\nSeriously bro, hand over the security code\nBecause my rhymes so fresh, green grocers' gotta spray 'em\nFired all my lawyers cause I didn't wanna pay 'em\nFrom the PM to the AM I'll slay 'em with the sawed-off\nMake a little money and I'll smoke the marijuana\nMC without Glover is Murtaugh without Riggs\nJam and peanut butter with the crust cut off for kids\nOne smokes Kinds, the other smokes Mids\nLet's mix it up a little like the DJ did\nBacardi and Coke, black and white cookie\nSmokin' in the alley cause you know we're playin' hooky\nWe're up to no good, please don't tell our mamas\nDon't mock us [?] cause we got this for Obama\n\n[Hook]\n\n[Verse 3]\nSicker than Old Yeller, money like bank tellers\nThe chicks that I'm with are thicker than Nutella\nY'all need to switch quick and get with a sick fella\nCause I'm bout to go Rihanna like I'm an Umbrella\nCome over to my place, we can cut like shears\nAnd make some mistakes like Jamie Lynn Spears\nI'm nasty? No. Forward? Yes\nI'm hip to the game, you're a rook like chess\nMy money so long that they call it John Silver's\nYour money so light that it fluff like pillows\nBoutique killers, you can see\nThey close up shop when the clerks see me\nI'm not Kanye, but my collar's popped\nCause the bro's like soda, I shit you not\nThis shit's bright orange, Fanta shade\nYou got the yellow face, that's my lemonade\nI'mma try to stay tight like girls that fuck hard\nStay in the Bay with green like Brett Farve\n\n[Hook x3]", "image": "https://images.genius.com/daedd4b19ad5d056f5ec69aae4af7839.500x500x1.jpg"}], "artist": "Childish Gambino"}