{"songs": [{"title": "Art Of War", "album": "The Underground EP", "year": "1997-03-02", "lyrics": "[Proof]\nTired of niggas rapping the same\nTalking the same, ya, hah\nLiving in the same place\nWhat style is Proof gonna do this time?\nYa really wanna know, huh?\nWhat is he gonna do?\nYou got niggas who said\n\"I'm out, I'm out the door this year\"\nFuck, all them niggas\nFuck *Einstein*\nNigga said me and Bizarre hate each other\nFuck you\nFuck *Low Key*\nFuck that nigga\nTalking 'bout he battled me and beat me\nFuck you\nAnd when I see you on the streets\nI'm in your grill\nYa know what I'm saying?\nListen\nBy the age of aquarius\nMy mind state was gugarious\nVarious opponents whose stature was hilarious\nLike you\nThrowing fairy dust\nThen frowning hard on whack chorus\nProof was on the scene before Nat Morris\nCold as a black forest in these starving streets\nA garbage heap that was brought\nStars could eat\nThe nerve of haters\nDiss us perging gators\nSo I spit venom at you through your serve in vegas\nThe primitive fool again\nNone can match that\nBlast at your rib cage\nMaking your spine hatch back\nYou lack fat tactics\nAnd thoughts of Dexatrim\nWhippin' my dick out on nuns\nIf they say sex is sin\nNext to Slim\nI'm Shady as a Texas win\nDirty Dozen solo are respected men\nGet known for craft\nIrritate me like infected skin\nThe future ain't lookin' the same\nLike a neglected twin\nSome test the scary\nThat's unnecessary\nTo kill your crew, family, your friends\nYour tech can carry\nKnock your paws off sync\nLeft you flat like a soft drink\nGot more styles than Diana Ross swing\nZone like Rick James when he smoke crack\nYou and Charli Baltimore\nGot something in common\nY'all both whack\nProof the king P-I-N\nIf I ain't the best this year\nThe motherfucker be my twin\n\n[Bizarre]\nWho's the bitch ass nigga That's mentioning my name?\nNo one to blame I just cock back your name\nNone of y'all bitch ass niggas wanna test\nCause five minutes or less I'll be at your assets\nYou're just a bitch And I wanna test you\nAnd the niggas you was with They already left you\nSo duck down cause Bizarre Kid's comin' here\nShootin' at you and your peers\nAnd cousins you ain't seen in years\nHope you believe in God Cause nigga you better pray\nPull your kids from the window And duck from this AK\nAnd already done called the Proof and Denaun\nAnd even if I want to I can't change my nigga's minds\nCause you on the shit list\nThese bullets are relentless\nAnd ain't no way in hell that you avoidin' this\nAin't no apologies\nYo I see your number on my caller ID\nBitch, stop callin' me\nFuck the truce Nigga I pull the deuce deuce\nAnd my niggas go wild Like a bunch of rats that got loose\nI'm comin' for you nigga So hide behind your door\nCause all my niggas believe in the Art Of War\n\n[Hook]\nWhat you startin' for?\nIs you on for war?\nTrife assassins\nBringing you the art of war (x4)\n\n[Kuniva]\nStraight wylin' Burying bodies right on top of each other\nSo when somebody ask I just say you under the weather (Killer Eel)\nNo matter what the problem\nRevolvers can solve 'em\nKeep a nigga breathless The tech whips regardless\nHeartless Walking you punks right to the edge of darkness\nWe're way beyond that When I pull me out a cartridge\nI bank shots Wettin' up your white tank top\nWhile my nigga Bugz is stickin' up Your nearest gang spot\nJust another scarred liar retired\nWe make niggas pass out like fliers\nFlossin' my teeth with barbed wire\nLeavin' a bloody mess Then harass kids\nAnd buy 'em a candy bar So they can tell me where you live\n\n[Kon Artist]\nHighly dangerous spraining my wrist\nLickin' off this black tech with my eyes flossed bitch\nLook up the Art of War in the ghetto dictionary\nAnd see Bizarre holding your kids hostage for their Crunch Berries\nMy pump stay hot coat stomachs like Malox\nRun away spots setting it off with the guns that Dre got\nGhetto séance but ass backwards\nFuck bringing you back to life\nNigga we putting you in your caskets\nRunning off with the mop like you got somethin'\nBut in my mind I'm thinking blast soon as I spot somethin'\nAnd when you fall I know damn well I done shot somethin'\nAnd I'm cleaning your brains off my windshield for frontin'\nD-12 is your local weed sellers\nThrowing pipe bombs in your church to kill your elders\nThe men on bitches like tracks you notice these\nBanging clits and ovaries 'til they drop the sheets\nNiggas'll die from these blows we inflict\nYou supposed to be in some shit 'cause you the underdog bitch\n\n[Hook]\nWhat you startin' for?\nIs you on for war?\nTrife assassins\nBringing you the art of war (x2)\n\n[Bugz]\nBugz'll murder you In less than a word or two\nBring the art of war to your door call me Sun Tzu\nNigga don't be mad 'cause your broad is a trick\nAlways dialing 976-need-a-dick (bitch)\nNiggas like you I'm known to smack, stab, and spit on\nKick at, hit on, you hear me bitch? It's still on\nCalling through my crib like your 'bout it with your shouts\nAin't you the same nigga who was crying on his couch\nApologize on site boy If you like your life boy\n(Yo Bugz, leave that nigga alone you know he just a white boy)\nFuck that\nI smack him off the wheels and take his bleel\nOr bought a royal mope and destroy him with my steal\nYou pussy ass how you figure it will linger\nTake your bitch on Jenny Jones\nThen beat your ass on Jerry Springer\nDon't fuck with it or get your head split and mouth bruised\nThat's a promise fuck Hal Shoes\n\n[Hook]\nWhat you startin' for?\nIs you on for war?\nTrife assassins\nBringing you the art of war...", "image": "https://images.genius.com/7a40a5dcf4af48c56e2c80bf3d485197.900x900x1.jpg"}], "artist": "D12"}