{"songs": [{"title": "Life Goes On", "album": "Build and Destroy", "year": null, "lyrics": "[Intro: Royce da 5'9\"]\nYo Ivy, let me know when we rollin\nWe rollin? Aight..\nI mean, I been through a lot man\nTommy Boy thing, the bootleggers\nYou know, life goes on, so what?\nYou gotta reach deep down in your heart, and pull out as much as you can\nTo get through what you goin through\nI'm living proof\n\n[Verse 1: Royce da 5'9\"]\nWay down DEEP in the heart of a man who was DEEP\nIn the palm of the hands of the truer streets\nLives a - nigga who gives a, lyrical nigga the shivers\nStep up and get hit cause him or his fifth'll deliver\nHis mouth is a gun, the cannibal speaks\nYou need to do more than floss to handle the teeth\nAnd shame on it - only thing that pops out\nWhenever your Glock's out is a stick, and a flag with \"Bang!\" on it\nHis flow's out-grown his dreams\nOut of a count that he beams out-of-towners and hold down home\nYou niggas showin up, with a lot of the same soldiers\nI'm rollin up, pushin her outta your Range Rover\nYou decided to be a rider but why, would you do it\nWhen you know you could light up my saliva like lighter fluid\nSoak with writin; cause 5-9 is back\nAnd he's about to spit thunder and shit lightning!\n\n[Hook: Royce Da 5'9\"]\n\"Life goes on..\"\nUh-huh, you thought I was done didn't ya?\n\"The world keeps turning and liiiife gooooes on..\"\nThought I would run didn't ya? No no\n\"Life goes on..\"\nNever again will I, need a return\n\"The world keeps turning and..\"\n(And I will never leave these streets again)\n\"Life goes on..\"\nUh-huh, you thought I was done didn't ya?\n\"The world keeps turning and liiiife gooooes on..\"\nThought I would run didn't ya? No no\n\"Life goes on..\"\nLong as I live, I'mma continue to burn\n\"The world keeps turning and..\"\n(Na na na na na na na)\n\n[Verse 2: Royce Da 5'9\"]\nMy crew never call me for beef - NO! It never happens to me\nThat's like callin a SWAT team when it's a cat in a tree\nIt's too many reasons, to tell you NIGGA please\nYou can do nothin with me, like weed with too many seeds in it\nI'm more - vicious, it gets - more pathetic\nYou testin somethin more than a medic nigga or mortician\nI'm more than rap, I will RUSH you\nFor the sacks like Warren Sapp, like nigga FUCK you\nI'll STUFF you in a Atlanta mansion\nPaint the wall with you on \"Candid Camera,\" like I'm a phantom answered\nDemand a ransom; cause a fire at your momma's house\nAnd take all of the tires off of the ambulances\nOf course the track, fits Mr. King\nOf the small article every month and the Source is BACK\nWith J Dilla, from Slum Village\nYou lookin for us, we be in Rock City nigga - come get us!\n\n[Hook]\n\n\"Life goes on..\"\n\"The world keeps turning and liiiife gooooes on..\"\n\"Life goes on..\"\n\"The world keeps turning and..\"\n\"Turning and liiiife gooooes on..\"\n\"Life goes on..\"\n\"The world keeps turning and..\"\n\"Life goes on..\"\n\"The world keeps turning and..\"", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}