{"songs": [{"title": "Hope for a Higher Power", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro: spoken by Jim Jones]\n“The world- The Kingdom suffers violence, and the violent shall take it by force. If we can’t live in peace, then let’s die in peace. (Applause.)\nWe’ve been so betrayed. We have been so terribly betrayed\nSo my opinion is be kind to children and be kind to seniors and take the potion like they used to take in ancient Greece and step over quietly because we are not committing suicide; it’s a revolutionary act.”\n\n[Hook: Girl & Krizz Kaliko]\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\n\n[Verse 1: Tech N9ne]\nGrandma told me the good book said\nIn the last days get ready for the ten plagues\n1st, the rivers will be ran with red\n2, 3, and 4, dead frogs will 'cause lice and flies\nSick livestock is 5 the living they must fight for their lives\n6, 7, and 8, a boil storms a fire and locusts\n9 is darkness, so dark it's hard for you to focus\nAnd 10 is death of the firstborn\nIf I said it was questionable the religions would make it a point\nTo get at me and battle me, maybe have this verse torn\nHow will this curse form?\nWell, Creationism and Darwinism been at it forever\n'Bout at it I got nothin' but hurt for 'em\n'Cause really nobody knows when you live\nThen you die where your body goes\nIf it's Hell or it's Heaven\n6 or the 7, well I'll keep the nina for all the foes in a gamble\nThat's what life is and it's hard to handle\nWhen the bible says worship this but the scripture's written by man though\nSo when man destroys us the word might not stand so\n'Til that day I'm just gon' protect my fam with ammo\n\n[Hook: Girl & Krizz Kaliko]\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\n\nAnd at the height of their power\n(God) will send an angel to destroy them\n\n[Verse 2: Tech N9ne]\nI've been looking for something supernatural for a long time now\nBut I never got proof that a spiritual realm existed, wanted to find how\nEverybody sure of a supreme being, are people just seeing things?\nWondering if we get wings, seems sick to believe in an extreme king\nI know it sounds far fetched, every night I put knees on the carpet\nThen I pray to who's up with the star set\n'Cause the Earth in its self is a target\nFor destruction, for combustion\n'Cause there ain't too many you can trust in\nThink of all the women losing their husbands\nIn Iraq a lot of killing and suffering\nWhat I hope for, seemed folklore\nWhen the enemy kills and gloat more\n'Cause they killin' us off in this hoax war\nThen I wake up yellin' and my throats sore\n'Cause the fight's there, it's a nightmare\nIf it come to me, I'm in my snipe wear\nIf a bullet give my lung a slight tear\nI wanna believe that the light's there\nSo all you Christians don't get mad at me\nI just hope your mystical magical miracles work in catastrophes\nAnd this ain't blasphemy, but artillery is my strategy\nI hope for a higher power when I look at all these tragedies\n\n[Hook: Girl & Krizz Kaliko]\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\n\nI will never follow the beliefs of man, why?\nBecause man destroys everything in his path\n\n[Verse 3: Tech N9ne]\nOh what a miracle, angels and demons\nBut the only miracle is that people keep believin'\nRight hand on the bible, left hand on my rifle\nKeep that for my rivals and evil disciples\nExpand your mission, man to women\nWhen they attack do you plan to give in\nOr do you do like I do and say praise the lord and pass the ammunition\nPeople like us, piece and knife up\n'Cause we got evil to sweep and wipe up\nDevils and demons and humans, irrelevant\nSo if they lookin' deceiving I bust\nI hope that the higher power is watching over me\n'Cause we young people don't see faith like most the older see\nIf he or she is listenin', a mere sign can spark me\nBut if the laws in the bible are bogus, then prepare for anarchy\nWorst case scenario is never ever was a higher power\nSo in the midst of chaos now, the only real savior is fire power\n\n[Hook: Girl & Krizz Kaliko]\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\nIf there is a final hour\nLet's hope for a higher power\n1 by 1 and 2 by 2\nI have ammo, what about you?\n\n[Outro: Spoken by Jim Jones]\n“I, with respect, die with a degree of dignity. Lay down your life with dignity. Don’t lay down with tears and agony. There’s nothing to death. It’s like Mac said, it’s just stepping over to another plane. Don’t be this way. Stop this hysterics.”", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}