{"songs": [{"title": "U Can’t Fuck With Me", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Intro: Snoop Dogg & (LL Cool J)]\nYeah, Big Snoop Dogg, X to the Z\n(Yeah)\nUncle L, blast these bitch ass motherfuckers\n(Yeah, yeah)\n\n[Verse 1: LL Cool J]\nPour your Dom on the floor, try to flow with me\nDuke I'm raw with them whores, hide ya hoes from me (wooo!)\nYour momma wanna chase, I'm just statin' the fact\nL.A. think about your broad all I want is the stacks\nCats flashin' in my face is who I'm laughin' at\nSo you made a little dough, but wutchu doin' wit that?\nThought 'cha girl ain't feelin' me\nWhy she grillin' me, Black?\nAdmit I'm the man or else I'll twist ya uterus back\nOn my lap, in the jet to Miami and back\nWhen I tear through new school, all y'all records is whack\nI'm from Q, for Quiet Killers\nAnd U know I deliver\nThe double N, enough ammo for every nigga\nS, that spell Queens stupid ass, run it back\nThat HBO shit, I must address that\nOnce and for all, what's my opinion on Jamie Foxx?\nHe pussy, plus he ain't funny as Chris Rock, ha\n\n[Chorus: LL Cool J, Snoop Dogg & Xzibit]\nYou can't fuck with me\nCan't fuck with me\nI don't care about your imagery\nFuck, nigga\nGive a fuck who you claim to be\nFucker, c'mon\nYou still can't fuck with me\nYou can't fuck with me\nYou can't fuck with me\nYou can't fuck with me\nI don't care about your imagery\nFucker, motherfucker\nGive a fuck who you claim to be\nYeah, nigga what\nYou still can't fuck with me\n\n[Verse 2: Jayo Felony]\nNO GO!!!\nWho you thought it was? Don't be fuckin' with my Uncle, 'cuz\nOne does up dick the pen in my streets go one way\nI kill 'em In Living Color, on Any Given Sunday\nThey all anxious to be waitin' to see how ill is my style\nAnd if it enough to make Kevin Lyle spit this out right now\nAnd get 'em with Juvenile feed pitbull puppies, bologna in the projects\nYou wanna die next?\nNah, he wanna live, and he loves his kids\nWe got this rap game on lock, like a cake rock\nGimme the key, run up in your spot\nLike, you on your belly, gimme the key\nWhat is it gon' be, what it is gon' see\nWhen your blutter don't mean\nAnd if he keep tryna wipe it off, like, \"Nigga, what's this song mean\"\nL got 'em cornered, bitch, why you speak like that?\nTattooed Def Jam under your wing like that\nWhat? You a rider, not in my house, Mouth\nGlad to escape down south to my Miami house\nAnd fifty spring in the couch\n\n[Chorus: LL Cool J, Snoop Dogg & Xzibit]\nYou can't fuck with me\nCan't fuck with me\nI don't care about your imagery\nFuck, nigga\nGive a fuck who you claim to be\nFucker, c'mon\nYou still can't fuck with me\nYou can't fuck with me\nYou can't fuck with me\nYou can't fuck with me\nI don't care about your imagery\nFucker, motherfucker\nGive a fuck who you claim to be\nYeah, nigga what\nYou still can't fuck with me\n\n[Verse 3: Xzibit]\nLet's play a game of big bank take little bank (yeah)\nBig dank take little dank (yeah)\nI average ninety-five in the paint (c'mon)\nWe comin' down like a shank\nI know you wanna ride, but you can't\nWe all up in your shit like a shank\nDon't make me stop and pull brakes\nYa two downs are lookin' cool, freakin' a sound\nYo, I get fucked up and terrorize the town\nI'm the circus ringmaster so fuck the clowns\nI bust, lyrics and rounds at the Lyricist Lounge\nLost and Found a new identity, from here to infinity (yeah)\nGod have mercy on all my enemies\nDon't even test, waste your breath or your energy\nKnock ya whole family off, like the Kennedy's\nI'm pledge sicker than age, with no type of remedy\nMakin' niggas retire but reclaim disability\nAgility, keppin' y'all outta the state penitentiary\n\n[Chorus: LL Cool J, Snoop Dogg & Xzibit]\nYou can't fuck with me\nCan't fuck with me\nI don't care about your imagery\nFuck, nigga\nGive a fuck who you claim to be\nFucker, c'mon\nYou still can't fuck with me\nYou can't fuck with me\nYou can't fuck with me\nYou can't fuck with me\nI don't care about your imagery\nFucker, motherfucker\nGive a fuck who you claim to be\nYeah, nigga what\nYou still can't fuck with me\n\n[Verse 4: Snoop Dogg]\nLook, nigga I, regulate, bake the cake\nShake the fake, while keepin' my faith (uh-huh)\nDemonstratin' from the funk shit to the H\nI bring the bread to the meat, so put the funk on the plate\nYou weedin at my table, did you say your grace? (huh)\nYou say the wrong thing and I'ma smack your face (bee-atch)\nChase these niggas or waste these niggas (say what)\nYou did fucked up 'cause I'ma break these niggas\nSpray them, liquidate 'em, fade 'em all\nSuckers, I hate 'em, laws I pay them off\nBig Dogg, in this motherfuckin' bar\nWit Uncle L, don't tell Baby Dogg, \"Yes y'all\"\nWe do this with no flaws\nI love my bitch with no drawers and no bras\nNo laws, we break 'em from the get-go\nSlidin' by, ridin' high when we get-go\nLove it or leave it, we love livin' illegal\nServin' or swervin' in a '85 Regal\nLook here, bitch, you ain't a motherfuckin' Beagel\nI take off on your ass like an eagle\nWherever we go, we stay connected with my peoples\nJust in case a motherfucker wanna G Funk\nTwo of the homies, and one of 'em got a piece on\nAnd they never hesitate to dissolve", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}