{"songs": [{"title": "My Struggles", "album": "The Cookbook", "year": "2005-07-04", "lyrics": "[Grand Puba]\nYeah, Missy Elliott, Grand Puba\n\n[Missy Elliott]\nY'all don't really know who I am, God damn\nI'm like grease in the frying pan cause I am\nBacon, eggs, toast, butter\nSmooth sexy lover more FRESH than others\nGo ask your brother if y'all don't believe\nI control the industry cause Missy in the lead\n{*scratching*} Uhh, I'm talkin to you man\nWith my upper hand, the fans call me Dapper Dan\nWhen I was young my pops, throw rocks\nAlways shit talk to my moms and call the cops\nCouldn't wait 'til I was nice and grown\nSick of daddy mouth 'til six in the morn'\nOn and on and on 'til the record scratch\nAnd if I made a few scraps I would never come back (YES!)\nTake moms with me and a few ADAT's\nAnd make a song about that and tell pops it's a wrap (YES!)\nOah-KAYYYYY!\n\n[Scratched] hold up\n\n[Hook 2X: Missy Elliott]\nY'all don't really know my life\nY'all don't really know my struggles and how much liquor I guzzle (YES!)\nY'all don't really know my fears\nAnd how many years to get here but I'm ready to rumble\n\n[Grand Puba]\nYeah, I be that throwback cat, I throwback 'gnac\nI spit hot raps, then I check my traps\nPockets stop the bulk, green up like the Hulk\nRam up in somethin like that nigga Marshall Faulk\nI'm a low key nigga, a O.G. nigga\nEntertain my guests in \"The Basement\" like Tigger\nGrand Puba and the name ring bells\nAnd if it ain't about paper I don't waste my sells\nSo the new school new school need to learn yo\nI burn baby burn like a Hunt's Pointe ho\n\n[Missy Elliott]\nYo yo Puba, hold up\nLet's take 'em back on some \"411\" shit\nMA-RYYYY!\n\n{*beat changes*}\n\n[Mary J. Blige]\nI'm Mary J. Blige, for a fact I don't rap\nI'm known around the map to always make a comeback\nI went through some struggles fightin with my ex-lovers\nStayed in lots of trouble, blessings then I had recovered\nHad to pay them bills, the places I lived\nMessin with them cats that's said to get I had to give\nI had to tell them back up cause I was quick to smack 'em up\nI didn't give a WHAT, Mary J. would act up\n\n[Hook: Missy] + (Mary)\nY'all don't really know my struggles\n(I had two or three jobs I had to juggle)\nAnd all them liquor shots from the pain I covered\n(Strugglin from the break-ups with my lover)\n(Y'all don't know the half) Don't know the half\n(I'm better off now that was in the past)\nI had to take the good stuff with the bad\nNow I'm (thankful for the little things that I have)\n\n[Scratched] I'm Mary J. Blige, for a fact I don't rap\n[Scratched] Grand Puba, and the name ring bells\n[Scratched] I'm Mary J. Blige, for a fact I don't rap\n[Scratched] Grand Puba, and the name ring bells", "image": "https://images.genius.com/49c23ba7107cf9bb93749df01b30111c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}