{"songs": [{"title": "There’s Only One", "album": "Genesis", "year": "2001-11-27", "lyrics": "[Busta Rhymes]\nRoll wit a nigga, put on some roller skates (laughs)\nYeah yeah yeah, yeah yeah yeah yeah yeah yeah\nCome on!\nHot shit! More more more more more more!\nWe gon continue to give it to you muhfuckas like this\nPut ya fuckin roller skates on!\nYeah, hennessy niggas\nYeah, more weed niggas\nI know it feel good come on, talk to ya beat (Huh)\n\nThug niggas, yo we here to straight recruit y'all\nNew millini niggas yo we here to straight salute y'all\n(Shoot y'all) Wack niggas we here to mute y'all\nAnd drop shit to make all you niggas just get the boot y'all, baby\nWiggle ya shit one time (come on)\nFuck you and your whole entire click combined (come on)\n...Whatever the cost now, floss now\nShow you niggas who be the boss now\nAll across the board wild they be bouncin my obstacle course now\nSparkle with a gloss pushin a force now\nNow I get my wine and dine on, slide on\nA dick of a nigga who bust in you to get his shine on\nSee some real live chicks sippin them mistics\nThey buggin on how they let a nigga up in 'em this quick\nDon't get it twisted or we'll bring the most reliable (what!)\nWe bringin that shit that be so undeniable\n\n[Hook: Mary]\nY'all wanna know who we with\nBusta Rhymes and there's only one\nYou know my man is always rockin shit\nWe keep it street cause that's where we're from\nYou comin out to do your thing\nUnderground heat to the club we bring\nAnd you know that we got this\nAnd you know that we got this\n\n[Busta]\n(Hugh) Brand new, all the way down the line\nFrom the new bounce the new money down to the newest shine\nWit the new blue nine though I had to bust it a few times\nWatch these funny niggas and analyze all the true signs\nIn due time we will accumulate, illuminate\nMy click will fuck up the money you allowin your crew to make\nYeah, and while we step up in the hot spot\nAnd fuck with these bitches until somebody start to bust shots\nNiggas duck for a second make sure they ain't the ones got\nTo start the party against me (Ho) and yell blood clot!\nEverything be goin on from chicks blowin kisses\nStraight wildin out while these niggas surround these freak bitches\nOnce somebody else started bustin they heat vicious\nI started holdin my toast, defendin all my street riches\nUp in the club champagne up in the ice bucket\nNow these niggas is wildin and throwin they drinks (Fuck it!)\n\n[Hook]\n\n[Mary]\nNow don't get mad, cause what you had\nToo bad it didn't last\nAnd now we're back on this Busta track\nAnd now the games on smash\n\n[Busta]\nYeah, all my live niggas get yours\nFloss heavy, all my bitches bounce on the floor\nCheck it, squads deep with niggas everybody on\nMake the livest motherfuckers wanna bounce to my song\nCheck it, my niggas organize, analyze the teamwork\nAnd how a bad shorty rockin that Rah Digga T-shirt\nAnd keep it goin while you tag along, swing along\nAnd see my niggas that be reppin while you sing along\n\n[Hook] - repeat 2X\n\n[Busta and Mary ad lib]", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}