{"songs": [{"title": "Wee Wee", "album": "Straight from the Lab Part 2", "year": "2011-12-18", "lyrics": "[Hook]\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\n\n[Verse 1]\nGot a dick as big as a banana\nI try to control it but I guess I can't\nIt shoots off like an AK-clip banana\nYou better watch out, Hannah Montana\nMan, what's the matter, have you no manners?\nNo you know the girl from Juno's address\nYeah, I'ma probably go to jail for that\nNow I got the cops on my tail for that\nRun up on your car with a stale banana\nIn your tail pipe, can't believe you fell for that\nIt could've been a molotov cocktail for that\nWait a minute man, what the hell was that?\nI heard a noise, where you going? What are you, bananas?\nYou can't go back there, stupid ass\nI just seen a woman in a Freddy Kruger mask\nWho the fuck are you? Superman?\nAll you have is a little stupid can\nOf whipped cream, what the hell you gonna do with that?\nI'ma put it on my wee-wee, oh good answer\nSuper bonanza extravaganza\nMan go ahead, what you waiting for?\nYou better get them clothes off, baby boy\nCome on let's go, we're gonna make a porn\nReady, set, go hit play, record\n\n[Hook]\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\n\n[Verse 2]\nAre you ready? You better hold the camera steady\nShe's probably back there with a damn machete\nShe's probably gonna eat you like canned spaghetti\nShe's probably gonna kill you, still wanna check, see\nHave a little quick look, go on sick prick\nShe's probably six foot tall like Big Foot\nThe hell with that, we probably should run\nDon't dare look back, we probably, probably\nProbably, there probably was a problem\nAt the post office or something\nBut you probably didn't know that, did you?\nNow what you gonna do when she gets you?\nI ain't going with you, forget you\nQuit tryna hold my hand, mister\nPretend she's your little sister, little sister\nMight as well take the whipped cream with you\nAnd when you see her, make sure you get a picture\nWe could try to make another Blair Witch movie\nA beastiality porno with smoothies\n\n[Hook]\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\n\n[Verse 3]\nIt's eerie, but here comes Zack and Miri\nBeauty and the Beast, his back is hairy\nBut she don't care, they're attractive, very\nVery sexually active, very\nNo, Zack, don't go back in there\nIt's too late now, she's grabbin' hair\nHe screams, bloody Mary, grabs a mirror\nBut stop just ain't in her vocabulary\nGet off me, please, get off me, stop\nBalling back at a coffee shop\nThey go non-stop, she says go\nHe says no, she says oh\nBack and forth, they scream and shout\nYeah, boy, let them demons out\nIt's the kind of nightmare you dream about\nUh-oh, now the whipped cream is out\nI get sick thoughts, sick, sick, thoughts\nThings you could do with your lipstick gloss\nPut it on my dick 'til the tip looks orange\nBitch, keep goin', bitch, keep goin'\n\n[Hook]\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\nPut it on my wee-wee\nBanana, strawberry, pineapple, orange\n\n[Outro]\nBanana\nBanana\nBanana\nBanana\nBanana\nBanana", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Eminem"}