{"songs": [{"title": "Can I Get Witcha", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Intro]\n[Big] Huh?\n[Cee] Cease-a-Lee'\n[Big] Doggystyle.. YEAH!\n[Cee] B.I.G\n[Big] Uhh.. to all the ladies in the house!\n[Cee] Where they at?\n[Big] Uhh, uhh, check it out\n[Cee] C'mon Big\n\n[Verse 1: The Notorious B.I.G]\nAnother day in the ghetto\nOne look outside I'm already upset yo\nIt look about a hundred-and-two\nIt's a Saturday and Biggie ain't got nothing to do\nUhh, I'm interrupted by a phone ring {*brrrrring*}\nSometimes I wish I never got the motherfucking thing\n\"Hello hello? Can I speak to Biggie?\"\nYo, who dis? \"Taisha\" Yo call back, I'm busy\nWhy don't ya hit me on the box a little later\nWashed up, got dressed, hits the elevator\nSteps out it's the same old scene\nDope fiend, crack fiend, eyewitness news team\nI seen a honey with a butt looking butter soft\nI know she looks much better with them clothes up off\nSitting all thick, with the ruby red lipstick {*SMACK*}\nThat's the one I gotta get with\n\n[Hook 1: Notorious BIG]\nCan I get witcha, can I get witcha\nCan I get witcha, can I get witcha\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T, see\nCan I get witcha, can I get witcha\nCan I get witcha, can I get witcha\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T\n\n[Verse 2: The Notorious B.I.G]\nShe said \"If I get with you\nI gotta get witcha whole hood rat crew, whatcha I think I do?\nSling skins for a living,my name ain't November\nThis ain't Thanksgiving, you ain't Michael Bivins\nMack it up, flip it, rub it down\nDo me baby, I ain't down\nMy name ain't 2Pac I don't \"Get Around\"\nYou hitting this nigga, how that sound?\"\nHuh, first of all you got me mixed up with\nSomebody ya done slept with, hold up\nThat's my Neneh Cherry shit, I got something slicker\nLet me just sip up on this liquor\nAll I wanna do is smoke a little chronic\nSlam ya like Onyx, and get ya hooked on\nThis Biggie Smalls phonics, 102\nHow to squeeze 22's in them Reebok shoes, HUH?\n\n[Hook 2: Notorious BIG, Lil' Cease]\nCan I get witcha (can I get witcha)\nCan I get witcha (can I get witcha)\nCan I get witcha..\nCause I got a big B-U-T, T, see\nCan I get witcha (can I get witcha)\nCan I get witcha (can I get witcha)\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T\n\n[Verse 3: Notorious B.I.G]\nI said walk me upstairs, cause I forgot my Phillies\nShe said \"I don't care, so don't be acting silly\"\nI knew I had her trapped with my hardcore raps\nAnd it wouldn't take a second before I had her on her back\nPulling back the bra straps, threw on my Silk CD\nCause, \"I wanna get freaky with you\"\nLose control on the skins is all I can picture, now I'm about to hit you\n\n[Hook 3: Notorious BIG, Lil' Cease]\nCan I get witcha (can I get witcha)\nCan I get witcha (can I get witcha)\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T\n\n[Verse 4: Lil' Cease]\nTo all my hoes, respect due\nTamika sorry I left you\nMichelle I'm glad I met you\nYou make the head feel special\nNow I know it's official\nThat I can touch and tease you\nPull up my pants and diss you\nAnd hit the door you came through\nIt's Cease-a-Lee, a.k.a. Mista Nasty\nGermany style, these hoes they blast me\nOne of the chickenhead with sex appeal pass me\nThat's her hands, ankles, feet they ashy\nI like the flashy type, who pass with dykes\nWith long hair, and they ass be right\nI get up on that ass, see what that be like\nI fuck a bitch good, if she ask me right, huh\n\n[Hook 1 x2]", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}