{"songs": [{"title": "Sasquatch", "album": null, "year": "2013-10-25", "lyrics": "[Intro]\nI think they spotted me\n\n[Hook]\nThey call me Sasquatch, please check the watch\nThis is Bigfoot, don't get it shook\nOut in Japan they call me Godzilla\nUp in Africa, King Kong gorilla\n\n[Verse 1]\nMichael Joe Jackson used to call me Thriller\nAll my enemies swear I'm Attila\nVietnam vet, burn down your villa\nCaptain Crunch scream, serial killer\nOut in O-Town I'm a fucking pirate\nThink I'm Rodney King? We can start a riot\nTo a fat bitch, I'm a fucking diet\nYou in solitary, I'm piece and quiet\nThis a nightmare on Elm Street\nYou're just a runaway, where the pimps be\nYou'se a thirsty man, I'm so empty\nAt your funeral, no sympathy\n\n[Hook]\n\n[Verse 2]\nThey call me Sasquatch, please check the watch\nPlease check the time, I'm like turpentine\nAnd it's burping time, you exhausted I know\nCause I'm overtime and I'm over the line\nCome over to mine, I already left\nYou wanting a rhyme, bitch? I'm So So Def\nYou ready to shine, I'm already blind, you already lyin'\nA nigga ain't buyin' what you selling, always open; 7/11\nWhen I blow niggas know here come tsunami\nYou got a bucket list, my list\nYou that drowning kid at the pool party\nI'm the carnivore over your body\n\n[Hook]\n\n[Bridge]\nDon't make me, don't make me put this foot up your ass\n(Don't do it)\nDon't make me, don't make me put this foot up your ass\n(Don't)\nDon't make me, don't make me put this foot up your ass\nWhat you do? Bring it down and bring me my cash\n\n[Verse 3]\nYou'se a fucking prick, but I'm Moby Dick\nI'm Darth Vader, you Obi Wan Kenobi, bitch\nHe's Jim Kelly, y'all, I'm Terry Bradshaw\nHe is baby ass, I'm like diaper rash\nI'm like stinking trash, I'm like party crash\nLike getting caught with hash\nI'm like your stolen cash\nI like you feeling bad, they call me Schleprock\nI like the whole country looking at the debt clock\nPyroclastic flow, this is Pompeii\nWhoever in the way, turn you into clay\nCall me out my name and that's a hurricane\nI'll send the wind and the water and the pouring rain\nI am boring, mane, I am snoring, mane\nI'm the pain that's wearing off the Novacane\nI'm the weight you gained, I make your titties hang\nI'm the crowded train that just hit the mane\n\n[Hook]", "image": "https://images.genius.com/e460f6c8de82c38bff1947a979bcbe12.640x640x1.jpg"}], "artist": "Ice Cube"}