{"songs": [{"title": "Journey Throo Da Darkside", "album": "Dare Iz a Darkside", "year": "1994-11-22", "lyrics": "[Intro]\n*explosion*\nWoo-woo-wowowowooo!\nLord hi-gher\nCould somebody, turn on, da lights\nSomebody, turn on, da lights\n*coughing*\nThe darkside! Yessss...\n\n[Verse 1: Redman]\nGuess who's back when I bring funk like Zapp\nAll aboard motherfuckers! While your brains get jacked\nI'm souped like two scoops of funk juice, word to mother\nThe way I kick you swore that Jim Kelly was in this motherfucker\nThe darkside brings apartheid\nI act wild like them niggas from Chi-Town on the Southside\nSweeter than this, whoopin niggas down like Jack Nich\nWhen I backflip my tactic graphics\nOoooooh! Redman jams it in\nDue to difficulties I won't be done by ten\nFriend I got bust shots out the twelve Benz\nAnd then we get the bam-ba-zee from one-ten\nOr is it further up? Plus my style murder ducks\nSo what the fuck, you got the mic turned up fo'?\nWhen I Chief Rock underground MC's drop like sheet rock\nHere's a ride to the underground\n\n[Hook](repeat 2X)\nTo the beat y'all...\nAh to the beat y'all, I do the freak y'all\nI keep the buddha to last me through the week y'all\n\n[Verse 2: Redman]\nCome take a trip on my cosmic movie boogie flicks\nFar beyond space so niggas say your grace\nIt's a True Lie that I bring drama like Schwarzeneggar\nWhen a baby, I had other babies in labor catchin vapors\nWith two gats I move like too fast like Paxton\nAsk Toni Braxton who got seven days of action\nBlack stars or moons eclipse the volume\nBang zoom I'm sendin honies on the moon with ten bags of boom\nRidiculously I will rip an MC\nTo degrees I leave spots like chicken pox, check the synopsis\nI grow confusing just like Rubik's cube boxes\nFloat like the butter, fly so what if I\nBlow your lenses, tear the fuckin hinges\nDid I mention that my lyrical format gets more ahs than a dentist\nWhen I'm in this, the knotty-headed era causes terror\nY'all gimmick motherfuckers better get y'all shit together\nOne for the money and two for my peeps\nNynex can't even reach my technique or rap sheets\nFor the Squad I lick two shots word to God\nThen take y'all dreams and imaginations\nTo the darkside", "image": "https://images.genius.com/d90c906f33a174fa71425b4dd339eb96.1000x1000x1.jpg"}], "artist": "Redman"}