{"songs": [{"title": "The Banjo", "album": "Tabernacle: Trust the Shooter", "year": "2016-03-29", "lyrics": "[Verse 1: Royce Da 5'9\"]\nDie, bitch, die, hoe\nNew God flow, no I'll go\nDiablo, why, hoe?\nWhy, bitch, do time tick?\nThink about it, you die slow\nIf not you die quick\nI’m sicker than Theraflu\nWickeder than a kick over headstone\nSippin' on redrum\nAfter I'm finished just swimmin' inside of the dead pool\nAfter I'm finished just inflictin' on the guy a despicable head wound\nNothin' is important, but to import tons\nOn my fourth run while I'm eatin' lunch with my forked tongue\nI swing this motherfuckin' barrel loose\nI don't fuck with knives, nigga, I'm Sardo Numsie\nY'all niggas call the police on my people regardless\nRock a bye with my piece then call it Keisha in Harlem\nI'm the highest of all beings, my eye is the all-seeing\nDribblin' fireballs with lion paws for my audience\n\n[Hook: Royce Da 5'9\"]\nWhat if the Devil played the banjo?\nWhat if he invited you out on the dance floor?\nThere's one of six million different ways this can go\n\n[Verse 2: Westside Gunn & Conway]\nAyo, your fishscale Fisher-Price\nFirst shot killed a nigga, but I hit him twice\nMy trigger finger itchin' like it was lice\nSent the white in a pot with the ice, whipped it nice\nHurricane whipped the whole slag\nFiend hit the glass, hit his ass, you know the math\nI toe tag me a nigga, you know I spaz\nI throw a bag to my young nigga, he'll get it over fast\nG-wag, 24 karat\nSilencer on the Mac 12, you ain't even hear it\nLightning strikin' on the Neil Barrett\nFuck nigga don't get embarrassed\nFuck your two Sarah's out in Paris\nBitch nigga, your life, you better cherish\nTen shooters show up to your show just to air it\nGriselda, the dinner place swingin'\nBody in the Bentley truck, shit reakin'\n\n[Hook: Royce Da 5'9\"]\nWhat if the Devil played the banjo?\nWhat if he invited you out on the dance floor?\nThere's one of six million different ways this can go\n(So go fast)\n\n[Verse 3: Styles P]\nEyes are the windows to the soul, what your secret is?\nOnce had to battle the reaper, and I ethered him\nNo tellin' what I'll sing on the mic, he got reefer in 'em\nGhost guts, I can see a ghost, and speak to 'em\nBuildin' with the dead like every other night\nAnd I never write a rhyme, I recite my other life\nYou thinkin' this a verse, but it's more of a testimonial\nSo flow, up in the zone, only the lonely know\nThinkin' I'm geekin', but I'm reachin' my dead homies, though\nTold 5'9 if I have a nine to five\nI'll line rappers with the nine and rob em five times\nEvery day, seven days a week, call it crime time or\nThirty-five licks, nigga, that's a prime rhyme\nFightin' Bruce Lee's demon, but I'm agin' like fine wine\nYou don't understand me\nCause you don't stand under the code that mean family\nGhost is uncanny\n\n[Hook: Royce Da 5'9\"]\nWhat if the Devil played the banjo?\nWhat if he invited you out on the dance floor?\nThere's one of six million different ways this can go", "image": "https://images.genius.com/5c9849e0f3618550af46c49efa192e9b.630x630x1.jpg"}], "artist": "Royce da 5'9'’"}