{"songs": [{"title": "Street Fame", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Intro]\nTurn it up in my head phones, please\nComin' to a ghetto near you, street fame\nMore, ha ha, comin' to a ghetto near you\n\n[Verse 1]\nI wasn't mad until these tricks shot me\nIt's time I sanitize my posse\nLook how paranoid these niggas got me\nCellular calls are being traced since surveillance silently\nMama, chill, thug livin' pay the bills, I'm dyin' violently\nClosed caskets, expose bastards, I leave 'em bloody\nDelores Tucker, don't let your kids\nHear a nigga speak on gettin' money\nAin't nothin' funny, green got a nigga seein' things\nWhy? Hit the lye, hope to God I can fly\nLethal weapon, I'm a savage; still a method to my madness\nBlast, niggas laugh, calling my cash cabbage\nRead 'em and weep, put 'em to sleep, they hell bound\nLyrics will leave 'em spell bound\nClown, now tired of being held down\nCross my heart, hope to die, blind with some pussy\nMillionaire, livin' care free, sucka free, playa haters miss me\nHope in hard times never catch me slippin'\nFuck authorities! They wonder why minorities be trippin'\nWe ain't havin' it, time to tear this shit back\nGhetto children kick back\nOnce I hit the MAC, niggas'll never get they shit back\nSpit it so eloquently, my pistols represent me\nBust until my rounds empty; back for the street fame\n\n[Hook]\nOne love to my true thugs\nComin' to a ghetto near you, street fame\nBust! Comin' to a ghetto near you, street fame\nAll out warfare, eye for a eye\nBustin' on my enemies, bad boy killin'\nStraight dissin' you\nFuck Lil' Kim, you nasty bitch!\n\n[Verse 2]\nTemperatures rises, niggas blinded by my lyrical disguise\nNo time to plot retreats, niggas shiver and die\nMultiple rounds found laced in his body and face\nWrapped in plastic, the acid erased all traces\nCriminal tactics, the rap game became so drastic\nMilitary mind,  mash all the hoes, get blasted\nIf we bleed then they suffocate, chokin' in terror\nSo we strive seein' our lives be reflected in mirrors\nThe prophecy is clear, niggas lock and load, disappear\nStrategize with no fear, wagin' war for years\nThe crack game wasn't big enough, ready to rush\nBitch made motherfuckers get murdered and touched\nI go to jail niggas screamin' free me, speakin' freely\nConversatin' with my comrades kickin' Swahili\nIndeed they should fear my first seed\nIt gets worse, planned a curse to be a G, on the first to breathe\nCurrency in stacks, artillery in the back\nStrapped, armies, we camouflaged in all black\nWhen we attack, holla out my set, nigga\nTighten your jaw, givin' birth to Outlawz, street fame\n\n[Hook]\nBust, nigga bust!\nComin' to a ghetto near you, street fame\nOnly Makaveli the Don\nCan put it down like this; ain't none like me\nComin' to a ghetto near you, with street fame\n\n[Verse 3]\nPositive identification, got me rushed to the station\nStuck in this line up, tryin' hard to hide my face\nThey placed the name but can't recall description\nI ain't did shit, officer, that bitch trippin'\nPromise retaliation, their plan busted, no man to be trusted\nEverything corrupted once man touch it\nKamikaze, hopin' that none of the spies find me\nThat's why we bye bye daily, knowin' cops trail me\nBut why cry? Floatin' while we tokin' on this potent branch\nFlossin' in the thug stance, pistol tucked inside my pants\nNever underestimate me, playa hate me, see me and hide\nSure as hollow-points shatter, enemies die\nSpread love, dead thugs gettin' buried in riches\nTake a chance to advance; fuck them worryin' bitches!\nPenitentiary's a possibility, bust and pray\nWear a rubber so I live to fuck another day, hey!\nAin't nothin' strange, I'm 25, dyin' to change\nBut still I bang wantin' street fame\n\n[Hook]\nThat's the end of that\nThugged out, Makaveli the Don\nRepresentin' the Outlawz, street fame\nOne love to my true niggas\nComin' to a ghetto near you street fame\nMakaveli the Don, Killuminati\nComin' to a ghetto near you, street fame\n\n[Outro]\nYo, check this out, I'ma tell you like this\nIf the lifestyle that you livin'\nGot you taking more fuckin' shorts than gettin' props\nThen that lifestyle need to stop\nBest to recognize some Outlaw shit\n‘Cause only in this Outlaw lifestyle can you truly come to\nTo see what this life's supposed to be like\nNigga, you'll start to see riches\nFine bitches and hittin' switches\nShit, to me that shit sound delicious; street fame", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}