{"songs": [{"title": "Rollin’", "album": "Sunday Service", "year": "2012-12-02", "lyrics": "[Intro x2: Kanye West]\nWill I ever change in this life?\nMy grandma said I'll never change and she right\nY'all think that L.A. gang banging shit hype?\nWell you finna' find out what the game be like\n\n[Verse 1: Game]\nRed rag on my rear view\nNo tint in the Porsche, see clear through\nGod screaming up out them speakers\nSo loud that a nigga can't hear you\nWake up to a diamond cross, I'm a Christian\nGot a nigga feeling like Obama 'nem\nNiggas shot out my windows, they jealous and envy\nThey spit on my 'Rari, they keyed up my Bentley\nThey went at my top dog like Ab-Soul and Kendrick\nI said I'm a killa', god damn it I meant it\nI said I sold crack, nigga bubbling skillets\nAt my grandma's house, I was selling work in it\nAnd god bless her soul, she died\nBack out the four, load up the five\nPop up the trunk, load up them pies\nAye 'Ye, ain't this how them niggas do it in the Chi?\nVice Lords, GD's\nCrips, Bloods and Impala's on gold D's\nYesterday a nigga swore he was a man in the hood\nNow he begging for his life on both knees\nI'm a killer, no codees\nAsk 40 Glocc, niggas don't know me\nGot a problem blood, then come show me\nI'm on Rosecrans ing them Kobe's\nGot diamonds off in my Rollie\nGranddaddy stuffed in my stogie\nMotherfuck them Axel Foleys\nWhere I'm from, niggas shooting at the police\nMan these fuck niggas got me screwed up\nI'm like Papa Smurf in that blue truck\nRed hat, red pants\nWalking inside dreams with the kush in my hand - I'm\n\n[Hook x4: Z-Ro]\nRollin', rollin', rollin', rollin', rollin', rollin', rollin' them drugs up\n\n[Verse 2: Trae The Truth]\nYoung nigga 15, broke, livin’ the scene\nSawed off in my pants, ‘bout to go make the lean\nFinna' rob me a nigga who’s money wasn’t the same\nSomebody gon' give it to me, or get one up in the brain\nMama used to stroke it just to feed me scraps\nEvery Saturday, it was YO! MTV raps\nGot sick of looking at other niggas that ain't deserve it\nSo I followed my older brother to beat these traps\nI ain't worried about the love, I've seen everything\nThe hood hot, like the devil had it off in his hands\nSend a strap your way, I seen a couple of fans\nLast pack, I took that and a couple of bands\nIf I ain't hustle to eat, I was doing that sippin' Screw\nBut they would give it to me, everyday I was paying dues\nI was a young wild nigga missing a couple screws\nIn the hood, when I'm scared, only thing I'mma use, when I'm...\n\n[Hook]\n\n[Verse 3: Paul Wall]\nMane, hold up\nYoung and I leans with a cup full of lean, and a 4-0 tucked\nNo more sleep, gotta get more bucks, OG rolled up\nStakes are high, so I pray to God the folks don't roll up\nBig sister told me I need to grow up\nBut I need that money, better not crumb me\nPockets fat as my codeine tummy\nTrying to get blow like my nose was runny\nI work for mine, you can't take that from me\nWrap it up, like Egyptian mummy\nAnd have it ready when I roll on up\nStacking dough on up, from the floor on up\nAnd I'm all through the hood like ice cream trucks, just rollin'\n\n[Hook]\n\n[Verse 4: Slim Thug]\nKeep kush rolled, that dream I'm holding\nIn the candy Caddy' with with ninety molding\nBought a drop, put it in the shop\nBut everything I got, on that bitch stolen\nHad a grill but couldn't afford the wheels\nHad paint, but it wasn't candy\nKick endo to try and get that dough\nWhole family know, so they couldn't stand me\nRun and tell your mama, come get your son\nMama like damn, what the hell he done\nBrother had bricks, but didn't give me shit\nSo when he went to the pen, I ain't send him shit\nMama at work, so I ran the house\nRay on lock, so now I'm the boss\nTurn that face up like the Mary Jane\nI was slanging 'caine, got us all kicked out\n\n[Hook]\n\n[Outro: Game]\nFrom Compton, all the way to Chi-Town\nBack on down to Houston, Texas baby\nTrae The Truth, Z-Ro, Slim Thugga\nPaul Wall, Common, Kanye West, and The Game\nJesus Piece\nEither you got one, you want one\nOr you bout to rob a nigga for one\nSo what it's gon' be nigga?\n(Gun shots, laughs)", "image": "https://images.genius.com/2377b35c4be48c418d9b99b8e5eb85a2.500x500x1.jpg"}], "artist": "The Game"}