{"songs": [{"title": "Let Me Be Me", "album": "Kendrick Lamar EP", "year": "2009-12-31", "lyrics": "[Intro: Kendrick Lamar]\nEverybody, just clap your hands if you're real\nMiddle finger up, give a fuck how they feel\nBe yourself, just show me you're real\nMiddle fingers up\n\n[Hook: Kendrick Lamar]\nJust let me be me\nThat's the only way I know\nJust let me be me\nThat's the only way I know\nThat's the only way I know how to hold it down\nThat's, that's the only way I know how to hold it down\n\n[Verse 1: Kendrick Lamar]\nI just wanna be me\nNo disrespect, but motherfuck you\nMy education stopped at a high school degree\nBut I can outsmart any high IQ\nDraped in some fly shit, call me Jeff Goldblum\nCold, my style making my nose run\nOh, I stare at the mirror then realize, that real lies within me\nSome say I'm crazy cause I think like I need a shrink\nAsk too many questions about the stars and Earth shit\nRather be in the studio than out buying drinks\nSo if I'm not clubbing, don't think I'm on some jerk shit\nAnd California on that jerk shit\nBut I'd just rather 2-step, like my first steps\nJill Scott on my iPod, as my head rests\nYes\n\n[Hook: Kendrick Lamar]\nJust let me be me\nThat's the only way I know\nJust let me be me\nThat's the only way I know\nThat's the only way I know how to hold it down\nThat's, that's the only way I know how to hold it down\n\n[Verse 2: Kendrick Lamar]\nAnd yeah I know I'm from Compton, Cali\nBut I don't lace up Chucks or rock tan khakis\nAnd skinny jeans ain't quite the lick\nI probably would wear 'em but my dick don't fit\nHa ha ha, I like to joke, got a sense of humor?\nStill face, play me short like an oompa loompa\nYou ain't gotta screw up your face in front of the kids\nWon't you lighten up like Michael did?\nI grew up with killas man, people who killed men\nBut my character never could be like them, man\nAnd they respect that, say that I'm real man\nNot a fake person, that's the Sims man\nLive my life through some film, man\nI ain't acting out shit, I be packing out shows\nCause they know that they don't know Kendrick fo' sho\nAnd oh\n\n[Hook: Kendrick Lamar]\nJust let me be me\nThat's the only way I know\nJust let me be me\nThat's the only way I know\nThat's the only way I know how to hold it down\nThat's, that's the only way I know how to hold it down\n\n[Verse 3: Kendrick Lamar]\nAlmost lost my life to the industry\nHad to look through a photobook to remember me\nThese label heads ain't nothing but bullshit\nHave you with professional killas, chasing hits\nLying to yourself, all over an image\nMaking records they want, that was wrecking my brilliance\nMy Mama said, \"Boy, that don't sound like you.\"\nI said, \"This is the sound, though.\"\nMy only excuse\nQuite frankly, dusted off my shoes with my hankie\nAnd kicked it like he skate, make these motherfuckers hate me\nThe reason why they hate, is cause these motherfuckers ain't me\nAnd you can underrate me, but I know what I'm worth\nA diamond in God's dirt, a diamond in winter\nWatch the Simpsons and eating some cereal for dinner\nSee I give you my life, to mix it up in a blender\nTo make sure that you feel me\n\n[Hook: Kendrick Lamar]\nJust let me be me\nThat's the only way I know\nJust let me be me\nThat's the only way I know\nThat's the only way I know how to hold it down\nThat's, that's the only way I know how to hold it down\n\n[Interlude: Female Voice Speaking]\nKendrick Lamar, what are you trying to say?\nWhat are you trying to accomplish Kendrick Lamar?\nKendrick Lamar. what are you trying to say?\nWhat are you trying to accomplish Kendrick Lamar?\nKendrick Lamar, is this really you?\nIs this who you are? What are you trying to say?\nWhat are you trying to accomplish Kendrick Lamar?\nKendrick Lamar, who are you?\nWhat are you trying to accomplish Kendrick Lamar?\nKendrick Lamar, What are you trying to say?\nWhat are you trying to accomplish Kendrick Lamar?\n\n[Verse 4: Kendrick Lamar]\nI think that I finally reached the pinnacle\nOf finding myself as an individual\nThe world is so typical\nI just wanna be higher than that\nI used to want to be the messiah of Rap\nInfatuated with becoming a relevant star\nTrying to say goodbye to the glamorous chains and cars\nThat I never had, but wrote it in my raps to make you mad\nVanity, they say that it can damage me\nSo do I really want it?\nIf I didn't, I guess I'm a cool cocaine connect\nThat means I'll be frontin'\nCooking in a laboratory, hoping I can tell a story\nThat the whole world can feel, like the ones that came before me\nKnowing that I'm misunderstood\nSo I gotta get my point across like a snitch would\nAnd I would never walk in the shadow that never was really there\nOr try to fill the shoes of an invisible pair\nAnd Dave said he proud of my newfound honesty\nAnd all I could say is, \"Will the radio care?\"\nYeah, or should I say no?\nOr should I just stop and come with a whole new approach?\nYou heard my hip-hop when I was 16 years old\nWell that was me then, now I'm an adult\n22, like the smallest of guns that you know\nMost determined, but with the smallest of funds to show\nBut I'm not worried\nMy talent should take me places I've never been\nThe world should turn as soon as my records spin\nI wanna be the highest, on top of all the bullshit\nThe negative you bring, the stress, the violence\nThe capital punishment, the loud police sirens\nToo focused, one word, righteous\nAnd this is Kendrick Lamar, and soon ya'll know Cloud 9, ya'll\nThat means I wanna be the highest\nToo focused, one word, righteous\nThat means I wanna be the highest\nToo focused, one word\n\n[Outro: Female Voice]\nToo focused, too focused, one word\nToo focused, too focused, one word\nToo focused, too focused, one word\nToo focused, one word\nToo focused, too focused, one word", "image": "https://images.genius.com/de49545ec6453e829bb3ff6d34d088db.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}