{"songs": [{"title": "When They See Me", "album": "Grow Season", "year": null, "lyrics": "[Intro]\nYeah\n(Green Lantern)\nIt's young Wiz\nUh-huh\nA lot of niggas hatin', you know?\nIt's young Wiz\nI'm doing this Pittsburgh shit\nPutting it on the map\nUh-huh\nYeah, uh-huh\nIt's young Wiz\nUh-huh\nA lot of niggas hatin', you know?\nIt's young Wiz\nI'm doing this Pittsburgh shit\nPutting it on the map\nUh-huh, you know\nBut I ain't worried about these niggas I got mad\nYou know? Them motherfuckers look stupid as hell\nI'm out here gettin' money, 412\nLot of niggas mad\nI see y'all niggas when I pull up\nYeah, they be like —\n\n[Verse]\nGoddamn, that's a fly young nigga\nThe smoke smell different, that's a high young nigga\nAnd I heard he work hard, got a half-million rhymes\nAnd my bitch hit his MySpace a half-million times\nI laugh and get high, gettin' straight to the money\nAnd keep my goons 'round for any fake nigga want it\n'Cause niggas out here see you eatin' and take yours\nThat's why I'm in the lab and Big Breeze got the 8 for\nA lot of y'all ain't got no cheese\nNothin' better else to do, that's why you talk 'bout me\nI'm always on your girl mind, she think a lot 'bout me\nBut if it ain't about the money then it's not 'bout me\nI be in 11:30, leaving out 'bout 3\nShawty ain't givin' me nothing, kick her out my 'vee\nI live like a young rap star\nGrind like a trap star\nCouple came at the kid\nBut they ain't make it that far\nV.I.P., that's what I'm sitting in the back for\nRollin' up grape, pull it straight up out the glass jar\nPuff, puff, puff\nAnd blow a little smoke out\nSkinny little nigga, but my pockets all chunked out\nA lot of y'all on my shit now didn't\nThink Pittsburgh had a chance 'til they heard young Wiz\nSo I came and I put the city's name on me\nNiggas got the nerve to hate on me —\nFuck y'all\nI'm ridin' down the parkway doin' a buck, dawg\nA bad little bitch, and somethin' to puff on\nAll you hatin' motherfuckers got somethin' to suck on\nJust let a young'n do my thang, and I'm gone\n\n[Interlude]\n(Yeah man, this nigga wanna try to come at me the other day\nTryna hate on my man Wiz!\nI had to shut this nigga down from the door\nLet him know, man, that nigga's hot right here\nThat nigga's the truth\nQuit hatin' — Fuck outta here)\n\n[Outro]\nI always stay fly\nNiggas get mad if I come by\nWhen they see me\nWhen they see me\n(Weeze)\nYeah...\nMy money gettin' right\nThey got jealousy in they eyes\nWhen they see me\nWhen they see me\n\n[Producer]\n(Please be clear: This is an invasion\nGreen Lantern in the lab\nThe Invasion, Green Lantern\nIt's a fuckin' invasion you bastards)", "image": "https://images.genius.com/b0673dfc8e451f01ab36cb28e28673e6.500x498x1.jpg"}], "artist": "Wiz Khalifa"}