{"songs": [{"title": "Mouthing Off", "album": "Incognegro", "year": "1999-05-16", "lyrics": "[Verse 1: Ludacris]\nI make niggas eat dirt and fart dust\nThen give you a eighty dollar gift certificate to Pussies \"Я\" Us\nI eat the whole pie and leave nothing but the crust\nSo you can feel what it's like with instinct, but no guts\nA sack with no nuts or a mack with no sluts\nGive me a full-body massage, I still can't be touched\nThey call me Seymour Butz, 'cause I get more ass than most\nThey say I'm Next and got that Butta Love, and get Too Close\nFollow the leader 'cause I'm meaner than abdullah oblongata\nMy Tribe's on more Quests than Midnight Marauders\nIt's all piña coladas, no cops and robbers\nTaking trips back and forth from here to the Bahamas\nI hump more than llamas, get rolled more than tires\nIf you say I'm not nice, then you's a motherfucking liar!\nEntitled to your opinion, into the next millennium\nSo many Major Coinz that I thought I had Amil-ion\n\n[Verse 2: 4-IZE]\nYo, I am going to blow up the Earth\nWith my Q-36 Explosive Space Modulator\nBuddha be praised, you meditator\nDrop Squad interrogator, 85 percent regulator\nThe Educator and the Almighty Creator, dedicator\nThe separator of fiction, I spark friction\nSmoking \"Hay\" without the Crucial Confliction\n4-Ize prescription, microphone, Jackie Stallone\nPsychic prediction, Egyptian description\nOf my physical, my flesh is weak and it's pitiful\nSpiritual is hooked up to the invisible\nUmbilical cord of my Lord, Kumbiya Devine Kah\nRemove paper of tar from every cigar\nI slap authority like Gabor, Zsa Zsa\nHalf Allah, Half Antichrist Superstar\nRocking the microphone with a hand like Dr. Claw\nWhile I'm hitting trees harder than Sonny Bono\nDouble Dragon, mixed up with an Abobo\nI kill villains in slow-mo for talking crazy in my dojo\nGot nothing to lose, like I'm a boxcar hobo\nWhen I get Ludacris with Bridges on the promo\nNiggas wanna clown, I'm Homey and Bozo\n'Cause in the Grand Prize Game, my Life Calling like Jo Jo\nThe name sticks like pogo\nI keep it realer than alien autopsy photo\nYou similar to a Spice Girl going solo\nYou lost like BeBe, or a dog named Toto\nMy statue of liberty is Rebecca Lobo\nWe Cop Robo, Virgo\nBust ass like a motherfucking homo, como estas?\nTony Del Negro, built to destroy these kids' blocks of Legos\nL'eggo my Eggo 'cause I say so\nHold the microphone, 4-Ize, I stay gifted\nManifested, elevated, I uplifted\nThe elevator, the escalator, \"That's not a knife?\nThat's a knife!\" Crocodile Dundee, the alligator rustler\n'Cause I hustle ya, under the China\nBig Trouble, little sewer, but still I find ya\n'Cause I'm stinky, manifest, throw you down the stairs like a slinky\nYo, my third eye is blinky", "image": "https://images.genius.com/9ea8d719979b4d9e52d89271c9e0b7da.1000x1000x1.jpg"}], "artist": "Ludacris"}