{"songs": [{"title": "Fat Lady Sings", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "1995-09-08", "lyrics": "[Intro: Raekwon w/ others in background (\"Dred\")]\n{I'm tired of them muthafuckas down the block\nEvery time I come outside, them niggas ---}\nAiyo, some major station radio {aiyo, come on, hurry up}\nGet the joint, {hurry up, son}, kill all those niggas man\nWe going Ricky Retardo on them niggas\n{Everybody just shut the fuck up\nI'm tired of using this muthafucking grenade right now}\nWhat you seen stupid?\nYou don't even know what you talking bout, man\nYou fabricating the wrong shit, man\nBoth of them niggas were stand up niggas, man\nNiggas went to war! You know how it go\nIn order to be a general, nigga, you still gotta be a soldier (Gotta\nKill ya bloodclot)\nSpeak about what happened then, man, for real, fuck it, aiyo --\nCheck this out, man, what niggas is doing over here, man?\n(Why you think ya gangsta?) Yo Dred, man, word up, man\n(Why ya'll dont know nothing) This is ours, man, we own all this right here, man\n(Who you? Who ya talk about?) Straight up, man, we know how real it could get\n(Who ya talk to to?) But it's gon' be repercussions\n\n[Verse: Raekwon]\nPunch broke the Dred's jaw, pulled the four out\nAnd went off, told him that he can't sling his raw\nWhen he fell, yo, he broke his wrist, his bangles flew off\nHis Balley's was scuffed, then he blew a kiss\nBleeding out the side of his ear, niggas was staring\nAnd the silk shirt was ripped off, Punch cut his hair\nRazors was bloody, he kept hitting, Dred grabbed his shirt\nShowing his stomach, the kid had zippers on him\nBitches was flipping, they grabbed Tasha, caught her for a Louis\nSnatched her titties right up out the bitch bra\nNo selling over here, Jack, heard the Dred mumble\n'You be dead in a week' then he stumbled back\nLittle young Keyon rushed him, yeah, shorty was a vet\nGillette soldiers, shorty hit the neck\nBlood squirted, look like laundry detergent, the Dred fell out\nRight from there, he gon' need a surgeon\nYou ain't dead yet?\n\n[Hook x2: Raekwon]\nThe fat lady sings, the fat lady sings, the fat lady sings\nThe fat lady sings, the fat lady sings, the fat lady sings", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}