{"songs": [{"title": "Power", "album": "Immobilarity", "year": "1999-11-16", "lyrics": "[Introduction: Raekwon]\nTake it off, sho' 'nough kid\nTake it off\nWe gon' take it from the East to the West\nTo the North to the South\nShow y'all what it's about\nDon't make me throw no gun in your mouth\nYou know?\nHow long is your CREAM? This long?\n\n[Verse 1: Raekwon]\nEh yo, his belt got karats in it\nSwift description, E-320 nigga pitchin\nRock a raw dinosaur chain, hang to his thing\nIt's like, he pump isolated, still cashin in CREAM\nNiggas in the hood hate him, drew a vase of him\nBlaze 'em, he actin like Shallah raisin him\nThis is hydrogen, son ain't live as him\nHe like Maguyver in the chin 4 spies with him\nRoll relentless, desert that he hold is a gift wish\nShash the list, give his miss dick\nTechnique, operation: tech scream\nBet CREAM, them alligators jet like a vet's wing\nNigga like Nicolas Cage with the gauge in your braids\n2 cannons that'll spray, rockin banana suede\nSuck this drunk alcohol dick\nFuck y'all niggas with hits\nWe bout to shit on y'all shit\n\n[Verse 2: Baby Thad]\nY'all brothas wanna call us out?\nName names, otherwise it'd be the best to shut the fuck up\nGet pimp-smacked up, jacked up and macked up\nYou're scared and froze of bein exposed\nI own Harlem, I bone Harlem, call me the mayor\nIt's my borough, you don't want no problems\nI'm on now, you dead pop, all jokes aside\nI ride the top, you glide the bottom\nPitfall, 5 foot 9, my dick, balls\nShit y'all, leave flat line to stick your's\nWe flip off basic and brace it\n8 kills, 47 ways to taste it\nNever understand what you never been told\nYou did your book bitin off of my scrolls\nWe hit man, Colombo, coats and hats to match\nBust off quick, and then, guns go back\n\n[Verse 3: Superb]\nI move like Arthur Ash against God\n4 raquets, 8 balls and no practice\nEvery cypher's a heated discussion\nThe industry was like a beat that needed precussion\nI brun the music, shit that make crews flip\nState that I'm the illest, this is Q.U. shit\nI used to heat-hole, now I'm takin over like the repo'\nBitches that roll, Cee-Lo that'll sniff a kilo'\nWe went from franks and beans to shanks and greens\nNow we drive our Navigators to banks in Queen's\nY'all can't fuck around, your words ain't right\nEvery time I touch the mic, they say \"Perb ain't right\"\nBut that's the truth though, d'oh, infact that's it\nWhen they drop this shit, I'm gon' cop that shit\nThe new star, you want me? I'm at the juice bar\nY'all once hap' niggas, give me 2 stars\n\n[Verse 4: Chip Banks]\nI heard what y'all rappin about, but bring your stash out\nYou shouldn't throw rocks if you livin in glass house\nSneak your weak shit at us, on the low though\nWhere these cats come from, speakin about po'\nWe got cash to cop it and crash it {*car crashing*}\nBut half of y'all cats just catchin up to Rae' last year\nGot guns in the jungle, call 'em Jurassic\nThe chrome, the steel, the 20-shot plastic\nWhile y'all niggas cop jars, me and my niggas cop bars\nGettin head from rock stars\nWe blowin everything apart, I'm smashin the charts\nHow I see it? (Yo, how you see it?)\n\n[Hook: Raekwon]\nEh yo, what you wanna be when you grow up?\nYo, I wanna be a leader\nSlow your speed up and stop tryin to be us\nSay somethin always, got a future? Stay out the hallways\nAnd get yourself right, a 100 more ways\n\n[Verse 5: Rhyme Recca]\nFly like iceberg, nice with verbs, precise words\nBently swerve, hit the curb, jump out, cock back, spit out\nShut your block down, get out, criminal route\nGangsta shit, can't talk now, gun in your mouth\nCream Team killas, cacoon cats like caterpillars\nGiant size gorillas, break niggas backs from the skrilla\nScratch, greenback track, Fed's berserk\nThat's my word, disrespect Recca, get what you deserve\nInferno, melt down mic's, millionaire in my afterlife\nBroke bread with Christ on the last night\nApocalypse, sleep with 4-5th, 2 clips\nPassport, cellphone with the removable micro-chip\nSpecialist, 40-karat Sicillian necklace\nMatching bracelet, Cream Team crisp the basic", "image": "https://images.genius.com/d8508796401925d32124cc47a45641d8.500x500x1.jpg"}], "artist": "Raekwon"}