{"songs": [{"title": "Freestyle from Funk from Hell", "album": null, "year": null, "lyrics": "Excuse me...\nHa ha ha ha haaa\nGot the Chronic and shit, it's mixed with the bodies bags and shit\nFun-Dac-Spoc comin’ down (Three times!)\nHuah! Yeah! Smoke the Chocolate Time where the Chronic meets the Ganja---ARGH...\nWord is Bond (Ma nigga Redman!)\nSmoke the Chocolate Time where the Chronics mix togetha\nRoll it up, roll it up\nMa nigga D Down, roll it up! (One time...)\nMa nigga D Rap, roll it up! (Two times...)\nWord is Bond\n(?)\n\nI'd be that jailed mothafucka comin' down with sex\nMothafuckas I’d be burnin' just like wet Kotex\nIf you wanna be me The MC, The R&E\nNext stop in this movie, guess what's starring? Me!\nYou wanna check my resume? Yes! I'm that type of nigga that be breakin' your bitches' vertebrae\nI'm down with ma man Ron G, me and Keith'd be sippin’ on Dom P\n\nWhat you gonna do all you fake mothafuckas in the back?\nIf you representin’ then, let me hear you gun clap\nOne time up in the air if you just don't stop!\nIt’s that Nemma commin' down, robbin' you for Ces crops!\nAnd Beatbop, real Hiphopers, wanna flock to this? You can't rock to this\nMC’s wanna test my steeze? I'd be puttin' holes in body like your body was cheddar cheese!\nNow subliminal criminals I'd be desmolishing, MCs be waxin' and polishin' their rhymes\nBut I stay with the ruggedness, the toughness, the roughness and brokeness\nI'm comin' out tha freestyle straight out the brain, smokin' Buddha on the A Train\nWell I'd catch you to tha (One fifty fifth to safe nick and get a nick?) for 2 clips\nBut I used to smoke Abulas, but now I'm just chillin'\nIt's that nigga' I give ya'll tip ya feelin'\nIf you wanna feel this read funk the 5 stacks commin' down tonight, get bitches that smack\nIt they, wanna rob me for my cash, bitch you can kiss the back of my ass! Straight...\nAnd tell your moms to get me corn braze on my liquorous, hickorous, liquory dot\nI'm comin' down with the hip hop, rob your crews for Ces crops\nComin' down and represent The Hip Hop!\nAnd Def Squad we don't hear nuttin', you can hear our shit bumpin' all the way out the Comptom\nAnd wax, blow your blocks comin' punk cock, stock, stack with raps\nComin' with'em, I'd smack your raps, flip the script\nIs that nigga I flip keys if I flip a Benz, yess\nI got mad and crazy friends, we like to rob mothafuckas and stick suckers and jam like smuckers\nYou wanna do? And I ran through your whole fuckin' crew just like the flu\nThe Funk Docta' Spoc got shit lock, all you bitches can suck a bold of this, a tip of this cock\nI'd be the mellow-ous Jenness juice drinker, wanna get down?\nUsed to thinka I turned your pinka', turned your blinka'\nIf you wanna turn left\nIf you wanna step to me Redman's past deaf\nI'm just seized, I'd slide in you without grease!\nPlus, I gettin' down lyrical bop bop bop bop...\nDown with ma man Ron, G wanna get down drinkin' Dom Pérignon?\nBombing mothafuckas like in lived in Lebanon, said it!\nWanna get down? USI un let it's cut back, gun straps\nHit ya ass from tha back when I have to come in stacks\nBlow the whole frame off the train one time...\nI'd be that nigga flowing your brain and blowed your mind (...) up the stacks\nRepresent the uptown connection, If you wanna get down I'd be bustin' in your section!\n\nFuck that, Def Squad rappa' Zip\nPlus Redman is extra swift\n(Big Shack, Big Gene, ma nigga Stiff Ill, you know the deal...)\n(Hot shit, two thousand shit...)\nEnjoy!", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}