{"songs": [{"title": "Tequila (Tequila Sunrise) - Spanish Edit", "album": null, "year": null, "lyrics": "Sen Dog:) Pa la salud!\n(B-Real:) Pa la salud... primero yo\n(Sen Dog:) Primero usted... (Ayygghh!)\n(S-D & B-R:) (grito mexicano)\n(B-Real:) Cometelo joven...\n(Sen Dog:) Cometelo jajaja!...\n\n(Sen Dog)\nAqui estoy con mi barrio, listo a hacer feria\nCartel Cypress Hill esta en tu area\nColectando queso alla en Mexico\nDonde el sol quema duro y baja despacio\nTengo mis camaradas y todo esta bien\nTengo una mansion en tierra que mide cien\nY todos se den cuenta vengo a hacer tranzas\nCon mucha libra aqui estoy pa La Raza\nMe ven en mi ranfla con todos los Hierro\nCuidando mi negocio con todo mi perro\nNo trates nada tengo mis soldados\nEspiritu asesino, vienen preparados\nRaperos desperados es nuestra tema\nEl dicho de nosotros: Agarra la crema...!\n\n(Chorus x2:)\nTequila Sunrise, con los ojos rojos\nUn dia vamos a morir, escandaloso!\n\n(B-Real)\nNunca conoci dinero asi, en mis manos\nHasta que conoci un camarada como hermano\nNo importa donde miro tiene a todos asustados\nCorriendo por cubre, con mas que vende 'marrados\nPero como un querieron me enseno la foto grande\nAsi vendiendo drogas jamas, nunca andes\nNo como rateros que no entienden, no comprenden\nNo pases anos torcido con placas en tu frente\n?Entiendes?\nMe dio una copa y tome, el sabor malo del gusano\nMejame dandome lecciones\nMe cacheteo y dijo: Mira, eres mi mejor paisa pero nunca me miras\nHas lo que digo y te hago rico chico\nRatas duermen en hoyos, no me cruces o te pico\nQue no se te olviden las reglas del juego\nTe van a conocer hasta que quemes en el fuego\nMujeres falsas y dinero no va\nComo tomando, manejando, mi hermano te mataran\nQuedate alerto a lo que esta alrededor\nEsas cosas que te dije van a ser tu matador\nTenlo todo en orden la plata no va a parar\nRecuerdate de mi y siempre vas a ganar...\n\n(Chorus)\n(B-real)\nTequila Sunrise, Ayayay\nTiempo vuela rapido, hijo y by surprise\nMi vana se murio y a mi me dejo\nCapitan de las movidas aqui digo yo\nTragate el gusano cabron, soy el maton\nSi no me matas te mato a ti como un ladron\nConfia en nadie, vengo pa tras\nY jamas me cruces a mi porque yo tengo mas\nMe recuerdo lo que dijo Jesus:\n'Si quieres el dinero, paisa, tienes que ser primero'\nQue te peguen mis palabras, esta listo pa morir\nA todo tiempo, porque si no vas a sufrir...\n\n(Chorus)", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}