{"songs": [{"title": "Breakin’ Old Habits", "album": "Duets: The Final Chapter", "year": "2005-12-20", "lyrics": "[Intro - T.I.]\nHey what it is pimpin\nSlim Thug and T.I.P. doing it B.I.G with B.I.G (yea a ye yeaah..)\nYa understand what I'm saying (hey..)\nP.S.C. pimpin!\nY'all already know what it is man, its a bad boy thing man\nGrand hustle collaboration, Y'all already know man\nBoss Hog whats happening (hey..)\nA-Town pimpin!\n\n[Verse 1 - Slim Thug]\nSlim Thugga!\nI roll strapped Glock 40 in my lap\nI rap but still think like I'm grinding in the trap\nTrying to adapt to the change from the streets to the game\nCan't be selling CD's and still selling dem thangs\nCause snitches drop names and bring alot of problems\nAnd putting somthing in they head the only way you gonna solve em'\nJackas stay plotting watching your every move\nAnd the minute you snooze will be the minute you lose, dude\nThats the rules so I cruise with the tools\nTo fix the damn fools that think I'm slipping with my jewels\nBreakin old habits so hard to do\nThats why you see me on the same block with the same crew\nAnd everybody sitting fat living good\nAnd I'm the only nigga that be rapping in my hood\nI was raised by the hustlas, and ganged by the G's\nAnd taught by the bosses how to stack that cheese\n\n[Hook - T.I.]\nYou got rich and G shit is still a part of you\nCause breakin old habits so hard to do\nYou still watch for the haters and the robbing crew\nCause breakin old habits so hard to do\nWhen on shot that nigga like I started to\nCause breakin old habits so hard to do\nFresh out the dealership crackin open cigars in the coupe\nMan cause breakin old habits so hard to do\n\n[Verse 2 - The Notorious B.I.G.]\nDamn it feel good to see people up on it\nFlipped two keys in two weeks and didn't flaunt it\nMy brain is haunted, with mean dreams\nGS's with BB's on it, supreme schemes, to get Richer\nThan Richie, quickly, niggas wanna hit me\nIf they get me, dress my body in linen by Armani, check it\nMy lyrical carjack, make your brains splat\nHigh caliber gats is all I fuck with, now peep the rough shit\nIn my circumfrence, mad bitches, with mad lucci\nBulletproof vestes under they coochie\nSpittin my uzi, don't lose me, my trigga niggas represent\nDrivin dirty in J-30's gettin bent\nAnd to my hit hoes, my murder mommies\nI be smokin trees in Belize when they find me\nWhile you still killin niggas with punany, like Connie\nAnd Cyrus up in Cypress fuck you raw, you on the floor with the virus\nWhile I just, slang coke, smoke pounds to choke\nGot lawyers watchin lawyers so I won't go broke, now check it\nThem country niggas call me Frank White\nI'm squirtin off in my loft of course I know my shit's tight\nSunrise open my eyes no surprise\nGot my shorty flying in with keys taped to her thighs\nWith all the utensils, who hang my china thing\nShe half black half oriental eighty-six she got me rentals\n\n[Hook]\n\n[Verse 3 - T.I.]\nI used to drive a Chevy Monte Carlo, bricks of blow all in it\nI was taught to sell the shit, you put your nose all in it\nLet my bitch drive the Benz but the Rolls off limits\nHow you call yourself pimpin, with hoes all in your buisness\nWhat it is, the music business or the streets make a decision\nI do this in my sleep, and you way out your division pimp\nThis game we play for keeps, and the rules remain hidden\nThis ain't a place for lames and that snitching shit is forbidden\nAfter sitting in the kitchen and whipping with hopes of getting back\nAll that off a brick to go blow it, so it even 50 stacks\nAnd now I'm sitting back, thinking about a time\nWhen a nigga get a 100 g's, think he went down\nBut now look for loyalty in the game, it ain't there\nAnd things ain't the same they changed it ain't fair\nReal niggas dead, doing their time and ain't here\nYou commit the same crime and come home the same year\n\n[Hook]", "image": "https://images.genius.com/09b1732dbce927085a1fca7538fc1bb3.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}