{"songs": [{"title": "Ason Jones", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "[Intro: Raekwon]\nWord, I miss you, I miss the God\nWord... a powerful brother, man, he was live\n\n[Verse 1: Raekwon]\nHe was a powerful general, the smell from his breath was Ballantine\nI think it was the year '89\nHe stayed the freshest, Polo boots, wallies with them colorful 'Lo gooses\nComing from Medina, we boost\nWe up in A&S, slipping and dipping to Bedstuy\nNative, he used to beatbox, thousands'll listen\nYo, that's before, the Wu got on, him and Allah Just'\nAnd RZA came to the Island one morn'\nA nigga could dance to slow music, outdrink any nigga\nOn the benches, while we hitting reefer, he sold loosies\nFive foot seven, a legend was born, Russell 'Ason\" Jones\nI know him for his braids and lessons\nA wise man with knowledge 120, kept a flag on his chest\nA right hand, you quick, serving you Remy\nYo, let's toast to the fallen, lost forgotten\nAiyo, if niggas could hear me, then roll up some broccoli\nAson, the heart of a lion, a purified mind\nThe way he did it, with a mic and some wine\nI would never forget the days we used to sit back\nDays I be all up in the crib, listening, holding, align him and yo\nI just miss this nigga\nAnd now I understand the meaning of love, when I kissed the nigga\n\n[Interlude: Ol' Dirty Bastard sample]\nMy name is Ol' Dirty Bastard, youknowhatimsayin?\nI don't hide nothing back, I barely, I mean, I come from a family, man\nOf poor welfare, youknowhatimsaying?\nWhen I came out my mother's womb I was on welfare, youknowhatimsayin?\nSo so so it's like, you got to keep it real, nahwhatimean?\n\n[Verse 2: Raekwon]\nHe had a heart of gold, intelligent soul from day one\nLoud as the ferry, best friend was momma Cherry\nSweet lady, BK baby, she taught Dirty\nHow to cook, clean, singing the songs, say the\nOld school dances and O.E., Ballantine, the wine\nWe sip, while we sat with the O.G.'s\nKnowledge of self, good health\nThe fortunes that came with the game, had my brother insane\nIt's like wealth ain't enough to live for\nBut if you got love in your heart, just believe in yourself\nThat was the black man rap, baby Jesus in the black Land'\nFew jewelry pieces with his gold fangs, his fam\n(Brooklyn Zoo) you know my brother was ill\nThe first dude to say, \"Yo, keep it real\"\nYeah, the lover, the father, the hustler, the rap professor\nNow he with Allah, that's a blessing\n\n[Interlude: Ol' Dirty Bastard sample]\nSee, it's like, ok, where I come from\nIn my neighborhood, my people know me\nYou know what I'm saying? See, if I try to come any different\nThey ain't gon' respect me no more\nYou know what I'm saying? Because they -- you know people\nGot their thing about themselves, you know\nIf you come from the neighborhood, you know what I'm saying?\nYou couldn't, you couldn't get out the neighborhood\nBut you could never take the neighborhood out of the people\nYou know what I'm saying, but if you try to like jump and crossover\nTo the other side, people won't understand that, and they don't like that\nThat's why they don't be buying people music\nSee, we keeps it real, and we always gon' keep it real\nYou can't knock what's real, You know what I'm saying? We telling the truth, man", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}