{"songs": [{"title": "Wolf", "album": "Back to the L.A.B. (Lyrical Ass Beating)", "year": null, "lyrics": "[KRS-One]\nThat's right\nUp and down, up and down we go\nBeatminerz on the track, I'm conducting the flow\nReverse flow, you get wolf if you didn't know\nEither way when I play I'm a beast at the show\nLike yeast I will grow, to the East I'mma go\nAnd increase what I know, bring relief to my bro\nI keep in the dough, but my feast I don't show\nI keep on the low and I reap what I sow\nWhen it's time for the concert I creep in the show\nSometimes I walk in off the street to the show\nGrab the microphone, bring the heat to the show\nHip Hop, I teach it if you're seeking to know\nThe introduction to the course is perceive what you know\nWhen Hip Hop is what you perceive, leave, you can go\nOthers make rap but they don't need what you know\nYou a divine speaker, what you need is to grow\nBelieve me, I know, I see how it go\nAll the doors are shut till you reaching for dough\nBut if everything's for sale then he is a ho\nAnd if everything's for sale then she is a how\nI do things freely, I don't believe in the dough\n\nUp and down, up and down we go\nMr. Walt, Evil Dee, KRS on the flow\nAny time, any place, rhymes ready to go\nEdutainment from the pavement, man you already know\nNever starving, we go, never crawling for dough\nWe that orthodox Hip Hop that all of you know\nMan I lived through the ballers, they ain't balling no mo'\nThe arenas, the theaters ain't calling no mo'\nThe budgets from the labels ain't falling no mo'\nThem big gold cables are pawned at the sto'\nThem cats now thinking yo \"What was it all for?\"\nTwenty platinum plaques, you still can't tour\nAll over the radio, you still can't draw\nNow listen back to your lyrics, what was that all for?\nWhen you had the opportunity you could've spit it raw\nBut instead wanted head from the lips of all these whores\nNow you fifty-four and you don't spit it no more\nYour jams in the clubs, they don't rip it no more\nHead in the bed, you don't get it no more\nNow you starting to think \"What I'm living for?\"\nThat's when you see KRS is on tour\nI do a two-hour show, he's spitting one more!\n\nYo, let me show you what a legend is\nI rhyme as KRS, Krazy Rhyme Stylist\nYou better keep your eye on this, ain't none higher than this\nThese clubs don't stop hiring Kris\nTime for the light to shine\nToo many rappers rapping and they even fight for the right to rhyme\nI'm nice with mine, I'm precise with mine\nAs you can see I don't need ice to rhyme\nYou a biter, I don't even like your kind\nThe rhyme you spitting now might be mine\nYo, what they doing here if they don't like to rhyme?", "image": "https://images.genius.com/7124063b9019b7aa2798bff144643c27.500x500x1.jpg"}], "artist": "KRS-One"}