{"songs": [{"title": "Really and Truly", "album": null, "year": "2019-09-03", "lyrics": "[Intro]\nMm\nYeah\nLet me get it from right here\nLa Musica De Harry Fraud\n\n[Verse 1]\nShe'll never be the same, once she give me the box\nLook at my chain and the ice on my watch\nCopy on the Gram all things that I rock\nBaby, I'm the man and your nigga a flop\n\"Damn, Khalifa man, where you been at?\"\nProbably with your bitch, fucking where you pay rent at\nIf it's a race then I'm finna lap you\nI'm in the gym everyday but I'm not finna scrap you\nI'm too high to get violent\nI'd rather smoke, find a bitch that I can ride with\nFake niggas, I don't vibe with\nI'm getting paid, so the bank is where you find me\nAnd a Playa, that's what I be\nMakin' moves, stick and move like Ali\nReal nigga, don't try me\nI wear my own and a nigga ain't gotta sign me\nGang\n\n[Interlude 1]\nTss, I was kicking it with this one bitch, man\nI was over at her house and shit\nShe was, on my motherfucking nerves\nAnd I'm like \"Man, what the fuck is you even talking about?\"\nAnd I'm runnin' out of weed and shit too\nThat's the wrong time to fuck with a nigga like that, man\nHold on, baby, let me get my phone\n\n[Verse 2]\nHold up, I gotta call a new bitch\n'Cause I'm a gangsta and you be on some bullshit\nShe like \"Naw, you leave me, imma lose it\"\nI'm like \"Bitch, you just love me 'cause my music\"\nShe like \"Naw, I fuck witchu since way back\nI can't even believe you would say that\"\nI'm like \"Girl, you know what it is, you know the biz\"\nShe like \"Naw, they don't come as real as this\"\nShe rolled the weed up, cook and cleaned the crib\nSoon as we leave the club, I be in her ribs\nShe's like \"Think you ever meet a better bitch?\"\nI fucked her one more time and got in a win\n\n[Interlude 2]\nI can't even lie, that shit was great\nShit, and if I ever need it again\nImma call you\n\n[Outro]\nRoll some, smoke some\nRolling Papers II\nRoll some, smoke some\nRolling Papers II\nRoll some, smoke some\nRolling Papers...II", "image": "https://images.genius.com/b15a7a3f6cd968108322d49a5fd4ba25.750x750x1.jpg"}], "artist": "Wiz Khalifa"}