{"songs": [{"title": "War Witch", "album": "A.I.R. (Art Imitates Reality)", "year": "2016-08-29", "lyrics": "[Chorus]\n\n[Verse 1: B.o.B]\nYeah. uhh\nI just adjusted my method\nThey try to muddy my message\nAnother corrupt one elected\nAnother new puppet selected\nThis ain't a fairly tale, yeah, far from an urban legend\nIn a war propaganda can often be used as a murder weapon\nWhat's the direction we're headed in?\nCan't get arrested and not get neglected\nGuessing my presence is threatening\nPut you on game and they try to discredit it\nThanks to the Internet we can see racism isn't as dead as they said it is\nSerious as getting beheaded\nThey edit the footage then go off for beverages\nOh me, oh my the keys unlock the closed mind, huh\nFee fi fo fum, I see the beast close by\nBut an eye, for an eye, for an eye, for an eye, for an eye\nSoon we'll all be blind, over time, over time, over time\nBandz\n\n[Pre-Hook]\nWeed don't get me high like it used\nThey say I don't sound like I used to\nBut an eye, for an eye, for an eye, for an eye, for an eye\nSoon we'll all be blind, over time, over time, over time\n\nHook\n\n[Verse 2: B.o.B]\nUnited Savages of America, huh\nCorruption, extortion, torture, et cetera, huh\nLooking for war that we can declare on ya\nLike, \"Hmmm, we can just control this whole area\"\nOverbearing clutch\nCountry run by billionaires'r'us\nEvil predator\nDon't want the beef if it ain't rare enough\nPolice scared of us\nPropaganda and hysteria\nWhat's in the dairy truck\nCrops and produce sprayed in fairy dust\nBudget cuts like an uppercut from the upper class\nAll they serving is plates of suffering succotash\nI know someone in power, someone behind the mask\nWhen I find someone, imma whoop someone ass\n\n[Pre-Hook]\nIs what you're asking for really what you are ready for?\nIt's time for action and that is not a metaphor\nI know someone in power, someone behind the mask\nWhen I find someone, imma whoop someone ass\n\nChorus\n\n[Verse 3: B.o.B]\nUhhh, I respect your silence\nBut I won't comply with tyrants\nOr confide in dead messiahs\nBy now you know a lot about me\nNothing's ever private\nWhatever you're looking for in life you'll more than likely find it\nGuns, drugs, sex, basically everything but guidance\nMost of our life we guessing shit\nThe rest is left to science\nThey just give you the dots\nBut see, you gotta connect the right ones\nThe rope is around all of our necks\nBut in the hood it's slightly tighter\nThe cause of death is bias\nBecause if you get shot then DaQuan did it\nIf a flood kill you then God did it\nGet assassinated, then the mob did it\nYou don't know the killer unless a cop did it\nWe treat our problems how we treat our criminals\nWe lock them long as we can so we don't have to deal with them\nRain bandz\n\nOutro", "image": "https://images.genius.com/11ae3edafaaa28a2f6849c517716ab12.500x500x1.jpg"}], "artist": "B.o.B"}