{"songs": [{"title": "The Plan", "album": "O.N.I.F.C.", "year": "2012-12-04", "lyrics": "[Intro: Juicy J & Wiz Khalifa]\nI'm gettin' high as fuck in this, trippy niggas\nMust be some real shit though\nLet's get it, hear we go\nI looked in the mirror today\nAnd seen the realest nigga I ever met in my life\nHahahahaha, uhh\n\n[Verse 1: Wiz Khalifa]\nI done smoked weed where they said I can't\nGot rich when they said I can't\nGot high and got on the plane\nAnd brought all my niggas when they said I can't\nWent shopping places they said I can't\nBought some shit that they said I can't\nJumped on the road and did all them shows\nCause I was poppin' places they said I ain't\nWent hard in places they said I can't\nPromoters call and try and set up dates\nBought the car with that yellow paint\nGo to parties now and they set up drinks\nAnd it's first class, so I'm private plane\nNudie jeans with my get up mane\nRolling papers and Mary Jane\nI made 11 mil' and I'm still the same\n\n[Hook: Wiz Khalifa & Juicy J]\nWhat's with all these niggas and their feelings, man?\nAll of this and I'm still the man\nThought of this when I was just a fan\nBut all this money wasn't in the plan\nNow it's all about them Benjamins\nBallin' hard and you in the stands\nAll this money, I'm a business man\nOut of all these niggas, I'm the realest man\nWhat's with all these niggas and their feelings, mane?\nAll of this and I'm still the mane\nThought of this when I was just a fan\nBut all this money wasn't in the plan\nNow it's all about them Benjamins\nBallin' hard and you in the stands\nAll this money, I'm a business mane\nOut of all these niggas, I'm the realest mane\n\n[Verse 2: Wiz Khalifa]\nOut of all these niggas, they callin' me the realest\nStarted underneath the floor, now my money through the ceiling\nAlways staying on my grind, turned nothing to a million\nUsed to just tryna live, now a nigga make a killin'\nGold Rollie on my arm, ten rings like a don\nCuban links in my chain, Zigzag on my charm\nChampagne on ice, good weed in the jar\nEverything Hermes, Chanel seats in the car\nWhen you all know them fuck niggas start hatin'\nTalkin' 'bout what they gon' do but I'm waitin'\nWhen you getting rich, they doubt you, but shout-out my gang\nAnd my brother Will cause I couldn't do this without you, fo' real\n\n[Hook: Wiz Khalifa & Juicy J]\nWhat's with all these niggas and their feelings, man?\nAll of this and I'm still the man\nThought of this when I was just a fan\nBut all this money wasn't in the plan\nNow it's all about them Benjamins\nBallin' hard and you in the stands\nAll this money, I'm a business man\nOut of all these niggas, I'm the realest man\nWhat's with all these niggas and their feelings, mane?\nAll of this and I'm still the mane\nThought of this when I was just a fan\nBut all this money wasn't in the plan\nNow it's all about them Benjamins\nBallin' hard and you in the stands\nAll this money, I'm a business mane\nOut of all these niggas, I'm the realest mane\n\n[Verse 3: Juicy J]\n18 racks, I pay the dough, to send them goons straight to ya door\nTo show you niggas what's real, and let you meet that .44\nRun your mouth, you in the trunk\nGlock to your head, nowhere to run\nCatch you niggas when you by yourself\nWe gon' hit you niggas with a hundred drums\nBoat load, no babbage, good drank, I'm famished\nBank account outlandish, big real estate, sittin' on land, bitch\nNiggas out there tryna test me, I put the AK where his chest be\nDon't fight with hoes, don't fight with niggas\nNo security, bitch, so don't test me\nDouble cup full, I be sippin' up\nMob niggas, man, real criminals\nIf a nigga find you, they gon' hit ya up\nWith a Bin Laden chopper that'll split ya up\nAll these hoes be jockin' tryna get with us\nThey gon' swallow this nut, no spittin' up\nYour niggas get murked, your niggas in jail\nMy team gettin' money stay filled with drugs\n\n[Hook: Wiz Khalifa & Juicy J]\nWhat's with all these niggas and their feelings, man?\nAll of this and I'm still the man\nThought of this when I was just a fan\nBut all this money wasn't in the plan\nNow it's all about them Benjamins\nBallin' hard and you in the stands\nAll this money, I'm a business man\nOut of all these niggas, I'm the realest man\nWhat's with all these niggas and their feelings, mane?\nAll of this and I'm still the mane\nThought of this when I was just a fan\nBut all this money wasn't in the plan\nNow it's all about them Benjamins\nBallin' hard and you in the stands\nAll this money, I'm a business mane\nOut of all these niggas, I'm the realest mane\n\n[Outro: Juicy J]\nI'm the realest mane, I'm the realest mane\nI'm the realest mane, I'm the realest mane\nI'm the realest mane, I'm the realest mane\nI'm the realest mane, I'm the realest mane\nI'm the realest mane, I'm the realest mane\nI'm the realest mane, I'm the realest mane\nI'm the realest mane, I'm the realest mane\nI'm the realest mane, I'm the realest mane", "image": "https://images.genius.com/33ab790859f8f1a0a8e408ee23962e6c.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}