{"songs": [{"title": "Y’all Gone Miss Me", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "{*fades in*} .. {y'all gone miss me}\nYeah y'all gone miss me\n{*harmonizing*} Never miss what you had 'til it's gone\nYeah, y'all gone miss me\n{y'all gone miss me} Yeah, y'all gone miss me\n\n[Snoop Dogg]\nHmm, who that nigga that brought you that gangsta shit\nBefo' you motherfuckers was even ready for it?\nShowed you how to tie a flag on your head\nAnd represent your motherfuckin set 'til you're dead\nBust on the cops while I cuss the Feds\nRoll a joint, in the bathtub gettin head\nPut the G in the P, flipped the G to a ki\nPut the West coast back on the map bay-bee\nCheck my styles, check my files\nI've been gangbangin since I was a juvenile\nThey cut me loose in nine-deuce I swore to tell the whole truth\nKeep it gangbang 100 proof\nE'rybody say, \"Ay Snoop\" - did Death Row pay me?\nLook here young loc, shit it's all to the gravy\nI really can't trip off the past, on the real I had a blast\n2Pac, rest in peace and God bless all my enemies\n\n[Hook: KoKane]\nRain-drops, falling on my head\nFuckin with them haters, messin with my bread\nTalkin bout the raindrops, fallin on my head\nFuckin with them haters, sleepin in my bed\n\n[Snoop Dogg]\nAin't No Limit to this shit, ain't no gimmick\nMaster P good lookin out homeboy, salute my Lieutenant (at ease)\nI'm in it knee deep and can't creep no more\nI had to move down South on the low-low, fo' sho' doe\nDippin through the woods with Fiend, Magic, Pokey\nMystikal, V-90, C, Boz and P (ya heard me?)\nWindows on tint, ridin like the President\nIt's evident, shit I'm doin good (yeah)\nI moved out the hood like I should (say what?)\nAnd then they had the nerve to call me Hollywood (nigga what?)\nBut I don't give a fuck, if I'm misunderstood\n20 Crip don't slip, yeah it's all to the good\nYeah the homies got twist too, whatchu say?\nOh the homies might get me? They'll get you\nListen here, don't try it, and don't deny it\nAnd don't pay 'em no mind Dogg, man I'm tryin\n\n[Hook w/ variations]\n\n[Snoop Dogg]\nJust when you thought I was gone, I'm back on\nKnick-knack-paddy-wack give the Dogg a home\nWith a gang of pitbulls, rottweilers and doberman pinschers\nBonafied killers\nThe illest, cap peelers, that you ever wanna meet\nStraight up out the ghetto where they pack the heavy metal\nI got my hand on the wheel, my foot on the gas pedal\nI'm drivin DoggHouse to the next level (woof)\nAnd buckin two shots at the devil\nRun up on his ass, and blast, like a rebel\nTurn up the treble cause I hit you with the bass\nRemember my name and remember my face\nRemember these words, and remember the taste\nAnd remember, we all gotta leave this place\nI'm tryin to stay focused, I'm the loc'est in the game\nThe Rap Prime Minister, \"Mr. G Thang\"\n\n[Hook Two: KoKane]\nRain-drops, fallin on my head\nFuckin with the wrong folks, messin with my spread\nTalkin bout the raindrops, fallin on my head\nMessin with my ba-by, who's sleepin in my bed\n\n{*harmonizing to fade with interjections of \"y'all gone miss me\"*}", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}