{"songs": [{"title": "I Didn’t Change", "album": "Originals", "year": null, "lyrics": "[Intro: Kurupt]\nBlack flood, feel me\nYeah, slice (slice)\nBonzi J. Wells, Kurupt Young Gotti, nigga\nFeel me, real talk, gangsta\n\n[Kurupt]\nMy life, my family - they hate me\nThey wanna execute me, fuck around and shoot me\nDamn, do I gotta change my whole mind state?\nThrow a brick up, new nickel to eighth\nI gotta go to a different world\nCuz right here is a motherfuckin nightmare\nIt's Young Gotti, I'm always the motherfucking underdog, dawg\nWait a minute, I got a question for y'all..\nDo families turn there backs over emotions or acts?\nTurn their back over emotional acts?\nDo they fall in emotional traps?\nDo it transpire into emotional collapse?\nFrom nickel's and mac's, over bread and bitches, poetics and rap's\nOr who they choose to do business with or perhaps, we talkin bout family\nI can't believe my eyes, it's the stand up, fall and rise\nAll cuz how cuz I'm fuckin with Blood\nOh this niggas hot cuz I'm fuckin with cuz\nOh this nigga got problems because of this\nHe read an article and thought a nigga tried to dis\nWhen we was young we use to roll like a all nighter\nThen roll a pimp game kicked in and popped collars\nMe and one of my brothers use to be the tightest group\nUntil this motherfuckin day, we the tighest group\nI can't help it if a nigga make a sudden change\nWould it be a different game if it wasn't change?\nWould we be as close as we was in '93?\nI can't help but think a little bit differently\nI can't help but think we might even be closer\nWe use to be back to back holdin toasters\n\n[Chorus: Kurupt]\nI didn't change..\nWhen y'all niggas wanted to stay - I didn't change\nWhen things wasn't going our way - I didn't change\nWhen y'all niggas wanted the verse\nThe shoe was on a different foot and the roles reversed - I didn't change\nWhen niggas use to call us wack\nLike \"Fuck the Westcoast\" and never call us back - I didn't change\nWhen niggas was talkin shit\nTalkin bout they ain't fuckin with us - I never changed, nigga\n\n[Interlude: Kurupt] *scratched*\nGive me mines, give me mines nigga\nThis is for the homies\n\"It was ninteen nintey three\"\nBlaze that shit up\nThis is for the homies..\n\n[Kurupt]\nI'm about to change motherfuckin rules\nHere first like wild motherfuckin bulls\nI'ma make something for niggas to link about\nAnd leave the whole hood with something to think about\nI can't help but think a million times a day\nA nigga got about a million things he gotta say\nI never been the type to beat around the bush\nMy big homie introduced me to Benz's and cush\nGod grant me the strength to go the length, the width\nWith a little bit of that and a bit of this\nIt's fucked up that a nigga that I barely know\nWould give it up to me but my homies won't\nMy success pattern is in a constant shake\nIt's like film making without no film to make\nIt's like hang gliding but I can't hang\nAnd now niggas tryin to kick me out my game\nAll because of where I choose to lay my hat\nAll because of where a motherfuckers at\nI'm feelin like I'm falling like dead leaves\nIt like I'm swingin from vines like Tarzan\nI'm about to take another trip to Tarzana\nPop something for a motherfucker to go bananas\nRack up the gauge, cuz I can feel it coming\nIt's the heater home in the summer, I feel it coming\nMy kids my main priority, you thority, agility, ability\nMy tranquility to toss a typhoon at the moon\nHurricane spread through the saloon like alien goons and harpoons\nI could do this shit by myself\nI'd rather be read then be placed back on the shelf\nI'ma motherfuckin G, nigga, forever til I die DP, nigga\nI love y'all cuz..", "image": "https://images.genius.com/186a868c4b9286adc3fdb5fbe1f24250.450x450x1.jpg"}], "artist": "Kurupt"}