{"songs": [{"title": "Pac’s Life Remix", "album": "Pac’s Life", "year": "2006-11-21", "lyrics": "[Intro: L.T. Hutton]\nUh oh, uh oh, oh! Oh! Oh!\nThey ain't ready for this\nLT Hutton, Snoog Dogg, T.I\nIt's that new Pac yall\nUh oh, let's get it, Oh!\n\n[Hook: Snoop Dogg]\nPac's Life (Yeah, uh huh)\nEverybody talk about Pac's Life (And you ain't even know the homie)\nBut what do you know about Pac's Life? (What you know about Pac's Life?) Yeah\nEverybody talk about Pac's Life (Outlaw, Outlaw, yeah)\n\n[Verse 1:  2Pac]\nStarted with five shots, niggas plottin' to kill em'\nNever figured that, that same nigga'd sell five million\nHit the charts like a madman nothin' but hits\nCourt cases got a nigga facin' multiple digits\nDodgin cop cars look at how we come so far\nPicture high school dropout rollin' the double R\nHouse full of happiness weed and drink\nWay out sortin' trouble tryna find me king\nNever pictured livin' longer than my twenty-first\nThought I'd be locked down, cracked out or in the dirt\nAnd though it hurt's to see the change\nIt comes with the fame\nWhy we gossip in the silly games\nTo all the motherfuckers speakin down on me -\nThis is the night, Why is everybody caught up in Pac's Life\nTo all ya'll niggas, conversatin' on my life\nMind your motherfuckin' business!\n\n[Hook: Snoop Dogg]\nPac's Life (Yeah, uh huh)\nEverybody talk about Pac's Life (And you ain't even know the homie)\nBut what do you know about Pac's Life? (What you know about Pac's Life?) Yeah\nEverybody talk about Pac's Life (Outlaw, Outlaw, yeah)\n\n[Verse 2: Snoop Dogg]\nWhen we first hung out together, I met you with the homie\nWe had no intentions of becoming homies\nBut at no time at all, you became my dog\nYou showed me how to roll blunts, we used to bounce and ball\nI was living on Wilshire in the penthouse suites\nHad my lil' cousin Daz hook you up with some beats\nIt was Outlaw, Dogg Pound, Death Row Records, man we tore up the town\nSnoop Dogg and Dr. Dre and now we got Pac, it felt like a drizzeam\nRemember when I told Suge to put you on the tizzeam\nAnd you know that I was true\nCause I took the focus off of me to put 'All Eyez On you'\nAnd we became the most hunted together, '2 of Amerikaz Most Wanted'\nAnd our relationship was genuwine\nWanna know how I know about Pac's Life? Cause was a friend of mine\n\n[Hook: Snoop Dogg]\nPac's Life (Yeah, uh huh)\nEverybody talk about Pac's Life (And you ain't even know the homie)\nBut what do you know about Pac's Life? (What you know about Pac's Life?) Yeah\nEverybody talk about Pac's Life (Outlaw, Outlaw, yeah)\n\n[Verse 3: T.I.]\nEy, what's happenin Pac' yeah I know we never got to meet\nBut we know all the same people so we got the speed\nYou taught me first -- fate nigga can't stop a G\nAnd all that shit you went through meant alot to me\nWatchin you lockin up with him, was a shame to see\nYou know crack in the business did the same thing to me\nI get along with real niggas, it's a lane to be\nTalkin' loud outta pocket tryna bang wit' me\nWell so I'm pullin' out my pocket, let it rain ya' see\nNow they all in the court room, blamin' me\nSee we lived the same life and represent the same struggle\nPower to the real nigga and death to the sucker\nMoney over bitches get to know em' before you love em'\nDeath before dishonor never talk to army trouble\nLive by the same rules, so my wrist's tattooed\nWith the same sorta' dude, with the same short fuse\n\n[Hook: Snoop Dogg]\nPac's Life (Yeah, uh huh)\nEverybody talk about Pac's Life (And you ain't even know the homie)\n(Why y'all niggas all up in my shit?)\nBut what do you know about Pac's Life? (What you know about Pac's Life?) Yeah\nEverybody talk about Pac's Life (Outlaw, Outlaw, yeah)", "image": "https://images.genius.com/7f0e7d35c3475ff32f884c7f54e6de7d.1000x1000x1.jpg"}], "artist": "2Pac"}