{"songs": [{"title": "Flashing", "album": null, "year": null, "lyrics": "[Intro: Dr. Dre]\nAftermath, gettin' money\nWest Coast get ya ass up\nYou know what this is\n\n[Verse 1: Bishop Lamont]\nCrusin' down the street, watchin' biatches roll by pimpin'\nYou, that's all I can think\nThey say don't drink and drive, so I drive while I drink\nPull out bare hair, albino mink\nFist full of (?), might make you blink\n(Flashing!) Like a Arab Shink\nNew denim, fine linen, from my head to my feet\nNew women, cool women, that's all I meet\nI hit 'em, you hit 'em, then rinse, repeat\n(Flashing!) They all love the freak\nAnd some or another, I got burnt last week\nI got (?) up in here, I gotta wrap up my meat\nSee it coulda been worse nigga, HIV\nAnd I ain't got Magic urban Johnson sheets\nSo niggas wrap it up, at least more than three\n\n[Hook: Bishop Lamont]\n(Flashing!) From my head to my toe\nBig chains make me glow, even with the lights low\n(Flashing!) What, you ain't know?\nEverywhere I roll look like a car show\n(Flashing!) Make it rain, pull them dollars out\nPimp swayin', picky rain, time to show out\n(Flashing!) Got gold in my whole mouth\nTop row, cost more than your whole house\n\n[Verse 2: Dr. Dre]\nIt's the high life, in them bright lights\nWith all stars on a hot night\nIt's nothin' but models on sight\nAll pausin' to let the paparazzi get the shot right\n(Flashing!) If you a boss, bitches raw, what?\nIt's like a model when she fucked up\nWhen she get drunk, she gon' wanna fuck\nDaddy girl, got a runway life\nShe got a June 5 flight, to drink all night\nWith some stars at the club, gettin' high as a kite\nBut when we pay the cost, get as high as you like\nAnd stay (Flashing!) The alcohol got along me\nShe wanna dance like a pussycat\nPanties and her bra like she posing for Baby Phat\n(Flashing!) Ya, here it is (Move that shit!)\nHere we go, get money (Push, Flashing!)\nWestside get ya ass up (Move that shit!)\nEastside get ya ass up (Push, Flashing!)\nWe pick 'em up, we put 'em down (Flashing!)\n\n[Bridge: Dr. Dre]\n(Flashing!) Your boy's back, you know what's up\nWest coast bossin'\n(Flashing!)\n\n[Hook]\n\n[Verse 3: Bishop Lamont]\nNigga, owe me\nNow that I got G's, nigga I'm a OG\nNow a OG, nigga I'm me, OG\nOver gold, overload, over go 'till my nuts fold\nI'mma need a neck brace, and a whole lot of comments for these hoes on MySpace\nFirst I need to see some ID\nCause you ain't seein' me on MSNBC\n(Flashing!) I'm a pussy predator\nBut not for young girls, that's that R. Kelly fella\n(Flashing!) Here comes the paparazzi\nPut 'em where the (?) be 'fore they spot me\n(Flashing!) Too late, camera in my face\n(Flashing!) Uh oh, there goes another case\nOops bitch, gimme some head\nAnd if you swallow you can keep the kids like K-Fed\n\n[Hook]\n\n[Verse 4: Snoop Dogg]\nHot shit, from the city of big lights\nWhere ever you look out it's a star\nWith their cellphones out, doin' bid'ness by the bar\nThey bein' (Flashing!) That shit that have you on the island\nWith money in the bank and you riding a real Stallion\nNow you flying to Venice, for Italian\nAnd you ain't goin' home until you blow a hundred thousand\n(Flashing!) Boss dogg baby, on that patron\nLong as you're riding with me, the party is on\nLook at how they shake it when they know their daddy at home\n(Flashing!) So many models, so much love\nRidin' with the boss doggy, so many drugs\nIn the air, it's gettin' foggy, we at the club\nSmokin' in the back, everybody gettin' bust\nStayin' (Flashing!) Ya, here it is\nWestside get yo ass up (Move that shit!)\nEastside get yo ass up (Push, Flashing!)\n\n[Bridge 2: Dr. Dre]\nWe pick 'em up, we put 'em down\nWe at the bar, another round\n\n[Hook]\n\n[Verse 5: Bishop Lamont]\n(Flashing!) Like that shit Kanye wear\nBut no purses, no scarfs or stars cut up in my hair\n(Flashing!) Diamond's sparkle when you stare front glare stop, you go blind looking over here\n(Flashing!) Carpal tunnel made us in the chair\n(Flashing!) I need a bandage from the damage and heavy wrist wear\n(Flashing!) Doctor says stop, but I don't care\nFuck I'mma floss till I'm out of here\n(Flashing!) I'mma ball till I'm gone\nThen I don't give a fuck, you can kick my bones\nI'll be buried like a Pharaoh\nDraped in the Deniro\n20 inch chrome on the whip, call it Will Ferrel\n(Flashing!) Blades of glory, I put \"Ice, Ice Baby\" on all my jewelry\nRobert Van Winkle, watch my watch twinkle\nBitch make a wish, I'm a star, what he ain't know\n\n[Hook (x2)]", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}