{"songs": [{"title": "Thug Love", "album": "Power of the Dollar", "year": "2000-07-06", "lyrics": "[Intro: 50 Cent]\nWhat y'all know about this fab shit, huh?\nTE, baby, come on, Trackmasters\n\n[Verse 1: 50 Cent]\nLook we can shop together, mama, his and hers\nFifth Ave. shit, baby, Fendi furs\nI ain't tight with the chips, girl, I'm down to splurge\nIf it's ice you like I'll light up your life\nVS2 Clarity, aight?\nI play the block, I ain't the type to punch a clock\nI'm the type to put the pedal to the floor in the drop\nI live life in the fast lane, I mix dro wit hash\nHustle hard for cash so I can spoil that ass\nIt's like she loves me, she loves me not\nCause her friends pump her head full of bullshit a lot\nI gave her jewels that I caught of a jux\nChanel bags I bought from boosters\nTo the hood I introduced her\nShe feisty, every now and then she wanna fight me\nPeople saying if I get knocked she ain't gon' write me\nThe sick part is all that bullshit excites me\n\n[Hook: Destiny's Child]\nA thug's what I want, a thug's what I need\nEven though my friends don't seem to see\nThat he lace me with money\nHe knows when I want it\nAnd I'm never gonna leave my baby\nMy thugged out no good baby\n\n[Verse 2: 50 Cent]\nAyo, I treat you like you need to be treated like you're special\nTie your hands to the bedpost when I caress you\nWhen I met you it was Guess and Gap, now it's Gucci and Prada\nTook you from being a nine to being a dime\nYou complain that we don't spend time\nWhen I'm OT on the grind going hard for mine\nYo, when shorty say she hate me you know she mean she love me\nWhen she play me close at the bar that mean she want some Bubbly\nSee my polying with another chick and shit get ugly\nShe wanna flip, threaten to run keys across my whip\nTry to burn a nigga with some hominy grits\nThat's how she on it, when I met her she was lowkey\nNow she wanna OD\nYou know me, I let her do her thing, son\nI say what I'm feeling, niggas say that I'm illing\nI sip Cristy so I'm pissy like a staircase in your building\nWhat?\n\n[Hook]\n\n[Outro: Beyonce]\nA thug is what I want and a thug is what I need\nAnd my friends don't understand how my baby laces me\nA thug is what I want and a thug is what I need\nAnd my friends don't understand and I think it's jealousy", "image": "https://images.genius.com/f29b6e681d1b1237ec06d01ab616992a.600x600x1.jpg"}], "artist": "50 Cent"}