{"songs": [{"title": "The Show", "album": null, "year": null, "lyrics": "* Slick Rick *\n+ Doug E Fresh. +\n@ both @\n\n*Excuse me Doug E Fresh.*\n+Yes?+\n*Have you ever seen a show with fellas on the mic Wit one minute rhymes that don't come out right?They Bite*\n+They never write! +\n*that's not polite! Am I lying? *\n+No, you're quite right!+\n*But tonight on this very mic you're about to hear*\n@We swear the best star rappers of the year So@\n+so+ *cheerio* +yo scream+\n@bravo also if you didn't know this is called the show@\n\n*ayo Doug\n+What?\n*Put your ballies on!*\n+Yo Rick I was about to but I need a shoehorn!+\n*Why*\n+ Because the shoes always hurt my corns!  +\n*6 minutes 6, minutes 6, minutes Doug E Fresh. you're on!*\n@Ah on ah, ah on ah, ah ah ah ah ah ah on(2x)\n\n+Here We go (Here we go) +C'mon\n(C'mon) (2x) +Yo\n\n+ Where's will and barr +\n*Well I don't know they're late\nTold 'em the time - oh, I forgot the date! *\n+Man You did it again oh, no +\n(Yo Here, we go c'mon, here, we go c'mon, here, we go did We miss the show?)\n+ No No, n-n-n-no we didn't (what) No\nN-n-n-n-no, we didn't (w-w-w-what) No +\nWe didn't well, don't get us wrong\n*Excuse me Doug E- excuse me Doug E- Excuse\nMe Doug E Fresh, you're on\nAh Ah on on, on, on, on, *\n\n+Well... It started up on 8th Avenue And\nI made up the name\n@ the Get Fresh Crew @\n+ It was me my, two dj's Chill Will and Barry B and, My Right hand man Ricky D\nI Used to rap and sing make sounds and things For\nExample here's, a telephone ring\n[ring Ring]+\n*Hello is Doug E Fresh there? *\n(No He's not in right now)\n+But Anyway no more delay Just\nCheck out the new style I display Now\nYou got to be fresh to rock wit fresh And\nI'm D-O-U-G-I-E Fresh And\nI'm know for the (sound effects) Not\nFor the (sound effects) The\nHuman beat box or the entertainer No\nOther title that fits me plainer In\nA passing generation I am a remainder And\nI'm also known as a beat box trainer\nCashing checks make sound effects And\nAfter I'm finish rocking Slick, Rick is on next (You\nKnow it) Slick Rick\n\n*Well here's, a little something that needs to be heard Doug\nI, was going downtown (+Word Rick?+) word (+Sure+)\nAll along no, one to be wit Step\nOn the D-train 205th, I\nSaw a pretty girl (so) So\nI sat beside her Then\nShe went roar like she was Tony the Tiger I\nSaid oh, no there has been a mistake Honey\nMy name's Slick Rick, not Frosty Flakes! (oh\nGolly, wolly) She was raising hell She\nSaid um, my, name is Maggie but you can call me Michelle\n\nMichelle, Ma belle Sont\nDes mots qui vont très bien ensemble Très\nBien ensemble\n\nSlick Rick and I'll rock the house you, know what I'm sayin And\nWhen I 'm on the mic there won't be no delayin Bust\nA move we, show and prove Hey\nYo, Doug, do, that record jam on a groove! *", "image": "https://images.genius.com/c919a00200647c646c275a32d9d66956.750x750x1.jpg"}], "artist": "Slick Rick"}