{"songs": [{"title": "I C Dead People", "album": "Ill At Will Mixtape Vol. 1", "year": null, "lyrics": "[Verse 1: Redman]\nWord is bond, Redman makes the kids run\nI'm seeing dead people creepin' on my income\nPiercing the ear drums, how the fuck he do it?\nGot little miniature Redmans, crawlin' into it, cause my\nBack against the wall get to actin' like a fool\nThat's what happens to students, when you keep 'em after school\nI stay a wild child, beef, bring it like \"Raow! Raow!\"\nMy guns go boom, boom, and your guns go pow pow!\nStill, I feel a chill, bumps in my body\nThe spirits of other MC's records in the party\nCause, me being, the man that I am\nI'm awfully hunted by them guns with wide lens on the scope\nSucka, you miss, I'm a get my laugh on\nYou fuck around and woke up, with the stash gone\nHow I spaz on niggas is ugly\nYou got the game fucked up on makin' the money\nSee I don't say I'm thugged out, but I know my choice\nBack up plans, got back up; if I blow my voice\nThat's why I'm Brick City, can't wait to put my niggas on\nTo see us perform, we sellin' out at Ticket Tron\nWhat I'm doing is wrong, but It lasts long\nYo, toast the niggas that passed on\nGet it while the gettin good, whole life with a grip\nCause when it's gone, that's it, that's it, that's it!\n\n[Hook 2X]\nI'm seeing dead people creepin on my income\nYou win some, you lose some, but you never run\n\n[Verse2: Redman]\n(Yo what's on, come on)\nRedman it's the war head; BOOM!\nNigga I don't die, I was born dead\nTop of the mornin' to ya, I wake up like a born loser\nThe world is my Bermuda; Triangle and I'm lost in it\nI'm hearin' voices saying \"Red, the wanna put holes in ya authentic\"\nI walk among winners and I put out work, nigga\nAnd I don't stop, until I squirt\nHaters hate on, you can tell the rest of the class\nI can see the evil in you, through a masculine task\nSmoke the greenest grass I live by the hand of god\nThat me, ya boys, or ya guns won't leave a scar\nYou niggas too hard and not ready to scrap\nKnowin' damn well, ya moms raised you better than that\nRedman the weirdo, I'm my own dirty clique\nWith 35 KO's nigga I'll make it 36!\n\n[Hook 2X]\n\n[Verse 3: Redman]\nThou shall not fuck with raw, Funk Docta\nTakin' ya breath when I drop ya\nI feel for you cause cats, try to test me\nYou a waiteress set of an MC, check please\nBeen waited way too long, now it's time to put Gilla on the map\nGilla on ya back, same Zombies, from Phila on attack\nNiggas want it back, Triggas on the map\nWon't stop me, I'm not a quitter that's a rap\nIf I was just broke you wouldn't notice me\nHa, Ha, but look at the bright side my man\nNobody really planned to fail, you really failed the plan\nGotta keep the bomb like an Israeli hand\nMy music's killa, your's girlie; Scram!\nI can hang out in the same place as my fans\nLet 'em touch me, feel how far that I swam\nLook in my eyes, ya noddin to sleep\nIt ain't a watch, as Eminem, providin the beat\nThat's why..\n\n[Hook 4X]", "image": "https://images.genius.com/269feb9a815361d5df2b9a0fae3113b1.959x948x1.jpg"}], "artist": "Redman"}