{"songs": [{"title": "Ashes To Ashes", "album": "Ashes to Ashes", "year": "2010-12-24", "lyrics": "[Hook: KC]\nSmoking and ride\nAnd I ain’t trying to hide it\nWe will get high tonight\nCause I am hooked on a feeling\nYeah I am hooked on a feeling\nIt’s nothing but the best straw last drop\nMake you feel like you can fly\nDo you do you do you do you do you\nDo you wanna fly tonight?\n\n[Verse 1: Rick Ross]\nOpa-locka airport talking G6\nIt’s me baby girl straight G shit\nNo disrespect but really you ain’t seen shit\n'Til you're 40,000 feet with the weed lit\nI once got a chance to fuck a stewardess\nHit her from the back flying over New Orleans\nShe was gorgeous name was Dolorous\nFather was a lawyer mother was a florist\nRose petals turned into YSL\nSo ghetto but  she turned me onto Jean-Michel\nBad bitch I am talking up and down\nCouple niggas she always fucked around\nBut the bond that we share nothing would compare\nWhen I bought my first beamer I swear that bitch was there\nSide on the line say boy a couple stacks\nDown payment and even all cover the tax\n\n[Hook: KC]\n\n[Verse 2: Rick Ross]\nIt’s hard not to kill niggas\nIt’s a full time job not to kill niggas\nMob on\nSo God bless all the real niggas\nSo many obstacles and stress for a real nigga\nNow it's on\nAll my haters turned to ashes\nDead and gone\nI handle mine with a passion\nAm I wrong? And we never kiss no asses\nGet your own\nAnd the reason we run the streets is to take care of your home\nA nigga better put his kid first\nBad karma\nLil' niggas putting in work\nFuck Harvard\nImpalas they wanna peel first\nOr a Charger\nAnd shorty want her titties done\nCertain doctor\nNew apartment in the inner city, smokin out\nI'm wit ? so at least gonna smoke an ounce\nI live this shit nigga it's not a fable tale\nCome and work for the boss, You know I am paying well\n\n[Hook: KC]", "image": "https://images.genius.com/aa7d5a9ab574e2c211041d1a3cd2e07b.1000x1000x1.jpg"}], "artist": "Rick Ross"}