{"songs": [{"title": "On One", "album": "Blood Moon: Year of the Wolf", "year": "2014-10-14", "lyrics": "[Verse 1: Game]\nLook stop going through my cellphone (Please)\nBae trippin', I don't know what the hell wrong\nBae dippin' she on some shit\nI got her Louis luggage packed for the longest trip\nI'm like girl, you ain't my baby mama (no), you ain't my girlfriend (no)\nAll up in the club, niggas tryna fuck\nHoldin' bottles up, get you caught up in that whirlwind\nI text her like \"King what you doing?\"\n\n[Hook: King Marie]\nI'm in the club feeling nice, I'm on one\n(I hate that I ever met you, I hate that I ever met you)\nBoy when I drink with you, I'm on one\nDamn it boy I hate you so much\n(I hate that I ever me you)\n\n[Verse 2: King Marie]\nYou can blame yourself, for doing it to me\nDamn I hate you so much, got me feeling like Kelis\nYeah, there's so many girls, to my left and my right\nIf I get one more drink, I'mma switch to the other side\n\n[Hook: King Marie]\nI'm in the club feeling nice, I'm on one\n(I hate that I ever met you, I hate that I ever met you)\nBoy when I drink with you, I'm on one\nDamn it boy I hate you so much\n(I hate that I ever me you)\n\n[Verse 3: Ty Dolla $ign]\nIn the club feelin' nice\nShe bet I roll the dice\nShe give me that wet wet\nI give her this pipe ooh\nI fly her out when I be out of town\nFuck her in the room with the speakers loud, yeah\nShe give me head on the highway\nShe say her favorite position is sideways, ooh\nFound out she ain't the only girl\nSent me straight to the voicemail\nI text her with a  \"fuck you at?\"\nShe hit back\n\n[Hook: King Marie]\nI'm in the club feeling nice, I'm on one\n(I hate that I ever met you, I hate that I ever met you)\nBoy when I drink with you, I'm on one\nDamn it boy I hate you so much\n(I hate that I ever me you)\n\n[Verse 4: Game]\nI know\nYou a dime piece, but I ain't no side piece\nAnd who this other nigga? Cause I got my side piece\nAnd I got my side chick, replacement killers\nThis baby sittin' Versace\nYou hate me bitch, but wish you sittin' beside me\nIn the 'Gatti, feelin' like Irv when I swerve\nWatch me murder the curb\nBet it murder your mind, she got words for you birds\n(I'm in the club)\n\n[Hook: King Marie]\nI'm in the club feeling nice, I'm on one\n(I hate that I ever met you, I hate that I ever met you)\nBoy when I drink with you, I'm on one\nDamn it boy I hate you so much\n(I hate that I ever me you)\n\n[Outro Skit]\nI thought you loved me?! You was my baby! My fuckin' cinnamon apple! My rose! You was always there for me! And you wanna leave me for some fuckin' dumb ass nigga?! For some dumb nigga!", "image": "https://images.genius.com/3c242f72b054b6d20e2e8fd97f060d73.1000x1000x1.jpg"}], "artist": "The Game"}