{"songs": [{"title": "Intro", "album": "When Disaster Strikes...", "year": "1997-09-23", "lyrics": "[Verse 1: Lord have Mercy]\nAs we approach the current time frame of 1997\nWith approximately two and a half years before the year 2000\nRepeatedly it has been reported that there will be a time soon approaching\nThat major disaster will be striking all levels of existence\nIt has also been reported that this disastrous thing will be approaching\nIn the form of many many, as in squad squad, as in Flipmode Squad\nIt has also been reported that everyone out of the many will strike\nBut this particular motherfucker will strike with an unmeasurable\nBlast and fuck up everything within his 360 degree radius\nWarning: Prepare yourselves! Store your food, stamp your paper\nBecause when this motherfucker gets here, it's about to get real fucked up\nFor everyone and everything, everywhere!\n\n[Verse 2: Dolomite]\nWell, Busta Rhymes, come over here and let me talk to you, son\nSee now, Dolomite just got back from some shit that you about to be in\nWell, are you prepared?\nI hope you are prepared nigga, 'cause you know this is album number two\nYes, more bitches than before\nThere'll be more bitches, more and more and more\nMore thirsty niggas tryin' to get inside your shit\nTryin' to throw your whole chemistry off\nOh yes, there's gonna be a lot more money\nYes, a lot more money than before\nSo son, don't you worry about none of that shit\nAll you gotta do is just slap your dick in the mouth of these bitches that don't wanna act right\nAnd put a hot one in any motherfucker that wants to get in the way of this power move shit right here\nOk son, all right Busta, enough of this shit talkin'! Let's be on our way\n'Cause when disaster strikes, there's gonna be a whole lot of motherfuckers pourin' in\nAll right baby, lets go!\n\n[Verse 3: Spliff Star]\nYo, yo, yo, yo, yo, yo\nLadies and gentlemen\nStraight from the motherfuckin' street corner\nGoin' out to all you motherfuckers, across the globe, on the return trip\nIt be the niggas, the niggas that live by the code of blood honor\nMy Flipmode niggas, ha\nSpliff bring you that shit to another extreme\nHere to hit you motherfuckers with a strike of disaster\nI bring on to you once again\nThe eight wonder of the world, my nigga Busta Rhymes\nAnd I be that nigga, that live nigga Spliff\nSpliff comin through right at you wherever the fuck you at\nFlipmode is the squad comin' through right at you\nWherever the fuck you at\n\n[Outro: Busta Rhymes]\nAyo, cut my shit off, get it off\nA-heh-a-heh, a-heh-heh\nHere we go again motherfuckers\nHeh, let's start this shit", "image": "https://images.genius.com/c81a637e4015a2a4f63a6790ebd3ee6f.1000x1000x1.png"}], "artist": "Busta Rhymes"}