{"songs": [{"title": "Shoot ’Em Up", "album": "Juice (Original Motion Picture Soundtrack) ", "year": null, "lyrics": "[B-Real]\nWho wants the wrath, it must be the hood\nWho's up to no good, and wishes a man would\nCome up and give him a reason to blast him...\nI wouldn't put it past him!\nHe's got juice, how long will it last him?\nHe's gettin back, at all the punks that harassed him\nAsk him (hey!) what's ya main hobby?\nHe'll say there ain't, nothin' like the motherfuckin robbery\nSo don't crowd me, cause yo I run shit\nYou know, homey that old top gun shit\nI got a slug comin' straight out the barrel\nFor your ass, if you wanna ask a dumb question\nCause I'm quick on the draw, click-click, punks drop\nNow your lives ain't worth shit!\n\nChorus: B-Real, Sen Dog (repeat 2X)\n\nShoot 'em up, just shoot 'em up y'all, yeah\nShoot 'em up, just shoot 'em up (SHOOT 'EM UP!)\nShoot 'em up, just shoot 'em up y'all, yeah\nShoot 'em up, just shoot 'em up (SHOOT 'EM UP!)\n\n[Sen Dog]\nSen Dog, never again will I bend\nNo letters of death, no threats, will I send\nSo I'm puttin an end, to all your dumb shit\n(dumb shit) dumb shit.. that, \"Holmes where you from?\" shit\nCause I run shit, my way, all day, I don't play\nCause it won't pay\nNiggas wanna play with the pistol, you make me get pissed though\n(YOU GET A FISTFUL!)\nMake you eat knuckles, feel your knees buckle\nStill feelin great when you're sleepin on the pavement?\nSave it! The beatdown, who gave it?\nSenen, no more explainin'\n\nChorus\n\n[B-Real]\nI've had it up to here with all the bullshit\nFinger's on the trigger and I'm about to pull it\nGank hardrock, up the block, you know I rule it\nTo the punks around the corner someone's gonna catch a bullet\nTo the crew that wants to get with my program\nI'm out to get mine and ain't takin' shit from no man\nIn the neighborhood cause there ain't no brotherhood\nIn other words good if you heard that we're comin' up\nWe're out to make a quick buck, that's what I'm thinkin'\nAnd I'm smokin' any punk who even thinks of finkin\n\nChorus", "image": "https://images.genius.com/d26732d937e92b9a6b4d51ca8494f7f3.220x220x1.jpg"}], "artist": "Cypress Hill"}