{"songs": [{"title": "I’m Back", "album": "Undisputed", "year": "2012-09-11", "lyrics": "[Intro]\n\"Yeahhhhhhh, yeah-yeah\" (let these motherfuckers know!)\n\n[Hook]\n\"I'm back! To hold you\" (uh, uh, uh, uh, let 'em know!)\n\"I'm back! To hold you\" (uh, uh, uh, uh, let 'em know!)\n\"I'm back! To hold you\" (uh, uh, uh, then give it to me like!)\n\"Yeahhhhhhh, yeah-yeah\"\n\"I'm back!\"\n\n[Verse]\nI flip through the tracks to get to the wax\nLet these fucking cowards know I ain't slipped through the cracks\nDog back on the scene making a bunch of noise\nYou're a grown man, bring the brave boys\nMan these niggas is toys but I don't play with 'em\nSo if you got guerrillas with guns, stay with 'em\nMotherfucker we bang for war, we don't keep those things in drawers\nWhen it rains it pours\nCold blooded killers, the murderers is senseless\nTo ID, we'll need forensics, or a dentist\nFuck with D.O.G and you will be\nStraight up, D.O.A so R.I.P\nReal niggas slip, but bounce right back\nWent from an ounce to a brick like that\nCamera's always on so nigga might act\nLike they wanna fight, 'til I fight back\nI'm back!\n\n[Hook]\n\"To hold you\" (uh, uh, uh, uh, let 'em know!)\n\"I'm back! To hold you\" (uh, uh, uh, uh, let 'em know!)\n\"I'm back! To hold you\" (uh, uh, uh, then give it to me like!)\n\"Yeahhhhhhh, yeah-yeah\"\n\"I'm back!\"\n\n[Verse 2]\nScratch you to death, I'm a go getter\nThe rounds going, download more to Twitter\nSlugs big as my finger collect 4 on your vest\nAnd we'll still be able to play connect 4 on your chest\nOr I could hit 'em in the mouth and make this bastard taste\nNothing but lead, told you I'm a basket case\nYou call me acid face\nI spit lava, you better off smacking your father, don't bother\nWe're career criminals; we rob niggas\nDouble R for life, we mob niggas\nBitch niggas do what you do -- suck a dick\nFucking faggot, you've been off some sucker shit\nBack up in your face \"up in your grill\"\nGetting back up in that lab with a license to kill\nTell your mans and them to chill, if they don't want what you got\nThey thought they was fuckin with a gangsta but you not!\n\n[Hook]\n\"I'm back! To hold you\" (uh, uh, uh, uh, let 'em know!)\n\"I'm back! To hold you\" (uh, uh, uh, uh, let 'em know!)\n\"I'm back! To hold you\" (uh, uh, uh, then give it to me like!)\n\"Yeahhhhhhh, yeah-yeah\"\n\"I'm back!\"", "image": "https://images.genius.com/5e36caac869327ad8b5a01792f569aac.500x500x1.jpg"}], "artist": "DMX"}