{"songs": [{"title": "Open", "album": "Wins & Losses", "year": "2017-07-21", "lyrics": "[Chorus: Verse Simmonds]\nBaby, just open, like I got the password to your heart\nGot you wide open\nYou can open wide, you can take it off\nOpen, open, baby just open\nCan you keep it open?\n\n[Verse 1: Meek Mil]\nYeah, fucking you like I just got out the pen\nI got you open like I got the pin\nFly out the city and I'll fly you in\nGirl, yeah, she bought her homie and I got a friend\nShe throw it back, dirty whining again\nInstant replay, I rewind it again\nShawty bust it open, lay it down\nHad to brush up on it, tell her say it now\nNiggas hatin' on me, throwin' shade now\n'Cause I'm gettin' money and I'm paid now\nHad to run it up, on my way now\nOnly jealous 'cause them niggas lay it down\nGot her in a Maybach with her pants down\nPut the curtains up and put your head down\nDo a headstand, put your ass up\nIf the pussy good, I get a cash out\nIf you fucking with me, better answer\nBalling in the six like I'm a Raptor\nShe be only fucking with the trappers\nKnow the hatin' shit ain't gettin' past us\n'Cause you only told her that I only want to hit it\nPreachin' to the choir, you the baddest (Ohh)\n\n[Chorus: Verse Simmonds]\nBaby, just open, like I got the password to your heart\nGot you wide open\nYou can open wide, you can take it off\nOpen, open, baby just open\nCan you keep it open?\n\n[Verse 2: Verse Simmonds]\nShawty, keep it open like it's 7/11\nWe might make a scene and shoot that movie wherever\nI'm gonna write my name with my tongue, tongue, tongue\nAll over your body, yeah I know what you want\nKeeps them legs up in the air\nAll this room in the Panemera, girl, that's enough for me\nI know we just did it, like do it again, girl, that wasn't enough for me\nAll these tender kisses, all the way, girl\nThen I put them kisses below your waistline\nYou know I don't play around\nDo you better than the last time\nGoing it like Curry from the baseline\nTriple up and dip it low, lay it down\nHit it like I just got out of fed time\nGot her thanking mama for that ass now\nGot her thanking daddy 'cause you classy\nGot her thanking mouth 'cause you nasty\n\n[Chorus: Verse Simmonds]\nBaby, just open, like I got the password to your heart\nGot you wide open\nYou can open wide, you can take it off\nOpen, open, baby just open\nCan you keep it open?\n\n[Verse 3: Meek Mill]\nLil' fish talk (Ah ha ha)\nAh, told her that I would protect her\nWent to the jeweler, Patek'd her\nPatek Phillipe, she grabbing it deep\nShe caught it like OD Beckham, pause\nHad it, but she never let 'em, ah\nHit it 'cause I do it better, ah\nI'm in here, changing the weather, ah\nLevel up, change for the better, ah\nFuck around and be on TMZ\nPaparazzi popping when you be with me\nI be flexin' on 'em like it's GNC see\nGot that bomb, bomb, call you T.N.T\nOnly pom-poms when I'm ballin'\nTalking bron-bron when I hit the three\nGot you open when we coastin'\nTalking wraith talk when we rolling like\n\n[Chorus: Verse Simmonds]\nBaby, just open, like I got the password to your heart\nGot you wide open\nYou can open wide, you can take it off\nOpen, open, baby just open\nCan you keep it open?", "image": "https://images.genius.com/81840439724d85160b8680e7a021aa92.1000x1000x1.jpg"}], "artist": "Meek Mill"}