{"songs": [{"title": "Your World & My World", "album": "Shaolin vs. Wu-Tang", "year": "2011-03-07", "lyrics": "[Intro: Raekwon]\nYeah, yeah, let's go, nigga\n\n[Hook: Raekwon]\nThis is your world and my world, nigga, let's make a movie\nGet it jumping, hit the box office hard, get it pumping\nThis is your world and my world, nigga, hundreds to hundreds\nLet's burn, then fuck it, put our mamas up, keep 'em fronting\nThis is your world and my world, nigga, bust a nut\nGet a cut, then gettin' paper, by laying in the cut\nThis is your world and my world, nigga, we flyin' fly\nIn the bank, nigga, you know how we get down, thanks, nigga\n\n[Verse 1 - Raekwon]\nArm & Hammer boxes, we love foxes, leaning in the Tropics\nBlood money, boats is abnoxious\nStanding in the mess hall when, nose froze\nPosing like a king, I'm rocking New Balances, new silencers\nGlass table'll choke, twenty four challengers\nHalf of my niggas is slow, but they dough island\nYou know the pantries is full, ranches with bulls\nAnd wolves there, who sit around, fronting in Wu-Wear\nI slam a Noodles hat, pull hair, two tokes and Ghost\nIn a ghost, I be back in the wrong year\nLong sleeve, one cuff up, rugged gold teeth\nFronting with Colombian niggas who gave me raw meat\nDue to the gangstas that died, forever ride\nTo the rats in the manholes, who hate, niggas live\nBut it's all good, you from a poor hood, I guess\nBack in the Guess with the Champion hood, what?\n\n[Hook]\n\n[Verse 2 - Raekwon]\nGlass sculptures on my vultures, fifty cultures\nPlay the couch, posted, count your money, hide your toast in\nBlack tea, sucker free, ask me, clappers is free\nMetal knick knacks, get slapped in your hat, B\nI'm dynamic rec room potent, that'll blow you in the open\nPay a cop off, fly you your coke in\nMy house is worth 2.9, my Benz is worth, he want mine\nNowheres, we call that shit high heels\nDedicated heat rock sprayer, spray your mother and your lover\nBetter pay up, these guns is from Grenada\nWild fight, customized dice, get nice in the Trump Tower\nDrunk bitch, spaghetti and sliced\nEverybody features is that mean, never leave the lab\nLacking, always in the red, blacks and green\nDrug slingers turn into slug singers, one of them snitch?\nIt's just a gut lingers, laying in the mud\n\n[Interlude: Raekwon]\nSlimeball ass, niggas, man, for real, man\nStay away, man, knowhatimsayiing?\nGet that muthafucking, hater gator spray next to a nigga\nWe ready to zap one of ya'll niggas, with the quickness\nAiyo, Hav', man, these niggas don't know what it is, man, about hip hop, man\nThese niggas, man, for real, man, eat them niggas\n\n[Kung-fu sample]\nI got to admit that Shaolin boxing ain't that bad!\nBut, now watch mine!\n\n[Verse 3 - Havoc]\nYa'll niggas food, I peep that shit a long time ago\nDick rider niggas trying to front like they grimey, tho\nThis is my world, I just let you live in it\nBut the lease is up, you faggot niggas get evicted\nHow many times I gotta tell you cowards, mind your business\nOh, you still yapping? Time to catch 'em slipping\nDoing dirty, we don't mind getting our hands dirty\nAnd you can't fuck with any bitch because her ass dirty\nCuz when it pop off, we just up in shorty ears\nAnd you just stuck with it, and how us niggas got you there\nThat little bad caramel with the long hair\nGot you lined up, and caught in the crosshair\nNothing but bosses here, we enforced the fear\nAlways in the hood, my office there\nBlow a bag with my comrades, polly my next move\nAnd have you niggas bugging, how I wet 'em and crept through\n\n[Hook]", "image": "https://images.genius.com/bd1e2ea326f22bdcaa7332457249e1c5.1000x1000x1.jpg"}], "artist": "Raekwon"}