{"songs": [{"title": "After the Smoke is Clear", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro: Ghostface Killah (The Delphonics)]\n(After the smoke is done)\nYo yeah\n(Wu-Tang/Delphonics number one)\nYeah, what, what, who wanna do it, what\n(After the smoke is done)\nSlap fire outcha monkey ass niggas\n(Wu-Tang/Delphonics number one)\nWord up, big dick, motherfucking house\nWhaddup, bench press these cats, yo\n\n[Verse 1: Ghostface Killah]\nYo, god show these niggas how we get deep, down and dirty\nLike Keyon, got his wig pushed back, for 5 birdies\nYo they gotta hit placed on my head, what should the god do?\nMax out in Spain and do business with the Jews?\nNever that, don't ever look at me out of synch\nThe imperial, industrial king got weight\nDon't give a fuck, like the poor part we watch Hart To Hart\nThey used to push me in shopping carts, now I'm writing darts\nLike Ebenezer, the porno teaser\nSaying words like sheeba, ____ rapper valet the visa\nMy team got rides like Six Flags, plus the Wu lab\nCameras in nine bedrooms we own DATs\nDon't touch this crackling hot shit\nI snap ya shoulder blade in half, laugh and pop shit\nReader's Digest passed my book to L. Ron Hubbard\nIt got back that the world government tried to dub it\nBut devils love it, booby-trap raps cover the track like ADAT\nSharper than cuts laced on Marley\nScratched supreme clientele, my cartel\nWillie Stargel passed this shit his piece, where's the Nobel?\nOh well, signing off as usual\nThe arsonist leaving niggas lost in the stairwell\n\n[Break: Ghostface Killah (The Delphonics)]\n(Wu-Tang/Delphonics number one)\nYeah, yo, yo, represent my projects Stapleton\n(After the smoke is done)\nHe represent that project Park Hill\n(Wu-Tang/Delphonics number one)\nYou represent that project Murder West Brighton, Now Born\nArm banging into that will (ahhhhh), word up\n(After the smoke is clear)\nYeah, what, Stapleton\n(Delphonics and Wu-Tang still here)\nPark Hill, word up, yeah, yeah, New York\n\n[Verse 2: Raekwon]\nThe greatest story ever told by me, precisely\nRoman numeral IV plus three describe me\nMy son move like the toad, get drunk, speak in codes\nThrow a fiend in the sleeper hold, got beef with the globe\nMet my comrade, go half on this lab down in Baghdad\nFlipping like a meth's tab, get money like an Arab\nThe tight niggas snapped six legs on the crab\nNow hush, you wanna do what? My clique better bust\n\n[Verse 3: RZA]\nUnderprivileged, grew up in a Stapleton house village\nWhere blood flood the water in streets like oil spillage\nMy front door was blowing, the debt man spotted 55 boa\nNiggas was still flowing, voice was echoing\nI rise high like an octave\nThe proctor wouldn't gamble the sample, it shocked her\nMy ninjas run round like Shaka Zulu\nSome play peace like Ganj the Guru\nOthers live to be wise and old like Desmond Tutu\nUndisputed champion belt holders, shaped and mould us\nSoul controller of the lunar, solar or the polar\nI blow hash smoke through my nasal, my brain with worth 30 billion\nWu-Tang third battalion rush like Hannibal raiding Sicilians\n\n[Outro: The Delphonics]\nAfter the smoke is done\nWu-Tang/Delphonics number one\nAfter the smoke is done\nWu-Tang/Delphonics number one\nAfter the smoke is clear\nDelphonics and Wu-Tang still here\nAfter the smoke is done\nWu-Tang/Delphonics number one\nAhhhhh (Wuuuuuu, wuuuuuu)", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}