{"songs": [{"title": "Shooting Star", "album": "Along Came Joyner", "year": "2015-04-05", "lyrics": "[Verse 1]\nI get love down in Cali' like the homie Dre\nBut these hoes think I'm Snoop they won't go away\nThey should play this down in Compton with a cherry drop top\nThen everybody get to blasting till they blow the bass\nI ain't gotta say much bitches know the face\nJoyner Lucas got it tatted on the shoulder blade\nTry to Play me you just Skating on a frozen lake\nI just wanna put it in her mouth and make her poker face\nTell me did you take it for the night\nI know what you thinking I'm your saviour for the night\nI've been paper chasing till my bank be looking right\nI just need some motivation what you dragging for the night\nAnd don't be talking bout them other heads\nAsk about me I've been macking like a fucking crack\nBitches love me in the country like I'm a lieutenant\nI'm just honest with you don't mistake me for a fucking sac\nNah\n\n[Chorus]\nHomie I'm just what you made me I'm a shooting star\nGot a house on the headland and a million cars\nWe done came from the projects you know who we are\nI'm fine and on top of that livin' in the sky\nX2\n\n[Verse 2]\nBlack shorts and a tank top\nDead silence on the charm from the chain spot\nCouple dollas in my pocket they don't meen much\nI don't care for bragging you can have it I don't need much\nI remember i was just a nada\nShaggy with da holla back when bitches used to call me Mr. Labalaba\nNow I'm Mr. Popacala Mr. Drop a dolla\nNow I'm Mr. Master P Mr. Body Body\nI got bitches I ain't bored of yet call up Bizzo they gon hit me with the ?check\nI ain't even got chronic  it's the water bed\nThen she wanna fuck even tho she never saw me yet\nBut I told her don't be talking bout them other heads\nAsk about me I've been macking like a fucking crack\nBitches love me in the country like I'm a lieutenant\nI'm just honest with you don't mistake me for a fucking sac\nHoe\nFor a fucking sac\n\n[Chorus]\nHomie I'm just what you made me I'm a shooting star\nGot a house on the headland and a million cars\nWe done came from the projects you know who we are\nI'm fine and on top of that livin' in the sky\nX2\n\nJoyner\nJoyner", "image": "https://images.genius.com/e0f1ef72a727167faed7990bf3663ea4.800x800x1.jpg"}], "artist": "Joyner Lucas"}