{"songs": [{"title": "Acapella", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "A bullet in the head reminds me of the first time my nigga Pharrell came around me wearing that goddamn trucker hat\nTo me, that shit only looks good on you\nSo, goddamn it, I don't fuck with that\nNiggas is fucking lameos, I wanna see you dead\nFuck you mean, you ain't gay?\nYou get more anal than a sneaker head\nIt's Thanksgiving, it's turkey time, pick up an Indian midget\nFlip him and dip his turban in turpentine\nI'm fly, my mic is like a star\nLady Liberty herself can light my cigar\nI can't lose, come through with them bruisers\nWe all got furs on like we at the fight with Frank Lucas\nMy clip'll buck at you, I'll fuck a bitch, let her suck my dick\nYou? You sweat her, Cliff Huxtable\nY'all niggas tense in this bitch, you carry guns for self defense\nI play off-fence with this bitch\nI don't stop beefing until I hear sirens\nI'll eat you before I get a meal, like five wings\nYour momma got a kickstand on her fucking leg\nAnd she drink sizzurp, I call her Eileen\nI'm a hustler, clean you up\nIf I say that I'm flipping the bird\nIt doesn't mean that I'm putting my middle finger up\nWalking out with cash, every day, you bitch niggas\nY'all ain't shit, y'all just talking out your ass\nI'm like the 80's, ho, your wife nipple look like a little baby toe\nI'm 'bout to life the shotty, bullets hit your body\nIt's gon' be a long Talladega Night, Ricky Bobby\nI spit 100% pure, Whitney, Bobby\nFuck bitches, all I do is fuck bitches\nShe in my hotel room at 1, 1:10, she in the lobby\nThe pump's the shotty\nSo tell your momma find me in your city high\nAnd I'm prolly gon' be drunker than Robby\nI got a new college bitch, she be like:\n\"Yeah, we should get together sometime\nMaybe go to a party and dance.\"\nI said: \"Yeah, that'd be a no, cause I'm not a partying man\nBut I'll definitely still put you on the list for the party in my pants.\"\nI got a hustler flow\nFor fifty mil, I will drink Manny Pacquiao's blood\nAnd watch my muscles grow\nYou bitch, {gunshots} it's what you get\nI got a fetish for cheddar cheese, lettuce, and spinach\nI'm in the best fucking rap group ever invented", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}