{"songs": [{"title": "Perhaps She’ll Die", "album": null, "year": null, "lyrics": "Everything over?\nSounds can't be the end yet\nNah nah nah we can't go that route\nUh-ahh\nThat's what I'm sayin though!\n*applause*\nYeah, everyone gather round, gather round\nNow I'm gon' start it off first (why don't you start it off first)\nAnd you gonna follow me, it goes like this\n\nI'm lookin at this girl who's been livin a lie\nBut I don't know why she's livin a lie\n(Perhaps she'll die)\nI'm lookin at this girl tryin to be fly\nBut behind the scenes she breaks down and cries\nSee she breaks down and cries caise she's livin a lie\nBut I don't know why she's livin a lie\n(Perhaps she'll die)\nI'm lookin at this girl she's always high\nCause she likes to get by by stayin high\nShe's always high cause she always cry\nCause she's livin a lie...\nAnd I don't know why she's livin a lie\n(Perhaps she'll die)\n\nYeah, yeah you got it, here we go (check it out)\n\nI'm lookin at this girl wit her bloodshot eyes\nYou could really tell now by the size of her eyes\nShe got bloodshot eyes, cause she's always high\nCause she always cry, cause she's livin a lie\nBut I don't really know why she's livin this lie (here we go, one more time)\n(Perhaps she'll die)\n\n(Yeah, yeah) Last time, last time\n\nI'm lookin at this girl tryin to hide her face\nCause she thinks she looks bad and her life is a waste\nSee her face she hides cause of her bloodshot eyes\nCause she always high cause she always crys\nCause she's livin a lie...\nAnd I don't know why she's livin a lie\n(Perhaps she'll die) Rrrrrrrahhh!\n\nYou don't really need-a, lyrical teacha\nWhen I reach you through the particles and ways of the speaker\nWhat I got to say is positive and negative\nYou draw whatever energy you need to live, give and take\nBuild and destroy, life and death\nInhale, exhale, of breath\nThe point is yes, everything in life is a choice\nEast and West, wack rapeprs or DJ KRS-One\nDunn I come like the ancients with a drum\nCome along you can hum along or run along\nSing a song if you wanna sing a song\nThis meta-lyrical poet will surely put it on\nI don't wear or count of frauds\nBut I can prophesize by lookin in your eyes\nIf you're right or wrong, it could be all\nIt's always the little things that control the big things\nUndirected mind waves will bring a string\nOf unexpected anything until you cipher\nWhether niggative or negative you don't need either\nYou need to direct your thinkin through your speakin\nPrevent the negative from leakin out into the atmosphere\nDo I make myself clear? Achieve a major goal this year\nBut don't ever step here\n\n*DJing of 'Spark Mad Izm' by Channel Live and KRS-One*\nExpertism, is lyr, lyr, lyr, lyricism\nMy flow, my flow, my flow'll take you over\nMy ex, my ex, my expertism\nIs lyr, is lyr, is lyr, lyr-i-cism\nMy flow, my flow, my flow'll take you over\nMy, my flow'll take you over\nMy, my flow'll take you over, like\nMy, my flow'll take you over, like...", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}