{"songs": [{"title": "Thug Cry", "album": "Mastermind", "year": "2014-03-13", "lyrics": "[Produced by J.U.S.T.I.C.E. League]\n\n[Hook: Betty Idol]\nI just wanna be the one, I just wanna be the one you love\nI just wanna be the one you run to when you're down\nI just wanna, I just wanna fly, I'ma show you tonight\nThat I'mma put it on you baby, take you past the sky\n\n[Verse 1: Rick Ross]\nWake up in the world and I'm just another nigga\nCall it public housin' when you next door to the killers\nOn the corners, it gets better as you go\nGrind that mothafucka 'til it's yellow brick road\nFree as a bird, spoken word in my verse\nOn my knees prayin', niggas shootin' in the church\nWake up out my sleep in another cold sweat\nI lived on Billboard, where the fuck to go next?\nGo against the odds, youngin' go and get a job\nAnother country boy they want back on the farm\nSo far from my goals but I'm close to my kids\nThug cry for Mac Dre throwin' up the Thizz\n\n[Hook: Betty Idol]\nI just wanna be the one, I just wanna be the one you love\nI just wanna be the one you run to when you're down\nI just wanna, I just wanna fly, I'ma show you tonight\nThat I'mma put it on you baby, take you past the sky\nI just wanna burn\n\n[Verse 2: Lil Wayne]\nUhh, well let me light one for my problems\nSmokin' on that loud, pumpin' up that volume\nGet it crackin' like an eggshell in this mothafucka, make omelettes\nGet a bad bitch that posts up like comments\nThey don't know what I been through, don't know what I'm goin' through\nAs long as I get through, that's what I look forward to\nRicher than a bitch, but still I can't afford to\nLet these niggas play with me; need to be remorseful\nI swear I got that silencer on that Mac 9 and I kill these niggas with silence\nMy head stay in the clouds, I really feel like a giant\nCan't trust none of these niggas, I murk one of these niggas\nThen bury one of these niggas, still got dirt under my fingers\nAin't a threat, that's a bet\nCause they coming at my neck like the best a man can get\nBut to make a long, story short, I need a shoulder\nCause the devil on one, the other one I'm lookin' over\nTunechi...\n\n[Hook: Betty Idol]\nI just wanna be the one, I just wanna be the one you love\nI just wanna be the one you run to when you're down\nI just wanna, I just wanna fly, I'ma show you tonight\nThat I'mma put it on you baby, take you past the sky\nI just wanna burn\n\n[Verse 3: Rick Ross]\nI pray I live forever\nNiggas hatin' like it's Salt Lake City\nNo tints on that pretty ass Bentley\nWant you to know that them comments don't offend me\nCause your baby momma so friendly\nI proceed with the plan, weed in my hand\nCiroc in my cup, quick pic for a fan\nMoney over bitches, first nigga with a Wraith\nDouble M, we handle business cause them niggas getting raped\nGo get the yellow tape, it's well orchestrated\n200 acres estates, a young nigga made it\nCame from the hood, ain't nothing changed\nStill lemon pepper on my mothafuckin' wangs!\n\n[Hook: Betty Idol]\nI just wanna be the one, I just wanna be the one you love\nI just wanna be the one you run to when you're down\nI just wanna, I just wanna fly, I'ma show you tonight\nThat I'mma put it on you baby, take you past the sky\nI just wanna burn\n\n[Outro: Rick Ross]\nHuh! Mastermind\nAs I get high in the middle of the night\nSometimes I ask myself, do thugs cry?\nUhh, uhh, Mastermind, my 6th LP\nCan't believe we did it\nMan, I thank everybody that played a part of this\nShout out to my engineer E-Mix\nEach and every one of you supporters\nMy fans, 100", "image": "https://images.rapgenius.com/04e1159e7f387e2defeed19f757e4890.960x960x1.jpg"}], "artist": "Rick Ross"}