{"songs": [{"title": "Under Pressure", "album": null, "year": "2010-06-17", "lyrics": "[Verse 1: Dr. Dre]\nThe long-awaited Detox, trick\n‘Cause maybe I don’t wanna stop, maybe I don’t wanna quit\nMaybe I like hoes, maybe I don’t want a wife, maybe I’m psycho\nMaybe I’m crazy, maybe I’m strapped right now, just maybe\nMaybe it’s a relapse\nMaybe I’m high right now; where the weed at?\nMaybe this is ER\nMaybe I’m a real doc' and this is CPR\nMaybe we need to breathe some life in this shit\nMaybe we are the life of this shit\nMaybe I’m just crazy (Crazy)\nWhat they say? (What they say?) Sak pase (Sak pase)\nNap boulé (nap boulé) Ayyy\n\n[Interlude: Jay-Z]\nUgh, ahh\nDre, I think I need my sponsor\n\n[Verse 2: Jay-Z]\nI’m just outta contro-o-ol\nMaybe I got hoes, every little city I go, like Paco\nWe tryna grow, but I just can’t seen her\nI’m havin’ trouble cleanin’ up, I’m like FEMA\nAll these little haters got me back with the Nina\nGot me bringin’ guns to work, Gilbert Arenas\nUnh, I don’t know if it’s the Goose talkin’\nBut you know they say the liquor get your truth talkin’\nMaybe I should be somewhere in the group talkin’\nI’m addicted to coupes and takin’ roofs off ‘em\nI’m addicted to watches, Heckler and Koches\nThem bow-legged girls from the projects\nIt’s Bed-Stuy in this bitch (Bed-Stuy!)\nDre, what’s up? (It’s Westside over here)\nI’m in this party, I’m up to no good\nAnd I should be duckin’ these clubs, Tiger Woods\n\n[Verse 3: Dr. Dre]\nI smoke (I smoke), I drink (I drink)\nI’m supposed to stop, but I can’t\nNigga, don’t ask why (Ask why), I get high (I get high)\nI’m just livin’ my mo’fuckin’ life\nSo what? I’m drunk (I’m drunk)\nAnd I’m a weedhead (Weedhead)\nAnd I’ma treat every day like the weekend\nHeadfirst off the deep end\nYeah, you know what’s happenin’\nI’m just relapsin’", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}