{"songs": [{"title": "Money", "album": "Strictly Strange Tour 08", "year": "2008-01-01", "lyrics": "[Interlude 1]\nMuch love to all the DJs who showed us love on Absolute Power, man\nWell here comes Tecca Ninna\nImma tell, and I'm a playa\nHey Rob, turn me up, man, so I can get this poppin' in and out, man!\n\n[Verse 1]\nI started small time rap game, that's pain\nIcyRoc school of rap, I'm never wack, mane\nHad no jewelry, I was broke, but I was rhyming hard\nSo now you see me and I swerve with bodyguards\nQuick hasty, player haters, they face be\nWop-bobba-loo-bop-popped, we off safety\nCops know we do got knots, we lock pastries\nShock on a new hot knock, Rick Rock made me\nSquat in a new drop-top, they got shaky\nPa'tners and crew got hot, you shop Macy's\nCops know that you got spots and got babies\nShots poppin', your ma's loft is not tasty\nPlots on the new block, hops, you can't race me\nTop scholar who got props, I got [?]\nStop talkin', you not hot, do not wake me\nIf you got doo-wops, that does not make me money\n\n[Interlude 2]\nHahaha, that's beautiful!\nAnother Rick Rocker\nIf you want it, you gotta go get it\nMidwest, dirty south, east and west coast, feel this, man, this history in the making\nCome on\n\n[Verse 2]\nPark it, so much power, you can't stop this\nWatch list, that's why I stopped jumpin' in mosh pits\nJock this, fella who sell a lotta, that's awk-wihd\nHotness, toxic, homie, how can you not get profits?\nSo much fetti, baby, the cops get obnoxious\nSeeing my merchandise come in boxes\nThey hopped this status cuz me and Travis are bosses\nFrostbit, the ritz, glitz, lights, it cost it\nWatch, when I drop this, everybody gon' cop this\nOverseas creeds of many vanilla and chocolates\nGimme pennies and twenties, skinny minis and oxes\nBig women can get it, admit you hit it for knocks, trip\nIf you got spit, know that you can get relish\nBut if you sell it, just be ready when the spot hit\nAll the beef we got, we ain't squashed it\nCause they know we permanent currency and we got this (money!)\n\n[Interlude 3]\nYeah\nI'mma dedicate this last verse\nTo the late, great Mac Dre, man\nWe're gonna keep that thizzle dance cracking for you, baby!\nAnd sideshow every chance we get!\nRest in peace, regime life 'til I die!\n\n[Verse 3]\nFuried in Missouri; outside it, nobody knew me\nHaving no broccoli wasn't groovy\nSo I had to move to L-(scratch)-A\nYou got to sell away\nSo you can get the bills to pay\nCause everybody fails to pay\nWhen you're not a\nRapper who got a lotta\nMoney or women who steady in them Guccis and Pradas\nYou just a lowlife maggot gettin' money from Mama\nAnd when you broke, all you gettin' is drama\nThe world's piranhas if you a big fish\nBecause they nibble and nibble until you die\nBuggin' you 'til you buy\nThat's why we be stressin', poppin', puffin' until we high\nHysterical cause miracles need wings to fly\nMy God!\nYou can put this off in your iPod\nAfter you cop it, cause droppin' rockin's is my job\nLook at my wallet, you got it? I keep a nice wad\nGettin' bitches and dissin' bitches like Ty Cobb\n\n[Interlude 4]\nThis is Everready: The Religion\nStrange Music, 2005\nTech N9ne, baby\nFeel it", "image": "https://images.genius.com/586466b039012665fe78dadf7e51e25d.500x500x1.jpg"}], "artist": "Tech N9ne"}