{"songs": [{"title": "Blood Pressure", "album": "We Are the Streets", "year": "2000-01-25", "lyrics": "[Intro]\nThe headphones is on fire dis time around, Styles\nMy blood pressure is building\nYo, last time I'mma tell these niggas, man\nNiggas can't fuck around me\nJada, man, whoever, old nigga, new nigga\n\n[Verse 1]\nWho really the best rapper since B.I.G. ain't here\nY'all know the answer to dat when Kiss in here\nWhen you see me, don't ask me nothin' about us\nAnd don't definitely ask me nothin' about\nFuck it, you owe me one, I owe you two\nI woulda' smacked you with the burner, but I know you'd sue\nAnd I ain't talkin' to him, I'm talkin to you\nMatter of fact, I'm talkin' to y'all\nLife is like walkin' a yard\nNiggas will stab you with a fork in the heart\nAnd The Source got muthafuckas thinkin' they hot\nLike my dope, got fiends thinkin' they shot\nWhen you thinkin of da best, nigga, think of The Lox\nI'll cut your fuckin' hand off if your pinky ring is hot\nThen come through your block in a sticky green drop\nHop out, let off fifty-three shots\nWouldn't care if I hit fifty-three cops\nGuliani might as well be murkin' niggas\nCause the time that he givin' out is hurtin' niggas\nAnd all these record label's jerkin' niggas\nAnd you never was a thug, you's a workin' nigga\nAnd you heard that shit right there? I started that\nDon't make me put somethin' up in your Starter hat\nNo matter who you are, or where you from, screw all of that\nI'm not tryin to hear that, son\n\n[Chorus]\nNow, who the fuck y'all want? (Jadakiss!)\nAnd who the fuck y'all need? (Jadakiss!)\nAnd who the fuck gon' bleed?\nAll y'all haters\nCause none of y'all niggas can't fuck with Jada\nNow, who the fuck y'all want? (Jadakiss!)\nAnd who the fuck y'all need? (Jadakiss!)\nAnd who the fuck gon' bleed?\nAll y'all haters\nCause none of y'all niggas can't fuck with Jada\n\n[Verse 2]\nDon't you be that clown nigga in the back of the whip\nThat's gon' get the second half of the clip\nAnd all I'm sayin, it'll be da other nigga in the front of the da whip\nRunnin his lip, wit a gun on his hip, feel me dawg?\nEverybody walk da walk 'til they run into Kiss\nThen, they get stabbed, or hung, or stung wit da fifth\nHow you think ya man hard when son on my dick?\nCuz I can get his ass body, plus front him a brick\nGot a chick named Superhead, she give super-head\nJust moved in the buildin', even gave the super head\nI cop big guns that spit super lead\nSo play Superman, end up super dead\nCall me Kiss, or da kid from The Lox\nThat'll twist ya moms out and do a bid wit ya pops\nWe was in jail, you probably won't get no mail\nAnd if you pumped on my block, you won't get no sales\nWhen ya CEO know you can't fuck wit I\nI make a million by June, I'm sayin fuck July\nAnd I beg you to try me while I'm holdin da Tommy\nI'mma have ya body all over da lobby\nI already helped y'all, I'm about to melt y'all\nTell the truth, dawg, I ain't never felt y'all\nThis album, we gon' bubble like Seltzer\nIf it ain't Double R, who da hell else is hard?!\n\n[Chorus]\nNow, who the fuck y'all want? (Jadakiss!)\nAnd who the fuck y'all need? (Jadakiss!)\nAnd who the fuck gon' bleed?\nAll y'all haters\nCause none of y'all niggas can't fuck with Jada\nNow, who the fuck y'all want? (Jadakiss!)\nAnd who the fuck y'all need? (Jadakiss!)\nAnd who the fuck gon' bleed?\nAll y'all haters\nCause none of y'all niggas can't fuck with Jada", "image": "https://images.genius.com/7cbd6acc7e0d63bd0c31a4160d0805f6.820x820x1.jpg"}], "artist": "Jadakiss"}