{"songs": [{"title": "Buy You Some", "album": "Gettin’ It (Album Number Ten)", "year": "1995-11-21", "lyrics": "[Erick Sermon]\nWhoo! Ah ah ah, (yeah, yeah) ayahh, ahh ahh ahh\nAnd you don't stop, ahh ahh, word is bond, word is bond\nNow introducing the sound from the ghetto\nE Double and Too $hort, what the fuck you thought?\nI come with the ruckus, It's My Thing when I swing\nI'm Born to Mack, always strapped, with the black gat\nWho out there I swear boy wanna get touched\nRoll up, and catch a slug to the chest, so DUCK\nI talk the talk, walk the walk, now nigga\nFive hundred S drivin with hand on trigger\nCrazy Lestat, check my track record\nEverything I touch is gold since eighteen years old\nSo what that mean? I roll the blunt\nAnd puff the indo smoke in it, I trip in a minute\nCrazy holy doctor holdin me cuz I be rockin B\nSewin up like Monopoly, nobody's stoppin me\nDig it, Funkdafied like Brat, how's that?\nI stick and move on tracks while I smoke a twenty sack\nWho said the E can't rock? That's bullshit\nSuck my dick and get a big fat lick of my balls\nYou wanna brawl? Punk I thought not\nYou might get beat down and stomped like Sasquatch\nYour girl, like Keith Sweat, I wanna fuck her\nPsych, I already stuck her\nI got rhymes to make your whole head swell up\nHere's an icepack homeboy shut the hell up\nI rock the mic with Too $hort, y'all niggas know what's happenin\nEverything he touch goes platinum\nEyeeaaaah!\n\n[Too $hort]\nI made a half a million in a week\nAnd every nigga on the street got a tape playin me\nYou can't believe it? Erick Sermon, rollin with $hort\nRolled from California all the way to New York\nIn big Benzes, G-50 up\nNow we trying to squash all that East/West stuff\nWe spent years in the studio makin funky tracks\nSigned a bunch of niggas with some tight ass raps\nIt's like Father Dom, it's like Keith Murray\nMakin millionaires but it ain't no hurry\nCuz we all in it for the long run\nI won't leave the studio until a song's done\nAnd ain't nuthin really hard about gettin my cash\nA big phat house with a million stash\nYou other niggas got this rap game distorted\nGivin DATs to the label, straight gettin shorted\nClaim you're gettin paid, but I can't tell\nYou keep rappin in my ear got me mad as hell\nYou talk a good game but I don't believe in you\nBe smokin lotta blunts but I got more weed than you\nI guess I see you on the charts in the meanwhile\nAnother face in the crowd plus some freestyle\nWishin you could be in the light\nPromoters pay me ten G's just to breathe on the mic\nBitch! $hort Dawg puttin it down with the E Double\n\n[Erick Sermon]\nShhhhh!\nYou remind me of my phat gold chain\nSome of y'all are just small change\nBe a boss with true true game (yeah, yeah)\nDig this y'all, my Music is Dangerous\nAtomic Dog, coming through the smog with $hort Dawg\nAhhh! Quick with the trig Jack be nimble\nI shoot like G Mob goes liftin through my window\nChik chik pow! How you like me now?\nThe man in the mirror it don't get no clearer\n$hort Dawg, the E Double, and Breed we roll thick\nLike girls in C.A.U. with the good power-U\nOwww! Money is the key to fame\nSo I can live it up with the girls on Soul Train\nThe impact, major league dough like Dave Justice\nYo Breed, $hort Dawg, show em how we bust this\n\n[Too $hort]\nLike some true pioneers, don't forget it\nPut the money on the table, let's split it\nWe got enough G's here to make us both happy\nTell them fans we ain't runnin no coke factory\nIt's $hort Dawg the real pimp of the century\nGirls get wet every time somebody mention me\nI was known for my mackin back in eighty-four\nI want it all, that's what I keep stackin for\nHave things that a rapper never dreamed of havin\nAnd I can tell them how to get it just keep rappin\nLife's a battle, headed for the new sun\nSo many ways to get paid, you got ta choose one\n\n[MC Breed]\nNow some of the ways to get paid out is runnin your mouth\nThat street life will keep me tight, I'm talkin bout\nGettin green, dolla dolla bills y'all\nThat's on the real, somethin you can feel y'all\nMany claim to have game but you can get that on sale\nBut ain't nuthin they sellin to you but Arbor and Gail\nI mean Sprinkle Me homey cuz I'm bout dollars and cents\nAnd if you ain't haulin dollars well you ain't holler\nIn FlintI'd rather dip dip dive, so-socialize\nGet loot from the Great Lakes, West to Eastside\nYou tramp, trick, HACH I spit\nUndergrade if you ain't gettin paid like this\n\n[Kool-Ace]\nThe hours of the ATL paves my name\nSpittin Mr. Macker izzer are you still in the game\nSee I gets paid by the movement of the cut\nI've been summoned by the cancer, to testify and bless\nIt's that, big mack, like scripture is a phat Kodeje?\nSo hide your ho from me\nSouthern am-bassador, knockin at your door\nLeadin a click that's true, checkin knowin all fifty-two\nSee, all you tricks, best behave\nIt's that Southern nigga mack from the city of the Brave\nI got the platinum caul, yes yes y'all\nSo plant me with the green and them hoes and we can big ball\nYeah, now we rollin four deep\nDouble dosin, relaxin, and maxin to $hort and these beats\nE Double, $hort Dawg, Kool Ace\nIn the place, and be all but bring you straight horror\n\n[Outro: Too $hort]\nRepresentin money Buy you some nigga", "image": "https://images.genius.com/acd3b8c78a97a7776f08f3ab268b28c1.300x299x1.jpg"}], "artist": "Too $hort"}