{"songs": [{"title": "MTV VMA 2018 Performance", "album": null, "year": "2018-08-20", "lyrics": "[Part I - \"STARGAZING\"]\n\n[Chorus: Travis Scott]\nRollin', rollin', rollin', got me stargazin' (yeah)\nSippin' on purp, feelin' like the Barre Baby (it's lit)\nWhatever I downed, it got me goin' crazy (yah)\nPsychedelics got me goin' crazy (alright)\n\n[Post-Chorus: Travis Scott]\nI was hot as hell up in the heat (yeah, yeah)\nThen this storm came in to save my life\nMeditate, just got down on my knees (straight up)\nOut of nowhere, you came here to stay the night\nIn the nighttime, in the nightime (woo, yeah)\n\n[Part II - \"STOP TRYING TO BE GOD\"]\n\n[Bridge: James Blake]\nIs it the complex of the saint\nThat's keepin' you so, so, so still?\nIs it a coat of old paint\nThat's peelin' every day against our will?\nIs it too long since the last\nOpen conversation you had? Oh, no\nAnd did you see the void in the past?\nAnd can you ever see it comin' back?\nWell, can you always be a step ahead of it for me?\nWell, can you always be a step ahead of it for me?\n\n[Part III - \"SICKO MODE\"]\n\n[Verse 1: Travis Scott & (Notorious B.I.G)]\nYeah, yeah, yeah, yeah, yeah\nMade this here with all the ice on in the booth\nAt the gate outside, when they pull up, they get me loose\nYeah, Jump Out boys, that's Nike boys, hoppin' out coupes\nThis shit way too big when we pull up give me the loot\n(gimme the loot!) Was off the Remy, had a Papoose\nHad to hit my old town to duck the news\nTwo four hour lockdown, we made no moves\nNow it's 4 AM and I'm back up poppin' with the crew\nI just landed in, Chase B mix this pop like Jamba Juice\nDifferent colored chains, think my jeweler really sellin' fruits\nAnd they chokin', man, know the crackers wish it was a noose\n\n[Bridge: Big Hawk & Swae Lee]\nSome—some—some, someone said\nTo win the retreat, we all in too deep\nPl—pl—playin' for keeps, don't play us for weak (someone said)\nTo win the retreat, we all in too deep\nPl—pl—playin' for keeps, don't play us for weak\n\n[Verse 2: Travis Scott, Swae Lee & Uncle Luke]\nNo, no, no, no, no\nThis shit way too formal, y'all know I don’t follow suit\nStacey Dash, most of these girls ain't got a clue\nAll of these hoes I made off records I produced\nI might take all my exes and put 'em all in a group\nHit my esés, I need the bootch\n'Bout to turn this function to Bonnaroo\nTold her \"hop in, you comin' too\"\nIn the 305, bitches treat me like I'm Uncle Luke\n(Don't stop, pop that pussy!)\nHad to slop the top off, it's just a roof, uh\nShe said \"where we goin'?\" I said \"the moon\"\nWe ain't even make it to the room\nShe thought it was the ocean, it's just the pool\nNow I got her open, it's just the Goose\nWho put this shit together? I'm the glue (someone said)\nShorty FaceTimed me out the blue\n\n[Bridge: Big Hawk & Swae Lee]\nSomeone said\nPl—playin' for keeps\nSomeone said, motherfucker—someone said\nDon't play us for weak\n\n[Outro: Travis Scott]\nRest in peace the queen of soul, Aretha Franklin\nASTROWORLD number one, right now\nVMA make some noise\nYes, sir", "image": "https://images.genius.com/6cb5fa8980e9b5cbb712b063ed605bda.1000x1000x1.jpg"}], "artist": "Travis Scott"}