{"songs": [{"title": "U Know", "album": "Restless", "year": "2000-12-12", "lyrics": "[Intro: Xzibit]\nMost niggas get it confused right? Huh, they think it's all chronic and palm trees out this mothafucka, bitches and bikinis, listen, huh\n\n[Verse 1: Xzibit]\nSome niggas is better left alone\nI place you underneath the very ground you walkin' on\nAnd ain't no children in this motherfucker, drop your tone\nAin't got no business even fuckin' with no microphones\nSo yo, it's me against the world, and ain't got shit to lose\nMy heavy artillery built to make the masses move\nI carry tools that'll pick you up and out your shoes\nXzibit bringin' new meanin' to alcohol abuse\nI wanna fall up in the spot where all the bitches at\nHoldin' somethin' heavy to help you straighten out your back\nA couple of drinks and I bend you over the kitchen sink\nSo what, you think I owe you somethin' bitch for fuckin' me?\n(Bitch) Get a grip, misery love company, check it\nXzibit show you the difference between real life and makin' a record\nMakin' the moves and connections that you never expected\nWhat good is money and the fame if you never respected\nCheck it out\n\n[Chorus: Dr. Dre & (Xzibit)]\nYou know, who's runnin' these fuckin' streets\n(You get involved, you gettin slapped with the heat nigga)\nDon't be actin' like your shit don't stink (c'mon)\nY'all ain't fuckin' with X\nYou know, we roll so fuckin' deep\n(Yeah round after round in the middle of the street niggas)\n'Cause you're actin' like your shit don't stink\n\n[Verse 2: Xzibit]\nYo, I ain't afraid of them fuckin' invisible gats\nYou always bringin' out in your raps\nMy shit'll quickly make you fold and collapse\nMy goal to strictly takin' over the map, by any means\nHustle and make more tracks than a heroin fiend\nKeep my enemies on a first name basis\nAnd hate them niggas like a skinhead racist\nChuck Taylors and fat laces\nStompin' hoes through y'all turf\nI hurt worse than actual childbirth\nA chick can suck my dick 'til the big squirt (Ah-Ah!)\nThe song work, so ain't no playin' wit us\nFindin out where you rest your head and I'm sprayin it up\nThe remains that's left behind can probably fit in a cup\nYou pressin' your luck, you makin' yourselves easy to touch\nI'm from the home of the hit 'em up, only two ways\nYou droppin' some shells or you get 'em up, back in the days\nThere was a time there was this woman that I want to keep up\nBut nowadays when I see you I'm just tryin' to fuck\nSo check it out\n\n[Chorus: Xzibit & (Dr. Dre)]\nYou know, who's runnin' these fuckin' streets\n(The king of these West Coast gangsta beats niggas)\nAlways droppin' straight heat so stay the fuck out of the way\nYou know, we roll so fuckin' deep\n(Round after round in the middle of the street niggas)\n'Cause you're actin' like your shit don't stink\nY'all ain't fuckin' with Dre\n\n[Verse 3: Dr. Dre]\nThangs just ain't the same since he came out\nTwo thousand and one, came blew the game out\nI heard you was hot, blew your flame out\nAnd got the nerve to believe you hold the same clout\nI thought I told you, keep my name out of your fuckin' mouth\n(But Dr. Dre!) See that's exactly what I'm talkin' bout\nThat shit right there, that's all day long\nJust don't stop, I gots to be alone at the top\nForever ready loaded and locked, with niggas that'll circle yo' block\nAnd let 'em pop 'til some bodies get dropped\nIt's Doc Holiday in the flesh\n(Still) Hold it down, represent, resurrect the West\n(Still) Holdin' ground, touchin' down, with my nigga X\n(Still) Send a couple through yo' chest if you disrespect\nDr. Dre comin' back (shit) I never left\nThe number one ranked highest paid celebrity guest\nThat's eight digits, motherfuckers\n\n[Chorus: Dr. Dre & (Xzibit)]\nYou know, who's runnin' these fuckin' streets\n(You get involved, you gettin slapped with the heat nigga)\nDon't be actin' like your shit don't stink (c'mon)\nY'all ain't fuckin' with X\nYou know, we roll so fuckin' deep\n(Yeah round after round in the middle of the street niggas)\n'Cause you're actin' like your shit don't stink (Yo)\nY'all ain't fuckin' with X", "image": "https://images.genius.com/4e938672ba331b168f4f463f35fdd247.637x637x1.jpg"}], "artist": "Xzibit"}